{
  "ground_truth": "Harry sees something shining in the distance and moves towards it as Viktor tries to zap him but misses, and then Harry ducks and Viktor gets zapped by Cedric. Cedric runs up and kicks the wand out of Viktor's hand and points his wand at Viktor's body as if to finish him off. Harry runs up and intervenes, and they struggle before the two of them begin running towards the cup. The undergrowth grabs Cedric and he falls to the ground, causing Harry to look back and see Cedric is pinned down with no means of escape. Harry zaps the plant life, helping Cedric wriggle free, and then assists him up. The wind starts blowing again, and Harry and Cedric have ported to a graveyard. Harry lets out a shout and holds his head in pain, as Wormtail and Voldemort appear nearby. Wormtail casts a spell and kills Cedric, leaving Cedric dead on the ground. Wormtail pulls Harry closer and a statue grabs hold of Harry, trapping him. Wormtail drops something into a cauldron as Harry watches, and a bone hovers in the air under Wormtail's control, dropping into the cauldron. Wormtail slashes his arm over the cauldron, and then takes the knife to Harry, cutting at his arm, prompting Harry to shout. Wormtail lets the drops fall into the cauldron, which bursts into flame, and a reformed Voldemort emerges. Wormtail hands him the wand and bows deeply, looking concerned but doing it anyway, before Voldemort sticks the wand into Wormtail's arm. The sky changes as others are summoned, and Voldemort begins slashing angrily at the hooded figures before granting Wormtail a new hand. As Harry struggles to get free, Voldemort puts his hand on Harry's head, making him scream, and then forces Harry to bow with magic, casting at him so he wriggles in pain. Voldemort pulls Harry to his feet, and as Harry begins to move away, he takes steps toward Voldemort. They both cast and their streams of magic meet, and they struggle as shapes form in the surrounding magical energy. The connection breaks and Harry runs over to Cedric's body, summoning the cup over to them, and in an instant they port out. Voldemort looks angry as Harry appears with Cedric's body back at the arena, where Harry weeps on Cedric's body as Amos breaks down wailing and the crowd looks on distraught. Mad-Eye Moody enters, closing the door behind him while Harry is still sobbing in the room. They sit, and Harry nods as we see his arm marked with a skull and snake. Mad-Eye starts shaking and struggling for air, reaching for his empty bottle before rushing to a chest with other bottles, struggling to find one. A flash of magic occurs and Mad-Eye is knocked into the wall.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sure, here is the transformed text with synonyms:\n\nHarry observes something gleaming in the expanse and advances towards it as Viktor attempts to blast him but misses, and then Harry bends and Viktor gets blasted by Cedric. Cedric dashes up and kicks the wand out of Viktor's grasp and aims his wand at Viktor's form as if to finish him off. Harry dashes up and intervenes, and they grapple before the two of them commence sprinting towards the trophy. The undergrowth seizes Cedric and he collapses to the terrain, causing Harry to glance back and see Cedric is pinned with no method of escape. Harry blasts the vegetation, aiding Cedric to squirm free, and then assists him up. The breeze starts gusting again, and Harry and Cedric have ported to a cemetery. Harry lets out a cry and clutches his head in agony, as Wormtail and Voldemort materialize nearby. Wormtail conjures a spell and slays Cedric, leaving Cedric lifeless on the terrain. Wormtail drags Harry nearer and a monument seizes hold of Harry, entrapping him. Wormtail drops something into a cauldron as Harry observes, and a bone hovers in the atmosphere under Wormtail's influence, dropping into the cauldron. Wormtail slashes his arm over the cauldron, and then takes the dagger to Harry, cutting at his arm, prompting Harry to cry out. Wormtail lets the droplets fall into the cauldron, which erupts into flame, and a reformed Voldemort emerges. Wormtail hands him the wand and bows deeply, appearing worried but doing it nevertheless, before Voldemort inserts the wand into Wormtail's arm. The sky alters as others are summoned, and Voldemort begins slashing intensely at the hooded figures before granting Wormtail a new hand. As Harry struggles to get free, Voldemort places his hand on Harry's head, making him scream, and then forces Harry to bow with sorcery, casting at him so he squirms in agony. Voldemort pulls Harry to his feet, and as Harry begins to move away, he takes steps toward Voldemort. They both cast and their streams of magic meet, and they struggle as shapes form in the surrounding mystical energy. The connection fractures and Harry dashes over to Cedric's body, summoning the trophy over to them, and in a moment they port out. Voldemort looks irate as Harry appears with Cedric's body back at the arena, where Harry weeps on Cedric's body as Amos breaks down wailing and the throng looks on distraught. Mad-Eye Moody enters, closing the door behind him while Harry is still sobbing in the chamber. They sit, and Harry nods as we see his arm marked with a skull and serpent. Mad-Eye starts shaking and struggling for air, reaching for his vacant bottle before rushing to a chest with other bottles, struggling to find one. A flash of magic ensues and Mad-Eye is knocked into the barrier."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Something shining in the distance is seen by Harry, and it is moved towards by him as a zap is tried by Viktor but missed, and then Harry ducks and Cedric zaps Viktor. Viktor's hand has the wand kicked out of it by Cedric, who then points his wand at Viktor's body as if to finish him off. Harry intervenes by running up, and a struggle occurs before the cup is run towards by the two of them. Cedric is grabbed by the undergrowth, and he is caused to fall to the ground, which makes Harry look back and see Cedric pinned down with no means of escape. The plant life is zapped by Harry, allowing Cedric to wriggle free, and then he is assisted up by Harry. The wind starts blowing again, and Harry and Cedric port to a graveyard. A shout is let out by Harry and his head is held in pain, as Wormtail and Voldemort appear nearby. A spell is cast by Wormtail, killing Cedric, and Cedric is left dead on the ground. Harry is pulled closer by Wormtail, and a statue grabs hold of Harry, trapping him. Something is dropped into a cauldron by Wormtail as Harry watches, and under Wormtail's control, a bone hovers in the air, dropping into the cauldron. Wormtail's arm is slashed over the cauldron, and then the knife is taken to Harry, cutting at his arm, prompting a shout from Harry. The cauldron is let to catch the drops by Wormtail, which bursts into flame, and Voldemort emerges reformed. The wand is handed to Voldemort by Wormtail, who bows deeply, looking concerned but doing it anyway, before Wormtail's arm is stuck with the wand by Voldemort. As the sky changes, others are summoned, and the hooded figures are slashed angrily at by Voldemort before Wormtail is granted a new hand. As Harry struggles to get free, Voldemort's hand is placed on Harry's head, making him scream, and then Harry is forced to bow with magic, a spell cast at him so he wriggles in pain. Harry is pulled to his feet by Voldemort, and as Harry moves away, steps are taken by him toward Voldemort. They both cast and their streams of magic meet, and they struggle as shapes form in the surrounding magical energy. The connection breaks and Harry runs over to Cedric's body, summoning the cup over to them, and in an instant, they port out. Voldemort looks angry as Harry appears with Cedric's body back at the arena, where Cedric's body is wept on by Harry as Amos breaks down wailing and the distraught crowd looks on. Mad-Eye Moody enters, closing the door behind him while Harry is still sobbing in the room. They sit, and Harry nods as a skull and snake mark is seen on his arm. Mad-Eye starts shaking and struggling for air, reaching for his empty bottle before a chest with other bottles is rushed to, struggling to find one. Magic flashes, and Mad-Eye is knocked into the wall."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Harry notices something shining in the distance and moves toward it as Viktor attempts to zap him but misses. Harry ducks, and Viktor is zapped by Cedric, who then kicks Viktor's wand away and aims his own wand at Viktor. Harry intervenes, and they struggle before both dash toward the cup. Cedric is ensnared by undergrowth and falls, prompting Harry to rescue him by zapping the plants and helping him up. Suddenly, wind blows and they are transported to a graveyard. Harry screams in pain as Wormtail and Voldemort appear. Wormtail casts a spell, killing Cedric. He drags Harry to a statue that traps him, dropping items into a cauldron while a bone hovers and falls in. Wormtail cuts his and Harry's arms, letting the blood drip into the cauldron, which ignites as Voldemort reforms. Wormtail gives Voldemort the wand, bowing deeply, and Voldemort embeds the wand in Wormtail's arm. The sky changes as others appear, and Voldemort slashes at them, then grants Wormtail a new hand. As Harry struggles, Voldemort forces him to bow and wriggle in pain with magic. Voldemort pulls Harry up, and as Harry moves, they both cast, their magic streams connecting. Shapes form in the magical energy before the connection breaks. Harry runs to Cedric's body, summoning the cup, and they port out. Voldemort looks furious as Harry appears back at the arena with Cedric's body. Harry weeps as Amos wails and the crowd watches in anguish. Mad-Eye Moody enters, closing the door as Harry sobs. They sit, and Harry nods, revealing his arm marked with a skull and snake. Mad-Eye shakes and gasps for air, reaching for an empty bottle, then rushes to find another. A flash of magic knocks Mad-Eye into the wall."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Harry sees something shining and moves toward it as Viktor misses him with a spell. Harry ducks, and Cedric zaps Viktor, kicking the wand from his hand and aiming his own at Viktor. Harry intervenes, and they run toward the cup. Cedric is trapped by undergrowth, but Harry frees him. They are ported to a graveyard where Wormtail and Voldemort appear. Wormtail kills Cedric and traps Harry with a statue, casting ingredients into a cauldron. Wormtail cuts Harry’s arm, causing him to shout, as the cauldron bursts into flames and Voldemort emerges. Wormtail gives him the wand, and Voldemort cruelly marks Wormtail while summoning others. He forces Harry to bow and casts at him, causing pain. Both duel, and their magic collides, forming shapes. Harry breaks free, retrieves Cedric’s body, and ports out with the cup. Back at the arena, Harry weeps over Cedric’s body while Amos wails and the crowd is distraught. Mad-Eye Moody enters, and Harry shows him his marked arm. Mad-Eye struggles to find a potion, is hit by magic, and knocked into a wall."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Harry, with keen eyes, notices something gleaming in the far-off distance. Driven by curiosity, he begins to move towards it. Meanwhile, Viktor, determined to hinder Harry, attempts to zap him with a spell but, fortunately for Harry, misses his mark. Harry quickly ducks out of harm’s way, and in a twist of fate, Viktor becomes the unintended target, getting hit by Cedric's spell. Cedric, seizing the opportunity, dashes forward and decisively kicks Viktor's wand from his grasp, preparing to finish the confrontation by aiming his own wand threateningly at Viktor. In the nick of time, Harry rushes up and intervenes in the situation, leading to a brief struggle between them before they both decide, with urgency, to sprint towards the coveted cup. However, in their dash, the undergrowth comes alive and entangles Cedric, causing him to fall heavily to the forest floor. Harry, glancing back, realizes Cedric is hopelessly pinned down without any chance of getting loose. In a swift move, Harry zaps the entangling plant life, assisting Cedric to wriggle free, and then helps him to his feet once more. \n\nSuddenly, the wind begins to pick up again, and before they know it, Harry and Cedric are transported to a grim, eerie graveyard. Harry immediately lets out a shout of pain and clutches his head, just as Wormtail and Voldemort make their menacing appearance nearby. Without hesitation, Wormtail casts a deadly spell, tragically ending Cedric's life as he falls lifelessly to the ground. Wormtail then drags Harry closer, and a sinister statue clamps down on Harry, preventing any escape. As Harry watches intently, Wormtail drops an unknown object into a bubbling cauldron, and a bone, under Wormtail's magical control, hovers eerily in the air before dropping silently into the mix. Wormtail, not stopping there, slashes his own arm over the cauldron and then sharply turns the blade upon Harry, cutting his arm and causing Harry to cry out in pain. The blood droplets fall into the cauldron, which erupts into flames, and from within emerges a reformed, ominous Voldemort. Wormtail, visibly anxious yet obedient, hands over the wand to Voldemort and bows deeply. Despite his clear apprehension, Wormtail complies as Voldemort drives the wand into Wormtail's arm. \n\nThe sky above shifts ominously, and as others are summoned to the scene, Voldemort, filled with rage, slashes at the hooded figures encircling him before granting Wormtail a new, magical hand. Meanwhile, Harry, struggling against his restraints, cries out as Voldemort places a cold hand on his head, intensifying his screams of agony as he is forced to bow magically, writhing in pain from the relentless casting. Voldemort then hauls Harry to his feet, and as Harry attempts to edge away, he finds himself stepping closer to Voldemort. When they both cast their spells, their streams of magic collide, creating a powerful connection, and they struggle as ghostly shapes begin to form in the ethereal magical radiance around them. The connection abruptly breaks, and Harry seizes the moment, sprinting over to Cedric's lifeless body. Summoning the cup with determination, they are whisked away instantly. \n\nVoldemort appears infuriated, watching as Harry reappears with Cedric’s body back in the bustling arena. Overcome with emotion, Harry weeps over Cedric's lifeless form while Amos wails in heart-wrenching despair, the crowd around them looking on in stunned sorrow. It's then that Mad-Eye Moody arrives, slipping into the room and closing the door behind him. Harry continues sobbing as they sit together, and Harry nods, revealing his arm marked ominously with a skull and snake. Suddenly, Mad-Eye begins to shake uncontrollably, gasping for air as he desperately reaches for his empty flask. In a frantic rush, he stumbles to a chest filled with other bottles, struggling to find one that isn’t empty. Without warning, a flash of magic explodes, and Mad-Eye is hurled against the wall, ending the intense moment."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Harry, with his sharp and keen eyes, notices something bright and gleaming in the far-off distance, catching his attention. Driven by an intense curiosity, he feels compelled to begin moving towards this mysterious object. Meanwhile, Viktor, consumed with determination to hinder Harry's progress, attempts to cast a spell in Harry's direction, but, fortunately for Harry, Viktor's aim is off, and the spell misses its intended target. Harry quickly ducks, evading harm, and in an unexpected twist of fate, Viktor becomes the unintended target, finding himself hit by a spell cast by Cedric. Seizing the opportunity, Cedric dashes forward decisively and kicks Viktor's wand from his grasp, preparing to finish the confrontation by aiming his own wand threateningly at Viktor. In the nick of time, Harry rushes up and intervenes in the situation, leading to a brief struggle between them before they both decide, with a shared urgency, to sprint towards the coveted cup. However, during their rapid dash, the undergrowth comes alive, entangling Cedric and causing him to fall heavily to the forest floor. Harry, glancing back, realizes that Cedric is hopelessly pinned down without any chance of escape. In a swift move, Harry zaps the entangling plant life, assisting Cedric in wriggling free, and then helps him to his feet once more.\n\nSuddenly, the wind begins to pick up again, and before they realize what is happening, Harry and Cedric find themselves transported to a grim, eerie graveyard. Harry immediately lets out a shout of pain and clutches his head, just as Wormtail and Voldemort make their menacing appearance nearby. Without hesitation, Wormtail casts a deadly spell, which tragically ends Cedric's life as he falls lifelessly to the ground. Wormtail then drags Harry closer, and a sinister statue clamps down on Harry, effectively preventing any chance of escape. As Harry watches intently, Wormtail drops an unknown object into a bubbling cauldron, and a bone, under Wormtail's magical control, hovers eerily in the air before dropping silently into the mix. Wormtail, not stopping there, slashes his own arm over the cauldron and then sharply turns the blade upon Harry, cutting his arm and causing Harry to cry out in pain. The blood droplets fall into the cauldron, which erupts into flames, and from these flames emerges a reformed, ominous Voldemort. Wormtail, visibly anxious yet obedient, hands over the wand to Voldemort and bows deeply. Despite his clear apprehension, Wormtail complies as Voldemort drives the wand into Wormtail's arm.\n\nThe sky above shifts, growing ominously dark, and as others are summoned to the scene, Voldemort, filled with rage, slashes at the hooded figures encircling him before granting Wormtail a new, magical hand. Meanwhile, Harry, struggling against his restraints, cries out as Voldemort places a cold hand on his head, intensifying his screams of agony as he is forced to bow magically, writhing in pain from the relentless casting. Voldemort then hauls Harry to his feet, and as Harry attempts to edge away in desperation, he finds himself stepping ever closer to Voldemort. When they both cast their spells, their powerful streams of magic collide, creating an intense connection, and they struggle as ghostly shapes begin to form in the ethereal magical radiance surrounding them. The connection abruptly breaks, and Harry seizes the moment, sprinting over to Cedric's lifeless body. Summoning the cup with determination, they are whisked away instantly.\n\nVoldemort appears infuriated, watching, as Harry reappears with Cedric’s lifeless body back in the bustling arena. Overcome with emotion, Harry weeps sorrowfully over Cedric's body while Amos wails in heart-wrenching despair, the crowd around them looking on in stunned sorrow. It's then that Mad-Eye Moody arrives, slipping into the room and quietly closing the door behind him. Harry continues to sob as they sit together, and Harry nods, revealing his arm ominously marked with a skull and snake. Suddenly, Mad-Eye begins to shake uncontrollably, gasping for air as he desperately reaches for his empty flask. In a frantic rush, he stumbles over to a chest filled with other bottles, struggling to find one that isn’t empty. Without warning, a flash of magic explodes, and Mad-Eye is hurled against the wall, abruptly ending the intense moment."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As Harry stands attentively, he spots something gleaming in the distance, capturing his curiosity and prompting him to move towards it with determination. Meanwhile, Viktor, with a hurried attempt to stop him, aims his wand and releases a zapping spell at Harry. The spell, however, misses its target as Harry instinctively ducks just in time. In a swift turn of events, Viktor finds himself the new focus of Cedric's spell, which successfully zaps him. Capitalizing on this moment, Cedric sprints up to Viktor, his footsteps quick and purposeful, and decisively kicks the wand out of Viktor's grip. He then brandishes his own wand, directing it firmly at Viktor's body with an intention that suggests he might finish him off. In a flurry of activity, Harry rushes forward, his urgency clear in his movements, and intervenes in the impending conflict. The two boys, caught in a brief struggle, jostle for control before finally deciding to join forces, launching into a rapid sprint towards the cup. Suddenly, the ground beneath them turns treacherous as the undergrowth comes alive, ensnaring Cedric and yanking him downwards with an inescapable hold. This unexpected turn causes Harry to halt, glancing back to find Cedric desperately pinned, bereft of any chance to liberate himself. With quick thinking, Harry directs a precise zap of magic at the entangling plant life, loosening its grip and allowing Cedric the freedom to wriggle out. Harry then extends a helping hand, pulling Cedric up to his feet. As they regain their composure, an eerie wind sweeps through, and in the blink of an eye, both of them find themselves transported to a somber graveyard. Harry's immediate response is a loud shout, his hands clutching his head in agony, as Wormtail and Voldemort materialize ominously nearby. Without hesitation, Wormtail casts a deadly spell, targeting Cedric and leaving him lifeless on the ground. Seizing the advantage, Wormtail roughly draws Harry nearer, and with a chilling inevitability, a statue clasps Harry, securing him in place. Wormtail proceeds with his dark ritual, dropping a mysterious object into a bubbling cauldron under Harry's watchful eye. A bone, suspended in mid-air under Wormtail's magical command, drops effortlessly into the cauldron, adding to the sinister brew. With a deliberate motion, Wormtail cuts his own arm over the cauldron, letting the blood drip before turning the blade on Harry, slicing into his arm and eliciting a pained shout from him. Droplets from Harry's wound are added to the mixture, which erupts into flames, ushering the emergence of a newly reformed Voldemort. Wormtail, despite his evident apprehension, reverently hands Voldemort a wand and bows deeply. Voldemort, with an authoritative gesture, embeds the wand into Wormtail's arm. With a flicker of dark magic, the sky morphs ominously as summoned followers arrive. In a display of power, Voldemort lashes out at the hooded figures before bestowing upon Wormtail a new hand. Meanwhile, Harry struggles feverishly against his constraints, but Voldemort, with a malevolent touch, places his hand on Harry's head, forcing a scream from him and then magically compels Harry into a bow, inflicting pain that makes him writhe. Dragging Harry to his feet, Voldemort watches as Harry, driven by an inner resolve, begins to retreat but instead steps towards Voldemort. They both release their spells simultaneously, and their streams of magic crash together in the air, forming a tenuous connection as ethereal shapes ripple within the magical energy. The connection shatters, granting Harry precious seconds to rush over to Cedric's lifeless body. With urgency, he summons the cup, which soars into his grasp, and in a flash, they disappear from the graveyard. Voldemort, left fuming, watches as Harry and Cedric's body emerge back in the arena. There, overcome with grief, Harry collapses onto Cedric's body, tears flowing freely as Amos succumbs to despair, his cries filling the air and the crowd witnessing the tragic scene in silent sorrow. Moments later, Mad-Eye Moody quietly enters the room, sealing the door behind him, while Harry continues to sob uncontrollably. As they sit in shared silence, Harry nods, revealing the dark mark of a skull and snake etched onto his arm. Suddenly, Mad-Eye begins to tremble, gasping for air, his hand reaching desperately for an empty bottle. He stumbles to a chest filled with other bottles, frantically rummaging through them, but before he can find what he seeks, a sudden flash of magic erupts, sending Mad-Eye crashing into the wall."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Harry notices a shining object in the distance and moves toward it as Viktor unsuccessfully attempts to zap him. He ducks, causing Viktor to be zapped by Cedric, who then disarms Viktor and threatens him with his wand. Harry intervenes, and after a brief struggle, they both dash toward the cup. Cedric is ensnared by the undergrowth and falls. Harry turns back, notices Cedric's predicament, and zaps the plant life to free Cedric, helping him up. Suddenly, the wind blows fiercely as they find themselves transported to a graveyard. Harry cries out in pain as Wormtail and Voldemort appear. Wormtail kills Cedric, pulls Harry closer, and traps him with a statue. As Harry watches, Wormtail drops items into a cauldron, including a bone and his own blood, before cutting Harry’s arm. The contents of the cauldron ignite, and Voldemort emerges, receiving his wand back from Wormtail, whom he marks before summoning allies. Voldemort angrily attacks the hooded figures and grants Wormtail a new hand. As Harry struggles, Voldemort touches Harry's head, causing him pain, and forces him to bow using magic. After forcing Harry to his feet, both cast spells, and their magic streams collide, creating shapes in the magical energy. When the connection breaks, Harry rushes to Cedric's body and summons the cup, allowing them to escape. Voldemort appears enraged as Harry returns to the arena with Cedric's body, where he mourns while Amos and the crowd react with distress. Mad-Eye Moody enters, closing the door as Harry sobs. They sit together, and Harry nods, revealing a mark on his arm. Suddenly, Mad-Eye struggles for air, reaches for his bottles, and is knocked into the wall by a flash of magic."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Harry sees something shining in the distance, which turns out to be the Triwizard Cup, an enchanted object that acts as a Portkey to transport the first person who touches it to a predetermined location, and moves towards it as Viktor Krum tries to zap him with a stunning curse, a spell often used to incapacitate opponents, but misses. Harry then ducks, and Viktor, who is under the Imperius Curse, a mind-control spell used to force individuals to act against their will, gets zapped by Cedric Diggory. Cedric, a talented and fair-minded wizard from Hogwarts, runs up and kicks the wand out of Viktor's hand and points his wand at Viktor's body as if to finish him off. Harry runs up and intervenes, knowing that Viktor is not acting of his own volition, and they struggle before the two of them begin running towards the cup. The undergrowth, animated by dark magic, grabs Cedric and he falls to the ground, causing Harry to look back and see Cedric is pinned down with no means of escape. Harry zaps the plant life, helping Cedric wriggle free, and then assists him up. The wind starts blowing again, indicating magical transportation, and Harry and Cedric have ported to a graveyard, the Riddle family graveyard where dark events are about to unfold. Harry lets out a shout and holds his head in pain as his scar, a remnant of a curse from Voldemort, burns, signaling the Dark Lord's presence, as Wormtail, Voldemort's loyal servant, and Voldemort himself appear nearby. Wormtail casts a spell and kills Cedric ruthlessly, leaving Cedric dead on the ground as a tragic victim of the unfolding events. Wormtail pulls Harry closer and a statue, enchanted to act as a magical restraint, grabs hold of Harry, trapping him. Wormtail drops something into a cauldron, likely a forbidden ritual involving Harry's blood for Voldemort's rebirth, as Harry watches, and a bone, identified as one from Voldemort’s father, hovers in the air under Wormtail's control, dropping into the cauldron. Wormtail slashes his arm over the cauldron, contributing flesh to the ritual, and then takes the knife to Harry, cutting at his arm, prompting Harry to shout in pain. Wormtail lets the drops fall into the cauldron, which bursts into flame as the dark magic culminates, and a reformed Voldemort, now restored to full power, emerges. Wormtail hands him the wand with trembling hands and bows deeply, looking concerned but doing it anyway, before Voldemort sticks the wand into Wormtail's arm, marking him with the Dark Mark, a symbol of Voldemort's followers. The sky changes ominously as others, known as Death Eaters, are summoned, and Voldemort begins slashing angrily at the hooded figures before granting Wormtail a new hand, a magical silver hand as a reward for his service. As Harry struggles to get free, Voldemort puts his hand on Harry's head, making him scream, exploiting their connection, and then forces Harry to bow with magic, casting at him so he wriggles in pain. Voldemort pulls Harry to his feet, taunting him, and as Harry begins to move away, he takes steps toward Voldemort. They both cast, engaging in a rare duel where their streams of magic meet in a Priori Incantatem effect, and they struggle as ghostly shapes of Voldemort’s past victims form in the surrounding magical energy. The connection breaks and Harry runs over to Cedric's body, summoning the cup over to them, and in an instant, they port out, escaping the graveyard. Voldemort looks angry as Harry appears with Cedric's body back at the arena, the final venue for the Triwizard Tournament, where Harry weeps on Cedric's body as Amos Diggory, Cedric's father, breaks down wailing and the crowd looks on distraught. Mad-Eye Moody, who is actually Barty Crouch Jr. in disguise using Polyjuice Potion to assume Moody’s appearance, enters, closing the door behind him while Harry is still sobbing in the room. They sit, and Harry nods as we see his arm marked with a skull and snake, the Dark Mark that is magically appearing due to the events at the graveyard. Mad-Eye starts shaking and struggling for air, reaching for his empty bottle of potion that helps maintain his disguise, before rushing to a chest with other bottles, struggling to find one. A flash of magic occurs and Mad-Eye is knocked into the wall by Dumbledore and other teachers as they rescue Harry from danger."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Harry sees something shining in the distance and moves towards it as Viktor tries to zap him but misses and then Harry ducks and Viktor gets zapped by Cedric. Cedric runs up and kicks the wand out of Viktor's hand and points his wand at Viktor's body as if to finish him off. Harry runs up and intervenes and they struggle before the two of them begin running towards the cup. The undergrowth grabs Cedric and he falls to the ground causing Harry to look back and see. Cedric is pinned down with no means of escape. Harry zaps the plant life helping Cedric wriggle free and then assists him up. The wind starts blowing again and Harry and Cedric have ported to a graveyard. Harry let us out a shout and holds his head in pain as Wormtail and Voldemort appear nearby. Wormtail casts a spell and kills Cedric leaving Cedric dead on the ground. Wormtail pulls Harry closer and a statue grabs hold of Harry trapping him. Wormtail drops something into a cauldron as Harry watches and a bone hovers in the air under Wormtail's control dropping into the cauldron. Wormtail slashes his arm over the cauldron and then takes the knife to Harry cutting at his arm prompting Harry to shout. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Wormtail let us the drops fall into the cauldron which bursts into flame and a reformed Voldemort emerges. Wormtail hands him the wand and bows deeply looking concerned but doing it anyway before Voldemort sticks the wand into Wormtail's arm. The sky changes as others are summoned and Voldemort begins slashing angrily at the hooded figures before granting Wormtail a new hand. As Harry struggles to get free Voldemort puts his hand on Harry's head making him scream and then forces Harry to bow with magic casting at him so he wriggles in pain. Voldemort pulls Harry to his feet and as Harry begins to move away he takes steps toward Voldemort. They both cast and their streams of magic meet and they struggle as shapes form in the surrounding magical energy. The connection breaks and Harry runs over to Cedric's body summoning the cup over to them and in an instant they port out. Voldemort looks angry as Harry appears with Cedric's body back at the arena where Harry weeps on Cedric's body as Amos breaks down wailing and the crowd looks on distraught MadEye. Moody enters closing the door behind him while Harry is still sobbing in the room. They sit and Harry nods as we see his arm marked with a skull and snake. MadEye starts shaking and struggling for air reaching for his empty bottle before rushing to a chest with other bottles struggling to find one. A flash of magic occurs and MadEye is knocked into the wall."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Harry sees something shining in the distance and moves towards it as Viktor tries to zap him but misses and then Harry ducks and Viktor gets zapped by Cedric. Cedric runs up and kicks the wand out of Viktor's hand and points his wand at Viktor's body as if to finish him off. Harry runs up and intervenes and they struggle before the two of them begin running towards the cup. The undergrowth grabs Cedric and he falls to the ground causing Harry to look back and see. Cedric is pinned down with no means of escape. Harry zaps the plant life helping Cedric wriggle free and then assists him up. The wind starts blowing again and Harry and Cedric have ported to a graveyard. Harry let us out a shout and holds his head in pain as Wormtail and Voldemort appear nearby. Wormtail casts a spell and kills Cedric leaving Cedric dead on the ground. Wormtail pulls Harry closer and a statue grabs hold of Harry trapping him. Wormtail drops something into a cauldron as Harry watches and a bone hovers in the air under Wormtail's control dropping into the cauldron. Wormtail slashes his arm over the cauldron and then takes the knife to Harry cutting at his arm prompting Harry to shout. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Wormtail let us the drops fall into the cauldron which bursts into flame and a reformed Voldemort emerges. Wormtail hands him the wand and bows deeply looking concerned but doing it anyway before Voldemort sticks the wand into Wormtail's arm. The sky changes as others are summoned and Voldemort begins slashing angrily at the hooded figures before granting Wormtail a new hand. As Harry struggles to get free Voldemort puts his hand on Harry's head making him scream and then forces Harry to bow with magic casting at him so he wriggles in pain. Voldemort pulls Harry to his feet and as Harry begins to move away he takes steps toward Voldemort. They both cast and their streams of magic meet and they struggle as shapes form in the surrounding magical energy. The connection breaks and Harry runs over to Cedric's body summoning the cup over to them and in an instant they port out. Voldemort looks angry as Harry appears with Cedric's body back at the arena where Harry weeps on Cedric's body as Amos breaks down wailing and the crowd looks on distraught MadEye. Moody enters closing the door behind him while Harry is still sobbing in the room. They sit and Harry nods as we see his arm marked with a skull and snake. MadEye starts shaking and struggling for air reaching for his empty bottle before rushing to a chest with other bottles struggling to find one. A flash of magic occurs and MadEye is knocked into the wall."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Harry sees something shining in the distance and moves towards it as Viktor tries to zap him but misses and then Harry ducks and Viktor gets zapped by Cedric. Cedric runs up and kicks the wand out of Viktor's hand and points his wand at Viktor's body as if to finish him off. Harry runs up and intervenes and they struggle before the two of them begin running towards the cup. The undergrowth grabs Cedric and he falls to the ground causing Harry to look back and see. Cedric is pinned down with no means of escape. Harry zaps the plant life helping Cedric wriggle free and then assists him up. The connection breaks and Harry runs over to Cedric's body summoning the cup over to them and in an instant they port out. Voldemort looks angry as Harry appears with Cedric's body back at the arena where Harry weeps on Cedric's body as Amos breaks down wailing and the crowd looks on distraught MadEye. Moody enters closing the door behind him while Harry is still sobbing in the room. They sit and Harry nods as we see his arm marked with a skull and snake. MadEye starts shaking and struggling for air reaching for his empty bottle before rushing to a chest with other bottles struggling to find one. A flash of magic occurs and MadEye is knocked into the wall."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Harry sees something shining in the distance and moves towards it as Viktor tries to zap him but misses and then Harry ducks and Viktor gets zapped by Cedric. Cedric runs up and kicks the wand out of Viktor's hand and points his wand at Viktor's body as if to finish him off. Harry runs up and intervenes and they struggle before the two of them begin running towards the cup. MadEye starts shaking and struggling for air reaching for his empty bottle before rushing to a chest with other bottles struggling to find one. A flash of magic occurs and MadEye is knocked into the wall."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Larry notices a bird chirping in the treetops and skips towards it as Boris attempts to capture him but fumbles, and then Larry somersaults and Boris gets startled by Edgar. Edgar dashes forward and knocks the umbrella out of Boris's grip and aims his umbrella at Boris's feet as if to trip him up. Larry dashes forward and intervenes, and they tussle before the pair of them start sprinting towards the gazebo. The bushes ensnare Edgar and he tumbles to the soil, causing Larry to glance back and see Edgar is tangled with no means of liberation. Larry startles the foliage, aiding Edgar to shimmy free, and then aids him to stand. The gale begins howling again, and Larry and Edgar find themselves in a marketplace. Larry lets out a whistle and clutches his knee in distress, as Piglet and Marvolo appear nearby. Piglet waves a wand and topples Edgar, leaving Edgar sprawled on the cobblestones. Piglet drags Larry closer and a fountain clutches hold of Larry, trapping him. Piglet drops a gem into a cauldron as Larry watches, and a feather hovers in the air under Piglet's command, dropping into the cauldron. Piglet slices his hand over the cauldron, and then brings the dagger to Larry, scratching at his hand, prompting Larry to yell. Piglet lets the droplets fall into the cauldron, which bursts into smoke, and a polished Marvolo emerges. Piglet hands him the staff and bows low, looking worried but complying nonetheless, before Marvolo prods the staff into Piglet's hand. The horizon shifts as others are beckoned, and Marvolo begins swiping furiously at the cloaked figures before bestowing Piglet with a new foot. As Larry grapples to break free, Marvolo places his foot on Larry's knee, causing him to scream, and then forces Larry to kneel with magic, casting at him so he wriggles in agony. Marvolo pulls Larry to his legs, and as Larry starts to back away, he takes strides toward Marvolo. They both wave and their streams of magic converge, and they grapple as silhouettes form in the surrounding mystical haze. The bond breaks and Larry scampers over to Edgar's figure, summoning the gazebo over to them, and in a flash they vanish from sight. Marvolo looks furious as Larry materializes with Edgar's figure back at the village square, where Larry cries on Edgar's figure as Amos breaks down sobbing and the congregation looks on heartbroken. Mad-Eye Murray enters, sealing the entrance behind him while Larry is still weeping in the chamber. They remain seated, and Larry nods as we see his hand marked with a flame and vine. Mad-Eye starts trembling and gasping for breath, reaching for his hollow goblet before rushing to a trunk with other goblets, struggling to locate one. A burst of magic arises and Mad-Eye is thrown into the pillar."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Harry spots something shining and approaches, dodging Viktor's attack. Viktor is disarmed by Cedric, who prepares to finish him, but Harry intervenes. As they race toward the cup, Cedric is trapped by undergrowth. Harry frees him, and they reach a graveyard where Wormtail and Voldemort appear. Wormtail kills Cedric and traps Harry. Using a cauldron ritual, Voldemort is reborn, receiving a wand from Wormtail, whom he rewards with a new hand. Voldemort tortures Harry, forcing him to bow, but their spells clash when Harry resists. Harry escapes with Cedric's body using the cup, returning to the arena where he mourns Cedric as the crowd reacts. Mad-Eye Moody enters, and as Harry shows his marked arm, Moody struggles for air and is knocked against the wall after failing to find a potion."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "A flash of magic occurs and MadEye is knocked into the wall MadEye starts shaking and struggling for air reaching for his empty bottle before rushing to a chest with other bottles struggling to find one They sit and Harry nods as we see his arm marked with a skull and snake Moody enters closing the door behind him while Harry is still sobbing in the room Voldemort looks angry as Harry appears with Cedric's body back at the arena where Harry weeps on Cedric's body as Amos breaks down wailing and the crowd looks on distraught MadEye The connection breaks and Harry runs over to Cedric's body summoning the cup over to them and in an instant they port out They both cast and their streams of magic meet and they struggle as shapes form in the surrounding magical energy Voldemort pulls Harry to his feet and as Harry begins to move away he takes steps toward Voldemort As Harry struggles to get free Voldemort puts his hand on Harry's head making him scream and then forces Harry to bow with magic casting at him so he wriggles in pain The sky changes as others are summoned and Voldemort begins slashing angrily at the hooded figures before granting Wormtail a new hand Wormtail hands him the wand and bows deeply looking concerned but doing it anyway before Voldemort sticks the wand into Wormtail's arm Wormtail let us the drops fall into the cauldron which bursts into flame and a reformed Voldemort emerges Wormtail slashes his arm over the cauldron and then takes the knife to Harry cutting at his arm prompting Harry to shout Wormtail drops something into a cauldron as Harry watches and a bone hovers in the air under Wormtail's control dropping into the cauldron Wormtail pulls Harry closer and a statue grabs hold of Harry trapping him Wormtail casts a spell and kills Cedric leaving Cedric dead on the ground Harry let us out a shout and holds his head in pain as Wormtail and Voldemort appear nearby The wind starts blowing again and Harry and Cedric have ported to a graveyard Harry zaps the plant life helping Cedric wriggle free and then assists him up Cedric is pinned down with no means of escape The undergrowth grabs Cedric and he falls to the ground causing Harry to look back and see Harry runs up and intervenes and they struggle before the two of them begin running towards the cup Cedric runs up and kicks the wand out of Viktor's hand and points his wand at Viktor's body as if to finish him off Harry sees something shining in the distance and moves towards it as Viktor tries to zap him but misses and then Harry ducks and Viktor gets zapped by Cedric"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Cedric runs up and kicks the wand out of Viktor's hand and points his wand at Viktor's body as if to finish him off Harry sees something shining in the distance and moves towards it as Viktor tries to zap him but misses and then Harry ducks and Viktor gets zapped by Cedric The undergrowth grabs Cedric and he falls to the ground causing Harry to look back and see Harry runs up and intervenes and they struggle before the two of them begin running towards the cup Harry zaps the plant life helping Cedric wriggle free and then assists him up Cedric is pinned down with no means of escape Harry let us out a shout and holds his head in pain as Wormtail and Voldemort appear nearby The wind starts blowing again and Harry and Cedric have ported to a graveyard Wormtail pulls Harry closer and a statue grabs hold of Harry trapping him Wormtail casts a spell and kills Cedric leaving Cedric dead on the ground Wormtail slashes his arm over the cauldron and then takes the knife to Harry cutting at his arm prompting Harry to shout Wormtail drops something into a cauldron as Harry watches and a bone hovers in the air under Wormtail's control dropping into the cauldron Wormtail hands him the wand and bows deeply looking concerned but doing it anyway before Voldemort sticks the wand into Wormtail's arm Wormtail let us the drops fall into the cauldron which bursts into flame and a reformed Voldemort emerges As Harry struggles to get free Voldemort puts his hand on Harry's head making him scream and then forces Harry to bow with magic casting at him so he wriggles in pain The sky changes as others are summoned and Voldemort begins slashing angrily at the hooded figures before granting Wormtail a new hand They both cast and their streams of magic meet and they struggle as shapes form in the surrounding magical energy Voldemort pulls Harry to his feet and as Harry begins to move away he takes steps toward Voldemort Voldemort looks angry as Harry appears with Cedric's body back at the arena where Harry weeps on Cedric's body as Amos breaks down wailing and the crowd looks on distraught MadEye The connection breaks and Harry runs over to Cedric's body summoning the cup over to them and in an instant they port out They sit and Harry nods as we see his arm marked with a skull and snake Moody enters closing the door behind him while Harry is still sobbing in the room A flash of magic occurs and MadEye is knocked into the wall MadEye starts shaking and struggling for air reaching for his empty bottle before rushing to a chest with other bottles struggling to find one"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Wormtail let us the drops fall into the cauldron which bursts into flame and a reformed Voldemort emerges Wormtail hands him the wand and bows deeply looking concerned but doing it anyway before Voldemort sticks the wand into Wormtail's arm The sky changes as others are summoned and Voldemort begins slashing angrily at the hooded figures before granting Wormtail a new hand As Harry struggles to get free Voldemort puts his hand on Harry's head making him scream and then forces Harry to bow with magic casting at him so he wriggles in pain Voldemort pulls Harry to his feet and as Harry begins to move away he takes steps toward Voldemort They both cast and their streams of magic meet and they struggle as shapes form in the surrounding magical energy The connection breaks and Harry runs over to Cedric's body summoning the cup over to them and in an instant they port out Voldemort looks angry as Harry appears with Cedric's body back at the arena where Harry weeps on Cedric's body as Amos breaks down wailing and the crowd looks on distraught MadEye Moody enters closing the door behind him while Harry is still sobbing in the room They sit and Harry nods as we see his arm marked with a skull and snake MadEye starts shaking and struggling for air reaching for his empty bottle before rushing to a chest with other bottles struggling to find one A flash of magic occurs and MadEye is knocked into the wall Harry sees something shining in the distance and moves towards it as Viktor tries to zap him but misses and then Harry ducks and Viktor gets zapped by Cedric Cedric runs up and kicks the wand out of Viktor's hand and points his wand at Viktor's body as if to finish him off Harry runs up and intervenes and they struggle before the two of them begin running towards the cup The undergrowth grabs Cedric and he falls to the ground causing Harry to look back and see Cedric is pinned down with no means of escape Harry zaps the plant life helping Cedric wriggle free and then assists him up The wind starts blowing again and Harry and Cedric have ported to a graveyard Harry let us out a shout and holds his head in pain as Wormtail and Voldemort appear nearby Wormtail casts a spell and kills Cedric leaving Cedric dead on the ground Wormtail pulls Harry closer and a statue grabs hold of Harry trapping him Wormtail drops something into a cauldron as Harry watches and a bone hovers in the air under Wormtail's control dropping into the cauldron Wormtail slashes his arm over the cauldron and then takes the knife to Harry cutting at his arm prompting Harry to shout"
        }
      ]
    }
  ]
}