{
  "ground_truth": "The tent blooms softly with light, briefly illuminating a bedside photograph of James and Lily Potter, then goes dark. The blankets bloom again when, down the hall, a toilet flushes. Instantly, the shadow stiffens, the blankets dim, and the tent flattens just as the bedroom door opens, revealing Uncle Vernon. He peers inside, eyes flashing suspiciously, then withdraws. The tent rises, and as the blankets blaze, we cut inside to find a skinny boy with a crow's nest of black hair, thick glasses sitting crookedly atop his nose: Harry Potter. Open before him is Violeta Stitch's Extreme Incantations. Once again, he speaks. A blinding blast of light flashes from the second story window of Number Four. The light in the hallway snaps on, Harry's tent droops once more, and seconds later, Harry's door eases open. Uncle Vernon peers in and switches on the light. Slowly, he closes the door and eyes the parchment in Harry's hand suspiciously. Just then, Dudley, sitting comatose before the TV, emits a hollow, brain-dead chuckle. Marge flashes a thick fan of pound notes. Dudley blinks, waddles forward, and extends his plump palm obediently. Harry looks on, then sees Ripper snuffling about his ankle. As Harry clears the dishes, Uncle Vernon brings out a bottle of brandy. Hearing this, Harry frowns and glances at Uncle Vernon, who glares darkly at him. Aunt Marge pauses on her wine, eyes narrowing on Harry. POP! The glass in Aunt Marge's hand explodes. Harry stares at the shattered glass in surprise. Aunt Marge starts to reply when a button on her dress sails into the air with a zing. Thread snaps. Aunt Marge's eyes widen. Her cheeks billow. Her whole body billows, and she begins to inflate like a monstrous balloon. To his horror, Uncle Vernon himself begins to rise. Aunt Marge looks fearfully into his eyes, and he lets go, falls to his knees, and watches Aunt Marge float away. Harry crashes inside, takes his trunk, then puts his heel to a loose floorboard and removes his wand from its hiding place. Turning, he grabs the photograph of his parents. BOOM! BOOM! BOOM! Harry tows the trunk down the stairs and finds Uncle Vernon waiting for him. Uncle Vernon eyes Harry's wand nervously, then grins with knowing cruelty. As Harry storms out with his trunk, we dolly to the street with him. High in the sky, a plump dot rises. Harry walks and walks and walks, then stops, glancing about. An empty playground, swings creaking gently on rusted chains, and a tiny carousel, kissed gently by the wind, turning slowly. Harry drops the trunk, sits, still as a statue. In the trees above, leaves tremble. Harry turns and studies the swaying swings, the carousel.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The shelter blossoms quietly with luminance, momentarily lighting a bedside snapshot of James and Lily Potter, then goes dim. The covers blossom again when, down the corridor, a lavatory flushes. Instantly, the silhouette stiffens, the covers darken, and the shelter compresses just as the bedroom entrance opens, revealing Uncle Vernon. He peers within, eyes gleaming suspiciously, then retreats. The shelter elevates, and as the covers blaze, we cut inside to discover a skinny lad with a crow's nest of dark hair, thick spectacles resting crookedly atop his nose: Harry Potter. Open before him is Violeta Stitch's Extreme Spells. Once more, he utters. A blinding burst of luminance flashes from the second story casement of Number Four. The luminance in the corridor snaps on, Harry's shelter droops once more, and seconds afterward, Harry's portal eases open. Uncle Vernon peers in and switches on the luminance. Gradually, he closes the portal and eyes the parchment in Harry's hand suspiciously. Just then, Dudley, sitting comatose before the TV, emits a hollow, brain-dead chortle. Marge flashes a thick fan of pound bills. Dudley blinks, waddles forward, and extends his plump palm obediently. Harry looks on, then perceives Ripper snuffling about his ankle. As Harry clears the dishes, Uncle Vernon brings out a bottle of brandy. Hearing this, Harry frowns and glances at Uncle Vernon, who glares darkly at him. Aunt Marge pauses on her wine, eyes narrowing on Harry. POP! The goblet in Aunt Marge's hand shatters. Harry stares at the shattered goblet in astonishment. Aunt Marge starts to respond when a button on her gown sails into the air with a zing. Thread snaps. Aunt Marge's eyes widen. Her cheeks billow. Her whole form billows, and she begins to swell like a monstrous balloon. To his dismay, Uncle Vernon himself begins to ascend. Aunt Marge looks fearfully into his eyes, and he lets go, falls to his knees, and watches Aunt Marge float away. Harry crashes inside, takes his chest, then puts his heel to a loose floorboard and removes his wand from its hiding spot. Turning, he grabs the snapshot of his parents. BOOM! BOOM! BOOM! Harry tows the chest down the stairs and finds Uncle Vernon waiting for him. Uncle Vernon eyes Harry's wand nervously, then grins with knowing malice. As Harry storms out with his chest, we dolly to the boulevard with him. High in the sky, a plump speck ascends. Harry walks and walks and walks, then halts, glancing about. An empty playground, swings creaking gently on rusted chains, and a tiny carousel, kissed gently by the breeze, turning slowly. Harry drops the chest, sits, still as a statue. In the trees above, leaves quiver. Harry turns and studies the swaying swings, the carousel."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The tent is softly bloomed with light, briefly illuminating a bedside photograph of James and Lily Potter, then it goes dark. The blankets are bloomed again when, down the hall, a toilet is flushed. Instantly, the shadow is stiffened, the blankets are dimmed, and the tent is flattened just as the bedroom door is opened, revealing Uncle Vernon. Inside, he peers, eyes flashing suspiciously, then he withdraws. The tent is risen, and as the blankets are blazed, we cut inside to find a skinny boy with a crow's nest of black hair, thick glasses sitting crookedly atop his nose: Harry Potter. Open before him, he has Violeta Stitch's Extreme Incantations. Once again, he speaks. From the second story window of Number Four, a blinding blast of light is flashed. The light in the hallway is snapped on, Harry's tent is drooped once more, and seconds later, Harry's door is eased open. Uncle Vernon peers in and switches on the light. Slowly, he closes the door and eyes the parchment in Harry's hand suspiciously. Just then, Dudley, sitting comatose before the TV, emits a hollow, brain-dead chuckle. A thick fan of pound notes is flashed by Marge. Dudley blinks, waddles forward, and extends his plump palm obediently. On, Harry looks, then sees Ripper snuffling about his ankle. As the dishes are cleared by Harry, Uncle Vernon brings out a bottle of brandy. Hearing this, a frown is formed by Harry and a glance is given to Uncle Vernon, who glares darkly at him. On her wine, Aunt Marge pauses, eyes narrowing on Harry. POP! The glass in Aunt Marge's hand is exploded. At the shattered glass, Harry stares in surprise. Aunt Marge starts to reply when a button on her dress is sailed into the air with a zing. Thread snaps. Aunt Marge's eyes are widened. Her cheeks are billowed. Her whole body is billowed, and like a monstrous balloon, she begins to inflate. To his horror, Uncle Vernon begins to rise himself. Aunt Marge fearfully looks into his eyes, and he lets go, falls to his knees, and watches Aunt Marge float away. Inside crashes Harry, takes his trunk, then puts his heel to a loose floorboard and his wand is removed from its hiding place by him. Turning, he grabs the photograph of his parents. BOOM! BOOM! BOOM! The trunk is towed down the stairs by Harry and Uncle Vernon is found waiting for him. Harry's wand is nervously eyed by Uncle Vernon, then with knowing cruelty, he grins. As out with his trunk Harry storms, to the street with him, we dolly. High in the sky, a plump dot is risen. Walks and walks and walks Harry, then stops, about glancing. An empty playground, swings creaking gently on rusted chains, and a tiny carousel, kissed gently by the wind, turning slowly. The trunk is dropped by Harry, and he sits, still as a statue. In the trees above, leaves are trembled. The swaying swings, the carousel, Harry turns and studies."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The tent softly illuminates a bedside photo of James and Lily Potter before going dark. Blankets light up again as a toilet flushes down the hall. Instantly, the shadow stiffens, the bed dims, and the tent flattens as Uncle Vernon opens the door, eyes flashing suspiciously, then withdraws. The tent rises, revealing Harry Potter with unruly black hair and crooked glasses, reading Violeta Stitch's Extreme Incantations. He speaks, and a blinding light flashes from Number Four's second-story window. The hall light snaps on, the tent droops, and the door opens again. Uncle Vernon peers in, switches on the light, and suspiciously eyes the parchment in Harry's hand. Dudley, comatose before the TV, emits a hollow chuckle, while Marge flashes a fan of pound notes. Dudley waddles forward, extending his palm. Harry sees Ripper at his ankle. While clearing dishes, Uncle Vernon brings out brandy, glaring at Harry. Aunt Marge narrows her eyes as POP! Her glass explodes. Startled, Harry watches her inflate like a balloon, eyes widening as Uncle Vernon rises. Aunt Marge looks fearful, and Uncle Vernon falls to his knees, watching her float away. Harry rushes inside, retrieves his trunk, lifts a floorboard to get his wand, and grabs a photograph of his parents. BOOM! Harry drags the trunk downstairs, meeting Uncle Vernon's nervous gaze on his wand. Grinning cruelly, Uncle Vernon watches as Harry storms out with his trunk. On the street, Harry walks, stopping at an empty playground with creaking swings and a slowly turning carousel. He drops the trunk and sits, studying the swaying swings and carousel as leaves tremble above."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The tent softly lights up, illuminating a photo of James and Lily Potter, then dims. Light blooms as a toilet flushes. Instantly, the tent flattens when Uncle Vernon enters, eyes suspicious. The tent rises again, revealing Harry Potter with messy black hair and glasses, reading Violeta Stitch's Extreme Incantations. A bright flash from Number Four's window causes Harry's tent to droop, and Uncle Vernon switches on the light, eyeing Harry suspiciously. Dudley chuckles emptily at the TV, while Marge flaunts cash, leading Dudley to obediently take it. Harry clears dishes as Uncle Vernon grabs brandy, frowning at Harry. Aunt Marge's glass explodes, and she starts inflating like a balloon. Uncle Vernon rises with her, horrified. Harry grabs his trunk and wand, takes a photo of his parents, and storms out. Outside, a plump dot rises in the sky as Harry walks to an empty playground. He sits still, observing the swaying swings and carousel."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The tent, much like a flower unfurling at dawn, softly blooms with a gentle light, momentarily casting a glow upon a nearby bedside photograph of James and Lily Potter. Shortly after, the tent returns to darkness. The blankets, too, light up once more when, farther down the hall, the sound of a toilet flushing can be heard. Instantly, the shadow stiffens as if startled, and the blankets lose their glow, while the tent flattens just as the bedroom door swings open to reveal Uncle Vernon. He peers inside with eyes flashing suspiciously, then withdraws. The tent rises again, and as the blankets once again blaze with light, we cut inside to discover a skinny boy with a wild crow's nest of black hair, thick glasses sitting rather crookedly atop his nose: Harry Potter. Open before him lies Violeta Stitch's \"Extreme Incantations.\" Once again, Harry speaks the incantation. A blinding flash of light bursts forth from the second-story window of Number Four. The hallway light switches on abruptly, causing Harry's tent to droop once more, and moments later, Harry's door opens carefully. Uncle Vernon peers inside, flipping on the light as he does so. Slowly and deliberately, he closes the door, casting a suspicious glance at the parchment clutched in Harry's hand. Just then, in stark contrast, Dudley emits a hollow, brain-dead chuckle as he sits in a comatose state before the television. Marge flashes a thick fan of pound notes. Dudley blinks, waddles forward, and extends his plump palm obediently. Harry looks on, observing the scene, then notices Ripper snuffling about his ankle. As Harry clears the dishes, Uncle Vernon brings forth a bottle of brandy. Upon hearing this, Harry frowns and casts a glance at Uncle Vernon, who glares darkly at him. Aunt Marge, pausing in her wine-drinking, narrows her eyes suspiciously on Harry. POP! The glass in Aunt Marge's hand explodes unexpectedly. Harry stares at the shattered glass, taken aback. Aunt Marge attempts to reply when suddenly, with a zing, a button on her dress sails into the air. Thread snaps ominously. Aunt Marge's eyes widen in shock. Her cheeks begin to billow as her entire body swells, and she starts to inflate uncontrollably like a monstrous balloon. To his horror, Uncle Vernon himself begins to rise along with her. Aunt Marge looks fearfully into his eyes, and he lets go, falling to his knees as he watches Aunt Marge float away. Harry rushes inside, grabs his trunk, and then places his heel on a loose floorboard, retrieving his wand from its hiding place. Turning swiftly, he snatches the photograph of his parents. BOOM! BOOM! BOOM! Harry tows his trunk down the stairs and finds Uncle Vernon waiting ominously for him. Uncle Vernon eyes Harry's wand nervously, then displays a grin filled with knowing cruelty. As Harry storms out with his trunk, we dolly to the street alongside him. High in the sky above, a plump dot continues to rise. Harry walks and walks, making his way onward until he comes to a stop, casting a glance around. An empty playground is in view, its swings creaking gently on rusted chains, and a tiny carousel, kissed softly by the wind, turns slowly. Harry drops his trunk, sits quietly, as still as a statue. In the trees above, leaves tremble in the quiet breeze. Harry turns to study the swaying swings and the turning carousel."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The tent, in a manner reminiscent of a delicate flower unfurling softly at the break of dawn, gently blooms with a subtle glow, briefly casting a warm light upon a nearby bedside photograph of the beloved faces of James and Lily Potter. Before long, the tent naturally returns to its former state of darkness. Meanwhile, the blankets emit another glow when, farther down the hall, the unmistakable sound of a toilet flushing echoes. Instantly, the shadow becomes rigid and tense, as if taken by surprise, and the blankets promptly lose their illuminating glow, while the tent flattens just as the bedroom door swings open to reveal none other than Uncle Vernon. He peers inside the room, his eyes flashing with deep suspicion, and then retreats. Immediately, the tent rises once more, and as the blankets blaze brightly with light again, we are taken inside to discover a slender boy with a wild, unruly crow's nest of black hair, his thick glasses perched somewhat crookedly upon his nose: Harry Potter. Laid open before him is Violeta Stitch's \"Extreme Incantations.\" Once more, Harry articulates the incantation. A brilliant and blinding flash of light erupts from the second-story window of Number Four. The hallway light flicks on without warning, causing Harry's tent to droop yet again, and moments after, Harry's door opens slowly and carefully. Uncle Vernon peers inside, flipping on the light as he does so, casting a keen eye over the scene. He then closes the door slowly and deliberately, giving a suspicious glance at the parchment clutched tightly in Harry's hand. In stark contrast to the tension, Dudley, seated in a comatose state before the television, releases a hollow, brain-dead chuckle. Marge waves a thick fan of pound notes. Dudley blinks dumbly, waddles forward, and obediently extends his plump, grasping palm. Harry observes this scene, taking it all in, then notices Ripper snuffling curiously around his ankle. As Harry diligently clears the dishes, Uncle Vernon brandishes a bottle of brandy with a certain flair. Upon realizing this, Harry frowns and casts a cautionary glance at Uncle Vernon, who returns his look with a dark, menacing glare. Aunt Marge, pausing in her indulgence of wine, fixes her eyes on Harry, narrowing them with suspicion. POP! The glass in Aunt Marge's hand abruptly shatters in an explosion of tiny fragments. Harry stares, momentarily taken aback by the shattered glass. Aunt Marge attempts to respond when suddenly, with a zing, a button on her dress flies sharply into the air. Threads snap with a foreboding sound. Aunt Marge's eyes widen in shock as her cheeks begin to puff out; her entire body starts to swell and inflate uncontrollably, akin to a monstrous balloon. To his horror, Uncle Vernon finds himself rising along with her. Aunt Marge looks fearfully into his eyes, and in his shock, he releases his grip, falling to his knees as he helplessly watches Aunt Marge float away, rising higher and higher. Harry rushes back inside, grabs hold of his trunk, and places his heel on a loose floorboard, retrieving his wand carefully from its secret hiding place. With a swift turn, he snatches the cherished photograph of his parents. BOOM! BOOM! BOOM! Harry makes his way down the stairs, towing his trunk behind him, only to find Uncle Vernon ominously waiting for him. Uncle Vernon watches Harry's wand with nervous apprehension and then displays a grin filled with cruel, knowing malice. As Harry storms out with determination, trunk in tow, we follow alongside him down the street. High up in the sky above, a plump dot continues its ascent. Harry walks determinedly, making his determined way forward until he eventually comes to a halt, pausing to cast a glance around. He sees an empty playground, its swings creaking gently on rusted chains, with a tiny carousel, delicately kissed by the wind, turning slowly and methodically. Harry drops his trunk, sits down quietly and still, resembling a solemn statue. In the trees above, leaves tremble gently in the soft, quiet breeze. Harry turns to observe the rhythmic swaying of the swings and the slow, methodical turn of the carousel."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The tent comes alive with a soft glow, casting a brief illumination on a bedside photograph of James and Lily Potter, before darkness envelops it once more. This gentle light reprise occurs when, down the hallway, the sound of a toilet flushing fills the air. Immediately, this prompts a swift reaction—the shadow within the tent freezes, the dim glow of the blankets fades, and the tent itself collapses back into its original shape just as the bedroom door swings open to reveal Uncle Vernon. He peers suspiciously into the room, his eyes darting around, before he retracts back into the darkness. The tent, rejuvenated, rises again, and as the blankets illuminate with a warm glow, the scene shifts inside to reveal a slender boy with a wild tangle of black hair and thick glasses perched unevenly on his nose: it is Harry Potter. In front of him lies an open book titled Violeta Stitch's Extreme Incantations. With determination, he articulates a spell once more. A sudden, dazzling burst of light erupts from the window on the second story of Number Four. Almost instantaneously, the hallway light switches on, causing Harry's tent to droop lifelessly once again. Moments later, Harry's door creaks open, and Uncle Vernon gazes inside, flicking on the light switch. Deliberately, he closes the door, his gaze landing suspiciously on the parchment clutched in Harry's hand. Just then, a sound diverts attention—Dudley, ensconced in front of the television, releases a vacant, mindless chuckle. Meanwhile, Marge brandishes a thick fan of pound notes. Dudley, reacting with a blink, lumbers forward and obediently stretches out his pudgy hand to receive them. Harry observes the scene, then notices Ripper sniffing inquisitively at his ankle. Tasked with clearing the dishes, Harry moves about the room, while Uncle Vernon uncaps a bottle of brandy, a sight that prompts Harry to frown and glance sharply at him. Uncle Vernon, in turn, casts a menacing glare back at Harry. Aunt Marge pauses mid-sip of her wine, her gaze sharp and narrowing upon Harry. Suddenly, with a loud POP!, the glass in Aunt Marge's hand shatters, sending shards flying. Harry fixes his eyes on the shattered remnants, surprise etched on his face. Aunt Marge attempts to respond, but before she can, a button from her dress breaks free with a zing, soaring through the air. Threads begin to unravel. Aunt Marge's eyes widen in shock as her cheeks start to balloon outwards, her entire body swelling as if she were turning into a massive balloon. In horror, Uncle Vernon finds himself involuntarily rising from the ground. Aunt Marge captures a glimpse of fear in his eyes, and as he releases his grip, he collapses to his knees, helplessly watching as she ascends and floats away into the sky. Quickly, Harry rushes back inside, retrieves his trunk, and nudges a loose floorboard with his heel to reveal his wand concealed beneath it. Turning swiftly, he grabs the treasured photograph of his parents. Suddenly, loud, resounding BOOMs echo as Harry drags his heavy trunk down the stairs, where he encounters Uncle Vernon waiting ominously. Uncle Vernon eyes Harry's wand with nervous apprehension, yet a sinister grin of cruel understanding spreads across his face. Unfazed, Harry storms out, his trunk in tow, and the scene shifts to follow him into the street. Up above, a small, round shape is visible high in the sky. Harry walks on and on, traversing the neighborhood before he finally halts, casting a searching look around him. He finds himself at an empty playground, where swings gently sway on creaky, rusted chains, and a diminutive carousel slowly turns, nudged by the tender breeze. Allowing his trunk to fall to the ground, Harry sits down, as still as a statue, the scene around him imbued with silence. In the canopy above, leaves rustle softly. Harry turns his focus to the swaying swings and the slowly revolving carousel."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The tent softly illuminates with light, revealing a photograph of James and Lily Potter before darkening again. Down the hall, when a toilet flushes, the shadow stiffens, the blankets dim, and the tent flattens as Uncle Vernon opens the bedroom door to peer inside suspiciously, then leaves. The tent rises once more, revealing Harry Potter, identifiable by his messy black hair and crooked glasses, engrossed in Violeta Stitch's Extreme Incantations. He speaks, causing a blast of light to flash from the second-story window of Number Four. The light in the hallway turns on, and soon, Uncle Vernon peers in, scrutinizing Harry's parchment before withdrawing. Meanwhile, Dudley chuckles hollowly at the TV, and Marge flashes pound notes, prompting Dudley to obediently extend his hand. As Harry clears dishes, he notices Uncle Vernon with a brandy bottle and Aunt Marge scrutinizing him. Suddenly, Aunt Marge's glass explodes, followed by her dress button sailing into the air, and she begins to inflate like a balloon. Uncle Vernon rises in horror but lets go as Aunt Marge floats away. Harry rushes inside, retrieves his belongings, including his wand and a photograph of his parents, and tows his trunk downstairs where Uncle Vernon awaits, eyeing Harry's wand nervously but with a cruel grin. Harry storms out with his trunk, and the scene shifts to the street. As Harry walks, eventually stopping at a deserted playground with creaking swings and a gently turning carousel, he sits motionless, observing the swaying scenery and trembling leaves above."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The tent blooms softly with light, briefly illuminating a bedside photograph of James and Lily Potter, Harry's parents who were members of a secret society fighting dark forces, then goes dark. The blankets bloom again when, down the hall of Number Four, Privet Drive, a typical suburban house located in the fictional town of Little Whinging, Surrey, a toilet flushes. Instantly, the shadow stiffens, the blankets dim, and the tent flattens just as the bedroom door opens, revealing Uncle Vernon, notorious for his dislike of anything out of the ordinary. He peers inside, eyes flashing suspiciously, then withdraws. The tent rises, and as the blankets blaze, we cut inside to find a skinny boy with a crow's nest of black hair, thick glasses sitting crookedly atop his nose: Harry Potter, the famous young wizard known for surviving a deadly curse as an infant. Open before him is Violeta Stitch's Extreme Incantations, a fictional book detailing powerful spells not typically taught to students. Once again, he speaks. A blinding blast of light flashes from the second story window of Number Four, which the neighbors always regard with a mix of curiosity and gossip. The light in the hallway snaps on, Harry's tent droops once more, and seconds later, Harry's door eases open. Uncle Vernon peers in and switches on the light. Slowly, he closes the door and eyes the parchment in Harry's hand, a magical document, suspiciously. Just then, Dudley, sitting comatose before the TV, emits a hollow, brain-dead chuckle, revealing his tendency to be easily amused. Marge, the overbearing relative holding disdain for Harry, flashes a thick fan of pound notes. Dudley blinks, waddles forward, and extends his plump palm obediently, indicative of his spoiled nature. Harry looks on, then sees Ripper, Marge's aggressive bulldog, snuffling about his ankle. As Harry clears the dishes, a chore imposed on him by the Dursleys, Uncle Vernon brings out a bottle of brandy, an indulgence often used to enhance his bravado. Hearing this, Harry frowns and glances at Uncle Vernon, who glares darkly at him, Harry's mere existence a challenge to Uncle Vernon's sense of normalcy. Aunt Marge pauses on her wine, eyes narrowing on Harry with suspicion. POP! The glass in Aunt Marge's hand explodes, a sign of uncontrolled magical reaction. Harry stares at the shattered glass in surprise. Aunt Marge starts to reply when a button on her dress sails into the air with a zing. Thread snaps. Aunt Marge's eyes widen. Her cheeks billow. Her whole body billows, and she begins to inflate like a monstrous balloon, her arrogance and disdain fueling the magic. To his horror, Uncle Vernon himself begins to rise. Aunt Marge looks fearfully into his eyes, and he lets go, falls to his knees, and watches Aunt Marge float away, disbelief marking his face. Harry crashes inside, takes his trunk, then puts his heel to a loose floorboard where he keeps his magical belongings hidden and removes his wand from its hiding place. Turning, he grabs the photograph of his parents, a cherished memento of his lost family. BOOM! BOOM! BOOM! The sound echoes as Harry tows the trunk down the stairs and finds Uncle Vernon waiting for him, his face a mask of veiled threats. Uncle Vernon eyes Harry's wand nervously, aware of its potential power, then grins with knowing cruelty. As Harry storms out with his trunk, we dolly to the street with him. High in the sky, a plump dot rises, Aunt Marge continuing her unplanned ascent. Harry walks and walks and walks, then stops, glancing about. An empty playground, swings creaking gently on rusted chains, tells of forgotten childhood innocence, and a tiny carousel, kissed gently by the wind, turning slowly, evokes a sense of timeless solitude. Harry drops the trunk, sits, still as a statue, pondering his uncertain future. In the trees above, leaves tremble as if mirroring his inner turmoil. Harry turns and studies the swaying swings, the carousel, signs of a world moving on without him."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Once again he speaks The tent blooms softly with light briefly illuminating a bedside photograph of James and Lily Potter then goes dark The blankets bloom again when down the hall a toilet flushes Instantly the shadow stiffens the blankets dim and the tent flattens just as the bedroom door opens revealing Uncle Vernon Harry drops the trunk sits still as a statue He peers inside eyes flashing suspiciously then withdraws Harry crashes inside takes his trunk then puts his heel to a loose floorboard and removes his wand from its hiding place The tent rises and as the blankets blaze we cut inside to find a skinny boy with a crow's nest of black hair thick glasses sitting crookedly atop his nose Harry Potter Open before him is Violeta Stitch's Extreme Incantations As Harry storms out with his trunk we dolly to the street with him Aunt Marge pauses on her wine eyes narrowing on Harry Once again he speaks The tent rises and as the blankets blaze we cut inside to find a skinny boy with a crow's nest of black hair thick glasses sitting crookedly atop his nose A blinding blast of light flashes from the second story window of Number Four Harry turns and studies the swaying swings The light in the hallway snaps on Harry's tent droops once more and seconds later Harry's door eases open Uncle Vernon peers in and switches on the light Slowly he closes the door and eyes the parchment in Harry's hand suspiciously then goes dark Turning he grabs the photograph of his parents Just then Dudley sitting comatose before the TV emits a hollow braindead chuckle Hearing this Harry frowns and glances at Uncle Vernon who glares darkly at him Marge flashes a thick fan of pound notes Just then Dudley sitting comatose before the TV emits a hollow braindead chuckle Dudley blinks waddles forward and extends his plump palm obediently The tent blooms softly with light briefly illuminating a bedside photograph of James and Lily Potter Harry looks on then sees Ripper snuffling about his ankle As Harry clears the dishes Uncle Vernon brings out a bottle of brandy Hearing this Harry frowns and glances at Uncle Vernon who glares darkly at him Aunt Marge pauses on her wine eyes narrowing on Harry POP The glass in Aunt Marge's hand explodes The blankets bloom again when down the hall a toilet flushes Harry stares at the shattered glass in surprise Aunt Marge starts to reply when a button on her dress sails into the air with a zing Thread snaps Aunt Marge's eyes widen before him is Violeta Stitch's Extreme Incantations Harry looks on then sees Ripper snuffling about his ankle Her cheeks billow Her whole body billows and she begins to inflate like a monstrous balloon To his horror Uncle Vernon himself begins to rise Aunt Marge looks fearfully into his eyes and he let us go falls to his knees and watches Aunt Marge float away Harry crashes inside takes his trunk then puts his heel to a loose floorboard and removes his wand from its hiding place Turning he grabs the photograph of his parents BOOM BOOM BOOM Harry tows the trunk down the stairs and finds Uncle Vernon waiting for him To his horror Uncle Vernon himself begins to rise Marge flashes a thick fan of pound notes In the trees above leaves tremble Uncle Vernon eyes Harry's wand nervously then grins with knowing cruelty Dudley blinks waddles forward and extends his plump palm obediently As Harry storms out with his trunk we dolly to the street with him Her whole body billows and she begins to inflate like a monstrous balloon High in the sky a plump dot rises Harry walks and walks and walks then stops glancing about An empty playground swings creaking gently on rusted chains and a tiny carousel kissed gently by the wind turning slowly Harry drops the trunk sits still as a statue In the trees above leaves tremble Harry Potter Open Harry turns and studies the swaying swings the carousel Uncle Vernon eyes Harry's wand nervously then grins with knowing cruelty"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The tent blooms softly with light briefly illuminating a bedside photograph of James and Lily Potter. then goes dark. The blankets bloom again when down the hall a toilet flushes. Instantly the shadow stiffens the blankets dim and the tent flattens just as the bedroom door opens revealing Uncle Vernon. He peers inside eyes flashing suspiciously then withdraws. The tent rises and as the blankets blaze we cut inside to find a skinny boy with a crow's nest of black hair thick glasses sitting crookedly atop his nose. Harry Potter Open. before him is Violeta Stitch's Extreme Incantations. Once again he speaks. A blinding blast of light flashes from the second story window of Number Four. The light in the hallway snaps on. Harry's tent droops once more and seconds later Harry's door eases open. Uncle Vernon peers in and switches on the light. Slowly he closes the door and eyes the parchment in Harry's hand suspiciously. Just then Dudley sitting comatose before the TV emits a hollow braindead chuckle. Marge flashes a thick fan of pound notes. Dudley blinks waddles forward and extends his plump palm obediently. Harry looks on then sees Ripper snuffling about his ankle. As Harry clears the dishes Uncle Vernon brings out a bottle of brandy. Hearing this Harry frowns and glances at Uncle Vernon who glares darkly at him. Aunt Marge pauses on her wine eyes narrowing on Harry. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. POP. The glass in Aunt Marge's hand explodes. Harry stares at the shattered glass in surprise. Aunt Marge starts to reply when a button on her dress sails into the air with a zing. Thread snaps Aunt Marge's eyes widen. Her cheeks billow. Her whole body billows and she begins to inflate like a monstrous balloon. To his horror Uncle Vernon himself begins to rise. Aunt Marge looks fearfully into his eyes and he let us go falls to his knees and watches Aunt Marge float away. Harry crashes inside takes his trunk then puts his heel to a loose floorboard and removes his wand from its hiding place. Turning he grabs the photograph of his parents. BOOM BOOM BOOM. Harry tows the trunk down the stairs and finds Uncle Vernon waiting for him. Uncle Vernon eyes Harry's wand nervously then grins with knowing cruelty. As Harry storms out with his trunk we dolly to the street with him. High in the sky a plump dot rises. Harry walks and walks and walks then stops glancing about. An empty playground swings creaking gently on rusted chains and a tiny carousel kissed gently by the wind turning slowly. Harry drops the trunk sits still as a statue. In the trees above leaves tremble. Harry turns and studies the swaying swings. the carousel."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The tent blooms softly with light briefly illuminating a bedside photograph of James and Lily Potter. then goes dark. The blankets bloom again when down the hall a toilet flushes. Instantly the shadow stiffens the blankets dim and the tent flattens just as the bedroom door opens revealing Uncle Vernon. He peers inside eyes flashing suspiciously then withdraws. The tent rises and as the blankets blaze we cut inside to find a skinny boy with a crow's nest of black hair thick glasses sitting crookedly atop his nose. Harry Potter Open. before him is Violeta Stitch's Extreme Incantations. Once again he speaks. A blinding blast of light flashes from the second story window of Number Four. The light in the hallway snaps on. Harry's tent droops once more and seconds later Harry's door eases open. Uncle Vernon peers in and switches on the light. Slowly he closes the door and eyes the parchment in Harry's hand suspiciously. Just then Dudley sitting comatose before the TV emits a hollow braindead chuckle. Marge flashes a thick fan of pound notes. Dudley blinks waddles forward and extends his plump palm obediently. Harry looks on then sees Ripper snuffling about his ankle. As Harry clears the dishes Uncle Vernon brings out a bottle of brandy. Hearing this Harry frowns and glances at Uncle Vernon who glares darkly at him. Aunt Marge pauses on her wine eyes narrowing on Harry. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. POP. The glass in Aunt Marge's hand explodes. Harry stares at the shattered glass in surprise. Aunt Marge starts to reply when a button on her dress sails into the air with a zing. Thread snaps Aunt Marge's eyes widen. Her cheeks billow. Her whole body billows and she begins to inflate like a monstrous balloon. To his horror Uncle Vernon himself begins to rise. Aunt Marge looks fearfully into his eyes and he let us go falls to his knees and watches Aunt Marge float away. Harry crashes inside takes his trunk then puts his heel to a loose floorboard and removes his wand from its hiding place. Turning he grabs the photograph of his parents. BOOM BOOM BOOM. Harry tows the trunk down the stairs and finds Uncle Vernon waiting for him. Uncle Vernon eyes Harry's wand nervously then grins with knowing cruelty. As Harry storms out with his trunk we dolly to the street with him. High in the sky a plump dot rises. Harry walks and walks and walks then stops glancing about. An empty playground swings creaking gently on rusted chains and a tiny carousel kissed gently by the wind turning slowly. Harry drops the trunk sits still as a statue. In the trees above leaves tremble. Harry turns and studies the swaying swings. the carousel."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The tent blooms softly with light briefly illuminating a bedside photograph of James and Lily Potter. then goes dark. The blankets bloom again when down the hall a toilet flushes. Instantly the shadow stiffens the blankets dim and the tent flattens just as the bedroom door opens revealing Uncle Vernon. He peers inside eyes flashing suspiciously then withdraws. The tent rises and as the blankets blaze we cut inside to find a skinny boy with a crow's nest of black hair thick glasses sitting crookedly atop his nose. Harry Potter Open. before him is Violeta Stitch's Extreme Incantations. Once again he speaks. A blinding blast of light flashes from the second story window of Number Four. The light in the hallway snaps on. BOOM BOOM BOOM. Harry tows the trunk down the stairs and finds Uncle Vernon waiting for him. Uncle Vernon eyes Harry's wand nervously then grins with knowing cruelty. As Harry storms out with his trunk we dolly to the street with him. High in the sky a plump dot rises. Harry walks and walks and walks then stops glancing about. An empty playground swings creaking gently on rusted chains and a tiny carousel kissed gently by the wind turning slowly. Harry drops the trunk sits still as a statue. In the trees above leaves tremble. Harry turns and studies the swaying swings. the carousel."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The tent blooms softly with light briefly illuminating a bedside photograph of James and Lily Potter. then goes dark. The blankets bloom again when down the hall a toilet flushes. Instantly the shadow stiffens the blankets dim and the tent flattens just as the bedroom door opens revealing Uncle Vernon. An empty playground swings creaking gently on rusted chains and a tiny carousel kissed gently by the wind turning slowly. Harry drops the trunk sits still as a statue. In the trees above leaves tremble. Harry turns and studies the swaying swings. the carousel."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The tent blooms softly with light, briefly illuminating a bedside photograph of Hermione and Ron Weasley, then goes dark. The blankets bloom again when, down the hall, a toilet flushes. Instantly, the shadow stiffens, the blankets dim, and the tent flattens just as the bedroom door opens, revealing Aunt Petunia. She peers inside, eyes flashing suspiciously, then withdraws. The tent rises, and as the blankets blaze, we cut inside to find a skinny squirrel with a crow's nest of black hair, thick glasses sitting crookedly atop its nose: Draco Malfoy. Open before it is Neville Longbottom's Extreme Incantations. Once again, it speaks. A blinding blast of light flashes from the second story window of Number Four. The light in the hallway snaps on, Draco's tent droops once more, and seconds later, Draco's door eases open. Aunt Petunia peers in and switches on the light. Slowly, she closes the door and eyes the parchment in Draco's hand suspiciously. Just then, Crookshanks, sitting comatose before the TV, emits a hollow, brain-dead chuckle. Luna flashes a thick fan of pound notes. Crookshanks blinks, waddles forward, and extends its plump paw obediently. Draco looks on, then sees Trevor snuffling about its ankle. As Draco clears the dishes, Aunt Petunia brings out a bottle of brandy. Hearing this, Draco frowns and glances at Aunt Petunia, who glares darkly at it. Myrtle pauses on her wine, eyes narrowing on Draco. POP! The glass in Myrtle's hand explodes. Draco stares at the shattered glass in surprise. Myrtle starts to reply when a button on her dress sails into the air with a zing. Thread snaps. Myrtle's eyes widen. Her cheeks billow. Her whole body billows, and she begins to inflate like a monstrous balloon. To her horror, Aunt Petunia herself begins to rise. Myrtle looks fearfully into her eyes, and she lets go, falls to her knees, and watches Myrtle float away. Draco crashes inside, takes its trunk, then puts its heel to a loose floorboard and removes its wand from its hiding place. Turning, it grabs the photograph of its parents. BOOM! BOOM! BOOM! Draco tows the trunk down the stairs and finds Aunt Petunia waiting for it. Aunt Petunia eyes Draco's wand nervously, then grins with knowing cruelty. As Draco storms out with its trunk, we dolly to the street with it. High in the sky, a plump dot rises. Draco walks and walks and walks, then stops, glancing about. An empty playground, swings creaking gently on rusted chains, and a tiny carousel, kissed gently by the wind, turning slowly. Draco drops the trunk, sits, still as a statue. In the trees above, leaves tremble. Draco turns and studies the swaying swings, the carousel."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The hammock blooms softly with light, briefly illuminating a bedside painting of James and Lily Potter, then goes dark. The quilts bloom again when, down the hall, a faucet drips. Instantly, the shadow stiffens, the quilts dim, and the hammock flattens just as the bedroom door opens, revealing Uncle Vernon. He peers inside, eyes flashing suspiciously, then withdraws. The hammock rises, and as the quilts blaze, we cut inside to find a skinny boy with a crow's nest of black hair, thick glasses sitting crookedly atop his nose: Harry Potter. Open before him is Violeta Stitch's Extreme Transformations. Once again, he speaks. A blinding blast of light flashes from the second story window of Number Four. The light in the hallway snaps on, Harry's hammock droops once more, and seconds later, Harry's door eases open. Uncle Vernon peers in and switches on the light. Slowly, he closes the door and eyes the scroll in Harry's hand suspiciously. Just then, Dudley, sitting comatose before the computer, emits a hollow, brain-dead chuckle. Marge flashes a thick fan of dollar bills. Dudley blinks, waddles forward, and extends his plump palm obediently. Harry looks on, then sees Fang snuffling about his ankle. As Harry clears the dishes, Uncle Vernon brings out a bottle of cider. Hearing this, Harry frowns and glances at Uncle Vernon, who glares darkly at him. Aunt Marge pauses on her cocktail, eyes narrowing on Harry. POP! The mug in Aunt Marge's hand explodes. Harry stares at the shattered mug in surprise. Aunt Marge starts to reply when a button on her coat sails into the air with a zing. Thread snaps. Aunt Marge's eyes widen. Her cheeks billow. Her whole body billows, and she begins to inflate like a monstrous zeppelin. To his horror, Uncle Vernon himself begins to rise. Aunt Marge looks fearfully into his eyes, and he lets go, falls to his knees, and watches Aunt Marge float away. Harry crashes inside, takes his suitcase, then puts his heel to a loose floorboard and removes his blade from its hiding place. Turning, he grabs the painting of his parents. BOOM! BOOM! BOOM! Harry tows the suitcase down the stairs and finds Uncle Vernon waiting for him. Uncle Vernon eyes Harry's blade nervously, then grins with knowing cruelty. As Harry storms out with his suitcase, we dolly to the street with him. High in the sky, a plump dot rises. Harry walks and walks and walks, then stops, glancing about. An empty plaza, benches creaking gently on rusted hinges, and a tiny fountain, kissed gently by the wind, trickling slowly. Harry drops the suitcase, sits, still as a statue. In the trees above, branches tremble. Harry turns and studies the swaying benches, the fountain."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The tent whispers softly with light, briefly brightening a bedside photograph of James and Lily Potter, then fades away. The blankets shimmer again when, down the hall, a toilet overflows. Instantly, the shadow freezes, the blankets dull, and the tent collapses just as the bedroom door creaks, revealing Uncle Vernon. He squints inside, eyes narrowing suspiciously, then steps back. The tent inflates, and as the blankets glimmer, we zoom inside to find a skinny boy with a crow's nest of black hair, thick glasses perched crookedly atop his nose: Harry Potter. Open before him is Violeta Stitch's Extreme Incantations. Once again, he whispers. A dazzling burst of light flickers from the second story window of Number Four. The light in the hallway flickers on, Harry's tent sags once more, and moments later, Harry's door slides open. Uncle Vernon peers in and flicks on the light. Gradually, he shuts the door and surveys the parchment in Harry's hand suspiciously. Just then, Dudley, sitting transfixed before the TV, releases a hollow, brain-dead giggle. Marge waves a thick fan of pound notes. Dudley blinks, waddles forward, and displays his plump palm eagerly. Harry looks on, then notices Ripper sniffing at his ankle. As Harry arranges the dishes, Uncle Vernon uncorks a bottle of brandy. Hearing this, Harry scowls and glances at Uncle Vernon, who glowers darkly at him. Aunt Marge sips on her wine, eyes narrowing on Harry. POP! The glass in Aunt Marge's hand crumbles. Harry gazes at the shattered glass in surprise. Aunt Marge starts to retort when a button on her dress zips into the air with a zing. Thread snaps. Aunt Marge's eyes widen. Her cheeks puff. Her whole body puffs, and she starts to swell like a monstrous balloon. To his horror, Uncle Vernon himself begins to ascend. Aunt Marge looks fearfully into his eyes, and he releases, drops to his knees, and observes Aunt Marge drift away. Harry dashes inside, takes his trunk, then taps his heel to a loose floorboard and extracts his wand from its hiding place. Turning, he snatches the photograph of his parents. BOOM! BOOM! BOOM! Harry drags the trunk down the stairs and encounters Uncle Vernon waiting for him. Uncle Vernon eyes Harry's wand anxiously, then smirks with knowing cruelty. As Harry strides out with his trunk, we pan to the street with him. High in the sky, a plump speck floats. Harry strolls and strolls and strolls, then halts, glancing around. An empty playground, swings swaying gently on rusted chains, and a tiny carousel, touched gently by the wind, spinning slowly. Harry sets down the trunk, sits, still as a statue. In the trees above, leaves shimmer. Harry turns and examines the swaying swings, the carousel."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The lantern blossoms softly with brightness, briefly illuminating a windowsill painting of Tom and Daisy Buchanan, then goes dim. The curtains blossom again when, down the corridor, a faucet flushes. Instantly, the silhouette stiffens, the curtains dim, and the lantern flattens just as the living room gate opens, revealing Mr. Hyde. It peers outside, eyes glinting warily, then withdraws. The lantern rises, and as the curtains flare, we cut inside to find a slender dog with a rabbit's nest of white fur, thick spectacles sitting crookedly atop its beak: Oliver Twist. Open before it is Maxwell Cloverfield's Advanced Spellwork. Once again, it murmurs. A dazzling burst of light flashes from the fourth story tower of Number Eleven. The light in the corridor flickers on, Oliver’s lantern droops once more, and moments later, Oliver’s gate slides open. Mr. Hyde peers in and flips the light on. Gradually, it closes the gate and eyes the blueprint in Oliver’s paw warily. Just then, Nigel, reclining lifelessly before the radio, emits a hollow, lifeless snicker. Gertrude flashes a thick bouquet of euro notes. Nigel blinks, waddles forward, and stretches its chubby claw dutifully. Oliver observes, then notices Bandit snuffling around its elbow. As Oliver clears the books, Mr. Hyde brings out a jug of cider. Hearing this, Oliver scowls and glances at Mr. Hyde, who sneers darkly at it. Aunt Gertrude pauses on her champagne, eyes narrowing on Oliver. POP! The mug in Aunt Gertrude’s claw bursts. Oliver stares at the shattered mug in shock. Aunt Gertrude begins to retort when a zipper on her vest whirls into the ceiling with a zing. Stitch snaps. Aunt Gertrude’s eyes widen. Her jowls balloon. Her entire body balloons, and she begins to swell like a colossal float. To its terror, Mr. Hyde itself begins to ascend. Aunt Gertrude looks fearfully into its eyes, and it lets go, falls to its elbows, and watches Aunt Gertrude drift away. Oliver dashes outside, takes its satchel, then puts its knee to a loose shingle and retrieves its twig from its hiding nook. Turning, it snatches the painting of its relatives. BOOM! BOOM! BOOM! Oliver drags the satchel down the ladder and finds Mr. Hyde poised for it. Mr. Hyde eyes Oliver’s twig timidly, then smirks with knowing malice. As Oliver storms away with its satchel, we dolly to the avenue with it. High above, a chubby speck ascends. Oliver trudges and trudges and trudges, then halts, surveying around. A deserted square, benches squeaking gently on corroded hinges, and a miniature Ferris wheel, brushed gently by the breeze, rotating slowly. Oliver drops the satchel, perches, still as an idol. In the branches overhead, petals quiver. Oliver turns and examines the swaying benches, the wheel."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The lantern blossoms quietly with shadows, briefly concealing a bedside photograph of Gerald and Mabel Weasley, then fades away. The curtains puff again when, down the corridor, a faucet drips. Instantly, the silhouette relaxes, the curtains brighten, and the lantern collapses just as the living room door creaks open, revealing Aunt Petunia. She scans the room, eyes darting cautiously, then retreats. The lantern ascends, and as the curtains flare, we cut inside to find a lanky girl with a tangled mess of blonde hair, thin spectacles perched unevenly on her nose: Luna Lovegood. Open before her is Barnaby Bristow's Potent Spells. Once again, she whispers. A glaring burst of shadows flickers from the second story window of Number Six. The shadows in the corridor flicker on, Luna's lantern sags once more, and moments later, Luna's door nudges open. Aunt Petunia peers in and flicks on the shadows. Gradually, she shuts the door and examines the scroll in Luna's hand cautiously. Just then, Piers, lounging mindlessly before the radio, releases a dull, absent-minded snicker. Barnaby waves a thick bundle of dollar bills. Piers squints, shuffles forward, and holds out his chubby hand obediently. Luna observes, then notices Fang sniffing around her ankle. As Luna wipes the windows, Aunt Petunia pulls out a jar of honey. Witnessing this, Luna grimaces and peers at Aunt Petunia, who scowls angrily at her. Uncle Albert pauses on his scotch, eyes narrowing on Luna. SNAP! The bottle in Uncle Albert's hand shatters. Luna gapes at the broken bottle in shock. Uncle Albert begins to protest when a button on his jacket flies into the air with a whiz. Fabric rips. Uncle Albert's eyes bulge. His arms puff. His entire body swells, and he begins to ascend like a gargantuan blimp. To her dismay, Aunt Petunia herself begins to float. Uncle Albert looks nervously into her eyes, and she lets go, sinks to her knees, and watches Uncle Albert drift away. Luna scampers inside, takes her suitcase, then presses her toe to a loose tile and retrieves her broom from its hiding spot. Spinning, she seizes the photograph of her friends. BAM! BAM! BAM! Luna drags the suitcase down the hallway and finds Aunt Petunia waiting for her. Aunt Petunia eyes Luna’s broom anxiously, then chuckles with secretive malice. As Luna dashes out with her suitcase, we zoom to the road with her. High in the air, a tiny shape floats. Luna marches and marches and marches, then pauses, surveying her surroundings. A deserted park, seesaws groaning softly on rusted hinges, and a little slide, touched lightly by the breeze, moving slowly. Luna drops the suitcase, sits, unmoving like a sculpture. In the boughs above, branches shiver. Luna turns and examines the swinging seesaws, the slide."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The igloo glows softly with shadow, briefly camouflaging a bookshelf of James and Lily Potter, then goes silent. The pillows twinkle again when, down the hall, a faucet drips. Instantly, the silhouette relaxes, the pillows fade, and the igloo inflates just as the kitchen door slides open, revealing Uncle Vernon. He glances inward, eyes flashing curiously, then retreats. The igloo sinks, and as the pillows sparkle, we zoom inside to find a skinny boy with a hedgehog's nest of black hair, thick spectacles sitting lopsidedly atop his nose: Harry Potter. Spread before him is Violeta Stitch's Extreme Recipes. Once again, he sings. A dazzling shower of sparks bursts from the second-story cellar of Number Four. The chandelier in the hallway blinks on, Harry's igloo deflates once more, and moments later, Harry's door swings open. Uncle Vernon peers in and flips on the ceiling fan. Slowly, he swings the door closed and examines the scroll in Harry's hand curiously. Just then, Dudley, sitting unmoving before the typewriter, exhales a hollow, brain-dead giggle. Marge flashes a thick bouquet of sunflowers. Dudley blinks, waddles backward, and extends his plump paw obediently. Harry looks on, then sees Ripper burrowing near his elbow. As Harry arranges the books, Uncle Vernon pulls out a jar of pickles. Hearing this, Harry grimaces and looks toward Uncle Vernon, who frowns darkly at him. Aunt Marge pauses on her cider, eyes sharpening on Harry. SNAP! The cup in Aunt Marge's hand evaporates. Harry gazes at the dissipated cup in awe. Aunt Marge starts to exclaim when a zipper on her purse spins into the ceiling with a zip. Seam breaks. Aunt Marge's eyes widen. Her cheeks puff. Her entire body swells, and she begins to float like an enormous dirigible. To his dismay, Uncle Vernon himself begins to sink. Aunt Marge looks pleadingly into his eyes, and he lets go, crumbles to his knees, and witnesses Aunt Marge drift away. Harry crashes outside, takes his suitcase, then puts his toe to a loose floor beam and retrieves his broom from its hiding place. Turning, he seizes the bookshelf of his parents. CRASH! CRASH! CRASH! Harry drags the suitcase up the steps and finds Uncle Vernon anticipating him. Uncle Vernon eyes Harry's broom cautiously, then smirks with knowing malice. As Harry strides out with his suitcase, we pan to the horizon with him. High in the clouds, a plump speck floats. Harry ambles and ambles and ambles, then pauses, surveying the surroundings. An empty bus stop, benches creaking gently on rusted hinges, and a tiny fountain, nudged gently by the breeze, flowing slowly. Harry places the suitcase, rests, still as a sculpture. In the branches above, twigs shiver. Harry turns and examines the swinging benches, the fountain."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The flower glows fleetingly with brightness, momentarily revealing a distant painting of Ella and Tom Smith, then fades away. The rugs illuminate once more when, down the corridor, a sink gurgles. Suddenly, the silhouette twitches, the rugs dim, and the flower withers just as the kitchen gate swings, exposing Aunt Julie. She squints inside, gaze flickering with doubt, then retreats. The flower stands tall, and as the rugs gleam, we shift inside to see a frail girl with a bird’s nest of blonde curls, oversized spectacles perched awkwardly atop her head: Luna Lovegood. Open in front of her is Marcus Shine’s Grand Potions. Once more, she whispers. A dazzling burst of brightness erupts from the attic skylight of Number Twelve. The light in the corridor flicks on, Luna's flower droops once again, and moments later, Luna's gate slides ajar. Aunt Julie peers in and flicks on the brightness. Gradually, she shuts the gate and examines the scroll in Luna's grasp cautiously. Just then, Benny, lounging mindlessly before the radio, emits a hollow, vacant chuckle. George waves a thick stack of euro bills. Benny squints, waddles forward, and extends his chubby paw compliantly. Luna observes quietly, then notices Max snuffling around her shoe. As Luna clears the glasses, Aunt Julie fetches a pitcher of cider. Hearing this, Luna scowls and peers at Aunt Julie, who glowers menacingly at her. Uncle George pauses on his juice, gaze tightening on Luna. POP! The goblet in Uncle George's grip shatters. Luna gapes at the broken goblet in astonishment. Uncle George starts to retort when a coin from his vest propels into the ceiling with a twang. Fabric tears. Uncle George's eyes widen. His cheeks puff up. His whole body swells, and he begins to balloon like an enormous sphere. To her alarm, Aunt Julie herself begins to rise. Uncle George looks nervously into her gaze, and she releases, drops to her shins, and observes Uncle George drift away. Luna dashes inside, grabs her suitcase, then nudges her heel against a hidden tile and retrieves her cape from its secret location. Turning, she seizes the painting of her family. BANG! BANG! BANG! Luna drags the suitcase along the hallway and discovers Aunt Julie waiting for her. Aunt Julie examines Luna's cape anxiously, then smirks with cynical malice. As Luna storms out with her suitcase, we glide to the avenue with her. High in the clouds, a rotund speck ascends. Luna strolls and strolls and strolls, then halts, scanning her surroundings. An abandoned courtyard, swings groaning softly on rusted ropes, and a tiny merry-go-round, caressed gently by the breeze, rotating slowly. Luna places the suitcase down, sits, motionless as a sculpture. In the branches above, twigs shake. Luna turns and examines the swinging swings, the merry-go-round."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The tent briefly illuminates a photo of James and Lily Potter before going dark. A toilet flushes, and the shadow freezes. When Uncle Vernon checks the room suspiciously, it reveals Harry Potter reading \"Violeta Stitch's Extreme Incantations.\" A flash of light from the window draws attention, and Uncle Vernon enters to inspect Harry's parchment. Dudley chuckles in front of the TV, distracted by Marge's money. As Harry watches the dog Ripper, Aunt Marge's wine glass explodes. Her body inflates, and she floats away, much to Uncle Vernon's horror. Harry, shocked, collects his belongings and sneaks his wand from beneath a floorboard along with a photo of his parents. As he leaves, Uncle Vernon watches him with a cruel grin. Harry ventures down the street with his trunk, and a floating Marge disappears into the sky. He stops at a deserted playground, contemplating the swaying swings and carousel, as the leaves rustle above."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "the carousel Harry turns and studies the swaying swings In the trees above leaves tremble Harry drops the trunk sits still as a statue An empty playground swings creaking gently on rusted chains and a tiny carousel kissed gently by the wind turning slowly Harry walks and walks and walks then stops glancing about High in the sky a plump dot rises As Harry storms out with his trunk we dolly to the street with him Uncle Vernon eyes Harry's wand nervously then grins with knowing cruelty Harry tows the trunk down the stairs and finds Uncle Vernon waiting for him BOOM BOOM BOOM Turning he grabs the photograph of his parents Harry crashes inside takes his trunk then puts his heel to a loose floorboard and removes his wand from its hiding place Aunt Marge looks fearfully into his eyes and he let us go falls to his knees and watches Aunt Marge float away To his horror Uncle Vernon himself begins to rise Her whole body billows and she begins to inflate like a monstrous balloon Her cheeks billow Thread snaps Aunt Marge's eyes widen Aunt Marge starts to reply when a button on her dress sails into the air with a zing Harry stares at the shattered glass in surprise The glass in Aunt Marge's hand explodes POP Aunt Marge pauses on her wine eyes narrowing on Harry Hearing this Harry frowns and glances at Uncle Vernon who glares darkly at him As Harry clears the dishes Uncle Vernon brings out a bottle of brandy Harry looks on then sees Ripper snuffling about his ankle Dudley blinks waddles forward and extends his plump palm obediently Marge flashes a thick fan of pound notes Just then Dudley sitting comatose before the TV emits a hollow braindead chuckle Slowly he closes the door and eyes the parchment in Harry's hand suspiciously Uncle Vernon peers in and switches on the light Harry's tent droops once more and seconds later Harry's door eases open The light in the hallway snaps on A blinding blast of light flashes from the second story window of Number Four Once again he speaks before him is Violeta Stitch's Extreme Incantations Harry Potter Open The tent rises and as the blankets blaze we cut inside to find a skinny boy with a crow's nest of black hair thick glasses sitting crookedly atop his nose He peers inside eyes flashing suspiciously then withdraws Instantly the shadow stiffens the blankets dim and the tent flattens just as the bedroom door opens revealing Uncle Vernon The blankets bloom again when down the hall a toilet flushes then goes dark The tent blooms softly with light briefly illuminating a bedside photograph of James and Lily Potter"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "A blinding blast of light flashes from the second story window of Number Four Instantly the shadow stiffens the blankets dim and the tent flattens just as the bedroom door opens revealing Uncle Vernon The light in the hallway snaps on Her cheeks billow An empty playground swings creaking gently on rusted chains and a tiny carousel kissed gently by the wind turning slowly As Harry clears the dishes Uncle Vernon brings out a bottle of brandy the carousel Thread snaps Aunt Marge's eyes widen He peers inside eyes flashing suspiciously then withdraws Harry tows the trunk down the stairs and finds Uncle Vernon waiting for him The glass in Aunt Marge's hand explodes Harry's tent droops once more and seconds later Harry's door eases open Aunt Marge looks fearfully into his eyes and he let us go falls to his knees and watches Aunt Marge float away POP Uncle Vernon peers in and switches on the light Aunt Marge starts to reply when a button on her dress sails into the air with a zing High in the sky a plump dot rises Harry walks and walks and walks then stops glancing about BOOM BOOM BOOM Slowly he closes the door and eyes the parchment in Harry's hand suspiciously Harry stares at the shattered glass in surprise Aunt Marge pauses on her wine eyes narrowing on Harry To his horror Uncle Vernon himself begins to rise Harry drops the trunk sits still as a statue Harry crashes inside takes his trunk then puts his heel to a loose floorboard and removes his wand from its hiding place Hearing this Harry frowns and glances at Uncle Vernon who glares darkly at him Dudley blinks waddles forward and extends his plump palm obediently Harry turns and studies the swaying swings As Harry storms out with his trunk we dolly to the street with him Turning he grabs the photograph of his parents The tent blooms softly with light briefly illuminating a bedside photograph of James and Lily Potter The blankets bloom again when down the hall a toilet flushes Her whole body billows and she begins to inflate like a monstrous balloon The tent rises and as the blankets blaze we cut inside to find a skinny boy with a crow's nest of black hair thick glasses sitting crookedly atop his nose Uncle Vernon eyes Harry's wand nervously then grins with knowing cruelty Harry Potter Open Once again he speaks Just then Dudley sitting comatose before the TV emits a hollow braindead chuckle Marge flashes a thick fan of pound notes Harry looks on then sees Ripper snuffling about his ankle then goes dark before him is Violeta Stitch's Extreme Incantations In the trees above leaves tremble"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The glass in Aunt Marge's hand explodes Harry stares at the shattered glass in surprise Aunt Marge starts to reply when a button on her dress sails into the air with a zing Thread snaps Aunt Marge's eyes widen Her cheeks billow Her whole body billows and she begins to inflate like a monstrous balloon To his horror Uncle Vernon himself begins to rise Aunt Marge looks fearfully into his eyes and he let us go falls to his knees and watches Aunt Marge float away Harry crashes inside takes his trunk then puts his heel to a loose floorboard and removes his wand from its hiding place Turning he grabs the photograph of his parents BOOM BOOM BOOM Harry tows the trunk down the stairs and finds Uncle Vernon waiting for him Uncle Vernon eyes Harry's wand nervously then grins with knowing cruelty As Harry storms out with his trunk we dolly to the street with him High in the sky a plump dot rises Harry walks and walks and walks then stops glancing about An empty playground swings creaking gently on rusted chains and a tiny carousel kissed gently by the wind turning slowly Harry drops the trunk sits still as a statue In the trees above leaves tremble Harry turns and studies the swaying swings the carousel The tent blooms softly with light briefly illuminating a bedside photograph of James and Lily Potter then goes dark The blankets bloom again when down the hall a toilet flushes Instantly the shadow stiffens the blankets dim and the tent flattens just as the bedroom door opens revealing Uncle Vernon He peers inside eyes flashing suspiciously then withdraws The tent rises and as the blankets blaze we cut inside to find a skinny boy with a crow's nest of black hair thick glasses sitting crookedly atop his nose Harry Potter Open before him is Violeta Stitch's Extreme Incantations Once again he speaks A blinding blast of light flashes from the second story window of Number Four The light in the hallway snaps on Harry's tent droops once more and seconds later Harry's door eases open Uncle Vernon peers in and switches on the light Slowly he closes the door and eyes the parchment in Harry's hand suspiciously Just then Dudley sitting comatose before the TV emits a hollow braindead chuckle Marge flashes a thick fan of pound notes Dudley blinks waddles forward and extends his plump palm obediently Harry looks on then sees Ripper snuffling about his ankle As Harry clears the dishes Uncle Vernon brings out a bottle of brandy Hearing this Harry frowns and glances at Uncle Vernon who glares darkly at him Aunt Marge pauses on her wine eyes narrowing on Harry POP"
        }
      ]
    }
  ]
}