{
  "ground_truth": "Black howls, then bitterly amused, while Lupin eyes him and then turns back. Lupin eyes Black again and nods as the wands fly from their hands. The others turn to find Snape standing in the doorway, smiling smugly. As Black approaches, Snape puts his wand to Black's neck, and Snape's eyes harden as he gestures to the door. As the others start to go, Harry glances at the table where Lupin has left Harry's wand, and in a flash, it's in his hand. Snape soars into the air, hits the wall with a thud, and slides down, while Ron and Hermione stare in shock. Harry looks a bit shocked himself, then turns to Black and, as Harry points at Black, Black laughs mirthlessly and points at Ron. Ron goes white with fear as Scabbers squirms violently. Lupin and Black turn to Ron, who holds Scabbers protectively. Sirius and Lupin exchange a glance, neither speaks, while Pettigrew's small, watery eyes dart toward the windows and door. Suddenly, he makes a break for it, but Sirius merely shoves him back. Pettigrew's nose twitches, his gaze finding Harry, and his hands flutter nervously, revealing a missing index finger. As Pettigrew emerges from the gap, he prattles desperately. Harry studies Pettigrew briefly, then looks away and turns to see Hermione staring at the full moon. His eyes shift to Lupin, who is a rigid silhouette, his fingers twitching. Lupin shakes his head as Pettigrew's eyes dart, taking in the situation, then slowly shift to note the wand trembling in Lupin's lengthening fist. As Lupin's wand drops, Pettigrew leaps. Harry looks into his glassy eyes, and Harry's Patronus blooms briefly and dies. Harry's eyes flutter as the Dementors twist madly in his vision, drawing closer, and Black gasps, silvery feathers of light tumble from his lips as if his very soul were leaving him. Then a light splinters the trees, and Harry squints to see a fiery stag appear, its body luminous, slashing through the trees, sowing light in the darkness. Still, the stag charges on as the light expands, with the forest blazing with it, and the remaining Dementors flee, drifting across the moon like ash. The light ebbs, the stag's luminous body flickers, and there is a bright flash and darkness returns, a single thread of light all that remains, spinning down to the size of a pearl in the palm of a man standing deep in the trees. Harry studies the strangely familiar silhouette, then it is gone out of Hermione's shadow, which ripples against the curtain that encircles Harry's bed. Ron lies opposite with his leg bandaged as Hermione paces, stops, and Dumbledore hands Harry and Hermione each a stick of chocolate, then starts to go, stops, smiles, and exits. Harry glances curiously at the chocolate, but Hermione doesn't reply, instead looping the pendant's long chain around Harry's neck as well as her own.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Certainly! Here's the transformed text with synonyms:\n\n---\n\nBlack wails, then acridly entertained, while Lupin regards him and then rotates back. Lupin regards Black again and acknowledges as the rods glide from their grips. The others pivot to discover Snape lingering in the threshold, grinning smugly. As Black advances, Snape places his wand to Black's throat, and Snape's gaze stiffens as he signals to the gateway. As the others begin to depart, Harry glimpses at the surface where Lupin has left Harry's wand, and in a blink, it's in his grasp. Snape ascends into the atmosphere, strikes the partition with a thud, and slips downward, while Ron and Hermione gaze in disbelief. Harry gazes a bit surprised himself, then turns to Black and, as Harry aims at Black, Black laughs mirthlessly and gestures at Ron. Ron becomes pale with terror as Scabbers writhes forcefully. Lupin and Black rotate to Ron, who clutches Scabbers defensively. Sirius and Lupin swap a glance, neither articulates, while Pettigrew's small, watery eyes dart toward the panes and gateway. Suddenly, he makes a dash for it, but Sirius merely shoves him back. Pettigrew's nose twitches, his stare finding Harry, and his hands flutter nervously, revealing a missing index digit. As Pettigrew emerges from the crevice, he babbles desperately. Harry observes Pettigrew briefly, then looks aside and rotates to see Hermione gazing at the complete moon. His eyes shift to Lupin, who is a rigid outline, his fingers twitching. Lupin shakes his head as Pettigrew's eyes dart, taking in the scenario, then slowly shift to note the wand trembling in Lupin's lengthening grasp. As Lupin's wand descends, Pettigrew vaults. Harry looks into his glossy eyes, and Harry's Patronus blooms briefly and perishes. Harry's eyes flutter as the Dementors twist crazily in his sight, drawing nearer, and Black gasps, silvery plumes of light tumble from his lips as if his very essence were departing him. Then a light splinters the trees, and Harry squints to see a fiery stag appear, its form radiant, slashing through the trees, sowing light in the obscurity. Still, the stag rushes on as the light expands, with the woodland blazing with it, and the remaining Dementors escape, drifting across the moon like ash. The light wanes, the stag's radiant form flickers, and there is a bright flash and darkness returns, a single thread of light all that remains, spinning down to the size of a pearl in the palm of a man standing deep in the trees. Harry observes the strangely familiar outline, then it is gone out of Hermione's shadow, which ripples against the drape that encircles Harry's bed. Ron lies opposite with his leg bandaged as Hermione paces, halts, and Dumbledore hands Harry and Hermione each a rod of chocolate, then starts to go, halts, grins, and exits. Harry glances curiously at the chocolate, but Hermione doesn't reply, instead looping the pendant's extensive chain around Harry's neck as well as her own."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Black howls, then is bitterly amused, while he is eyed by Lupin and then Lupin turns back. Black is eyed again by Lupin and Lupin nods as the wands are flown from their hands. Snape is found standing in the doorway, smiling smugly, by the others who turn. As Black approaches, the wand is put to Black's neck by Snape, and Snape's eyes harden as the door is gestured to by him. As the others start to go, Harry glances at the table where Harry's wand has been left by Lupin, and in a flash, it's in his hand. Snape is soared into the air, the wall is hit with a thud by him, and he slides down, while Ron and Hermione stare in shock. Harry is looked a bit shocked himself by him, then Black is turned to by him and, as Black is pointed at by Harry, Black laughs mirthlessly and Ron is pointed at by him. The fear in Ron turns him white as Scabbers squirms violently. Ron, who holds Scabbers protectively, is turned to by Lupin and Black. A glance is exchanged by Sirius and Lupin, neither speaks, while Pettigrew's small, watery eyes dart toward the windows and door. Suddenly, he makes a break for it, but he is merely shoved back by Sirius. Pettigrew's nose twitches, and Harry is found by his gaze, and his hands flutter nervously, revealing a missing index finger. As Pettigrew emerges from the gap, desperate prattling is done by him. Harry studies Pettigrew briefly, then away is looked by him and Hermione is turned to, who is staring at the full moon. His eyes shift to Lupin, who is a rigid silhouette, his fingers twitching. Lupin shakes his head as Pettigrew's eyes dart, taking in the situation, then slowly the wand trembling in Lupin's lengthening fist is noted by him. As Lupin's wand is dropped, Pettigrew leaps. Harry looks into his glassy eyes, and Harry's Patronus blooms briefly and dies. Harry's eyes flutter as the Dementors twist madly in his vision, drawing closer, and Black gasps as silvery feathers of light tumble from his lips as if leaving him were his very soul. Then the trees are splintered by a light, and a fiery stag is squinted at by Harry to see it appear, its body luminous, slashing through the trees, sowing light in the darkness. Still, as the light expands, the stag charges on, with the forest blazing with it, and the remaining Dementors flee, drifting across the moon like ash. The light ebbs, the stag's luminous body flickers, and there is a bright flash and darkness returns, a single thread of light all that remains, spinning down to the size of a pearl in the palm of a man who stands deep in the trees. The strangely familiar silhouette is studied by Harry, then gone it is out of Hermione's shadow, which ripples against the curtain that encircles Harry's bed. Opposite, Ron lies with his leg bandaged as Hermione paces, stops, and a stick of chocolate is handed to Harry and Hermione by Dumbledore, then he starts to go, stops, smiles, and exits. The chocolate is glanced at curiously by Harry, but Hermione doesn't reply, instead she loops the pendant's long chain around both Harry's neck and her own."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Black howls bitterly amused, while Lupin eyes him and nods as their wands fly away. The others see Snape in the doorway, smiling smugly. As Black approaches, Snape puts his wand to Black's neck and gestures to the door. As they start to leave, Harry notices his wand on the table, grabs it, and Snape is thrown into the air, hitting the wall. Ron and Hermione stare in shock, and Harry looks surprised, then points at Black, who laughs and points at Ron. Ron turns pale as Scabbers squirms. Lupin and Black turn to Ron, who holds Scabbers protectively. Sirius and Lupin exchange a glance, while Pettigrew's eyes dart to the windows and door. He tries to escape, but Sirius shoves him back. Pettigrew's nose twitches, his gaze finds Harry, and his hands reveal a missing finger. As Pettigrew emerges, he prattles desperately. Harry studies him briefly, then turns to see Hermione staring at the full moon. His eyes shift to Lupin, a rigid silhouette, his fingers twitching. Lupin shakes his head as Pettigrew's eyes dart, noting the wand in Lupin's lengthening fist. As Lupin's wand drops, Pettigrew leaps. Harry looks into his eyes, and his Patronus blooms briefly and dies. Harry's eyes flutter as Dementors twist closer, and Black gasps, silvery light tumbling from his lips. A light splinters the trees, and a fiery stag appears, luminous, slashing through the trees, sowing light. The stag charges on, the forest blazing, and Dementors flee, drifting across the moon like ash. The light ebbs, the stag flickers, and a bright flash returns darkness, leaving a single thread of light, spinning down to a pearl in a man's palm deep in the trees. Harry studies the familiar silhouette, then it vanishes from Hermione's shadow, rippling against the curtain around Harry's bed. Ron lies opposite with a bandaged leg as Hermione paces. Dumbledore hands Harry and Hermione chocolate, smiles, and exits. Harry glances at the chocolate, but Hermione loops the pendant's chain around both their necks."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Black howls bitterly amused, while Lupin eyes him and nods as their wands fly away. The others see Snape smugly in the doorway. As Black approaches, Snape puts his wand to Black's neck, gesturing to the door. As they start to leave, Harry grabs his wand from the table. Snape hits the wall and slides down, while Ron and Hermione stare in shock. Harry, shocked, points at Black, who laughs and points at Ron. Ron goes pale as Scabbers squirms. Lupin and Black turn to Ron, who holds Scabbers protectively. Sirius and Lupin exchange glances, while Pettigrew's eyes dart to the windows and door. He tries to escape, but Sirius shoves him back. Pettigrew's nose twitches, revealing a missing finger. As Pettigrew emerges, he prattles desperately. Harry studies him, then looks at Hermione staring at the full moon. His eyes shift to Lupin, a rigid silhouette, fingers twitching. Lupin shakes his head as Pettigrew's eyes dart, noting the wand in Lupin's lengthening fist. As Lupin's wand drops, Pettigrew leaps. Harry's Patronus blooms briefly and dies. Dementors twist closer, and Black gasps, silvery light leaving him. A fiery stag appears, sowing light in the darkness, and the Dementors flee. The stag's light ebbs, flickers, and a bright flash leaves a single thread of light, spinning to a pearl in a man's palm deep in the trees. Harry studies the familiar silhouette, then it vanishes. Hermione's shadow ripples against the curtain around Harry's bed. Ron lies with a bandaged leg as Hermione paces. Dumbledore gives Harry and Hermione chocolate, smiles, and exits. Harry glances at the chocolate, but Hermione loops the pendant's chain around both their necks."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Black lets out a howl, filled with a mix of bitterness and amusement, while Lupin observes him intently before turning his attention back to the situation at hand. Lupin casts another glance at Black and gives a nod as the wands are suddenly and swiftly disarmed from their hands. The others in the room turn their attention to see Snape standing confidently in the doorway, a smug smile playing on his lips. As Black makes his approach, Snape raises his wand to Black's neck, his eyes hardening with determination as he gestures toward the door. As the others begin to make their way out, Harry's eyes catch sight of the table where Lupin has left his wand, and in a swift motion, it is back in his hand. Snape is lifted into the air, colliding with the wall with a resounding thud before sliding down, while Ron and Hermione look on in utter shock. Harry himself appears somewhat taken aback, then turns his attention to Black. As Harry points his wand at Black, Black lets out a mirthless laugh and directs his own gesture toward Ron. Ron's face turns pale with fear as Scabbers, the rat, squirms violently in his grasp. Lupin and Black both turn their attention to Ron, who clutches Scabbers protectively. Sirius and Lupin exchange a meaningful glance, neither uttering a word, while Pettigrew's small, watery eyes dart nervously toward the windows and door. Suddenly, Pettigrew makes a desperate attempt to escape, but Sirius simply shoves him back into place. Pettigrew's nose twitches anxiously, his gaze landing on Harry, and his hands flutter nervously, revealing the absence of an index finger. As Pettigrew emerges from the gap, he begins to prattle desperately. Harry studies Pettigrew for a brief moment, then looks away and turns to see Hermione staring intently at the full moon. His eyes shift to Lupin, who stands as a rigid silhouette, his fingers twitching with tension. Lupin shakes his head as Pettigrew's eyes dart around, assessing the situation, then slowly shift to notice the wand trembling in Lupin's lengthening fist. As Lupin's wand drops to the ground, Pettigrew seizes the opportunity and leaps. Harry looks into Pettigrew's glassy eyes, and Harry's Patronus briefly blooms before fading away. Harry's eyes flutter as the Dementors twist madly in his vision, drawing ever closer, and Black gasps, silvery feathers of light tumbling from his lips as if his very soul were leaving him. Then, a light splinters through the trees, and Harry squints to see a fiery stag appear, its body luminous and radiant, slashing through the trees and sowing light in the darkness. Still, the stag charges onward as the light expands, with the forest blazing with its brilliance, and the remaining Dementors flee, drifting across the moon like ash. The light gradually ebbs, the stag's luminous body flickers, and there is a bright flash before darkness returns, leaving a single thread of light that remains, spinning down to the size of a pearl in the palm of a man standing deep within the trees. Harry studies the strangely familiar silhouette, then it vanishes out of Hermione's shadow, which ripples against the curtain that encircles Harry's bed. Ron lies opposite with his leg bandaged as Hermione paces back and forth, then stops, and Dumbledore hands Harry and Hermione each a stick of chocolate, then starts to leave, pauses, smiles warmly, and exits the room. Harry glances curiously at the chocolate, but Hermione doesn't respond, instead looping the pendant's long chain around both Harry's neck and her own."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a howl that simultaneously echoed the deep bitterness and surprising amusement within him, Black let out a cry, while Lupin closely watched him, his gaze full of concern and curiosity, before he redirected his focus back to the pressing situation at hand. Lupin took an observant glance once more at Black, giving a subtle nod of understanding, as if acknowledging an unspoken pact, just as the wands were abruptly and swiftly disarmed from their grasp. The sudden shift in the room's dynamic drew the attention of everyone present, their eyes snapping to the doorway where Snape stood, looking quite self-assured and confident, a smug smile curling his lips. As Black moved forward with purpose, Snape elevated his wand, aiming it threateningly at Black’s neck, his eyes hardening with fierce determination as he motioned toward the door as if compelling compliance. While the others began to cautiously make their way toward the exit, Harry's sharp eyes noticed the table, spotting Lupin’s wand left abandoned there. With a deft and swift motion, the wand was back in Harry's grasp. Snape was magically lifted into the air, colliding forcefully with the wall in a loud, resounding thud before slowly sliding down, while Ron and Hermione watched, utterly shocked and wide-eyed at what they were witnessing. Even Harry seemed momentarily taken aback by the events, then quickly shifted his focus to Black. As Harry pointed his wand in Black’s direction, Black emitted a dry, humorless laugh, countering by directing his own gesture toward Ron. Ron’s face instantly drained of color, turning a stark, fearful pale as Scabbers, the rat, wriggled violently in his grip. Both Lupin and Black, their attention now fixed firmly on Ron, watched him as he clutched Scabbers protectively to his chest. Sirius and Lupin exchanged a significant glance, rich with meaning, their silence conveying volumes, while Pettigrew, with his small, watery eyes, nervously shifted his gaze toward the windows and door as if contemplating escape routes. Then, with sudden desperation, Pettigrew tried to make a frantic attempt to escape, but Sirius effortlessly shoved him back into his place, thwarting his effort. Pettigrew’s nose twitched with anxiety as he looked toward Harry, his hands fluttering nervously, betraying him and revealing the absence of an index finger. As Pettigrew emerged from the gap, he began to babble frantically, his words tumbling out in a desperate stream. Harry studied Pettigrew briefly, taking in his panicked state, before looking away to see Hermione, who was staring intently, transfixed by the full moon. His gaze then shifted to Lupin, who stood silhouetted against the backdrop, his fingers twitching visibly with tension. Lupin shook his head slowly as Pettigrew's eyes darted around the room, taking stock of the situation, before ultimately settling on Lupin’s wand, which was trembling in his slowly lengthening fist. As Lupin's wand fell to the ground, Pettigrew seized the opportunity, leaping forward in a bid for freedom. Harry locked eyes with Pettigrew, taking in his glassy, desperate stare, as Harry's Patronus briefly emerged before fading away. Harry's eyes flickered as the Dementors spun wildly in his vision, closing in with menacing intent, while Black gasped, silvery feathers of light spilling from his mouth as though his very soul was slipping away. Then, through the darkness, a bright light shattered through the trees, causing Harry to squint in an attempt to discern the source—a vibrant stag appeared, its body glowing brilliantly and radiantly, slicing through the trees and casting light amidst the darkness. The stag continued its charge as the light expanded, setting the forest ablaze with its fierce brilliance, prompting the remaining Dementors to retreat, drifting like ash across the moon. Gradually, as the stag's luminous form flickered, the light began to fade, culminating in a bright flash before darkness prevailed once more, leaving a single thread of light that remained behind, shrinking down to the size of a pearl held in the palm of a man standing deep within the forest. Harry studied the silhouette, which appeared strangely familiar, only for it to vanish suddenly into Hermione's shadow, which rippled softly against the curtain surrounding Harry’s bed. Ron lay directly opposite, his leg securely bandaged, while Hermione paced worriedly back and forth, only stopping when Dumbledore appeared, offering each Harry and Hermione a stick of rich chocolate before turning to leave. He paused momentarily, casting a warm, reassuring smile back at them, then exited the room quietly. Harry looked curiously at the chocolate in his hand, but Hermione seemed preoccupied, silently wrapping the long chain of a pendant around both Harry’s neck and her own."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Black lets out a howl, his voice echoing with a mix of bitterness and amusement, while Lupin fixes his gaze on Black, studying him intently before turning his attention back to the situation at hand. Lupin's eyes return to Black, and with a subtle nod, they both release their wands, which fly from their hands as if propelled by an unseen force. The others in the room shift their focus to the doorway, where Snape stands, a smug smile playing on his lips. As Black moves closer, Snape raises his wand, pressing it firmly against Black's neck, his eyes hardening with determination as he gestures toward the door, indicating the direction they should take. As the group begins to move, Harry's eyes catch sight of the table where Lupin has left his wand, and with a swift motion, it is suddenly in his grasp. In an instant, Snape is lifted into the air, colliding with the wall with a resounding thud before sliding down to the floor, leaving Ron and Hermione staring in shock at the unexpected turn of events. Harry, momentarily taken aback by his own actions, turns his attention to Black, and as he points at him, Black responds with a mirthless laugh, redirecting the attention to Ron. Ron's face drains of color, fear gripping him as Scabbers, the rat, squirms violently in his hands. Lupin and Black both turn their attention to Ron, who clutches Scabbers protectively against his chest. Sirius and Lupin exchange a meaningful glance, a silent communication passing between them, while Pettigrew's small, watery eyes dart nervously toward the windows and door, assessing his chances of escape. Suddenly, Pettigrew makes a desperate attempt to flee, but Sirius quickly intervenes, shoving him back with little effort. Pettigrew's nose twitches with anxiety as his gaze locks onto Harry, his hands fluttering nervously, revealing the absence of an index finger. Emerging from the gap, Pettigrew begins to prattle desperately, his words a frantic plea for mercy. Harry takes a moment to study Pettigrew, his expression unreadable, before shifting his gaze away and turning to see Hermione, who is staring intently at the full moon. Harry's eyes move to Lupin, who stands rigidly, his silhouette outlined against the moonlight, his fingers twitching with an internal struggle. Lupin shakes his head, a silent refusal, as Pettigrew's eyes dart around, taking in the gravity of the situation, before slowly shifting to focus on the wand trembling in Lupin's lengthening fist. As Lupin's wand slips from his grasp, Pettigrew seizes the opportunity and leaps into action. Harry locks eyes with Pettigrew, whose gaze is glassy and desperate, and in that moment, Harry's Patronus blooms briefly before fading away. Harry's eyes flutter as the Dementors twist and turn in his vision, drawing ever closer, while Black gasps for breath, silvery feathers of light spilling from his lips as if his very soul were being drawn out. Then, a light splinters through the trees, and Harry squints to see a fiery stag materialize, its body glowing with a luminous intensity as it charges through the trees, casting light into the surrounding darkness. The stag continues its charge, the light expanding and setting the forest ablaze with its brilliance, causing the remaining Dementors to flee, drifting across the moon like ash. As the light begins to ebb, the stag's luminous form flickers, culminating in a bright flash before darkness returns, leaving only a single thread of light spinning down to the size of a pearl in the palm of a man standing deep within the trees. Harry studies the silhouette, which seems strangely familiar, but before he can discern more, it vanishes, leaving only Hermione's shadow rippling against the curtain that encircles Harry's bed. Opposite him, Ron lies with his leg bandaged, while Hermione paces the room, her steps measured and thoughtful. Dumbledore enters, handing Harry and Hermione each a stick of chocolate, a gesture of comfort, before he starts to leave, pauses to offer a warm smile, and then exits the room. Harry glances curiously at the chocolate in his hand, but Hermione remains silent, instead looping the pendant's long chain around both her neck and Harry's, binding them together in a shared purpose."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Black howls with bitter amusement as Lupin observes him, nodding as their wands fly from their hands. The group turns to see Snape smugly standing in the doorway. As Black approaches, Snape hardens his gaze, pressing his wand to Black's neck and gesturing toward the door. As the others begin to leave, Harry quickly retrieves his wand from the table. Snape is thrown into the air, hitting the wall, while Ron and Hermione watch in shock. Harry, also surprised, turns to Black, who laughs and points at Ron, causing Ron to pale as Scabbers squirms. Lupin and Black focus on Ron, who clutches Scabbers protectively. Sirius and Lupin exchange a silent glance as Pettigrew's eyes dart toward escape routes. Pettigrew attempts to flee, but Sirius shoves him back. Pettigrew's nervous gestures reveal a missing finger as he pleads desperately. Harry briefly studies Pettigrew before noticing Hermione staring at the full moon. His attention shifts to Lupin, who stands rigidly, his fingers twitching. Lupin shakes his head as Pettigrew assesses the situation, noting the wand in Lupin's lengthening fist. As Lupin's wand drops, Pettigrew leaps, and Harry's Patronus briefly appears and fades. Harry's vision blurs with Dementors closing in, while Black gasps, releasing silvery light. A fiery stag suddenly appears, illuminating the forest and driving the Dementors away. The light fades, leaving a single thread of light in the palm of a man deep in the trees. Harry studies the familiar silhouette before it vanishes. In the hospital wing, Ron lies with a bandaged leg as Hermione paces. Dumbledore gives Harry and Hermione chocolate, smiles, and exits. Harry curiously examines the chocolate, while Hermione loops a pendant's chain around both their necks."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Black howls, then bitterly amused, while Lupin, a werewolf who taught at Hogwarts School of Witchcraft and Wizardry, eyes him and then turns back. Lupin eyes Black again and nods as the wands, instruments of magical power, fly from their hands. The others turn to find Snape, known for his expertise in Potions and a complicated history with both Lupin and Black, standing in the doorway, smiling smugly. As Black approaches, Snape puts his wand to Black's neck, and Snape's eyes harden as he gestures to the door, a well-practiced move indicating control. As the others start to go, Harry, who recently learned about his true heritage as a wizard, glances at the table where Lupin has left Harry's wand, and in a flash, it's in his hand. Snape soars into the air, hits the wall with a thud, and slides down, while Ron and Hermione, both close friends of Harry since their first year at Hogwarts, stare in shock. Harry looks a bit shocked himself, then turns to Black, his godfather accused of betraying Harry's parents, and, as Harry points at Black, Black laughs mirthlessly and points at Ron. Ron goes white with fear as Scabbers, Ron's pet rat for several years, squirms violently. Lupin and Black turn to Ron, who holds Scabbers protectively. Sirius and Lupin exchange a glance, neither speaks, while Pettigrew's small, watery eyes dart toward the windows and door. Suddenly, he makes a break for it, but Sirius, once a close friend of Pettigrew and part of a group known as the Marauders, merely shoves him back. Pettigrew's nose twitches, his gaze finding Harry, the son of his former friends James and Lily Potter, and his hands flutter nervously, revealing a missing index finger, a self-inflicted wound from when Pettigrew faked his own death. As Pettigrew emerges from the gap, he prattles desperately. Harry studies Pettigrew briefly, then looks away and turns to see Hermione staring at the full moon, a catalyst for Lupin's transformation into a werewolf. His eyes shift to Lupin, who is a rigid silhouette, his fingers twitching. Lupin shakes his head as Pettigrew's eyes dart, taking in the situation, then slowly shift to note the wand trembling in Lupin's lengthening fist, signaling his imminent transformation. As Lupin's wand drops, Pettigrew leaps. Harry looks into his glassy eyes, and Harry's Patronus, a protective spell learned to ward off Dementors, blooms briefly and dies. Harry's eyes flutter as the Dementors, dark creatures that feed on human happiness, twist madly in his vision, drawing closer, and Black gasps, silvery feathers of light tumble from his lips as if his very soul were leaving him. Then a light splinters the trees, and Harry squints to see a fiery stag appear, its body luminous, slashing through the trees, sowing light in the darkness. The stag, a manifestation of the Patronus Charm, charges on as the light expands, with the forest blazing with it, and the remaining Dementors flee, drifting across the moon like ash. The light ebbs, the stag's luminous body flickers, and there is a bright flash and darkness returns, a single thread of light all that remains, spinning down to the size of a pearl in the palm of a man standing deep in the trees. Harry studies the strangely familiar silhouette, suggesting a connection to someone he deeply trusts, then it is gone out of Hermione's shadow, which ripples against the curtain that encircles Harry's bed. Ron lies opposite with his leg bandaged from an earlier injury involving the Whomping Willow, as Hermione paces, stops, and Dumbledore, the wise and venerable headmaster of Hogwarts, hands Harry and Hermione each a stick of chocolate, a remedy for the effects of Dementors, then starts to go, stops, smiles, and exits. Harry glances curiously at the chocolate, but Hermione doesn't reply, instead looping the pendant's long chain, the Time-Turner, around Harry's neck as well as her own, an artifact used to travel back in time."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Black howls then bitterly amused while Lupin eyes him and then turns back  Lupin eyes Black again and nods as the wands fly from their hands  The others turn to find Snape standing in the doorway smiling smugly  Suddenly he makes a break for it but Sirius merely shoves him back  Pettigrew's nose twitches his gaze finding Harry and his hands flutter nervously revealing a missing index finger  As Pettigrew emerges from the gap he prattles desperately  Harry studies Pettigrew briefly then looks away and turns to see Hermione staring at the full moon  His eyes shift to Lupin who is a rigid silhouette his fingers twitching  Lupin shakes his head as Pettigrew's eyes dart taking in the situation then slowly shift to note the wand trembling in Lupin's lengthening fist  As Lupin's wand drops Pettigrew leaps  Harry looks into his glassy eyes and Harry's Patronus blooms briefly and dies  Harry's eyes flutter as the Dementors twist madly in his vision drawing closer and Black gasps  silvery feathers of light tumble from his lips as if his very soul were leaving him  Then a light splinters the trees and Harry squints to see a fiery stag appear its body luminous slashing through the trees sowing light in the darkness  Still the stag charges on as the light expands with the forest blazing with it and the remaining Dementors flee drifting across the moon like ash  The light ebbs the stag's luminous body flickers and there is a bright flash and darkness returns a single thread of light all that remains spinning down to the size of a pearl in the palm of a man standing deep in the trees  Harry studies the strangely familiar silhouette  As Black approaches Snape puts his wand to Black's neck and Snape's eyes harden as he gestures to the door  As the others start to go Harry glances at the table where Lupin has left Harry's wand and in a flash it's in his hand  Snape soars into the air hits the wall with a thud and slides down while Ron and Hermione stare in shock  Harry looks a bit shocked himself then turns to Black and as Harry points at Black Black laughs mirthlessly and points at Ron  Ron goes white with fear as Scabbers squirms violently  Lupin and Black turn to Ron who holds Scabbers protectively  Sirius and Lupin exchange a glance neither speaks while Pettigrew's small watery eyes dart toward the windows and door  Suddenly he makes a break for it but Sirius merely shoves him back  Pettigrew's nose twitches his gaze finding Harry and his hands flutter nervously revealing a missing index finger  As Pettigrew emerges from the gap he prattles desperately  Harry studies Pettigrew briefly then looks away and turns to see Hermione staring at the full moon  His eyes shift to Lupin who is a rigid silhouette his fingers twitching  Lupin shakes his head as Pettigrew's eyes dart taking in the situation then slowly shift to note the wand trembling in Lupin's lengthening fist  As Lupin's wand drops Pettigrew leaps  Harry looks into his glassy eyes and Harry's Patronus blooms briefly and dies  Harry's eyes flutter as the Dementors twist madly in his vision drawing closer and Black gasps  silvery feathers of light tumble from his lips as if his very soul were leaving him  Then a light splinters the trees and Harry squints to see a fiery stag appear its body luminous slashing through the trees sowing light in the darkness  Still the stag charges on as the light expands with the forest blazing with it and the remaining Dementors flee drifting across the moon like ash  The light ebbs the stag's luminous body flickers and there is a bright flash and darkness returns a single thread of light all that remains spinning down to the size of a pearl in the palm of a man standing deep in the trees  Harry studies the strangely familiar silhouette  then it is gone out of Hermione's shadow which ripples against the curtain that encircles Harry's bed  Ron lies opposite with his leg bandaged as Hermione paces stops and Dumbledore hands  Harry and Hermione each a stick of chocolate then starts to go stops smiles and exits  Harry glances curiously at the chocolate but Hermione doesn't reply instead looping the pendant's long chain around Harry's neck as well as her own"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Black howls then bitterly amused while Lupin eyes him and then turns back. Lupin eyes Black again and nods as the wands fly from their hands. The others turn to find Snape standing in the doorway smiling smugly. As Black approaches Snape puts his wand to Black's neck and Snape's eyes harden as he gestures to the door. As the others start to go Harry glances at the table where Lupin has left Harry's wand and in a flash it is in his hand. Snape soars into the air hits the wall with a thud and slides down while Ron and Hermione stare in shock. Harry looks a bit shocked himself then turns to Black and as Harry points at Black Black laughs mirthlessly and points at Ron. Ron goes white with fear as Scabbers squirms violently. Lupin and Black turn to Ron who holds Scabbers protectively. Sirius and Lupin exchange a glance neither speaks while Pettigrew's small watery eyes dart toward the windows and door. Suddenly he makes a break for it but Sirius merely shoves him back. Pettigrew's nose twitches his gaze finding Harry and his hands flutter nervously revealing a missing index finger. As Pettigrew emerges from the gap he prattles desperately. Harry studies Pettigrew briefly then looks away and turns to see Hermione staring at the full moon. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. His eyes shift to Lupin who is a rigid silhouette his fingers twitching. Lupin shakes his head as Pettigrew's eyes dart taking in the situation then slowly shift to note the wand trembling in Lupin's lengthening fist. As Lupin's wand drops Pettigrew leaps. Harry looks into his glassy eyes and Harry's Patronus blooms briefly and dies. Harry's eyes flutter as the Dementors twist madly in his vision drawing closer and Black gasps. silvery feathers of light tumble from his lips as if his very soul were leaving him. Then a light splinters the trees and Harry squints to see a fiery stag appear its body luminous slashing through the trees sowing light in the darkness. Still the stag charges on as the light expands with the forest blazing with it and the remaining Dementors flee drifting across the moon like ash. The light ebbs the stag's luminous body flickers and there is a bright flash and darkness returns a single thread of light all that remains spinning down to the size of a pearl in the palm of a man standing deep in the trees. Harry studies the strangely familiar silhouette. then it is gone out of Hermione's shadow which ripples against the curtain that encircles Harry's bed. Ron lies opposite with his leg bandaged as Hermione paces stops and Dumbledore hands. Harry and Hermione each a stick of chocolate then starts to go stops smiles and exits. Harry glances curiously at the chocolate but Hermione does not reply instead looping the pendant's long chain around Harry's neck as well as her own."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Black howls then bitterly amused while Lupin eyes him and then turns back. Lupin eyes Black again and nods as the wands fly from their hands. The others turn to find Snape standing in the doorway smiling smugly. As Black approaches Snape puts his wand to Black's neck and Snape's eyes harden as he gestures to the door. As the others start to go Harry glances at the table where Lupin has left Harry's wand and in a flash it is in his hand. Snape soars into the air hits the wall with a thud and slides down while Ron and Hermione stare in shock. Harry looks a bit shocked himself then turns to Black and as Harry points at Black Black laughs mirthlessly and points at Ron. Ron goes white with fear as Scabbers squirms violently. Lupin and Black turn to Ron who holds Scabbers protectively. Sirius and Lupin exchange a glance neither speaks while Pettigrew's small watery eyes dart toward the windows and door. Suddenly he makes a break for it but Sirius merely shoves him back. Pettigrew's nose twitches his gaze finding Harry and his hands flutter nervously revealing a missing index finger. As Pettigrew emerges from the gap he prattles desperately. Harry studies Pettigrew briefly then looks away and turns to see Hermione staring at the full moon. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. His eyes shift to Lupin who is a rigid silhouette his fingers twitching. Lupin shakes his head as Pettigrew's eyes dart taking in the situation then slowly shift to note the wand trembling in Lupin's lengthening fist. As Lupin's wand drops Pettigrew leaps. Harry looks into his glassy eyes and Harry's Patronus blooms briefly and dies. Harry's eyes flutter as the Dementors twist madly in his vision drawing closer and Black gasps. silvery feathers of light tumble from his lips as if his very soul were leaving him. Then a light splinters the trees and Harry squints to see a fiery stag appear its body luminous slashing through the trees sowing light in the darkness. Still the stag charges on as the light expands with the forest blazing with it and the remaining Dementors flee drifting across the moon like ash. The light ebbs the stag's luminous body flickers and there is a bright flash and darkness returns a single thread of light all that remains spinning down to the size of a pearl in the palm of a man standing deep in the trees. Harry studies the strangely familiar silhouette. then it is gone out of Hermione's shadow which ripples against the curtain that encircles Harry's bed. Ron lies opposite with his leg bandaged as Hermione paces stops and Dumbledore hands. Harry and Hermione each a stick of chocolate then starts to go stops smiles and exits. Harry glances curiously at the chocolate but Hermione does not reply instead looping the pendant's long chain around Harry's neck as well as her own."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Black howls then bitterly amused while Lupin eyes him and then turns back. Lupin eyes Black again and nods as the wands fly from their hands. The others turn to find Snape standing in the doorway smiling smugly. As Black approaches Snape puts his wand to Black's neck and Snape's eyes harden as he gestures to the door. As the others start to go Harry glances at the table where Lupin has left Harry's wand and in a flash it is in his hand. Snape soars into the air hits the wall with a thud and slides down while Ron and Hermione stare in shock. Harry looks a bit shocked himself then turns to Black and as Harry points at Black Black laughs mirthlessly and points at Ron. Still the stag charges on as the light expands with the forest blazing with it and the remaining Dementors flee drifting across the moon like ash. The light ebbs the stag's luminous body flickers and there is a bright flash and darkness returns a single thread of light all that remains spinning down to the size of a pearl in the palm of a man standing deep in the trees. Harry studies the strangely familiar silhouette. then it is gone out of Hermione's shadow which ripples against the curtain that encircles Harry's bed. Ron lies opposite with his leg bandaged as Hermione paces stops and Dumbledore hands. Harry and Hermione each a stick of chocolate then starts to go stops smiles and exits. Harry glances curiously at the chocolate but Hermione does not reply instead looping the pendant's long chain around Harry's neck as well as her own."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Black howls then bitterly amused while Lupin eyes him and then turns back. Lupin eyes Black again and nods as the wands fly from their hands. The others turn to find Snape standing in the doorway smiling smugly. Ron lies opposite with his leg bandaged as Hermione paces stops and Dumbledore hands. Harry and Hermione each a stick of chocolate then starts to go stops smiles and exits. Harry glances curiously at the chocolate but Hermione does not reply instead looping the pendant's long chain around Harry's neck as well as her own."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dragon howls, then bitterly amused, while the unicorn eyes it and then turns back. The unicorn eyes the dragon again and nods as the wands fly from their hands. The elephants turn to find the giraffe standing in the doorway, smiling smugly. As the dragon approaches, the giraffe puts its wand to the dragon's neck, and the giraffe's eyes harden as it gestures to the door. As the elephants start to go, the squirrel glances at the table where the unicorn has left the squirrel's wand, and in a flash, it's in the squirrel's hand. The giraffe soars into the air, hits the wall with a thud, and slides down, while the dolphin and the rabbit stare in shock. The squirrel looks a bit shocked itself, then turns to the dragon and, as the squirrel points at the dragon, the dragon laughs mirthlessly and points at the dolphin. The dolphin goes white with fear as the mouse squirms violently. The unicorn and the dragon turn to the dolphin, who holds the mouse protectively. The tiger and the unicorn exchange a glance, neither speaks, while the cat's small, watery eyes dart toward the windows and door. Suddenly, it makes a break for it, but the tiger merely shoves it back. The cat's nose twitches, its gaze finding the squirrel, and its hands flutter nervously, revealing a missing index finger. As the cat emerges from the gap, it prattles desperately. The squirrel studies the cat briefly, then looks away and turns to see the rabbit staring at the full moon. Its eyes shift to the unicorn, who is a rigid silhouette, its fingers twitching. The unicorn shakes its head as the cat's eyes dart, taking in the situation, then slowly shift to note the wand trembling in the unicorn's lengthening fist. As the unicorn's wand drops, the cat leaps. The squirrel looks into its glassy eyes, and the squirrel's Patronus blooms briefly and dies. The squirrel's eyes flutter as the lions twist madly in its vision, drawing closer, and the dragon gasps, silvery feathers of light tumble from its lips as if its very soul were leaving it. Then a light splinters the trees, and the squirrel squints to see a fiery eagle appear, its body luminous, slashing through the trees, sowing light in the darkness. Still, the eagle charges on as the light expands, with the forest blazing with it, and the remaining lions flee, drifting across the moon like ash. The light ebbs, the eagle's luminous body flickers, and there is a bright flash and darkness returns, a single thread of light all that remains, spinning down to the size of a pearl in the palm of a bear standing deep in the trees. The squirrel studies the strangely familiar silhouette, then it is gone out of the rabbit's shadow, which ripples against the curtain that encircles the squirrel's bed. The dolphin lies opposite with its leg bandaged as the rabbit paces, stops, and the owl hands the squirrel and the rabbit each a stick of chocolate, then starts to go, stops, smiles, and exits. The squirrel glances curiously at the chocolate, but the rabbit doesn't reply, instead looping the pendant's long chain around the squirrel's neck as well as its own."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Black howls, then bitterly amused, while Lupin eyes him and then turns back. Lupin eyes Black again and nods as the brooms fly from their hands. The others turn to find Snape standing in the archway, smiling smugly. As Black approaches, Snape puts his broom to Black's shoulder, and Snape's eyes harden as he gestures to the window. As the others start to go, Harry glances at the shelf where Lupin has left Harry's broom, and in a flash, it's in his hand. Snape soars into the air, hits the ceiling with a thud, and slides down, while Ron and Hermione stare in shock. Harry looks a bit shocked himself, then turns to Black and, as Harry points at Black, Black laughs mirthlessly and points at Ron. Ron goes white with fear as Scabbers writhes violently. Lupin and Black turn to Ron, who holds Scabbers protectively. Sirius and Lupin exchange a glance, neither speaks, while Pettigrew's small, watery eyes dart toward the chandeliers and window. Suddenly, he makes a break for it, but Sirius merely shoves him back. Pettigrew's nose twitches, his gaze finding Harry, and his hands flutter nervously, revealing a missing toe. As Pettigrew emerges from the rift, he prattles desperately. Harry studies Pettigrew briefly, then looks away and turns to see Hermione staring at the full pond. His eyes shift to Lupin, who is a rigid outline, his fingers twitching. Lupin shakes his head as Pettigrew's eyes dart, taking in the situation, then slowly shift to note the broom trembling in Lupin's lengthening grip. As Lupin's broom drops, Pettigrew leaps. Harry looks into his shiny eyes, and Harry's Patronus blooms briefly and dies. Harry's eyes flutter as the Dementors twist madly in his vision, drawing closer, and Black gasps, silvery strands of light tumble from his lips as if his very soul were leaving him. Then a glow splinters the clouds, and Harry squints to see a fiery lion appear, its body luminous, slashing through the clouds, sowing light in the darkness. Still, the lion charges on as the light expands, with the sky blazing with it, and the remaining Dementors flee, drifting across the pond like mist. The light ebbs, the lion's luminous body flickers, and there is a bright flash and darkness returns, a single thread of light all that remains, spinning down to the size of a pebble in the palm of a man standing deep in the clouds. Harry studies the strangely familiar outline, then it is gone out of Hermione's shadow, which ripples against the curtain that encircles Harry's chair. Ron lies opposite with his arm bandaged as Hermione paces, stops, and Dumbledore hands Harry and Hermione each a piece of candy, then starts to go, stops, smiles, and exits. Harry glances curiously at the candy, but Hermione doesn't reply, instead looping the bracelet's long chain around Harry's wrist as well as her own."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Black chuckles, then sarcastically applauded, while Lupin winks at him and then turns back. Lupin stares at Black again and shrugs as the wands glide away from their hands. The others spin to find Snape posing in the doorway, grinning slyly. As Black saunters closer, Snape points his wand at Black's shoulder, and Snape's eyes narrow as he waves toward the door. As the others begin to stroll out, Harry peeks at the table where Lupin has left Harry's wand, and in a blink, it's in his grasp. Snape floats through the air, strikes the wall with a thump, and settles down, while Ron and Hermione gape in astonishment. Harry looks a bit startled himself, then spins to Black and, as Harry gestures at Black, Black chuckles hollowly and points at Ron. Ron pales with trepidation as Scabbers wriggles energetically. Lupin and Black glance at Ron, who clutches Scabbers protectively. Sirius and Lupin share a look, neither utter a word, while Pettigrew's small, watery eyes flick toward the windows and door. Abruptly, he dashes for it, but Sirius merely nudges him back. Pettigrew's nose quivers, his gaze finding Harry, and his hands jitter nervously, revealing a missing index finger. As Pettigrew steps from the gap, he chatters frantically. Harry regards Pettigrew briefly, then turns away and spins to see Hermione staring at the full moon. His eyes drift to Lupin, who is a rigid silhouette, his fingers trembling. Lupin shakes his head as Pettigrew's eyes flicker, assessing the situation, then slowly shift to notice the wand quivering in Lupin's lengthening grasp. As Lupin's wand tumbles, Pettigrew springs. Harry gazes into his glassy eyes, and Harry's Patronus flickers briefly and fades. Harry's eyes flutter as the Dementors spin wildly in his vision, drawing nearer, and Black gasps, silvery feathers of light tumble from his mouth as if his very essence were vanishing. Then a light fractures the trees, and Harry squints to see a fiery stag emerge, its body radiant, slashing through the trees, sowing light in the darkness. Still, the stag charges on as the light widens, with the forest aglow with it, and the remaining Dementors scatter, drifting across the moon like ash. The light recedes, the stag's luminous body flickers, and there is a bright flash and darkness returns, a single thread of light all that remains, twisting down to the size of a pearl in the palm of a man standing deep in the trees. Harry studies the strangely familiar silhouette, then it is gone out of Hermione's shadow, which ripples against the curtain that encircles Harry's bed. Ron lies opposite with his leg wrapped as Hermione paces, halts, and Dumbledore hands Harry and Hermione each a stick of chocolate, then starts to depart, halts, grins, and exits. Harry glances curiously at the chocolate, but Hermione doesn't respond, instead threading the pendant's long chain around Harry's neck as well as her own."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Gray yowls, then joyfully surprised, while Remus watches it and then pivots forward. Remus watches Gray again and agrees as the hats glide from their toes. The windows pivot to spot Lily sitting in the archway, frowning cheerfully. As Gray advances, Lily places its hat to Gray's ankle, and Lily's mouth softens as it signals to the car. As the windows start to stay, Neville peeks at the chair where Remus has left Neville's hat, and in a blink, it's in its foot. Lily dives into the earth, taps the ceiling with a hum, and climbs up, while Ginny and Luna gape in awe. Neville smiles a bit awed itself, then pivots to Gray and, as Neville gestures at Gray, Gray sings cheerfully and gestures at Ginny. Ginny turns green with joy as Crookshanks lounges calmly. Remus and Gray pivot to Ginny, who grips Crookshanks suspiciously. Luna and Remus share a frown, neither whispers, while Filch's large, dry hands dart toward the paintings and ceiling. Abruptly, he takes a run for it, but Luna merely pulls it forward. Filch's ears tingle, its eyes finding Neville, and its toes sway calmly, revealing a missing elbow. As Filch appears from the door, he chatters quietly. Neville examines Filch briefly, then turns away and pivots to notice Luna gaping at the empty field. Its mouth moves to Remus, who is a fuzzy shadow, its hands shaking. Remus nods as Filch's hands dart, absorbing the room, then quickly move to observe the hat shaking in Remus's shrinking toe. As Remus's hat flies, Filch dances. Neville gazes into its fuzzy mouth, and Neville's Boggart blossoms briefly and withers. Neville's mouth twitches as the Banshees twirl slowly in its hearing, drifting nearer, and Gray laughs, golden leaves of light tumble from its ears as if its own mind were escaping it. Then a shadow shatters the rocks, and Neville peers to spot a gentle lion emerge, its mind glowing, running through the rocks, sowing dark in the brightness. Still, the lion flies on as the shadow contracts, with the meadow glowing with it, and the fleeting Banshees sprint, floating across the stars like smoke. The shadow fades, the lion's glowing mind blinks, and there is a dark burst and brightness vanishes, a small piece of shadow all that disappears, spinning up to the size of a rock in the foot of a bird standing high in the rocks. Neville examines the oddly unfamiliar shadow, then it is here out of Luna's echo, which glides over the ceiling that encircles Neville's chair. Ginny stands nearby with her arm glowing as Luna jumps, pauses, and Slughorn offers Neville and Luna each a piece of apple, then starts to stay, pauses, grins, and enters. Neville peers expectantly at the apple, but Luna doesn't inquire, instead winding the bracelet's short piece around Neville's hand as well as her own."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Martha barks, then cheerfully bemused, while Jasper watches her and then turns away. Jasper watches Martha again and grins as the hats tumble from their heads. The group swivels to find Roberts lounging in the doorway, chuckling smugly. As Martha advances, Roberts places his hat to Martha's shoulder, and Roberts's eyes soften as he motions to the window. As the group begins to depart, Oliver peeks at the chair where Jasper has left Oliver's hat, and in an instant, it's perched on his head. Roberts floats into the air, collides with the wall with a thump, and slides down, while Sam and Alex gape in surprise. Oliver looks a bit surprised himself, then turns to Martha and, as Oliver gestures at Martha, Martha chuckles wryly and gestures at Sam. Sam turns pale with worry as Whiskers fidgets wildly. Jasper and Martha turn to Sam, who hugs Whiskers protectively. Oscar and Jasper share a glance, neither speaks, while Thompson's small, watery eyes shift toward the ceiling and floor. Suddenly, he dashes for freedom, but Oscar simply nudges him back. Thompson's ear twitches, his gaze landing on Oliver, and his arms flutter nervously, revealing a missing pinky finger. As Thompson slips through the gap, he babbles anxiously. Oliver examines Thompson briefly, then turns away and notices Alex watching the rising sun. His gaze moves to Jasper, who is a still outline, his hands clenching. Jasper shakes his head as Thompson's eyes shift, assessing the scenario, then slowly move to note the hat trembling in Jasper's lengthening hand. As Jasper's hat falls, Thompson bounds. Oliver looks into his vacant eyes, and Oliver's amulet shimmers briefly and fades. Oliver's eyes close as the shadows swirl wildly in his vision, creeping closer, and Martha wheezes, golden sparks of light spill from her mouth as if her very essence were leaving her. Then a glow fractures the grasses, and Oliver blinks to see a fiery steed emerge, its form radiant, charging through the grasses, casting illumination in the shadows. Yet the steed gallops on as the glow broadens, with the meadow igniting with it, and the remaining shadows retreat, drifting across the stars like smoke. The glow wanes, the steed's radiant form flickers, and there is a bright flash and darkness returns, a single strand of luminescence all that remains, shrinking down to the size of a gem in the hand of a figure standing deep in the grasses. Oliver examines the oddly recognizable outline, then it vanishes out of Alex's silhouette, which dances against the curtain that surrounds Oliver's bed. Sam lies opposite with his arm bandaged as Alex strides, halts, and Evans hands Oliver and Alex each a piece of toffee, then begins to depart, halts, grins, and leaves. Oliver glances curiously at the toffee, but Alex doesn't respond, instead wrapping the locket's long chain around Oliver's neck as well as her own."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Black barks, then chuckles coldly, while Lupin glances at him and then turns away. Lupin glances at Black again and winks as the ribbons flit from their fingers. The others rotate to find Snape lounging in the archway, grinning smugly. As Black saunters forward, Snape places his hat to Black's shoulder, and Snape's expression stiffens as he signals to the window. As the others begin to wander, Harry peers at the bookshelf where Lupin has left Harry's hat, and in a blink, it's in his grasp. Snape floats into the ceiling, strikes the chandelier with a clang, and drifts down, while Ron and Hermione gape in surprise. Harry appears a bit surprised himself, then tilts toward Black and, as Harry gestures at Black, Black chuckles dryly and gestures at Ron. Ron turns pale with dread as Scabbers wriggles fiercely. Lupin and Black pivot to Ron, who clutches Scabbers defensively. Sirius and Lupin share a glance, neither utters a word, while Pettigrew's tiny, watery gaze flicks toward the paintings and curtains. Abruptly, he darts forward, but Sirius merely nudges him back. Pettigrew's chin quivers, his eyes finding Harry, and his feet shuffle nervously, revealing a missing thumb. As Pettigrew pops from the crevice, he chatters anxiously. Harry examines Pettigrew momentarily, then averts his gaze and turns to see Hermione gazing at the lantern's glow. His eyes drift to Lupin, who is a stark silhouette, his toes curling. Lupin shakes his head as Pettigrew's eyes flicker, assessing the scene, then slowly drift to note the ribbon quivering in Lupin's elongating grasp. As Lupin's ribbon falls, Pettigrew bounds. Harry gazes into his glossy eyes, and Harry's Patronus blooms briefly and fades. Harry's eyelids flutter as the Dementors whirl wildly in his vision, moving closer, and Black gulps, silvery strands of mist rolling from his lips as if his very essence were escaping him. Then a glow fractures the horizon, and Harry squints to see a blazing elk appear, its form radiant, slashing through the thickets, scattering brightness in the shadows. Still, the elk gallops on as the glow enlarges, with the grove ablaze with it, and the lingering Dementors retreat, floating across the sky like soot. The glow wanes, the elk's luminous form dims, and there is a brilliant flash and night returns, a singular thread of glow all that lingers, coiling down to the size of a bead in the grasp of a man standing deep in the woods. Harry observes the oddly familiar figure, then it vanishes out of Hermione's silhouette, which ripples against the tapestry that veils Harry's cot. Ron reclines opposite with his arm bandaged as Hermione strides, pauses, and Dumbledore hands Harry and Hermione each a piece of gum, then starts to leave, pauses, beams, and departs. Harry glances inquisitively at the gum, but Hermione doesn't respond, instead twisting the necklace's long chain around Harry's wrist as well as her own."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Gray sings, then joyously puzzled, while Fido examines him and then spins back. Fido examines Gray again and shrugs as the balloons float from their paws. The companions twist to find Ralph lounging in the archway, grinning cheekily. As Gray dances closer, Ralph places his balloon to Gray's shoulder, and Ralph's grin tightens as he gestures to the ceiling. As the companions begin to leap, Sam peers at the shelf where Fido has dropped Sam's balloon, and in a blink, it's in his paw. Ralph glides into the sky, taps the ceiling with a clang, and drifts down, while Jake and Emily gape in surprise. Sam looks a bit astonished himself, then pivots to Gray and, as Sam gestures at Gray, Gray chuckles softly and waves at Jake. Jake turns pale with worry as Whiskers wriggles frantically. Fido and Gray pivot to Jake, who cradles Whiskers gently. Felix and Fido swap a look, neither utters a sound, while Walter's small, glossy eyes flit toward the ceiling and archway. Instantly, he takes a dash for it, but Felix simply nudges him back. Walter's tail quivers, his stare discovering Sam, and his wings flutter anxiously, divulging a missing claw. As Walter pops from the crevice, he chatters anxiously. Sam observes Walter briefly, then averts his gaze and pivots to see Emily staring at the new star. His gaze shifts to Fido, who is a stiff shadow, his claws twitching. Fido shakes his mane as Walter's eyes flicker, grasping the scenario, then gradually shift to notice the balloon quivering in Fido's growing paw. As Fido's balloon drops, Walter bounds. Sam gazes into his misty eyes, and Sam's Shield briefly appears and fades. Sam's eyes blink as the Shadows whirl wildly in his sight, nearing closer, and Gray wheezes, silver droplets of mist tumble from his ears as if his very essence were vanishing. Then a glow fractures the mountain, and Sam peers to see a blazing hawk emerge, its wings radiant, slicing through the mountains, planting glow in the darkness. Yet, the hawk gallops onward as the glow spreads, with the valley blazing with it, and the lingering Shadows scatter, floating across the sun like smoke. The glow fades, the hawk's radiant wings flicker, and there is a sharp flash and dusk returns, a lone stream of glow all that lingers, swirling down to the size of a gemstone in the grip of a woman standing deep in the mountains. Sam examines the oddly recognizable shadow, then it vanishes out of Emily's outline, which ripples against the veil that surrounds Sam's nest. Jake rests adjacent with his paw bandaged as Emily strolls, halts, and Gregory offers Sam and Emily each a bar of ice, then starts to trot, halts, grins, and departs. Sam glances thoughtfully at the ice, but Emily doesn't answer, instead wrapping the locket's lengthy cord around Sam's neck as well as her own."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Lupin and Black exchange glances as their wands are flung from their hands, only to find Snape smugly standing at the doorway, putting his wand to Black's neck. As the group starts to leave, Harry quickly grabs his wand, sending Snape crashing into the wall, shocking Ron and Hermione. Black laughs and points at Ron, who turns pale as Scabbers, his rat, squirms. Lupin and Black observe Ron protectively holding Scabbers. Pettigrew tries to escape, but Sirius stops him, his missing finger revealed. Harry's Patronus briefly appears as Dementors approach, causing Black to gasp. Suddenly, a fiery stag illuminates the forest, chasing off the Dementors. The light fades, leaving a familiar man holding a pearl-sized light. Back in the infirmary, Harry receives chocolate from Dumbledore, while Hermione loops a pendant chain around their necks, leaving Harry curious."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Harry glances curiously at the chocolate but Hermione doesn't reply instead looping the pendant's long chain around Harry's neck as well as her own Harry and Hermione each a stick of chocolate then starts to go stops smiles and exits  Ron lies opposite with his leg bandaged as Hermione paces stops and Dumbledore hands  then it is gone out of Hermione's shadow which ripples against the curtain that encircles Harry's bed  Harry studies the strangely familiar silhouette  The light ebbs the stag's luminous body flickers and there is a bright flash and darkness returns a single thread of light all that remains spinning down to the size of a pearl in the palm of a man standing deep in the trees  Still the stag charges on as the light expands with the forest blazing with it and the remaining Dementors flee drifting across the moon like ash  Then a light splinters the trees and Harry squints to see a fiery stag appear its body luminous slashing through the trees sowing light in the darkness  silvery feathers of light tumble from his lips as if his very soul were leaving him  Harry's eyes flutter as the Dementors twist madly in his vision drawing closer and Black gasps  Harry looks into his glassy eyes and Harry's Patronus blooms briefly and dies  As Lupin's wand drops Pettigrew leaps  Lupin shakes his head as Pettigrew's eyes dart taking in the situation then slowly shift to note the wand trembling in Lupin's lengthening fist  His eyes shift to Lupin who is a rigid silhouette his fingers twitching  Harry studies Pettigrew briefly then looks away and turns to see Hermione staring at the full moon  As Pettigrew emerges from the gap he prattles desperately  Pettigrew's nose twitches his gaze finding Harry and his hands flutter nervously revealing a missing index finger  Suddenly he makes a break for it but Sirius merely shoves him back  Sirius and Lupin exchange a glance neither speaks while Pettigrew's small watery eyes dart toward the windows and door  Lupin and Black turn to Ron who holds Scabbers protectively  Ron goes white with fear as Scabbers squirms violently  Harry looks a bit shocked himself then turns to Black and as Harry points at Black Black laughs mirthlessly and points at Ron  Snape soars into the air hits the wall with a thud and slides down while Ron and Hermione stare in shock  As the others start to go Harry glances at the table where Lupin has left Harry's wand and in a flash it's in his hand  As Black approaches Snape puts his wand to Black's neck and Snape's eyes harden as he gestures to the door  The others turn to find Snape standing in the doorway smiling smugly  Lupin eyes Black again and nods as the wands fly from their hands  Black howls then bitterly amused while Lupin eyes him and then turns back "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The light ebbs the stag's luminous body flickers and there is a bright flash and darkness returns a single thread of light all that remains spinning down to the size of a pearl in the palm of a man standing deep in the trees  Sirius and Lupin exchange a glance neither speaks while Pettigrew's small watery eyes dart toward the windows and door  Ron goes white with fear as Scabbers squirms violently  Harry's eyes flutter as the Dementors twist madly in his vision drawing closer and Black gasps  Still the stag charges on as the light expands with the forest blazing with it and the remaining Dementors flee drifting across the moon like ash  Black howls then bitterly amused while Lupin eyes him and then turns back  Ron lies opposite with his leg bandaged as Hermione paces stops and Dumbledore hands  Then a light splinters the trees and Harry squints to see a fiery stag appear its body luminous slashing through the trees sowing light in the darkness  Snape soars into the air hits the wall with a thud and slides down while Ron and Hermione stare in shock  Harry glances curiously at the chocolate but Hermione doesn't reply instead looping the pendant's long chain around Harry's neck as well as her own Lupin shakes his head as Pettigrew's eyes dart taking in the situation then slowly shift to note the wand trembling in Lupin's lengthening fist  Harry studies Pettigrew briefly then looks away and turns to see Hermione staring at the full moon  Harry and Hermione each a stick of chocolate then starts to go stops smiles and exits  As Lupin's wand drops Pettigrew leaps  Harry looks into his glassy eyes and Harry's Patronus blooms briefly and dies  His eyes shift to Lupin who is a rigid silhouette his fingers twitching  Lupin eyes Black again and nods as the wands fly from their hands  Lupin and Black turn to Ron who holds Scabbers protectively  silvery feathers of light tumble from his lips as if his very soul were leaving him  Pettigrew's nose twitches his gaze finding Harry and his hands flutter nervously revealing a missing index finger  Harry studies the strangely familiar silhouette  As Pettigrew emerges from the gap he prattles desperately  The others turn to find Snape standing in the doorway smiling smugly  As Black approaches Snape puts his wand to Black's neck and Snape's eyes harden as he gestures to the door  Suddenly he makes a break for it but Sirius merely shoves him back  then it is gone out of Hermione's shadow which ripples against the curtain that encircles Harry's bed  Harry looks a bit shocked himself then turns to Black and as Harry points at Black Black laughs mirthlessly and points at Ron  As the others start to go Harry glances at the table where Lupin has left Harry's wand and in a flash it's in his hand "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "His eyes shift to Lupin who is a rigid silhouette his fingers twitching  Lupin shakes his head as Pettigrew's eyes dart taking in the situation then slowly shift to note the wand trembling in Lupin's lengthening fist  As Lupin's wand drops Pettigrew leaps  Harry looks into his glassy eyes and Harry's Patronus blooms briefly and dies  Harry's eyes flutter as the Dementors twist madly in his vision drawing closer and Black gasps  silvery feathers of light tumble from his lips as if his very soul were leaving him  Then a light splinters the trees and Harry squints to see a fiery stag appear its body luminous slashing through the trees sowing light in the darkness  Still the stag charges on as the light expands with the forest blazing with it and the remaining Dementors flee drifting across the moon like ash  The light ebbs the stag's luminous body flickers and there is a bright flash and darkness returns a single thread of light all that remains spinning down to the size of a pearl in the palm of a man standing deep in the trees  Harry studies the strangely familiar silhouette  then it is gone out of Hermione's shadow which ripples against the curtain that encircles Harry's bed  Ron lies opposite with his leg bandaged as Hermione paces stops and Dumbledore hands  Harry and Hermione each a stick of chocolate then starts to go stops smiles and exits  Harry glances curiously at the chocolate but Hermione doesn't reply instead looping the pendant's long chain around Harry's neck as well as her own Black howls then bitterly amused while Lupin eyes him and then turns back  Lupin eyes Black again and nods as the wands fly from their hands  The others turn to find Snape standing in the doorway smiling smugly  As Black approaches Snape puts his wand to Black's neck and Snape's eyes harden as he gestures to the door  As the others start to go Harry glances at the table where Lupin has left Harry's wand and in a flash it's in his hand  Snape soars into the air hits the wall with a thud and slides down while Ron and Hermione stare in shock  Harry looks a bit shocked himself then turns to Black and as Harry points at Black Black laughs mirthlessly and points at Ron  Ron goes white with fear as Scabbers squirms violently  Lupin and Black turn to Ron who holds Scabbers protectively  Sirius and Lupin exchange a glance neither speaks while Pettigrew's small watery eyes dart toward the windows and door  Suddenly he makes a break for it but Sirius merely shoves him back  Pettigrew's nose twitches his gaze finding Harry and his hands flutter nervously revealing a missing index finger  As Pettigrew emerges from the gap he prattles desperately  Harry studies Pettigrew briefly then looks away and turns to see Hermione staring at the full moon "
        }
      ]
    }
  ]
}