{
  "ground_truth": "Sensing something in the shadows across the street, he rises, turns back, and slowly draws his wand. Then he sees it—something big, darker than the shadows which conceal it, with wide, gleaming. Harry steps back, afraid to look, his wand outstretched, and he trips, tumbling over the forgotten trunk. The tip of his wand blazes; bang! Twin beams of blinding light spear the night. Stan eyes Harry suspiciously and nods slowly. As Stan grabs Harry's trunk, Harry peers into the shadows across the street—now simply shadows—and climbs aboard. Inside are only beds. In one bed, a disheveled wizard grunts and turns over in his sleep. Bang! Ernie rockets away, and the beds as one slide six inches to the rear. Harry drops onto the bed nearest him and peers up at the chandelier swaying directly above his head. Beyond the windscreen, oncoming traffic whips past in a blur. Stan, huddled in an armchair, peeks over The Daily Prophet, eyes Harry coolly, then disappears once more. Stan grins with sinister delight, showing bad teeth, as the Shrunken Head cackles with delight and Harry peers out the windscreen, watching London careering by. Sure enough, directly ahead, a little old lady is crossing the street. Ernie hits the brakes hard, and Harry flies forward, palms to the window; the brakes pinch down, the bus stops inches from the old lady, and Harry flies back onto his bed. Bang! The bus rockets forward once more. As Harry rights himself, he notices the headline of Stan's Daily Prophet: Escape from Azkaban! Below it, a sunken-faced man with long, matted hair glowers from a moving photograph. Harry shakes his head, still staring at the man's face. Harry nods, and as he does, Black's eyes shift. Just then, a pair of double-decker buses sweep directly toward the Knight Bus. Before he can scream, the entire Knight Bus squeezes down and shoots the gap between the two onrushing buses. The Shrunken Head winces. As the Knight Bus rockets off, Tom and Harry are revealed; Harry glances up and reads the sign above: The Leaky Cauldron. Tom drags Harry's trunk inside, then pauses, and with a flick of his wand, silences the car alarm. Harry trails Tom through the quiet room, where the bartender glances up, his gaze lingering perhaps a bit too long. A solitary wizard reads a book while, at his elbow, his coffee cup stirs itself. Tom leads Harry upstairs, and as Harry follows Tom inside, he finds a snow-white owl (Hedwig) perched atop a chair. Harry turns and finds a pinstriped silhouette (Cornelius Fudge) at the window, staring at the ghostly shadows beyond. Harry's reflection shivers in the glass, but the man doesn't turn. Tom takes a position against the wall, fishes a pair of walnuts from his pocket, and—crack—crushes the shells between his palms.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sensing something in the shadows across the street, he ascends, turns back, and gradually draws his wand. Then he perceives it—something immense, darker than the shadows which cloak it, with broad, shining. Harry steps back, fearful to look, his wand extended, and he stumbles, tumbling over the forgotten luggage. The tip of his wand flares; bang! Twin beams of dazzling illumination pierce the night. Stan gazes at Harry warily and nods slowly. As Stan seizes Harry's trunk, Harry observes into the shadows across the street—now merely shadows—and climbs aboard. Inside are only bunks. In one bed, a tousled wizard grunts and turns over in his slumber. Bang! Ernie rockets away, and the beds as one slide six inches to the rear. Harry drops onto the bed nearest him and peers up at the chandelier swaying directly above his head. Beyond the windshield, oncoming traffic zips past in a blur. Stan, huddled in an armchair, peeks over The Daily Prophet, eyes Harry coolly, then vanishes once more. Stan grins with sinister glee, revealing bad teeth, as the Shrunken Head cackles with glee and Harry peers out the windshield, watching London rushing by. Sure enough, directly ahead, a little old lady is crossing the street. Ernie hits the brakes hard, and Harry flies forward, palms to the window; the brakes clamp down, the bus halts inches from the old lady, and Harry flies back onto his bed. Bang! The bus rockets forward once more. As Harry straightens himself, he notices the headline of Stan's Daily Prophet: Escape from Azkaban! Below it, a gaunt-faced man with long, matted hair scowls from a moving photograph. Harry shakes his head, still staring at the man's face. Harry nods, and as he does, Black's eyes shift. Just then, a couple of double-decker buses sweep directly toward the Knight Bus. Before he can shout, the entire Knight Bus compresses down and shoots the gap between the two oncoming buses. The Shrunken Head winces. As the Knight Bus rockets off, Tom and Harry are revealed; Harry glances up and reads the sign above: The Leaky Cauldron. Tom drags Harry's trunk inside, then pauses, and with a flick of his wand, silences the car alarm. Harry trails Tom through the tranquil room, where the bartender glances up, his gaze lingering perhaps a bit too long. A solitary wizard reads a book while, at his elbow, his coffee cup stirs itself. Tom leads Harry upstairs, and as Harry follows Tom inside, he finds a snow-white owl (Hedwig) perched atop a chair. Harry turns and finds a pinstriped silhouette (Cornelius Fudge) at the window, gazing at the ghostly shadows beyond. Harry's reflection shivers in the glass, but the man doesn't turn. Tom takes a position against the wall, retrieves a pair of walnuts from his pocket, and—crack—shatters the shells between his palms."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Sensing something in the shadows across the street, he rises, turns back, and his wand is slowly drawn. Then it is seen by him—something big, darker than the shadows which conceal it, with wide, gleaming. Harry steps back, afraid to look, his wand outstretched, and he trips, tumbling over the forgotten trunk. The tip of his wand is blazed; bang! The night is speared by twin beams of blinding light. Harry is eyed suspiciously by Stan, who nods slowly. As Harry's trunk is grabbed by Stan, Harry peers into the shadows across the street—now simply shadows—and climbs aboard. Beds are the only things inside. In one bed, a disheveled wizard grunts and turns over in his sleep. Bang! Ernie rockets away, and the beds as one slide six inches to the rear. Harry drops onto the bed nearest him and peers up at the chandelier swaying directly above his head. Beyond the windscreen, oncoming traffic whips past in a blur. The Daily Prophet is peeked over by Stan, huddled in an armchair, who eyes Harry coolly, then disappears once more. The Shrunken Head cackles with delight as Stan grins with sinister delight, showing bad teeth, and the windscreen is peered out by Harry, watching London careering by. Sure enough, directly ahead, a little old lady is crossing the street. The brakes are hit hard by Ernie, and Harry flies forward, palms to the window; the brakes pinch down, the bus stops inches from the old lady, and the bed receives Harry once more as he flies back onto it. Bang! The bus rockets forward once more. As Harry rights himself, he notices the headline of Stan's Daily Prophet: Escape from Azkaban! Below it, a sunken-faced man with long, matted hair glowers from a moving photograph. The man's face is still stared at by Harry as he shakes his head. Harry nods, and as he does, Black's eyes shift. Just then, the Knight Bus is swept directly toward by a pair of double-decker buses. Before a scream can be let out by him, the entire Knight Bus squeezes down and shoots the gap between the two onrushing buses. A wince is given by the Shrunken Head. As the Knight Bus rockets off, Tom and Harry are revealed; Harry glances up and the sign above is read by him: The Leaky Cauldron. Harry's trunk is dragged inside by Tom, then a pause is made, and the car alarm is silenced with a flick of his wand. Tom is trailed by Harry through the quiet room, where a glance is given up by the bartender, his gaze lingering perhaps a bit too long. A book is read by a solitary wizard while, at his elbow, a coffee cup stirs itself. Tom leads Harry upstairs, and as Tom is followed by Harry inside, a snow-white owl (Hedwig) is found perched atop a chair. Harry turns and a pinstriped silhouette (Cornelius Fudge) is found at the window, staring at the ghostly shadows beyond. Harry's reflection shivers in the glass, but a turn is not made by the man. Tom takes a position against the wall, a pair of walnuts is fished from his pocket, and—crack—the shells are crushed between his palms."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Sensing something in the shadows, he rises, turns, and draws his wand. Then he sees it—something big and darker than the shadows, with wide, gleaming eyes. Harry steps back, afraid, his wand outstretched, and trips over the forgotten trunk. His wand blazes; bang! Twin beams of blinding light pierce the night. Stan eyes Harry suspiciously and nods. As Stan grabs Harry's trunk, Harry peers into the shadows—now just shadows—and climbs aboard. Inside are only beds. In one bed, a disheveled wizard grunts and turns in his sleep. Bang! Ernie rockets away, and the beds slide six inches to the rear. Harry drops onto the nearest bed, gazing at the chandelier swaying above. Beyond the windscreen, traffic whips past. Stan, in an armchair, peeks over The Daily Prophet, eyes Harry, then vanishes again. Stan grins with sinister delight as the Shrunken Head cackles, and Harry watches London blur by. Ahead, an old lady crosses the street. Ernie brakes hard, Harry flies forward, hits the window, then flies back onto his bed. Bang! The bus rockets forward again. Harry notices the Daily Prophet headline: Escape from Azkaban! A man with long, matted hair glowers from a moving photo. Harry shakes his head, still staring at the man's face, as Black's eyes shift. Suddenly, double-decker buses approach the Knight Bus. Before he can scream, the Knight Bus squeezes and shoots the gap between them. The Shrunken Head winces. As the Knight Bus rockets off, Tom and Harry are revealed; Harry reads the sign: The Leaky Cauldron. Tom drags Harry's trunk inside, silences a car alarm with his wand, and leads Harry through a quiet room where the bartender glances up. A wizard reads a book, his coffee cup stirring itself. Tom leads Harry upstairs, where a snow-white owl (Hedwig) perches atop a chair. Harry turns and sees a pinstriped silhouette (Cornelius Fudge) at the window, staring at the ghostly shadows. Harry's reflection shivers in the glass, but the man doesn't turn. Tom stands against the wall, crushing walnut shells between his palms."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Sensing something in the shadows, he rises, draws his wand, and sees a massive, darker figure. Harry steps back, trips over the trunk, and his wand blazes; bang! Blinding light pierces the night. Stan nods suspiciously. As Stan grabs Harry's trunk, Harry looks into mere shadows and boards. Inside are beds; a wizard sleeps restlessly. Bang! Ernie rockets away, beds slide back. Harry drops onto a bed, watching the chandelier sway. Traffic blurs past. Stan, reading The Daily Prophet, eyes Harry coolly, grinning sinisterly as the Shrunken Head cackles. Harry watches London blur by, then they abruptly stop near an old lady. Harry flies forward and back; bang! The bus rockets again. Harry notices the newspaper: Escape from Azkaban! A sunken-faced man glowers in a photo. Harry shakes his head as Black's eyes shift. Double-decker buses approach; the Knight Bus squeezes through. The Shrunken Head winces. As the bus rockets off, Tom and Harry arrive at The Leaky Cauldron. Tom silences a car alarm, trailing Harry through a quiet room. A bartender glances at them, a wizard reads as a coffee cup stirs itself. Tom leads Harry upstairs, where Hedwig perches on a chair. Harry turns to find Cornelius Fudge at the window. Harry's reflection shivers, but the man doesn't turn. Tom leans against the wall, cracks walnuts in his palms."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Sensing a mysterious presence in the shifting shadows just across the dimly lit street, he feels a tingling awareness and slowly rises from his spot. He turns back cautiously and with deliberate slowness, he reaches for his wand. Then, in that moment of heightened alertness, he finally sees it—something substantial and looming, darker than the shadows concealing it, with wide, gleaming eyes. A shiver of fear runs through Harry as he instinctively steps back, afraid to confront what he sees. His wand is outstretched in defense, but in his alarm, he loses his footing and trips over the forgotten trunk at his feet, tumbling down. The very tip of his wand ignites with a furious light; bang! Two parallel beams of intense, blinding light pierce through the night. Stan eyes Harry with suspicion and a slow nod of understanding. As Stan grabs Harry's trunk, Harry takes one last look into what are now simply shadows across the street—mere shadows—and climbs aboard the waiting vehicle. Inside the vehicle, there are only beds arranged side by side. In one of these beds, a disheveled wizard mutters and turns over restlessly in his sleep. Bang! Ernie sets the vehicle in motion with a sudden force, causing the beds to slide back as one, moving precisely six inches to the rear. Harry lets himself drop onto the bed nearest to him and looks up at the chandelier, noting how it sways directly above his head. Beyond the front windscreen, traffic rushes past in a blur, oncoming headlights cutting through the night. Stan, sitting huddled in a worn armchair, peeks over The Daily Prophet he is reading, casting a cool, assessing look at Harry before disappearing behind the paper once more. With a grin marked by sinister delight, revealing his less-than-perfect teeth, Stan joins in a moment of shared amusement with the Shrunken Head, which cackles with delight as Harry gazes out the windscreen, watching the bustling cityscape of London as it whizzes by. Sure enough, directly ahead, a little old lady appears, making her way across the street. Ernie slams on the brakes with sudden force, and Harry is thrust forward, palms slamming against the window; as the brakes clamp down, the bus halts mere inches from the old lady, and Harry is sent flying back onto his bed. Bang! The bus rockets forward yet again. As Harry rights himself on the moving bed, he catches sight of the headline on Stan's copy of The Daily Prophet: Escape from Azkaban! Beneath it, there is an image of a sunken-faced man with long, matted hair glaring out from a moving photograph. Harry shakes his head, his eyes still locked on the man's haunting face. Harry nods, and as he does so, the eyes of Black seem to shift. Suddenly, without warning, a pair of double-decker buses sweep toward the Knight Bus. Before Harry can even let out a scream, the entire Knight Bus compresses and shoots through the narrow gap between the two oncoming buses, the Shrunken Head wincing in response. As the Knight Bus speeds away into the night, Tom and Harry become visible; Harry looks up to read the sign above: The Leaky Cauldron. Tom drags Harry's trunk inside the establishment, then pauses, and with a deft flick of his wand, he silences a blaring car alarm. Harry follows closely behind Tom through the hushed room, where the bartender glances up, his gaze lingering on them perhaps a moment too long. A solitary wizard sits reading a book, while beside him, his coffee cup stirs itself with gentle motion. Tom leads the way upstairs, and as Harry follows him inside the room, he is greeted by the sight of a snow-white owl, Hedwig, perched confidently atop a chair. Harry turns, only to find a pinstriped silhouette, Cornelius Fudge, standing at the window, his gaze fixed intently on the ghostly shadows extending beyond. Harry's own reflection quivers within the glass, but the man at the window does not turn. Meanwhile, Tom, taking up a position against the wall, reaches into his pocket, retrieves a pair of walnuts, and with a sharp—crack—he crushes the shells between his palms, the sound punctuating the quiet atmosphere."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Sensing an enigmatic and mysterious presence lurking silently among the shifting shadows just across the dimly lit and slightly ominous street, he is struck by a tingling awareness that travels up his spine, prompting him to slowly rise from the spot where he had been sitting. Cautiously, he turns around, glancing back with calculated and deliberate slowness as his hand reaches for his wand, the familiar instrument of his defense. In that critical moment of heightened alertness and acute awareness, he finally sees it—the form is substantial and looming, darker even than the deep shadows concealing it, and possessing wide, gleaming eyes that stand out. A shiver of genuine fear shoots through Harry, making him step back instinctively, afraid to confront the unnerving vision before him. His wand is outstretched defensively, yet in his flustered alarm, he stumbles, losing his footing and tripping over the forgotten trunk at his feet, tumbling down awkwardly. The very tip of his wand erupts with a furious and brilliant light; bang! Two parallel beams of intensely blinding light pierce through the enveloping night. Stan eyes Harry with a suspicion that turns into a slow nod of understanding as he assesses the situation. As Stan hoists Harry's trunk, taking hold of it with ease, Harry takes one last look into the area now revealed to be nothing more than simple shadows across the street—mere harmless shadows—and proceeds to climb aboard the waiting vehicle. Once inside the rather peculiar vehicle, there are only beds arranged side by side, creating an unusual interior. In one of these beds, a disheveled wizard mutters in his sleep and turns over restlessly, as if plagued by unsettling dreams. Bang! Ernie sets the vehicle in motion with a sudden burst of force, causing all the beds to slide backward as one, moving precisely six inches to the rear with a smooth motion. Harry allows himself to drop onto the bed nearest to him and looks up, noting the chandelier above, which sways directly above his head. Beyond the large front windscreen, traffic rushes past in a colorful blur, with oncoming headlights cutting sharply through the night. Stan, sitting huddled comfortably in a well-worn armchair, peeks over the top of The Daily Prophet, the newspaper he is reading. He casts a cool and assessing look at Harry before disappearing behind the pages once more. With a grin marked by sinister delight and revealing his less-than-perfect teeth, Stan joins in a moment of shared amusement with the Shrunken Head, which emits a cackling laugh as Harry gazes out through the windscreen, watching the bustling cityscape of London flash by. Sure enough, directly ahead in the distance, a little old lady appears, making her way across the busy street. Ernie slams on the brakes with sudden force, and Harry is thrust forward, his palms slamming against the window; as the brakes clamp down, the bus halts mere inches from the old lady, and Harry is sent flying back onto his bed once again. Bang! The bus rockets forward yet again with renewed speed. As Harry rights himself on the now-moving bed, he catches sight of the glaring headline on Stan's copy of The Daily Prophet: Escape from Azkaban! Beneath it, there is an image of a sunken-faced man with long, matted hair glaring out ominously from a moving photograph. Harry shakes his head, his eyes still locked uncomfortably on the man's haunting face. As he nods, the eyes of Black within the image seem to shift slightly. Suddenly, without warning, a pair of double-decker buses approach, sweeping toward the Knight Bus. Before Harry can even let out a scream, the entire Knight Bus compresses and shoots elegantly through the narrow gap between the two oncoming buses, the Shrunken Head wincing in response. As the Knight Bus speeds away into the night, Tom and Harry become visible; Harry looks up to read the sign above: The Leaky Cauldron. Tom drags Harry's trunk inside the establishment, then pauses, and with a deft flick of his reliable wand, he silences a blaring car alarm. Harry follows closely behind Tom through the hushed room, where the bartender glances up, his gaze lingering on them for perhaps a moment too long. A solitary wizard sits nearby, absorbed in a book, while beside him, his coffee cup stirs itself with gentle motion. Tom leads the way upstairs, and as Harry follows him into the room, he is greeted by the sight of a snow-white owl, Hedwig, perched confidently atop a sturdy chair. Harry turns, only to find a distinctive pinstriped silhouette—Cornelius Fudge—standing at the window, his gaze fixed intently on the ghostly shadows that extend beyond. Harry's own reflection quivers within the glass, but the man at the window remains unmoved, not turning around. Meanwhile, Tom, taking up a position against the wall, reaches into his pocket, retrieves a pair of walnuts, and with a sharp—crack—he crushes the shells between his strong palms, the sound punctuating the otherwise quiet atmosphere."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Noticing an unusual movement in the shadows across the street, Harry feels a sense of unease that prompts him to rise from his seated position. His body tenses as he executes a swift turn backward and his hand moves deliberately to withdraw his wand from its resting place. As his eyes focus more intently, he perceives a formidable presence, larger and darker than the shadows that barely manage to conceal its form, its wide eyes gleaming with menace. Instinctively, Harry steps back to maintain distance and involuntarily averts his gaze, raising his wand in defense, but in his retreat, his foot catches on the edge of a trunk he had neglected to recall, sending him sprawling to the ground. In an instinctive response, the tip of Harry’s wand ignites with a sudden blaze of light, and a loud bang pierces the night as twin beams of blinding brilliance cut through the darkness. Observing this, Stan studies Harry with wary suspicion and then acknowledges him with a slow nod. Taking charge of the situation, Stan retrieves Harry's trunk, and as Harry directs his gaze once more into the shadowy expanse across the street, he finds only ordinary shadows lingering there. With a mix of caution and resignation, Harry follows Stan and boards the vehicle. Inside, he is met with the sight of multiple beds occupying the interior. On one of these beds, a wizard appears, his appearance messy and unkempt as he mutters in sleep and shifts his position. Abruptly, a loud bang resonates through the bus as Ernie accelerates with great force, causing all beds to slide in unison six inches toward the rear of the bus. Harry succumbs to the motion, dropping heavily onto the nearest bed, and his eyes travel upward to observe a chandelier swaying precariously above his head. Beyond the bus’s windscreen, images of oncoming traffic streak past in a rapid blur. In an armchair, Stan lowers The Daily Prophet momentarily to cast a cool, appraising look at Harry before returning behind the newspaper’s protective barrier. His grin, tinged with a sinister edge, reveals less-than-perfect teeth. Simultaneously, the Shrunken Head laughs with boisterous delight as Harry peers out the windscreen, watching the city of London rush by in a whirlwind of activity. True enough, straight ahead, an elderly lady commences her crossing of the street. Ernie abruptly slams the brakes, and Harry is propelled forward, his palms making contact with the window as the brakes grip hard, halting the bus just a hair's breadth from the woman. As momentum shifts, Harry is sent back onto his bed. Another bang signals the bus's rapid acceleration forward once more. As Harry regains his balance, he notices the front-page headline of Stan's Daily Prophet: \"Escape from Azkaban!\" Featuring below this headline is the moving photograph of a man whose face is worn and gaunt, framed by long, tangled hair. Harry’s thoughts linger as he continues to stare at the photograph, shaking his head in disbelief. In a gesture of acknowledgment, he nods, only to witness a shift in Black's eyes within the photograph. At that moment, two double-decker buses rapidly approach the Knight Bus from the front. Before any cry can escape Harry's lips, the Knight Bus, with surreal agility, compresses and propels itself through the narrowing space between the approaching buses. The Shrunken Head grimaces at the close shave. As the bus resumes its high-speed journey, the figures of Tom and Harry emerge from the scene. Harry’s eyes lift to read the sign above them: \"The Leaky Cauldron.\" Tom, with steady purpose, hauls Harry's trunk indoors and, pausing momentarily, aims his wand with a deft flick to silence a blaring car alarm. Following Tom through the subdued room, Harry notes the bartender, whose gaze seems to linger with a hint of curiosity. Elsewhere in the room, a lone wizard sits engrossed in a book, his coffee cup beside him stirring itself without aid. Tom guides Harry up the stairs, and as Harry trails behind Tom into the room, he is greeted by the sight of Hedwig, his owl, her feathers snowy and pristine, perched atop a chair. Turning, Harry’s attention is drawn to the figure of Cornelius Fudge, silhouetted in pinstripes at the window, his focus directed at the eerie shadows lurking beyond. Harry's reflection shimmers faintly in the glass, though Fudge remains unflinchingly still. Meanwhile, Tom takes up a relaxed stance against the wall, retrieving a pair of walnuts from his pocket, which he proceeds to crack open with a brisk crush of his palms."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Sensing something in the shadows across the street, Harry rises, turns back, and draws his wand cautiously, stepping back in fear as he spots a large, shadowy figure. He trips over his forgotten trunk, causing his wand to blaze and illuminate the night. Stan eyes Harry suspiciously, nods, and grabs Harry's trunk while Harry peers into now-empty shadows before boarding. Inside the bus, disarrayed wizards sleep, and Ernie rockets away, sending beds sliding backward. Harry settles onto a bed, watching the chandelier sway overhead and traffic blur past. Stan glances over from The Daily Prophet, then hides behind it again. With a grin, Stan and the Shrunken Head watch Harry observing London whiz by. Suddenly, Ernie brakes hard, narrowly stopping before an old lady, sending Harry flying forward and then back onto his bed. As the bus races forward again, Harry notices the headline on Stan's paper: Escape from Azkaban! He shakes his head at the sunken-faced man in the photograph, whose eyes eerily shift. Just then, the Knight Bus squeezes between two double-decker buses, and the Shrunken Head winces. As the Knight Bus stops, revealing Tom and Harry outside The Leaky Cauldron, Tom brings Harry's trunk inside, silencing a car alarm with a flick of his wand. Harry follows Tom through the quiet room, noting a bartender's lingering gaze and a solitary wizard with a self-stirring coffee cup. Upstairs, Harry finds Hedwig perched on a chair and a pinstriped silhouette by the window, staring out. Tom leans against the wall, cracking walnuts in his palms."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Sensing something in the shadows across the street, he rises, turns back, and slowly draws his wand often used by wizards for casting spells in the magical world. Then he sees it—something big, darker than the shadows which conceal it, with wide, gleaming eyes like those of the mythical Grim, a spectral dog said to be an omen of death. Harry steps back, afraid to look, his wand outstretched, and he trips, tumbling over the forgotten trunk, a school trunk filled with his belongings for Hogwarts. The tip of his wand blazes; bang! Twin beams of blinding light spear the night, a defensive spell known as Lumos Maxima. Stan, the conductor of the Knight Bus, eyes Harry suspiciously and nods slowly. As Stan grabs Harry's trunk, Harry peers into the shadows across the street—now simply shadows—and climbs aboard the Knight Bus, a magical triple-decker bus that assists stranded witches and wizards. Inside are only beds that accommodate passengers during their journey. In one bed, a disheveled wizard grunts and turns over in his sleep. Bang! Ernie, the driver, rockets away, and the beds as one slide six inches to the rear. Harry drops onto the bed nearest him and peers up at the chandelier swaying directly above his head, a typically ornate fixture even in odd settings. Beyond the windscreen, oncoming traffic whips past in a blur, barely visible in the speed of the magical bus. Stan, huddled in an armchair, peeks over The Daily Prophet, the wizarding world’s primary newspaper, eyes Harry coolly, then disappears once more. Stan grins with sinister delight, showing bad teeth, as the Shrunken Head, a sentient and humorous addition to the bus, cackles with delight and Harry peers out the windscreen, watching London careering by. Sure enough, directly ahead, a little old lady is crossing the street. Ernie hits the brakes hard, and Harry flies forward, palms to the window; the brakes pinch down, the bus stops inches from the old lady, and Harry flies back onto his bed. Bang! The bus rockets forward once more. As Harry rights himself, he notices the headline of Stan's Daily Prophet: Escape from Azkaban, referring to the notorious wizard prison guarded by Dementors. Below it, a sunken-faced man with long, matted hair glowers from a moving photograph, the wizard Sirius Black, who was believed to be a dangerous criminal. Harry shakes his head, still staring at the man's face. Harry nods, and as he does, Black's eyes shift, indicating the magical nature of wizarding photographs. Just then, a pair of double-decker buses sweep directly toward the Knight Bus. Before he can scream, the entire Knight Bus squeezes down and shoots the gap between the two onrushing buses, showcasing its ability to change shape and size to navigate through traffic. The Shrunken Head winces. As the Knight Bus rockets off, Tom, the innkeeper, and Harry are revealed; Harry glances up and reads the sign above: The Leaky Cauldron, a popular pub and inn in London that serves as a gateway between the non-wizarding world and Diagon Alley. Tom drags Harry's trunk inside, then pauses, and with a flick of his wand, silences the car alarm that had been set off earlier. Harry trails Tom through the quiet room, where the bartender glances up, his gaze lingering perhaps a bit too long, recognizing Harry. A solitary wizard reads a book while, at his elbow, his coffee cup stirs itself by magic. Tom leads Harry upstairs, and as Harry follows Tom inside, he finds a snow-white owl named Hedwig, Harry's loyal pet, perched atop a chair. Harry turns and finds a pinstriped silhouette, Cornelius Fudge, the Minister for Magic, at the window, staring at the ghostly shadows beyond. Harry's reflection shivers in the glass, but the man doesn't turn. Tom takes a position against the wall, fishes a pair of walnuts from his pocket, a habit of his, and—crack—crushes the shells between his palms."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Sensing something in the shadows across the street he rises turns back and slowly draws his wand. Then he sees it—something big darker than the shadows which conceal it with wide gleaming. Harry steps back afraid to look his wand outstretched and he trips tumbling over the forgotten trunk. The tip of his wand blazes. bang. Twin beams of blinding light spear the night. Stan eyes Harry suspiciously and nods slowly. As Stan grabs Harry's trunk Harry peers into the shadows across the street—now simply shadows—and climbs aboard. Inside are only beds. In one bed a disheveled wizard grunts and turns over in his sleep. Bang. Ernie rockets away and the beds as one slide six inches to the rear. Harry drops onto the bed nearest him and peers up at the chandelier swaying directly above his head. Beyond the windscreen oncoming traffic whips past in a blur. Stan huddled in an armchair peeks over The Daily Prophet eyes. Harry coolly then disappears once more. Stan grins with sinister delight showing bad teeth as the Shrunken Head cackles with delight and Harry peers out the windscreen watching London careering by. Sure enough directly ahead a little old lady is crossing the street. Ernie hits the brakes hard and Harry flies forward palms to the window. the brakes pinch down. the bus stops inches from the old lady and Harry flies back onto his bed. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. Bang. The bus rockets forward once more. As Harry rights himself he notices the headline of Stan's Daily Prophet. Escape from Azkaban. Below it a sunkenfaced man with long matted hair glowers from a moving photograph. Harry shakes his head still staring at the man's face. Harry nods and as he does Black's eyes shift. Just then a pair of doubledecker buses sweep directly toward the Knight Bus. Before he can scream the entire Knight Bus squeezes down and shoots the gap between the two onrushing buses. The Shrunken Head winces. As the Knight Bus rockets off Tom and Harry are revealed. Harry glances up and reads the sign above The Leaky Cauldron. Tom drags Harry's trunk inside then pauses and with a flick of his wand silences the car alarm. Harry trails Tom through the quiet room where the bartender glances up his gaze lingering perhaps a bit too long. A solitary wizard reads a book while at his elbow. his coffee cup stirs itself. Tom leads Harry upstairs and as Harry follows Tom inside he finds a snowwhite owl. Hedwig perched atop a chair. Harry turns and finds a pinstriped silhouette. Cornelius Fudge at the window staring at the ghostly shadows beyond Harry's reflection shivers in the glass but the man does not turn. Tom takes a position against the wall fishes a pair of walnuts from his pocket and—crack—crushes the shells between his palms."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Sensing something in the shadows across the street he rises turns back and slowly draws his wand. Then he sees it—something big darker than the shadows which conceal it with wide gleaming. Harry steps back afraid to look his wand outstretched and he trips tumbling over the forgotten trunk. The tip of his wand blazes. bang. Twin beams of blinding light spear the night. Stan eyes Harry suspiciously and nods slowly. As Stan grabs Harry's trunk Harry peers into the shadows across the street—now simply shadows—and climbs aboard. Inside are only beds. In one bed a disheveled wizard grunts and turns over in his sleep. Bang. Ernie rockets away and the beds as one slide six inches to the rear. Harry drops onto the bed nearest him and peers up at the chandelier swaying directly above his head. Beyond the windscreen oncoming traffic whips past in a blur. Stan huddled in an armchair peeks over The Daily Prophet eyes. Harry coolly then disappears once more. Stan grins with sinister delight showing bad teeth as the Shrunken Head cackles with delight and Harry peers out the windscreen watching London careering by. Sure enough directly ahead a little old lady is crossing the street. Ernie hits the brakes hard and Harry flies forward palms to the window. the brakes pinch down. the bus stops inches from the old lady and Harry flies back onto his bed. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Bang. The bus rockets forward once more. As Harry rights himself he notices the headline of Stan's Daily Prophet. Escape from Azkaban. Below it a sunkenfaced man with long matted hair glowers from a moving photograph. Harry shakes his head still staring at the man's face. Harry nods and as he does Black's eyes shift. Just then a pair of doubledecker buses sweep directly toward the Knight Bus. Before he can scream the entire Knight Bus squeezes down and shoots the gap between the two onrushing buses. The Shrunken Head winces. As the Knight Bus rockets off Tom and Harry are revealed. Harry glances up and reads the sign above The Leaky Cauldron. Tom drags Harry's trunk inside then pauses and with a flick of his wand silences the car alarm. Harry trails Tom through the quiet room where the bartender glances up his gaze lingering perhaps a bit too long. A solitary wizard reads a book while at his elbow. his coffee cup stirs itself. Tom leads Harry upstairs and as Harry follows Tom inside he finds a snowwhite owl. Hedwig perched atop a chair. Harry turns and finds a pinstriped silhouette. Cornelius Fudge at the window staring at the ghostly shadows beyond Harry's reflection shivers in the glass but the man does not turn. Tom takes a position against the wall fishes a pair of walnuts from his pocket and—crack—crushes the shells between his palms."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Sensing something in the shadows across the street he rises turns back and slowly draws his wand. Then he sees it—something big darker than the shadows which conceal it with wide gleaming. Harry steps back afraid to look his wand outstretched and he trips tumbling over the forgotten trunk. The tip of his wand blazes. bang. Twin beams of blinding light spear the night. Stan eyes Harry suspiciously and nods slowly. As Stan grabs Harry's trunk Harry peers into the shadows across the street—now simply shadows—and climbs aboard. Inside are only beds. In one bed a disheveled wizard grunts and turns over in his sleep. Bang. Harry glances up and reads the sign above The Leaky Cauldron. Tom drags Harry's trunk inside then pauses and with a flick of his wand silences the car alarm. Harry trails Tom through the quiet room where the bartender glances up his gaze lingering perhaps a bit too long. A solitary wizard reads a book while at his elbow. his coffee cup stirs itself. Tom leads Harry upstairs and as Harry follows Tom inside he finds a snowwhite owl. Hedwig perched atop a chair. Harry turns and finds a pinstriped silhouette. Cornelius Fudge at the window staring at the ghostly shadows beyond Harry's reflection shivers in the glass but the man does not turn. Tom takes a position against the wall fishes a pair of walnuts from his pocket and—crack—crushes the shells between his palms."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Sensing something in the shadows across the street he rises turns back and slowly draws his wand. Then he sees it—something big darker than the shadows which conceal it with wide gleaming. Harry steps back afraid to look his wand outstretched and he trips tumbling over the forgotten trunk. The tip of his wand blazes. bang. Hedwig perched atop a chair. Harry turns and finds a pinstriped silhouette. Cornelius Fudge at the window staring at the ghostly shadows beyond Harry's reflection shivers in the glass but the man does not turn. Tom takes a position against the wall fishes a pair of walnuts from his pocket and—crack—crushes the shells between his palms."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Suspecting something in the mist across the river, the cat rises, pivots forward, and quickly tosses its pen. Then it hears it—something small, brighter than the mist which reveals it, with narrow, glowing eyes. Lucy leaps forward, thrilled to touch, her pen extended, and she skips, flipping over the remembered suitcase. The top of her pen glows; boom! Twin streams of silvery rain pierce the day. Fred observes Lucy curiously and shakes quickly. As Fred picks up Lucy's suitcase, Lucy stares into the mist across the river—now merely mist—and slides aboard. Inside are only couches. On one couch, a tidy witch mutters and flips over in her nap. Boom! Bert soars away, and the couches together glide twelve inches to the front. Lucy lands on the couch nearest her and looks down at the lantern swinging directly below her feet. Beyond the curtain, passing trains rush by in a haze. Fred, curled in a couch, glances over The Weekly Bugle, observes Lucy quietly, then reappears once again. Fred smirks with cheerful intent, showing shiny teeth, as the Shrunken Tail giggles with humor and Lucy gazes out the curtain, witnessing Paris whirling past. Sure enough, directly behind, a tiny young boy is skipping the river. Bert taps the gas lightly, and Lucy sails backward, elbows to the ceiling; the gas presses up, the train eases yards from the young boy, and Lucy bounces back onto her couch. Boom! The train soars backward once more. As Lucy steadies herself, she observes the title of Fred's Weekly Bugle: Freedom from Ironforge! Above it, a stout-hearted woman with short, sleek hair grins from a still painting. Lucy nods her chin, still observing the woman's hair. Lucy shakes, and as she does, Green's smile widens. Just then, a group of single-passenger cars float indirectly from the Night Train. Before she can whisper, the entire Night Train inflates up and floats the gap over the three passing cars. The Shrunken Tail groans. As the Night Train soars down, Jim and Lucy are obscured; Lucy peeks down and reads the message below: The Sunny Patio. Jim hauls Lucy's suitcase outside, then hesitates, and with a wave of his stick, amplifies the truck horn. Lucy skips with Jim into the noisy space, where the cook peers down, his glare hovering perhaps a bit too short. A lively witch flips a page while, at her knee, her juice glass stirs itself. Jim guides Lucy downstairs, and as Lucy shadows Jim outside, she finds a jet-black cat (Mittens) lounging beneath a bookcase. Lucy turns and notices a striped shadow (Alexander Gray) by the table, gazing at the vivid light within. Lucy's sound echoes in the room, but the figure doesn't turn. Jim takes a stance near the door, pulls a pair of daisies from his hat, and—pop—splits the petals with his fingers."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Sensing something lurking across the street, Harry raises his wand in fear and accidentally trips over a trunk. His wand lights up, revealing the street as mere shadows. Stan, observing Harry with suspicion, helps him onto a bus filled with beds, where Ernie swiftly drives off. As Harry settles down, he notices Stan's Daily Prophet headline: \"Escape from Azkaban!\" featuring a glowering, sunken-faced man. Suddenly, the bus narrowly avoids an old lady and squeezes between two large buses, prompting the Shrunken Head to wince. They stop at The Leaky Cauldron, and Tom brings Harry's trunk inside, silencing a car alarm with his wand. Harry follows Tom upstairs, passing a bartender and a self-stirring coffee cup. Upstairs, Harry is greeted by his snowy owl, Hedwig, and sees Cornelius Fudge watching from the window. Tom steps back, cracking walnuts in his hands."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Tom takes a position against the wall fishes a pair of walnuts from his pocket and—crack—crushes the shells between his palms Cornelius Fudge at the window staring at the ghostly shadows beyond Harry's reflection shivers in the glass but the man does not turn Harry turns and finds a pinstriped silhouette Hedwig perched atop a chair Tom leads Harry upstairs and as Harry follows Tom inside he finds a snowwhite owl his coffee cup stirs itself A solitary wizard reads a book while at his elbow Harry trails Tom through the quiet room where the bartender glances up his gaze lingering perhaps a bit too long Tom drags Harry's trunk inside then pauses and with a flick of his wand silences the car alarm Harry glances up and reads the sign above The Leaky Cauldron As the Knight Bus rockets off Tom and Harry are revealed The Shrunken Head winces Before he can scream the entire Knight Bus squeezes down and shoots the gap between the two onrushing buses Just then a pair of doubledecker buses sweep directly toward the Knight Bus Harry nods and as he does Black's eyes shift Harry shakes his head still staring at the man's face Below it a sunkenfaced man with long matted hair glowers from a moving photograph Escape from Azkaban As Harry rights himself he notices the headline of Stan's Daily Prophet The bus rockets forward once more Bang the bus stops inches from the old lady and Harry flies back onto his bed the brakes pinch down Ernie hits the brakes hard and Harry flies forward palms to the window Sure enough directly ahead a little old lady is crossing the street Stan grins with sinister delight showing bad teeth as the Shrunken Head cackles with delight and Harry peers out the windscreen watching London careering by Harry coolly then disappears once more Stan huddled in an armchair peeks over The Daily Prophet eyes Beyond the windscreen oncoming traffic whips past in a blur Harry drops onto the bed nearest him and peers up at the chandelier swaying directly above his head Ernie rockets away and the beds as one slide six inches to the rear Bang In one bed a disheveled wizard grunts and turns over in his sleep Inside are only beds As Stan grabs Harry's trunk Harry peers into the shadows across the street—now simply shadows—and climbs aboard Stan eyes Harry suspiciously and nods slowly Twin beams of blinding light spear the night bang The tip of his wand blazes Harry steps back afraid to look his wand outstretched and he trips tumbling over the forgotten trunk Then he sees it—something big darker than the shadows which conceal it with wide gleaming Sensing something in the shadows across the street he rises turns back and slowly draws his wand"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Then he sees it—something big darker than the shadows which conceal it with wide gleaming Sensing something in the shadows across the street he rises turns back and slowly draws his wand The tip of his wand blazes Harry steps back afraid to look his wand outstretched and he trips tumbling over the forgotten trunk Twin beams of blinding light spear the night bang As Stan grabs Harry's trunk Harry peers into the shadows across the street—now simply shadows—and climbs aboard Stan eyes Harry suspiciously and nods slowly In one bed a disheveled wizard grunts and turns over in his sleep Inside are only beds Ernie rockets away and the beds as one slide six inches to the rear Bang Beyond the windscreen oncoming traffic whips past in a blur Harry drops onto the bed nearest him and peers up at the chandelier swaying directly above his head Harry coolly then disappears once more Stan huddled in an armchair peeks over The Daily Prophet eyes Sure enough directly ahead a little old lady is crossing the street Stan grins with sinister delight showing bad teeth as the Shrunken Head cackles with delight and Harry peers out the windscreen watching London careering by the brakes pinch down Ernie hits the brakes hard and Harry flies forward palms to the window Bang the bus stops inches from the old lady and Harry flies back onto his bed As Harry rights himself he notices the headline of Stan's Daily Prophet The bus rockets forward once more Below it a sunkenfaced man with long matted hair glowers from a moving photograph Escape from Azkaban Harry nods and as he does Black's eyes shift Harry shakes his head still staring at the man's face Before he can scream the entire Knight Bus squeezes down and shoots the gap between the two onrushing buses Just then a pair of doubledecker buses sweep directly toward the Knight Bus As the Knight Bus rockets off Tom and Harry are revealed The Shrunken Head winces Tom drags Harry's trunk inside then pauses and with a flick of his wand silences the car alarm Harry glances up and reads the sign above The Leaky Cauldron A solitary wizard reads a book while at his elbow Harry trails Tom through the quiet room where the bartender glances up his gaze lingering perhaps a bit too long Tom leads Harry upstairs and as Harry follows Tom inside he finds a snowwhite owl his coffee cup stirs itself Harry turns and finds a pinstriped silhouette Hedwig perched atop a chair Tom takes a position against the wall fishes a pair of walnuts from his pocket and—crack—crushes the shells between his palms Cornelius Fudge at the window staring at the ghostly shadows beyond Harry's reflection shivers in the glass but the man does not turn"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Bang The bus rockets forward once more As Harry rights himself he notices the headline of Stan's Daily Prophet Escape from Azkaban Below it a sunkenfaced man with long matted hair glowers from a moving photograph Harry shakes his head still staring at the man's face Harry nods and as he does Black's eyes shift Just then a pair of doubledecker buses sweep directly toward the Knight Bus Before he can scream the entire Knight Bus squeezes down and shoots the gap between the two onrushing buses The Shrunken Head winces As the Knight Bus rockets off Tom and Harry are revealed Harry glances up and reads the sign above The Leaky Cauldron Tom drags Harry's trunk inside then pauses and with a flick of his wand silences the car alarm Harry trails Tom through the quiet room where the bartender glances up his gaze lingering perhaps a bit too long A solitary wizard reads a book while at his elbow his coffee cup stirs itself Tom leads Harry upstairs and as Harry follows Tom inside he finds a snowwhite owl Hedwig perched atop a chair Harry turns and finds a pinstriped silhouette Cornelius Fudge at the window staring at the ghostly shadows beyond Harry's reflection shivers in the glass but the man does not turn Tom takes a position against the wall fishes a pair of walnuts from his pocket and—crack—crushes the shells between his palms Sensing something in the shadows across the street he rises turns back and slowly draws his wand Then he sees it—something big darker than the shadows which conceal it with wide gleaming Harry steps back afraid to look his wand outstretched and he trips tumbling over the forgotten trunk The tip of his wand blazes bang Twin beams of blinding light spear the night Stan eyes Harry suspiciously and nods slowly As Stan grabs Harry's trunk Harry peers into the shadows across the street—now simply shadows—and climbs aboard Inside are only beds In one bed a disheveled wizard grunts and turns over in his sleep Bang Ernie rockets away and the beds as one slide six inches to the rear Harry drops onto the bed nearest him and peers up at the chandelier swaying directly above his head Beyond the windscreen oncoming traffic whips past in a blur Stan huddled in an armchair peeks over The Daily Prophet eyes Harry coolly then disappears once more Stan grins with sinister delight showing bad teeth as the Shrunken Head cackles with delight and Harry peers out the windscreen watching London careering by Sure enough directly ahead a little old lady is crossing the street Ernie hits the brakes hard and Harry flies forward palms to the window the brakes pinch down the bus stops inches from the old lady and Harry flies back onto his bed"
        }
      ]
    }
  ]
}