{
  "ground_truth": "Harry glances warily from the steaming tureen of green to Tom, who works a grimy thumb into his gum and frees a walnut sliver, while Fudge turns and smiles nervously. Harry eyes the stack of books, noticing that one is bound by a rope, and through the window, the rooftops of London are visible. As a train passes, the camera pulls back to reveal Harry standing with Hedwig; he turns and eyes his schoolbooks. He studies the growling tome, The Monster Book of Monsters, and gives the rope a tug, causing the book to leap to the floor, with pages flying and book covers snapping. Harry gives chase, but the book turns and begins nipping viciously at his shoes. He vaults atop the bed, watches the book disappear underneath, and then grabs a pillow. Seconds later, the book scuttles into view, and Harry pounces, muffling the book's roar beneath the pillow. A young witch in maid's robes pushes a cart down the hall as Harry exits his room just as she knocks on a door. Upon opening the door, she's greeted by a thunderous roar and a rush of wind, and something small and fast dashes by Harry's feet. He sees a ragged-looking rat, Scabbers, pursued by an ugly orange cat, Crookshanks. As Harry moves down the stairs, voices emerge from below. Once he reaches the bottom, he finds Ron Weasley protectively cradling Scabbers, while Hermione Granger tries to restrain a hissing Crookshanks. Sensing another presence in the room, both Ron and Hermione turn to face him. In the accompanying photo, the entire Weasley family stands before the Great Pyramids, waving, with Ron in the middle and Scabbers perched on his shoulder. Mrs. Weasley takes Harry's face in her hands and smiles as Harry's eyes drift to the fugitive poster. Meanwhile, Mr. Weasley hesitates, unable to continue, then hesitates again, and she points. Just then, the compartment rattles, lanterns flicker, and the train lurches, beginning to slow. Harry rises, slides open the door, and peers into the corridor. From Harry's point of view, all along the carriage, heads look out curiously. Then the train jerks, the car sways, and the lamps running along the ceiling flicker and die. A thin wisp of steam escapes Ron's mouth as he stands, a dark silhouette against the window, wiping a patch of condensation from it. Suddenly, the car sways violently, and from the stick in the hands of R.J. Lupin emanates a shivering light; his face looks tired and gray, but his eyes are alert and wary. Hermione's troubled face hovers above Harry as he sits up, and Ron, pale and nervous, extends his hand to give Harry his glasses. As Harry leaves, he turns to Ron and Hermione, but she shakes her head. Harry then looks to the window, and the reflection in it comes into focus.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Harry gazes cautiously from the steaming bowl of green to Tom, who inserts a grimy thumb into his gum and dislodges a walnut fragment, while Fudge turns and grins nervously. Harry regards the stack of volumes, noticing that one is tied by a rope, and through the pane, the rooftops of London are visible. As a train passes, the camera withdraws to reveal Harry standing with Hedwig; he turns and regards his schoolbooks. He examines the growling tome, The Monster Volume of Monsters, and gives the rope a pull, causing the volume to leap to the floor, with pages soaring and book covers snapping. Harry pursues, but the volume turns and begins nipping fiercely at his shoes. He vaults atop the bed, watches the volume vanish underneath, and then seizes a pillow. Moments later, the volume scuttles into view, and Harry lunges, muffling the volume's roar beneath the pillow. A young witch in maid's robes pushes a trolley down the hall as Harry exits his room just as she knocks on a door. Upon opening the door, she's greeted by a deafening roar and a rush of wind, and something small and swift dashes by Harry's feet. He sees a ragged-looking rat, Scabbers, chased by an ugly orange feline, Crookshanks. As Harry moves down the stairs, voices emerge from below. Once he reaches the bottom, he finds Ron Weasley protectively cradling Scabbers, while Hermione Granger tries to restrain a hissing Crookshanks. Sensing another presence in the room, both Ron and Hermione turn to face him. In the accompanying image, the entire Weasley family stands before the Great Pyramids, waving, with Ron in the middle and Scabbers perched on his shoulder. Mrs. Weasley takes Harry's face in her hands and grins as Harry's eyes drift to the fugitive poster. Meanwhile, Mr. Weasley hesitates, unable to continue, then hesitates again, and she points. Just then, the compartment rattles, lanterns flicker, and the train lurches, beginning to decelerate. Harry rises, slides open the door, and peers into the passageway. From Harry's vantage point, all along the carriage, heads look out curiously. Then the train jerks, the car sways, and the lamps running along the ceiling flicker and extinguish. A thin wisp of steam escapes Ron's mouth as he stands, a dark silhouette against the window, wiping a patch of condensation from it. Suddenly, the car sways violently, and from the stick in the hands of R.J. Lupin emanates a tremulous light; his face appears tired and gray, but his eyes are alert and cautious. Hermione's troubled face hovers above Harry as he sits up, and Ron, pale and anxious, extends his hand to give Harry his glasses. As Harry departs, he turns to Ron and Hermione, but she shakes her head. Harry then looks to the window, and the reflection in it comes into focus."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Harry is glanced at warily by the steaming tureen of green, while Tom, who works a grimy thumb into his gum, frees a walnut sliver. Fudge turns and smiles nervously. The stack of books is eyed by Harry, who notices that one is bound by a rope, and through the window, the rooftops of London are seen by him. As a train passes, Harry is revealed standing with Hedwig as the camera pulls back; his schoolbooks are eyed by him. The growling tome, The Monster Book of Monsters, is studied by him, and the rope is given a tug, causing the book to leap to the floor, with pages flying and book covers snapping. The chase is given by Harry, but his shoes are nipped at viciously by the book, which turns. He vaults atop the bed, watches the book disappear underneath, and a pillow is grabbed by him. Seconds later, the book scuttles into view, and the book's roar is muffled beneath the pillow as Harry pounces. A cart is pushed down the hall by a young witch in maid's robes as Harry exits his room just as she knocks on a door. Upon the door being opened, she is greeted by a thunderous roar and a rush of wind, and something small and fast is seen dashing by Harry's feet. A ragged-looking rat, Scabbers, is seen by him, pursued by an ugly orange cat, Crookshanks. As the stairs are moved down by Harry, voices emerge from below. Once the bottom is reached, Ron Weasley, who protectively cradles Scabbers, is found by him, while a hissing Crookshanks is tried to be restrained by Hermione Granger. Another presence in the room is sensed, and both Ron and Hermione turn to face him. In the accompanying photo, the entire Weasley family is seen standing before the Great Pyramids, waving, with Ron in the middle and Scabbers perched on his shoulder. Harry's face is taken in Mrs. Weasley's hands, and she smiles as Harry's eyes drift to the fugitive poster. Meanwhile, Mr. Weasley hesitates, unable to continue, then hesitates again, and she points. Just then, the compartment is rattled, lanterns flicker, and the train is lurched, beginning to slow. Harry rises, slides open the door, and the corridor is peered into by him. From Harry's point of view, heads look out curiously all along the carriage. Then the train is jerked, the car is swayed, and the lamps running along the ceiling are flickered and died. A thin wisp of steam is escaped from Ron's mouth as he stands, a dark silhouette against the window, wiping a patch of condensation from it. Suddenly, the car is swayed violently, and a shivering light emanates from the stick in the hands of R.J. Lupin; his face looks tired and gray, but his eyes are alert and wary. Hermione's troubled face hovers above Harry as he sits up, and Ron, pale and nervous, extends his hand to give him his glasses. As Harry leaves, he turns to Ron and Hermione, but her head is shaken. The window is then looked to by Harry, and the reflection in it comes into focus."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Harry warily glances from the steaming tureen to Tom, who uses a grimy thumb to remove a walnut sliver from his gum while Fudge smiles nervously. Harry notices a rope-bound book and the London rooftops through the window. As a train passes, the camera reveals Harry with Hedwig; he examines his schoolbooks. He tugs the rope on The Monster Book of Monsters, causing it to hit the floor and snap its pages. Harry chases it as it nips at his shoes, vaults onto the bed, and grabs a pillow. The book scuttles out, and Harry pounces, muffling its roar with the pillow. A young witch in maid's robes pushes a cart down the hall as Harry exits his room. She opens a door to a thunderous roar and gust of wind, and something small races past Harry's feet. It's Scabbers, chased by Crookshanks. Descending the stairs, Harry hears voices. He finds Ron cradling Scabbers, while Hermione restrains Crookshanks. They sense Harry's presence and turn. In a photo, the Weasley family waves at the Great Pyramids, with Ron and Scabbers in the middle. Mrs. Weasley smiles at Harry, whose eyes drift to a fugitive poster. Meanwhile, Mr. Weasley hesitates and points. The compartment rattles, lanterns flicker, and the train slows. Harry rises, opens the door, and looks into the corridor as heads peer curiously. The train jerks, swaying the car, and the ceiling lamps flicker out. A steam wisp escapes Ron's mouth as he wipes condensation from the window. The car sways violently, and a glowing light from R.J. Lupin's stick reveals his tired but alert eyes. Hermione's worried face hovers above Harry as he sits up, and Ron, pale, hands him his glasses. Harry looks to Ron and Hermione; she shakes her head. He then focuses on his window reflection."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Harry eyes the steaming tureen of green and Tom, who removes a walnut from his gum, as Fudge nervously smiles. Harry notices a stack of books, one bound by rope, as London rooftops are visible through the window. With a train passing, Harry, standing with Hedwig, turns to his schoolbooks. He tugs on The Monster Book of Monsters' rope, causing it to fall, pages flying. Harry chases it as it nips at his shoes, vaults onto the bed, grabs a pillow, and muffles the book's roar. A maid pushes a cart as Harry exits his room. She opens a door, is met by a roar, and something darts by Harry's feet. He sees Scabbers chased by Crookshanks. Downstairs, Ron cradles Scabbers while Hermione restrains Crookshanks. Ron and Hermione notice Harry. In a photo, the Weasleys wave at the Great Pyramids, with Ron and Scabbers. Mrs. Weasley smiles at Harry, who glances at a fugitive poster. Mr. Weasley hesitates, and she points. The train lurches, and lanterns flicker as Harry peers into the corridor. Heads look out, the car sways, and lights die. Steam escapes Ron's mouth as he wipes the window. The car sways, Lupin's wand emits light, and his eyes are alert. Hermione's face hovers as Ron hands Harry his glasses. Harry looks to Ron and Hermione, but she shakes her head, and Harry focuses on the window reflection."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Harry cautiously directs his gaze from the steaming tureen of mysterious green substance to Tom, who busily works his grimy thumb into his gum to dislodge a bothersome walnut sliver. Meanwhile, Fudge turns and offers a nervous smile. Harry's eyes drift to the stack of books, noticing particularly that one of them is securely bound by a rope. Through the window, the rooftops of London stretch out in the distance. As a train roars by, the camera lens pans back to show Harry standing alongside Hedwig. He turns his attention to his schoolbooks, specifically focusing on the ominous tome, The Monster Book of Monsters. With a tug of the rope, the book suddenly leaps to the floor, its pages fluttering wildly and the covers snapping fiercely. Harry quickly gives chase, but the unruly book turns and begins to nip viciously at his shoes. Instinctively, he vaults atop the bed, watching the book as it vanishes beneath. He hurriedly grabs a pillow. Moments later, the book appears again, and Harry pounces, muffling its ferocious growl beneath the pillow's soft embrace. \n\nOutside his room, in the corridor, a young witch dressed in traditional maid's robes pushes a cart, moving purposefully down the hall. Just as Harry exits his room, she raps on a door. The door opens to a greeting of thunderous roar and a gust of wind, and something small and fast darts past Harry's feet. He sees a disheveled-looking rat, Scabbers, being hotly pursued by an unsightly orange cat, Crookshanks. Descending the stairs, Harry becomes aware of voices drifting up from below. Upon reaching the bottom, he finds Ron Weasley, protectively cradling Scabbers, while Hermione Granger attempts to hold back a hissing Crookshanks. Both Ron and Hermione sense another presence in the room and turn to acknowledge Harry. A photograph captures the moment—the entire Weasley family stands proudly before the magnificent Great Pyramids, waving happily, with Ron centrally positioned and Scabbers perched confidently on his shoulder. Mrs. Weasley gently takes Harry's face in her hands and smiles warmly as Harry's attention drifts momentarily to a fugitive poster. Concurrently, Mr. Weasley hesitates, his words faltering, hesitating once more as she points in a different direction. \n\nIn that very moment, the compartment begins to rattle intensely, lanterns flicker uncertainly, and the train jerks as it gradually starts to slow down. Rising to his feet, Harry slides open the door and peers curiously into the corridor. From Harry's vantage point, heads can be seen popping out curiously along the carriage. Abruptly, the train jerks violently, the car sways, and the lamps running overhead flicker before finally dying out. A thin wisp of steam escapes Ron's mouth as he stands, silhouetted against the window, wiping clear a patch of condensation. Suddenly, the car is thrown into a violent sway, and from the wand in the hands of R.J. Lupin, a shivering light emanates; his face is marked by weariness and gray, yet his eyes remain sharp and vigilant. Hermione’s concerned face hovers above Harry as he sits up, while Ron, looking pale and uneasy, extends his hand to give Harry his glasses. As Harry prepares to leave, he glances back at Ron and Hermione, but Hermione simply shakes her head. Harry's gaze then shifts to the window, where the reflection in the glass gradually comes into sharp focus."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Harry, with a cautious curiosity, shifts his gaze away from the steaming tureen filled with a mysterious green substance and directs it towards Tom. Tom, meanwhile, is occupied with the task of working his grimy thumb into his gum in an attempt to dislodge a bothersome sliver of walnut. At the same moment, Fudge turns towards Harry, offering a nervous smile that does little to ease the atmosphere. Harry's eyes then drift towards a stack of books, specifically noticing one volume that is securely bound by a rope. Through the nearby window, the rooftops of London can be seen stretching out into the distance. As a train roars by, the camera lens pans back to reveal Harry standing alongside his owl, Hedwig. Harry then shifts his focus to his schoolbooks, with particular attention to the ominous tome known as The Monster Book of Monsters. With a firm tug on the rope, the book suddenly springs to life, leaping to the floor with its pages fluttering wildly and its covers snapping fiercely. Harry immediately gives chase, but the unruly book turns the tables and begins nipping viciously at his shoes. Instinctively, Harry vaults atop the bed, keeping his watchful eye on the book as it vanishes beneath. In a hurried motion, he grabs a pillow. Moments later, the book reemerges, and Harry pounces, successfully muffling its ferocious growl beneath the pillow's soft embrace.\n\nJust outside Harry's room, in the corridor, a young witch dressed in traditional maid's robes can be seen pushing a cart, moving with a sense of purpose down the hall. As Harry exits his room, she raps confidently on a nearby door. When the door opens, it is greeted by a thunderous roar and a strong gust of wind, from which something small and fast darts past Harry's feet. He quickly identifies it as Scabbers, a disheveled-looking rat, being hotly pursued by the unsightly orange cat, Crookshanks. As Harry descends the stairs, he becomes aware of the sound of voices drifting up from below. Upon reaching the bottom, he finds himself in the presence of Ron Weasley, who is protectively cradling Scabbers, while Hermione Granger attempts to hold back a hissing Crookshanks. Both Ron and Hermione sense another presence in the room and turn to acknowledge Harry. A photograph captures this particular moment—the entire Weasley family stands proudly before the magnificent Great Pyramids, waving happily, with Ron centrally positioned and Scabbers confidently perched on his shoulder. Mrs. Weasley then gently takes Harry's face in her hands and offers him a warm smile as Harry's attention briefly drifts to a fugitive poster nearby. At the same time, Mr. Weasley hesitates, his words faltering, as he points in a different direction with uncertainty.\n\nSuddenly, the compartment begins to rattle intensely, the lanterns flicker with uncertainty, and the train jerks as it gradually starts to slow down. Rising to his feet, Harry slides open the door and peers curiously into the corridor. From Harry's vantage point, heads can be seen popping out curiously along the carriage, wondering what is happening. Without warning, the train jerks violently, the car sways, and the lamps running overhead flicker before eventually dying out completely. A thin wisp of steam escapes from Ron's mouth as he stands silhouetted against the window, wiping clear a patch of condensation. In a swift motion, the car is thrown into a violent sway, and from the wand held by R.J. Lupin, a shivering light emanates; his face is drawn with weariness and gray, yet his eyes remain sharp and vigilant. Hermione’s concerned face hovers above Harry as he sits up, while Ron, looking pale and uneasy, extends his hand to give Harry his glasses. As Harry prepares to leave, he glances back at Ron and Hermione, but Hermione simply shakes her head. Harry's gaze then shifts to the window, where the reflection in the glass gradually sharpens into focus."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Harry's glance shifts warily from the steaming tureen of green liquid to Tom, who is preoccupied with working his grimy thumb into his gum to dislodge a walnut sliver, finally freeing it, while Fudge turns toward Harry with a nervous smile touching his lips. Harry then shifts his focus to the stack of books beside him, his eyes narrowing as he notices one of them is bound tightly by a rope. Through the window, he sees the sprawling rooftops of London stretch into the distance. The sound of a passing train prompts the camera to pull back, revealing Harry standing alongside his owl, Hedwig. Turning his attention back to his schoolbooks, he focuses intently on the formidable growling tome, The Monster Book of Monsters. With a determined tug on the rope, the book is set free, tumbling to the floor, pages fluttering wildly and covers snapping loudly. Harry quickly gives chase, only to find the book has turned, now nipping aggressively at his shoes. In a swift move, he vaults atop the bed, watching as the book scuttles underneath. Grabbing a pillow, he waits, and within seconds, the book reemerges into view. Harry springs into action, pouncing and smothering the book's roar beneath the pillow. Meanwhile, a young witch dressed in maid's robes pushes a cart down the hallway. Harry emerges from his room just as she knocks on a nearby door. When she opens it, a thunderous roar fills the air, accompanied by a rush of wind as something small and fast darts past Harry's feet. He recognizes the ragged-looking rat, Scabbers, chased closely by the ugly orange cat, Crookshanks. As Harry makes his way down the stairs, murmurs of conversation rise from below. Upon reaching the bottom, he discovers Ron Weasley cradling Scabbers protectively, while Hermione Granger attempts to restrain a hissing Crookshanks. Both Ron and Hermione sense Harry's arrival, turning their attention toward him. In the accompanying photo, the entire Weasley family stands before the Great Pyramids, waving enthusiastically, with Ron at the center and Scabbers perched on his shoulder. Mrs. Weasley gently takes Harry's face in her hands, offering a warm smile as Harry's gaze is drawn to a fugitive poster nearby. Concurrently, Mr. Weasley pauses, hesitating before continuing, then hesitates again, and Mrs. Weasley points in response. Suddenly, the compartment rattles, lanterns flicker, and the train begins to slow. Rising from his seat, Harry slides open the door and steps into the corridor. From his vantage point, he observes heads popping out curiously all along the carriage. Suddenly, the train jerks, causing the car to sway as the ceiling lamps flicker and extinguish. A thin wisp of steam escapes Ron's mouth as he stands silhouetted against the window, wiping away a patch of condensation. The car sways violently again, and from the stick held by R.J. Lupin emerges a shivering light; his face appears tired and gray, yet his eyes remain alert and vigilant. Hermione's concerned face hovers above Harry as he sits up, while Ron, looking pale and nervous, extends his hand to return Harry's glasses. As Harry prepares to leave, he glances back at Ron and Hermione, but Hermione gives a gentle shake of her head. Harry then turns his gaze to the window, where the reflection slowly sharpens into focus."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Harry warily glances from the steaming tureen of green to Tom, who dislodges a walnut sliver from his gums, while Fudge nervously smiles. Noticing a stack of books, one bound by a rope, Harry shifts his gaze to the London rooftops seen through the window. As a train passes, the camera reveals Harry standing with Hedwig before he turns his attention to his schoolbooks. He studies The Monster Book of Monsters, tugs the rope, and the book leaps to the floor, snapping and scattering pages. Harry chases it as it nips at his shoes, then vaults onto the bed, watching the book disappear. Grabbing a pillow, he tackles the book, muffling its roar beneath the pillow. As Harry exits his room, a maid in witch’s robes pushes a cart down the hall, and she's startled by a thunderous roar when opening a door. A ragged rat, Scabbers, dashes past Harry, pursued by Crookshanks, a large orange cat. Descending the stairs, Harry hears voices and sees Ron cradling Scabbers while Hermione restrains Crookshanks. Ron and Hermione turn to face Harry, and in a photo, the Weasley family poses before the Great Pyramids with Scabbers on Ron's shoulder. Mrs. Weasley warmly cups Harry’s face as his eyes drift to a fugitive poster. Mr. Weasley hesitates and points as the compartment rattles, lanterns flicker, and the train slows. Harry rises, peers into the corridor, and sees curious heads looking out. The train lurches, sways, and the lights flicker out. A wisp of steam escapes Ron's mouth as he clears a patch of window condensation, while R.J. Lupin's wand emanates a shivering light, revealing his tired yet alert face. Hermione's concerned face hovers over Harry as he sits up, and Ron hands him his glasses with a nervous expression. As Harry leaves, he turns to Ron and Hermione, but she shakes her head. He looks to the window, focusing on the reflection coming into view."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Harry glances warily from the steaming tureen of green, likely containing a potion or enchanted substance typical in magical households, to Tom, who works a grimy thumb into his gum and frees a walnut sliver, while Fudge, the Minister of Magic with an air of authority tempered by recent scandals, turns and smiles nervously. Harry eyes the stack of books, noticing that one is bound by a rope, a precaution often necessary for magical texts, and through the window, the iconic rooftops of London, with landmarks like Big Ben and the Shard, are visible. As a train passes, the camera pulls back to reveal Harry standing with Hedwig, his loyal snowy owl companion; he turns and eyes his schoolbooks. He studies the growling tome, The Monster Book of Monsters, a notorious textbook for Care of Magical Creatures that often requires a firm hand, and gives the rope a tug, causing the book to leap to the floor, with pages flying and book covers snapping. Harry gives chase, but the book turns and begins nipping viciously at his shoes. He vaults atop the bed, which is adorned with the colors of Gryffindor, watches the book disappear underneath, and then grabs a pillow. Seconds later, the book scuttles into view, and Harry pounces, muffling the book's roar beneath the pillow. A young witch in maid's robes pushes a cart down the hall of the Leaky Cauldron, a famous inn and pub serving as a gateway between the non-magical and magical worlds in London, as Harry exits his room just as she knocks on a door. Upon opening the door, she's greeted by a thunderous roar and a rush of wind, likely the result of a magical prank or creature, and something small and fast dashes by Harry's feet. He sees a ragged-looking rat, Scabbers, who has shown signs of having a mysterious past, pursued by an ugly orange cat, Crookshanks, known for its remarkable intelligence and sharp instincts. As Harry moves down the stairs, voices emerge from below. Once he reaches the bottom, he finds Ron Weasley protectively cradling Scabbers, while Hermione Granger tries to restrain a hissing Crookshanks. Sensing another presence in the room, both Ron and Hermione turn to face him. In the accompanying photo, the entire Weasley family stands before the Great Pyramids, a popular tourist destination due to their ancient magical connections, waving, with Ron in the middle and Scabbers perched on his shoulder. Mrs. Weasley, known for her motherly warmth and fierce protectiveness, takes Harry's face in her hands and smiles as Harry's eyes drift to the fugitive poster of Sirius Black, a notorious escapee from Azkaban. Meanwhile, Mr. Weasley, fascinated by Muggle artifacts, hesitates, unable to continue, then hesitates again, and she points. Just then, the compartment rattles, lanterns flicker, and the train lurches, beginning to slow. Harry rises, slides open the door, and peers into the corridor. From Harry's point of view, all along the carriage, heads look out curiously. Then the train jerks, the car sways, and the lamps running along the ceiling flicker and die, an ominous sign often associated with Dementors, the eerie guards of Azkaban prison. A thin wisp of steam escapes Ron's mouth as he stands, a dark silhouette against the window, wiping a patch of condensation from it. Suddenly, the car sways violently, and from the stick in the hands of R.J. Lupin, the new Defense Against the Dark Arts professor known for his compassionate nature, emanates a shivering light; his face looks tired and gray, but his eyes are alert and wary. Hermione's troubled face hovers above Harry as he sits up, and Ron, pale and nervous, extends his hand to give Harry his glasses. As Harry leaves, he turns to Ron and Hermione, but she shakes her head. Harry then looks to the window, and the reflection in it comes into focus."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Harry glances warily from the steaming tureen of green to Tom who works a grimy thumb into his gum and frees a walnut sliver while Fudge turns and smiles nervously. Harry eyes the stack of books noticing that one is bound by a rope and through the window the rooftops of London are visible. As a train passes the camera pulls back to reveal Harry standing with Hedwig. he turns and eyes his schoolbooks. He studies the growling tome The Monster Book of Monsters and gives the rope a tug causing the book to leap to the floor with pages flying and book covers snapping. Harry gives chase but the book turns and begins nipping viciously at his shoes. He vaults atop the bed watches the book disappear underneath and then grabs a pillow. Seconds later the book scuttles into view and Harry pounces muffling the book's roar beneath the pillow. A young witch in maid's robes pushes a cart down the hall as Harry exits his room just as she knocks on a door. Upon opening the door she is greeted by a thunderous roar and a rush of wind and something small and fast dashes by Harry's feet. He sees a raggedlooking rat Scabbers pursued by an ugly orange cat Crookshanks. As Harry moves down the stairs voices emerge from below. Once he reaches the bottom he finds Ron Weasley protectively cradling Scabbers while Hermione Granger tries to restrain a hissing Crookshanks. Sensing another presence in the room both Ron and Hermione turn to face him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. In the accompanying photo the entire Weasley family stands before the Great Pyramids waving with Ron in the middle and Scabbers perched on his shoulder. Mrs Weasley takes Harry's face in her hands and smiles as Harry's eyes drift to the fugitive poster. Meanwhile Mr Weasley hesitates unable to continue then hesitates again and she points. Just then the compartment rattles lanterns flicker and the train lurches beginning to slow. Harry rises slides open the door and peers into the corridor. From Harry's point of view all along the carriage heads look out curiously. Then the train jerks. the car sways and the lamps running along the ceiling flicker and die. A thin wisp of steam escapes Ron's mouth as he stands a dark silhouette against the window wiping a patch of condensation from it. Suddenly the car sways violently and from the stick in the hands of RJ Lupin emanates a shivering light. his face looks tired and gray but his eyes are alert and wary. Hermione's troubled face hovers above Harry as he sits up and Ron pale and nervous extends his hand to give Harry his glasses. As Harry leaves he turns to Ron and Hermione but she shakes her head. Harry then looks to the window and the reflection in it comes into focus."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Harry glances warily from the steaming tureen of green to Tom who works a grimy thumb into his gum and frees a walnut sliver while Fudge turns and smiles nervously. Harry eyes the stack of books noticing that one is bound by a rope and through the window the rooftops of London are visible. As a train passes the camera pulls back to reveal Harry standing with Hedwig. he turns and eyes his schoolbooks. He studies the growling tome The Monster Book of Monsters and gives the rope a tug causing the book to leap to the floor with pages flying and book covers snapping. Harry gives chase but the book turns and begins nipping viciously at his shoes. He vaults atop the bed watches the book disappear underneath and then grabs a pillow. Seconds later the book scuttles into view and Harry pounces muffling the book's roar beneath the pillow. A young witch in maid's robes pushes a cart down the hall as Harry exits his room just as she knocks on a door. Upon opening the door she is greeted by a thunderous roar and a rush of wind and something small and fast dashes by Harry's feet. He sees a raggedlooking rat Scabbers pursued by an ugly orange cat Crookshanks. As Harry moves down the stairs voices emerge from below. Once he reaches the bottom he finds Ron Weasley protectively cradling Scabbers while Hermione Granger tries to restrain a hissing Crookshanks. Sensing another presence in the room both Ron and Hermione turn to face him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In the accompanying photo the entire Weasley family stands before the Great Pyramids waving with Ron in the middle and Scabbers perched on his shoulder. Mrs Weasley takes Harry's face in her hands and smiles as Harry's eyes drift to the fugitive poster. Meanwhile Mr Weasley hesitates unable to continue then hesitates again and she points. Just then the compartment rattles lanterns flicker and the train lurches beginning to slow. Harry rises slides open the door and peers into the corridor. From Harry's point of view all along the carriage heads look out curiously. Then the train jerks. the car sways and the lamps running along the ceiling flicker and die. A thin wisp of steam escapes Ron's mouth as he stands a dark silhouette against the window wiping a patch of condensation from it. Suddenly the car sways violently and from the stick in the hands of RJ Lupin emanates a shivering light. his face looks tired and gray but his eyes are alert and wary. Hermione's troubled face hovers above Harry as he sits up and Ron pale and nervous extends his hand to give Harry his glasses. As Harry leaves he turns to Ron and Hermione but she shakes her head. Harry then looks to the window and the reflection in it comes into focus."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Harry glances warily from the steaming tureen of green to Tom who works a grimy thumb into his gum and frees a walnut sliver while Fudge turns and smiles nervously. Harry eyes the stack of books noticing that one is bound by a rope and through the window the rooftops of London are visible. As a train passes the camera pulls back to reveal Harry standing with Hedwig. he turns and eyes his schoolbooks. He studies the growling tome The Monster Book of Monsters and gives the rope a tug causing the book to leap to the floor with pages flying and book covers snapping. Harry gives chase but the book turns and begins nipping viciously at his shoes. He vaults atop the bed watches the book disappear underneath and then grabs a pillow. the car sways and the lamps running along the ceiling flicker and die. A thin wisp of steam escapes Ron's mouth as he stands a dark silhouette against the window wiping a patch of condensation from it. Suddenly the car sways violently and from the stick in the hands of RJ Lupin emanates a shivering light. his face looks tired and gray but his eyes are alert and wary. Hermione's troubled face hovers above Harry as he sits up and Ron pale and nervous extends his hand to give Harry his glasses. As Harry leaves he turns to Ron and Hermione but she shakes her head. Harry then looks to the window and the reflection in it comes into focus."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Harry glances warily from the steaming tureen of green to Tom who works a grimy thumb into his gum and frees a walnut sliver while Fudge turns and smiles nervously. Harry eyes the stack of books noticing that one is bound by a rope and through the window the rooftops of London are visible. As a train passes the camera pulls back to reveal Harry standing with Hedwig. Hermione's troubled face hovers above Harry as he sits up and Ron pale and nervous extends his hand to give Harry his glasses. As Harry leaves he turns to Ron and Hermione but she shakes her head. Harry then looks to the window and the reflection in it comes into focus."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Sigmund peers cautiously from the simmering cauldron of purple to Jerry, who maneuvers a filthy token into his sock and extracts a marshmallow fragment, while Pickles rotates and snickers anxiously. Sigmund observes the pile of maps, noting that one is encased by a chain, and through the hatch, the skylines of Paris are discernible. As a bicycle zooms by, the telescope zooms out to unveil Sigmund standing with Twinkles; he pivots and surveys his sports gear. He examines the barking manual, The Creature Book of Critters, and gives the chain a yank, prompting the manual to spring to the ceiling, with scrolls fluttering and binders clapping. Sigmund sprints after it, but the manual swivels and starts gnawing fiercely at his pants. He leaps onto the chair, watches the manual vanish beneath, and then seizes a blanket. Moments later, the manual scurries into sight, and Sigmund lunges, smothering the manual's growl beneath the blanket. A young warlock in steward's uniform rolls a trolley down the corridor as Sigmund departs his chamber just as he raps on a portal. Upon opening the portal, he's met by a clamorous bellow and a gust of breeze, and something petite and swift zips by Sigmund's toes. He spots a bedraggled-looking mouse, Nibbles, trailed by a ghastly lavender ferret, Claws. As Sigmund descends the ladder, murmurs arise from below. Once he reaches the base, he discovers Leo tenderly hugging Nibbles, while Gina attempts to control a sputtering Claws. Detecting another entity in the chamber, both Leo and Gina pivot to confront him. In the adjacent snapshot, the sprawling Griffin clan poses before the Hanging Gardens, gesturing, with Leo in the center and Nibbles perched on his collar. Aunt Griffin places Sigmund's hand in hers and nods as Sigmund’s gaze shifts to the wanted portrait. Meanwhile, Uncle Griffin falters, unable to proceed, then falters again, and she gestures. At that moment, the vessel wobbles, lanterns dim, and the boat stirs, commencing to decelerate. Sigmund stands, glides open the panel, and gazes into the hallway. From Sigmund's perspective, all along the passage, faces peer out inquisitively. Then the boat bobs, the wagon tilts, and the bulbs strapped along the roof flicker and extinguish. A slender trail of mist escapes Leo's nose as he rises, a dark contour against the aperture, clearing a section of mist from it. Abruptly, the wagon tilts fiercely, and from the stick in the grasp of M.J. Lupin radiates a quivering glow; his visage appears exhausted and ashen, but his eyes are vigilant and cautious. Gina's concerned expression hovers above Sigmund as he reclines, and Leo, pale and jittery, stretches his limb to offer Sigmund his binoculars. As Sigmund departs, he turns to Leo and Gina, but she wags her finger. Sigmund then glances to the hatch, and the image in it sharpens."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Harry warily eyes Tom and Fudge while noticing a stack of books, one bound by a rope, as London rooftops are visible outside. A train passes, and Harry stands with Hedwig, focusing on The Monster Book of Monsters. He tugs the rope, causing the book to fall and snap its covers, then chases it as it nips at his shoes. Harry jumps onto the bed, eventually muffling the book with a pillow. A maid’s knock is followed by a roar and a fast-moving rat, Scabbers, pursued by a cat, Crookshanks. Harry descends the stairs to find Ron holding Scabbers and Hermione trying to calm Crookshanks. They turn to face Harry. The Weasley family photo shows them at the Great Pyramids, with Ron and Scabbers. Mrs. Weasley greets Harry kindly, while Mr. Weasley hesitates near a fugitive poster. The train compartment rattles, lights flicker, and the train slows as Harry peers out. Heads look out curiously as the train jerks violently. R.J. Lupin’s wand emits light, his face tired yet alert. Hermione's worried face is above Harry as Ron nervously hands back his glasses. Harry looks at Ron and Hermione, and, seeing Hermione shake her head, he turns to the window, focusing on his reflection."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Harry then looks to the window and the reflection in it comes into focus As Harry leaves he turns to Ron and Hermione but she shakes her head Hermione's troubled face hovers above Harry as he sits up and Ron pale and nervous extends his hand to give Harry his glasses his face looks tired and gray but his eyes are alert and wary Suddenly the car sways violently and from the stick in the hands of RJ Lupin emanates a shivering light A thin wisp of steam escapes Ron's mouth as he stands a dark silhouette against the window wiping a patch of condensation from it the car sways and the lamps running along the ceiling flicker and die Then the train jerks From Harry's point of view all along the carriage heads look out curiously Harry rises slides open the door and peers into the corridor Just then the compartment rattles lanterns flicker and the train lurches beginning to slow Meanwhile Mr Weasley hesitates unable to continue then hesitates again and she points Mrs Weasley takes Harry's face in her hands and smiles as Harry's eyes drift to the fugitive poster In the accompanying photo the entire Weasley family stands before the Great Pyramids waving with Ron in the middle and Scabbers perched on his shoulder Sensing another presence in the room both Ron and Hermione turn to face him Once he reaches the bottom he finds Ron Weasley protectively cradling Scabbers while Hermione Granger tries to restrain a hissing Crookshanks As Harry moves down the stairs voices emerge from below He sees a raggedlooking rat Scabbers pursued by an ugly orange cat Crookshanks Upon opening the door she is greeted by a thunderous roar and a rush of wind and something small and fast dashes by Harry's feet A young witch in maid's robes pushes a cart down the hall as Harry exits his room just as she knocks on a door Seconds later the book scuttles into view and Harry pounces muffling the book's roar beneath the pillow He vaults atop the bed watches the book disappear underneath and then grabs a pillow Harry gives chase but the book turns and begins nipping viciously at his shoes He studies the growling tome The Monster Book of Monsters and gives the rope a tug causing the book to leap to the floor with pages flying and book covers snapping he turns and eyes his schoolbooks As a train passes the camera pulls back to reveal Harry standing with Hedwig Harry eyes the stack of books noticing that one is bound by a rope and through the window the rooftops of London are visible Harry glances warily from the steaming tureen of green to Tom who works a grimy thumb into his gum and frees a walnut sliver while Fudge turns and smiles nervously"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Harry eyes the stack of books noticing that one is bound by a rope and through the window the rooftops of London are visible Harry glances warily from the steaming tureen of green to Tom who works a grimy thumb into his gum and frees a walnut sliver while Fudge turns and smiles nervously he turns and eyes his schoolbooks As a train passes the camera pulls back to reveal Harry standing with Hedwig Harry gives chase but the book turns and begins nipping viciously at his shoes He studies the growling tome The Monster Book of Monsters and gives the rope a tug causing the book to leap to the floor with pages flying and book covers snapping Seconds later the book scuttles into view and Harry pounces muffling the book's roar beneath the pillow He vaults atop the bed watches the book disappear underneath and then grabs a pillow Upon opening the door she is greeted by a thunderous roar and a rush of wind and something small and fast dashes by Harry's feet A young witch in maid's robes pushes a cart down the hall as Harry exits his room just as she knocks on a door As Harry moves down the stairs voices emerge from below He sees a raggedlooking rat Scabbers pursued by an ugly orange cat Crookshanks Sensing another presence in the room both Ron and Hermione turn to face him Once he reaches the bottom he finds Ron Weasley protectively cradling Scabbers while Hermione Granger tries to restrain a hissing Crookshanks Mrs Weasley takes Harry's face in her hands and smiles as Harry's eyes drift to the fugitive poster In the accompanying photo the entire Weasley family stands before the Great Pyramids waving with Ron in the middle and Scabbers perched on his shoulder Just then the compartment rattles lanterns flicker and the train lurches beginning to slow Meanwhile Mr Weasley hesitates unable to continue then hesitates again and she points From Harry's point of view all along the carriage heads look out curiously Harry rises slides open the door and peers into the corridor the car sways and the lamps running along the ceiling flicker and die Then the train jerks Suddenly the car sways violently and from the stick in the hands of RJ Lupin emanates a shivering light A thin wisp of steam escapes Ron's mouth as he stands a dark silhouette against the window wiping a patch of condensation from it Hermione's troubled face hovers above Harry as he sits up and Ron pale and nervous extends his hand to give Harry his glasses his face looks tired and gray but his eyes are alert and wary Harry then looks to the window and the reflection in it comes into focus As Harry leaves he turns to Ron and Hermione but she shakes her head"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "In the accompanying photo the entire Weasley family stands before the Great Pyramids waving with Ron in the middle and Scabbers perched on his shoulder Mrs Weasley takes Harry's face in her hands and smiles as Harry's eyes drift to the fugitive poster Meanwhile Mr Weasley hesitates unable to continue then hesitates again and she points Just then the compartment rattles lanterns flicker and the train lurches beginning to slow Harry rises slides open the door and peers into the corridor From Harry's point of view all along the carriage heads look out curiously Then the train jerks the car sways and the lamps running along the ceiling flicker and die A thin wisp of steam escapes Ron's mouth as he stands a dark silhouette against the window wiping a patch of condensation from it Suddenly the car sways violently and from the stick in the hands of RJ Lupin emanates a shivering light his face looks tired and gray but his eyes are alert and wary Hermione's troubled face hovers above Harry as he sits up and Ron pale and nervous extends his hand to give Harry his glasses As Harry leaves he turns to Ron and Hermione but she shakes her head Harry then looks to the window and the reflection in it comes into focus Harry glances warily from the steaming tureen of green to Tom who works a grimy thumb into his gum and frees a walnut sliver while Fudge turns and smiles nervously Harry eyes the stack of books noticing that one is bound by a rope and through the window the rooftops of London are visible As a train passes the camera pulls back to reveal Harry standing with Hedwig he turns and eyes his schoolbooks He studies the growling tome The Monster Book of Monsters and gives the rope a tug causing the book to leap to the floor with pages flying and book covers snapping Harry gives chase but the book turns and begins nipping viciously at his shoes He vaults atop the bed watches the book disappear underneath and then grabs a pillow Seconds later the book scuttles into view and Harry pounces muffling the book's roar beneath the pillow A young witch in maid's robes pushes a cart down the hall as Harry exits his room just as she knocks on a door Upon opening the door she is greeted by a thunderous roar and a rush of wind and something small and fast dashes by Harry's feet He sees a raggedlooking rat Scabbers pursued by an ugly orange cat Crookshanks As Harry moves down the stairs voices emerge from below Once he reaches the bottom he finds Ron Weasley protectively cradling Scabbers while Hermione Granger tries to restrain a hissing Crookshanks Sensing another presence in the room both Ron and Hermione turn to face him"
        }
      ]
    }
  ]
}