{
  "ground_truth": "A glimmering puddle is omitted as a carriage wheel shatters the glassy surface, revealing a procession of horseless carriages carrying students toward the castle. The sweet sound of a choir rises as lightning flashes across the night sky, transitioning the scene to the Great Hall. The camera glides toward the windows, passing through the glass to reveal candlelit silhouettes. At the High Table sit Lupin, Severus Snape, Minerva McGonagall, Rubeus Hagrid, and Albus Dumbledore. The camera tracks along the choir, singing with a harpsichord, and lands on a quintet of toads, including Neville Longbottom's toad, Trevor. As the choir concludes, Dumbledore stands, beaming. Amid scattered applause, Harry, Ron, and Hermione clap, then applaud vigorously after exchanging stunned looks. Hagrid turns ruby red, rises, and nearly topples the staff table. At the Slytherin table, Draco Malfoy, flanked by Crabbe and Goyle, feigns a dead faint at Harry, who makes eye contact. Students exit the Great Hall and scale the Marble Staircase. Harry, Ron, and Hermione reach the seventh floor landing and approach the Fat Lady in the portrait. Ron spins and frowns at Hermione. Professor Trelawney takes the cup, peers inside, and grasps, causing everyone to turn and see Lavender bent over her textbook. Harry peers into his cup, watching the tea leaves shift. The trio emerges from the bridge and heads toward Hagrid's hut, where students have gathered. Draco, Crabbe, and Goyle stand with the Slytherins, and though there is no consensus, students stare in wary wonder as Hagrid coaxes a beast to the paddock's center. Ron stares uneasily as the class steps back, leaving Harry in front. Unsure, Harry nods, steps forward, and bows. Buckbeak studies Harry and ducks his beak, prompting a relieved sigh from Hagrid. Tentatively, Harry lays his hand on Buckbeak's beak, and the class claps as Harry smiles. Hagrid lifts Harry onto Buckbeak's back and slaps its hindquarters. Buckbeak's talons slash down, and Malfoy freezes, noticing blood on his robes and shrieks. Harry dashes forward, and Buckbeak, upon seeing Harry, lowers its talons and ducks its beak. Meanwhile, Harry, Ron, and Hermione watch from the Gryffindor table and turn to see Seamus and other Gryffindors huddled over a copy of The Daily Prophet.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A shimmering pool is excluded as a carriage wheel fractures the glossy veneer, unveiling a parade of motorized carriages conveying pupils toward the castle. The melodic tone of a choir ascends as lightning flickers across the night sky, transforming the scene to the Great Hall. The camera floats toward the windows, passing through the panes to expose candlelit outlines. At the High Table sit Lupin, Severus Snape, Minerva McGonagall, Rubeus Hagrid, and Albus Dumbledore. The camera follows along the choir, singing with a harpsichord, and settles on a group of toads, including Neville Longbottom's toad, Trevor. As the choir finishes, Dumbledore rises, smiling. Amid scattered applause, Harry, Ron, and Hermione clap, then applaud earnestly after trading astonished glances. Hagrid turns scarlet, stands, and nearly overturns the staff table. At the Slytherin table, Draco Malfoy, flanked by Crabbe and Goyle, pretends a dead swoon at Harry, who makes eye contact. Pupils depart the Great Hall and ascend the Marble Staircase. Harry, Ron, and Hermione reach the seventh floor landing and approach the Fat Lady in the portrait. Ron rotates and scowls at Hermione. Professor Trelawney takes the cup, peers within, and gasps, causing everyone to turn and see Lavender hunched over her textbook. Harry peers into his cup, observing the tea leaves shift. The trio emerges from the bridge and heads toward Hagrid's hut, where pupils have gathered. Draco, Crabbe, and Goyle stand with the Slytherins, and though there is no agreement, pupils gaze in cautious curiosity as Hagrid urges a creature to the paddock's center. Ron gazes anxiously as the class steps back, leaving Harry in front. Uncertain, Harry nods, steps forward, and bows. Buckbeak examines Harry and lowers his beak, prompting a relieved exhale from Hagrid. Hesitantly, Harry places his hand on Buckbeak's beak, and the class claps as Harry grins. Hagrid hoists Harry onto Buckbeak's back and slaps its hindquarters. Buckbeak's talons slash downward, and Malfoy freezes, noticing blood on his robes and screams. Harry rushes forward, and Buckbeak, upon seeing Harry, lowers its talons and bows its beak. Meanwhile, Harry, Ron, and Hermione observe from the Gryffindor table and turn to see Seamus and other Gryffindors clustered over a copy of The Daily Prophet."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A glimmering puddle is revealed as the glassy surface is shattered by a carriage wheel, omitting the puddle and presenting a procession of horseless carriages being carried toward the castle by students. A choir is rising with a sweet sound as the night sky is flashed with lightning, which transitions the scene to the Great Hall. The windows are glided toward by the camera, moving through the glass to show candlelit silhouettes. Lupin, Severus Snape, Minerva McGonagall, Rubeus Hagrid, and Albus Dumbledore sit at the High Table. Along the choir, singing with a harpsichord, the camera is tracked and lands on a quintet of toads, including Trevor, Neville Longbottom's toad. As the choir concludes, Dumbledore beams as he stands. Amid scattered applause, Harry, Ron, and Hermione are clapped by themselves, then vigorously applaud after their stunned looks are exchanged. Hagrid turns ruby red, rises, and the staff table is nearly toppled by him. At the Slytherin table, a dead faint is feigned by Draco Malfoy, flanked by Crabbe and Goyle, at Harry, who makes eye contact. The Great Hall is exited by students, and the Marble Staircase is scaled. The seventh floor landing is reached by Harry, Ron, and Hermione, and the Fat Lady in the portrait is approached. Ron is spun and Hermione is frowned at by him. The cup is taken by Professor Trelawney, who peers inside, and she grasps, causing Lavender to be bent over her textbook, seen by everyone turning. Harry's cup is peered into by him, watching the tea leaves shift. The bridge is emerged from by the trio, and Hagrid's hut is headed toward by them, where students have gathered. Draco, Crabbe, and Goyle stand with the Slytherins, and though consensus is not reached, wary wonder is stared in by students as Hagrid coaxes a beast to the paddock's center. Ron is stared at uneasily by himself as the class steps back, leaving Harry in front. Unsure, a nod is given by Harry, who steps forward and bows. Buckbeak studies Harry and ducks his beak, and a relieved sigh is prompted by it from Hagrid. Tentatively, Buckbeak's beak is laid on by Harry's hand, and the class claps as Harry smiles. Hagrid lifts Harry onto Buckbeak's back and its hindquarters are slapped by him. Buckbeak's talons slash down, and Malfoy freezes, notices blood on his robes, and shrieks. Harry dashes forward, and Buckbeak lowers its talons and ducks its beak upon seeing Harry. Meanwhile, the Gryffindor table is watched from by Harry, Ron, and Hermione, and Seamus and other Gryffindors are turned to by them, who huddle over a copy of The Daily Prophet."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A carriage wheel shatters a glimmering puddle as horseless carriages transport students to the castle. The choir's sweet sound rises with lightning in the night sky, transitioning to the Great Hall. The camera passes through windows, revealing candlelit silhouettes. At the High Table sit Lupin, Snape, McGonagall, Hagrid, and Dumbledore. Tracking along the choir, the camera focuses on a toad quintet, including Trevor. As they finish, Dumbledore stands, smiling. Amid applause, Harry, Ron, and Hermione exchange stunned looks and applaud vigorously. Hagrid turns red, rises, and almost topples the staff table. At the Slytherin table, Draco, with Crabbe and Goyle, feigns fainting at Harry. Students exit the Great Hall, climbing the Marble Staircase. Harry, Ron, and Hermione approach the Fat Lady's portrait. Ron frowns at Hermione. Professor Trelawney examines a cup as everyone turns to Lavender over her textbook. Harry peers into his cup, observing shifting tea leaves. The trio heads to Hagrid's hut, where students gather. Draco, Crabbe, and Goyle join the Slytherins. Students watch as Hagrid introduces a beast. Ron is uneasy as the class steps back, leaving Harry alone. Unsure, Harry nods, steps forward, and bows. Buckbeak studies Harry, ducks his beak, prompting a relieved sigh from Hagrid. Harry tentatively touches Buckbeak’s beak, the class claps as Harry smiles. Hagrid lifts Harry onto Buckbeak, slaps its hindquarters. Buckbeak’s talons slash, Malfoy notices blood on his robes and shrieks. Harry dashes forward, and Buckbeak lowers its talons. Meanwhile, Harry, Ron, and Hermione at the Gryffindor table watch Seamus and others huddled over The Daily Prophet."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A carriage wheel disrupts a glimmering puddle, revealing horseless carriages taking students to the castle. Choir music fills the air as lightning flashes, shifting the scene to the Great Hall. The camera glides through candlelit windows to find Lupin, Snape, McGonagall, Hagrid, and Dumbledore at the High Table. Passing the choir, it focuses on Neville's toad, Trevor. Dumbledore stands, smiling, as scattered applause turns vigorous from Harry, Ron, and Hermione. Hagrid blushes, almost toppling the staff table. Draco, flanked by Crabbe and Goyle, mocks Harry, who meets his gaze. Students exit to the Marble Staircase. Harry, Ron, and Hermione reach the seventh floor, approaching the Fat Lady. Ron frowns at Hermione. Trelawney examines a cup, drawing attention to Lavender, while Harry watches tea leaves in his cup. Outside Hagrid's hut, students gather as he leads a beast. Uneasy, Ron observes as Harry steps forward, nods, and bows to Buckbeak, who responds, prompting applause. Hagrid hoists Harry onto Buckbeak, who slashes its talons, startling Malfoy. Harry soothes Buckbeak, and the class claps. Later, Harry, Ron, and Hermione at the Gryffindor table notice Seamus and others with The Daily Prophet."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A glimmering puddle on the ground is suddenly omitted from view as a carriage wheel shatters the glassy surface, revealing a procession of wondrous, horseless carriages effortlessly transporting students toward the majestic castle. The sweet, harmonious sound of a choir begins to rise, filling the air as lightning dramatically flashes across the dark night sky, smoothly transitioning the scene to the vast, enchanting Great Hall. The camera gracefully glides toward the tall, elegant windows, gently passing through the glass barrier to unveil candlelit silhouettes dancing in the soft glow. At the prestigious High Table are seated Lupin, the stern Severus Snape, the astute Minerva McGonagall, the gentle giant Rubeus Hagrid, and the wise headmaster, Albus Dumbledore. The camera moves attentively along the choir, who are joyfully singing in unison with a harpsichord, eventually focusing on a charming quintet of toads, which includes Neville Longbottom's beloved toad, Trevor. As the choir joyously concludes their melodic performance, Dumbledore stands up, beaming with delight. Amid scattered applause, Harry, Ron, and Hermione initially clap politely, then quickly transition to vigorous applause after exchanging stunned and amazed looks. Hagrid turns a shade of ruby red, stands up, and almost topples the staff table with his enthusiastic movements. Over at the Slytherin table, Draco Malfoy, flanked by his loyal companions Crabbe and Goyle, feigns a dramatic dead faint while making eye contact with Harry. Students begin to leave the magnificent Great Hall and proceed to scale the grand Marble Staircase. Harry, Ron, and Hermione eventually reach the seventh-floor landing and find themselves approaching the portrait of the Fat Lady. Ron spins around, frowning in Hermione's direction. Meanwhile, Professor Trelawney takes a cup, peers deeply inside, and gasps, causing everyone to turn and see Lavender bent over her textbook. Harry peers closely into his own cup, watching the intriguing tea leaves shift mysteriously. The trio emerges from the bridge and heads purposefully toward Hagrid's rustic hut, where a group of curious students has gathered. Draco, Crabbe, and Goyle stand among the Slytherins, and even though there is no consensus among them, students stare with wary wonder as Hagrid gently coaxes a mysterious beast to the center of the paddock. Ron stares uneasily as the class takes a step back, leaving Harry standing bravely at the front. Feeling unsure but determined, Harry nods, steps forward slowly, and bows. Buckbeak studies Harry keenly before ducking his beak, prompting a relieved sigh to escape from Hagrid. Tentatively, Harry places his hand on Buckbeak's beak, and the class breaks into applause as Harry smiles warmly. Hagrid then lifts Harry onto Buckbeak's back and gives its hindquarters a gentle slap. Buckbeak's talons slash down, and Malfoy freezes in shock, noticing the blood on his robes and letting out a shriek. Harry dashes forward, and Buckbeak, upon seeing Harry, lowers its talons once more and ducks its beak. Meanwhile, Harry, Ron, and Hermione sit watching from the Gryffindor table and turn to see Seamus and other Gryffindors, who are huddled over an intriguing copy of The Daily Prophet."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A glimmering puddle that had formed on the ground is abruptly omitted from view as the wheel of a passing carriage shatters the glassy surface, revealing a procession of wondrous, horseless carriages that are effortlessly transporting students toward the majestic, awe-inspiring castle. The sweet, harmonious sound of a choir begins to rise melodiously, filling the air with enchanting tunes as lightning dramatically flashes across the dark night sky, smoothly transitioning the captivating scene to the vast, enchanting Great Hall. The camera gracefully glides toward the tall, elegant windows, gently passing through the glass barrier to unveil candlelit silhouettes that are elegantly dancing in the soft, flickering glow. Seated at the prestigious High Table are Lupin, the stern-faced Severus Snape, the astute Minerva McGonagall, the gentle giant Rubeus Hagrid, and the wise headmaster, Albus Dumbledore. The camera moves attentively along the choir, who are joyously singing in perfect unison with a melodious harpsichord, eventually focusing on a charming quintet of toads, which includes Neville Longbottom's beloved companion, the toad Trevor. As the choir joyously concludes their melodic performance, Dumbledore stands up, beaming with delight and satisfaction. Amid scattered applause, Harry, Ron, and Hermione initially clap politely, then quickly transition to vigorous applause after exchanging looks filled with surprise and amazement. Hagrid turns a shade of ruby red, stands up with enthusiasm, and almost topples the staff table with his exuberant movements. Over at the Slytherin table, Draco Malfoy, flanked by his loyal companions Crabbe and Goyle, feigns a dramatic dead faint while making eye contact with Harry. Students begin to leave the magnificent Great Hall and proceed to scale the grand Marble Staircase. Harry, Ron, and Hermione eventually reach the seventh-floor landing and find themselves approaching the portrait of the Fat Lady. Ron spins around, frowning deeply in Hermione's direction. Meanwhile, Professor Trelawney takes a cup, peers deeply inside with intensity, and gasps dramatically, causing everyone to turn and see Lavender bent over her textbook. Harry peers closely into his own cup, watching the intriguing tea leaves shift and move mysteriously. The trio emerges from the bridge and heads purposefully toward Hagrid's rustic, inviting hut, where a group of curious students has already gathered. Draco, Crabbe, and Goyle stand among the Slytherins, and even though there is no consensus among them, students stare with wary wonder as Hagrid gently coaxes a mysterious beast to the center of the paddock. Ron stares uneasily as the class takes a step back, leaving Harry standing bravely at the front. Feeling unsure but determined, Harry nods, taking a deep breath as he steps forward slowly and bows respectfully. Buckbeak studies Harry keenly before eventually ducking his beak, prompting a relieved sigh to escape from Hagrid. Tentatively, Harry places his hand on Buckbeak's beak, and the class breaks into applause as Harry smiles warmly. Hagrid then carefully lifts Harry onto Buckbeak's back and gives its hindquarters a gentle slap. Buckbeak's talons slash down, and Malfoy freezes in shock, his eyes widening as he notices the blood on his robes and lets out a shriek. Harry dashes forward, and Buckbeak, upon seeing Harry, lowers its talons once more and ducks its beak graciously. Meanwhile, Harry, Ron, and Hermione sit watching from the Gryffindor table and turn to see Seamus and other Gryffindors, who are huddled over an intriguing copy of The Daily Prophet."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A glimmering puddle rests undisturbed on the ground until, suddenly, a carriage wheel comes into contact with it, shattering the glassy surface and sending tiny droplets scattering in all directions. As this event unfolds, a procession of horseless carriages emerges, each one carrying students who are journeying toward the castle. The sweet, harmonious sound of a choir begins to fill the air as lightning flashes dramatically across the dark, night sky, creating a seamless transition to the next scene, which is set in the Great Hall. The camera moves gracefully and purposefully toward the large windows, where it cleverly passes through the transparent glass to reveal dimly lit silhouettes, illuminated by the soft, flickering light of candles. Seated at the prominent High Table are familiar faces: Lupin, Severus Snape, Minerva McGonagall, Rubeus Hagrid, and Albus Dumbledore, each one appearing composed and attentive. As the camera continues its tracking motion, it follows the choir as they sing in harmony with the melodic notes of a harpsichord, eventually focusing on a curious quintet of toads, among them Neville Longbottom's toad, Trevor. With the conclusion of the choir's performance, Dumbledore stands up, his face radiant and joyful. Amid the scattered applause that follows, Harry, Ron, and Hermione join in the clapping with a sense of decorum, only to switch to vigorous applause after exchanging surprised and delighted looks with one another. Hagrid's face turns a deep shade of red from embarrassment or excitement as he stands, almost causing the entire staff table to teeter precariously. At the Slytherin table, Draco Malfoy decides to mock Harry by feigning a dramatic faint, collapsing theatrically while flanked by Crabbe and Goyle, but not before making direct eye contact with Harry. As the formalities come to a close, students begin to leave the Great Hall and climb up the Marble Staircase with a sense of purpose. Harry, Ron, and Hermione eventually find themselves reaching the seventh-floor landing, where they approach the portrait of the Fat Lady. Ron then abruptly turns toward Hermione with a spin, a frown forming on his face, signaling something amiss. Meanwhile, Professor Trelawney, with a solemn expression, takes a cup in her hand, peers into it intently, and gasps audibly, drawing the attention of everyone in the vicinity toward Lavender, who is bent over her textbook, engrossed in her studies. Harry himself curiously looks into his cup, observing closely as the tea leaves mysteriously shift and swirl before his eyes. The trio later emerges from the bridge and makes their way toward Hagrid's hut, already surrounded by a gathering of students. Draco, along with Crabbe and Goyle, stands with the Slytherins, observing the scene unfold. Despite the lack of a consensus, a shared sense of wary wonder causes the students to fix their eyes on Hagrid as he gently coaxes a large and imposing beast to the center of the paddock. Ron watches with growing unease, his eyes darting as the class collectively steps back, leaving Harry at the forefront. Inexperienced but determined, Harry nods in a gesture of respect, steps forward bravely, and bows before the creature. Buckbeak, the creature in question, scrutinizes Harry before bowing its head in return, an action that prompts a collective sigh of relief from Hagrid. With great care and a hint of trepidation, Harry extends his hand and rests it gently on Buckbeak's beak. A ripple of applause spreads through the class as Harry beams with pride. Encouraged by this success, Hagrid lifts Harry onto Buckbeak's back, giving the creature a slap on the hindquarters as a signal to start moving. Buckbeak’s talons sharply hit the ground, unintentionally causing Malfoy to freeze in place upon noticing a red stain on his robes, leading him to shriek in surprise or horror. In the ensuing commotion, Harry quickly moves forward, and upon sensing Harry's presence, Buckbeak lowers its talons and bows its head again. Meanwhile, back within the walls of the castle, Harry, Ron, and Hermione sit at the Gryffindor table, their attention caught by Seamus and other Gryffindors, who are huddled together and deeply engrossed in reading a copy of The Daily Prophet."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A carriage wheel disrupts a glimmering puddle, revealing a line of horseless carriages transporting students to the castle. As lightning flashes in the sky, the sweet sound of a choir fills the Great Hall. The camera moves through candlelit windows to reveal the High Table, where Lupin, Severus Snape, Minerva McGonagall, Rubeus Hagrid, and Albus Dumbledore are seated. It then focuses on a toad quintet, including Trevor, as the choir sings with a harpsichord. Dumbledore stands and beams as the choir concludes. Amid applause, Harry, Ron, and Hermione exchange stunned looks and applaud vigorously. Hagrid, blushing, rises and nearly topples the staff table. At the Slytherin table, Draco Malfoy feigns a faint at Harry. Students leave the Great Hall and ascend the Marble Staircase. Upon reaching the seventh floor, Harry, Ron, and Hermione approach the Fat Lady's portrait, with Ron frowning at Hermione. In class, Professor Trelawney peers into a cup, drawing attention to Lavender over her textbook, while Harry observes his shifting tea leaves. The trio travels to Hagrid's hut, where students, including Draco, Crabbe, and Goyle, gather around Hagrid as he introduces a beast to the paddock. Uneasily, Ron watches as the class steps back and Harry advances, bows, and gains Buckbeak's acceptance, relieving Hagrid. As Harry places his hand on Buckbeak's beak, the class applauds. Hagrid helps Harry mount Buckbeak, who then startles Draco with his talons, causing Draco to shriek upon seeing blood. Harry rushes forward, and Buckbeak lowers its talons upon recognizing him. Later, Harry, Ron, and Hermione, sitting at the Gryffindor table, turn to see Seamus and other Gryffindors engrossed in a copy of The Daily Prophet."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A glimmering puddle, glistening under the moonlight, is omitted as a carriage wheel shatters the glassy surface, revealing a procession of horseless carriages, known as Thestral-drawn carriages though invisible to many, carrying students toward the castle. The sweet sound of a choir rises, their voices echoing off the ancient stone walls, as lightning flashes across the night sky, transitioning the scene to the Great Hall, an iconic room famed for its enchanted ceiling. The camera glides toward the windows, passing through the ancient glass to reveal candlelit silhouettes dancing in the dim light. At the High Table, a revered place for the school's leadership, sit Lupin, Severus Snape, a master of potions with a complex past, Minerva McGonagall, known for her stern yet fair demeanor as deputy headmistress, Rubeus Hagrid, the gentle giant and Keeper of Keys and Grounds, and Albus Dumbledore, the revered headmaster known for his wisdom. The camera tracks along the choir, their harmonies accompanied by the gentle plucking of a harpsichord, and lands on a quintet of toads, including Neville Longbottom's toad, Trevor, who often causes him trouble by wandering off. As the choir concludes, Dumbledore stands, beaming with pride over his students' performance. Amid scattered applause, Harry, Ron, and Hermione, the trio famous for their adventurous spirit, clap, then applaud vigorously after exchanging stunned looks at Hagrid's emotional display. Hagrid turns ruby red, his beard bristling with embarrassment, rises, and nearly topples the staff table with his size. At the Slytherin table, Draco Malfoy, known for his rivalry with Harry and flanked by his loyal companions Crabbe and Goyle, feigns a dead faint at Harry, who makes eye contact, sparking their ongoing tension. Students exit the Great Hall and scale the majestic Marble Staircase, the heart of Hogwarts' labyrinthine corridors. Harry, Ron, and Hermione reach the seventh floor landing and approach the Fat Lady in the portrait, the keeper of Gryffindor Tower's entrance. Ron spins and frowns at Hermione, perhaps over one of their frequent debates. Professor Trelawney, the eccentric Divination teacher, takes the cup, peers inside with dramatic flair, and grasps, causing everyone to turn and see Lavender, a devoted student of Divination, bent over her textbook. Harry peers into his cup, watching the tea leaves shift as he recalls Trelawney's cryptic predictions. The trio emerges from the bridge and heads toward Hagrid's hut, a rustic haven for magical creatures, where students have gathered. Draco, Crabbe, and Goyle stand with the Slytherins, and though there is no consensus, students stare in wary wonder as Hagrid coaxes a beast, Buckbeak the Hippogriff, to the paddock's center. Ron stares uneasily, recalling their past encounters with Hagrid's creatures, as the class steps back, leaving Harry in front. Unsure, Harry nods, steps forward, and bows, remembering Hagrid's instructions about respect. Buckbeak studies Harry with intelligent eyes and ducks his beak, prompting a relieved sigh from Hagrid, knowing the ritual was successful. Tentatively, Harry lays his hand on Buckbeak's beak, and the class claps as Harry smiles, feeling the creature's warm breath. Hagrid lifts Harry onto Buckbeak's back and slaps its hindquarters, sending a jolt of anticipation through the crowd. Buckbeak's talons slash down, and Malfoy freezes, noticing blood on his robes from a superficial scratch, and shrieks in melodramatic fashion. Harry dashes forward, prepared to assist, and Buckbeak, upon seeing Harry's familiar presence, lowers its talons and ducks its beak. Meanwhile, Harry, Ron, and Hermione watch from the Gryffindor table, immersed in the bustling atmosphere, and turn to see Seamus and other Gryffindors huddled over a copy of The Daily Prophet, the wizarding world's leading newspaper often filled with sensational stories."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Harry peers into his cup watching the tea leaves shift Harry Ron and Hermione clap then applaud vigorously after exchanging stunned looks A glimmering puddle is omitted as a carriage wheel shatters the glassy surface revealing a procession of horseless carriages carrying students toward the castle The sweet sound of a choir rises as lightning flashes across the night sky transitioning the scene to the Great Hall The camera glides toward the windows passing through the glass to reveal candlelit silhouettes At the High Table sit Lupin Severus Snape Minerva McGonagall Rubeus Hagrid and Albus Dumbledore The camera tracks along the choir singing with a harpsichord and lands on a quintet of toads including Neville Longbottom's toad Trevor As the choir concludes Dumbledore stands beaming Tentatively Harry lays his hand on Buckbeak's beak and the class claps as Harry smiles At the High Table sit Lupin Severus Snape Minerva McGonagall Rubeus Hagrid and Albus Dumbledore The sweet sound of a choir rises as lightning flashes across the night sky transitioning the scene to the Great Hall Amid scattered applause Harry Ron and Hermione clap then applaud vigorously after exchanging stunned looks Hagrid turns ruby red rises and nearly topples the staff table The camera tracks along the choir singing with a harpsichord and lands on a quintet of toads including Neville Longbottom's toad Trevor At the Slytherin table Draco Malfoy flanked by Crabbe and Goyle feigns a dead faint at Harry who makes eye contact The camera glides toward the windows passing through the glass to reveal candlelit silhouettes Students exit the Great Hall and scale the Marble Staircase Harry Ron and Hermione reach the seventh floor landing and approach the Fat Lady in the portrait Buckbeak's talons slash down and Malfoy freezes noticing blood on his robes and shrieks Ron spins and frowns at Hermione Professor Trelawney takes the cup peers inside and grasps causing everyone to turn and see Lavender bent over her textbook Meanwhile Harry Ron and Hermione watch from the Gryffindor table and turn to see Seamus and other Gryffindors huddled over a copy of The Daily Prophet A glimmering puddle is omitted as a carriage wheel shatters the glassy surface revealing a procession of horseless carriages carrying students toward the castle Harry peers into his cup watching the tea leaves shift The trio emerges from the bridge and heads toward Hagrid's hut where students have gathered Hagrid turns ruby red rises and nearly topples the staff table Draco Crabbe and Goyle stand with the Slytherins and though there is no consensus students stare in wary wonder as Hagrid coaxes a beast to the paddock's center Ron stares uneasily as the class steps back leaving Harry in front Unsure Harry nods steps forward and bows Harry dashes forward and Buckbeak upon seeing Harry lowers its talons and ducks its beak Professor Trelawney takes the cup peers inside and grasps causing everyone to turn and see Lavender bent over her textbook Buckbeak studies Harry and ducks his beak prompting a relieved sigh from Hagrid Tentatively Harry lays his hand on Buckbeak's beak and the class claps as Harry smiles Hagrid lifts Harry onto Buckbeak's back and slaps its hindquarters Buckbeak's talons slash down and Malfoy freezes noticing blood on his robes and shrieks Harry dashes forward and Buckbeak upon seeing Harry lowers its talons and ducks its beak Meanwhile Harry Ron and Hermione watch from the Gryffindor table and turn to see Seamus and other Gryffindors huddled over a copy of The Daily Prophet"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "A glimmering puddle is omitted as a carriage wheel shatters the glassy surface revealing a procession of horseless carriages carrying students toward the castle. The sweet sound of a choir rises as lightning flashes across the night sky transitioning the scene to the Great Hall. The camera glides toward the windows passing through the glass to reveal candlelit silhouettes. At the High Table sit Lupin Severus Snape Minerva McGonagall Rubeus Hagrid and Albus Dumbledore. The camera tracks along the choir singing with a harpsichord and lands on a quintet of toads including Neville Longbottom's toad Trevor. As the choir concludes Dumbledore stands beaming. Amid scattered applause. Harry Ron and Hermione clap then applaud vigorously after exchanging stunned looks. Hagrid turns ruby red rises and nearly topples the staff table. At the Slytherin table Draco Malfoy flanked by Crabbe and Goyle feigns a dead faint at Harry who makes eye contact. Students exit the Great Hall and scale the Marble Staircase. Harry Ron and Hermione reach the seventh floor landing and approach the Fat Lady in the portrait. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Ron spins and frowns at Hermione. Professor Trelawney takes the cup peers inside and grasps causing everyone to turn and see Lavender bent over her textbook. Harry peers into his cup watching the tea leaves shift. The trio emerges from the bridge and heads toward Hagrid's hut where students have gathered. Draco Crabbe and Goyle stand with the Slytherins and though there is no consensus students stare in wary wonder as Hagrid coaxes a beast to the paddock's center. Ron stares uneasily as the class steps back leaving Harry in front. Unsure Harry nods steps forward and bows. Buckbeak studies Harry and ducks his beak prompting a relieved sigh from Hagrid. Tentatively Harry lays his hand on Buckbeak's beak and the class claps as Harry smiles. Hagrid lifts Harry onto Buckbeak's back and slaps its hindquarters. Buckbeak's talons slash down and Malfoy freezes noticing blood on his robes and shrieks. Harry dashes forward and Buckbeak upon seeing Harry lowers its talons and ducks its beak. Meanwhile Harry Ron and Hermione watch from the Gryffindor table and turn to see Seamus and other Gryffindors huddled over a copy of The Daily Prophet."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "A glimmering puddle is omitted as a carriage wheel shatters the glassy surface revealing a procession of horseless carriages carrying students toward the castle. The sweet sound of a choir rises as lightning flashes across the night sky transitioning the scene to the Great Hall. The camera glides toward the windows passing through the glass to reveal candlelit silhouettes. At the High Table sit Lupin Severus Snape Minerva McGonagall Rubeus Hagrid and Albus Dumbledore. The camera tracks along the choir singing with a harpsichord and lands on a quintet of toads including Neville Longbottom's toad Trevor. As the choir concludes Dumbledore stands beaming. Amid scattered applause. Harry Ron and Hermione clap then applaud vigorously after exchanging stunned looks. Hagrid turns ruby red rises and nearly topples the staff table. At the Slytherin table Draco Malfoy flanked by Crabbe and Goyle feigns a dead faint at Harry who makes eye contact. Students exit the Great Hall and scale the Marble Staircase. Harry Ron and Hermione reach the seventh floor landing and approach the Fat Lady in the portrait. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Ron spins and frowns at Hermione. Professor Trelawney takes the cup peers inside and grasps causing everyone to turn and see Lavender bent over her textbook. Harry peers into his cup watching the tea leaves shift. The trio emerges from the bridge and heads toward Hagrid's hut where students have gathered. Draco Crabbe and Goyle stand with the Slytherins and though there is no consensus students stare in wary wonder as Hagrid coaxes a beast to the paddock's center. Ron stares uneasily as the class steps back leaving Harry in front. Unsure Harry nods steps forward and bows. Buckbeak studies Harry and ducks his beak prompting a relieved sigh from Hagrid. Tentatively Harry lays his hand on Buckbeak's beak and the class claps as Harry smiles. Hagrid lifts Harry onto Buckbeak's back and slaps its hindquarters. Buckbeak's talons slash down and Malfoy freezes noticing blood on his robes and shrieks. Harry dashes forward and Buckbeak upon seeing Harry lowers its talons and ducks its beak. Meanwhile Harry Ron and Hermione watch from the Gryffindor table and turn to see Seamus and other Gryffindors huddled over a copy of The Daily Prophet."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "A glimmering puddle is omitted as a carriage wheel shatters the glassy surface revealing a procession of horseless carriages carrying students toward the castle. The sweet sound of a choir rises as lightning flashes across the night sky transitioning the scene to the Great Hall. The camera glides toward the windows passing through the glass to reveal candlelit silhouettes. At the High Table sit Lupin Severus Snape Minerva McGonagall Rubeus Hagrid and Albus Dumbledore. The camera tracks along the choir singing with a harpsichord and lands on a quintet of toads including Neville Longbottom's toad Trevor. As the choir concludes Dumbledore stands beaming. Unsure Harry nods steps forward and bows. Buckbeak studies Harry and ducks his beak prompting a relieved sigh from Hagrid. Tentatively Harry lays his hand on Buckbeak's beak and the class claps as Harry smiles. Hagrid lifts Harry onto Buckbeak's back and slaps its hindquarters. Buckbeak's talons slash down and Malfoy freezes noticing blood on his robes and shrieks. Harry dashes forward and Buckbeak upon seeing Harry lowers its talons and ducks its beak. Meanwhile Harry Ron and Hermione watch from the Gryffindor table and turn to see Seamus and other Gryffindors huddled over a copy of The Daily Prophet."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "A glimmering puddle is omitted as a carriage wheel shatters the glassy surface revealing a procession of horseless carriages carrying students toward the castle. The sweet sound of a choir rises as lightning flashes across the night sky transitioning the scene to the Great Hall. Buckbeak's talons slash down and Malfoy freezes noticing blood on his robes and shrieks. Harry dashes forward and Buckbeak upon seeing Harry lowers its talons and ducks its beak. Meanwhile Harry Ron and Hermione watch from the Gryffindor table and turn to see Seamus and other Gryffindors huddled over a copy of The Daily Prophet."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A glimmering puddle is omitted as a dragonfly wheel shatters the glassy surface, revealing a procession of horseless carriages carrying hedgehogs toward the castle. The sweet sound of a choir rises as lightning flashes across the night sky, transitioning the scene to the Great Hall. The camera glides toward the windows, passing through the glass to reveal candlelit silhouettes. At the High Table sit the Loch Ness Monster, Sherlock Holmes, Gandalf, the Easter Bunny, and Yoda. The camera tracks along the choir, singing with a harpsichord, and lands on a quintet of penguins, including Cinderella's penguin, Trevor. As the choir concludes, Yoda stands, beaming. Amid scattered applause, Cinderella, Tarzan, and Belle clap, then applaud vigorously after exchanging stunned looks. The Easter Bunny turns ruby red, rises, and nearly topples the staff table. At the Slytherin table, Batman, flanked by Gargamel and Ursula, feigns a dead faint at Cinderella, who makes eye contact. Hedgehogs exit the Great Hall and scale the Marble Staircase. Cinderella, Tarzan, and Belle reach the seventh floor landing and approach the Fat Elf in the portrait. Tarzan spins and frowns at Belle. Snoopy takes the cup, peers inside, and gasps, causing everyone to turn and see Snow White bent over her textbook. Cinderella peers into her cup, watching the tea leaves shift. The trio emerges from the bridge and heads toward the Easter Bunny's hut, where hedgehogs have gathered. Batman, Gargamel, and Ursula stand with the Slytherins, and though there is no consensus, hedgehogs stare in wary wonder as the Easter Bunny coaxes a beast to the paddock's center. Tarzan stares uneasily as the class steps back, leaving Cinderella in front. Unsure, Cinderella nods, steps forward, and bows. Buckbeak studies Cinderella and ducks his beak, prompting a relieved sigh from the Easter Bunny. Tentatively, Cinderella lays her hand on Buckbeak's beak, and the class claps as Cinderella smiles. The Easter Bunny lifts Cinderella onto Buckbeak's back and slaps its hindquarters. Buckbeak's talons slash down, and Batman freezes, noticing blood on his robes and shrieks. Cinderella dashes forward, and Buckbeak, upon seeing Cinderella, lowers its talons and ducks its beak. Meanwhile, Cinderella, Tarzan, and Belle watch from the Gryffindor table and turn to see Popeye and other Gryffindors huddled over a copy of The Daily Prophet."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "A glistening sand dune is avoided as a racecar wheel slices through the sandy surface, revealing a procession of bicycles carrying athletes toward the stadium. The delicate sound of a band rises as fireworks burst across the evening sky, transitioning the scene to the Concert Hall. The camera glides toward the windows, passing through the curtains to reveal lantern-lit figures. At the Main Table sit Lupin, Severus Snape, Minerva McGonagall, Rubeus Hagrid, and Albus Dumbledore. The camera tracks along the choir, singing with a violin, and lands on a quintet of rabbits, including Neville Longbottom's rabbit, Thumper. As the choir concludes, Dumbledore stands, smiling broadly. Amid scattered applause, Harry, Ron, and Hermione clap, then applaud vigorously after exchanging shocked looks. Hagrid turns rosy, rises, and nearly knocks over the staff table. At the Slytherin table, Draco Malfoy, flanked by Crabbe and Goyle, feigns a dramatic swoon at Harry, who makes eye contact. Students exit the Concert Hall and climb the Granite Staircase. Harry, Ron, and Hermione reach the sixth-floor landing and approach the Sleepy Woman in the mural. Ron spins and frowns at Hermione. Professor Trelawney takes the goblet, peers inside, and gasps, causing everyone to turn and see Lavender hunched over her notebook. Harry peers into his goblet, watching the coffee grounds shift. The trio emerges from the archway and heads toward Hagrid's cabin, where students have assembled. Draco, Crabbe, and Goyle stand with the Slytherins, and though there is no consensus, students gaze in cautious curiosity as Hagrid coaxes a creature to the pen's center. Ron stares apprehensively as the class steps back, leaving Harry in front. Unsure, Harry nods, steps forward, and bows. Buckbeak studies Harry and bends his neck, prompting a relieved sigh from Hagrid. Tentatively, Harry lays his hand on Buckbeak's neck, and the class claps as Harry smiles. Hagrid lifts Harry onto Buckbeak's back and pats its flank. Buckbeak's claws dig in, and Malfoy freezes, noticing mud on his jacket and yelps. Harry dashes forward, and Buckbeak, upon seeing Harry, lowers its claws and bends its neck. Meanwhile, Harry, Ron, and Hermione watch from the Gryffindor table and turn to see Seamus and other Gryffindors huddled over a copy of The Evening Gazette."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "A glimmering puddle is ignored as a carriage wheel disturbs the glassy surface, uncovering a procession of horseless carriages carrying students toward the castle. The sweet sound of a choir echoes as lightning illuminates the night sky, changing the scene to the Great Hall. The camera drifts toward the windows, slipping through the glass to reveal candlelit silhouettes. At the High Table rest Lupin, Severus Snape, Minerva McGonagall, Rubeus Hagrid, and Albus Dumbledore. The camera moves along the choir, harmonizing with a harpsichord, and stops on a quintet of toads, including Neville Longbottom's toad, Trevor. As the choir finishes, Dumbledore rises, grinning. Amid scattered applause, Harry, Ron, and Hermione nod, then cheer enthusiastically after exchanging stunned looks. Hagrid turns ruby red, stands, and nearly overturns the staff table. At the Slytherin table, Draco Malfoy, flanked by Crabbe and Goyle, mimics a dramatic swoon at Harry, who exchanges glances. Students leave the Great Hall and ascend the Marble Staircase. Harry, Ron, and Hermione reach the seventh floor landing and face the Fat Lady in the portrait. Ron twirls and glares at Hermione. Professor Trelawney takes the cup, gazes inside, and tightens her grip, causing everyone to turn and notice Lavender poring over her textbook. Harry looks into his cup, observing the tea leaves rearrange. The trio leaves the bridge and strides toward Hagrid's hut, where students have gathered. Draco, Crabbe, and Goyle stand with the Slytherins, and though there is no agreement, students gaze in cautious curiosity as Hagrid invites a beast to the paddock's center. Ron gazes uneasily as the class edges back, leaving Harry in front. Hesitant, Harry nods, advances, and kneels. Buckbeak appraises Harry and lowers his beak, prompting a relieved sigh from Hagrid. Carefully, Harry strokes Buckbeak's beak, and the class cheers as Harry grins. Hagrid places Harry onto Buckbeak's back and taps its hindquarters. Buckbeak's talons glide down, and Malfoy stiffens, noticing mud on his robes and gasps. Harry rushes forward, and Buckbeak, upon seeing Harry, retracts its talons and lowers its beak. Meanwhile, Harry, Ron, and Hermione observe from the Gryffindor table and turn to see Seamus and other Gryffindors crowded over a copy of The Daily Prophet."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "A shimmering quilt is omitted as a chandelier chain shatters the porcelain surface, revealing a parade of wheelless sleighs carrying astronauts toward the lighthouse. The savory scent of a ballet rises as thunder echoes across the evening meadow, transitioning the scene to the Grand Ballroom. The camera glides toward the mirrors, passing through the reflection to reveal lantern-lit outlines. At the Royal Podium sit Flibbertigibbet, Sirius Black, Cornelius Fudge, Bellatrix Lestrange, and Horace Slughorn. The camera tracks along the orchestra, harmonizing with an accordion, and lands on a quartet of salamanders, including Luna Lovegood's salamander, Gregory. As the orchestra concludes, Slughorn rises, grinning. Amid scattered applause, Sandy, Robin, and Helga clap, then cheer exuberantly after exchanging startled glances. Lestrange turns golden green, rises, and nearly overturns the guest podium. At the Ravenclaw platform, Vincent Crabbe, flanked by Pansy and Blaise, pretends to swoon at Sandy, who makes eye contact. Astronauts exit the Grand Ballroom and ascend the Jade Escalator. Sandy, Robin, and Helga reach the eighth floor balcony and approach the Wide Gentleman in the mosaic. Robin rotates and sulks at Helga. Professor Sprout takes the flask, gazes inside, and gasps, causing everyone to turn and see Parvati leaning over her scroll. Sandy peers into his flask, watching the chocolate flecks whirl. The trio emerges from the tunnel and strolls toward Lestrange's lair, where astronauts have assembled. Vincent, Pansy, and Blaise stand with the Ravenclaws, and although there is no agreement, astronauts gaze in cautious curiosity as Lestrange encourages a creature to the pen's core. Robin stares apprehensively as the team shuffles back, leaving Sandy in front. Hesitant, Sandy nods, steps forward, and bows. Fang examines Sandy and dips his snout, prompting a relieved sigh from Lestrange. Cautiously, Sandy places his hand on Fang's snout, and the team cheers as Sandy beams. Lestrange hoists Sandy onto Fang's spine and pats its shoulders. Fang's claws slash down, and Blaise freezes, noticing ink on his tunic and screams. Sandy sprints forward, and Fang, upon seeing Sandy, lowers its claws and dips its snout. Meanwhile, Sandy, Robin, and Helga watch from the Hufflepuff podium and turn to see Cho and other Hufflepuffs clustered over a copy of The Daily Moondial."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "A shimmering fog is veiled as a train's whistle pierces the tranquil air, revealing a line of bicycles transporting tourists toward the lighthouse. The faint hum of a violin echoes as fireflies dance across the dusk horizon, transitioning the scene to the ballroom. The camera drifts toward the doors, passing through the wood to reveal shadowy figures. At the Head Table sit Gandalf, Bellatrix Lestrange, Arwen, Frodo Baggins, and Galadriel. The camera rolls along the orchestra, harmonizing with a cello, and lands on a quartet of squirrels, including Samwise Gamgee's squirrel, Nutkin. As the orchestra finishes, Galadriel rises, laughing. Amid scattered cheers, Bilbo, Sam, and Merry wave, then cheer enthusiastically after exchanging astonished glances. Frodo turns azure blue, leaps, and almost overturns the buffet table. At the Ravenclaw table, Luna Lovegood, flanked by Cedric and Cho, mocks a dramatic swoon at Bilbo, who acknowledges the attention. Tourists vacate the ballroom and ascend the Spiral Staircase. Bilbo, Sam, and Merry reach the sixth floor landing and face the Knight in the painting. Sam twirls and grins at Merry. Doctor Who seizes the saucer, examines it, and gasps, causing everyone to turn and see Rose huddled over her map. Bilbo gazes into his saucer, observing the loose tea jostle. The group departs from the tower and marches toward Frodo's chamber, where tourists have congregated. Luna, Cedric, and Cho stand with the Hufflepuffs, and though there is no agreement, tourists glare in tentative curiosity as Frodo ushers a creature to the paddock's edge. Sam stares nervously as the crowd shuffles back, leaving Bilbo in front. Hesitant, Bilbo gestures, steps forward, and kneels. Smaug scrutinizes Bilbo and lowers his snout, drawing a contented breath from Frodo. Carefully, Bilbo places his hand on Smaug's snout, and the audience applauds as Bilbo beams. Frodo hoists Bilbo onto Smaug's craggy back and pats its flank. Smaug's claws lash out, and Cho stiffens, spotting ink on her cloak and squeals. Bilbo races backward, and Smaug, upon seeing Bilbo, retracts its claws and dips its snout. Meanwhile, Bilbo, Sam, and Merry observe from the Hobbiton table and pivot to see Pippin and other Hobbits perched over an issue of The Quibbler."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "A shimmering cloud is ignored as a balloon string breaks the reflective surface, revealing a parade of riderless bicycles carrying artists toward the fortress. The vibrant sound of an orchestra rises as fireworks burst across the evening sky, transforming the scene to the Grand Hall. The camera drifts toward the doors, passing through the wood to reveal lantern-lit figures. At the Head Table sit Lupin, Severus Snape, Minerva McGonagall, Rubeus Hagrid, and Albus Dumbledore. The camera wheels along the orchestra, playing with a pipe organ, and focuses on a trio of frogs, including Neville Longbottom's frog, Trevor. As the orchestra finishes, Dumbledore rises, grinning. Amid scattered clapping, Harry, Ron, and Hermione cheer, then explode with enthusiasm after sharing surprised glances. Hagrid turns crimson, stands, and nearly upends the faculty table. At the Slytherin table, Draco Malfoy, flanked by Crabbe and Goyle, pretends to swoon at Harry, who locks eyes with him. Students leave the Grand Hall and climb the Spiral Staircase. Harry, Ron, and Hermione arrive at the ninth floor landing and approach the Wide Woman in the mural. Ron twirls and scowls at Hermione. Professor Trelawney holds the bowl, looks inside, and gasps, causing everyone to turn and see Lavender leaning over her scroll. Harry examines his bowl, observing the coffee grounds swirl. The trio steps off the bridge and heads toward Hagrid's barn, where students have gathered. Draco, Crabbe, and Goyle stand with the Slytherins, and though there is no agreement, students gaze in cautious curiosity as Hagrid encourages a creature to the pen's center. Ron watches nervously as the class steps aside, leaving Harry in front. Hesitantly, Harry shakes his head, steps back, and kneels. Buckbeak observes Harry and raises his crest, prompting a relieved cheer from Hagrid. Carefully, Harry places his hand on Buckbeak's crest, and the class cheers as Harry beams. Hagrid hoists Harry onto Buckbeak's back and pats its shoulder. Buckbeak's claws dig in, and Malfoy pauses, noticing mud on his boots and gasps. Harry rushes backward, and Buckbeak, upon noticing Harry, raises its claws and lifts its crest. Meanwhile, Harry, Ron, and Hermione observe from the Gryffindor table and turn to see Seamus and other Gryffindors clustered over a copy of The Weekly Wizard."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "A shimmering feather is ignored as a bicycle pedal smashes the frozen lake, uncovering a parade of riderless bikes transporting sailors toward the lighthouse. The sour note of a trumpet descends as thunder rumbles across the morning sea, altering the landscape to the Grand Courtyard. The lens soars toward the gates, slipping through the metal to reveal shadowy figures. At the Royal Bench sit Merlin, Gandalf the Grey, Galadriel, Treebeard, and Aslan the Great. The camera floats along the trumpeters, performing with a tambourine, and settles on a troupe of rabbits, including Frodo Baggins's rabbit, Pippin. As the trumpeters finish, Aslan rises, grinning. Amid scattered cheers, Peter, Susan, and Lucy cheer, then whoop loudly after sharing awed glances. Treebeard flushes emerald, stands, and nearly overturns the monarch table. At the Iron Throne, Tyrion Lannister, flanked by Bronn and Podrick, pretends a ghostly dance at Peter, who locks eyes. Adventurers depart the Grand Courtyard and ascend the Crystal Staircase. Peter, Susan, and Lucy arrive at the ninth tower terrace and confront the Sleepy Giant in the sculpture. Susan twirls and glares at Lucy. Professor Sprout grabs the scroll, peers underneath, and gasps, causing everyone to swivel and spot Pansy coiled over her scrollcase. Peter peers beneath his scroll, observing the ink spots dance. The trio pops out from the chapel and moves toward Treebeard’s grove, where acolytes have assembled. Tyrion, Bronn, and Podrick gather with the Lannisters, and though there is no agreement, acolytes gaze in cautious curiosity as Treebeard invites a dragon to the meadow's edge. Susan gazes worriedly as the gathering steps aside, leaving Peter at the front. Hesitant, Peter inclines, steps closer, and kneels. Smaug regards Peter and lowers his snout, eliciting a calming exhale from Treebeard. Carefully, Peter places his palm on Smaug's snout, and the gathering cheers as Peter beams. Treebeard hoists Peter onto Smaug's wing and taps its shoulder. Smaug's claws swipe upward, and Tyrion halts, noticing ink on his tunic and yelps. Peter sprints closer, and Smaug, upon spotting Peter, raises its claws and lowers its snout. Meanwhile, Peter, Susan, and Lucy observe from the Fellowship table and swivel to see Legolas and other elves hunched over a scroll of The Middle-earth Gazette."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A carriage wheel disrupts a shimmering puddle as horseless carriages carry students to the castle. A choir sings as lightning flashes, transitioning the scene to the Great Hall. The camera enters through windows to reveal the candlelit hall, capturing Lupin, Snape, McGonagall, Hagrid, and Dumbledore at the High Table. After the choir concludes, Harry, Ron, and Hermione exchange looks and applaud enthusiastically. At the Slytherin table, Malfoy pretends to faint at Harry while students exit to the Marble Staircase. On the seventh floor, Ron frowns at Hermione. Professor Trelawney examines a cup, drawing attention as everyone notices Lavender with her textbook. Harry inspects his cup's tea leaves. The trio heads to Hagrid's hut, where Draco and others watch warily as Hagrid introduces a beast. Harry steps forward, bows to Buckbeak, and earns the creature's acknowledgment, prompting Hagrid's relief. Harry touches Buckbeak and receives applause. Hagrid places Harry on Buckbeak, prompting Malfoy to react as Buckbeak lowers its talons. Harry, Ron, and Hermione later observe Seamus and other Gryffindors reading The Daily Prophet at the Gryffindor table."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Meanwhile Harry Ron and Hermione watch from the Gryffindor table and turn to see Seamus and other Gryffindors huddled over a copy of The Daily Prophet Harry dashes forward and Buckbeak upon seeing Harry lowers its talons and ducks its beak Buckbeak's talons slash down and Malfoy freezes noticing blood on his robes and shrieks Hagrid lifts Harry onto Buckbeak's back and slaps its hindquarters Tentatively Harry lays his hand on Buckbeak's beak and the class claps as Harry smiles Buckbeak studies Harry and ducks his beak prompting a relieved sigh from Hagrid Unsure Harry nods steps forward and bows Ron stares uneasily as the class steps back leaving Harry in front Draco Crabbe and Goyle stand with the Slytherins and though there is no consensus students stare in wary wonder as Hagrid coaxes a beast to the paddock's center The trio emerges from the bridge and heads toward Hagrid's hut where students have gathered Harry peers into his cup watching the tea leaves shift Professor Trelawney takes the cup peers inside and grasps causing everyone to turn and see Lavender bent over her textbook Ron spins and frowns at Hermione Harry Ron and Hermione reach the seventh floor landing and approach the Fat Lady in the portrait Students exit the Great Hall and scale the Marble Staircase At the Slytherin table Draco Malfoy flanked by Crabbe and Goyle feigns a dead faint at Harry who makes eye contact Hagrid turns ruby red rises and nearly topples the staff table Harry Ron and Hermione clap then applaud vigorously after exchanging stunned looks Amid scattered applause As the choir concludes Dumbledore stands beaming The camera tracks along the choir singing with a harpsichord and lands on a quintet of toads including Neville Longbottom's toad Trevor At the High Table sit Lupin Severus Snape Minerva McGonagall Rubeus Hagrid and Albus Dumbledore The camera glides toward the windows passing through the glass to reveal candlelit silhouettes The sweet sound of a choir rises as lightning flashes across the night sky transitioning the scene to the Great Hall A glimmering puddle is omitted as a carriage wheel shatters the glassy surface revealing a procession of horseless carriages carrying students toward the castle"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Draco Crabbe and Goyle stand with the Slytherins and though there is no consensus students stare in wary wonder as Hagrid coaxes a beast to the paddock's center Ron spins and frowns at Hermione At the Slytherin table Draco Malfoy flanked by Crabbe and Goyle feigns a dead faint at Harry who makes eye contact Buckbeak studies Harry and ducks his beak prompting a relieved sigh from Hagrid Unsure Harry nods steps forward and bows Amid scattered applause As the choir concludes Dumbledore stands beaming Students exit the Great Hall and scale the Marble Staircase The trio emerges from the bridge and heads toward Hagrid's hut where students have gathered Hagrid lifts Harry onto Buckbeak's back and slaps its hindquarters Harry Ron and Hermione reach the seventh floor landing and approach the Fat Lady in the portrait Ron stares uneasily as the class steps back leaving Harry in front The sweet sound of a choir rises as lightning flashes across the night sky transitioning the scene to the Great Hall Harry peers into his cup watching the tea leaves shift Buckbeak's talons slash down and Malfoy freezes noticing blood on his robes and shrieks Professor Trelawney takes the cup peers inside and grasps causing everyone to turn and see Lavender bent over her textbook The camera glides toward the windows passing through the glass to reveal candlelit silhouettes Harry dashes forward and Buckbeak upon seeing Harry lowers its talons and ducks its beak The camera tracks along the choir singing with a harpsichord and lands on a quintet of toads including Neville Longbottom's toad Trevor Meanwhile Harry Ron and Hermione watch from the Gryffindor table and turn to see Seamus and other Gryffindors huddled over a copy of The Daily Prophet Harry Ron and Hermione clap then applaud vigorously after exchanging stunned looks Hagrid turns ruby red rises and nearly topples the staff table A glimmering puddle is omitted as a carriage wheel shatters the glassy surface revealing a procession of horseless carriages carrying students toward the castle At the High Table sit Lupin Severus Snape Minerva McGonagall Rubeus Hagrid and Albus Dumbledore Tentatively Harry lays his hand on Buckbeak's beak and the class claps as Harry smiles"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Professor Trelawney takes the cup peers inside and grasps causing everyone to turn and see Lavender bent over her textbook Harry peers into his cup watching the tea leaves shift The trio emerges from the bridge and heads toward Hagrid's hut where students have gathered Draco Crabbe and Goyle stand with the Slytherins and though there is no consensus students stare in wary wonder as Hagrid coaxes a beast to the paddock's center Ron stares uneasily as the class steps back leaving Harry in front Unsure Harry nods steps forward and bows Buckbeak studies Harry and ducks his beak prompting a relieved sigh from Hagrid Tentatively Harry lays his hand on Buckbeak's beak and the class claps as Harry smiles Hagrid lifts Harry onto Buckbeak's back and slaps its hindquarters Buckbeak's talons slash down and Malfoy freezes noticing blood on his robes and shrieks Harry dashes forward and Buckbeak upon seeing Harry lowers its talons and ducks its beak Meanwhile Harry Ron and Hermione watch from the Gryffindor table and turn to see Seamus and other Gryffindors huddled over a copy of The Daily Prophet A glimmering puddle is omitted as a carriage wheel shatters the glassy surface revealing a procession of horseless carriages carrying students toward the castle The sweet sound of a choir rises as lightning flashes across the night sky transitioning the scene to the Great Hall The camera glides toward the windows passing through the glass to reveal candlelit silhouettes At the High Table sit Lupin Severus Snape Minerva McGonagall Rubeus Hagrid and Albus Dumbledore The camera tracks along the choir singing with a harpsichord and lands on a quintet of toads including Neville Longbottom's toad Trevor As the choir concludes Dumbledore stands beaming Amid scattered applause Harry Ron and Hermione clap then applaud vigorously after exchanging stunned looks Hagrid turns ruby red rises and nearly topples the staff table At the Slytherin table Draco Malfoy flanked by Crabbe and Goyle feigns a dead faint at Harry who makes eye contact Students exit the Great Hall and scale the Marble Staircase Harry Ron and Hermione reach the seventh floor landing and approach the Fat Lady in the portrait Ron spins and frowns at Hermione"
        }
      ]
    }
  ]
}