{
  "ground_truth": "Hermione reads over the shoulders of others, while a flicker of fear passes through Harry's face as Bem, a Nigerian boy, stares grimly at the grainy image of Black. Beautiful flowers gleam in the dawn light, then slowly begin to wither. The dew freezes, the grass grows brittle, and seconds later, the Dementors sweep by. A tall wardrobe rattles violently as Harry, Ron, and several classmates regard it warily. Ron jumps, glances at Hermione, then whispers to Harry. Neville eyes the rattling wardrobe and steps forward queasily as everyone laughs good-naturedly. Lupin nods thoughtfully and leans close to Neville, whispering. Neville's eyes pop open in shock as he considers Lupin uncertainly, then nods nervously and takes a deep breath. Sparks jet from Lupin's wand, strike the doorknob, and the wardrobe bursts open. Instantly, Snape appears, eyes flashing hideously as he stalks forward. Neville backs away in fright and turns, seeing Harry step forward expectantly. Concern flickers through Lupin's face as the Jack-In-The-Box pivots on its spring, its face tumbling toward Harry, becoming more sinister, transforming into a Dementor. Harry starts to raise his wand, then freezes, transfixed as the Dementor looms closer and closer. Lupin steps between them, snapping his wand, and studies Harry curiously. Harry looks up and finds Lupin studying him as Lupin's eyes glaze in memory, then he blinks and smiles, turning to eye Harry affectionately. Harry smiles vaguely. Harry, Ron, and Hermione exchange dark glances when Ginny emerges from the crowd, her face ashen. The students dash to the landing, where all the paintings whisper fearfully. Filch's rheumy eyes peer up, searching the upper shadows, then narrow as he extends a crooked finger. High up, near the ceiling, the Fat Lady cowers in a portrait not her own, trembling. As the students react, Dumbledore's voice cuts through. The clock tower door's great groaning tumblers fall, spindles rotate, and cylinders fire into place. Windows: iron spikes, sharp as razors, rise instantly. One by one, deep in the distance, the lights of the Great Hall go out. Dementors appear, covering the frame, then separate like a curtain. The camera drifts through the silent room, over an ocean of sleeping bags, finding Harry lying awake, staring at the net of stars glimmering beyond the highest window. A gentle creak is heard and Harry's eyes shift to see Snape pass through the great doors and converge with Dumbledore. Dumbledore gazes at the students, refusing to take the bait, while Snape's eyes glitter darkly. Dumbledore gazes out over the slumbering students, and as his gaze finds Harry, Harry shuts his eyes and feigns sleep. As the students eye Snape with guarded curiosity, Malfoy finishes scrawling something on a bit of parchment and balls it up in his hands, and as he opens them, a moth flutters from his palms.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Hermione peruses over the shoulders of others, while a flicker of dread passes through Harry's visage as Bem, a Nigerian lad, gazes grimly at the grainy picture of Black. Gorgeous blossoms glisten in the dawn light, then gradually commence to wither. The dew congeals, the grass becomes brittle, and moments later, the Dementors sweep by. A tall closet rattles violently as Harry, Ron, and several schoolmates regard it warily. Ron leaps, glances at Hermione, then murmurs to Harry. Neville eyes the rattling closet and advances forward queasily as everyone chuckles good-naturedly. Lupin nods thoughtfully and leans close to Neville, murmuring. Neville's eyes pop open in astonishment as he considers Lupin uncertainly, then nods nervously and inhales a deep breath. Sparks jet from Lupin's wand, hit the doorknob, and the closet bursts open. Instantly, Snape materializes, eyes flashing hideously as he stalks forward. Neville retreats in fright and turns, seeing Harry advance forward expectantly. Concern flickers through Lupin's visage as the Jack-In-The-Box swivels on its coil, its visage tumbling toward Harry, becoming more menacing, transforming into a Dementor. Harry starts to raise his wand, then freezes, transfixed as the Dementor looms nearer and nearer. Lupin steps between them, snapping his wand, and studies Harry curiously. Harry looks up and finds Lupin examining him as Lupin's eyes glaze in reminiscence, then he blinks and smiles, turning to eye Harry fondly. Harry smiles vaguely. Harry, Ron, and Hermione exchange dark glances when Ginny emerges from the throng, her visage ashen. The pupils dash to the landing, where all the paintings murmur fearfully. Filch's rheumy eyes peer up, searching the upper shadows, then narrow as he extends a crooked finger. High up, near the ceiling, the Fat Lady cowers in a portrait not her own, trembling. As the pupils react, Dumbledore's voice cuts through. The clock tower door's great groaning tumblers fall, spindles rotate, and cylinders fire into place. Windows: iron spikes, sharp as razors, rise instantly. One by one, deep in the distance, the lights of the Great Hall extinguish. Dementors appear, covering the frame, then separate like a curtain. The camera drifts through the silent chamber, over an ocean of sleeping bags, finding Harry lying awake, staring at the web of stars glimmering beyond the highest window. A gentle creak is heard and Harry's eyes shift to see Snape pass through the great doors and converge with Dumbledore. Dumbledore gazes at the pupils, refusing to take the bait, while Snape's eyes glitter darkly. Dumbledore gazes out over the slumbering pupils, and as his gaze finds Harry, Harry shuts his eyes and feigns slumber. As the pupils eye Snape with guarded curiosity, Malfoy finishes scrawling something on a scrap of parchment and balls it up in his hands, and as he opens them, a moth flutters from his palms."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Hermione's reading is done over the shoulders of others, while Harry's face is passed through by a flicker of fear as Bem, a Nigerian boy, grimly stares at the grainy image of Black. The dawn light gleams on beautiful flowers, which are then slowly begun to wither. The dew is frozen, the grass is grown brittle, and seconds later, the Dementors sweep by. A tall wardrobe is rattled violently as it is regarded warily by Harry, Ron, and several classmates. Ron is made to jump, glance at Hermione, then whisper to Harry. The rattling wardrobe is eyed by Neville, who steps forward queasily as everyone laughs good-naturedly. Lupin nods thoughtfully and leans close to Neville, whispering. Neville's eyes are popped open in shock as Lupin is considered uncertainly by him, then he nods nervously and takes a deep breath. Sparks are jetted from Lupin's wand and strike the doorknob, bursting the wardrobe open. Instantly, Snape appears with his eyes flashing hideously as he is made to stalk forward. In fright, Neville backs away and turns, seeing Harry expectedly stepping forward. The Jack-In-The-Box is pivoted on its spring as concern flickers through Lupin's face, its face is tumbled toward Harry, and it becomes more sinister, transforming into a Dementor. Harry is started to raise his wand, then is frozen, transfixed as the Dementor is loomed closer and closer. They are stepped between by Lupin, who snaps his wand and studies Harry curiously. Lupin is looked up to by Harry and is found studying him as Lupin's eyes glaze in memory, then he blinks and smiles, turning to eye Harry affectionately. Harry is made to smile vaguely. Dark glances are exchanged by Harry, Ron, and Hermione when Ginny emerges from the crowd, her face ashen. The students dash to the landing, where the paintings are whispered to fearfully. Up is peered by Filch's rheumy eyes, searching the upper shadows, then they narrow as a crooked finger is extended by him. High up, near the ceiling, the Fat Lady is cowering in a portrait not her own, trembling. The students react as Dumbledore's voice is cut through. The clock tower door's great groaning tumblers are fallen, spindles are rotated, and cylinders are fired into place. Iron spikes, sharp as razors, rise instantly in the windows. One by one, deep in the distance, the lights of the Great Hall are put out. Dementors appear, covering the frame, then are separated like a curtain. The silent room is drifted through by the camera, over an ocean of sleeping bags, finding Harry lying awake, staring at the net of stars glimmering beyond the highest window. A gentle creak is heard and Snape is seen by Harry's eyes passing through the great doors and converging with Dumbledore. The students are gazed at by Dumbledore, refusing to take the bait, while Snape's eyes glitter darkly. The slumbering students are gazed out over by Dumbledore, and as his gaze finds Harry, his eyes are shut by Harry, who feigns sleep. Snape is eyed by the students with guarded curiosity as something is finished being scrawled on a bit of parchment by Malfoy, and it is balled up in his hands, and as they are opened, a moth flutters from his palms."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Hermione reads over shoulders while a flicker of fear crosses Harry's face as Bem, a Nigerian boy, stares grimly at Black's grainy image. Beautiful flowers gleam in dawn light, then wither. The dew freezes, the grass grows brittle, and Dementors sweep by. A tall wardrobe rattles violently as Harry, Ron, and classmates watch warily. Ron jumps, glances at Hermione, then whispers to Harry. Neville eyes the rattling wardrobe, steps forward queasily, and classmates laugh good-naturedly. Lupin nods and whispers to Neville, who is shocked but nods nervously and takes a deep breath. Sparks shoot from Lupin's wand, hitting the doorknob, and the wardrobe bursts open. Snape appears, eyes flashing as he advances. Neville backs away and sees Harry step forward expectantly. Concern flickers on Lupin's face as the Jack-In-The-Box morphs into a Dementor. Harry raises his wand, then freezes as the Dementor looms closer. Lupin intervenes, snapping his wand, and studies Harry curiously. Lupin's eyes glaze in memory; he blinks, smiles at Harry, who smiles back vaguely. Harry, Ron, and Hermione exchange dark glances as Ginny emerges, ashen-faced. Students dash to the landing, paintings whisper fearfully. Filch peers into the shadows, extending a crooked finger. Near the ceiling, the Fat Lady cowers in another portrait. As students react, Dumbledore's voice cuts through. The clock tower door's tumblers fall, spindles rotate, and iron spikes rise instantly. Lights in the Great Hall dim. Dementors appear and separate, revealing Harry awake, staring at stars beyond the window. A creak shifts Harry's eyes to Snape passing through the great doors to join Dumbledore. Dumbledore gazes at students while Snape's eyes glitter darkly. Dumbledore's gaze lands on Harry, who feigns sleep. As students eye Snape curiously, Malfoy scrawls on parchment, balls it up, and opens his hands to release a moth."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Hermione reads over shoulders as a flicker of fear crosses Harry's face. Bem, a Nigerian boy, grimly stares at Black's image. Flowers gleam then wither as Dementors sweep by. A tall wardrobe rattles, watched warily by Harry, Ron, and classmates. Ron whispers to Harry as Neville steps forward, everyone laughing. Lupin leans close, whispers to Neville, who nods nervously. Sparks from Lupin's wand open the wardrobe, revealing Snape. Neville backs away, Harry steps forward, and Lupin intervenes. The Jack-In-The-Box transforms into a Dementor; Harry freezes. Lupin studies Harry, smiles, and Harry smiles vaguely back. Harry, Ron, and Hermione exchange looks as ashen-faced Ginny appears. Students rush to the landing, while Filch searches shadows. The Fat Lady cowers in a wrong portrait, trembling. Dumbledore's voice cuts through; the clock tower locks. Dementors curtain the frame, revealing Harry awake under stars. A creak draws Harry's gaze to Snape and Dumbledore. Dumbledore resists Snape, gazes at students, and Harry pretends to sleep. Students eye Snape; Malfoy releases a moth from parchment."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Hermione commits to the habit of reading over the shoulders of others, while a flicker of genuine fear briefly passes through Harry's face. This occurs as Bem, a young boy from Nigeria, focuses with a grim expression on the grainy and shadowy image of Black. Beautiful, vibrant flowers gleam resplendently in the dawn light but then begin to wither slowly. The dew that lay gently upon them freezes, causing the grass to grow brittle, and mere seconds later, the ominous Dementors sweep by in a chilling rush. A tall wardrobe rattles violently as Harry, Ron, and several wary classmates regard it with trepidation. Ron jumps with surprise, glances quickly at Hermione for support, then leans in closer to whisper something to Harry. Meanwhile, Neville eyes the unsettling, rattling wardrobe and, with a queasy expression, bravely steps forward as everyone around him laughs in a playful and good-natured manner. Lupin, observing this, nods thoughtfully and leans in close to Neville, whispering something quietly. Neville's eyes pop wide open in shock as he considers Lupin's words with uncertainty. He nods nervously, taking a deep preparatory breath. Sparks shoot out from Lupin's wand as they strike the doorknob, and the wardrobe instantly bursts open. In the blink of an eye, Snape appears, his eyes flashing hideously as he stalks menacingly forward. Neville backs away in fright and then turns to see Harry stepping forward with an expectant look. Concern briefly flickers across Lupin's face as the Jack-In-The-Box springs into view, pivoting on its coil, its face transforming, becoming more sinister, and finally morphing into a Dementor. Harry starts to raise his wand with intention but then freezes, transfixed, as the dark Dementor looms ever closer, threateningly. Lupin steps decisively between them, snapping his wand sharply, and studies Harry with a curious expression. Harry looks up and discovers Lupin studying him intently. Lupin's eyes glaze over with memory, and then he blinks, smiles warmly, and turns to look at Harry with affection. Harry returns the gesture, smiling vaguely. Harry, Ron, and Hermione exchange dark and concerned glances when Ginny emerges from the crowd, her face pale and ashen. The students quickly dash to the landing, where all the paintings on the walls whisper fearfully among themselves. Filch's rheumy eyes peer upward into the shadows above, then narrow as he extends a crooked, bony finger. High up, near the ceiling, the Fat Lady cowers fearfully in a portrait that is not her own, trembling with fright. As the students react with surprise, Dumbledore's voice cuts sharply through the noise. The great groaning tumblers of the clock tower door fall into place, spindles rotate methodically, and cylinders click and fire into position. As if on command, iron spikes as sharp as razors rise instantly to secure the windows. One by one, deep in the distance, the lights of the Great Hall flicker out, plunging the space into darkness. Dementors appear, covering the frame ominously, then separate like curtains drawn wide. The camera drifts silently through the room, over an ocean of sleeping bags, until it finds Harry lying awake, staring contemplatively at the net of stars that glimmer beyond the highest window. A gentle creak is heard, and Harry's eyes shift to see Snape passing stealthily through the great doors to converge with Dumbledore. Dumbledore gazes watchfully at the students, refusing to be baited, while Snape's eyes glitter darkly with intent. Dumbledore continues to gaze out over the slumbering students, and as his gaze finds Harry, Harry quickly shuts his eyes to feign sleep convincingly. As the students eye Snape with guarded curiosity, Malfoy finishes scrawling something on a bit of parchment, balls it up in his hands, and, as he opens them, a moth flutters free from his palms."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Hermione possesses a steadfast commitment to the peculiar habit of reading over the shoulders of others, a quirk she habitually indulges in, while a flicker of genuine fear momentarily flashes across Harry's face. This particular event unfolds as Bem, a young and serious-minded boy from Nigeria, focuses his attention with a grim and determined expression on the grainy, shadowy image of Black. Meanwhile, outside, beautiful and vibrant flowers appear to gleam resplendently in the soft dawn light, only to begin withering slowly. The delicate dew that had settled gently upon them starts to freeze, causing the once lush grass to grow brittle and crisp, and mere seconds later, the ominous Dementors sweep by, passing in a chilling, icy rush. In the classroom, a tall wardrobe rattles violently, shaking with intensity, as Harry, Ron, and several of their wary classmates gaze upon it with marked trepidation. Ron jumps with surprise at the unexpected noise, quickly glancing sideways at Hermione for support, then leans in closer to whisper something confidentially to Harry. Meanwhile, Neville, with a queasy expression upon his face, bravely steps forward to confront the unsettling, rattling wardrobe, even as everyone around him laughs in a playful, teasing, and good-natured manner. Observing this, Lupin nods thoughtfully, showing a keen understanding, and leans in close to Neville, whispering something quietly and encouragingly. Neville's eyes widen in shock and surprise as he processes Lupin's words, filled with uncertainty and apprehension. He nods nervously, steeling himself as he takes a deep preparatory breath. Sparks shoot out from Lupin's wand as they strike the doorknob, causing the wardrobe to burst open with sudden force. In the blink of an eye, Snape appears, his eyes flashing hideously as he stalks forward in a menacing manner. Neville, overcome with fright, backs away quickly and then turns to see Harry stepping forward with an expectant look on his face. A concern briefly flickers across Lupin's face as the Jack-In-The-Box springs into view, pivoting on its coil, its face transforming, becoming more sinister by the second, and finally morphing into a Dementor. Harry begins to raise his wand with determined intention but then freezes, transfixed with fear, as the dark Dementor looms ever closer in a threatening manner. Lupin steps decisively between them, snapping his wand sharply, and then studies Harry with a curious and probing expression. Harry looks up and finds Lupin observing him closely, their eyes meeting in silent understanding. Lupin's eyes glaze over momentarily with memory, and then he blinks, smiles warmly, and turns to regard Harry with affection. Harry, acknowledging the gesture, smiles vaguely in return. Harry, Ron, and Hermione exchange dark and deeply concerned glances as Ginny emerges from the crowd, her face pale and ashen with worry. The students quickly dash to the landing, where all the paintings lining the walls whisper fearfully among themselves. Filch, with his rheumy eyes, peers upward into the shadows above, then narrows his gaze as he extends a crooked, bony finger. High up, near the ceiling, the Fat Lady cowers fearfully within a portrait that is not her own, trembling with fright. As the students react with surprise to this sight, Dumbledore's authoritative voice cuts sharply through the noise. The great groaning tumblers of the clock tower door fall into place with a resonant thud, spindles rotating methodically, and cylinders clicking and firing into position. As if on command, iron spikes as sharp as razors rise instantly into place to secure the windows. One by one, deep in the distance, the lights of the Great Hall flicker out deliberately, plunging the vast space into an unsettling darkness. Dementors appear, casting ominous shadows over the frame before separating like curtains being drawn wide. The camera drifts silently through the room, over an ocean of sleeping bags, until it finds Harry lying awake, staring contemplatively at the net of shimmering stars visible beyond the highest window. A gentle creak is heard, prompting Harry's eyes to shift as he sees Snape passing stealthily through the great doors to converge with Dumbledore. Dumbledore watches the students with a watchful gaze, refusing to be baited, while Snape's eyes glitter darkly with intent. Dumbledore continues to gaze out over the slumbering students, and as his gaze settles upon Harry, Harry swiftly shuts his eyes to convincingly feign sleep. As the students eye Snape with cautious curiosity, Malfoy finishes scrawling something on a bit of parchment, balls it up tightly in his hands, and, as he opens them, a moth flutters free, escaping from his palms."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Hermione stands quietly behind others, her eyes darting back and forth as she reads over their shoulders, absorbing the information before her. Meanwhile, a flicker of fear dances across Harry's face, momentarily unsettling him as Bem, a Nigerian boy, directs a grim stare at the grainy image of Black in front of him. In the outdoor setting, a breathtaking array of flowers glistens brightly in the soft dawn light, catching the first rays of the sun before they slowly begin to lose their vibrancy and wilt. The dew that had settled on the petals and grass now crystallizes, and the grass becomes fragile, ready to break. Within moments, the Dementors glide past with an ominous presence. Inside, a towering wardrobe shakes violently, drawing the wary attention of Harry, Ron, and several other classmates, who regard it with a mix of curiosity and apprehension. Ron, startled by the wardrobe's movement, jumps slightly, then quickly glances at Hermione seeking reassurance before leaning in to whisper something to Harry. Neville, despite feeling uneasy, forces himself to keep his eyes on the rattling wardrobe and steps forward apprehensively, a gesture that prompts the others to laugh in a friendly, teasing manner. Lupin, observing Neville, nods thoughtfully and leans in close to whisper a few encouraging words that prompt Neville's eyes to widen in shock. However, after a moment of considering Lupin's words, Neville nods nervously and draws in a deep breath, steeling himself for what comes next. With a swift flick of his wand, Lupin sends sparks flying that strike the wardrobe’s doorknob, causing it to burst open with a loud bang. Instantly, Snape's menacing form emerges, his eyes glinting malevolently as he strides forward with purpose. In response, Neville retreats in fright, pivoting to see Harry stepping forward with a look of expectation on his face. Lupin's concern is evident as he keeps a watchful eye on Harry, while the Jack-In-The-Box, perched on its spring, pivots ominously toward Harry, its face morphing into something more sinister, ultimately becoming a Dementor. Harry begins to raise his wand, only to freeze, ensnared in a trance as the Dementor looms ever closer. Without hesitation, Lupin intervenes, quickly stepping between Harry and the threat, snapping his wand decisively while casting an analytical eye over Harry with curiosity. As Harry lifts his gaze, he finds Lupin watching him intently, lost momentarily in memory before blinking back to the present and offering Harry an affectionate smile. Harry responds with a vague smile of his own, though his mind seems elsewhere. With tension in the air, Harry, Ron, and Hermione exchange dark, meaningful glances just when Ginny emerges from the surrounding crowd, her complexion noticeably pale with distress. Suddenly, the students, sensing urgency, dash toward the landing where the paintings whisper ominously amongst themselves. Filch stands below, his rheumy eyes straining to peer upward into the shadowy recesses of the ceiling, then narrowing suspiciously as he points a crooked finger upward. Above him, the Fat Lady huddles within a portrait not her own, her body trembling in fear. As reactions ripple through the students, Dumbledore's commanding voice cuts through the anxious murmurs. The clock tower door’s heavy tumblers creak and fall into place with a great groan, followed by the rotation of spindles and the firing of cylinders into a locked position. Simultaneously, razor-sharp iron spikes suddenly rise, securing the windows with an air of finality. In the distance, the lights illuminating the Great Hall flicker out one by one, leaving the room in an eerie, encroaching darkness. Dementors emerge, their figures filling the frame before parting like a curtain, revealing a silent, dimly lit room. The camera glides smoothly over the sea of sleeping bags, eventually focusing on Harry, who lies awake, his eyes fixed on a shimmering net of stars visible through the highest window. A gentle creak interrupts the stillness, drawing Harry's attention to Snape as he slips through the large doors to join Dumbledore. Dumbledore stands, his gaze sweeping across the room, taking in the scene before him without reacting to provocation, while Snape’s eyes remain sharp and calculating. As Dumbledore's gaze lands on Harry, Harry instinctively shuts his eyes, feigning sleep to avoid being noticed. The students, meanwhile, continue to eye Snape with guarded curiosity when Malfoy completes scribbling on a bit of parchment. Crumpling it in his hands, he opens them to reveal a delicate moth, which flutters out from his palms, adding to the room’s surreal atmosphere."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Hermione reads over others' shoulders as Bem, a Nigerian boy, grimly observes Black's image, while Harry's face reflects fear. As beautiful flowers wither in the dawn light, the Dementors pass, creating a chilling scene. In the classroom, a tall wardrobe rattles, drawing wary attention from Harry, Ron, and classmates. Ron whispers to Harry after glancing at Hermione, while Neville moves forward hesitantly. Lupin encourages Neville with a whisper, prompting Neville to nod nervously and prepare himself. Sparks from Lupin's wand trigger the wardrobe to burst open, revealing Snape, who advances menacingly. Frightened, Neville retreats as Harry steps forward. Lupin intervenes between Harry and the transforming Dementor, then reassures Harry with a smile after a moment of reflection. Harry, Ron, and Hermione share dark glances when Ginny appears, looking pale. The students rush to the landing, amidst fearful whispers from the paintings. Filch intently scans the shadows until he spots the Fat Lady trembling in a different portrait. As the students react, Dumbledore's voice breaks through, and the secure measures around the castle activate as the Great Hall's lights extinguish. Dementors part like a curtain in the silent room, revealing Harry lying awake, gazing at the stars. Noticing Snape enter and confer with Dumbledore, Harry feigns sleep under Dumbledore's knowing gaze. Meanwhile, Snape's presence draws curious looks from students, while Malfoy writes on a parchment, releasing a moth as he opens his hands."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Hermione, known for her insatiable curiosity and intellect, reads over the shoulders of others, while a flicker of fear passes through Harry's face as Bem, a Nigerian boy attending Hogwarts on an exchange program, stares grimly at the grainy image of Black, who is notorious in the wizarding world for his escape from Azkaban. Beautiful flowers gleam in the dawn light, then slowly begin to wither in the chilling presence of Dementors, who are guards of Azkaban and feed on human happiness. The dew freezes, the grass grows brittle, and seconds later, the Dementors sweep by, their cold aura casting a shadow on the scene. A tall wardrobe, used in the Defense Against the Dark Arts class at Hogwarts, rattles violently as Harry, Ron, and several classmates regard it warily. Ron jumps, glances at Hermione for reassurance, then whispers to Harry, highlighting their close friendship. Neville, often nervous in magical situations, eyes the rattling wardrobe and steps forward queasily as everyone laughs good-naturedly, a typical reaction to his endearing clumsiness. Lupin, their Defense Against the Dark Arts professor known for his kind yet firm guidance, nods thoughtfully and leans close to Neville, whispering instructions. Neville's eyes pop open in shock as he considers Lupin uncertainly, then nods nervously and takes a deep breath, determined to confront his fears. Sparks jet from Lupin's wand, strike the doorknob, and the wardrobe bursts open. Instantly, Snape, the Potions Master with a reputation for being stern and intimidating, appears, eyes flashing hideously as he stalks forward. Neville backs away in fright and turns, seeing Harry step forward expectantly, prepared to face the challenge. Concern flickers through Lupin's face as the Jack-In-The-Box pivots on its spring, its face tumbling toward Harry, becoming more sinister, transforming into a Dementor. Harry starts to raise his wand, then freezes, transfixed as the Dementor looms closer and closer, a testament to his deepest fears. Lupin steps between them, snapping his wand with expert precision, and studies Harry curiously. Harry looks up and finds Lupin studying him as Lupin's eyes glaze in memory, recalling past students, then he blinks and smiles, turning to eye Harry affectionately, recognizing his potential. Harry smiles vaguely, a mix of gratitude and lingering fear. Harry, Ron, and Hermione exchange dark glances when Ginny, their close friend and Ron's sister, emerges from the crowd, her face ashen with worry. The students dash to the landing, where all the paintings, with their ability to move and speak, whisper fearfully. Filch, the castle's caretaker known for his disdain for students, peers up with rheumy eyes, searching the upper shadows, then narrows them as he extends a crooked finger, a sign of his suspicion. High up, near the ceiling, the Fat Lady, who guards the entrance to Gryffindor Tower, cowers in a portrait not her own, trembling from a recent attack. As the students react, Dumbledore's voice, calm yet authoritative, cuts through. The clock tower door's great groaning tumblers fall, spindles rotate, and cylinders fire into place, securing the castle. Windows: iron spikes, sharp as razors, rise instantly to protect against intruders. One by one, deep in the distance, the lights of the Great Hall, the heart of the castle's communal life, go out. Dementors appear, covering the frame, then separate like a curtain, an unsettling presence at Hogwarts. The camera drifts through the silent room, over an ocean of sleeping bags, finding Harry lying awake, staring at the net of stars glimmering beyond the highest window, deep in thought about recent events. A gentle creak is heard and Harry's eyes shift to see Snape pass through the great doors and converge with Dumbledore. Dumbledore gazes at the students, refusing to take the bait from Snape's subtle provocations, while Snape's eyes glitter darkly with undisclosed intentions. Dumbledore gazes out over the slumbering students, and as his gaze finds Harry, Harry shuts his eyes and feigns sleep, preferring to avoid attention. As the students eye Snape with guarded curiosity, wary of his unpredictable nature, Malfoy, known for his rivalry with Harry, finishes scrawling something on a bit of parchment and balls it up in his hands, and as he opens them, a moth flutters from his palms, a small display of magic."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Hermione reads over the shoulders of others while a flicker of fear passes through Harry's face as Bem a Nigerian boy stares grimly at the grainy image of Black. Beautiful flowers gleam in the dawn light then slowly begin to wither. The dew freezes the grass grows brittle and seconds later the Dementors sweep by. A tall wardrobe rattles violently as Harry. Ron and several classmates regard it warily. Ron jumps glances at Hermione then whispers to Harry. Neville eyes the rattling wardrobe and steps forward queasily as everyone laughs goodnaturedly. Lupin nods thoughtfully and leans close to Neville whispering. Neville's eyes pop open in shock as he considers Lupin uncertainly then nods nervously and takes a deep breath. Sparks jet from Lupin's wand strike the doorknob and the wardrobe bursts open. Instantly Snape appears eyes flashing hideously as he stalks forward. Neville backs away in fright and turns seeing Harry step forward expectantly. Concern flickers through Lupin's face as the JackInTheBox pivots on its spring its face tumbling toward Harry becoming more sinister transforming into a Dementor. Harry starts to raise his wand then freezes transfixed as the Dementor looms closer and closer. Lupin steps between them snapping his wand and studies Harry curiously. Harry looks up and finds Lupin studying him as Lupin's eyes glaze in memory. then he blinks and smiles turning to eye Harry affectionately. Harry smiles vaguely. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Harry. Ron and Hermione exchange dark glances when Ginny emerges from the crowd her face ashen. The students dash to the landing where all the paintings whisper fearfully. Filch's rheumy eyes peer up searching the upper shadows then narrow as he extends a crooked finger. High up near the ceiling the Fat Lady cowers in a portrait not her own trembling. As the students react Dumbledore's voice cuts through. The clock tower door's great groaning tumblers fall spindles rotate and cylinders fire into place. Windows iron spikes sharp as razors rise instantly. One by one deep in the distance. the lights of the Great Hall go out. Dementors appear covering the frame then separate like a curtain. The camera drifts through the silent room over an ocean of sleeping bags finding Harry lying awake staring at the net of stars glimmering beyond the highest window. A gentle creak is heard and Harry's eyes shift to see Snape pass through the great doors and converge with Dumbledore. Dumbledore gazes at the students refusing to take the bait while Snape's eyes glitter darkly. Dumbledore gazes out over the slumbering students and as his gaze finds Harry. Harry shuts his eyes and feigns sleep. As the students eye Snape with guarded curiosity. Malfoy finishes scrawling something on a bit of parchment and balls it up in his hands and as he opens them a moth flutters from his palms."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Hermione reads over the shoulders of others while a flicker of fear passes through Harry's face as Bem a Nigerian boy stares grimly at the grainy image of Black. Beautiful flowers gleam in the dawn light then slowly begin to wither. The dew freezes the grass grows brittle and seconds later the Dementors sweep by. A tall wardrobe rattles violently as Harry. Ron and several classmates regard it warily. Ron jumps glances at Hermione then whispers to Harry. Neville eyes the rattling wardrobe and steps forward queasily as everyone laughs goodnaturedly. Lupin nods thoughtfully and leans close to Neville whispering. Neville's eyes pop open in shock as he considers Lupin uncertainly then nods nervously and takes a deep breath. Sparks jet from Lupin's wand strike the doorknob and the wardrobe bursts open. Instantly Snape appears eyes flashing hideously as he stalks forward. Neville backs away in fright and turns seeing Harry step forward expectantly. Concern flickers through Lupin's face as the JackInTheBox pivots on its spring its face tumbling toward Harry becoming more sinister transforming into a Dementor. Harry starts to raise his wand then freezes transfixed as the Dementor looms closer and closer. Lupin steps between them snapping his wand and studies Harry curiously. Harry looks up and finds Lupin studying him as Lupin's eyes glaze in memory. then he blinks and smiles turning to eye Harry affectionately. Harry smiles vaguely. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Harry. Ron and Hermione exchange dark glances when Ginny emerges from the crowd her face ashen. The students dash to the landing where all the paintings whisper fearfully. Filch's rheumy eyes peer up searching the upper shadows then narrow as he extends a crooked finger. High up near the ceiling the Fat Lady cowers in a portrait not her own trembling. As the students react Dumbledore's voice cuts through. The clock tower door's great groaning tumblers fall spindles rotate and cylinders fire into place. Windows iron spikes sharp as razors rise instantly. One by one deep in the distance. the lights of the Great Hall go out. Dementors appear covering the frame then separate like a curtain. The camera drifts through the silent room over an ocean of sleeping bags finding Harry lying awake staring at the net of stars glimmering beyond the highest window. A gentle creak is heard and Harry's eyes shift to see Snape pass through the great doors and converge with Dumbledore. Dumbledore gazes at the students refusing to take the bait while Snape's eyes glitter darkly. Dumbledore gazes out over the slumbering students and as his gaze finds Harry. Harry shuts his eyes and feigns sleep. As the students eye Snape with guarded curiosity. Malfoy finishes scrawling something on a bit of parchment and balls it up in his hands and as he opens them a moth flutters from his palms."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Hermione reads over the shoulders of others while a flicker of fear passes through Harry's face as Bem a Nigerian boy stares grimly at the grainy image of Black. Beautiful flowers gleam in the dawn light then slowly begin to wither. The dew freezes the grass grows brittle and seconds later the Dementors sweep by. A tall wardrobe rattles violently as Harry. Ron and several classmates regard it warily. Ron jumps glances at Hermione then whispers to Harry. Neville eyes the rattling wardrobe and steps forward queasily as everyone laughs goodnaturedly. Lupin nods thoughtfully and leans close to Neville whispering. Neville's eyes pop open in shock as he considers Lupin uncertainly then nods nervously and takes a deep breath. the lights of the Great Hall go out. Dementors appear covering the frame then separate like a curtain. The camera drifts through the silent room over an ocean of sleeping bags finding Harry lying awake staring at the net of stars glimmering beyond the highest window. A gentle creak is heard and Harry's eyes shift to see Snape pass through the great doors and converge with Dumbledore. Dumbledore gazes at the students refusing to take the bait while Snape's eyes glitter darkly. Dumbledore gazes out over the slumbering students and as his gaze finds Harry. Harry shuts his eyes and feigns sleep. As the students eye Snape with guarded curiosity. Malfoy finishes scrawling something on a bit of parchment and balls it up in his hands and as he opens them a moth flutters from his palms."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Hermione reads over the shoulders of others while a flicker of fear passes through Harry's face as Bem a Nigerian boy stares grimly at the grainy image of Black. Beautiful flowers gleam in the dawn light then slowly begin to wither. The dew freezes the grass grows brittle and seconds later the Dementors sweep by. A tall wardrobe rattles violently as Harry. Dumbledore gazes out over the slumbering students and as his gaze finds Harry. Harry shuts his eyes and feigns sleep. As the students eye Snape with guarded curiosity. Malfoy finishes scrawling something on a bit of parchment and balls it up in his hands and as he opens them a moth flutters from his palms."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Wendell writes beside the footsteps of creatures, while a flicker of delight darts across Tom's face as Lula, a Brazilian girl, glares joyfully at the blurry portrait of White. Stunning mountains shimmer in the dusk light, then gradually start to bloom. The dust melts, the leaves turn flexible, and moments later, the Knights gallop past. A tiny suitcase quivers gently as Tom, Sam, and various teachers observe it eagerly. Sam leaps, peers at Wendell, then shouts to Tom. Gary watches the quivering suitcase and skips forward boldly as everyone cries loudly. Elena shrugs casually and leans away from Gary, yawning. Gary's feet jump up in surprise as he examines Elena doubtfully, then shrugs confidently and holds an empty glass. Feathers whirl from Elena's pen, tap the handle, and the suitcase bursts closed. Suddenly, Ginger appears, nose twitching beautifully as she dances backward. Gary races forward in excitement and sings, watching Tom skip backward anxiously. Joy bounces across Elena's face as the Music Box rocks on its hinge, its melody rolling toward Tom, growing slower, shifting into a Knight. Tom tries to lower his pen, then darts, amazed as the Knight twirls farther and farther. Elena leaps near them, tossing her pen, and observes Tom jokingly. Tom glares down and discovers Elena observing him as Elena's nose brightens in laughter, then she squints and frowns, twisting to watch Tom cheerfully. Tom frowns briefly. Tom, Sam, and Wendell share cheerful nods when Lucy joins from the shadows, her tone lively. The teachers stroll to the staircase, where all the curtains murmur quietly. Velvet’s shiny feet roll down, tracing the lower beams, then widen as he folds a straight ribbon. Low down, beside the floor, the Thin Man cheers in a frame not his own, humming. As the teachers pause, Edgar's laugh echoes through. The drawbridge arch’s small snapping levers rise, wheels spin, and engines tumble into sleep. Ceiling fans: wooden blades, dull as spoons, descend hesitantly. One after one, high in the foreground, the sights of the Small Room turn on. Knights disappear, revealing the canvas, then combine like a puzzle. The microphone zooms through the noisy hallway, across a garden of chairs, finding Tom resting quietly, admiring the map of clouds glowing past the lowest door. A loud slam is heard and Tom’s feet drift to see Ginger exit through the small windows and clash with Edgar. Edgar peers at the teachers, attempting to take the gift, while Ginger’s feet gleam softly. Edgar peers out across the napping teachers, and as his glance spots Tom, Tom opens his hands and fakes a nap. As the teachers admire Ginger with open admiration, Molly starts whispering nonsense on a pile of books and drops them from her arms, and as she closes them, a beetle races to her feet."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Hermione reads over others' shoulders as Harry shows fear while Bem, a Nigerian boy, stares at Black's image. Flowers wither as Dementors pass. In class, a rattling wardrobe captures Harry, Ron, and others' attention. Lupin whispers to Neville, who nervously faces Snape emerging from the wardrobe. As the situation escalates, Lupin intervenes, sparking Harry's curiosity. The mood darkens as Ginny joins them, and Filch alerts them to the cowering Fat Lady in a portrait. Dumbledore and Snape appear amidst the tense atmosphere. As night falls, Harry lies awake, observing stars. Snape and Dumbledore converse quietly while Dumbledore oversees the students. Malfoy secretly releases a moth from his hands, hinting at underlying tensions."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Malfoy finishes scrawling something on a bit of parchment and balls it up in his hands and as he opens them a moth flutters from his palms As the students eye Snape with guarded curiosity Harry shuts his eyes and feigns sleep Dumbledore gazes out over the slumbering students and as his gaze finds Harry Dumbledore gazes at the students refusing to take the bait while Snape's eyes glitter darkly A gentle creak is heard and Harry's eyes shift to see Snape pass through the great doors and converge with Dumbledore The camera drifts through the silent room over an ocean of sleeping bags finding Harry lying awake staring at the net of stars glimmering beyond the highest window Dementors appear covering the frame then separate like a curtain the lights of the Great Hall go out One by one deep in the distance Windows iron spikes sharp as razors rise instantly The clock tower door's great groaning tumblers fall spindles rotate and cylinders fire into place As the students react Dumbledore's voice cuts through High up near the ceiling the Fat Lady cowers in a portrait not her own trembling Filch's rheumy eyes peer up searching the upper shadows then narrow as he extends a crooked finger The students dash to the landing where all the paintings whisper fearfully Ron and Hermione exchange dark glances when Ginny emerges from the crowd her face ashen Harry Harry smiles vaguely then he blinks and smiles turning to eye Harry affectionately Harry looks up and finds Lupin studying him as Lupin's eyes glaze in memory Lupin steps between them snapping his wand and studies Harry curiously Harry starts to raise his wand then freezes transfixed as the Dementor looms closer and closer Concern flickers through Lupin's face as the JackInTheBox pivots on its spring its face tumbling toward Harry becoming more sinister transforming into a Dementor Neville backs away in fright and turns seeing Harry step forward expectantly Instantly Snape appears eyes flashing hideously as he stalks forward Sparks jet from Lupin's wand strike the doorknob and the wardrobe bursts open Neville's eyes pop open in shock as he considers Lupin uncertainly then nods nervously and takes a deep breath Lupin nods thoughtfully and leans close to Neville whispering Neville eyes the rattling wardrobe and steps forward queasily as everyone laughs goodnaturedly Ron jumps glances at Hermione then whispers to Harry Ron and several classmates regard it warily A tall wardrobe rattles violently as Harry The dew freezes the grass grows brittle and seconds later the Dementors sweep by Beautiful flowers gleam in the dawn light then slowly begin to wither Hermione reads over the shoulders of others while a flicker of fear passes through Harry's face as Bem a Nigerian boy stares grimly at the grainy image of Black"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Beautiful flowers gleam in the dawn light then slowly begin to wither Hermione reads over the shoulders of others while a flicker of fear passes through Harry's face as Bem a Nigerian boy stares grimly at the grainy image of Black A tall wardrobe rattles violently as Harry The dew freezes the grass grows brittle and seconds later the Dementors sweep by Ron jumps glances at Hermione then whispers to Harry Ron and several classmates regard it warily Lupin nods thoughtfully and leans close to Neville whispering Neville eyes the rattling wardrobe and steps forward queasily as everyone laughs goodnaturedly Sparks jet from Lupin's wand strike the doorknob and the wardrobe bursts open Neville's eyes pop open in shock as he considers Lupin uncertainly then nods nervously and takes a deep breath Neville backs away in fright and turns seeing Harry step forward expectantly Instantly Snape appears eyes flashing hideously as he stalks forward Harry starts to raise his wand then freezes transfixed as the Dementor looms closer and closer Concern flickers through Lupin's face as the JackInTheBox pivots on its spring its face tumbling toward Harry becoming more sinister transforming into a Dementor Harry looks up and finds Lupin studying him as Lupin's eyes glaze in memory Lupin steps between them snapping his wand and studies Harry curiously Harry smiles vaguely then he blinks and smiles turning to eye Harry affectionately Ron and Hermione exchange dark glances when Ginny emerges from the crowd her face ashen Harry Filch's rheumy eyes peer up searching the upper shadows then narrow as he extends a crooked finger The students dash to the landing where all the paintings whisper fearfully As the students react Dumbledore's voice cuts through High up near the ceiling the Fat Lady cowers in a portrait not her own trembling Windows iron spikes sharp as razors rise instantly The clock tower door's great groaning tumblers fall spindles rotate and cylinders fire into place the lights of the Great Hall go out One by one deep in the distance The camera drifts through the silent room over an ocean of sleeping bags finding Harry lying awake staring at the net of stars glimmering beyond the highest window Dementors appear covering the frame then separate like a curtain Dumbledore gazes at the students refusing to take the bait while Snape's eyes glitter darkly A gentle creak is heard and Harry's eyes shift to see Snape pass through the great doors and converge with Dumbledore Harry shuts his eyes and feigns sleep Dumbledore gazes out over the slumbering students and as his gaze finds Harry Malfoy finishes scrawling something on a bit of parchment and balls it up in his hands and as he opens them a moth flutters from his palms As the students eye Snape with guarded curiosity"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Harry Ron and Hermione exchange dark glances when Ginny emerges from the crowd her face ashen The students dash to the landing where all the paintings whisper fearfully Filch's rheumy eyes peer up searching the upper shadows then narrow as he extends a crooked finger High up near the ceiling the Fat Lady cowers in a portrait not her own trembling As the students react Dumbledore's voice cuts through The clock tower door's great groaning tumblers fall spindles rotate and cylinders fire into place Windows iron spikes sharp as razors rise instantly One by one deep in the distance the lights of the Great Hall go out Dementors appear covering the frame then separate like a curtain The camera drifts through the silent room over an ocean of sleeping bags finding Harry lying awake staring at the net of stars glimmering beyond the highest window A gentle creak is heard and Harry's eyes shift to see Snape pass through the great doors and converge with Dumbledore Dumbledore gazes at the students refusing to take the bait while Snape's eyes glitter darkly Dumbledore gazes out over the slumbering students and as his gaze finds Harry Harry shuts his eyes and feigns sleep As the students eye Snape with guarded curiosity Malfoy finishes scrawling something on a bit of parchment and balls it up in his hands and as he opens them a moth flutters from his palms Hermione reads over the shoulders of others while a flicker of fear passes through Harry's face as Bem a Nigerian boy stares grimly at the grainy image of Black Beautiful flowers gleam in the dawn light then slowly begin to wither The dew freezes the grass grows brittle and seconds later the Dementors sweep by A tall wardrobe rattles violently as Harry Ron and several classmates regard it warily Ron jumps glances at Hermione then whispers to Harry Neville eyes the rattling wardrobe and steps forward queasily as everyone laughs goodnaturedly Lupin nods thoughtfully and leans close to Neville whispering Neville's eyes pop open in shock as he considers Lupin uncertainly then nods nervously and takes a deep breath Sparks jet from Lupin's wand strike the doorknob and the wardrobe bursts open Instantly Snape appears eyes flashing hideously as he stalks forward Neville backs away in fright and turns seeing Harry step forward expectantly Concern flickers through Lupin's face as the JackInTheBox pivots on its spring its face tumbling toward Harry becoming more sinister transforming into a Dementor Harry starts to raise his wand then freezes transfixed as the Dementor looms closer and closer Lupin steps between them snapping his wand and studies Harry curiously Harry looks up and finds Lupin studying him as Lupin's eyes glaze in memory then he blinks and smiles turning to eye Harry affectionately Harry smiles vaguely"
        }
      ]
    }
  ]
}