{
  "ground_truth": "Harry has donned Hermione's scarf and Ron's hat to disguise himself as Fudge looks around nervously and then jerks his head toward the pub. As he leads Rosmerta and McGonagall inside, we cut back to Hermione and Ron. Footprints track through the snow into the pub, as Ron and Hermione ripple briefly past a frosted window. Three shrunken heads swing into view while Rosmerta looks to McGonagall, who nods grimly. Suddenly, the pub doors fly open, revealing Main Street, where Ron and Hermione wait, rubbing their hands against the chill. As they look down, the camera tilts and footprints appear in the snow, marking the end of Harry's point of view. At the end of a rocky outcrop, the footprints end and sobs are heard. Ron takes Hermione's arm to discourage her from going further, but she does, filling the footprints with her own, then kneeling and gently drawing the cloak from Harry, who stares into the mist with eyes stinging with tears. Butterflies flutter over the great green lawn, the giant squid breaks through the last glaze of ice on the Black Lake, and the Whomping Willow shakes the water from its branches as the dying sun streams through high windows, painting Harry's face a fierce amber-red as he stands opposite Lupin. Ancient charts drape the walls while gleaming spheres of spun glass orbit one another silently, and Lupin paces before a large trunk. Harry shakes his head, and as his eyes wander, Lupin snaps his fingers to bring his attention back, then nods. Crack! The Dementor mutates into a silvery white orb, and Harry glances toward the window at the bloody sun, then looks up into Lupin's eyes, emotional, and nods. Harry takes a breath as Lupin blinks at Harry's quiet fierceness and opens the packing case, instantly causing the Dementor to appear again. The hair skates off Harry's scar as he sets his jaw, his hand trembling, and his whole body trembling, but he holds his ground when a huge silver shadow bursts from the end of his wand, hovering between him and the Dementor, which falters. Lupin nods as all the boys are asleep except Harry, who lies in bed studying the photo of his parents, barely visible in the fluttering light of a guttering candle. The camera begins to move, creeping forward, but it's only an old man in a painting, scowling in the glare of Harry's wand light. Harry makes to follow, then stops as the wand's spot dances across the parchment and finds another dot. Harry stashes the map, extinguishes his wand, and turns into the harsh glare of Snape's wand. A sneer curdles the corners of Snape's lips as he eyes Harry coldly, lowering his wand. Seeing the map, Snape's eyes glitter, and to Harry's horror, words begin to appear as Snape studies him with a sadistic half-smile on his lips.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Harry has put on Hermione's muffler and Ron's cap to disguise himself as Fudge glances around anxiously and then jerks his head toward the tavern. As he guides Rosmerta and McGonagall indoors, we switch back to Hermione and Ron. Footprints track through the snow into the inn, as Ron and Hermione ripple briefly past a frosted pane. Three shrunken heads swing into sight while Rosmerta glances to McGonagall, who nods grimly. Suddenly, the pub doors fly open, revealing Main Street, where Ron and Hermione wait, rubbing their hands against the chill. As they glance down, the camera tilts and footprints appear in the snow, marking the conclusion of Harry's perspective. At the termination of a rocky promontory, the footprints cease and sobs are heard. Ron takes Hermione's arm to discourage her from going further, but she does, filling the tracks with her own, then kneeling and gently drawing the cloak from Harry, who stares into the haze with eyes stinging with tears. Butterflies flutter over the vast verdant lawn, the giant squid breaks through the last glaze of ice on the Black Lake, and the Whomping Willow shakes the water from its limbs as the dying sun streams through tall windows, painting Harry's face a fierce amber-red as he stands opposite Lupin. Ancient charts drape the walls while gleaming spheres of spun glass orbit one another silently, and Lupin strides before a large chest. Harry shakes his head, and as his eyes wander, Lupin snaps his fingers to bring his attention back, then nods. Crack! The Dementor transforms into a silvery white globe, and Harry glances toward the window at the bloody sun, then looks up into Lupin's eyes, emotional, and nods. Harry takes a breath as Lupin blinks at Harry's quiet intensity and opens the trunk, instantly causing the Dementor to appear again. The hair slides off Harry's scar as he sets his jaw, his hand trembling, and his whole body quivering, but he holds his ground when a huge silver shadow bursts from the termination of his wand, hovering between him and the Dementor, which falters. Lupin nods as all the boys are asleep except Harry, who lies in bed studying the photo of his parents, barely visible in the fluttering light of a guttering candle. The camera begins to move, creeping forward, but it's only an old man in a painting, scowling in the glare of Harry's wand light. Harry makes to follow, then stops as the wand's spot dances across the parchment and discovers another dot. Harry stashes the map, extinguishes his wand, and turns into the harsh glare of Snape's wand. A sneer curdles the corners of Snape's lips as he eyes Harry coldly, lowering his wand. Seeing the map, Snape's eyes glitter, and to Harry's horror, words begin to appear as Snape examines him with a sadistic half-smile on his lips."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Hermione's scarf and Ron's hat have been donned by Harry to disguise himself as Fudge, who looks around nervously and then jerks his head toward the pub. Rosmerta and McGonagall are led inside by him, and we cut back to Hermione and Ron. The snow is tracked through by footprints into the pub, as Ron and Hermione are briefly rippled past a frosted window. While Rosmerta looks to McGonagall, who nods grimly, three shrunken heads swing into view. Suddenly, the pub doors are flown open, revealing Main Street, where Ron and Hermione are waiting, rubbing their hands against the chill. As they look down, the camera tilts, and footprints are made to appear in the snow, marking the end of Harry's point of view. At the end of a rocky outcrop, where the footprints end, sobs are heard. Hermione's arm is taken by Ron to discourage her from going further, but she does, filling the footprints with her own, then she kneels and gently draws the cloak from Harry, who stares into the mist with eyes stinging with tears. Over the great green lawn, butterflies are made to flutter, the giant squid breaks through the last glaze of ice on the Black Lake, and the water is shaken from its branches by the Whomping Willow as the dying sun streams through high windows, painting Harry's face a fierce amber-red as he stands opposite Lupin. The walls are draped with ancient charts while spheres of spun glass orbit one another silently, and before a large trunk, Lupin paces. Harry's head is shaken, and as his eyes wander, his attention is brought back by Lupin snapping his fingers, then he nods. Crack! The Dementor mutates into a silvery white orb, and Harry's glance is turned toward the window at the bloody sun, then he looks up into Lupin's eyes, emotional, and nods. A breath is taken by Harry as Lupin blinks at Harry's quiet fierceness and opens the packing case, instantly causing the Dementor to appear again. Harry's scar is skated off by the hair as he sets his jaw, his hand trembling, and his whole body trembling, but when a huge silver shadow is burst from the end of his wand, hovering between him and the Dementor, which falters, he holds his ground. All the boys are nodded at by Lupin as they are asleep except Harry, who lies in bed studying the photo of his parents, barely visible in the fluttering light of a guttering candle. The camera is begun to be moved by it, creeping forward, but it's only an old man in a painting, who scowls in the glare of Harry's wand light. Following is made to by Harry, then he stops as the wand's spot dances across the parchment and finds another dot. The map is stashed by Harry, his wand is extinguished, and he is turned into the harsh glare of Snape's wand. The corners of Snape's lips are curdled by a sneer as he eyes Harry coldly, lowering his wand. Seeing the map, the eyes of Snape glitter, and to Harry's horror, words begin to appear as Snape studies him with a sadistic half-smile on his lips."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Harry wears Hermione's scarf and Ron's hat to disguise himself as Fudge nervously gestures toward the pub. Leading Rosmerta and McGonagall inside, we return to Hermione and Ron. Footprints track through the snow into the pub, and Ron and Hermione ripple past a frosted window. Three shrunken heads appear as Rosmerta looks to McGonagall, who nods grimly. Suddenly, the pub doors open, revealing Main Street, where Ron and Hermione wait, rubbing their hands against the cold. As they look down, the camera tilts, showing footprints in the snow, marking the end of Harry's view. At a rocky outcrop, the footprints stop, and sobs are heard. Ron takes Hermione's arm to stop her, but she continues, filling the footprints with her own, then kneels and gently removes the cloak from Harry, who stares into the mist with tearful eyes. Butterflies flutter over the lawn, the giant squid breaks through the ice on the Black Lake, and the Whomping Willow shakes water from its branches as the setting sun paints Harry's face amber-red as he stands opposite Lupin. Ancient charts cover the walls while glass spheres orbit silently, and Lupin paces before a large trunk. Harry shakes his head, and as his eyes wander, Lupin snaps his fingers to regain his attention, then nods. Crack! The Dementor turns into a silvery orb, and Harry glances at the bloody sun, then looks into Lupin's eyes, emotional, and nods. Harry takes a breath as Lupin blinks at Harry's quiet determination and opens the case, causing the Dementor to reappear. Hair skates off Harry's scar as he sets his jaw, trembling, but holds his ground when a huge silver shadow bursts from his wand, hovering between him and the Dementor, which falters. Lupin nods as all the boys sleep except Harry, who studies a photo of his parents by candlelight. The camera moves forward, revealing an old man in a painting, scowling in Harry's wand light. Harry starts to follow, then stops as the wand's light dances across the parchment, finding another dot. Harry stashes the map, extinguishes his wand, and turns into Snape's wand glare. A sneer curls Snape's lips as he eyes Harry coldly, lowering his wand. Seeing the map, Snape's eyes glitter, and to Harry's horror, words appear as Snape studies him with a sadistic half-smile."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Harry wears Hermione's scarf and Ron's hat to disguise himself as Fudge nervously gestures toward the pub. Inside, Rosmerta and McGonagall follow him. Ron and Hermione's footprints track through the snow into the pub, briefly visible past a frosted window. Rosmerta looks to McGonagall, who nods grimly. The pub doors open to Main Street, where Ron and Hermione wait, rubbing their hands against the cold. Footprints appear in the snow, marking the end of Harry's view. At a rocky outcrop, the footprints end with sobs. Ron discourages Hermione from going further, but she fills the footprints with her own, kneels, and draws the cloak from Harry, who stares misty-eyed. Butterflies flutter over the lawn, the giant squid breaks ice on the Black Lake, and the Whomping Willow shakes water from its branches as the sun paints Harry's face amber-red opposite Lupin. Ancient charts drape the walls, and glass spheres orbit silently as Lupin paces. Harry shakes his head, Lupin snaps his fingers, and Harry nods. Crack! The Dementor becomes a silvery orb, and Harry glances at the sun, then at Lupin, emotional, and nods. Harry breathes as Lupin blinks at his fierceness and opens the case, causing the Dementor to reappear. Harry's hair skates off his scar as he trembles but holds his ground when a silver shadow bursts from his wand, hovering between him and the Dementor. Lupin nods as all the boys sleep except Harry, who studies his parents' photo by candlelight. The camera moves, revealing an old man in a painting scowling in Harry's wand light. Harry follows, stops as the wand's spot finds another dot, stashes the map, extinguishes his wand, and turns into Snape's glare. Snape sneers, lowers his wand, and seeing the map, his eyes glitter as words appear, and he studies Harry with a sadistic half-smile."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Harry, in an effort to disguise himself, has put on Hermione's scarf and Ron's hat. Meanwhile, Fudge, looking around with a nervous demeanor, jerks his head toward the pub, signaling for them to move. As he leads Rosmerta and McGonagall inside, the scene shifts back to Hermione and Ron. Footprints are visible, tracking through the snow and leading into the pub, while Ron and Hermione briefly ripple past a frosted window. Three shrunken heads swing into view, and Rosmerta glances at McGonagall, who responds with a grim nod. Suddenly, the pub doors burst open, revealing Main Street, where Ron and Hermione stand waiting, rubbing their hands together to ward off the chill. As they look down, the camera tilts, revealing footprints in the snow, marking the end of Harry's perspective. At the edge of a rocky outcrop, the footprints abruptly stop, and the sound of sobbing is heard. Ron gently takes Hermione's arm, trying to discourage her from going further, but she persists, stepping into the footprints with her own. She then kneels down and gently draws the cloak away from Harry, who is staring into the mist, his eyes stinging with tears. Butterflies flutter over the expansive green lawn, the giant squid breaks through the last thin glaze of ice on the Black Lake, and the Whomping Willow shakes the water from its branches as the dying sun streams through high windows, casting a fierce amber-red glow on Harry's face as he stands opposite Lupin. Ancient charts drape the walls, and gleaming spheres of spun glass orbit one another silently, while Lupin paces back and forth before a large trunk. Harry shakes his head, and as his eyes wander, Lupin snaps his fingers to bring Harry's attention back, then nods. Crack! The Dementor transforms into a silvery white orb, and Harry glances toward the window at the bloody sun, then looks up into Lupin's eyes, filled with emotion, and nods. Harry takes a deep breath as Lupin blinks at Harry's quiet fierceness and opens the packing case, instantly causing the Dementor to reappear. The hair skates off Harry's scar as he sets his jaw, his hand trembling, and his whole body quivering, but he holds his ground when a huge silver shadow bursts from the end of his wand, hovering protectively between him and the Dementor, which falters. Lupin nods approvingly as all the boys are asleep except for Harry, who lies in bed studying the photo of his parents, barely visible in the flickering light of a guttering candle. The camera begins to move, creeping forward, but it's only an old man in a painting, scowling in the glare of Harry's wand light. Harry makes to follow, then stops as the wand's spot dances across the parchment and finds another dot. Harry quickly stashes the map, extinguishes his wand, and turns into the harsh glare of Snape's wand. A sneer curls the corners of Snape's lips as he eyes Harry coldly, lowering his wand. Seeing the map, Snape's eyes glitter with interest, and to Harry's horror, words begin to appear as Snape studies him with a sadistic half-smile playing on his lips."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In an attempt to conceal his identity, Harry has taken the precaution of donning Hermione's colorful scarf and Ron's distinctive hat. Meanwhile, Fudge, exhibiting a nervous and slightly jittery demeanor, glances around cautiously before sharply jerking his head in the direction of the pub, signaling urgently for them to make their move. As he leads Rosmerta and McGonagall inside the pub, the scene shifts focus back to Hermione and Ron. Footprints are clearly visible, marking a path through the freshly fallen snow and leading into the warmly lit pub, while Ron and Hermione pass briefly in front of a frosted window, their silhouettes rippling momentarily. Three shrunken heads suddenly swing into view, and Rosmerta exchanges a glance with McGonagall, who responds with a grim, resolute nod. Abruptly, the doors of the pub burst open, revealing the bustling Main Street, where Ron and Hermione stand waiting patiently, rubbing their hands together in an effort to ward off the biting chill. As they direct their gaze downward, the camera tilts, revealing the footprints in the snow, which mark the conclusion of Harry's perspective. At the very edge of a rocky outcrop, the footprints come to an unexpected halt, accompanied by the faint sound of sobbing echoing in the distance. Ron gently takes hold of Hermione's arm, attempting to dissuade her from proceeding any further, but she persists determinedly, stepping into the footprints with her own. She then kneels down, gently pulling the cloak away from Harry, who is gazing into the mist, his eyes stinging with unshed tears. Butterflies flutter delicately over the expansive green lawn, while the giant squid breaks through the last remnants of thin ice on the surface of the Black Lake. Simultaneously, the Whomping Willow shakes the droplets of water from its branches as the setting sun streams through the high windows, casting a fierce amber-red glow onto Harry's face as he stands across from Lupin. Ancient charts hang from the walls, and spheres of spun glass gleaming silently orbit one another, while Lupin paces back and forth anxiously in front of a large trunk. Harry shakes his head in apparent confusion, and as his eyes wander distractedly, Lupin snaps his fingers sharply to bring Harry's attention back to the present moment, then nods in understanding. Crack! The Dementor transforms into a brilliant silvery white orb, and Harry glances toward the window at the bloody sun, then meets Lupin's eyes, which are filled with deep emotion, and nods in acknowledgment. Harry takes a deep breath as Lupin blinks in response to Harry's quiet fierceness and opens the packing case, instantly causing the Dementor to reappear menacingly. The hair skates off Harry's scar as he sets his jaw with determination, his hand trembling, and his whole body quivering, yet he stands firm when a large silver shadow erupts from the tip of his wand, hovering protectively between him and the Dementor, which falters momentarily. Lupin nods with approval as all the boys are asleep, except for Harry, who lies in bed intently studying the photograph of his parents, barely visible in the flickering light of a guttering candle. The camera begins to move stealthily forward, but it's only an old man in a painting, scowling irritably in the glare of Harry's wand light. Harry prepares to follow, then abruptly stops as the wand's light dances across the parchment and uncovers another dot. Harry quickly stashes the map away, extinguishes his wand, and turns into the harsh glare of Snape's wand. A sneer curls the corners of Snape's lips as he regards Harry with cold eyes, slightly lowering his wand. Seeing the map, Snape's eyes glitter with keen interest, and to Harry's horror, words materialize as Snape studies him with a sadistic half-smile playing on his lips."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Harry carefully wraps Hermione's scarf around his neck and places Ron's hat on his head, attempting to disguise himself as Fudge nervously scans the surroundings, his eyes darting back and forth before he abruptly jerks his head in the direction of the pub. With a sense of urgency, he leads Rosmerta and McGonagall inside, and the scene shifts back to Hermione and Ron. Footprints are visible in the snow, leading into the pub, while Ron and Hermione briefly ripple past a frosted window, their figures momentarily distorted by the glass. Inside, three shrunken heads swing into view, and Rosmerta turns to McGonagall, who responds with a grim nod. Suddenly, the pub doors burst open, revealing Main Street, where Ron and Hermione stand waiting, rubbing their hands together to ward off the biting cold. As they lower their gaze, the camera tilts downward, revealing footprints in the snow, marking the conclusion of Harry's perspective. At the edge of a rocky outcrop, the footprints abruptly end, and the sound of sobbing fills the air. Ron gently takes Hermione's arm, attempting to dissuade her from proceeding further, but she persists, stepping forward to fill the footprints with her own. She then kneels down, carefully drawing the cloak away from Harry, who gazes into the mist, his eyes stinging with unshed tears. Meanwhile, butterflies flutter over the expansive green lawn, the giant squid breaks through the remaining ice on the Black Lake, and the Whomping Willow shakes water from its branches as the dying sun streams through high windows, casting a fierce amber-red glow on Harry's face as he stands opposite Lupin. The walls are draped with ancient charts, and gleaming spheres of spun glass orbit one another silently as Lupin paces before a large trunk. Harry shakes his head, his eyes wandering until Lupin snaps his fingers, bringing Harry's attention back, and then nods. With a sharp crack, the Dementor transforms into a silvery white orb, and Harry glances toward the window at the blood-red sun before looking up into Lupin's eyes, filled with emotion, and nods. Harry takes a deep breath as Lupin blinks at Harry's quiet determination and opens the packing case, causing the Dementor to reappear instantly. The hair skates off Harry's scar as he sets his jaw, his hand trembling, and his entire body quivering, yet he stands firm as a huge silver shadow erupts from the end of his wand, hovering protectively between him and the Dementor, which falters. Lupin nods approvingly as all the boys are asleep except for Harry, who lies in bed, studying the photo of his parents, barely visible in the flickering light of a guttering candle. The camera begins to move, creeping forward, but it's only an old man in a painting, scowling in the glare of Harry's wand light. Harry makes to follow, then hesitates as the wand's light dances across the parchment and discovers another dot. He quickly stashes the map, extinguishes his wand, and turns to face the harsh glare of Snape's wand. A sneer twists the corners of Snape's lips as he regards Harry coldly, lowering his wand. Upon seeing the map, Snape's eyes glitter with interest, and to Harry's horror, words begin to appear as Snape studies him with a sadistic half-smile playing on his lips."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Harry disguises himself with Hermione's scarf and Ron's hat as Fudge nervously gestures toward the pub, leading Rosmerta and McGonagall inside. Meanwhile, Ron and Hermione's footprints appear in the snow outside the pub, briefly visible through a frosted window. Inside, Rosmerta exchanges a grim nod with McGonagall. The pub doors swing open to reveal Ron and Hermione on Main Street, rubbing their hands against the cold. They notice footprints in the snow, marking the end of Harry's perspective. At a rocky outcrop, the footprints stop, and sobs are heard. Ron tries to hold Hermione back, but she continues, filling the footprints with her own before kneeling to reveal Harry, who is tearful and staring into the mist.\n\nAs the scene shifts, butterflies flutter over the lawn, the giant squid breaks through the ice on the Black Lake, and the Whomping Willow shakes off water as the setting sun casts an amber-red glow on Harry's face. He stands opposite Lupin in a room adorned with ancient charts and orbiting glass spheres. Lupin paces before a large trunk, and after snapping Harry back to attention, he nods. With a crack, the Dementor transforms into a silvery orb. Harry, emotional, nods back at Lupin, then takes a breath as Lupin opens the trunk, releasing the Dementor again. Despite trembling, Harry stands firm, casting a huge silver shadow from his wand that hovers between him and the Dementor, causing it to falter. Lupin nods approvingly.\n\nLater, as the other boys sleep, Harry lies in bed, studying a photo of his parents by candlelight. The camera moves forward, revealing an old man in a painting scowling in the wand's glare. Harry prepares to follow but stops when the wand's light reveals another dot on the Marauder's Map. He quickly stashes the map, extinguishes his wand, and turns to face Snape's harsh glare. Snape lowers his wand, sneering as he notices the map. To Harry's horror, words begin to appear on the map as Snape studies him with a sadistic half-smile."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Harry has donned Hermione's scarf, an item she knitted over the summer when house colors were all the rage, and Ron's hat, a gift from his mother for cold winter nights, to disguise himself as Fudge, the current Minister of Magic known for his anxious demeanor, looks around nervously and then jerks his head toward the pub, The Hog's Head, notorious among locals for its secretive meetings. As he leads Rosmerta, the pub owner known for her charm and intelligence, and McGonagall, the stern Deputy Headmistress of Hogwarts, inside, we cut back to Hermione and Ron. Footprints track through the snow into the pub, as Ron and Hermione ripple briefly past a frosted window, signaling their movement while under the Invisibility Cloak. Three shrunken heads, a curious decoration from the Caribbean, swing into view while Rosmerta looks to McGonagall, who nods grimly. Suddenly, the pub doors fly open, revealing Main Street of Hogsmeade, a village unique for being entirely magical, where Ron and Hermione wait, rubbing their hands against the chill. As they look down, the camera tilts and footprints appear in the snow, marking the end of Harry's point of view. At the end of a rocky outcrop, notorious for its steep edges, the footprints end and sobs are heard. Ron takes Hermione's arm to discourage her from going further, but she does, filling the footprints with her own, then kneeling and gently drawing the cloak from Harry, who stares into the mist with eyes stinging with tears. Butterflies flutter over the great green lawn of Hogwarts, the magical school where they all study, the giant squid breaks through the last glaze of ice on the Black Lake, a deep body of water teeming with magical creatures, and the Whomping Willow, a tree planted decades ago to guard a secret, shakes the water from its branches as the dying sun streams through high windows of the castle, painting Harry's face a fierce amber-red as he stands opposite Lupin, the newly appointed Defense Against the Dark Arts professor. Ancient charts, detailing celestial movements and magical territories, drape the walls while gleaming spheres of spun glass, enchantments for teaching astronomy, orbit one another silently, and Lupin paces before a large trunk, containing a Boggart. Harry shakes his head, and as his eyes wander, Lupin snaps his fingers, a habit developed from years of teaching, to bring his attention back, then nods. Crack! The Dementor, a creature used by the Ministry to guard Azkaban, mutates into a silvery white orb, responding to Harry's Patronus attempt, and Harry glances toward the window at the bloody sun, then looks up into Lupin's eyes, emotional, and nods. Harry takes a breath as Lupin blinks at Harry's quiet fierceness and opens the packing case, instantly causing the Dementor to appear again. The hair skates off Harry's scar, a remnant of a deadly curse, as he sets his jaw, his hand trembling, and his whole body trembling, but he holds his ground when a huge silver shadow, his Patronus, bursts from the end of his wand, hovering between him and the Dementor, which falters. Lupin nods as all the boys in Gryffindor Tower are asleep except Harry, who lies in bed studying the photo of his parents, James and Lily Potter, barely visible in the fluttering light of a guttering candle. The camera begins to move, creeping forward, but it's only an old man in a painting, scowling in the glare of Harry's wand light. Harry makes to follow, then stops as the wand's spot dances across the Marauder's Map and finds another dot. Harry stashes the map, extinguishes his wand, and turns into the harsh glare of Snape's wand, the Potions Master with a long-standing grudge against Harry's father. A sneer curdles the corners of Snape's lips as he eyes Harry coldly, lowering his wand. Seeing the map, a magical item created by Harry's father and his friends, Snape's eyes glitter, and to Harry's horror, words begin to appear as Snape studies him with a sadistic half-smile on his lips."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Harry has donned Hermione's scarf and Ron's hat to disguise himself as Fudge looks around nervously and then jerks his head toward the pub. As he leads Rosmerta and McGonagall inside we cut back to Hermione and Ron. Footprints track through the snow into the pub as Ron and Hermione ripple briefly past a frosted window. Three shrunken heads swing into view while Rosmerta looks to McGonagall who nods grimly. Suddenly the pub doors fly open revealing Main Street where Ron and Hermione wait rubbing their hands against the chill. As they look down the camera tilts and footprints appear in the snow marking the end of Harry's point of view. At the end of a rocky outcrop the footprints end and sobs are heard. Ron takes Hermione's arm to discourage her from going further but she does filling the footprints with her own then kneeling and gently drawing the cloak from Harry who stares into the mist with eyes stinging with tears. Butterflies flutter over the great green lawn. the giant squid breaks through the last glaze of ice on the Black Lake and the Whomping Willow shakes the water from its branches as the dying sun streams through high windows painting Harry's face a fierce amberred as he stands opposite Lupin. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Ancient charts drape the walls while gleaming spheres of spun glass orbit one another silently and Lupin paces before a large trunk. Harry shakes his head and as his eyes wander Lupin snaps his fingers to bring his attention back then nods Crack. The Dementor mutates into a silvery white orb and Harry glances toward the window at the bloody sun then looks up into Lupin's eyes emotional and nods. Harry takes a breath as Lupin blinks at Harry's quiet fierceness and opens the packing case instantly causing the Dementor to appear again. The hair skates off Harry's scar as he sets his jaw his hand trembling and his whole body trembling but he holds his ground when a huge silver shadow bursts from the end of his wand hovering between him and the Dementor which falters. Lupin nods as all the boys are asleep except Harry who lies in bed studying the photo of his parents barely visible in the fluttering light of a guttering candle. The camera begins to move creeping forward but it is only an old man in a painting scowling in the glare of Harry's wand light. Harry makes to follow then stops as the wand's spot dances across the parchment and finds another dot. Harry stashes the map extinguishes his wand and turns into the harsh glare of Snape's wand. A sneer curdles the corners of Snape's lips as he eyes Harry coldly lowering his wand. Seeing the map Snape's eyes glitter and to Harry's horror words begin to appear as Snape studies him with a sadistic halfsmile on his lips."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Harry has donned Hermione's scarf and Ron's hat to disguise himself as Fudge looks around nervously and then jerks his head toward the pub. As he leads Rosmerta and McGonagall inside we cut back to Hermione and Ron. Footprints track through the snow into the pub as Ron and Hermione ripple briefly past a frosted window. Three shrunken heads swing into view while Rosmerta looks to McGonagall who nods grimly. Suddenly the pub doors fly open revealing Main Street where Ron and Hermione wait rubbing their hands against the chill. As they look down the camera tilts and footprints appear in the snow marking the end of Harry's point of view. At the end of a rocky outcrop the footprints end and sobs are heard. Ron takes Hermione's arm to discourage her from going further but she does filling the footprints with her own then kneeling and gently drawing the cloak from Harry who stares into the mist with eyes stinging with tears. Butterflies flutter over the great green lawn. the giant squid breaks through the last glaze of ice on the Black Lake and the Whomping Willow shakes the water from its branches as the dying sun streams through high windows painting Harry's face a fierce amberred as he stands opposite Lupin. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Ancient charts drape the walls while gleaming spheres of spun glass orbit one another silently and Lupin paces before a large trunk. Harry shakes his head and as his eyes wander Lupin snaps his fingers to bring his attention back then nods Crack. The Dementor mutates into a silvery white orb and Harry glances toward the window at the bloody sun then looks up into Lupin's eyes emotional and nods. Harry takes a breath as Lupin blinks at Harry's quiet fierceness and opens the packing case instantly causing the Dementor to appear again. The hair skates off Harry's scar as he sets his jaw his hand trembling and his whole body trembling but he holds his ground when a huge silver shadow bursts from the end of his wand hovering between him and the Dementor which falters. Lupin nods as all the boys are asleep except Harry who lies in bed studying the photo of his parents barely visible in the fluttering light of a guttering candle. The camera begins to move creeping forward but it is only an old man in a painting scowling in the glare of Harry's wand light. Harry makes to follow then stops as the wand's spot dances across the parchment and finds another dot. Harry stashes the map extinguishes his wand and turns into the harsh glare of Snape's wand. A sneer curdles the corners of Snape's lips as he eyes Harry coldly lowering his wand. Seeing the map Snape's eyes glitter and to Harry's horror words begin to appear as Snape studies him with a sadistic halfsmile on his lips."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Harry has donned Hermione's scarf and Ron's hat to disguise himself as Fudge looks around nervously and then jerks his head toward the pub. As he leads Rosmerta and McGonagall inside we cut back to Hermione and Ron. Footprints track through the snow into the pub as Ron and Hermione ripple briefly past a frosted window. Three shrunken heads swing into view while Rosmerta looks to McGonagall who nods grimly. Suddenly the pub doors fly open revealing Main Street where Ron and Hermione wait rubbing their hands against the chill. Lupin nods as all the boys are asleep except Harry who lies in bed studying the photo of his parents barely visible in the fluttering light of a guttering candle. The camera begins to move creeping forward but it is only an old man in a painting scowling in the glare of Harry's wand light. Harry makes to follow then stops as the wand's spot dances across the parchment and finds another dot. Harry stashes the map extinguishes his wand and turns into the harsh glare of Snape's wand. A sneer curdles the corners of Snape's lips as he eyes Harry coldly lowering his wand. Seeing the map Snape's eyes glitter and to Harry's horror words begin to appear as Snape studies him with a sadistic halfsmile on his lips."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Harry has donned Hermione's scarf and Ron's hat to disguise himself as Fudge looks around nervously and then jerks his head toward the pub. As he leads Rosmerta and McGonagall inside we cut back to Hermione and Ron. Harry stashes the map extinguishes his wand and turns into the harsh glare of Snape's wand. A sneer curdles the corners of Snape's lips as he eyes Harry coldly lowering his wand. Seeing the map Snape's eyes glitter and to Harry's horror words begin to appear as Snape studies him with a sadistic halfsmile on his lips."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Sean has borrowed Luna's umbrella and Neville's glove to imitate himself as Umbridge observes quietly and then twitches her foot toward the museum. As she guides Filch and Sprout outside, we jump back to Luna and Neville. Shadows slide through the rain into the museum, as Neville and Luna shimmer momentarily past a stained sculpture. Five floating bubbles drift into sight while Filch turns to Sprout, who shrugs solemnly. Abruptly, the museum gates slam shut, unveiling Cherry Lane, where Neville and Luna stand, tapping their feet against the breeze. As they glance downward, the lens pans and shadows emerge in the rain, indicating the end of Sean's perspective. At the edge of a sandy ridge, the shadows cease, and whispers are audible. Neville grips Luna's shoulder to deter her from advancing, but she does, replacing the shadows with her own, then crouching and tenderly removing the jacket from Sean, who gazes into the fog with eyes burning with sorrow. Dragonflies glide over the vast blue field, the giant turtle nudges through the final crust of ice on the Silver Pond, and the Dancing Pine shakes the dew from its leaves as the setting moon streams through tall arches, dousing Sean's face in a vivid purple-pink as he stands across from Hagrid. Old scrolls cover the floors while shiny cubes of molded metal revolve around each other soundlessly, and Hagrid strolls before a large basket. Sean nods, and as his gaze drifts, Hagrid claps his hands to regain his focus, then signals. Boom! The Banshee transforms into a sparkling orange sphere, and Sean peers toward the door at the glowing moon, then gazes up into Hagrid's eyes, touched, and signals. Sean inhales as Hagrid winks at Sean's calm intensity and unseals the chest, promptly urging the Banshee to appear once more. The feather slides off Sean's tattoo as he hardens his stare, his fingers quivering, and his entire form shivering, but he stands firm when a massive golden shape erupts from the tip of his staff, hovering between him and the Banshee, which stumbles. Hagrid signals as all the girls are awake except Sean, who sits in the chair examining the painting of his relatives, barely visible in the flickering glow of a dying lantern. The lens starts to pan, advancing backward, but it's only a young woman in a sketch, grinning in the shimmer of Sean's staff glow. Sean prepares to leave, then pauses as the staff's beam skips across the fabric and uncovers another sketch. Sean hides the blueprint, dims his staff, and rotates into the sharp glow of Malfoy's staff. A smirk twists the edges of Malfoy's mouth as he watches Sean icily, raising his staff. Spotting the blueprint, Malfoy's eyes flash, and to Sean's dismay, images start to form as Malfoy scrutinizes him with a mischievous grin on his lips."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Harry disguises himself with Hermione's scarf and Ron's hat as Fudge nervously heads into a pub with Rosmerta and McGonagall. Outside, Ron and Hermione await, rubbing their hands against the cold. Hermione follows footprints into the snow, revealing Harry hidden under an invisibility cloak. Emotional and tearful, he gazes into the mist. Meanwhile, the Whomping Willow and the Black Lake set an atmospheric scene as Harry meets with Lupin, practicing conjuring a Patronus against a Dementor. Harry's fierce determination impresses Lupin as a silver shadow wards off the creature. Later, in bed, Harry studies a photo of his parents by candlelight. His tranquility is interrupted by Snape, who catches him with the Marauder's Map. Words appear on the map under Snape's scrutinizing gaze, as he observes Harry with a sinister smile."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Seeing the map Snape's eyes glitter and to Harry's horror words begin to appear as Snape studies him with a sadistic halfsmile on his lips A sneer curdles the corners of Snape's lips as he eyes Harry coldly lowering his wand  Harry stashes the map extinguishes his wand and turns into the harsh glare of Snape's wand  Harry makes to follow then stops as the wand's spot dances across the parchment and finds another dot  The camera begins to move creeping forward but it's only an old man in a painting scowling in the glare of Harry's wand light  Lupin nods as all the boys are asleep except Harry who lies in bed studying the photo of his parents barely visible in the fluttering light of a guttering candle  The hair skates off Harry's scar as he sets his jaw his hand trembling and his whole body trembling but he holds his ground when a huge silver shadow bursts from the end of his wand hovering between him and the Dementor which falters  Harry takes a breath as Lupin blinks at Harry's quiet fierceness and opens the packing case instantly causing the Dementor to appear again  The Dementor mutates into a silvery white orb and Harry glances toward the window at the bloody sun then looks up into Lupin's eyes emotional and nods  Harry shakes his head and as his eyes wander Lupin snaps his fingers to bring his attention back then nods Crack  Ancient charts drape the walls while gleaming spheres of spun glass orbit one another silently and Lupin paces before a large trunk  the giant squid breaks through the last glaze of ice on the Black Lake and the Whomping Willow shakes the water from its branches as the dying sun streams through high windows painting Harry's face a fierce amberred as he stands opposite Lupin  Butterflies flutter over the great green lawn  Ron takes Hermione's arm to discourage her from going further but she does filling the footprints with her own then kneeling and gently drawing the cloak from Harry who stares into the mist with eyes stinging with tears  At the end of a rocky outcrop the footprints end and sobs are heard  As they look down the camera tilts and footprints appear in the snow marking the end of Harry's point of view  Suddenly the pub doors fly open revealing Main Street where Ron and Hermione wait rubbing their hands against the chill  Three shrunken heads swing into view while Rosmerta looks to McGonagall who nods grimly  Footprints track through the snow into the pub as Ron and Hermione ripple briefly past a frosted window  As he leads Rosmerta and McGonagall inside we cut back to Hermione and Ron  Harry has donned Hermione's scarf and Ron's hat to disguise himself as Fudge looks around nervously and then jerks his head toward the pub "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "As he leads Rosmerta and McGonagall inside we cut back to Hermione and Ron Harry has donned Hermione's scarf and Ron's hat to disguise himself as Fudge looks around nervously and then jerks his head toward the pub Three shrunken heads swing into view while Rosmerta looks to McGonagall who nods grimly Footprints track through the snow into the pub as Ron and Hermione ripple briefly past a frosted window As they look down the camera tilts and footprints appear in the snow marking the end of Harry's point of view Suddenly the pub doors fly open revealing Main Street where Ron and Hermione wait rubbing their hands against the chill Ron takes Hermione's arm to discourage her from going further but she does filling the footprints with her own then kneeling and gently drawing the cloak from Harry who stares into the mist with eyes stinging with tears At the end of a rocky outcrop the footprints end and sobs are heard the giant squid breaks through the last glaze of ice on the Black Lake and the Whomping Willow shakes the water from its branches as the dying sun streams through high windows painting Harry's face a fierce amberred as he stands opposite Lupin Butterflies flutter over the great green lawn Harry shakes his head and as his eyes wander Lupin snaps his fingers to bring his attention back then nods Crack Ancient charts drape the walls while gleaming spheres of spun glass orbit one another silently and Lupin paces before a large trunk Harry takes a breath as Lupin blinks at Harry's quiet fierceness and opens the packing case instantly causing the Dementor to appear again The Dementor mutates into a silvery white orb and Harry glances toward the window at the bloody sun then looks up into Lupin's eyes emotional and nods Lupin nods as all the boys are asleep except Harry who lies in bed studying the photo of his parents barely visible in the fluttering light of a guttering candle The hair skates off Harry's scar as he sets his jaw his hand trembling and his whole body trembling but he holds his ground when a huge silver shadow bursts from the end of his wand hovering between him and the Dementor which falters Harry makes to follow then stops as the wand's spot dances across the parchment and finds another dot The camera begins to move creeping forward but it is only an old man in a painting scowling in the glare of Harry's wand light A sneer curdles the corners of Snape's lips as he eyes Harry coldly lowering his wand Harry stashes the map extinguishes his wand and turns into the harsh glare of Snape's wand Seeing the map Snape's eyes glitter and to Harry's horror words begin to appear as Snape studies him with a sadistic halfsmile on his lips"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Harry shakes his head and as his eyes wander Lupin snaps his fingers to bring his attention back then nods Crack  The Dementor mutates into a silvery white orb and Harry glances toward the window at the bloody sun then looks up into Lupin's eyes emotional and nods  Harry takes a breath as Lupin blinks at Harry's quiet fierceness and opens the packing case instantly causing the Dementor to appear again  The hair skates off Harry's scar as he sets his jaw his hand trembling and his whole body trembling but he holds his ground when a huge silver shadow bursts from the end of his wand hovering between him and the Dementor which falters  Lupin nods as all the boys are asleep except Harry who lies in bed studying the photo of his parents barely visible in the fluttering light of a guttering candle  The camera begins to move creeping forward but it's only an old man in a painting scowling in the glare of Harry's wand light  Harry makes to follow then stops as the wand's spot dances across the parchment and finds another dot  Harry stashes the map extinguishes his wand and turns into the harsh glare of Snape's wand  A sneer curdles the corners of Snape's lips as he eyes Harry coldly lowering his wand  Seeing the map Snape's eyes glitter and to Harry's horror words begin to appear as Snape studies him with a sadistic halfsmile on his lips Harry has donned Hermione's scarf and Ron's hat to disguise himself as Fudge looks around nervously and then jerks his head toward the pub  As he leads Rosmerta and McGonagall inside we cut back to Hermione and Ron  Footprints track through the snow into the pub as Ron and Hermione ripple briefly past a frosted window  Three shrunken heads swing into view while Rosmerta looks to McGonagall who nods grimly  Suddenly the pub doors fly open revealing Main Street where Ron and Hermione wait rubbing their hands against the chill  As they look down the camera tilts and footprints appear in the snow marking the end of Harry's point of view  At the end of a rocky outcrop the footprints end and sobs are heard  Ron takes Hermione's arm to discourage her from going further but she does filling the footprints with her own then kneeling and gently drawing the cloak from Harry who stares into the mist with eyes stinging with tears  Butterflies flutter over the great green lawn  the giant squid breaks through the last glaze of ice on the Black Lake and the Whomping Willow shakes the water from its branches as the dying sun streams through high windows painting Harry's face a fierce amberred as he stands opposite Lupin  Ancient charts drape the walls while gleaming spheres of spun glass orbit one another silently and Lupin paces before a large trunk "
        }
      ]
    }
  ]
}