{
  "ground_truth": "Snape turns and sees Lupin standing in the shadows. Lupin takes the parchment, which now displays a rather unflattering caricature of Snape and a pair of potions. Harry walks aside a fuming Lupin, who grips the map fiercely. Harry walks silently and lingers briefly in the doorway, absently eyeing the waxing moon that glimmers beyond the window, then starts to turn away but stops. Lupin hesitates ever-so-slightly, then returns to his papers. As Trelawney eyes Harry's crystal, Hermione rolls her eyes. Stung, Hermione starts to reply but seems incapable of a single word. Rising gracelessly, she exits, knocking her crystal ball to the floor. Harry watches curiously as the ball rolls slowly out the doorway. Ron stops, glances at Harry, then moves off. Harry watches him go, along with the others, then spies Hermione's crystal ball lying on the landing. Harry sets Hermione's crystal back on its stand and starts to go, when the smoke within the crystal suddenly darkens. Leaning close, Harry watches the shape that appears. It is unmistakable: Sirius Black. Just then, a shadow crawls the glossy surface of the crystal, and a hand snatches Harry's shoulder. He wheels, finds, and Harry stiffens. When it rises, she blinks, eyes the hand that lies upon Harry's shoulder—her hand. Harry shakes his head. Clearly unsettled by his encounter with Trelawney, Harry hastens down the stairs, and we fade out. SWOOK! SWOOK! We fade up on a moving POV of a crow as it glides to the flock circling the feet of a pot-bellied man, the Executioner, sitting in the courtyard. As he sharpens his axe—SWOOK! SWOOK!—we cut to Harry, Ron, and Hermione hurrying past. The Executioner looks up, and we see Harry leading Ron and Hermione toward Hagrid's hut. She and Ron look and see Malfoy, along with Crabbe and Goyle, lurking within a grouping of monolithic menhirs, binoculars in hand, spying on Hagrid, who stands in the pumpkin patch, tossing dead ferrets to Buckbeak. Malfoy stumbles back against a tree, cross-eyed with fear as Hermione jabs the tip of her wand under his nose, when she turns, surprised Ron's spoken to her. Hermione nods, then—SMACK!—quick as lightning, lands a looping right to Malfoy's jaw, putting him flat on his back. Stunned, he leaps to his feet and runs, Crabbe and Goyle huffing and puffing behind. The trio makes their way down the slope and past Buckbeak, chewing on a ferret with idle satisfaction. Hagrid stands by the window watching Buckbeak. Harry and Ron sit, and the trio slips silently into a stand of trees. Beyond them, Hagrid's hut glimmers desolately in the dying sun. High in the clock tower, a bell begins to toll.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Snape rotates and observes Lupin standing in the shadows. Lupin takes the parchment, which now shows a rather unflattering caricature of Snape and a pair of potions. Harry strides alongside a fuming Lupin, who grasps the map fiercely. Harry strides silently and pauses briefly in the doorway, absently eyeing the waxing moon that glimmers beyond the window, then begins to turn away but halts. Lupin hesitates ever-so-slightly, then returns to his papers. As Trelawney eyes Harry's crystal, Hermione rolls her eyes. Stung, Hermione begins to respond but seems incapable of a single word. Rising awkwardly, she exits, knocking her crystal ball to the floor. Harry observes curiously as the ball rolls slowly out the doorway. Ron pauses, glances at Harry, then moves away. Harry observes him depart, along with the others, then spies Hermione's crystal ball lying on the landing. Harry places Hermione's crystal back on its stand and begins to go, when the smoke within the crystal suddenly darkens. Leaning near, Harry observes the form that emerges. It is unmistakable: Sirius Black. Just then, a shadow traverses the glossy surface of the crystal, and a hand seizes Harry's shoulder. He wheels, finds, and Harry stiffens. When it ascends, she blinks, eyes the hand that lies upon Harry's shoulder—her hand. Harry shakes his head. Clearly unsettled by his encounter with Trelawney, Harry hastens down the stairs, and we fade out. SWOOK! SWOOK! We fade up on a moving POV of a crow as it glides to the flock circling the feet of a pot-bellied man, the Executioner, sitting in the courtyard. As he sharpens his axe—SWOOK! SWOOK!—we cut to Harry, Ron, and Hermione hurrying past. The Executioner looks up, and we see Harry leading Ron and Hermione toward Hagrid's hut. She and Ron glance and see Malfoy, along with Crabbe and Goyle, lurking within a cluster of monolithic menhirs, binoculars in hand, spying on Hagrid, who stands in the pumpkin patch, tossing dead ferrets to Buckbeak. Malfoy stumbles back against a tree, cross-eyed with fear as Hermione prods the tip of her wand under his nose, when she turns, surprised Ron's spoken to her. Hermione nods, then—SMACK!—quick as lightning, lands a looping right to Malfoy's jaw, putting him flat on his back. Stunned, he springs to his feet and runs, Crabbe and Goyle huffing and puffing behind. The trio makes their way down the slope and past Buckbeak, munching on a ferret with idle satisfaction. Hagrid stands by the window watching Buckbeak. Harry and Ron sit, and the trio slips silently into a stand of trees. Beyond them, Hagrid's hut glimmers desolately in the dying sun. High in the clock tower, a bell begins to toll."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Snape turns and sees Lupin standing in the shadows. The parchment is taken by Lupin, and it now displays a rather unflattering caricature of Snape and a pair of potions. Harry walks aside a fuming Lupin, who grips the map fiercely. The waxing moon that glimmers beyond the window is eyed absently by Harry as he lingers briefly in the doorway, then starts to turn away but stops. Lupin hesitates ever-so-slightly, then returns to his papers. As Trelawney eyes Harry's crystal, Hermione rolls her eyes. Stung, a reply is started by Hermione but she seems incapable of a single word. Rising gracelessly, she exits, and the crystal ball is knocked to the floor by her. The ball is watched curiously by Harry as it rolls slowly out the doorway. Ron stops, glances at Harry, then moves off. He is watched by Harry as he goes, along with the others, then Hermione's crystal ball lying on the landing is spied by Harry. Hermione's crystal is set back on its stand by Harry, and as he starts to go, the smoke within the crystal is suddenly darkened. Leaning close, the shape that appears is watched by Harry. It is unmistakable: Sirius Black. Just then, the glossy surface of the crystal is crawled by a shadow, and Harry's shoulder is snatched by a hand. He wheels, finds, and stiffens. When it rises, she blinks, eyes the hand that lies upon Harry's shoulder—her hand. He shakes his head. Clearly unsettled by his encounter with Trelawney, the stairs are hastened down by Harry, and we fade out. SWOOK! SWOOK! We fade up on a moving POV of a crow as it glides to the flock circling the feet of the Executioner, a pot-bellied man, sitting in the courtyard. His axe is sharpened by him—SWOOK! SWOOK!—and we cut to Harry, Ron, and Hermione hurrying past. The Executioner looks up, and Harry, Ron, and Hermione are seen by us as he leads them toward Hagrid's hut. Malfoy, along with Crabbe and Goyle, is spied on by her and Ron as they look and see them lurking within a grouping of monolithic menhirs, binoculars in hand, spying on Hagrid, who tosses dead ferrets to Buckbeak while standing in the pumpkin patch. Malfoy stumbles back against a tree, cross-eyed with fear as the tip of her wand is jabbed under his nose by Hermione, when she turns, surprised Ron's spoken to her. Hermione nods, then—SMACK!—a looping right is landed quick as lightning to Malfoy's jaw by her, putting him flat on his back. Stunned, he leaps to his feet and runs, Crabbe and Goyle huffing and puffing behind. The way is made by the trio down the slope and past Buckbeak, chewing on a ferret with idle satisfaction. Hagrid stands by the window watching Buckbeak. Harry and Ron sit, and the trio slips silently into a stand of trees. Beyond them, Hagrid's hut is seen glimmering desolately in the dying sun. High in the clock tower, a bell begins to toll."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Snape turns and sees Lupin in the shadows. Lupin takes the parchment, now showing an unflattering caricature of Snape and potions. Harry walks with a fuming Lupin gripping the map. Harry lingers in the doorway, glancing at the waxing moon before leaving. Lupin hesitates but returns to his papers. As Trelawney eyes Harry's crystal, Hermione rolls her eyes, then exits, knocking her crystal ball to the floor. Harry watches the ball roll out and then finds Hermione's crystal ball on the landing. He sets it back on its stand, and the smoke inside darkens, revealing Sirius Black. Suddenly, a shadow crosses the crystal, and a hand grips Harry's shoulder—it's Trelawney's. Shaken, Harry rushes downstairs, fading out. SWOOK! SWOOK! We cut to a moving POV of a crow joining others around the Executioner sharpening his axe. Harry, Ron, and Hermione hurry past him toward Hagrid's hut. Malfoy, Crabbe, and Goyle spy on Hagrid in the pumpkin patch. Hermione jabs her wand at Malfoy, then quickly punches him. Stunned, he runs off with Crabbe and Goyle. The trio heads down the slope past Buckbeak, eating a ferret. Hagrid watches from the window, and the trio slips into the trees. Hagrid's hut glimmers in the setting sun as a bell tolls from the clock tower."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Snape turns and sees Lupin in the shadows. Lupin holds the parchment, showing an unflattering Snape caricature and potions. Harry walks beside a fuming Lupin, gripping the map fiercely. Harry lingers, eyeing the waxing moon, then turns back. Lupin hesitates, returning to his papers. Trelawney glances at Harry's crystal; Hermione rolls her eyes, stung, and exits, dropping her crystal ball, which rolls out. Ron glances at Harry and moves off. Harry sets Hermione's crystal back, and the smoke inside darkens, revealing Sirius Black. A shadow crawls over the crystal as a hand grips Harry's shoulder—his own hand. Unsettled by Trelawney, he hurries down the stairs. We then see a crow gliding to a flock near the Executioner sharpening his axe. Harry, Ron, and Hermione hurry past him. They see Malfoy, Crabbe, and Goyle spying on Hagrid, tossing ferrets to Buckbeak. Hermione confronts Malfoy, surprising Ron, and punches Malfoy, who runs with Crabbe and Goyle. The trio moves past Buckbeak, chewing on a ferret, while Hagrid watches. They slip into trees, and Hagrid's hut glimmers in the sunset. A clock tower bell begins to toll."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Severus Snape, with a characteristic swish of his robes, turns around only to find Remus Lupin quietly standing in the shadows, casting a thoughtful gaze. In a slow, deliberate motion, Lupin takes hold of the old parchment, which has transformed to display an unflattering caricature of Snape alongside a pair of potions. As Harry walks alongside Lupin, who is visibly fuming and gripping the map with a fierce intensity, he bears a silence weighted with thought. Harry, seemingly lost in his own world, lingers for a brief moment in the doorway, his eyes absently drawn to the waxing moon that is shimmering beyond the nearby window. He begins to turn away but hesitates, stopping in his tracks. Lupin, with the slightest moment of hesitation, eventually returns his attention to the papers before him. Meanwhile, as Professor Trelawney peers intently into Harry's crystal ball, Hermione's eyes roll in disbelief. Stung by the situation, Hermione attempts to retort but finds herself unable to utter even a single word. Rising rather gracelessly, she leaves the room, knocking her crystal ball to the floor in the process. Harry watches with a curious glance as the ball rolls slowly out through the doorway. Ron, noticing the event, stops momentarily, throws a glance at Harry, then moves on. As Harry watches Ron and others leave, his eyes catch sight of Hermione's crystal ball lying on the landing. With a considerate gesture, Harry sets Hermione's crystal back onto its stand. Just as he is about to leave, the smoke inside the crystal unexpectedly darkens. Leaning in closer, Harry observes the shape that forms before his eyes, and it is unmistakably Sirius Black. Suddenly, a shadow slides across the glossy surface of the crystal, and a hand abruptly grabs Harry by the shoulder. He wheels around, discovering the source, and stiffens. When the hand rises, she blinks and finds herself staring at her own hand resting on Harry's shoulder—Professor Trelawney's hand. Harry shakes his head in what seems like a bid to clear his thoughts. Clearly unsettled by his encounter and Trelawney's peculiar behavior, Harry hastens down the stairs, and the scene gradually fades out. SWOOK! SWOOK! We fade back in to the moving point of view of a crow, gliding effortlessly to join its flock as they circle around the feet of a pot-bellied man, the Executioner, who is sitting introspectively in the courtyard. As he methodically sharpens his axe—SWOOK! SWOOK!—the scene shifts to show Harry, Ron, and Hermione hurrying past with brisk, purposeful strides. The Executioner glances up, and we witness Harry leading Ron and Hermione with determined steps toward Hagrid's hut. Hermione and Ron pause to look and see Draco Malfoy, accompanied by Crabbe and Goyle, lurking ominously within a cluster of towering monolithic menhirs. Binoculars in hand, they are spying on Hagrid, who stands in his pumpkin patch, tossing dead ferrets to Buckbeak. In a flurry of motion, Malfoy stumbles back against a tree, cross-eyed and filled with fear as Hermione sharply jabs the tip of her wand under his nose. Surprised by Ron's words, she turns, nods, and—SMACK!—as quick as lightning, delivers a powerful looping right punch to Malfoy's jaw, knocking him flat on his back. Stunned and disoriented, Malfoy leaps to his feet and takes flight, with Crabbe and Goyle huffing and puffing as they follow behind him. The trio, unperturbed, makes their way down the gentle slope and moves past Buckbeak, who is lazily chewing on a ferret with satisfied indifference. Watching Buckbeak with a protective eye, Hagrid stands by his window. Harry and Ron take their seats, and the trio quietly slips into a stand of trees, leaving Hagrid's hut to glimmer desolately in the fading light of the dying sun. At that elevated moment, high up in the clock tower, a solemn bell begins to toll, marking the passage of time in the evening air."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Severus Snape, with his robes making their characteristic swishing sound, turns around in a swift motion only to find Remus Lupin quietly standing hidden in the shadows, casting a gaze full of contemplation. In a slow and deliberate motion, Lupin takes hold of the old, worn parchment, which has undergone a transformation to reveal an unflattering caricature of Snape next to a pair of potions. As Harry walks alongside Lupin, who is visibly fuming and gripping the map with a fierce intensity born of frustration, he bears a silence heavy with thought and reflection. Harry, seemingly lost in his own world, lingers for a brief moment in the doorway, his eyes absently drawn to the waxing moon shimmering beyond the nearby window. He begins to turn away but hesitates, stopping in his tracks with uncertainty. Lupin, after the slightest moment of hesitation, eventually returns his attention to the stack of papers lying before him. Meanwhile, as Professor Trelawney peers intensely into Harry's crystal ball with great concentration, Hermione rolls her eyes in disbelief. Stung by the situation, Hermione attempts to retort, but she finds herself unable to utter even a single word. Rising rather gracelessly and with frustration, she leaves the room, inadvertently knocking her crystal ball to the floor in the process. Harry watches with a curious glance as the ball rolls slowly and deliberately out through the open doorway. Ron, noticing the event unfold, stops momentarily, throws a quick glance at Harry, then proceeds to move on. As Harry watches Ron and others leave, his eyes catch sight of Hermione's crystal ball lying on the landing. With a considerate gesture, Harry sets Hermione's crystal back onto its rightful stand. Just as he is about to leave, the smoke inside the crystal unexpectedly darkens. Leaning in closer, Harry observes the shape that forms before his eyes, and it is unmistakably Sirius Black. Suddenly, a shadow slides across the glossy surface of the crystal, and a hand abruptly grabs Harry by the shoulder. He wheels around in a swift motion, discovering the source, and stiffens. When the hand rises, she blinks and finds herself staring at her own hand resting on Harry's shoulder—Professor Trelawney's hand. Harry shakes his head in what seems like a bid to clear his thoughts. Clearly unsettled by both his encounter and Trelawney's peculiar behavior, Harry hastens down the stairs, and the scene gradually fades out, leaving behind a sense of mystery. SWOOK! SWOOK! We fade back in to the moving point of view of a crow, gliding effortlessly through the air to join its flock as they circle around the feet of a pot-bellied man, the Executioner, who is sitting introspectively in the courtyard. As he methodically sharpens his axe—SWOOK! SWOOK!—the scene shifts to show Harry, Ron, and Hermione hurrying past with brisk, purposeful strides. The Executioner glances up, and we witness Harry leading Ron and Hermione with determined steps toward Hagrid's hut. Hermione and Ron pause to look and see Draco Malfoy, accompanied by Crabbe and Goyle, lurking ominously within a cluster of towering monolithic menhirs. Binoculars in hand, they are spying on Hagrid, who stands in his pumpkin patch, tossing dead ferrets to Buckbeak. In a flurry of motion, Malfoy stumbles back against a tree, cross-eyed and filled with fear as Hermione sharply jabs the tip of her wand under his nose. Surprised by Ron's words, she turns, nods, and—SMACK!—as quick as lightning, she delivers a powerful looping right punch to Malfoy's jaw, knocking him flat on his back. Stunned and disoriented, Malfoy leaps to his feet and takes flight, with Crabbe and Goyle huffing and puffing as they follow close behind him. The trio, remaining unperturbed, makes their way down the gentle slope and moves past Buckbeak, who is lazily chewing on a ferret with a sense of satisfied indifference. Watching Buckbeak with a watchful and protective eye, Hagrid stands by his window. Harry and Ron take their seats, and the trio quietly slips into a stand of trees, leaving Hagrid's hut to glimmer desolately in the fading light of the dying sun. At that elevated moment, high up in the clock tower, a solemn bell begins to toll, marking the passage of time in the cool evening air."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Snape, with a sudden movement, turns around and notices Lupin, who is standing quietly in the shadows. As Lupin steps forward, he reaches out and takes hold of the parchment, which has now transformed to show an unflattering caricature of Snape alongside a depiction of a pair of potions. Harry finds himself walking beside a visibly angry Lupin, who clutches the map tightly in his fist. Harry moves quietly and briefly pauses in the doorway, his gaze wandering absently to the waxing moon that shimmers brightly beyond the window, prompting him to begin turning away, though he ultimately hesitates. Lupin also hesitates for a slight moment before returning his attention to the papers in front of him. Trelawney, in the meantime, focuses her eyes on Harry's crystal ball. Seeing this, Hermione rolls her eyes in exasperation. Feeling stung by Trelawney’s gesture, Hermione starts to respond but finds herself at a loss for words, unable to articulate a reply. Rising from her seat with little grace, she exits the room, inadvertently knocking her crystal ball to the floor in the process. Harry looks on with curiosity as the ball rolls slowly away from the doorway. Ron pauses, glances at Harry with a subtle inquiry, then proceeds to leave. Harry watches both Ron and the others depart before noticing Hermione's crystal ball lying on the landing. Intent on tidying up, Harry picks up the crystal and sets it back on its stand. As he prepares to leave, the smoke inside the crystal suddenly darkens and catches his attention. Leaning in closer, Harry examines the shape that forms within the crystal—it is unmistakably Sirius Black. At that exact moment, a shadow moves across the glossy surface of the crystal and a hand unexpectedly grips Harry's shoulder, prompting him to wheel around and identify the source. Harry stiffens at the sight, only to find himself blinking as the hand is revealed to be Trelawney's, resting upon his shoulder. With a shake of his head, Harry, clearly unsettled by this encounter, quickly makes his way down the stairs, signaling a transition to the next scene as we fade out. A sudden \"SWOOK! SWOOK!\" noise cuts through, and we fade up with the moving perspective of a crow as it gracefully glides toward a flock circling at the feet of a pot-bellied man—the Executioner—who is sitting in the courtyard. With a rhythmic \"SWOOK! SWOOK!\" sound, he methodically sharpens his axe, a scene that abruptly transitions to Harry, Ron, and Hermione hurrying past the courtyard. The Executioner looks up, observing as Harry leads Ron and Hermione towards Hagrid's hut. Hermione and Ron direct their attention to Malfoy, who, along with Crabbe and Goyle, lies hidden within a cluster of imposing menhirs. Binoculars in hand, they are spying on Hagrid, who occupies himself in the pumpkin patch, throwing dead ferrets to Buckbeak. With a sudden stumble, Malfoy recoils against a tree, his eyes crossing with terror as Hermione, quick to act, thrusts the tip of her wand beneath his nose. Her surprise is evident when she turns to find Ron addressing her. With a nod of acknowledgment, Hermione swiftly delivers a looping right punch to Malfoy's jaw, sending him sprawling flat on his back. Stunned by the unexpected blow, Malfoy scrambles to his feet and bolts away, with Crabbe and Goyle struggling to keep up, puffing heavily behind him. Together, the trio makes their way down the slope, passing Buckbeak, who chews on a ferret with an air of idle satisfaction. Hagrid stands by the window, watching Buckbeak with a contemplative gaze. Meanwhile, Harry and Ron find a place to sit, and the trio quietly slips into a cluster of trees. Beyond them, Hagrid's hut glimmers in solitude under the fading light of the sun. A bell begins to toll from high within the clock tower, marking the passage of time in the quiet scene."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Snape notices Lupin in the shadows, who takes the parchment now showing a caricature of Snape alongside potions. As Harry walks with Lupin, who is tightly gripping the map, he momentarily pauses at the doorway, glances at the moon, and hesitates before moving on. Lupin resumes examining his papers. In Trelawney's room, Hermione rolls her eyes at Harry's crystal, but after a failed attempt to respond, she exits abruptly, sending her crystal ball rolling. Harry observes the ball before returning it to its stand. As he turns to leave, the smoke in the crystal darkens, revealing Sirius Black's image. Just then, a shadow appears, and a hand on his shoulder startles him, prompting an unsettling encounter with Trelawney. Disturbed, Harry quickly exits down the stairs. \n\nWe shift to a crow’s perspective gliding toward the Executioner sharpening his axe in the courtyard as Harry, Ron, and Hermione hurry past. The Executioner notes their presence as they head to Hagrid’s hut, where they see Malfoy with Crabbe and Goyle using binoculars to spy on Hagrid feeding Buckbeak. Hermione surprises Malfoy by confronting him, and after an exchange with Ron, delivers a punch that sends him fleeing with Crabbe and Goyle. The trio continues past Buckbeak towards the trees near Hagrid's hut, which glows under the fading sunlight. As they settle, a distant bell begins to toll."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Snape turns and sees Lupin, a skilled Defense Against the Dark Arts teacher known for his werewolf condition, standing in the shadows. Lupin takes the parchment, which now displays a rather unflattering caricature of Snape and a pair of potions, resembling those in the Hogwarts Potions classroom. Harry walks beside a fuming Lupin, who grips the map fiercely, a relic known as the Marauder's Map revealing hidden passages and people’s whereabouts within Hogwarts. Harry walks silently and lingers briefly in the doorway, absently eyeing the waxing moon that glimmers beyond the window, an omen of Lupin's upcoming transformation, then starts to turn away but stops. Lupin hesitates ever-so-slightly, then returns to his papers, likely preparing for the next class. As Trelawney, the divination professor with a penchant for dramatic predictions, eyes Harry's crystal, Hermione rolls her eyes. Stung, Hermione starts to reply but seems incapable of a single word, her logical mind clashing with Trelawney’s mystical approach. Rising gracelessly, she exits, knocking her crystal ball to the floor. Harry watches curiously as the ball rolls slowly out the doorway. Ron stops, glances at Harry, then moves off. Harry watches him go, along with the others, then spies Hermione's crystal ball lying on the landing. Harry sets Hermione's crystal back on its stand and starts to go, when the smoke within the crystal suddenly darkens, a sign of impending danger. Leaning close, Harry watches the shape that appears. It is unmistakable: Sirius Black, the infamous escaped prisoner from Azkaban rumored to be after Harry. Just then, a shadow crawls the glossy surface of the crystal, and a hand snatches Harry's shoulder. He wheels, finds, and Harry stiffens. When it rises, she blinks, eyes the hand that lies upon Harry's shoulder—her hand, belonging to Trelawney, known for her dramatic entrances. Harry shakes his head, clearly unsettled by his encounter with Trelawney, Harry hastens down the stairs, and we fade out. SWOOK! SWOOK! We fade up on a moving POV of a crow as it glides to the flock circling the feet of a pot-bellied man, the Executioner, tasked with Buckbeak's fate, sitting in the courtyard. As he sharpens his axe—SWOOK! SWOOK!—we cut to Harry, Ron, and Hermione hurrying past. The Executioner looks up, and we see Harry leading Ron and Hermione toward Hagrid's hut, the warm, rustic abode of their gentle half-giant friend. She and Ron look and see Malfoy, along with Crabbe and Goyle, lurking within a grouping of monolithic menhirs, ancient stones that add to the mystical aura of the grounds, binoculars in hand, spying on Hagrid, who stands in the pumpkin patch, tossing dead ferrets to Buckbeak, the proud Hippogriff. Malfoy stumbles back against a tree, cross-eyed with fear as Hermione jabs the tip of her wand under his nose, when she turns, surprised Ron's spoken to her. Hermione nods, then—SMACK!—quick as lightning, lands a looping right to Malfoy's jaw, putting him flat on his back. Stunned, he leaps to his feet and runs, Crabbe and Goyle huffing and puffing behind. The trio makes their way down the slope and past Buckbeak, chewing on a ferret with idle satisfaction. Hagrid stands by the window watching Buckbeak, likely worried about the creature’s impending hearing. Harry and Ron sit, and the trio slips silently into a stand of trees. Beyond them, Hagrid's hut glimmers desolately in the dying sun, a silent witness to their adventures. High in the clock tower, a bell begins to toll, marking the hour and echoing through the castle grounds."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Snape turns and sees Lupin standing in the shadows. Lupin takes the parchment which now displays a rather unflattering caricature of Snape and a pair of potions. Harry walks aside a fuming Lupin who grips the map fiercely. Harry walks silently and lingers briefly in the doorway absently eyeing the waxing moon that glimmers beyond the window then starts to turn away but stops. Lupin hesitates eversoslightly then returns to his papers. As Trelawney eyes Harry's crystal Hermione rolls her eyes. Stung. Hermione starts to reply but seems incapable of a single word. Rising gracelessly she exits knocking her crystal ball to the floor. Harry watches curiously as the ball rolls slowly out the doorway. Ron stops glances at Harry then moves off. Harry watches him go along with the others then spies Hermione's crystal ball lying on the landing. Harry sets Hermione's crystal back on its stand and starts to go when the smoke within the crystal suddenly darkens. Leaning close Harry watches the shape that appears. It is unmistakable Sirius Black. Just then a shadow crawls the glossy surface of the crystal and a hand snatches Harry's shoulder. He wheels finds and Harry stiffens. When it rises she blinks eyes the hand that lies upon Harry's shoulder—her hand. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Harry shakes his head. Clearly unsettled by his encounter with Trelawney. Harry hastens down the stairs and we fade out. SWOOK SWOOK. We fade up on a moving POV of a crow as it glides to the flock circling the feet of a potbellied man. the Executioner sitting in the courtyard. As he sharpens his axe—SWOOK SWOOK—we cut to Harry. Ron and Hermione hurrying past. The Executioner looks up and we see Harry leading Ron and Hermione toward Hagrid's hut. She and Ron look and see Malfoy along with Crabbe and Goyle lurking within a grouping of monolithic menhirs binoculars in hand spying on Hagrid who stands in the pumpkin patch tossing dead ferrets to Buckbeak. Malfoy stumbles back against a tree crosseyed with fear as Hermione jabs the tip of her wand under his nose when she turns surprised Ron's spoken to her. Hermione nods then—SMACK—quick as lightning lands a looping right to Malfoy's jaw putting him flat on his back. Stunned he leaps to his feet and runs Crabbe and Goyle huffing and puffing behind. The trio makes their way down the slope and past Buckbeak chewing on a ferret with idle satisfaction. Hagrid stands by the window. watching Buckbeak. Harry and Ron sit and the trio slips silently into a stand of trees. Beyond them Hagrid's hut glimmers desolately in the dying sun. High in the clock tower a bell begins to toll."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Snape turns and sees Lupin standing in the shadows. Lupin takes the parchment which now displays a rather unflattering caricature of Snape and a pair of potions. Harry walks aside a fuming Lupin who grips the map fiercely. Harry walks silently and lingers briefly in the doorway absently eyeing the waxing moon that glimmers beyond the window then starts to turn away but stops. Lupin hesitates eversoslightly then returns to his papers. As Trelawney eyes Harry's crystal Hermione rolls her eyes. Stung. Hermione starts to reply but seems incapable of a single word. Rising gracelessly she exits knocking her crystal ball to the floor. Harry watches curiously as the ball rolls slowly out the doorway. Ron stops glances at Harry then moves off. Harry watches him go along with the others then spies Hermione's crystal ball lying on the landing. Harry sets Hermione's crystal back on its stand and starts to go when the smoke within the crystal suddenly darkens. Leaning close Harry watches the shape that appears. It is unmistakable Sirius Black. Just then a shadow crawls the glossy surface of the crystal and a hand snatches Harry's shoulder. He wheels finds and Harry stiffens. When it rises she blinks eyes the hand that lies upon Harry's shoulder—her hand. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Harry shakes his head. Clearly unsettled by his encounter with Trelawney. Harry hastens down the stairs and we fade out. SWOOK SWOOK. We fade up on a moving POV of a crow as it glides to the flock circling the feet of a potbellied man. the Executioner sitting in the courtyard. As he sharpens his axe—SWOOK SWOOK—we cut to Harry. Ron and Hermione hurrying past. The Executioner looks up and we see Harry leading Ron and Hermione toward Hagrid's hut. She and Ron look and see Malfoy along with Crabbe and Goyle lurking within a grouping of monolithic menhirs binoculars in hand spying on Hagrid who stands in the pumpkin patch tossing dead ferrets to Buckbeak. Malfoy stumbles back against a tree crosseyed with fear as Hermione jabs the tip of her wand under his nose when she turns surprised Ron's spoken to her. Hermione nods then—SMACK—quick as lightning lands a looping right to Malfoy's jaw putting him flat on his back. Stunned he leaps to his feet and runs Crabbe and Goyle huffing and puffing behind. The trio makes their way down the slope and past Buckbeak chewing on a ferret with idle satisfaction. Hagrid stands by the window. watching Buckbeak. Harry and Ron sit and the trio slips silently into a stand of trees. Beyond them Hagrid's hut glimmers desolately in the dying sun. High in the clock tower a bell begins to toll."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Snape turns and sees Lupin standing in the shadows. Lupin takes the parchment which now displays a rather unflattering caricature of Snape and a pair of potions. Harry walks aside a fuming Lupin who grips the map fiercely. Harry walks silently and lingers briefly in the doorway absently eyeing the waxing moon that glimmers beyond the window then starts to turn away but stops. Lupin hesitates eversoslightly then returns to his papers. As Trelawney eyes Harry's crystal Hermione rolls her eyes. Stung. Hermione starts to reply but seems incapable of a single word. Rising gracelessly she exits knocking her crystal ball to the floor. She and Ron look and see Malfoy along with Crabbe and Goyle lurking within a grouping of monolithic menhirs binoculars in hand spying on Hagrid who stands in the pumpkin patch tossing dead ferrets to Buckbeak. Malfoy stumbles back against a tree crosseyed with fear as Hermione jabs the tip of her wand under his nose when she turns surprised Ron's spoken to her. Hermione nods then—SMACK—quick as lightning lands a looping right to Malfoy's jaw putting him flat on his back. Stunned he leaps to his feet and runs Crabbe and Goyle huffing and puffing behind. The trio makes their way down the slope and past Buckbeak chewing on a ferret with idle satisfaction. Hagrid stands by the window. watching Buckbeak. Harry and Ron sit and the trio slips silently into a stand of trees. Beyond them Hagrid's hut glimmers desolately in the dying sun. High in the clock tower a bell begins to toll."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Snape turns and sees Lupin standing in the shadows. Lupin takes the parchment which now displays a rather unflattering caricature of Snape and a pair of potions. Harry walks aside a fuming Lupin who grips the map fiercely. Harry walks silently and lingers briefly in the doorway absently eyeing the waxing moon that glimmers beyond the window then starts to turn away but stops. watching Buckbeak. Harry and Ron sit and the trio slips silently into a stand of trees. Beyond them Hagrid's hut glimmers desolately in the dying sun. High in the clock tower a bell begins to toll."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Grindle spins and notices Murray lurking in the light. Murray seizes the manuscript, which now portrays an amusing sketch of Grindle and a set of compasses. Alex strides beside a cheerful Murray, who clutches the chart gently. Alex strolls calmly and pauses momentarily by the staircase, idly observing the crescent sun that flickers past the curtain, then attempts to move away but pauses. Murray falters just slightly, then examines his documents. As Johnson examines Alex's mirror, Rachel raises her eyebrows. Shocked, Rachel attempts to respond but appears devoid of a coherent thought. Rising clumsily, she departs, nudging her mirror orb to the ground. Alex observes intently as the orb meanders slowly out the hallway. Neville pauses, peers at Alex, then drifts away. Alex watches him depart, as do the others, then notices Rachel's mirror orb lying on the corridor. Alex places Rachel's mirror back on its perch and starts to leave, when the mist inside the mirror suddenly deepens. Bending closer, Alex observes the figure that materializes. It is clear: Marcus Grey. Suddenly, a silhouette traverses the dull exterior of the mirror, and a hand grips Alex's arm. He turns, discovers, and Alex freezes. When it ascends, she blinks, examines the hand that rests upon Alex's arm—her hand. Alex shakes his head. Clearly startled by his meeting with Johnson, Alex rushes down the hallway, and we fade out. WHIRR! WHIRR! We fade up on a soaring view of a falcon as it drifts to the flock scurrying around the legs of a slender woman, the Gardener, reclining in the atrium. As she polishes her spade—WHIRR! WHIRR!—we cut to Alex, Neville, and Rachel rushing by. The Gardener glances up, and we observe Alex guiding Neville and Rachel toward Falco's cottage. She and Neville glance and spot Fergus, alongside Cale and Link, hiding among a collection of towering stones, telescopes in hand, observing Falco, who stands in the orchard, tossing live mice to Sunwing. Fergus trips backward into a bush, startled with fright as Rachel prods the tip of her staff under his chin, when she rotates, bewildered that Neville's spoken to her. Rachel agrees, then—WHACK!—swift as a breeze, delivers a sweeping uppercut to Fergus's cheek, dropping him flat on his back. Shocked, he bounds to his feet and dashes, Cale and Link panting and puffing behind. The group navigates their path down the incline and past Sunwing, gnawing on a mouse with calm contentment. Falco stands by the arch watching Sunwing. Alex and Neville settle, and the group slips quietly into a cluster of shrubs. Beyond them, Falco's cottage flickers forlornly in the setting light. High in the church tower, a bell starts to chime."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Snape notices Lupin in the shadows as Lupin examines a parchment showing Snape's caricature. With a tense grip on the map, Lupin walks with Harry, who briefly pauses at a waxing moon but continues on. Trelawney and Hermione have a tense moment, leading Hermione to leave, knocking over her crystal ball. Ron and Harry observe, with Harry placing the ball back on its stand. The smoke inside unexpectedly reveals Sirius Black's image, unsettling Harry when Trelawney's hand surprises him. Disturbed, Harry rushes down the stairs. We shift to see a crow fly to an Executioner sharpening his axe as Harry, Ron, and Hermione hurry by. They spot Malfoy and his cronies spying on Hagrid, who is feeding Buckbeak. Hermione confronts Malfoy and punches him, sending him running with Crabbe and Goyle. The trio retreats past Buckbeak and into trees, observing Hagrid's hut in the fading light as a clock tolls in the distance."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "High in the clock tower a bell begins to toll Beyond them Hagrid's hut glimmers desolately in the dying sun Harry and Ron sit and the trio slips silently into a stand of trees watching Buckbeak Hagrid stands by the window The trio makes their way down the slope and past Buckbeak chewing on a ferret with idle satisfaction Stunned he leaps to his feet and runs Crabbe and Goyle huffing and puffing behind Hermione nods then—SMACK—quick as lightning lands a looping right to Malfoy's jaw putting him flat on his back Malfoy stumbles back against a tree crosseyed with fear as Hermione jabs the tip of her wand under his nose when she turns surprised Ron's spoken to her She and Ron look and see Malfoy along with Crabbe and Goyle lurking within a grouping of monolithic menhirs binoculars in hand spying on Hagrid who stands in the pumpkin patch tossing dead ferrets to Buckbeak The Executioner looks up and we see Harry leading Ron and Hermione toward Hagrid's hut Ron and Hermione hurrying past As he sharpens his axe—SWOOK SWOOK—we cut to Harry the Executioner sitting in the courtyard We fade up on a moving POV of a crow as it glides to the flock circling the feet of a potbellied man SWOOK SWOOK Harry hastens down the stairs and we fade out Clearly unsettled by his encounter with Trelawney Harry shakes his head When it rises she blinks eyes the hand that lies upon Harry's shoulder—her hand He wheels finds and Harry stiffens Just then a shadow crawls the glossy surface of the crystal and a hand snatches Harry's shoulder It is unmistakable Sirius Black Leaning close Harry watches the shape that appears Harry sets Hermione's crystal back on its stand and starts to go when the smoke within the crystal suddenly darkens Harry watches him go along with the others then spies Hermione's crystal ball lying on the landing Ron stops glances at Harry then moves off Harry watches curiously as the ball rolls slowly out the doorway Rising gracelessly she exits knocking her crystal ball to the floor Hermione starts to reply but seems incapable of a single word Stung As Trelawney eyes Harry's crystal Hermione rolls her eyes Lupin hesitates eversoslightly then returns to his papers Harry walks silently and lingers briefly in the doorway absently eyeing the waxing moon that glimmers beyond the window then starts to turn away but stops Harry walks aside a fuming Lupin who grips the map fiercely Lupin takes the parchment which now displays a rather unflattering caricature of Snape and a pair of potions Snape turns and sees Lupin standing in the shadows"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Lupin takes the parchment which now displays a rather unflattering caricature of Snape and a pair of potions Snape turns and sees Lupin standing in the shadows Harry walks silently and lingers briefly in the doorway absently eyeing the waxing moon that glimmers beyond the window then starts to turn away but stops Harry walks aside a fuming Lupin who grips the map fiercely As Trelawney eyes Harry's crystal Hermione rolls her eyes Lupin hesitates eversoslightly then returns to his papers Hermione starts to reply but seems incapable of a single word Stung Harry watches curiously as the ball rolls slowly out the doorway Rising gracelessly she exits knocking her crystal ball to the floor Harry watches him go along with the others then spies Hermione's crystal ball lying on the landing Ron stops glances at Harry then moves off Leaning close Harry watches the shape that appears Harry sets Hermione's crystal back on its stand and starts to go when the smoke within the crystal suddenly darkens Just then a shadow crawls the glossy surface of the crystal and a hand snatches Harry's shoulder It is unmistakable Sirius Black When it rises she blinks eyes the hand that lies upon Harry's shoulder—her hand He wheels finds and Harry stiffens Clearly unsettled by his encounter with Trelawney Harry shakes his head SWOOK SWOOK Harry hastens down the stairs and we fade out the Executioner sitting in the courtyard We fade up on a moving POV of a crow as it glides to the flock circling the feet of a potbellied man Ron and Hermione hurrying past As he sharpens his axe—SWOOK SWOOK—we cut to Harry She and Ron look and see Malfoy along with Crabbe and Goyle lurking within a grouping of monolithic menhirs binoculars in hand spying on Hagrid who stands in the pumpkin patch tossing dead ferrets to Buckbeak The Executioner looks up and we see Harry leading Ron and Hermione toward Hagrid's hut Hermione nods then—SMACK—quick as lightning lands a looping right to Malfoy's jaw putting him flat on his back Malfoy stumbles back against a tree crosseyed with fear as Hermione jabs the tip of her wand under his nose when she turns surprised Ron's spoken to her The trio makes their way down the slope and past Buckbeak chewing on a ferret with idle satisfaction Stunned he leaps to his feet and runs Crabbe and Goyle huffing and puffing behind watching Buckbeak Hagrid stands by the window Beyond them Hagrid's hut glimmers desolately in the dying sun Harry and Ron sit and the trio slips silently into a stand of trees High in the clock tower a bell begins to toll"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Clearly unsettled by his encounter with Trelawney Harry hastens down the stairs and we fade out SWOOK SWOOK We fade up on a moving POV of a crow as it glides to the flock circling the feet of a potbellied man the Executioner sitting in the courtyard As he sharpens his axe—SWOOK SWOOK—we cut to Harry Ron and Hermione hurrying past The Executioner looks up and we see Harry leading Ron and Hermione toward Hagrid's hut She and Ron look and see Malfoy along with Crabbe and Goyle lurking within a grouping of monolithic menhirs binoculars in hand spying on Hagrid who stands in the pumpkin patch tossing dead ferrets to Buckbeak Malfoy stumbles back against a tree crosseyed with fear as Hermione jabs the tip of her wand under his nose when she turns surprised Ron's spoken to her Hermione nods then—SMACK—quick as lightning lands a looping right to Malfoy's jaw putting him flat on his back Stunned he leaps to his feet and runs Crabbe and Goyle huffing and puffing behind The trio makes their way down the slope and past Buckbeak chewing on a ferret with idle satisfaction Hagrid stands by the window watching Buckbeak Harry and Ron sit and the trio slips silently into a stand of trees Beyond them Hagrid's hut glimmers desolately in the dying sun High in the clock tower a bell begins to toll Snape turns and sees Lupin standing in the shadows Lupin takes the parchment which now displays a rather unflattering caricature of Snape and a pair of potions Harry walks aside a fuming Lupin who grips the map fiercely Harry walks silently and lingers briefly in the doorway absently eyeing the waxing moon that glimmers beyond the window then starts to turn away but stops Lupin hesitates eversoslightly then returns to his papers As Trelawney eyes Harry's crystal Hermione rolls her eyes Stung Hermione starts to reply but seems incapable of a single word Rising gracelessly she exits knocking her crystal ball to the floor Harry watches curiously as the ball rolls slowly out the doorway Ron stops glances at Harry then moves off Harry watches him go along with the others then spies Hermione's crystal ball lying on the landing Harry sets Hermione's crystal back on its stand and starts to go when the smoke within the crystal suddenly darkens Leaning close Harry watches the shape that appears It is unmistakable Sirius Black Just then a shadow crawls the glossy surface of the crystal and a hand snatches Harry's shoulder He wheels finds and Harry stiffens When it rises she blinks eyes the hand that lies upon Harry's shoulder—her hand Harry shakes his head"
        }
      ]
    }
  ]
}