{
  "ground_truth": "He knows this persona well, only it's never pissed him off as much as it does right now, and he kisses her--a soft, warm kiss that speaks unmistakably of sex--then turns to the others and grins. Carolyn's smile is frozen on her face. He crosses off. Lester stands at the bar. A bartender pours him a drink. The bartender complies. Lester takes his drink and turns to face the center of the room. Carolyn is talking to Buddy and Christy. She's on: smiling, animated, laughing too loud at their jokes. Lester shakes his head. Ricky approaches him, wearing a waiter's uniform, carrying a tray of empty glasses. Lester looks away, scans the crowd, then downs the rest of his drink in one gulp. Ricky just stands there, watching him. Finally Lester turns back to Ricky: what does this kid want. Lester's surprised, but instantly intrigued. Carolyn and Buddy are deep in conversation. Christy has wandered off. Carolyn is nervous; Buddy seems amused. They look at each other for a beat, then look away. This situation is loaded and they both know it. Ricky and Lester stand next to a dumpster behind the service entrance to the hotel, smoking a joint. Suddenly, the service entrance opens, and a large catering boss in a cheap suit peers out at them. Ricky hides the joint. He goes back inside. Lester looks at Ricky, who shrugs. Carolyn is standing in the open service entrance. Lester quickly hides the joint behind his back, and she goes back inside. Jane and Angela are watching MTV. Jane switches off the TV. She starts toward the kitchen. Lester enters and opens the refrigerator. He turns, and is instantly transfixed by: Angela leans against the counter, twirling her hair. She starts toward him. She reaches inside the refrigerator to grab a bottle. Extreme close-up on her hand as it briefly touches his shoulder in slow motion. As she does, she moves to place her other hand casually on Lester's shoulder. He sees it coming. Everything slows down, and all sound fades. Close on Lester: his eyes narrow slightly, then: He cups her face in his hands and kisses her. She seems shocked, but doesn't resist as he pulls her toward him with surprising strength. He breaks the kiss, looking at her in awe, then he reaches up and touches his lips. His eyes widen as he pulls a rose petal from his mouth right before we. Jane glances at Angela, irritated. Angela is back against the counter, drinking the root beer. Carolyn enters from the dining room. He can't believe what he's hearing. Lester, still in his suit, stands outside Jane's room, his ear up against the door.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He comprehends this character well, only it's never angered him as much as it does right now, and he kisses her—a soft, warm kiss that communicates unmistakably of lust—then turns to the others and grins. Carolyn's grin is frozen on her face. He departs. Lester stands at the counter. A bartender serves him a beverage. The bartender complies. Lester takes his beverage and turns to face the center of the space. Carolyn is speaking to Buddy and Christy. She's on: smiling, lively, laughing too loudly at their jokes. Lester shakes his head. Ricky approaches him, wearing a server's attire, carrying a platter of empty glasses. Lester looks away, surveys the crowd, then drinks the rest of his beverage in one gulp. Ricky just stands there, observing him. Finally Lester turns back to Ricky: what does this youth want. Lester's surprised, but instantly fascinated. Carolyn and Buddy are deep in dialogue. Christy has wandered off. Carolyn is anxious; Buddy seems entertained. They look at each other for a moment, then look away. This situation is charged and they both know it. Ricky and Lester stand next to a bin behind the service entrance to the hotel, smoking a joint. Suddenly, the service entrance opens, and a large catering manager in a cheap suit peers out at them. Ricky conceals the joint. He goes back inside. Lester looks at Ricky, who shrugs. Carolyn is standing in the open service entrance. Lester quickly hides the joint behind his back, and she goes back inside. Jane and Angela are watching MTV. Jane switches off the TV. She starts toward the kitchen. Lester enters and opens the refrigerator. He turns, and is instantly captivated by: Angela leans against the counter, twirling her hair. She starts toward him. She reaches inside the refrigerator to grab a bottle. Extreme close-up on her hand as it briefly touches his shoulder in slow motion. As she does, she moves to place her other hand casually on Lester's shoulder. He sees it coming. Everything slows down, and all sound fades. Close on Lester: his eyes narrow slightly, then: He cups her face in his hands and kisses her. She seems shocked, but doesn't resist as he pulls her toward him with surprising strength. He breaks the kiss, looking at her in wonder, then he reaches up and touches his lips. His eyes widen as he pulls a rose petal from his mouth right before we. Jane glances at Angela, annoyed. Angela is back against the counter, drinking the root soda. Carolyn enters from the dining area. He can't believe what he's hearing. Lester, still in his suit, stands outside Jane's space, his ear up against the door."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Knows this persona well by him, only it's never pissed him off as much as it does right now, and she is kissed by him--a soft, warm kiss that unmistakably speaks of sex--then the others are turned to by him, and a grin is shown. Carolyn freezes her smile on her face. Off is crossed by him. The bar is stood at by Lester. Him a drink is poured by a bartender. The bartender complies. His drink is taken by Lester and the center of the room is turned to face by him. Buddy and Christy are talked to by Carolyn. She's on: smiling, animated, laughing too loud at their jokes. His head is shaken by Lester. Ricky approaches him, a waiter's uniform is worn, carrying a tray of empty glasses. Away looks Lester, the crowd is scanned by him, then the rest of his drink is downed in one gulp. Ricky just stands there, him being watched. Finally, back to Ricky Lester turns: what this kid wants is wondered by him. Surprised is Lester, but instantly intrigued. Deep in conversation are Carolyn and Buddy. Christy has wandered off. Nervous is Carolyn; Buddy seems amused. At each other, they look for a beat, then away they look. Loaded is this situation, and known by both of them. Next to a dumpster behind the service entrance to the hotel, stand Ricky and Lester, a joint is smoked by them. Suddenly, the service entrance opens, and at them a large catering boss in a cheap suit peers out. The joint is hidden by Ricky. Back inside he goes. At Ricky, Lester looks, who shrugs. In the open service entrance, Carolyn is standing. Lester quickly hides the joint behind his back, and inside she goes. MTV is being watched by Jane and Angela. Off the TV is switched by Jane. Toward the kitchen, she starts. The refrigerator is opened by Lester as he enters. Turning, instantly he is transfixed by: Angela leans against the counter, her hair twirling. Toward him, she starts. Inside the refrigerator, she reaches to grab a bottle. An extreme close-up on her hand as it briefly is touched by his shoulder in slow motion. As she does, casually on Lester's shoulder her other hand is moved to be placed by her. It is seen by him coming. Everything slows down, and all sound fades. Close on Lester: his eyes narrow slightly, then: Her face is cupped in his hands by him, and she is kissed by him. Shocked she seems, but resisted she doesn’t as toward him with surprising strength she is pulled. The kiss is broken by him, at her in awe he looks, then up he reaches and his lips are touched. His eyes widen as from his mouth he pulls a rose petal right before we. At Angela, Jane glances, irritated. Against the counter, Angela is back, the root beer drinking. From the dining room, Carolyn enters. What he's hearing can't be believed by him. Still in his suit, outside Jane's room stands Lester, his ear up against the door."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He knows this persona well, but it's never infuriated him as much as now. He kisses her—a soft, warm kiss hinting at sex—then turns, grinning at the others. Carolyn's smile is frozen as he walks off. Lester stands at the bar, getting a drink. He turns to face the room, seeing Carolyn animatedly talking to Buddy and Christy, laughing loudly. Lester shakes his head. Ricky, in a waiter's uniform, approaches with empty glasses. Lester looks away, scanning the crowd, and downs his drink. Ricky watches him. Lester turns back, wondering what Ricky wants. He's intrigued. Carolyn and Buddy, deep in conversation, seem nervous and amused. The situation is tense, and they know it. Ricky and Lester smoke a joint by the hotel's service entrance. A catering boss peers out; Ricky hides the joint. The boss leaves. Carolyn appears at the entrance, and Lester hides the joint. She goes inside. Jane and Angela watch MTV. Jane turns off the TV and heads to the kitchen. Lester enters, opens the fridge, and is captivated by Angela, who leans against the counter. She grabs a bottle, briefly touching his shoulder. He reacts, everything slows, and he kisses her. She's shocked but doesn't resist. He pulls back, amazed, touches his lips, and finds a rose petal in his mouth. Jane sees Angela, irritated. Angela drinks root beer. Carolyn enters. Lester, still in his suit, stands outside Jane's room, listening at the door."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He knows this persona well, but it never irritated him as much as now. He kisses her—a soft, warm kiss hinting at sex—then grins at the others. Carolyn's smile freezes. He leaves. Lester is at the bar; the bartender serves him a drink. Carolyn chats with Buddy and Christy, animated and laughing loudly. Lester shakes his head as Ricky, in a waiter's uniform, approaches with a tray of empty glasses. Lester scans the crowd and finishes his drink, while Ricky watches him. Curious, Lester finally faces Ricky. Carolyn and Buddy converse deeply; Christy has left. Carolyn is nervous; Buddy is amused. They know the situation is tense. Ricky and Lester are behind the hotel's service entrance, smoking a joint. A catering boss peers out, and Ricky hides the joint. Carolyn appears in the entrance, prompting Lester to hide the joint. She leaves. Jane and Angela watch MTV; Jane turns off the TV and heads to the kitchen. Lester enters, captivated by Angela leaning on the counter, twirling her hair. She takes a bottle, her hand brushing Lester's shoulder. All slows down as Lester cups her face and kisses her; she's shocked but doesn't resist. He pulls a rose petal from his mouth as Jane looks on, irritated. Angela leans against the counter with root beer. Carolyn enters, and Lester, still suited, stands outside Jane's room, listening at the door."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He is intimately familiar with this particular persona, but it's never managed to irritate him as profoundly as it does at this very moment. He leans in and kisses her—a kiss that's gentle and warm, yet unmistakably charged with the promise of intimacy. Afterward, he turns to face the others, flashing a wide grin. Carolyn's smile appears stuck, frozen unnaturally on her face. He moves away, leaving the area. Meanwhile, Lester finds himself at the bar. A bartender, attentive and efficient, pours him a drink. The bartender complies diligently. Lester takes the drink in hand, then pivots to face the bustling center of the room. Carolyn is engaged in conversation with Buddy and Christy, her demeanor animated. She's fully involved—smiling, and laughing with exaggerated enthusiasm at their jokes. Lester simply shakes his head in mild disbelief. Ricky approaches, dressed in a waiter's uniform and carrying a tray laden with empty glasses. Lester averts his gaze, surveying the crowd, and then finishes his drink in one swift motion. Ricky remains, silently observing him. Eventually, Lester shifts his focus back to Ricky, puzzled about what this young man wants. It’s a surprise to Lester, yet he’s immediately intrigued. Carolyn and Buddy continue their engrossing conversation, while Christy has drifted away. Carolyn appears a bit tense, whereas Buddy seems quietly entertained. They share a moment, exchanging looks before diverting their gaze. The situation between them is rife with tension, and they are both acutely aware of it. \n\nRicky and Lester find themselves positioned next to a dumpster behind the hotel's service entrance, sharing a joint. Suddenly, the service entrance door swings open, and they are greeted by the sight of a large catering boss clad in a cheap suit peering at them. Ricky quickly conceals the joint and heads back inside. Lester turns to Ricky, who merely shrugs. Carolyn appears standing in the open service entrance, prompting Lester to hurriedly hide the joint behind him as she retreats back inside. In another scene, Jane and Angela are watching MTV, a casual atmosphere surrounding them. Jane then switches off the TV and makes her way toward the kitchen. Lester enters the space, opening the refrigerator. He turns and is immediately captivated by the sight before him: Angela, leaning nonchalantly against the counter, twirling her hair. She moves toward him and reaches inside the refrigerator to grab a bottle. An extreme close-up reveals her hand as it briefly brushes against his shoulder in a slow-motion touch. As she does this, she casually rests her other hand on Lester's shoulder. Anticipating the gesture, he sees it coming. Time seems to decelerate, and all surrounding sound fades away. The focus shifts to Lester: his eyes narrow slightly and then, without warning, he cups her face in his hands and kisses her. Angela seems taken aback, yet she doesn't resist as he firmly draws her closer with unexpected strength. He releases the kiss, staring at her in awe, and then lifts his hand to his lips. His eyes widen in surprise as he retrieves a rose petal from his mouth. Jane, standing nearby, casts a disapproving glance at Angela, who, returning to reality, stands against the counter, sipping her root beer. Carolyn enters from the dining room, leaving Lester reeling from what he's just experienced. Now, he finds himself, still clad in his suit, standing outside Jane's room, pressing his ear against her door, unable to believe what he's hearing."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He holds a deep and intimate familiarity with this particular persona, but it has never succeeded in getting under his skin as intensely as it does in this precise moment. Leaning in closely, he plants a kiss on her lips—a kiss that is gentle and warm, and yet it brims unmistakably with the promise of deep intimacy. Following this, he turns his attention to face the others gathered around, and his face splits into a wide, beaming grin. Carolyn's smile, however, appears stuck, frozen in an unnatural position on her face. Then, he moves away, leaving the area behind. Meanwhile, Lester ends up at the bar. Here, a bartender, who is attentive and efficient, proceeds to pour him a drink. The bartender complies with great diligence. Lester takes the offered drink in hand, then pivots around to face the bustling center of the room. Carolyn is engaged in a lively conversation with Buddy and Christy, her demeanor entirely animated. She is fully involved—smiling broadly and laughing with exaggerated delight at their jokes. Lester simply shakes his head in mild disbelief. Ricky, dressed in a waiter's uniform and carrying a tray laden with empty glasses, approaches. Lester averts his gaze, surveying the crowd once more, and then finishes his drink in one swift motion, the liquid disappearing quickly. Ricky remains nearby, silently observing him with quiet curiosity. Eventually, Lester shifts his focus back to Ricky, puzzled about what this young man might want from him. It’s a surprise to Lester, yet he’s immediately intrigued by the situation. Carolyn and Buddy continue their engrossing conversation, while Christy has already drifted away elsewhere. Carolyn appears a bit tense, whereas Buddy seems quietly entertained. They share a moment, locking eyes briefly before diverting their gaze. The situation between them is rife with tension, and they are both acutely aware of it, sensing the undercurrents.\n\nFast forward, and Ricky and Lester find themselves positioned next to a dumpster behind the hotel's service entrance, sharing a joint together. Suddenly, the service entrance door swings wide open, and they are greeted by the sight of a large catering boss clad in a cheap suit, peering out at them with interest. Ricky, thinking quickly, conceals the joint and heads back inside without a word. Lester turns to Ricky, who merely gives a shrug as if to say \"what can you do?\" Carolyn appears standing in the open service entrance, causing Lester to hurriedly hide the joint behind him as she retreats back inside. In another scene, Jane and Angela are casually watching MTV, surrounded by a relaxed atmosphere. Jane then switches off the TV and makes her way toward the kitchen. Lester enters the space, opening the refrigerator door. He turns and is immediately captivated by the sight before him: Angela, leaning nonchalantly against the counter, absently twirling her hair. She moves toward him, reaching inside the refrigerator to grab a bottle. An extreme close-up reveals her hand as it briefly brushes against his shoulder with a slow-motion touch. As she does this, she casually rests her other hand on Lester's shoulder. Anticipating the gesture, he sees it coming. Time seems to decelerate, and all the surrounding sound fades away into the background. The focus shifts to Lester: his eyes narrow slightly and then, without any warning, he cups her face in his hands and kisses her. Angela seems taken aback, yet she doesn't resist as he firmly draws her closer with unexpected strength. He releases the kiss, staring at her in awe. He then lifts his hand to his lips, his eyes widening in surprise, as he retrieves a rose petal from his mouth. Jane, who is standing nearby, casts a disapproving glance at Angela. Angela, returning to reality, stands against the counter, calmly sipping her root beer. Carolyn then enters from the dining room, leaving Lester reeling from the intensity of what he's just experienced. Now, he finds himself, still clad in his suit, standing outside Jane's room, pressing his ear against her door, utterly unable to believe what he's hearing."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He recognizes the persona before him, familiar yet irritating him more than ever, and he leans in to press his lips softly against hers in a kiss that is imbued with a palpable sense of intimacy and desire. He then pivots to face the others, casting a wide grin in their direction. Meanwhile, Carolyn's expression seems fixed, her smile static, as he makes his way out. At the bar, Lester is positioned while the bartender precisely pours his drink into a glass, the contents settling. The bartender nods in acknowledgment, and Lester receives his drink, turning to survey the bustling center of the room. Within this lively scene, Carolyn is engaged in lively conversation with Buddy and Christy, her demeanor vibrant, her laughter ringing out slightly exaggerated at their amusing remarks. Observing this, Lester shakes his head, perhaps in mild disapproval or disbelief. Approaching him is Ricky, clad in a waiter's uniform, balancing a tray laden with empty glasses. Lester averts his gaze, scanning the crowd once more before bringing the glass to his lips, consuming the remaining drink in a single, decisive gulp. Ricky remains standing, observing Lester with curiosity. Lester eventually turns his attention back to Ricky, puzzled but intrigued by the young man's presence. In the meantime, Carolyn and Buddy seem engrossed in a deeper conversation while Christy has drifted away. There's a palpable tension between Carolyn and Buddy as they exchange glances, both aware of the underlying implications of their interaction before they look away. Elsewhere, Lester and Ricky find themselves next to a dumpster behind the hotel's service entrance, sharing a joint amidst their conversation. Suddenly, the service entrance door swings open, revealing a large catering manager clad in a cheap suit, his gaze critical as he peers at them. Ricky swiftly conceals the joint, and the manager turns away, heading back inside. Lester exchanges a look with Ricky, who merely shrugs in response. Carolyn briefly appears in the open doorway, prompting Lester to hastily hide the joint behind his back before she too retreats inside. Meanwhile, Jane and Angela are relaxing in front of the TV, watching MTV. With a decisive motion, Jane switches off the television and starts to make her way toward the kitchen. It is then that Lester enters the scene, moving to open the refrigerator door. His gaze is suddenly captured by Angela, who leans casually against the counter, her fingers idly twirling her hair. She makes her way toward him, reaching into the refrigerator to retrieve a bottle. It is during this moment that their hands brush against each other, an extreme close-up capturing the fleeting contact in slow motion. Angela's hand then finds its place on Lester's shoulder, a movement he anticipates as the world around them seems to decelerate, sound fading into silence. In this suspended moment, Lester narrows his eyes ever so slightly before he frames her face with his hands, drawing her closer for a kiss. Though Angela initially appears stunned by his boldness, she does not pull away as he draws her in with unexpected force. As the kiss concludes, he steps back, gazing at her with a sense of wonder, lifting a hand to touch his lips. His eyes widen in astonishment as he extracts a rose petal from his mouth, the delicate object evidence of the surreal moment. Jane casts a glance at Angela, her expression laced with irritation, while Angela, once more against the counter, sips her root beer. Carolyn then enters from the dining room, her presence coinciding with Lester's disbelief at what unfolds. In his suit, Lester stands just outside Jane's room, pressing his ear against the door, straining to catch what lies beyond."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He kisses her softly, conveying a sense of intimacy, then turns to the others with a grin as Carolyn's smile freezes. Moving away, Lester receives a drink from the bartender, then surveys the room while Carolyn animatedly interacts with Buddy and Christy. Ricky, in a waiter's uniform, approaches with a tray of empty glasses, prompting Lester to gulp his drink and reluctantly engage with him. Meanwhile, Carolyn and Buddy's conversation takes a tense turn as Christy drifts away. Later, Lester and Ricky share a joint by the hotel's service entrance until interrupted by a catering boss, causing them to hide the joint momentarily. Carolyn briefly appears, prompting Lester to conceal the joint again before she leaves. In the kitchen, Jane switches off the TV and heads out as Lester enters. Captivated by Angela, who leans against the counter, he watches her reach into the refrigerator. Her brief touch on his shoulder is highlighted in slow motion, leading to Lester cupping her face and kissing her with unexpected intensity. Shocked but unresisting, Angela is pulled toward him. He breaks the kiss, retrieves a rose petal from his mouth, and appears awestruck, while Jane watches Angela with irritation. Angela resumes drinking her root beer as Carolyn enters. In disbelief, Lester stands outside Jane's room, listening intently with his ear against the door."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He knows this persona well, only it's never pissed him off as much as it does right now, and he kisses her—a soft, warm kiss that speaks unmistakably of sex, reminiscent of a scene they once shared on a beach vacation—then turns to the others and grins. Carolyn's smile is frozen on her face, reminiscent of the stoic expressions often seen in Renaissance portraits. He crosses off the stage of their private drama. Lester stands at the bar, an elegantly crafted mahogany piece with a history dating back to the Prohibition era. A bartender, who has been tending this bar for over a decade, pours him a drink. The bartender complies with the practiced ease of someone who has served countless patrons. Lester takes his drink and turns to face the center of the room, his mind swirling with thoughts as complex as the cocktail in his hand. Carolyn is talking to Buddy and Christy, colleagues from her demanding job in real estate. She's on: smiling, animated, laughing too loud at their jokes that are as banal as office small talk often is. Lester shakes his head, recalling their better days. Ricky approaches him, wearing a waiter's uniform from the hotel catering service, carrying a tray of empty glasses destined for the industrial dishwasher in the back. Lester looks away, scans the crowd, then downs the rest of his drink in one gulp, feeling the warmth spread through him as alcohol takes effect. Ricky just stands there, watching him, with the quiet observation of someone used to being invisible. Finally, Lester turns back to Ricky, wondering: what does this kid want, in a voice tinged with paternal curiosity. Lester's surprised by Ricky's intent gaze, but instantly intrigued by the air of mystery that surrounds him. Carolyn and Buddy are deep in conversation about a new development project. Christy has wandered off to chat with the event organizer. Carolyn is nervous; Buddy, with the charm of a seasoned salesman, seems amused. They look at each other for a beat, a silent acknowledgment of shared tension, then look away. This situation is loaded with unspoken possibilities, and they both know it. Ricky and Lester stand next to a dumpster behind the service entrance to the hotel, an area marked by the lingering scent of last night's seafood buffet, smoking a joint that Ricky rolled expertly. Suddenly, the service entrance opens, and a large catering boss, known for his strict adherence to rules despite his cheap suit, peers out at them. Ricky hides the joint with the swift skill of someone who’s done this before. He goes back inside, with the nonchalance of a seasoned staff member. Lester looks at Ricky, who shrugs with a mix of apathy and defiance. Carolyn is standing in the open service entrance, caught between her roles as wife and businesswoman. Lester quickly hides the joint behind his back, his heart racing as she glances around, and she goes back inside, leaving behind a trail of floral perfume. Jane and Angela are watching MTV, a channel that defined the cultural landscape of their youth. Jane, often the more decisive of the two, switches off the TV. She starts toward the kitchen, where everyday family politics play out. Lester enters and opens the refrigerator, filled with leftovers and forgotten intentions. He turns, and is instantly transfixed by Angela, who leans against the counter, twirling her hair in a gesture that suggests both innocence and allure. She starts toward him, moving with the confidence of a girl who knows the effect she has. She reaches inside the refrigerator to grab a bottle of imported mineral water. Extreme close-up on her hand as it briefly touches his shoulder in slow motion, echoing moments of subtle intimacy they've shared before. As she does, she moves to place her other hand casually on Lester's shoulder, the air between them charged with unspoken tension. He sees it coming, the moment stretching into eternity. Everything slows down, and all sound fades, as if the universe is holding its breath. Close on Lester: his eyes narrow slightly, then: He cups her face in his hands and kisses her, an impulse driven by a complicated mix of desire and confusion. She seems shocked, her eyes wide with surprise, but doesn't resist as he pulls her toward him with surprising strength borne of pent-up emotion. He breaks the kiss, looking at her in awe, then he reaches up and touches his lips, as if to confirm the reality of the moment. His eyes widen as he pulls a rose petal from his mouth, a surreal reminder of the fragility of their encounter, right before we. Jane glances at Angela, irritated by the attention she's received. Angela is back against the counter, drinking the root beer, a comfort drink she often indulges in. Carolyn enters from the dining room, where she had been arranging the evening’s events in her mind. He can't believe what he's hearing, the soundtrack of his unraveling life. Lester, still in his suit from the evening's earlier engagements, stands outside Jane's room, his ear up against the door, seeking clarity in the muffled voices within."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He knows this persona well only it is never pissed him off as much as it does right now and he kisses hera soft warm kiss that speaks unmistakably of sexthen turns to the others and grins. Carolyn's smile is frozen on her face. He crosses off. Lester stands at the bar. A bartender pours him a drink. The bartender complies. Lester takes his drink and turns to face the center of the room. Carolyn is talking to Buddy and Christy. She is on smiling animated laughing too loud at their jokes. Lester shakes his head. Ricky approaches him wearing a waiter's uniform carrying a tray of empty glasses. Lester looks away scans the crowd then downs the rest of his drink in one gulp. Ricky just stands there watching him. Finally Lester turns back to Ricky. what does this kid want. Lester's surprised but instantly intrigued. Carolyn and Buddy are deep in conversation. Christy has wandered off. Carolyn is nervous. Buddy seems amused. They look at each other for a beat then look away. This situation is loaded and they both know it. Ricky and Lester stand next to a dumpster behind the service entrance to the hotel smoking a joint. Suddenly the service entrance opens and a large catering boss in a cheap suit peers out at them. Ricky hides the joint. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. He goes back inside. Lester looks at Ricky who shrugs. Carolyn is standing in the open service entrance. Lester quickly hides the joint behind his back and she goes back inside. Jane and Angela are watching MTV. Jane switches off the TV. She starts toward the kitchen. Lester enters and opens the refrigerator. He turns and is instantly transfixed by Angela leans against the counter twirling her hair. She starts toward him. She reaches inside the refrigerator to grab a bottle. Extreme closeup on her hand as it briefly touches his shoulder in slow motion. As she does she moves to place her other hand casually on Lester's shoulder. He sees it coming. Everything slows down and all sound fades. Close on Lester his eyes narrow slightly then. He cups her face in his hands and kisses her. She seems shocked but does not resist as he pulls her toward him with surprising strength. He breaks the kiss looking at her in awe. then he reaches up and touches his lips. His eyes widen as he pulls a rose petal from his mouth right before we. Jane glances at Angela irritated. Angela is back against the counter drinking the root beer. Carolyn enters from the dining room. He cannot believe what he is hearing. Lester still in his suit stands outside Jane's room his ear up against the door."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He knows this persona well only it is never pissed him off as much as it does right now and he kisses hera soft warm kiss that speaks unmistakably of sexthen turns to the others and grins. Carolyn's smile is frozen on her face. He crosses off. Lester stands at the bar. A bartender pours him a drink. The bartender complies. Lester takes his drink and turns to face the center of the room. Carolyn is talking to Buddy and Christy. She is on smiling animated laughing too loud at their jokes. Lester shakes his head. Ricky approaches him wearing a waiter's uniform carrying a tray of empty glasses. Lester looks away scans the crowd then downs the rest of his drink in one gulp. Ricky just stands there watching him. Finally Lester turns back to Ricky. what does this kid want. Lester's surprised but instantly intrigued. Carolyn and Buddy are deep in conversation. Christy has wandered off. Carolyn is nervous. Buddy seems amused. They look at each other for a beat then look away. This situation is loaded and they both know it. Ricky and Lester stand next to a dumpster behind the service entrance to the hotel smoking a joint. Suddenly the service entrance opens and a large catering boss in a cheap suit peers out at them. Ricky hides the joint. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. He goes back inside. Lester looks at Ricky who shrugs. Carolyn is standing in the open service entrance. Lester quickly hides the joint behind his back and she goes back inside. Jane and Angela are watching MTV. Jane switches off the TV. She starts toward the kitchen. Lester enters and opens the refrigerator. He turns and is instantly transfixed by Angela leans against the counter twirling her hair. She starts toward him. She reaches inside the refrigerator to grab a bottle. Extreme closeup on her hand as it briefly touches his shoulder in slow motion. As she does she moves to place her other hand casually on Lester's shoulder. He sees it coming. Everything slows down and all sound fades. Close on Lester his eyes narrow slightly then. He cups her face in his hands and kisses her. She seems shocked but does not resist as he pulls her toward him with surprising strength. He breaks the kiss looking at her in awe. then he reaches up and touches his lips. His eyes widen as he pulls a rose petal from his mouth right before we. Jane glances at Angela irritated. Angela is back against the counter drinking the root beer. Carolyn enters from the dining room. He cannot believe what he is hearing. Lester still in his suit stands outside Jane's room his ear up against the door."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He knows this persona well only it is never pissed him off as much as it does right now and he kisses hera soft warm kiss that speaks unmistakably of sexthen turns to the others and grins. Carolyn's smile is frozen on her face. He crosses off. Lester stands at the bar. A bartender pours him a drink. The bartender complies. Lester takes his drink and turns to face the center of the room. Carolyn is talking to Buddy and Christy. She is on smiling animated laughing too loud at their jokes. Lester shakes his head. Ricky approaches him wearing a waiter's uniform carrying a tray of empty glasses. Lester looks away scans the crowd then downs the rest of his drink in one gulp. Ricky just stands there watching him. He sees it coming. Everything slows down and all sound fades. Close on Lester his eyes narrow slightly then. He cups her face in his hands and kisses her. She seems shocked but does not resist as he pulls her toward him with surprising strength. He breaks the kiss looking at her in awe. then he reaches up and touches his lips. His eyes widen as he pulls a rose petal from his mouth right before we. Jane glances at Angela irritated. Angela is back against the counter drinking the root beer. Carolyn enters from the dining room. He cannot believe what he is hearing. Lester still in his suit stands outside Jane's room his ear up against the door."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He knows this persona well only it is never pissed him off as much as it does right now and he kisses hera soft warm kiss that speaks unmistakably of sexthen turns to the others and grins. Carolyn's smile is frozen on her face. He crosses off. Lester stands at the bar. A bartender pours him a drink. His eyes widen as he pulls a rose petal from his mouth right before we. Jane glances at Angela irritated. Angela is back against the counter drinking the root beer. Carolyn enters from the dining room. He cannot believe what he is hearing. Lester still in his suit stands outside Jane's room his ear up against the door."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "He recognizes this creature thoroughly, only it's never delighted him as much as it does at this moment, and he dances with her—a brisk, icy jig that speaks unmistakably of math—then swivels to the giraffes and chuckles. Marvin's frown is plastered on his elbow. He prances away. Clarence loiters at the fountain. A juggler tosses him a balloon. The juggler obliges. Clarence catches his balloon and rotates to gaze at the edge of the ocean. Marvin is whispering to Max and Donna. He's melting: frowning, silent, whispering too softly at their secrets. Clarence nods his foot. Sam approaches him, dressed as a doctor, balancing a stack of empty plates. Clarence turns his nose, sweeps the beach, then hurls the remainder of his balloon into the sky. Sam merely lounges there, observing him. Finally, Clarence pivots back to Sam: what does this owl desire. Clarence's puzzled, but slowly disinterested. Marvin and Max are lost in chess. Donna has meandered away. Marvin is confident; Max appears startled. They peer at each other for a moment, then gaze away. This riddle is empty, and they both feel it. Sam and Clarence hover past a hedge beside the delivery exit of the bakery, singing a jingle. Abruptly, the delivery exit creaks, and a tiny florist in a bright cape peers out at them. Sam pockets the jingle. He strolls back outside. Clarence glances at Sam, who shrugs. Marvin is leaping in the open delivery exit. Clarence swiftly pockets the jingle beneath his hat, and she dances back outside. Peter and Monica are studying CNN. Peter flicks on the radio. He paces toward the garage. Clarence whistles and shuts the oven. He spins, and is instantly captivated by: Monica perches atop the stove, braiding her scarf. She waves toward him. She reaches inside the oven to grasp a pepper. Extreme close-up on her palm as it briefly brushes his chin in rapid blur. As she does, she drifts to place her other foot gently on Clarence's chin. He senses it approaching. Everything speeds up, and all sound amplifies. Close on Clarence: his ears widen slightly, then: He pats her shoes in his knees and hugs her. She seems amused, but doesn't push away as he lifts her toward him with surprising grace. He laughs the hug, staring at her in disbelief, then he reaches down and pats his chin. His mouth narrows as he pulls a dandelion seed from his ear right before we. Peter glares at Monica, amused. Monica is crouched against the stove, sipping the orange juice. Marvin bounces from the closet. He can't believe what he's tasting. Clarence, still in his pajamas, sits inside Peter's attic, his eye up against the window."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Lester, feeling frustrated, kisses a woman passionately and turns away, observing his wife Carolyn animatedly chatting with Buddy. He notices Ricky, a waiter, who piques his interest. Later, Lester and Ricky smoke a joint behind the hotel. When interrupted, they quickly hide it. Inside, Jane and Angela watch MTV, and Jane leaves as Lester enters the kitchen. Lester is captivated by Angela, who touches his shoulder. Lost in the moment, Lester kisses her, surprising them both. He then pulls a rose petal from his mouth. Jane, irritated, notices Angela, while Carolyn enters, and Lester listens at Jane's door, in disbelief."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Lester still in his suit stands outside Jane's room his ear up against the door He cannot believe what he is hearing Carolyn enters from the dining room Angela is back against the counter drinking the root beer Jane glances at Angela irritated His eyes widen as he pulls a rose petal from his mouth right before we then he reaches up and touches his lips He breaks the kiss looking at her in awe She seems shocked but does not resist as he pulls her toward him with surprising strength He cups her face in his hands and kisses her Close on Lester his eyes narrow slightly then Everything slows down and all sound fades He sees it coming As she does she moves to place her other hand casually on Lester's shoulder Extreme closeup on her hand as it briefly touches his shoulder in slow motion She reaches inside the refrigerator to grab a bottle She starts toward him He turns and is instantly transfixed by Angela leans against the counter twirling her hair Lester enters and opens the refrigerator She starts toward the kitchen Jane switches off the TV Jane and Angela are watching MTV Lester quickly hides the joint behind his back and she goes back inside Carolyn is standing in the open service entrance Lester looks at Ricky who shrugs He goes back inside Ricky hides the joint Suddenly the service entrance opens and a large catering boss in a cheap suit peers out at them Ricky and Lester stand next to a dumpster behind the service entrance to the hotel smoking a joint This situation is loaded and they both know it They look at each other for a beat then look away Buddy seems amused Carolyn is nervous Christy has wandered off Carolyn and Buddy are deep in conversation Lester's surprised but instantly intrigued what does this kid want Finally Lester turns back to Ricky Ricky just stands there watching him Lester looks away scans the crowd then downs the rest of his drink in one gulp Ricky approaches him wearing a waiter's uniform carrying a tray of empty glasses Lester shakes his head She is on smiling animated laughing too loud at their jokes Carolyn is talking to Buddy and Christy Lester takes his drink and turns to face the center of the room The bartender complies A bartender pours him a drink Lester stands at the bar He crosses off Carolyn's smile is frozen on her face He knows this persona well only it is never pissed him off as much as it does right now and he kisses hera soft warm kiss that speaks unmistakably of sexthen turns to the others and grins"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Carolyn's smile is frozen on her face He knows this persona well only it is never pissed him off as much as it does right now and he kisses hera soft warm kiss that speaks unmistakably of sexthen turns to the others and grins Lester stands at the bar He crosses off The bartender complies A bartender pours him a drink Carolyn is talking to Buddy and Christy Lester takes his drink and turns to face the center of the room Lester shakes his head She is on smiling animated laughing too loud at their jokes Lester looks away scans the crowd then downs the rest of his drink in one gulp Ricky approaches him wearing a waiter's uniform carrying a tray of empty glasses Finally Lester turns back to Ricky Ricky just stands there watching him Lester's surprised but instantly intrigued what does this kid want Christy has wandered off Carolyn and Buddy are deep in conversation Buddy seems amused Carolyn is nervous This situation is loaded and they both know it They look at each other for a beat then look away Suddenly the service entrance opens and a large catering boss in a cheap suit peers out at them Ricky and Lester stand next to a dumpster behind the service entrance to the hotel smoking a joint He goes back inside Ricky hides the joint Carolyn is standing in the open service entrance Lester looks at Ricky who shrugs Jane and Angela are watching MTV Lester quickly hides the joint behind his back and she goes back inside She starts toward the kitchen Jane switches off the TV He turns and is instantly transfixed by Angela leans against the counter twirling her hair Lester enters and opens the refrigerator She reaches inside the refrigerator to grab a bottle She starts toward him As she does she moves to place her other hand casually on Lester's shoulder Extreme closeup on her hand as it briefly touches his shoulder in slow motion Everything slows down and all sound fades He sees it coming He cups her face in his hands and kisses her Close on Lester his eyes narrow slightly then He breaks the kiss looking at her in awe She seems shocked but does not resist as he pulls her toward him with surprising strength His eyes widen as he pulls a rose petal from his mouth right before we then he reaches up and touches his lips Angela is back against the counter drinking the root beer Jane glances at Angela irritated He cannot believe what he is hearing Carolyn enters from the dining room Lester still in his suit stands outside Jane's room his ear up against the door"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Lester looks at Ricky who shrugs Carolyn is standing in the open service entrance Lester quickly hides the joint behind his back and she goes back inside Jane and Angela are watching MTV Jane switches off the TV She starts toward the kitchen Lester enters and opens the refrigerator He turns and is instantly transfixed by Angela leans against the counter twirling her hair She starts toward him She reaches inside the refrigerator to grab a bottle Extreme closeup on her hand as it briefly touches his shoulder in slow motion As she does she moves to place her other hand casually on Lester's shoulder He sees it coming Everything slows down and all sound fades Close on Lester his eyes narrow slightly then He cups her face in his hands and kisses her She seems shocked but does not resist as he pulls her toward him with surprising strength He breaks the kiss looking at her in awe then he reaches up and touches his lips His eyes widen as he pulls a rose petal from his mouth right before we Jane glances at Angela irritated Angela is back against the counter drinking the root beer Carolyn enters from the dining room He cannot believe what he is hearing Lester still in his suit stands outside Jane's room his ear up against the door He knows this persona well only it is never pissed him off as much as it does right now and he kisses hera soft warm kiss that speaks unmistakably of sexthen turns to the others and grins Carolyn's smile is frozen on her face He crosses off Lester stands at the bar A bartender pours him a drink The bartender complies Lester takes his drink and turns to face the center of the room Carolyn is talking to Buddy and Christy She is on smiling animated laughing too loud at their jokes Lester shakes his head Ricky approaches him wearing a waiter's uniform carrying a tray of empty glasses Lester looks away scans the crowd then downs the rest of his drink in one gulp Ricky just stands there watching him Finally Lester turns back to Ricky what does this kid want Lester's surprised but instantly intrigued Carolyn and Buddy are deep in conversation Christy has wandered off Carolyn is nervous Buddy seems amused They look at each other for a beat then look away This situation is loaded and they both know it Ricky and Lester stand next to a dumpster behind the service entrance to the hotel smoking a joint Suddenly the service entrance opens and a large catering boss in a cheap suit peers out at them Ricky hides the joint He goes back inside"
        }
      ]
    }
  ]
}