{
  "ground_truth": "Nehru waits for Gandhi and rises when Gandhi enters. The guard signals Gandhi to a chair across a small wooden table from Nehru, and the guard closes the door but remains in the room. Nehru's face is a map of concern, but he manages a small smile of greeting. Gandhi, who also looks worn, raises his eyebrows whimsically at the use of that name, then sighs as their faces and minds go to more somber matters. Gandhi listens to it all with a growing sense of despair. The golden dome of the Temple fills the screen, shimmering, accompanied by the sound of a car and marching feet. The camera pulls back from the dome, revealing the rooftops, the trees, and then, suddenly, the face of General Dyer, blunt, cold, isolated in a cocoon of vengeful military righteousness. He is traveling slowly and steadily in an armored car at the head of fifty armed sepoys — Gurkhas and Baluchis — who are immaculate, precise, and awesome. Behind them, a staff car with Dyer's English ADC and a British police officer follows. It is a relentless, determined procession, filling the dusty street with a sense of menace and foreboding. In a large public garden, enclosed by a thick, old, crumbling wall, a large crowd is gathered around a speaker on a platform at one side of the park. The event is political, but the crowd is mixed with Muslims, Hindus, many Sikhs, old men, little children, and women with babes in arms. The camera closes in on the speaker, a Muslim, who clutches a copy of Gandhi's journal. General Dyer, with his armored car and sepoys, moves toward the gate. Dyer looks ahead calmly toward the Gate of the Bagh, a rickety double gate in the high crumbling wall. Nearer the gate, a few vendors, loiterers, and children turn in curiosity at the sound of the armored car and marching feet. The armored car grinds forward but can't go through the gates, with one fender scraping against the gate post. Dyer gives a quiet order, the car backs away, and he jumps down lightly, a man in splendid condition. He walks through the gate and stands quietly in the at-ease position, hands clasping his swagger stick behind his back, looking off at the speaker. In a medium shot, the sepoys and Dyer are seen. He issues commands in a quiet and unemotional voice, as though they were on maneuvers. A ripple of panic ensues, with everyone pressing back, though they cannot believe what they see. Only one or two have the presence of mind to push clear and seek shelter. In a close shot, Dyer remains calm, and in a flash shot along the line of sepoys, the rifles jerk and bang.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Nehru anticipates Gandhi and rises when Gandhi enters. The sentinel signals Gandhi to a seat across a small wooden table from Nehru, and the sentinel closes the door but stays in the chamber. Nehru's visage is a chart of worry, but he manages a small grin of salutation. Gandhi, who also appears fatigued, raises his eyebrows whimsically at the use of that designation, then sighs as their visages and minds go to more grave matters. Gandhi hearkens to it all with a growing sense of hopelessness. The gilded dome of the Temple fills the display, shimmering, accompanied by the sound of a vehicle and marching feet. The camera pulls back from the dome, unveiling the rooftops, the trees, and then, abruptly, the visage of General Dyer, blunt, cold, isolated in a cocoon of vengeful military justice. He is traveling slowly and steadily in an armored vehicle at the head of fifty armed sepoys — Gurkhas and Baluchis — who are immaculate, precise, and awe-inspiring. Behind them, a staff vehicle with Dyer's English ADC and a British constable follows. It is a relentless, determined cavalcade, filling the dusty road with a sense of menace and foreboding. In a large public garden, encircled by a thick, old, crumbling barrier, a large crowd is assembled around a speaker on a stage at one side of the park. The event is political, but the crowd is mixed with Muslims, Hindus, many Sikhs, old men, little children, and women with babes in arms. The camera closes in on the speaker, a Muslim, who grasps a copy of Gandhi's journal. General Dyer, with his armored vehicle and sepoys, moves toward the gateway. Dyer gazes ahead calmly toward the Gate of the Bagh, a rickety double gate in the high crumbling barrier. Closer to the gateway, a few vendors, loiterers, and children turn in curiosity at the sound of the armored vehicle and marching feet. The armored vehicle grinds forward but can't pass through the gateways, with one fender scraping against the gateway post. Dyer gives a quiet directive, the vehicle backs away, and he leaps down lightly, a man in splendid shape. He walks through the gateway and stands quietly in the at-ease stance, hands clasping his swagger stick behind his back, gazing off at the speaker. In a medium shot, the sepoys and Dyer are noticed. He issues orders in a quiet and unemotional tone, as though they were on exercises. A ripple of panic ensues, with everyone pressing back, though they cannot believe what they see. Only one or two have the presence of mind to push clear and seek refuge. In a close shot, Dyer remains tranquil, and in a flash shot along the line of sepoys, the rifles jerk and bang."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Gandhi is waited for by Nehru, and when Gandhi enters, Nehru rises. Gandhi is signaled to a chair across a small wooden table from Nehru by the guard, and the door is closed by the guard, who remains in the room. A map of concern is on Nehru's face, but a small smile of greeting is managed by him. Gandhi, who also appears worn, whimsically raises his eyebrows at the use of that name, then sighs as their faces and minds focus on more somber matters. A growing sense of despair fills Gandhi as he listens to it all. The screen is filled by the golden dome of the Temple, shimmering and accompanied by the sound of a car and marching feet. The camera reveals the rooftops, the trees, and then, suddenly, the face of General Dyer as it pulls back from the dome — blunt, cold, isolated in a cocoon of vengeful military righteousness. He travels slowly and steadily in an armored car at the head of fifty armed sepoys — Gurkhas and Baluchis — who are immaculate, precise, and awesome. A staff car with Dyer's English ADC and a British police officer follows behind. The dusty street is filled with a sense of menace and foreboding by a relentless, determined procession. Around a speaker on a platform at one side of the park, a large crowd gathers in a large public garden, enclosed by a thick, old, crumbling wall. Although the event is political, the crowd is mixed with Muslims, Hindus, many Sikhs, old men, little children, and women with babes in arms. The camera closes in on the speaker, a Muslim, who clutches a copy of Gandhi's journal. General Dyer, with his armored car and sepoys, moves toward the gate. He looks ahead calmly toward the Gate of the Bagh, a rickety double gate in the high crumbling wall. At the sound of the armored car and marching feet, a few vendors, loiterers, and children near the gate turn in curiosity. The armored car grinds forward but cannot go through the gates, with the gate post scraping against one fender. A quiet order is given by Dyer, the car backs away, and he jumps down lightly, a man in splendid condition. Dyer walks through the gate and stands quietly in the at-ease position, hands clasping his swagger stick behind his back, looking off at the speaker. In a medium shot, Dyer and the sepoys are seen. Commands are issued by him in a quiet and unemotional voice, as though they were on maneuvers. A ripple of panic ensues, with everyone pressing back, though what they see cannot be believed. Only one or two have the presence of mind to push clear and seek shelter. In a close shot, Dyer remains calm, and rifles jerk and bang in a flash shot along the line of sepoys."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Nehru waits for Gandhi and stands when Gandhi enters. The guard directs Gandhi to a chair across a small wooden table from Nehru, then closes the door but stays inside. Nehru's face shows concern, but he manages a small smile. Gandhi, also looking tired, raises his eyebrows at the name, then sighs as they turn to more serious matters. Gandhi listens with growing despair. The golden dome of the Temple shimmers on screen, accompanied by car and marching sounds. The camera pulls back, revealing rooftops and then General Dyer’s cold face, isolated in military righteousness. He travels slowly in an armored car at the head of fifty armed sepoys—Gurkhas and Baluchis—immaculate and precise. Behind them, a staff car with Dyer’s English ADC and a British officer follows, filling the street with menace. In a large public garden enclosed by an old crumbling wall, a diverse crowd gathers around a speaker. The event is political, with Muslims, Hindus, Sikhs, old men, children, and women with babies. The camera focuses on the Muslim speaker holding Gandhi’s journal. Dyer approaches the gate with his forces. He looks calmly at the Bagh’s rickety double gate. Nearby, vendors and children turn curiously at the sound of the car and feet. The armored car moves forward but can't fit through the gates, so Dyer orders it back, jumps down, and walks through, standing at ease with his swagger stick behind his back, watching the speaker. In a medium shot, the sepoys and Dyer are seen. He issues orders quietly, like a drill, causing panic as the crowd presses back. Only a few manage to seek shelter. In a close shot, Dyer stays calm, and the rifles fire in a flash along the line of sepoys."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Nehru waits and rises when Gandhi enters. Gandhi is signaled to a chair across from Nehru, and the guard closes the door but stays inside. Nehru's worried face softens into a small smile, and Gandhi, also weary, raises his eyebrows at the use of his name before their thoughts turn serious. Gandhi listens in despair. A golden dome, accompanied by car and marching sounds, fills the screen. The camera pulls back to reveal General Dyer's cold face, leading fifty precise, awesome sepoys in an armored car. A staff car with Dyer's English ADC and a British officer follows. The procession fills the street with menace. In a public garden, a crowd of mixed backgrounds gathers around a political speaker, a Muslim with Gandhi's journal. Dyer's armored car moves toward a rickety gate in a crumbling wall. Vendors and children turn at the sound. The car can't fit through, so Dyer exits, standing calmly with his swagger stick, observing the speaker. He issues commands quietly, causing panic. Few escape, and Dyer remains calm as sepoys fire."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Nehru, seated with quiet anticipation, patiently waits for the arrival of Gandhi and promptly rises to his feet as soon as Gandhi steps into the room. The guard, standing by attentively, signals Gandhi towards a chair placed strategically across a small wooden table from where Nehru is seated. After Gandhi takes his seat, the guard dutifully closes the door but makes it a point to stay within the confines of the room. Nehru's expression is marked by deep concern, his face resembling a map etched with worry lines; yet, he manages to muster a small, welcoming smile as a form of greeting. Gandhi, who also appears fatigued and worn from the challenges they both shoulder, raises his eyebrows in a whimsical manner at the mention of his name. He then lets out a sigh as both their minds and expressions drift to more grim and somber matters at hand. Gandhi listens intently to everything being discussed, his sense of despair growing with each piece of troubling news.\n\nMeanwhile, the camera transitions to show the golden dome of the Temple, which fills the screen entirely. The dome shimmers under the light, accompanied by ambient sounds of a car engine and the synchronized march of feet. As the camera gradually pulls back from the radiant dome, it reveals a vista of rooftops and trees, painting a broader picture. Suddenly, the face of General Dyer comes into view—his expression is blunt and cold, appearing isolated within a cocoon of vengeful military righteousness. He travels at a slow, deliberate pace in an armored car, leading a contingent of fifty armed sepoys, comprised of Gurkhas and Baluchis. They march with immaculate precision, presenting a formidable and awe-inspiring sight. Following this imposing group is a staff car carrying Dyer's English ADC along with a British police officer. This relentless and determined procession moves through the dusty street, evoking a profound sense of menace and looming foreboding.\n\nIn a large, expansive public garden, enclosed by an old, thick wall that is crumbling with age, a sizable crowd has gathered around a speaker who stands on a platform situated on one side of the park. The event taking place is of a political nature, yet the crowd is a diverse mix, comprising Muslims, Hindus, and many Sikhs, including old men, small children, and women carrying babes in their arms. The camera shifts its focus to close in on the speaker, a Muslim who clutches a copy of Gandhi's journal as he addresses the gathered crowd. General Dyer, with his armored car and sepoys, makes his way toward the park's entrance gate. Dyer looks ahead calmly as he approaches the Gate of the Bagh, a rickety double gate set in the high, crumbling wall. Closer to the gate itself, a few vendors, loiterers, and curious children are drawn to the scene by the sound of the armored car and the marching footsteps. The armored vehicle grinds forward, attempting to pass through the gates, but it is unable to fit, with one fender scraping against a gate post. Dyer quietly issues an order, prompting the car to back away, and he then dismounts with agility, a man seemingly in splendid physical condition. He walks through the gate, adopting a relaxed at-ease stance, his hands gripping his swagger stick behind his back, as he gazes calmly toward the speaker. In a medium shot, both the sepoys and Dyer are visible. Dyer issues commands in a voice that is quiet and devoid of emotion, as if they were merely conducting maneuvers. A wave of panic begins to ripple through the crowd, with everyone pressing back, even as disbelief grips them at the sight they are witnessing. Only one or two individuals have the presence of mind to break free and seek shelter. In a close shot, Dyer remains composed and unflinching, and in a swift flash shot along the line of sepoys, the rifles jerk into motion and fire with a loud bang."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Nehru, positioned with a sense of serene anticipation and quietly collected, patiently awaits Gandhi's arrival. The moment Gandhi steps into the room, Nehru promptly rises to his feet. Meanwhile, a guard, ever vigilant and standing by attentively, gestures for Gandhi to take a seat in the chair strategically placed across the small, wooden table from Nehru's position. Once Gandhi settles into his seat, the guard performs his duty by closing the door, yet ensures he remains present within the room's confines. Nehru's facial expression displays deep-seated concern, his visage resembling a map etched with countless worry lines. Nonetheless, he manages to summon a small, welcoming smile intended as a form of greeting. Gandhi, showing signs of fatigue and weariness from the numerous challenges they both bear, raises his eyebrows whimsically upon hearing his name mentioned. He then emits a heavy sigh as their minds and expressions shift toward the more grave and somber matters at hand. Gandhi listens with intense focus to everything being discussed, his sense of despair mounting with each new piece of troubling news that comes to light.\n\nSimultaneously, the camera transitions its focus, filling the entire screen with the majestic sight of the Temple's golden dome. The dome dazzles under the light, accompanied by ambient sounds of a car engine revving and the synchronized march of feet. As the camera gradually pulls back from the radiant dome, a broader vista of rooftops and trees gradually unfolds, painting a more comprehensive picture of the surroundings. Suddenly, the camera reveals the face of General Dyer, his expression stark and cold, as though he is isolated within a cocoon of vengeful military righteousness. He moves at a slow, deliberate pace in an armored car, at the forefront of a contingent of fifty armed sepoys, consisting of both Gurkhas and Baluchis. These soldiers march with immaculate precision, presenting a sight that is both formidable and awe-inspiring. Trailing this imposing group is a staff car carrying Dyer's English ADC, along with a British police officer. This relentless and determined procession advances through the dusty street, evoking an intense sense of menace and impending foreboding.\n\nIn a vast, expansive public garden enclosed by an ancient, thick wall now crumbling with age, a sizable crowd has gathered around a speaker who stands on a platform on one side of the park. The event unfolding is political in nature, yet the crowd is a diverse mix of individuals, including Muslims, Hindus, and a significant number of Sikhs, encompassing old men, small children, and women carrying babes in their arms. As the camera shifts focus, it closes in on the speaker, a Muslim holding a copy of Gandhi's journal while addressing the engaged crowd. General Dyer, along with his armored car and sepoys, approaches the park's entrance gate. Dyer gazes ahead calmly as he nears the Gate of the Bagh, a battered double gate set within the high, crumbling wall. Closer to the gate, vendors, loiterers, and curious children are drawn to the unfolding scene by the sound of the armored car and the rhythmic marching footsteps. As the armored vehicle grinds forward, it attempts to pass through the gates but becomes stuck, with one fender scraping against a gate post. Dyer quietly issues an order, prompting the vehicle to back away, after which he dismounts with agility, appearing to be in splendid physical condition. He proceeds through the gate, adopting a relaxed, at-ease stance, his hands lightly gripping his swagger stick behind his back as he gazes calmly in the direction of the speaker. In a medium shot, both the sepoys and Dyer come into view. Dyer issues commands in a voice that is quiet and devoid of emotion, as if they were merely conducting routine maneuvers. A wave of panic begins to ripple through the crowd, causing everyone to press back, even as disbelief grips them at the sight unfolding before their eyes. Only one or two individuals have the presence of mind to break free and seek shelter. In a close shot, Dyer remains composed and unflinching, and in a swift flash shot along the line of sepoys, the rifles jerk into motion and discharge with a loud, thunderous bang."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Nehru patiently waits in anticipation for Gandhi's arrival, and as soon as Gandhi enters the room, Nehru rises from his seat, his movements indicating respect and readiness for the meeting. The guard, standing beside them, gestures towards a chair positioned across a small wooden table from Nehru, directing Gandhi to take a seat. After Gandhi settles into the chair, the guard quietly closes the door but chooses to remain inside the room, observing the proceedings. Nehru's face is etched with lines of concern, his expression reflecting the weight of the matters at hand, yet he musters a small, welcoming smile aimed at Gandhi. Gandhi, appearing equally worn from his own burdens, raises his eyebrows in a whimsical acknowledgment of the informal use of his name, a brief moment of levity before both their expressions shift to a more serious demeanor as they mentally prepare to address the somber issues they face. Gandhi immerses himself in the conversation, his attention drawing inward as despair gradually builds within him in response to the unfolding discussion. The scene transitions, and the golden dome of the Temple fills the screen, its shimmering surface accompanied by the ambient sounds of a car engine and the synchronized footfalls of marching feet. The camera slowly pulls back from the dome, methodically revealing the surrounding rooftops and trees, before abruptly focusing on General Dyer's face, which is blunt and cold, encapsulated in an aura of vengeful military righteousness. General Dyer proceeds steadily in an armored car, leading a procession composed of fifty armed sepoys — a mix of Gurkhas and Baluchis — whose appearance is immaculate, precise, and awe-inspiring. Trailing behind them, a staff car carries Dyer's English Aide-de-camp (ADC) and a British police officer, forming part of the relentless and determined procession that progressively fills the dusty street with an atmosphere heavy with menace and foreboding. In a nearby large public garden, enclosed by a thick, old, decaying wall, a significant crowd has assembled around a platform where a speaker is addressing the gathering. The event is unmistakably political in nature, yet the crowd is diverse, comprising Muslims, Hindus, numerous Sikhs, elderly men, little children, and women with infants in their arms. The camera narrows its focus on the speaker, who is a Muslim, and he clutches a copy of Gandhi's journal, holding it as if it is a symbol of the cause they are rallying around. Meanwhile, General Dyer, accompanied by his armored car and sepoys, advances toward the park's entrance, his gaze fixed with calm intent on the Gate of the Bagh, a dilapidated double gate standing tall amid the crumbling wall. As they draw nearer to the gate, a few vendors, loiterers, and children become alerted by the sound of the approaching armored car and the rhythmic footfalls, turning their heads with curiosity. The armored vehicle rumbles forward, attempting to pass through the gate but is thwarted when one of its fenders scrapes against the gate post. In response to the situation, Dyer issues a subdued command, prompting the car to reverse, and he effortlessly alights, demonstrating the agility and conditioning of a seasoned leader. He strides through the gate, assuming a relaxed stance with hands casually clasping his swagger stick behind his back, his gaze fixed intently on the speaker. In a broader shot, the sepoys align with Dyer, who imparts his orders in an even, unemotional tone, as if they are merely conducting maneuvers. This incites a ripple of panic among the crowd, which instinctively presses backward, caught between disbelief and dread at the sight before them. A scant few possess the clarity of mind to break free and seek refuge. Meanwhile, a close-up of Dyer shows him maintaining an unwavering calm, and in a rapid cut along the line of sepoys, their rifles react in sudden, violent motion, jerking upward and erupting in a volley of shots."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Nehru rises to greet Gandhi as he enters. The guard indicates a chair for Gandhi across from Nehru and shuts the door, staying in the room. Nehru, despite appearing concerned, offers a small smile. Gandhi, looking equally worn, acknowledges the situation with a whimsical eyebrow raise before their conversation turns somber, leaving Gandhi increasingly despondent. The scene shifts to a shimmering view of the Temple's golden dome, accompanied by the sounds of a car and marching feet. The camera reveals General Dyer, exuding cold, isolated resolve, advancing in an armored car with fifty armed sepoys—Gurkhas and Baluchis—in precise formation, followed by a staff car carrying Dyer's English ADC and a British police officer. This menacing procession moves through a dusty street. In a nearby public garden encircled by an old wall, a diverse crowd gathers around a speaker, a Muslim holding Gandhi's journal. As Dyer's convoy approaches the Bagh's gate, curious onlookers turn at the noise. The armored car struggles to maneuver through the gates, prompting Dyer to quietly order it back. He disembarks agilely, walks through the gate, and stands at ease, observing the speaker with hands behind his back. A medium shot captures Dyer and the sepoys as he calmly issues commands. Panic ripples through the crowd, with most pressing back in disbelief while a few manage to seek shelter. Dyer remains calm as, in a flash shot, the rifles jerk and bang."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Nehru, known as the first Prime Minister of independent India, waits for Gandhi and rises when Gandhi enters. The guard, a figure of authority in a time of colonial unrest, signals Gandhi to a chair across a small wooden table from Nehru, and the guard closes the door but remains in the room. Nehru's face is a map of concern, but he manages a small smile of greeting. Gandhi, the iconic leader of the Indian independence movement, who also looks worn, raises his eyebrows whimsically at the use of that name, then sighs as their faces and minds go to more somber matters concerning the struggle against British rule. Gandhi listens to it all with a growing sense of despair. The golden dome of the Temple, a reference to the Harmandir Sahib in Amritsar, fills the screen, shimmering, accompanied by the sound of a car and marching feet. The camera pulls back from the dome, revealing the rooftops, the trees, and then, suddenly, the face of General Dyer, infamous for his role in the Jallianwala Bagh massacre, blunt, cold, isolated in a cocoon of vengeful military righteousness. He is traveling slowly and steadily in an armored car at the head of fifty armed sepoys — Gurkhas and Baluchis — who are known for their martial prowess and loyalty, immaculate, precise, and awesome. Behind them, a staff car with Dyer's English ADC and a British police officer follows. It is a relentless, determined procession, filling the dusty street with a sense of menace and foreboding, reminiscent of the oppressive colonial regime. In a large public garden known as Jallianwala Bagh, enclosed by a thick, old, crumbling wall, a large crowd is gathered around a speaker on a platform at one side of the park. The event is political, a protest against the draconian Rowlatt Act, but the crowd is mixed with Muslims, Hindus, many Sikhs, old men, little children, and women with babes in arms. The camera closes in on the speaker, a Muslim, who clutches a copy of Gandhi's journal, the Young India, a symbol of resistance. General Dyer, with his armored car and sepoys, moves toward the gate. Dyer looks ahead calmly toward the Gate of the Bagh, a rickety double gate in the high crumbling wall. Nearer the gate, a few vendors, loiterers, and children turn in curiosity at the sound of the armored car and marching feet. The armored car grinds forward but can't go through the gates, with one fender scraping against the gate post. Dyer gives a quiet order, the car backs away, and he jumps down lightly, a man in splendid condition, despite his age and controversies surrounding his harsh actions. He walks through the gate and stands quietly in the at-ease position, hands clasping his swagger stick behind his back, looking off at the speaker. In a medium shot, the sepoys and Dyer are seen. He issues commands in a quiet and unemotional voice, as though they were on maneuvers, revealing his ruthlessness. A ripple of panic ensues, with everyone pressing back, though they cannot believe what they see. Only one or two have the presence of mind to push clear and seek shelter. In a close shot, Dyer remains calm, and in a flash shot along the line of sepoys, the rifles jerk and bang, marking a brutal moment in history that would galvanize the independence movement."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Nehru's face is a map of concern but he manages a small smile of greeting Gandhi who also looks worn raises his eyebrows whimsically at the use of that name then sighs as their faces and minds go to more somber matters Nehru waits for Gandhi and rises when Gandhi enters It is a relentless determined procession filling the dusty street with a sense of menace and foreboding The guard signals Gandhi to a chair across a small wooden table from Nehru and the guard closes the door but remains in the room a man in splendid condition Nehru's face is a map of concern but he manages a small smile of greeting Gandhi who also looks worn raises his eyebrows whimsically at the use of that name then sighs as their faces and minds go to more somber matters Gandhi listens to it all with a growing sense of despair The golden dome of the Temple fills the screen shimmering accompanied by the sound of a car and marching feet Gandhi listens to it all with a growing sense of despair Nehru waits for Gandhi and rises when Gandhi enters a Muslim who clutches a copy of Gandhi's journal The camera pulls back from the dome revealing the rooftops the trees and then suddenly the face of General Dyer blunt cold isolated in a cocoon of vengeful military righteousness He is traveling slowly and steadily in an armored car at the head of fifty armed sepoys — Gurkhas and Baluchis — who are immaculate precise and awesome Behind them a staff car with Dyer's English ADC and a British police officer follows Behind them a staff car with Dyer's English ADC and a British police officer follows It is a relentless determined procession filling the dusty street with a sense of menace and foreboding The golden dome of the Temple fills the screen shimmering accompanied by the sound of a car and marching feet In a large public garden enclosed by a thick old crumbling wall a large crowd is gathered around a speaker on a platform at one side of the park The event is political but the crowd is mixed with Muslims The armored car grinds forward but cannot go through the gates with one fender scraping against the gate post Hindus many Sikhs old men little children and women with babes in arms General Dyer with his armored car and sepoys moves toward the gate The camera closes in on the speaker A ripple of panic ensues with everyone pressing back though they cannot believe what they see a Muslim who clutches a copy of Gandhi's journal General Dyer with his armored car and sepoys moves toward the gate Dyer looks ahead calmly toward the Gate of the Bagh a rickety double gate in the high crumbling wall Nearer the gate a few vendors loiterers and children turn in curiosity at the sound of the armored car and marching feet Only one or two have the presence of mind to push clear and seek shelter The armored car grinds forward but cannot go through the gates with one fender scraping against the gate post Dyer gives a quiet order the car backs away and he jumps down lightly He walks through the gate and stands quietly in the atease position hands clasping his swagger stick behind his back looking off at the speaker In a close shot Dyer remains calm and in a flash shot along the line of sepoys a man in splendid condition He walks through the gate and stands quietly in the atease position hands clasping his swagger stick behind his back looking off at the speaker In a medium shot the sepoys and Dyer are seen He issues commands in a quiet and unemotional voice as though they were on maneuvers A ripple of panic ensues with everyone pressing back though they cannot believe what they see Only one or two have the presence of mind to push clear and seek shelter In a close shot Dyer remains calm and in a flash shot along the line of sepoys the rifles jerk and bang"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Nehru waits for Gandhi and rises when Gandhi enters. The guard signals Gandhi to a chair across a small wooden table from Nehru and the guard closes the door but remains in the room. Nehru's face is a map of concern but he manages a small smile of greeting Gandhi who also looks worn raises his eyebrows whimsically at the use of that name then sighs as their faces and minds go to more somber matters. Gandhi listens to it all with a growing sense of despair. The golden dome of the Temple fills the screen shimmering accompanied by the sound of a car and marching feet. The camera pulls back from the dome revealing the rooftops the trees and then suddenly the face of General Dyer blunt cold isolated in a cocoon of vengeful military righteousness. He is traveling slowly and steadily in an armored car at the head of fifty armed sepoys — Gurkhas and Baluchis — who are immaculate precise and awesome. Behind them a staff car with Dyer's English ADC and a British police officer follows. It is a relentless determined procession filling the dusty street with a sense of menace and foreboding. In a large public garden enclosed by a thick old crumbling wall a large crowd is gathered around a speaker on a platform at one side of the park. The event is political but the crowd is mixed with Muslims. Hindus many Sikhs old men little children and women with babes in arms. The camera closes in on the speaker. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. a Muslim who clutches a copy of Gandhi's journal. General Dyer with his armored car and sepoys moves toward the gate. Dyer looks ahead calmly toward the Gate of the Bagh a rickety double gate in the high crumbling wall. Nearer the gate a few vendors loiterers and children turn in curiosity at the sound of the armored car and marching feet. The armored car grinds forward but cannot go through the gates with one fender scraping against the gate post. Dyer gives a quiet order. the car backs away and he jumps down lightly. a man in splendid condition. He walks through the gate and stands quietly in the atease position hands clasping his swagger stick behind his back looking off at the speaker. In a medium shot the sepoys and Dyer are seen He issues commands in a quiet and unemotional voice as though they were on maneuvers. A ripple of panic ensues with everyone pressing back though they cannot believe what they see. Only one or two have the presence of mind to push clear and seek shelter. In a close shot Dyer remains calm and in a flash shot along the line of sepoys. the rifles jerk and bang."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Nehru waits for Gandhi and rises when Gandhi enters. The guard signals Gandhi to a chair across a small wooden table from Nehru and the guard closes the door but remains in the room. Nehru's face is a map of concern but he manages a small smile of greeting Gandhi who also looks worn raises his eyebrows whimsically at the use of that name then sighs as their faces and minds go to more somber matters. Gandhi listens to it all with a growing sense of despair. The golden dome of the Temple fills the screen shimmering accompanied by the sound of a car and marching feet. The camera pulls back from the dome revealing the rooftops the trees and then suddenly the face of General Dyer blunt cold isolated in a cocoon of vengeful military righteousness. He is traveling slowly and steadily in an armored car at the head of fifty armed sepoys — Gurkhas and Baluchis — who are immaculate precise and awesome. Behind them a staff car with Dyer's English ADC and a British police officer follows. It is a relentless determined procession filling the dusty street with a sense of menace and foreboding. In a large public garden enclosed by a thick old crumbling wall a large crowd is gathered around a speaker on a platform at one side of the park. The event is political but the crowd is mixed with Muslims. Hindus many Sikhs old men little children and women with babes in arms. The camera closes in on the speaker. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. a Muslim who clutches a copy of Gandhi's journal. General Dyer with his armored car and sepoys moves toward the gate. Dyer looks ahead calmly toward the Gate of the Bagh a rickety double gate in the high crumbling wall. Nearer the gate a few vendors loiterers and children turn in curiosity at the sound of the armored car and marching feet. The armored car grinds forward but cannot go through the gates with one fender scraping against the gate post. Dyer gives a quiet order. the car backs away and he jumps down lightly. a man in splendid condition. He walks through the gate and stands quietly in the atease position hands clasping his swagger stick behind his back looking off at the speaker. In a medium shot the sepoys and Dyer are seen He issues commands in a quiet and unemotional voice as though they were on maneuvers. A ripple of panic ensues with everyone pressing back though they cannot believe what they see. Only one or two have the presence of mind to push clear and seek shelter. In a close shot Dyer remains calm and in a flash shot along the line of sepoys. the rifles jerk and bang."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Nehru waits for Gandhi and rises when Gandhi enters. The guard signals Gandhi to a chair across a small wooden table from Nehru and the guard closes the door but remains in the room. Nehru's face is a map of concern but he manages a small smile of greeting Gandhi who also looks worn raises his eyebrows whimsically at the use of that name then sighs as their faces and minds go to more somber matters. Gandhi listens to it all with a growing sense of despair. The golden dome of the Temple fills the screen shimmering accompanied by the sound of a car and marching feet. The camera pulls back from the dome revealing the rooftops the trees and then suddenly the face of General Dyer blunt cold isolated in a cocoon of vengeful military righteousness. He is traveling slowly and steadily in an armored car at the head of fifty armed sepoys — Gurkhas and Baluchis — who are immaculate precise and awesome. a man in splendid condition. He walks through the gate and stands quietly in the atease position hands clasping his swagger stick behind his back looking off at the speaker. In a medium shot the sepoys and Dyer are seen He issues commands in a quiet and unemotional voice as though they were on maneuvers. A ripple of panic ensues with everyone pressing back though they cannot believe what they see. Only one or two have the presence of mind to push clear and seek shelter. In a close shot Dyer remains calm and in a flash shot along the line of sepoys. the rifles jerk and bang."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Nehru waits for Gandhi and rises when Gandhi enters. The guard signals Gandhi to a chair across a small wooden table from Nehru and the guard closes the door but remains in the room. Nehru's face is a map of concern but he manages a small smile of greeting Gandhi who also looks worn raises his eyebrows whimsically at the use of that name then sighs as their faces and minds go to more somber matters. Only one or two have the presence of mind to push clear and seek shelter. In a close shot Dyer remains calm and in a flash shot along the line of sepoys. the rifles jerk and bang."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Einstein waits for Churchill and rises when Churchill enters. The musician signals Churchill to a chair across a small wooden table from Einstein, and the musician closes the door but remains in the room. Einstein's face is a map of concern, but he manages a small smile of greeting. Churchill, who also looks worn, raises his eyebrows whimsically at the use of that name, then sighs as their faces and minds go to more somber matters. Churchill listens to it all with a growing sense of despair. The golden dome of the Temple fills the screen, shimmering, accompanied by the sound of a car and marching feet. The camera pulls back from the dome, revealing the rooftops, the trees, and then, suddenly, the face of Captain Nemo, blunt, cold, isolated in a cocoon of vengeful military righteousness. He is traveling slowly and steadily in an armored car at the head of fifty armed sepoys — Gurkhas and Baluchis — who are immaculate, precise, and awesome. Behind them, a staff car with Nemo's English ADC and a British police officer follows. It is a relentless, determined procession, filling the dusty street with a sense of menace and foreboding. In a large public garden, enclosed by a thick, old, crumbling wall, a large crowd is gathered around a speaker on a platform at one side of the park. The event is political, but the crowd is mixed with Muslims, Hindus, many Sikhs, old men, little children, and women with babes in arms. The camera closes in on the speaker, a merchant, who clutches a copy of Churchill's journal. Captain Nemo, with his armored car and sepoys, moves toward the gate. Nemo looks ahead calmly toward the Gate of the Bagh, a rickety double gate in the high crumbling wall. Nearer the gate, a few vendors, loiterers, and children turn in curiosity at the sound of the armored car and marching feet. The armored car grinds forward but can't go through the gates, with one fender scraping against the gate post. Nemo gives a quiet order, the car backs away, and he jumps down lightly, a man in splendid condition. He walks through the gate and stands quietly in the at-ease position, hands clasping his swagger stick behind his back, looking off at the speaker. In a medium shot, the sepoys and Nemo are seen. He issues commands in a quiet and unemotional voice, as though they were on maneuvers. A ripple of panic ensues, with everyone pressing back, though they cannot believe what they see. Only one or two have the presence of mind to push clear and seek shelter. In a close shot, Nemo remains calm, and in a flash shot along the line of sepoys, the rifles jerk and bang."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Nehru waits for Gandhi and rises when Gandhi enters. The guard signals Gandhi to a stool across a small marble counter from Nehru, and the guard closes the curtain but remains in the room. Nehru's face is a map of concern, but he manages a small smile of greeting. Gandhi, who also looks worn, raises his eyebrows whimsically at the use of that name, then sighs as their faces and minds go to more somber matters. Gandhi listens to it all with a growing sense of despair. The silver bell of the Cathedral fills the screen, shimmering, accompanied by the sound of a bicycle and marching drums. The camera pulls back from the bell, revealing the verandas, the hedges, and then, suddenly, the face of General Dyer, blunt, cold, isolated in a cocoon of vengeful military righteousness. He is traveling slowly and steadily in a carriage at the head of fifty armed sailors — Zulus and Mongols — who are immaculate, precise, and awesome. Behind them, a tram with Dyer's English ADC and a British constable follows. It is a relentless, determined procession, filling the muddy alley with a sense of menace and foreboding. In a large public amphitheater, enclosed by a thick, old, crumbling hedge, a large crowd is gathered around a speaker on a platform at one side of the plaza. The event is political, but the crowd is mixed with Muslims, Hindus, many Sikhs, old men, little children, and women with babes in arms. The camera closes in on the speaker, a Muslim, who clutches a copy of Gandhi's pamphlet. General Dyer, with his carriage and sailors, moves toward the archway. Dyer looks ahead calmly toward the Arch of the Square, a rickety single arch in the high crumbling hedge. Nearer the archway, a few musicians, loiterers, and children turn in curiosity at the sound of the carriage and marching drums. The carriage grinds forward but can't go through the archway, with one wheel scraping against the archway post. Dyer gives a quiet order, the carriage backs away, and he jumps down lightly, a man in splendid condition. He walks through the archway and stands quietly in the at-ease position, hands clasping his umbrella behind his back, looking off at the speaker. In a medium shot, the sailors and Dyer are seen. He issues commands in a quiet and unemotional voice, as though they were on maneuvers. A ripple of panic ensues, with everyone pressing back, though they cannot believe what they see. Only one or two have the presence of mind to push clear and seek shelter. In a close shot, Dyer remains calm, and in a flash shot along the line of sailors, the batons jerk and bang."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Nehru anticipates for Gandhi and stretches when Gandhi arrives. The guard gestures Gandhi to a chair across a small wooden table from Nehru, and the guard opens the window but remains in the room. Nehru's face is a map of concern, but he attempts a small frown of greeting. Gandhi, who also looks exhausted, lowers his eyebrows whimsically at the use of that name, then chuckles as their faces and minds drift to more somber matters. Gandhi observes it all with a growing sense of confusion. The golden dome of the Temple fills the screen, glistening, accompanied by the sound of a train and marching feet. The camera zooms in from the dome, revealing the rooftops, the trees, and then, suddenly, the face of General Dyer, blunt, cold, isolated in a cocoon of vengeful military righteousness. He is wandering slowly and steadily in an armored car at the head of fifty armed sepoys — Gurkhas and Baluchis — who are immaculate, precise, and awesome. Behind them, a staff car with Dyer's English ADC and a British police officer trails. It is an unyielding, determined procession, filling the dusty street with a sense of anxiety and foreboding. In a large public garden, enclosed by a thick, old, crumbling wall, a large crowd is spread around a speaker on a platform at one side of the park. The event is political, but the crowd is mixed with Muslims, Hindus, many Sikhs, old men, little children, and women with babes in arms. The camera zooms in on the speaker, a Muslim, who grasps a copy of Gandhi's journal. General Dyer, with his armored car and sepoys, maneuvers toward the gate. Dyer glances ahead calmly toward the Gate of the Bagh, a rickety double gate in the high crumbling wall. Nearer the gate, a few vendors, loiterers, and children pivot in curiosity at the sound of the armored car and marching feet. The armored car stutters forward but can't go through the gates, with one fender tapping against the gate post. Dyer gives a quiet signal, the car retreats away, and he leaps down lightly, a man in splendid condition. He strolls through the gate and stands quietly in the at-ease position, hands clasping his swagger stick behind his back, peering off at the speaker. In a medium shot, the sepoys and Dyer are visible. He utters commands in a quiet and unemotional voice, as though they were on maneuvers. A ripple of panic follows, with everyone leaning back, though they cannot believe what they see. Only one or two have the presence of mind to slip clear and find shelter. In a close shot, Dyer remains calm, and in a flash shot along the line of sepoys, the rifles twitch and echo."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Roosevelt waits for Mandela and rises when Mandela enters. The chef signals Mandela to a stool across a large stone bench from Roosevelt, and the chef closes the window but remains in the hallway. Roosevelt's expression is a map of delight, but he manages a small grin of greeting. Mandela, who also looks refreshed, raises his chin whimsically at the use of that label, then yawns as their expressions and thoughts go to more lighthearted matters. Mandela listens to it all with a growing sense of hope. The silver tower of the Castle fills the screen, shimmering, accompanied by the sound of a bicycle and skipping ropes. The lens pulls back from the tower, revealing the balconies, the flowers, and then, suddenly, the face of Captain Philips, tall, warm, isolated in a cocoon of cheerful civilian confidence. He is traveling swiftly and gracefully in a wooden cart at the head of twenty unarmed musicians — violinists and cellists — who are casual, relaxed, and inspiring. Behind them, a supply cart with Philips's French translator and an Italian poet follows. It is a vibrant, upbeat parade, filling the neat avenue with a sense of celebration and anticipation. In a small private orchard, enclosed by a thin, new, polished fence, a tiny group is gathered around a guitarist on a platform at one side of the grove. The event is educational, but the group is mixed with Christians, Buddhists, many Jains, young women, little boys, and men with puppies in arms. The lens closes in on the guitarist, a Jain, who clutches a copy of Mandela's diary. Captain Philips, with his wooden cart and musicians, moves toward the entrance. Philips looks ahead cheerfully toward the Entrance of the Orchard, a sturdy single door in the low polished fence. Nearer the entrance, a few painters, loungers, and youths turn in curiosity at the sound of the wooden cart and skipping ropes. The wooden cart grinds forward but can't go through the door, with one wheel scraping against the door frame. Philips gives a quiet suggestion, the cart backs away, and he leaps down lightly, a person in glorious condition. He walks through the door and stands quietly in the relaxed position, hands gripping his walking stick behind his back, looking off at the guitarist. In a moderate shot, the musicians and Philips are seen. He issues requests in a calm and unexcitable voice, as though they were at a rehearsal. A wave of excitement ensues, with everyone pressing forward, though they cannot believe what they hear. Only one or two have the perception to push clear and seek an audience. In a close shot, Philips remains cheerful, and in a snapshot along the line of musicians, the instruments strum and hum."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Einstein waits for Darwin and ascends when Darwin enters. The gardener gestures Darwin to a chair across a small wooden table from Einstein, and the gardener opens the window but stays in the room. Einstein's demeanor is a map of curiosity, but he manages a small frown of greeting. Darwin, who also seems energized, nods his eyebrows inquisitively at the sound of that title, then chuckles as their faces and thoughts drift to more joyful topics. Darwin tunes out with a growing sense of disbelief. The silver tower of the Observatory dominates the scene, glowing, accompanied by the sound of a bicycle and singing birds. The camera shifts away from the tower, revealing the fields, the flowers, and then, unexpectedly, the face of Captain Nemo, stern, warm, isolated in a bubble of imaginative nautical grandeur. He is moving swiftly and confidently in a sailboat at the rear of fifty flying seagulls — albatrosses and petrels — who are majestic, graceful, and captivating. Behind them, a fishing boat with Nemo's Irish sailor and a Dutch navigator trails. It is a harmonious, serene flotilla, filling the clear sky with a sense of wonder and anticipation. In a large botanical garden, surrounded by a vibrant, lush, verdant hedge, a large gathering is assembled around a musician on a podium at one edge of the park. The occasion is educational, but the gathering is blended with Christians, Buddhists, many Druids, young women, elderly gentlemen, and students with sketchbooks in hands. The camera focuses on the musician, a Buddhist, who hugs a collection of Darwin's letters. Captain Nemo, with his sailboat and seagulls, drifts toward the entrance. Nemo gazes forward dreamily toward the Arch of the Glen, a sturdy iron archway in the tall verdant hedge. Closer to the entrance, a few herbalists, dreamers, and artists glance in curiosity at the sight of the sailboat and flying birds. The sailboat drifts forward but can’t pass through the archway, with one mast scraping against the arch post. Nemo gives a soft suggestion, the boat glides back, and he steps down gracefully, a man in excellent condition. He strolls through the entrance and stands silently in the relaxed pose, hands grasping his fishing rod behind his back, gazing off at the musician. In a middle shot, the seagulls and Nemo are seen. He delivers directions in a quiet and uplifting tone, as though they were on vacation. A ripple of excitement ensues, with everyone moving forward, though they cannot fathom what they feel. Only one or two have the presence of mind to step aside and catch a breath. In a close shot, Nemo stays cheerful, and in a quick shot along the line of seagulls, the wings flap and flutter."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Nehru waits for Gandhi and stretches when Gandhi enters. The guard gestures Gandhi to a sofa across an ornate glass aquarium from Nehru, and the guard opens the window but remains in the room. Nehru's face is a canvas of curiosity, but he manages a broad grin of greeting. Gandhi, who also looks weary, tilts his head quizzically at the mention of that name, then chuckles as their faces and minds drift to more joyful matters. Gandhi hears it all with a growing sense of hope. The silver spire of the Cathedral fills the screen, glistening, accompanied by the sound of a bicycle and clapping hands. The camera zooms out from the spire, revealing the courtyards, the flowers, and then, suddenly, the face of General Dyer, blunt, stoic, cocooned in a bubble of solemn military poise. He is moving briskly and deliberately in an armored boat at the head of fifty armed guards — Gurkhas and Baluchis — who are polished, methodical, and awe-inspiring. Behind them, a supply truck with Dyer's English aide and a British mailman follows. It is an unstoppable, resolute procession, filling the bustling street with a sense of anticipation and excitement. In a small private library, enclosed by a thin, new, glistening fence, a small group is gathered around a singer on a podium at one side of the hall. The event is musical, but the group is mixed with Christians, Buddhists, many Jains, young women, elderly ladies, and men with children in arms. The camera focuses on the singer, a Buddhist, who clutches a copy of Gandhi's diary. General Dyer, with his armored boat and guards, moves toward the entrance. Dyer looks ahead calmly toward the Arch of the Pavilion, a sturdy single archway in the low gleaming fence. Nearer the arch, a few artists, wanderers, and musicians turn in curiosity at the sound of the armored boat and clapping hands. The armored boat glides forward but can't go through the arch, with one paddle scraping against the arch post. Dyer gives a soft signal, the boat glides back, and he leaps down lightly, a man in remarkable condition. He strolls through the arch and stands quietly in the relaxed position, hands holding his compass behind his back, gazing at the singer. In a medium shot, the guards and Dyer are seen. He delivers instructions in a soft and detached voice, as though they were on a parade. A ripple of excitement ensues, with everyone pressing forward, though they cannot comprehend what they witness. Only one or two have the presence of mind to step back and enjoy the show. In a close-up, Dyer remains calm, and in a flash shot along the line of guards, the fireworks shimmer and crackle."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Einstein anticipates Da Vinci and leaps when Da Vinci saunters in. The astronaut gestures Da Vinci to a cushion beside a large stone boulder from Einstein, and the astronaut locks the window but lingers in the space. Einstein's expression is a tapestry of joy, yet he tries for a broad grin of farewell. Da Vinci, who also seems vibrant, arches his shoulders humorously at the mention of that title, then giggles as their eyes and thoughts drift to more cheerful topics. Da Vinci watches it all with an increasing sense of joy. The emerald mountain of the Fortress fills the display, glistening, accompanied by the sound of a horse and whispering leaves. The camera pushes forward from the mountain, unveiling the valleys, the rivers, and then, suddenly, the profile of Captain Nemo, cheerful, warm, ensconced in a nest of friendly naval integrity. He is floating rapidly and lightly in a sailboat at the tail of fifty unarmed sailors — Pirates and Rebels — who are disheveled, relaxed, and endearing. Ahead of them, a cargo ship with Nemo's French aide and an American teacher leads. It is a cheerful, carefree parade, adorning the paved boulevard with a sense of hope and excitement. In a tiny private forest, surrounded by a sleek, new, blossoming fence, a small gathering is dispersed near a musician on a tower at another side of the yard. The performance is theatrical, but the gathering is blended with Christians, Buddhists, many Buddhists, young women, teenage boys, and men with guitars in hands. The camera pulls out on the musician, a Buddhist, who embraces a copy of Da Vinci’s sketchbook. Captain Nemo, with his sailboat and sailors, drifts away from the passage. Nemo glances back eagerly toward the Passage of the Grove, a sturdy single entrance in the low blossoming fence. Further from the entrance, several bakers, travelers, and birds pause in excitement at the sight of the sailboat and whispering leaves. The sailboat soars backward but can't glide over the entrances, with one rudder scratching against the entrance pillar. Nemo gives a loud declaration, the boat speeds forward, and he hops up stiffly, a man in shabby condition. He skips around the entrance and cheers quietly in the tense position, arms waving his wooden flute over his head, gazing away from the musician. In a wide shot, the sailors and Nemo are hidden. He conveys pleas in a loud and emotional tune, as though they were on adventures. A wave of laughter blossoms, with everyone moving ahead, though they cannot grasp what they sense. Only a few have the instinct to relax and find comfort. In a faraway shot, Nemo stays tense, and in a slow glimpse beyond the group of sailors, the flowers sway and clink."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Nehru waits anxiously for Gandhi, who enters looking worn, and they exchange greetings with underlying concern. Their conversation turns somber, filling Gandhi with despair. Meanwhile, the scene shifts to General Dyer, isolated and cold, leading a procession of armed sepoys through a town, creating an ominous atmosphere. In a public garden, a diverse crowd gathers around a speaker holding Gandhi's journal. Dyer approaches the garden's gate with his armored car but can't pass through due to its size. Calmly, he exits the vehicle, issues orders, and surveys the crowd as if on military maneuvers. Panic spreads as Dyer commands his sepoys, and rifles fire, creating chaos among the crowd."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "the rifles jerk and bang In a close shot Dyer remains calm and in a flash shot along the line of sepoys Only one or two have the presence of mind to push clear and seek shelter A ripple of panic ensues with everyone pressing back though they cannot believe what they see In a medium shot the sepoys and Dyer are seen He issues commands in a quiet and unemotional voice as though they were on maneuvers He walks through the gate and stands quietly in the atease position hands clasping his swagger stick behind his back looking off at the speaker a man in splendid condition the car backs away and he jumps down lightly Dyer gives a quiet order The armored car grinds forward but cannot go through the gates with one fender scraping against the gate post Nearer the gate a few vendors loiterers and children turn in curiosity at the sound of the armored car and marching feet Dyer looks ahead calmly toward the Gate of the Bagh a rickety double gate in the high crumbling wall General Dyer with his armored car and sepoys moves toward the gate a Muslim who clutches a copy of Gandhi's journal The camera closes in on the speaker Hindus many Sikhs old men little children and women with babes in arms The event is political but the crowd is mixed with Muslims In a large public garden enclosed by a thick old crumbling wall a large crowd is gathered around a speaker on a platform at one side of the park It is a relentless determined procession filling the dusty street with a sense of menace and foreboding Behind them a staff car with Dyer's English ADC and a British police officer follows He is traveling slowly and steadily in an armored car at the head of fifty armed sepoys — Gurkhas and Baluchis — who are immaculate precise and awesome The camera pulls back from the dome revealing the rooftops the trees and then suddenly the face of General Dyer blunt cold isolated in a cocoon of vengeful military righteousness The golden dome of the Temple fills the screen shimmering accompanied by the sound of a car and marching feet Gandhi listens to it all with a growing sense of despair Nehru's face is a map of concern but he manages a small smile of greeting Gandhi who also looks worn raises his eyebrows whimsically at the use of that name then sighs as their faces and minds go to more somber matters The guard signals Gandhi to a chair across a small wooden table from Nehru and the guard closes the door but remains in the room Nehru waits for Gandhi and rises when Gandhi enters"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Nearer the gate a few vendors loiterers and children turn in curiosity at the sound of the armored car and marching feet The camera closes in on the speaker In a large public garden enclosed by a thick old crumbling wall a large crowd is gathered around a speaker on a platform at one side of the park the rifles jerk and bang the car backs away and he jumps down lightly He is traveling slowly and steadily in an armored car at the head of fifty armed sepoys — Gurkhas and Baluchis — who are immaculate precise and awesome The camera pulls back from the dome revealing the rooftops the trees and then suddenly the face of General Dyer blunt cold isolated in a cocoon of vengeful military righteousness The event is political but the crowd is mixed with Muslims Dyer looks ahead calmly toward the Gate of the Bagh a rickety double gate in the high crumbling wall In a medium shot the sepoys and Dyer are seen He issues commands in a quiet and unemotional voice as though they were on maneuvers Hindus many Sikhs old men little children and women with babes in arms Dyer gives a quiet order The guard signals Gandhi to a chair across a small wooden table from Nehru and the guard closes the door but remains in the room General Dyer with his armored car and sepoys moves toward the gate Only one or two have the presence of mind to push clear and seek shelter a Muslim who clutches a copy of Gandhi's journal Nehru's face is a map of concern but he manages a small smile of greeting Gandhi who also looks worn raises his eyebrows whimsically at the use of that name then sighs as their faces and minds go to more somber matters The armored car grinds forward but cannot go through the gates with one fender scraping against the gate post In a close shot Dyer remains calm and in a flash shot along the line of sepoys The golden dome of the Temple fills the screen shimmering accompanied by the sound of a car and marching feet He walks through the gate and stands quietly in the atease position hands clasping his swagger stick behind his back looking off at the speaker Behind them a staff car with Dyer's English ADC and a British police officer follows It is a relentless determined procession filling the dusty street with a sense of menace and foreboding A ripple of panic ensues with everyone pressing back though they cannot believe what they see Nehru waits for Gandhi and rises when Gandhi enters Gandhi listens to it all with a growing sense of despair a man in splendid condition"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "General Dyer with his armored car and sepoys moves toward the gate Dyer looks ahead calmly toward the Gate of the Bagh a rickety double gate in the high crumbling wall Nearer the gate a few vendors loiterers and children turn in curiosity at the sound of the armored car and marching feet The armored car grinds forward but cannot go through the gates with one fender scraping against the gate post Dyer gives a quiet order the car backs away and he jumps down lightly a man in splendid condition He walks through the gate and stands quietly in the atease position hands clasping his swagger stick behind his back looking off at the speaker In a medium shot the sepoys and Dyer are seen He issues commands in a quiet and unemotional voice as though they were on maneuvers A ripple of panic ensues with everyone pressing back though they cannot believe what they see Only one or two have the presence of mind to push clear and seek shelter In a close shot Dyer remains calm and in a flash shot along the line of sepoys the rifles jerk and bang Nehru waits for Gandhi and rises when Gandhi enters The guard signals Gandhi to a chair across a small wooden table from Nehru and the guard closes the door but remains in the room Nehru's face is a map of concern but he manages a small smile of greeting Gandhi who also looks worn raises his eyebrows whimsically at the use of that name then sighs as their faces and minds go to more somber matters Gandhi listens to it all with a growing sense of despair The golden dome of the Temple fills the screen shimmering accompanied by the sound of a car and marching feet The camera pulls back from the dome revealing the rooftops the trees and then suddenly the face of General Dyer blunt cold isolated in a cocoon of vengeful military righteousness He is traveling slowly and steadily in an armored car at the head of fifty armed sepoys — Gurkhas and Baluchis — who are immaculate precise and awesome Behind them a staff car with Dyer's English ADC and a British police officer follows It is a relentless determined procession filling the dusty street with a sense of menace and foreboding In a large public garden enclosed by a thick old crumbling wall a large crowd is gathered around a speaker on a platform at one side of the park The event is political but the crowd is mixed with Muslims Hindus many Sikhs old men little children and women with babes in arms The camera closes in on the speaker a Muslim who clutches a copy of Gandhi's journal"
        }
      ]
    }
  ]
}