{
  "ground_truth": "He has deliberately if delicately caught the eye of both Jinnah and Maulana Azad during this. His smile flitters cynically on the mouths of the others on his side. He looks at them all, then up at Lord Chelmsford behind them. The top is lifted, whiskey pours. The camera pulls back. We are still in the Council Room, but time has passed. The Indian delegation has gone, and the British are relaxing as a servant pours. And they all laugh. There are some smiles, but not all of them are quite so amused. It is an instruction they all find correct. A roar of approval from a huge crowd. We are featuring two British soldiers, their faces partially lit by a flickering torch light that reveals their tense wariness. And we can see its cause. A huge crowd is gathered around a platform -- torches sprinkled through it -- and their mood is confident, belligerent. As their defiant roar carries through the night air we see that Gandhi sits cross-legged on the platform. Patel, now for the first time in an Indian tunic, and Azad, also in an Indian tunic. Desai, Gandhi's new male secretary, is with them. But it is Ba who is speaking at the microphone, who has brought the shout of defiance from the crowd. It is the end of her speech and she makes the pranam and turns away. There is applause and noise, but Ba does not acknowledge it; she simply sits cross-legged behind Gandhi, who is talking with Patel and Nehru. At last he rises, and the noise and applause increase to something like chaos. In close shot we see other British soldiers watching on the perimeter of the crowd and they are now made even more wary by the enthusiasm of this greeting. Gandhi fiddles with his glasses, preoccupied; finally he looks out over the crowd and holds up a hand -- almost lazily -- and gradually, but quite definitely, the crowd stills. We intercut with the crowd, listening raptly. Gandhi holds up one finger. Neither of these goals is easy, and the audience reaction shows it. Now Gandhi raises a third finger. And the crowd breaks into stamping and applause. Gandhi lets it run for a time, then stills it with the one small gesture as before. This has sobered the audience somewhat. Now he looks out across them as though seeking something. There is an excited stir; he silences it. As suitcoats, shirts, vests, trousers, are flung into a pile. Featuring the two British soldiers -- later -- on the edge of the crowd, staring off, their faces now brightly lit by darting flames. A huge triangular pile burns before the platform, an excited half-naked crowd swirling in the shadows around it.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He possesses intentionally if delicately seized the gaze of both Jinnah and Maulana Azad during this. His grin flutters cynically on the lips of the others on his side. He observes at them all, then up at Lord Chelmsford behind them. The lid is elevated, whiskey flows. The camera withdraws. We are still in the Council Room, but time has elapsed. The Indian delegation has departed, and the British are unwinding as a servant serves. And they all chuckle. There are some grins, but not all of them are quite so entertained. It is an direction they all find suitable. A roar of approval from a enormous throng. We are featuring two British soldiers, their visages partially illuminated by a flickering torchlight that reveals their tense vigilance. And we can see its cause. A enormous throng is assembled around a platform -- torches scattered through it -- and their mood is assured, combative. As their defiant roar carries through the night air we see that Gandhi sits cross-legged on the platform. Patel, now for the first time in an Indian tunic, and Azad, also in an Indian tunic. Desai, Gandhi's new male assistant, is with them. But it is Ba who is addressing at the microphone, who has elicited the shout of defiance from the throng. It is the end of her speech and she makes the pranam and turns away. There is applause and clamor, but Ba does not acknowledge it; she simply sits cross-legged behind Gandhi, who is conversing with Patel and Nehru. At last he rises, and the clamor and applause intensify to something like chaos. In close shot we see other British soldiers observing on the boundary of the throng and they are now rendered even more wary by the enthusiasm of this reception. Gandhi fiddles with his spectacles, preoccupied; finally he observes out over the throng and holds up a hand -- almost lazily -- and gradually, but quite certainly, the throng stills. We intercut with the throng, listening intently. Gandhi holds up one finger. Neither of these aims is simple, and the audience reaction shows it. Now Gandhi raises a third finger. And the throng breaks into stamping and applause. Gandhi lets it run for a time, then stills it with the one small motion as before. This has sobered the audience slightly. Now he observes out across them as though seeking something. There is an excited stir; he silences it. As jackets, shirts, vests, trousers, are flung into a stack. Featuring the two British soldiers -- later -- on the edge of the throng, staring off, their visages now brightly lit by darting flames. A enormous triangular stack blazes before the platform, an excited half-naked throng swirling in the shadows around it."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He has deliberately if delicately caught the eye of both Jinnah and Maulana Azad during this. A cynical smile is flittered on the mouths of the others on his side by him. All of them are looked at by him, then Lord Chelmsford is looked up at by him behind them. The top is lifted, whiskey pours. The camera pulls back. The Council Room is still where we are, but time has passed. The Indian delegation has gone, and the British are relaxing as a servant pours. And they all laugh. Some smiles are there, but not all of them are quite so amused. An instruction they all find correct is present. A huge roar of approval comes from a crowd. Two British soldiers are featured by us, their faces partially lit by a flickering torch light that reveals their tense wariness. And we can see its cause. A huge crowd gathers around a platform -- torches are sprinkled through it -- and their mood is confident, belligerent. As their defiant roar carries through the night air, it is seen that Gandhi sits cross-legged on the platform. Now, for the first time in an Indian tunic, Patel and Azad, also in an Indian tunic. Desai, Gandhi's new male secretary, is with them. But Ba speaks at the microphone, bringing the shout of defiance from the crowd. The end of her speech comes and the pranam is made by her before she turns away. Applause and noise are present, but Ba does not acknowledge them; she simply sits cross-legged behind Gandhi, who talks with Patel and Nehru. At last, he rises, and something like chaos is created by the increase in noise and applause. In close shot, other British soldiers are seen by us watching on the perimeter of the crowd and they now find themselves made even more wary by the enthusiasm of this greeting. Gandhi fiddles with his glasses, preoccupied; finally, the crowd is looked out over by him and a hand is held up -- almost lazily -- by him, and gradually, but quite definitely, the crowd is stilled. We intercut with the crowd, listening raptly. Gandhi holds up one finger. Neither of these goals are easy, and the audience reaction shows it. Now Gandhi raises a third finger. And stamping and applause are broken into by the crowd. For a time, Gandhi lets it run, then with the one small gesture as before, it is stilled by him. This somewhat sobers the audience. Now across them, he looks out as though seeking something. An excited stir is present; it is silenced by him. As suitcoats, shirts, vests, trousers, are flung into a pile. The two British soldiers are featured later on the edge of the crowd, staring off, their faces now brightly lit by darting flames. Before the platform, a huge triangular pile is burned by an excited half-naked crowd swirling in the shadows around it."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He catches the attention of Jinnah and Maulana Azad with a deliberate yet subtle gesture. A cynical smile appears on his colleagues' faces as he glances at them and then at Lord Chelmsford. Whiskey is poured as the camera pulls back, revealing the Council Room with time having passed. The Indian delegation is gone, and the British relax with a servant pouring drinks. Laughter and smiles are present, though not all are amused. A huge crowd roars in approval. Two British soldiers, partially lit by flickering torchlight, watch warily. A confident and belligerent crowd surrounds a platform with torches, where Gandhi sits cross-legged. Patel and Azad are in Indian tunics, joined by Desai, Gandhi's new secretary. Ba speaks at the microphone, eliciting a defiant shout from the crowd. She finishes her speech with a pranam and joins Gandhi, who speaks with Patel and Nehru. Gandhi rises, intensifying the noise and applause. British soldiers on the perimeter grow more wary as Gandhi calms the crowd with a raised hand. He raises fingers to convey goals, each gesture met with varying audience reactions. A third finger raises energy and applause, then Gandhi quiets them with a small gesture, introducing sobriety. He scans the crowd, silencing an excited stir. Clothes are tossed into a pile, and two British soldiers observe from the edge, their faces illuminated by flames. A large triangular fire burns, surrounded by an excited, half-naked crowd."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He subtly catches the eye of both Jinnah and Maulana Azad, his cynical smile mirrored by allies. He glances at them and Lord Chelmsford. Whiskey is poured, the camera pulls back, and time has passed in the Council Room. The Indian delegation is gone, the British relax, laughing as a servant pours. Some are not amused, finding the instruction apt. A crowd's roar features two British soldiers, their faces tense in torchlight. A confident, defiant crowd surrounds a platform, torches scattered. Gandhi sits cross-legged with Patel, Azad in Indian tunics, and Desai, Gandhi's secretary. Ba speaks at the microphone, inciting defiant shouts. After her speech and pranam, she sits behind Gandhi with Patel and Nehru. Gandhi rises, applause turns chaotic. British soldiers on the crowd's edge grow wary. Gandhi, preoccupied, raises a hand, quieting the crowd, who listens intently as he raises fingers, prompting varied reactions. The crowd is stirred, then stilled. Clothes are flung into a pile. British soldiers watch as flames light their faces, a huge triangular fire burns, and a half-naked crowd swirls in shadows."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "During this scene of significant tension, he has deliberately, though with a certain delicacy, managed to catch the attention of both Jinnah and Maulana Azad. His smile flitters cynically, mirrored on the lips of the others who are on his side of the deliberation. With a sweeping glance, he takes in the entire group, before shifting his gaze upward to look at Lord Chelmsford, who stands behind them. As the moment unfolds, the top is lifted, and whiskey flows freely. The camera begins to pull back, revealing that we remain in the imposing Council Room, yet some time has subtly passed. The members of the Indian delegation have since departed, leaving the British contingent behind to relax as a servant continues to pour drinks. They collectively erupt into laughter; some faces bear smiles, though not all appear equally amused by the proceedings. It is an instruction that they all seem to find appropriate or correct. A powerful roar of approval reverberates from an enormous crowd outside. We are drawn to two British soldiers whose faces are only partially illuminated by the flickering torchlight, revealing their tense wariness. The reason for their anxiety is apparent: A massive crowd is gathered around a platform, torches scattered throughout, exuding an air of confidence and belligerence. As the defiant roar echoes through the night air, it becomes clear that Gandhi is seated cross-legged upon the platform. Patel, for the first time donning an Indian tunic, along with Azad, similarly dressed, are present alongside him. Desai, who serves as Gandhi's new male secretary, accompanies them. However, it is Ba who commands the crowd’s attention at the microphone, having stirred this shout of defiance with her speech. As she finishes, she performs the pranam and turns away. Applause and noise flood the scene, but Ba does not acknowledge it and simply seats herself cross-legged behind Gandhi, who is engaged in conversation with Patel and Nehru. Eventually, Gandhi rises, and the noise and applause swell to near chaos. We cut to see other British soldiers on the outskirts of the crowd, their wariness now heightened by the exuberant welcome. Gandhi, appearing preoccupied, adjusts his glasses; after a moment, he gazes out over the crowd and raises a hand—almost lazily—and gradually, yet definitively, the crowd begins to quiet. We intercut with the audience, listening with intense focus. Gandhi raises one finger. The audience’s reaction is a testament to the challenge posed by these goals. He now lifts a third finger, prompting the crowd to erupt into stamping and applause. Gandhi allows this to continue for a moment, then silences it with a simple, small gesture as before. This action has somewhat sobered the gathered listeners. Now, Gandhi looks out across them as though searching for something specific. An excited stir arises, and he quells it. Clothes—suit coats, shirts, vests, trousers—are tossed into a growing pile. The scene features the two British soldiers once more, now at a later point, on the crowd's periphery, their faces vividly lit by the flickering flames. A towering triangular pile of clothing burns voraciously before the platform, an excited, half-naked crowd swirling like shadows around it."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In this tense and significant scene, he carefully, yet with a measure of deliberate grace, manages to draw the attention of both Jinnah and Maulana Azad towards himself. His smile, which is laden with a hint of cynicism, flickers momentarily before appearing on the lips of those who align with him in the course of the ongoing deliberation. With a wide, sweeping glance, he surveys the entire assembled group, then shifts his gaze upward to focus on Lord Chelmsford, who stands resolutely behind them. As the moment stretches out, the top is ceremoniously lifted, allowing whiskey to flow generously and unimpeded. The camera slowly begins to pull back, revealing our continued presence in the grand and imposing Council Room, while subtly indicating that some time has passed without notice. The members of the Indian delegation have long since taken their leave, leaving the British contingent behind to unwind in a more relaxed environment as a servant dutifully continues to pour drinks for them. They collectively erupt into fits of laughter; some faces are adorned with broad smiles, though not all seem equally entertained by the events taking place. It is an instruction that they all seem to find fitting or apt. A powerful roar of approval suddenly reverberates from a massive crowd gathered outside. Our attention is drawn to two British soldiers whose faces are only partially illuminated by the flickering, unsteady torchlight, which reveals their tense and wary expressions. The source of their anxiety is evident: a massive crowd has assembled around a platform, with torches scattered liberally throughout, exuding a palpable air of confidence and belligerence. As the defiant roar echoes persistently through the night air, it becomes evident that Gandhi is seated cross-legged upon the platform. Patel, for the first time wearing an Indian tunic, accompanies him, along with Azad, similarly clad in traditional attire. Desai, who now serves as Gandhi's new male secretary, is also present among them. However, it is Ba who commands the crowd’s attention at the microphone, having incited this powerful shout of defiance with her stirring speech. As she concludes, she performs the pranam gesture and gracefully turns away. Waves of applause and noise flood the scene, but Ba offers no acknowledgment and simply seats herself cross-legged behind Gandhi, as he engages in conversation with Patel and Nehru. Eventually, Gandhi rises, and the noise and applause swell to near chaotic levels. We cut to witness other British soldiers positioned at the periphery of the crowd, their wariness now amplified by the exuberant welcome. Gandhi, appearing deep in thought, adjusts his glasses; after a brief moment, he looks out over the vast crowd and raises a hand—almost leisurely—and gradually, but firmly, the crowd begins to quiet down. We intercut with the audience, who are listening with rapt and intense focus. Gandhi raises a single finger. The audience’s intense reaction is a testament to the formidable challenge posed by these goals. He then lifts a third finger, inciting the crowd to erupt into a frenzy of stamping and applause. Gandhi permits this to persist for a moment longer, then silences it with a simple, small gesture as he did before. This action has somewhat sobered the gathered listeners. Now, Gandhi gazes out across them as though searching for something or someone specific. An excited stir arises among them, and he quickly quells it. Clothes—suit coats, shirts, vests, trousers—are tossed with abandon into a growing pile. The scene features the two British soldiers once more, now seen at a later point, stationed at the crowd's periphery, their faces vividly illuminated by the flickering, fiery flames. A towering, triangular pile of clothing burns voraciously before the platform, while an excited, half-naked crowd swirls and moves like shadows around it."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He carefully and deliberately captures the attention of both Jinnah and Maulana Azad, his gaze meeting theirs with a delicate intention. A cynical smile plays subtly on the faces of the others accompanying him, reflecting a shared sentiment. His eyes sweep over all present before shifting upwards to meet the gaze of Lord Chelmsford, who stands behind them. As the top is lifted, whiskey pours into glasses, and the camera slowly pulls back to reveal the setting. We remain in the Council Room, but time has elapsed; the Indian delegation has departed, leaving behind only the British, who now appear relaxed as a servant fills their glasses. Laughter echoes among them, with some smiles playing more genuinely than others; however, not everyone shares in the amusement, as it seems to be an instruction that they all agree is correct. Their approval is punctuated by a roar from a massive crowd. In the flickering torchlight, two British soldiers stand with their faces partially illuminated, revealing an expression of tense wariness. The reason behind their apprehension is evident: a vast crowd surrounds a platform, sporadically lit by torches, exuding a mood of belligerent confidence. The defiant roar pierces the night air as Gandhi sits cross-legged on the platform. Patel, for the first time, sports an Indian tunic, as does Azad, with Desai, Gandhi's new male secretary, in their company. However, it is Ba's voice at the microphone that ignites the crowd's shout of defiance. As she nears the end of her speech, she performs a pranam and turns away, facing the applause and noise without acknowledging them, instead calmly taking a seat cross-legged behind Gandhi, who is deep in conversation with Patel and Nehru. Eventually, Gandhi rises, prompting the noise and applause to swell to a chaotic crescendo. In a close shot, we see other British soldiers positioned at the crowd's perimeter, their wariness heightened by the fervor of the greeting. Gandhi, while fiddling with his glasses and appearing preoccupied, finally directs his gaze over the crowd and lifts a hand almost lazily, yet with enough command that the crowd gradually stills. Interspersed shots show the crowd listening intently. Gandhi then raises one finger, acknowledging that neither of the goals he speaks of is easy, as evidenced by the audience's reaction. With the introduction of a third finger, the crowd erupts into stamping and applause. Gandhi allows the enthusiasm to run its course for a while before quieting it once again with a simple gesture, sobering the audience. His eyes scan them as if searching for something, leading to an excited stir, which he promptly silences. As various articles of clothing, including suitcoats, shirts, vests, and trousers, are tossed into a pile, we return to the focus on the two British soldiers at the edge of the crowd, their faces now brightly lit by the dancing flames. A massive triangular pile blazes before the platform, and an excited, half-naked crowd swirls in the shadows around it."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He deliberately catches the attention of Jinnah and Maulana Azad, sharing a cynical smile with his allies before looking at Lord Chelmsford. Whiskey is poured, and the scene shifts to show the Council Room later with the British delegation relaxing as a servant pours drinks, accompanied by laughter and mixed reactions. Meanwhile, a huge crowd surrounds a platform under a flickering torchlight, creating a tense atmosphere for two British soldiers observing. On the platform, Gandhi sits cross-legged with Patel and Azad, both wearing Indian tunics, and Desai nearby. Ba speaks at the microphone, inciting a defiant roar from the crowd. After her speech, she makes the pranam and sits behind Gandhi, who rises amid increasing applause and chaos. British soldiers watch warily from the crowd’s perimeter as Gandhi, while fiddling with his glasses, quiets the audience with a raised hand. The crowd listens intently as he raises his fingers to convey his message, reacting with applause and stamping. Gandhi calms them again with a gesture, then scans the audience, inciting an excited stir that he quickly silences. Clothing is thrown into a pile as two British soldiers watch from the edge of the crowd, their faces illuminated by flames near the large burning pile, around which a half-naked crowd swirls in the shadows."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He has deliberately if delicately caught the eye of both Jinnah, the leader of the All-India Muslim League and a key figure in the Indian independence movement, and Maulana Azad, an important Indian scholar and freedom fighter known for his role in the Congress Party, during this. His smile flitters cynically on the mouths of the others on his side. He looks at them all, then up at Lord Chelmsford, the Viceroy of India at the time, behind them. The top is lifted, whiskey pours, a reminder of the British tradition of socializing over drinks. The camera pulls back. We are still in the Council Room, which is part of the colonial administrative buildings, but time has passed. The Indian delegation has gone, and the British are relaxing as a servant pours, a common practice indicating the prevalent class divides of the era. And they all laugh. There are some smiles, but not all of them are quite so amused. It is an instruction they all find correct. A roar of approval from a huge crowd, reminiscent of the mass movements sweeping across India. We are featuring two British soldiers, their faces partially lit by a flickering torch light that reveals their tense wariness, suggesting their awareness of the charged atmosphere. And we can see its cause. A huge crowd is gathered around a platform -- torches sprinkled through it -- and their mood is confident, belligerent, reflecting the rising nationalistic fervor. As their defiant roar carries through the night air we see that Gandhi, the iconic leader of the Indian independence movement, sits cross-legged on the platform. Patel, later known as the 'Iron Man of India', now for the first time in an Indian tunic symbolizing unity with traditional values, and Azad, also in an Indian tunic as a gesture of solidarity. Desai, Gandhi's new male secretary known for his diligence, is with them. But it is Ba, affectionately known as Kasturba Gandhi, Gandhi's wife and a stalwart of the movement, who is speaking at the microphone, who has brought the shout of defiance from the crowd. It is the end of her speech and she makes the pranam, a traditional Indian gesture of respect, and turns away. There is applause and noise, but Ba does not acknowledge it; she simply sits cross-legged behind Gandhi, who is talking with Patel and Nehru, a future Prime Minister of India. At last he rises, and the noise and applause increase to something like chaos. In close shot we see other British soldiers watching on the perimeter of the crowd and they are now made even more wary by the enthusiasm of this greeting. Gandhi fiddles with his glasses, a habitual gesture showing his thoughtfulness, preoccupied; finally he looks out over the crowd and holds up a hand -- almost lazily -- and gradually, but quite definitely, the crowd stills. We intercut with the crowd, listening raptly. Gandhi holds up one finger, a sign of unity, echoing his vision of a cohesive nation. Neither of these goals is easy, and the audience reaction shows it. Now Gandhi raises a third finger, symbolizing an additional facet of his message. And the crowd breaks into stamping and applause, an expression of their solidarity and enthusiasm. Gandhi lets it run for a time, then stills it with the one small gesture as before. This has sobered the audience somewhat. Now he looks out across them as though seeking something. There is an excited stir; he silences it. As suitcoats, shirts, vests, trousers, considered symbols of British colonial influence, are flung into a pile. Featuring the two British soldiers -- later -- on the edge of the crowd, staring off, their faces now brightly lit by darting flames. A huge triangular pile burns before the platform, an excited half-naked crowd swirling in the shadows around it, symbolizing a rejection of colonial dominance and the embracing of indigenous identity."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He has deliberately if delicately caught the eye of both Jinnah and Maulana Azad during this. His smile flitters cynically on the mouths of the others on his side. He looks at them all then up at Lord Chelmsford behind them. The top is lifted. whiskey pours. The camera pulls back. We are still in the Council Room but time has passed. The Indian delegation has gone and the British are relaxing as a servant pours. And they all laugh. There are some smiles but not all of them are quite so amused. It is an instruction they all find correct. A roar of approval from a huge crowd. We are featuring two British soldiers their faces partially lit by a flickering torch light that reveals their tense wariness. And we can see its because. A huge crowd is gathered around a platform  torches sprinkled through it  and their mood is confident belligerent. As their defiant roar carries through the night air we see that Gandhi sits crosslegged on the platform. Patel now for the first time in an Indian tunic and Azad also in an Indian tunic. Desai Gandhi's new male secretary is with them. But it is Ba who is speaking at the microphone who has brought the shout of defiance from the crowd. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. It is the end of her speech and she makes the pranam and turns away. There is applause and noise but Ba does not acknowledge it. she simply sits crosslegged behind Gandhi who is talking with Patel and Nehru. At last he rises and the noise and applause increase to something like chaos. In close shot we see other British soldiers watching on the perimeter of the crowd and they are now made even more wary by the enthusiasm of this greeting. Gandhi fiddles with his glasses preoccupied. finally he looks out over the crowd and holds up a hand  almost lazily  and gradually but quite definitely the crowd stills. We intercut with the crowd listening raptly. Gandhi holds up one finger. Neither of these goals is easy and the audience reaction shows it. Now Gandhi raises a third finger. And the crowd breaks into stamping and applause. Gandhi let us it run for a time then stills it with the one small gesture as before. This has sobered the audience somewhat. Now he looks out across them as though seeking something. There is an excited stir. he silences it. As suitcoats shirts vests trousers are flung into a pile. Featuring the two British soldiers  later  on the edge of the crowd staring off their faces now brightly lit by darting flames. A huge triangular pile burns before the platform an excited halfnaked crowd swirling in the shadows around it."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He has deliberately if delicately caught the eye of both Jinnah and Maulana Azad during this. His smile flitters cynically on the mouths of the others on his side. He looks at them all then up at Lord Chelmsford behind them. The top is lifted. whiskey pours. The camera pulls back. We are still in the Council Room but time has passed. The Indian delegation has gone and the British are relaxing as a servant pours. And they all laugh. There are some smiles but not all of them are quite so amused. It is an instruction they all find correct. A roar of approval from a huge crowd. We are featuring two British soldiers their faces partially lit by a flickering torch light that reveals their tense wariness. And we can see its because. A huge crowd is gathered around a platform  torches sprinkled through it  and their mood is confident belligerent. As their defiant roar carries through the night air we see that Gandhi sits crosslegged on the platform. Patel now for the first time in an Indian tunic and Azad also in an Indian tunic. Desai Gandhi's new male secretary is with them. But it is Ba who is speaking at the microphone who has brought the shout of defiance from the crowd. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. It is the end of her speech and she makes the pranam and turns away. There is applause and noise but Ba does not acknowledge it. she simply sits crosslegged behind Gandhi who is talking with Patel and Nehru. At last he rises and the noise and applause increase to something like chaos. In close shot we see other British soldiers watching on the perimeter of the crowd and they are now made even more wary by the enthusiasm of this greeting. Gandhi fiddles with his glasses preoccupied. finally he looks out over the crowd and holds up a hand  almost lazily  and gradually but quite definitely the crowd stills. We intercut with the crowd listening raptly. Gandhi holds up one finger. Neither of these goals is easy and the audience reaction shows it. Now Gandhi raises a third finger. And the crowd breaks into stamping and applause. Gandhi let us it run for a time then stills it with the one small gesture as before. This has sobered the audience somewhat. Now he looks out across them as though seeking something. There is an excited stir. he silences it. As suitcoats shirts vests trousers are flung into a pile. Featuring the two British soldiers  later  on the edge of the crowd staring off their faces now brightly lit by darting flames. A huge triangular pile burns before the platform an excited halfnaked crowd swirling in the shadows around it."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He has deliberately if delicately caught the eye of both Jinnah and Maulana Azad during this. His smile flitters cynically on the mouths of the others on his side. He looks at them all then up at Lord Chelmsford behind them. The top is lifted. whiskey pours. The camera pulls back. We are still in the Council Room but time has passed. The Indian delegation has gone and the British are relaxing as a servant pours. And they all laugh. There are some smiles but not all of them are quite so amused. Now Gandhi raises a third finger. And the crowd breaks into stamping and applause. Gandhi let us it run for a time then stills it with the one small gesture as before. This has sobered the audience somewhat. Now he looks out across them as though seeking something. There is an excited stir. he silences it. As suitcoats shirts vests trousers are flung into a pile. Featuring the two British soldiers  later  on the edge of the crowd staring off their faces now brightly lit by darting flames. A huge triangular pile burns before the platform an excited halfnaked crowd swirling in the shadows around it."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He has deliberately if delicately caught the eye of both Jinnah and Maulana Azad during this. His smile flitters cynically on the mouths of the others on his side. He looks at them all then up at Lord Chelmsford behind them. The top is lifted. he silences it. As suitcoats shirts vests trousers are flung into a pile. Featuring the two British soldiers  later  on the edge of the crowd staring off their faces now brightly lit by darting flames. A huge triangular pile burns before the platform an excited halfnaked crowd swirling in the shadows around it."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "She has whimsically yet gingerly borrowed the focus of both Napoleon and Marie Curie during this. Her grin flickers mischievously on the noses of the creatures on her side. She gazes at them all, then down at Colonel Sanders beneath them. The lid is opened, juice spills. The drone zooms forward. We are still in the Library Chamber, but seasons have shifted. The Brazilian envoy has vanished, and the Martians are lounging as a zebra serves. And they all giggle. There are some chuckles, but not all of them are quite so entertained. It is a directive they all find accurate. A chuckle of agreement from a massive flock. We are spotlighting two Martian chefs, their elbows partially illuminated by a fading lantern glow that exposes their eager curiosity. And we can observe its trigger. A massive flock is grouped around a stage -- lanterns scattered through it -- and their temper is bold, boisterous. As their brazen chuckle travels through the afternoon breeze we observe that Hemingway lounges reclined on the stage. Picasso, now for the first time in a Martian toga, and Curie, also in a Martian toga. Einstein, Hemingway's new female assistant, is beside them. But it is Tess who is singing at the banjo, who has drawn the cheer of support from the flock. It is the peak of her melody and she gives a bow and glides aside. There is laughter and clamor, but Tess does not react to it; she merely lounges reclined beside Hemingway, who is conversing with Picasso and Tesla. Eventually, he climbs, and the clamor and laughter surge to something like pandemonium. In focused shot we glimpse different Martian chefs observing on the border of the flock and they are now made even more tense by the fervor of this welcome. Hemingway adjusts his monocle, absorbed; eventually he peers beyond the flock and raises a foot -- almost lazily -- and gradually, but quite certainly, the flock calms. We intercut with the flock, listening attentively. Hemingway raises one toe. Neither of these quests is simple, and the spectators' response indicates it. Now Hemingway lifts a fourth toe. And the flock erupts into clapping and stomping. Hemingway lets it roll for a spell, then calms it with the one tiny motion as before. This has mellowed the spectators somewhat. Now he peers across them as though searching for something. There is an animated murmur; he quiets it. As hoodies, jeans, hoodies, socks, are tossed into a mound. Spotlighting the two Martian chefs -- eventually -- on the verge of the flock, staring into the distance, their elbows now brightly illuminated by flickering embers. A massive hexagonal mound blazes before the stage, an animated half-dressed flock swirling in the twilight surrounding it."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "He subtly captures the attention of both Jinnah and Maulana Azad while cynically grinning at his colleagues. He glances at Lord Chelmsford as a servant pours whiskey for the relaxed British delegation, who laugh at the situation. Two British soldiers are wary of a huge, confident crowd gathered around a platform where Gandhi sits with Patel, Azad, and Desai. Ba delivers a speech that incites defiance, then sits behind Gandhi, who rises to enthusiastic applause. The soldiers become more cautious as Gandhi calms the crowd with simple gestures. He lifts fingers to convey goals, prompting mixed reactions. As he searches for something across the audience, excitement stirs but is silenced. Clothes are thrown into a burning pile, with two British soldiers observing, now lit by the flames amidst the swirling crowd."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "A huge triangular pile burns before the platform an excited halfnaked crowd swirling in the shadows around it Featuring the two British soldiers  later  on the edge of the crowd staring off their faces now brightly lit by darting flames As suitcoats shirts vests trousers are flung into a pile he silences it There is an excited stir Now he looks out across them as though seeking something This has sobered the audience somewhat Gandhi let us it run for a time then stills it with the one small gesture as before And the crowd breaks into stamping and applause Now Gandhi raises a third finger Neither of these goals is easy and the audience reaction shows it Gandhi holds up one finger We intercut with the crowd listening raptly finally he looks out over the crowd and holds up a hand  almost lazily  and gradually but quite definitely the crowd stills Gandhi fiddles with his glasses preoccupied In close shot we see other British soldiers watching on the perimeter of the crowd and they are now made even more wary by the enthusiasm of this greeting At last he rises and the noise and applause increase to something like chaos she simply sits crosslegged behind Gandhi who is talking with Patel and Nehru There is applause and noise but Ba does not acknowledge it It is the end of her speech and she makes the pranam and turns away But it is Ba who is speaking at the microphone who has brought the shout of defiance from the crowd Desai Gandhi's new male secretary is with them Patel now for the first time in an Indian tunic and Azad also in an Indian tunic As their defiant roar carries through the night air we see that Gandhi sits crosslegged on the platform A huge crowd is gathered around a platform  torches sprinkled through it  and their mood is confident belligerent And we can see its because We are featuring two British soldiers their faces partially lit by a flickering torch light that reveals their tense wariness A roar of approval from a huge crowd It is an instruction they all find correct There are some smiles but not all of them are quite so amused And they all laugh The Indian delegation has gone and the British are relaxing as a servant pours We are still in the Council Room but time has passed The camera pulls back whiskey pours The top is lifted He looks at them all then up at Lord Chelmsford behind them His smile flitters cynically on the mouths of the others on his side He has deliberately if delicately caught the eye of both Jinnah and Maulana Azad during this"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "His smile flitters cynically on the mouths of the others on his side He has deliberately if delicately caught the eye of both Jinnah and Maulana Azad during this The top is lifted He looks at them all then up at Lord Chelmsford behind them The camera pulls back whiskey pours The Indian delegation has gone and the British are relaxing as a servant pours We are still in the Council Room but time has passed There are some smiles but not all of them are quite so amused And they all laugh A roar of approval from a huge crowd It is an instruction they all find correct And we can see its because We are featuring two British soldiers their faces partially lit by a flickering torch light that reveals their tense wariness As their defiant roar carries through the night air we see that Gandhi sits crosslegged on the platform A huge crowd is gathered around a platform  torches sprinkled through it  and their mood is confident belligerent Desai Gandhi's new male secretary is with them Patel now for the first time in an Indian tunic and Azad also in an Indian tunic It is the end of her speech and she makes the pranam and turns away But it is Ba who is speaking at the microphone who has brought the shout of defiance from the crowd she simply sits crosslegged behind Gandhi who is talking with Patel and Nehru There is applause and noise but Ba does not acknowledge it In close shot we see other British soldiers watching on the perimeter of the crowd and they are now made even more wary by the enthusiasm of this greeting At last he rises and the noise and applause increase to something like chaos finally he looks out over the crowd and holds up a hand  almost lazily  and gradually but quite definitely the crowd stills Gandhi fiddles with his glasses preoccupied Gandhi holds up one finger We intercut with the crowd listening raptly Now Gandhi raises a third finger Neither of these goals is easy and the audience reaction shows it Gandhi let us it run for a time then stills it with the one small gesture as before And the crowd breaks into stamping and applause Now he looks out across them as though seeking something This has sobered the audience somewhat he silences it There is an excited stir Featuring the two British soldiers  later  on the edge of the crowd staring off their faces now brightly lit by darting flames As suitcoats shirts vests trousers are flung into a pile A huge triangular pile burns before the platform an excited halfnaked crowd swirling in the shadows around it"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "There is applause and noise but Ba does not acknowledge it she simply sits crosslegged behind Gandhi who is talking with Patel and Nehru At last he rises and the noise and applause increase to something like chaos In close shot we see other British soldiers watching on the perimeter of the crowd and they are now made even more wary by the enthusiasm of this greeting Gandhi fiddles with his glasses preoccupied finally he looks out over the crowd and holds up a hand  almost lazily  and gradually but quite definitely the crowd stills We intercut with the crowd listening raptly Gandhi holds up one finger Neither of these goals is easy and the audience reaction shows it Now Gandhi raises a third finger And the crowd breaks into stamping and applause Gandhi let us it run for a time then stills it with the one small gesture as before This has sobered the audience somewhat Now he looks out across them as though seeking something There is an excited stir he silences it As suitcoats shirts vests trousers are flung into a pile Featuring the two British soldiers  later  on the edge of the crowd staring off their faces now brightly lit by darting flames A huge triangular pile burns before the platform an excited halfnaked crowd swirling in the shadows around it He has deliberately if delicately caught the eye of both Jinnah and Maulana Azad during this His smile flitters cynically on the mouths of the others on his side He looks at them all then up at Lord Chelmsford behind them The top is lifted whiskey pours The camera pulls back We are still in the Council Room but time has passed The Indian delegation has gone and the British are relaxing as a servant pours And they all laugh There are some smiles but not all of them are quite so amused It is an instruction they all find correct A roar of approval from a huge crowd We are featuring two British soldiers their faces partially lit by a flickering torch light that reveals their tense wariness And we can see its because A huge crowd is gathered around a platform  torches sprinkled through it  and their mood is confident belligerent As their defiant roar carries through the night air we see that Gandhi sits crosslegged on the platform Patel now for the first time in an Indian tunic and Azad also in an Indian tunic Desai Gandhi's new male secretary is with them But it is Ba who is speaking at the microphone who has brought the shout of defiance from the crowd It is the end of her speech and she makes the pranam and turns away"
        }
      ]
    }
  ]
}