{
  "ground_truth": "At the small train station near the ashram, a train pulls in as Kallenbach, beside a new Ford touring car, watches. As people disembark, he moves forward through the crowded platform, his Indian tunic unable to disguise his incisive, patrician lawyer demeanor. Amidst the chaos of Third Class passengers, Maulana Azad emerges, carrying a baby wrapped in rags, followed by the child's mother with her two little ones. Azad hands the baby to the mother, who thanks him, and he makes a small salaam before moving toward the camera. Kallenbach is with Patel, who grins; like most witty men, he loves wit in others, though he groans at times. They turn back to the train just as Mirabehn (Madeleine Slade), a tall, pretty, and extremely English woman despite her sari, tips a porter and takes a small bag. She pauses upon seeing a now-startled Kallenbach. In a different setting, the camera pans from a row of sandals by the door to a room where Gandhi sits facing Patel and Azad, carding fiber to thread while Desai makes notes in the background. Mirabehn, seated near Ba, listens intently as Gandhi's discussions unfold. Ba's spinning remains constant as Gandhi, after a solemn exchange with Azad, turns to Mirabehn, noticing her sari approvingly before a shadow passes. Mirabehn beams, nods, and exchanges a warm, teasing smile with Ba, marking the start of a lasting friendship. In a small town, six Indian police constables observe a torchlight parade with challenging disdain. The marchers, wearing loincloths and tunics, brandish torn English cloth and shout in unison.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "At the little railway depot close to the ashram, a locomotive arrives as Kallenbach, beside a new Ford touring car, observes. As individuals alight, he advances forward through the congested platform, his Indian tunic unable to mask his sharp, aristocratic attorney demeanor. Amidst the bedlam of Third Class travelers, Maulana Azad appears, holding an infant wrapped in rags, followed by the child's mother with her two small ones. Azad passes the infant to the mother, who thanks him, and he makes a small salaam before moving toward the camera. Kallenbach is with Patel, who smiles; like most humorous men, he enjoys humor in others, though he groans at intervals. They turn back to the train just as Mirabehn (Madeleine Slade), a tall, attractive, and extremely English woman despite her sari, tips a porter and takes a small bag. She pauses upon noticing a now-startled Kallenbach. In a different environment, the camera pans from a row of sandals by the entrance to a room where Gandhi sits facing Patel and Azad, carding fiber to thread while Desai makes notes in the background. Mirabehn, seated near Ba, listens attentively as Gandhi's conversations unfold. Ba's spinning remains constant as Gandhi, after a serious exchange with Azad, turns to Mirabehn, noticing her sari approvingly before a shadow passes. Mirabehn beams, nods, and shares a warm, teasing grin with Ba, marking the start of a lasting friendship. In a small town, six Indian police constables watch a torchlight procession with challenging disdain. The marchers, wearing loincloths and tunics, brandish torn English cloth and shout in unison."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "At the small train station near the ashram, a train is pulled in by Kallenbach's watchful gaze beside a new Ford touring car. As people disembark, the crowded platform is moved forward through by him, his Indian tunic unable to disguise his incisive, patrician lawyer demeanor. Amidst the chaos of Third Class passengers, a baby wrapped in rags is carried by Maulana Azad, followed by the child's mother with her two little ones. The baby is handed to the mother by Azad, who is thanked by her, and a small salaam is made by him before he moves toward the camera. Patel is with Kallenbach, who is grinned at; like most witty men, wit in others is loved by him, though at times he groans. The train is turned back to by them just as a porter is tipped by Mirabehn (Madeleine Slade), a tall, pretty, and extremely English woman despite her sari, and a small bag is taken. Kallenbach, now startled, is paused upon by her. In a different setting, a row of sandals by the door is panned from by the camera to a room where Patel and Azad face Gandhi, who cards fiber to thread while Desai makes notes in the background. Near Ba, an attentive ear is given by Mirabehn as Gandhi's discussions unfold. Ba spins constantly as a solemn exchange with Azad is completed by Gandhi, who then turns to Mirabehn, whose sari is noticed approvingly by him before a shadow passes. Mirabehn beams, nods, and a warm, teasing smile is exchanged with Ba by her, marking the start of a lasting friendship. In a small town, a torchlight parade is observed with challenging disdain by six Indian police constables. Torn English cloth is brandished by the marchers, who shout in unison while wearing loincloths and tunics."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "At the small train station near the ashram, a train arrives as Kallenbach, beside a new Ford touring car, observes. As passengers disembark, he navigates the crowded platform, his Indian tunic hardly concealing his patrician lawyer demeanor. Amidst the Third Class chaos, Maulana Azad appears with a baby swaddled in rags, followed by the mother and her two children. Azad passes the baby to the mother, who thanks him as he makes a small salaam before moving onward. Kallenbach stands with Patel, who grins, appreciating wit in others despite sometimes groaning. They turn back to the train as Mirabehn (Madeleine Slade), a tall, pretty English woman in a sari, tips a porter and takes a small bag. She pauses at the sight of a startled Kallenbach. Elsewhere, the camera shows sandals by the door and pans to a room where Gandhi sits facing Patel and Azad, carding fiber while Desai takes notes. Mirabehn, near Ba, listens intently as Gandhi speaks. Ba spins continuously as Gandhi, after a serious exchange with Azad, turns to Mirabehn, approving her sari before a shadow passes. Mirabehn beams, nods, and shares a warm, teasing smile with Ba, signaling the start of their friendship. In a small town, six Indian constables observe a torchlight parade with challenging disdain as marchers in loincloths and tunics brandish torn English cloth, shouting in unison."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "At the small train station near the ashram, a train arrives, watched by Kallenbach beside a new Ford touring car. He moves forward on the crowded platform, his Indian tunic not hiding his lawyer demeanor. Amidst Third Class chaos, Maulana Azad appears, carrying a baby wrapped in rags, followed by the child's mother with two little ones. Azad hands over the baby, receives thanks, and makes a small salaam before approaching the camera. Kallenbach and Patel, who appreciates wit despite groaning at times, grin before turning to the train as Mirabehn (Madeleine Slade), tall and English despite her sari, tips a porter and grabs a small bag. She pauses, seeing a startled Kallenbach. Elsewhere, the camera pans from sandals to a room where Gandhi faces Patel and Azad, carding fiber while Desai takes notes. Mirabehn, near Ba, listens intently to Gandhi's discussions. Ba spins as Gandhi exchanges solemn words with Azad and then notices Mirabehn's sari approvingly. She beams, nods, and shares a warm, teasing smile with Ba. In a small town, six Indian police constables disdainfully observe a torchlight parade of marchers in loincloths and tunics, brandishing torn English cloth and shouting in unison."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "At the quaint and rather small train station located near the serene ashram, a train gradually pulls into the station while Kallenbach stands beside a brand-new Ford touring car, observing attentively. As the train comes to a halt, passengers begin to disembark, and Kallenbach advances through the bustling and crowded platform. His Indian tunic fails to completely conceal his incisive and patrician demeanor that reflects his background as a lawyer. Amidst the swirling chaos of Third Class passengers, Maulana Azad makes his entrance, carrying a small baby wrapped in rags. He is followed closely by the child's mother, who has her two little ones in tow. Azad gently hands the baby back to the mother, who expresses her gratitude, and he responds with a small, respectful salaam before moving purposefully toward the camera. Kallenbach is accompanied by Patel, who offers a wide grin; known for his wit, like most clever men, he appreciates wit in others, even though he sometimes groans in response. They both turn their attention back to the train right at the moment when Mirabehn, also known as Madeleine Slade, makes her appearance. She is a tall, attractive, and thoroughly English woman, even though she is dressed in a sari. She tips a porter courteously and collects a small bag. She pauses for a moment, noticing a now-startled Kallenbach. \n\nIn a different setting, the camera sweeps from a neat row of sandals placed by the door to a room where Gandhi is seated facing Patel and Azad. Gandhi is carding fiber to thread while Desai is in the background, diligently making notes. Mirabehn is seated nearby, close to Ba, listening intently to the discussions unfolding around her. Ba continues her spinning without pause. After a solemn exchange with Azad, Gandhi takes a moment to turn his attention to Mirabehn, approvingly noting her sari, before a shadow momentarily passes. Mirabehn beams with a bright smile, nodding, and she shares a warm and teasing smile with Ba, marking the beginning of what would become a lasting friendship.\n\nIn a small town setting, six Indian police constables observe the scene of a torchlight parade with a challenging sense of disdain. The marchers, clad in loincloths and tunics, brandish pieces of torn English cloth and shout in unison, demonstrating their unity and purpose."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "At the charming and relatively small train station positioned in close proximity to the tranquil and peaceful ashram, a train gradually and steadily makes its way into the station, with Kallenbach standing attentively beside a pristine and newly acquired Ford touring car, closely observing the scene. As the train finally comes to a halt, passengers begin to disembark, and Kallenbach advances through the bustling and crowded platform, which is filled with noise and activity. His Indian tunic, though traditional, does not completely conceal his incisive and patrician demeanor, which unmistakably reflects his background and experience as a lawyer. Amidst the swirling chaos created by the many Third Class passengers, Maulana Azad makes his entrance, carefully carrying a small baby wrapped in worn rags. He is followed closely by the child's mother, who has her two little ones closely in tow. Azad gently and tenderly hands the baby back to the mother, who expresses her heartfelt gratitude, and he responds with a small, respectful salaam before moving purposefully toward the camera. Kallenbach is accompanied by Patel, who offers a wide and welcoming grin; known for his wit, like most clever men, he has a deep appreciation for wit in others, even though he sometimes groans in response. Together, they both turn their attentive gaze back to the train right at the very moment when Mirabehn, also known by her given name, Madeleine Slade, makes her appearance. She is a tall, attractive, and thoroughly English woman, even though she is dressed in a sari. She courteously tips a porter and collects a small bag. She pauses for a brief moment, noticing a now-surprised and startled Kallenbach. \n\nIn a completely different setting, the camera sweeps from a neatly arranged row of sandals placed meticulously by the door to a room where Gandhi is seated facing both Patel and Azad. Gandhi is diligently carding fiber to thread while Desai is situated in the background, attentively making notes. Mirabehn is seated nearby, close to Ba, listening intently and fully engaged in the discussions unfolding around her. Ba continues her spinning without pause or interruption. After a solemn exchange of words with Azad, Gandhi takes a brief moment to turn his attention to Mirabehn, approvingly and kindly noting her sari, before a shadow momentarily passes. Mirabehn beams with a bright, joyful smile, nodding, and she shares a warm and teasing smile with Ba, marking the beginning of what would blossom into a lasting and cherished friendship.\n\nIn a small-town setting, six Indian police constables observe the scene of a torchlight parade with a challenging and palpable sense of disdain. The marchers, clad in loincloths and tunics, brandish pieces of torn English cloth and shout in unison, fervently demonstrating their unity and shared purpose."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "At the small train station near the ashram, the arrival of a train is marked by its gradual slowing until it comes to a definitive halt, with steam billowing gently from its sides. Standing beside the gleaming new Ford touring car, Kallenbach observes the scene with a discerning eye. As the train doors open and passengers begin to disembark, Kallenbach steps forward into the throng of people, skillfully navigating the crowded platform amidst the bustling movement all around him. His Indian tunic, despite its local style, does little to obscure the sharp, authoritative air of his patrician lawyer demeanor. As the chaos of Third Class passengers unfolds, Maulana Azad gently emerges from the crowd, cradling a baby wrapped in tattered rags, with the child's mother following closely behind, accompanied by her two little ones. Azad carefully hands the baby back to the mother, who expresses her gratitude towards him, prompting Azad to offer a small, respectful salaam before he purposefully moves toward the camera. Meanwhile, Kallenbach is seen with Patel, who exhibits a broad grin; being a lover of wit, Patel enjoys cleverness in others, although he sometimes groans at their remarks. The pair turns their attention back to the train just in time to see Mirabehn (Madeleine Slade), a notably tall, pretty, and unmistakably English woman despite her sari, graciously tipping a porter and collecting a small bag. She halts momentarily upon noticing Kallenbach, who appears astonished by her presence. In a different setting, the camera transitions smoothly from a neat row of sandals by the door to a serene room where Gandhi sits, facing Patel and Azad. Gandhi's hands are rhythmically engaged in carding fiber to thread, while Desai quietly makes notes in the background. Mirabehn is seated close to Ba, listening intently to the ongoing discussions spearheaded by Gandhi. Ba maintains her spinning with unwavering focus as Gandhi completes a solemn exchange with Azad, then turns his attention to Mirabehn, approvingly acknowledging her sari. A shadow briefly passes over the scene as Mirabehn beams with delight, nods in agreement, and then shares a warm, teasing smile with Ba, marking the beginning of what will become a lasting friendship. Meanwhile, in a small town, six Indian police constables stand in observance, their expressions locked in challenging disdain as they watch a torchlight parade unfold. The marchers, clad in loincloths and tunics, brandish torn English cloth with fervor, their voices rising together in a powerful, unified shout."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "At the small train station near the ashram, Kallenbach stands by a new Ford touring car, observing the train's arrival. As people disembark, he navigates the bustling platform, maintaining his composed lawyer demeanor. Amidst the Third Class chaos, Maulana Azad appears with a baby, returning it to its grateful mother, and makes a respectful salaam before approaching the camera. Accompanied by Patel, who appreciates good wit, Kallenbach turns back to the train as Mirabehn (Madeleine Slade), distinctly English despite her sari, tips a porter and collects her bag. She hesitates upon seeing the startled Kallenbach. In another scene, the camera shifts from sandals by the door to a room where Gandhi sits with Patel and Azad, carding fiber, as Desai takes notes. Mirabehn listens attentively, seated near Ba, who spins continuously. After a thoughtful exchange with Azad, Gandhi acknowledges Mirabehn's sari with approval, leading to a shadow passing but also to Mirabehn's warm, teasing smile with Ba, signaling a budding friendship. Elsewhere, in a small town, six Indian police constables observe a torchlight parade with disdain as marchers in loincloths and tunics wave torn English cloth and shout in unison."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "At the small train station near the ashram, a spiritual retreat often found in India where individuals seek enlightenment and peace, a train pulls in as Kallenbach, beside a new Ford touring car, a popular and innovative vehicle in the early 20th century known for its reliability, watches. As people disembark, he moves forward through the crowded platform, his Indian tunic unable to disguise his incisive, patrician lawyer demeanor, which he honed while working closely with notable figures like Gandhi in the struggle for Indian independence. Amidst the chaos of Third Class passengers, who often traveled in packed and less comfortable conditions due to social class divisions during the British colonial period, Maulana Azad emerges, carrying a baby wrapped in rags. Azad, a prominent leader in India's independence movement and a scholar of Islam, is followed by the child's mother with her two little ones. Azad hands the baby to the mother, who thanks him, and he makes a small salaam, a traditional gesture of greeting or respect in many South Asian cultures, before moving toward the camera. Kallenbach is with Patel, a key figure in the Indian National Congress known for his organizational skills and economic acumen, who grins; like most witty men, he loves wit in others, though he groans at times. They turn back to the train just as Mirabehn (Madeleine Slade), a tall, pretty, and extremely English woman whose dedication to Indian independence led her to become one of Gandhi’s close associates, despite her sari, tips a porter and takes a small bag. The sari is a traditional Indian garment worn by women, often associated with grace and cultural heritage. She pauses upon seeing a now-startled Kallenbach. \n\nIn a different setting, the camera pans from a row of sandals by the door to a room where Gandhi, the leader of the Indian independence movement revered for his philosophy of nonviolent resistance, sits facing Patel and Azad, carding fiber to thread in a symbolic practice promoting self-reliance and resistance to British economic control, while Desai makes notes in the background. Mirabehn, seated near Ba, Gandhi’s wife known for her quiet strength and support of her husband's mission, listens intently as Gandhi's discussions unfold. Ba's spinning remains constant as Gandhi, after a solemn exchange with Azad, turns to Mirabehn, noticing her sari approvingly, a testament to her commitment to embracing Indian culture, before a shadow passes. Mirabehn beams, nods, and exchanges a warm, teasing smile with Ba, marking the start of a lasting friendship that would be significant in the years of struggle ahead. \n\nIn a small town, six Indian police constables, who served under the British colonial administration and often faced conflict between duty and national sentiment, observe a torchlight parade with challenging disdain. The marchers, wearing loincloths and tunics as a rejection of British-manufactured clothing, brandish torn English cloth and shout in unison, symbolizing their revolt against colonial rule and exploitation."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "At the small train station near the ashram a train pulls in as Kallenbach beside a new Ford touring car watches. As people disembark he moves forward through the crowded platform his Indian tunic unable to disguise his incisive patrician lawyer demeanor. Amidst the chaos of Third Class passengers Maulana Azad emerges carrying a baby wrapped in rags followed by the child's mother with her two little ones. Azad hands the baby to the mother who thanks him and he makes a small salaam before moving toward the camera. Kallenbach is with Patel who grins like most witty men. he loves wit in others though he groans at times. They turn back to the train just as Mirabehn. Madeleine Slade a tall pretty and extremely English woman despite her sari tips a porter and takes a small bag. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. She pauses upon seeing a nowstartled Kallenbach. In a different setting. the camera pans from a row of sandals by the door to a room where Gandhi sits facing Patel and Azad carding fiber to thread while Desai makes notes in the background. Mirabehn seated near Ba listens intently as Gandhi's discussions unfold. Ba's spinning remains constant as Gandhi after a solemn exchange with Azad turns to Mirabehn noticing her sari approvingly before a shadow passes. Mirabehn beams nods and exchanges a warm teasing smile with Ba marking the start of a lasting friendship. In a small town six Indian police constables observe a torchlight parade with challenging disdain. The marchers wearing loincloths and tunics brandish torn English cloth and shout in unison."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "At the small train station near the ashram a train pulls in as Kallenbach beside a new Ford touring car watches. As people disembark he moves forward through the crowded platform his Indian tunic unable to disguise his incisive patrician lawyer demeanor. Amidst the chaos of Third Class passengers Maulana Azad emerges carrying a baby wrapped in rags followed by the child's mother with her two little ones. Azad hands the baby to the mother who thanks him and he makes a small salaam before moving toward the camera. Kallenbach is with Patel who grins like most witty men. he loves wit in others though he groans at times. They turn back to the train just as Mirabehn. Madeleine Slade a tall pretty and extremely English woman despite her sari tips a porter and takes a small bag. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. She pauses upon seeing a nowstartled Kallenbach. In a different setting. the camera pans from a row of sandals by the door to a room where Gandhi sits facing Patel and Azad carding fiber to thread while Desai makes notes in the background. Mirabehn seated near Ba listens intently as Gandhi's discussions unfold. Ba's spinning remains constant as Gandhi after a solemn exchange with Azad turns to Mirabehn noticing her sari approvingly before a shadow passes. Mirabehn beams nods and exchanges a warm teasing smile with Ba marking the start of a lasting friendship. In a small town six Indian police constables observe a torchlight parade with challenging disdain. The marchers wearing loincloths and tunics brandish torn English cloth and shout in unison."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "At the small train station near the ashram a train pulls in as Kallenbach beside a new Ford touring car watches. As people disembark he moves forward through the crowded platform his Indian tunic unable to disguise his incisive patrician lawyer demeanor. Amidst the chaos of Third Class passengers Maulana Azad emerges carrying a baby wrapped in rags followed by the child's mother with her two little ones. Azad hands the baby to the mother who thanks him and he makes a small salaam before moving toward the camera. Ba's spinning remains constant as Gandhi after a solemn exchange with Azad turns to Mirabehn noticing her sari approvingly before a shadow passes. Mirabehn beams nods and exchanges a warm teasing smile with Ba marking the start of a lasting friendship. In a small town six Indian police constables observe a torchlight parade with challenging disdain. The marchers wearing loincloths and tunics brandish torn English cloth and shout in unison."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "At the small train station near the ashram a train pulls in as Kallenbach beside a new Ford touring car watches. As people disembark he moves forward through the crowded platform his Indian tunic unable to disguise his incisive patrician lawyer demeanor. In a small town six Indian police constables observe a torchlight parade with challenging disdain. The marchers wearing loincloths and tunics brandish torn English cloth and shout in unison."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "At the tiny bakery near the aquarium, a truck backs up as Grimaldi, beside a shiny bicycle, observes. As cats leap out, he drifts sideways through the bustling avenue, his velvet cape unable to mask his clumsy, rustic fisherman facade. Among the pandemonium of Fourth Grade students, Professor Beagle appears, clutching a kite wrapped in tape, followed by the kite's designer with his two apprentices. Beagle hands the kite to the designer, who praises him, and he performs a little jig before wandering toward the barn. Grimaldi is with Jenkins, who chuckles; like most cheerful sailors, he enjoys jokes from others, though he yawns occasionally. They turn back to the truck just as Ladybug (Marianne Beetle), a short, grumpy, and incredibly French insect despite her raincoat, pays a gardener and lifts a heavy sack. She halts upon noticing a now-bewildered Grimaldi. In an alternate scenario, the camera zooms from a line of boots by the chimney to a den where Newton naps facing Jenkins and Beagle, sketching maps to copy while Hunter composes songs in the foreground. Ladybug, sprawling near Spot, snoozes quietly as Newton's tunes unravel. Spot's knitting remains steady as Newton, after a casual chat with Beagle, turns to Ladybug, inspecting her raincoat humorously before a breeze drifts by. Ladybug giggles, waves, and shares a quick, playful frown with Spot, marking the end of a fleeting rivalry. In a minor village, six Brazilian opera singers admire a firefly display with bemused curiosity. The onlookers, wearing spectacles and vests, flaunt shredded Mexican fabric and murmur in harmony."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "At a small train station near the ashram, Kallenbach watches as a train arrives. Amidst the Third Class passengers, Maulana Azad emerges carrying a baby, returning it to the mother before moving toward Kallenbach and Patel, who share a moment of wit. As Mirabehn, a tall English woman in a sari, tips a porter, she catches Kallenbach's eye. The scene shifts to Gandhi's room, where he converses with Patel and Azad, while Mirabehn listens intently and Ba spins continuously. Gandhi approvingly notes Mirabehn's sari, prompting a warm smile exchange with Ba, signaling a budding friendship. Meanwhile, in a small town, Indian police constables watch a torchlight parade with disdain as loincloth-clad marchers shout and wave torn English cloth."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The marchers wearing loincloths and tunics brandish torn English cloth and shout in unison In a small town six Indian police constables observe a torchlight parade with challenging disdain Mirabehn beams nods and exchanges a warm teasing smile with Ba marking the start of a lasting friendship Ba's spinning remains constant as Gandhi after a solemn exchange with Azad turns to Mirabehn noticing her sari approvingly before a shadow passes Mirabehn seated near Ba listens intently as Gandhi's discussions unfold the camera pans from a row of sandals by the door to a room where Gandhi sits facing Patel and Azad carding fiber to thread while Desai makes notes in the background In a different setting She pauses upon seeing a nowstartled Kallenbach Madeleine Slade a tall pretty and extremely English woman despite her sari tips a porter and takes a small bag They turn back to the train just as Mirabehn he loves wit in others though he groans at times Kallenbach is with Patel who grins like most witty men Azad hands the baby to the mother who thanks him and he makes a small salaam before moving toward the camera Amidst the chaos of Third Class passengers Maulana Azad emerges carrying a baby wrapped in rags followed by the child's mother with her two little ones As people disembark he moves forward through the crowded platform his Indian tunic unable to disguise his incisive patrician lawyer demeanor At the small train station near the ashram a train pulls in as Kallenbach beside a new Ford touring car watches"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "As people disembark he moves forward through the crowded platform his Indian tunic unable to disguise his incisive patrician lawyer demeanor At the small train station near the ashram a train pulls in as Kallenbach beside a new Ford touring car watches Azad hands the baby to the mother who thanks him and he makes a small salaam before moving toward the camera Amidst the chaos of Third Class passengers Maulana Azad emerges carrying a baby wrapped in rags followed by the child's mother with her two little ones he loves wit in others though he groans at times Kallenbach is with Patel who grins like most witty men Madeleine Slade a tall pretty and extremely English woman despite her sari tips a porter and takes a small bag They turn back to the train just as Mirabehn In a different setting She pauses upon seeing a nowstartled Kallenbach Mirabehn seated near Ba listens intently as Gandhi's discussions unfold the camera pans from a row of sandals by the door to a room where Gandhi sits facing Patel and Azad carding fiber to thread while Desai makes notes in the background Mirabehn beams nods and exchanges a warm teasing smile with Ba marking the start of a lasting friendship Ba's spinning remains constant as Gandhi after a solemn exchange with Azad turns to Mirabehn noticing her sari approvingly before a shadow passes The marchers wearing loincloths and tunics brandish torn English cloth and shout in unison In a small town six Indian police constables observe a torchlight parade with challenging disdain"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She pauses upon seeing a nowstartled Kallenbach In a different setting the camera pans from a row of sandals by the door to a room where Gandhi sits facing Patel and Azad carding fiber to thread while Desai makes notes in the background Mirabehn seated near Ba listens intently as Gandhi's discussions unfold Ba's spinning remains constant as Gandhi after a solemn exchange with Azad turns to Mirabehn noticing her sari approvingly before a shadow passes Mirabehn beams nods and exchanges a warm teasing smile with Ba marking the start of a lasting friendship In a small town six Indian police constables observe a torchlight parade with challenging disdain The marchers wearing loincloths and tunics brandish torn English cloth and shout in unison At the small train station near the ashram a train pulls in as Kallenbach beside a new Ford touring car watches As people disembark he moves forward through the crowded platform his Indian tunic unable to disguise his incisive patrician lawyer demeanor Amidst the chaos of Third Class passengers Maulana Azad emerges carrying a baby wrapped in rags followed by the child's mother with her two little ones Azad hands the baby to the mother who thanks him and he makes a small salaam before moving toward the camera Kallenbach is with Patel who grins like most witty men he loves wit in others though he groans at times They turn back to the train just as Mirabehn Madeleine Slade a tall pretty and extremely English woman despite her sari tips a porter and takes a small bag"
        }
      ]
    }
  ]
}