{
  "ground_truth": "Walker is too entranced by the ceremony and the depth of layered emotions in Gandhi and Ba's voices and eyes to take notes as Ba and Gandhi come near to meeting. Ba takes the last step so that they are face to face, and for a moment, their eyes hold the many dreams, hopes, pain, and love of many years, while Walker watches with his face taut with emotion. Gandhi slowly lifts his hand, and both Walker and Collins, especially the overtly cynical American, are touched. Gandhi turns to them, and then a tiny, beautiful city rises steeply out of the Arabian Sea with buildings whose white walls are tinted amber and gold by the sun. Gandhi sits on a promontory watching the sunrise in solemn meditation and becomes aware of footsteps. He turns to see Walker approaching, a little knapsack over his shoulder, and Gandhi smiles. Walker joins him, looking out over the bay and city, truly impressed, and looks down at Gandhi, who scowls up in the early light. They both watch the waves on the shore a moment, with the changing hues of the sunrise on the city's whites. Gandhi looks out to sea, intercut with images of Walker, the sea, and the town itself in the sun. Walker studies him as Gandhi reaches a profound insight, staring out to sea in reflection. Suddenly, Gandhi's head lifts, his eyes become alert, he feels excitement, and stands, his manner full of optimism. Walker stares at him and then at what Gandhi seems to be looking at, the waves below them. Walker turns back to Gandhi, puzzled, but cannot mistake the glow in Gandhi's face. Gandhi looks at him with a teasing smile, and his grin broadens as he starts briskly down the promontory, with Walker scrambling after him. Gulls fly over them in the growing light, and Gandhi turns from the sea to Walker, his eyes confident and elated, before continuing down the promontory. Still baffled, Walker glances at the sea and follows Gandhi. The waves run against the shore as he looks in astonishment at his principal secretary. His ADC, a general, a brigadier, and a senior police officer are with him, a new team holding the same offices. Irwin looks at him, trying to understand the act's significance, and the senior police officer helps.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Walker is excessively captivated by the ritual and the profundity of stratified sentiments in Gandhi and Ba's tones and eyes to record notes as Ba and Gandhi approach meeting. Ba takes the final stride so that they are face to face, and for a moment, their eyes contain the numerous dreams, aspirations, anguish, and affection of many years, while Walker observes with his visage tight with feeling. Gandhi gradually raises his hand, and both Walker and Collins, particularly the blatantly skeptical American, are affected. Gandhi turns to them, and then a diminutive, exquisite metropolis ascends steeply out of the Arabian Sea with structures whose alabaster walls are tinged amber and gold by the sun. Gandhi perches on a headland observing the daybreak in solemn contemplation and becomes conscious of footfalls. He rotates to see Walker advancing, a small rucksack over his shoulder, and Gandhi beams. Walker joins him, gazing out over the inlet and metropolis, genuinely impressed, and glances down at Gandhi, who frowns up in the early glow. They both observe the waves on the coastline a moment, with the shifting shades of the dawn on the city's whites. Gandhi gazes out to ocean, intercut with visuals of Walker, the ocean, and the town itself in the sun. Walker scrutinizes him as Gandhi attains a profound realization, staring out to ocean in contemplation. Abruptly, Gandhi's head elevates, his eyes become vigilant, he feels exhilaration, and stands, his demeanor full of hopefulness. Walker gazes at him and then at what Gandhi seems to be observing, the waves beneath them. Walker turns back to Gandhi, perplexed, but cannot mistake the radiance in Gandhi's visage. Gandhi gazes at him with a playful grin, and his smile broadens as he starts energetically down the headland, with Walker scrambling after him. Gulls soar over them in the increasing luminance, and Gandhi turns from the ocean to Walker, his eyes assured and exhilarated, before proceeding down the headland. Still bewildered, Walker glances at the ocean and follows Gandhi. The waves run against the shore as he looks in amazement at his principal secretary. His ADC, a general, a brigadier, and a senior police officer are with him, a new team holding the same positions. Irwin glances at him, attempting to grasp the action's importance, and the senior police officer assists."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Walker is too entranced by the ceremony and the depth of layered emotions in Gandhi and Ba's voices and eyes to take notes as Ba and Gandhi come near to meeting. The last step is taken by Ba so that they are face to face, and for a moment, the many dreams, hopes, pain, and love of many years are held by their eyes, while his face is watched by Walker with emotion taut on it. Gandhi’s hand is slowly lifted, and both Walker and Collins, especially the overtly cynical American, are touched. Gandhi turns to them, and then a tiny, beautiful city rises steeply out of the Arabian Sea with buildings whose white walls the sun tints amber and gold. On a promontory, Gandhi sits watching the sunrise in solemn meditation and becomes aware of footsteps. Walker is seen approaching by him, a little knapsack over his shoulder, and a smile is given by Gandhi. Walker joins him, looking out over the bay and city, truly impressed, and looks down at Gandhi, who scowls up in the early light. For a moment, the waves on the shore are watched by both, with the changing hues of the sunrise on the city's whites. The sea is looked out to by Gandhi, intercut with images of Walker, the sea, and the town itself in the sun. Gandhi is studied by Walker as a profound insight is reached by Gandhi, staring out to sea in reflection. Suddenly, Gandhi's head is lifted, his eyes become alert, excitement is felt by him, and he stands, his manner full of optimism. Walker stares at him and then at what seems to be looked at by Gandhi, the waves below them. Gandhi is turned back to by Walker, puzzled, but the glow in Gandhi's face cannot be mistaken by him. Gandhi looks at him with a teasing smile, and his grin broadens as the promontory is briskly started down by him, with Walker scrambling after him. Gulls fly over them in the growing light, and Gandhi turns from the sea to Walker, confidence and elation in his eyes, before the promontory is continued down by him. Still baffled, the sea is glanced at by Walker and Gandhi is followed by him. The waves run against the shore as in astonishment, his principal secretary is looked at by him. An ADC, a general, a brigadier, and a senior police officer accompany him, a new team holding the same offices. Irwin tries to understand the act's significance and is helped by the senior police officer."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Walker is captivated by the ceremony and emotions in Gandhi and Ba's voices and eyes during their near meeting, unable to take notes. Ba steps forward so they are face to face, their eyes reflecting years of dreams, hopes, pain, and love, while Walker watches emotionally. Gandhi lifts his hand, moving both Walker and the cynical Collins. Gandhi then gazes at a beautiful city rising from the Arabian Sea, its buildings glowing amber and gold in the sunlight, as he meditates solemnly. He notices Walker approaching with a knapsack, smiles, and they sit together watching the sunrise over the bay and city. Gandhi scowls at Walker, who is impressed. They observe the waves and the sunrise's hues on the city. Walker studies Gandhi as he reaches a profound insight, reflected in the sea and town. Gandhi's demeanor changes to excitement and optimism, prompting him to stand. Walker sees his glow and watches the waves, puzzled but intrigued. Gandhi's teasing smile broadens as he moves briskly down the promontory, Walker close behind. In the growing light, gulls fly overhead; Gandhi turns to Walker, eyes confident and elated, before continuing downward. Walker follows, still baffled, glancing at the sea. As waves crash ashore, he looks astonished at his principal secretary, accompanied by a general, brigadier, and senior police officer. Irwin tries to grasp the act's significance, aided by the officer."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Entranced by the ceremony and emotions in Gandhi and Ba's voices and eyes, Walker takes no notes as Ba steps forward, meeting Gandhi. Their eyes hold years of dreams and emotions while Walker, emotional, watches. Gandhi lifts his hand, moving both Walker and a cynical American, Collins. As Gandhi turns, a city rises from the Arabian Sea, buildings tinted amber by the sun. Gandhi, meditating at sunrise, notices Walker with a knapsack approaching. Walker joins Gandhi, impressed by the city and bay. As they watch the waves and city's hues, Gandhi reflects, leading to a profound insight. Suddenly alert, Gandhi stands, optimistic. Walker, puzzled, sees Gandhi's glow and follows him down the promontory. Gulls fly overhead as Gandhi's eyes, confident, turn from the sea to Walker. Waves run against the shore as Walker, astonished, observes his principal secretary, ADC, general, brigadier, and senior police officer—a new team in familiar roles. Irwin looks on, trying to grasp the act's significance."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Walker finds himself utterly captivated by the unfolding ceremony, so much so that he is unable to jot down any notes. The intensity and depth of emotions layered in the voices and eyes of both Gandhi and Ba as they draw near to meeting are too absorbing. Finally, Ba takes the decisive last step forward, positioning herself directly face to face with Gandhi. In that fleeting moment, their eyes lock and hold a myriad of dreams, hopes, pains, and love accumulated over many years, while Walker watches on, his face drawn taut with emotion. Gandhi then raises his hand slowly, and both Walker and Collins, particularly Collins—the overtly cynical American—are profoundly moved. As Gandhi shifts his attention toward them, an enchanting, picturesque city emerges steeply from the Arabian Sea, its buildings' white facades bathed in amber and gold hues by the shining sun.\n\nGandhi sits solemnly on a promontory, deeply immersed in meditation as he observes the sunrise. Just then, he becomes aware of footsteps approaching. He turns around to see Walker coming towards him, carrying a small knapsack slung over his shoulder, and a gentle smile forms on Gandhi's face. Walker arrives at his side, gazing out over the bay and city, genuinely impressed by the view, and then glances down at Gandhi, who peers back up at him with a scowl in the early morning light. Together, they take a moment to watch the waves lap against the shore, the sunrise casting ever-changing hues on the city's white walls. As Gandhi gazes out to sea, images of Walker, the ocean, and the sunlit town flit through his mind. Walker observes him intently as Gandhi reaches a deep insight, reflecting deeply while staring out to the vast sea.\n\nSuddenly, Gandhi's head lifts, his eyes brighten with alertness, and an air of excitement fills him. He rises to his feet, exuding an optimistic demeanor. Walker stares at him, then shifts his gaze to what Gandhi appears to be focusing on—the waves below. As Walker glances back at Gandhi, puzzled, he cannot miss the radiant glow on Gandhi's face. Gandhi looks at him with a teasing smile, which broadens into a grin as he begins to briskly descend the promontory, with Walker quickly following in his wake. Gulls soar above them in the growing light, and Gandhi turns away from the sea to face Walker, his eyes reflecting confidence and elation before continuing his descent. Still mystified, Walker casts another glance at the sea before he continues to follow Gandhi. The waves crash rhythmically against the shore as Walker looks on, astonished at his principal secretary. His ADC, a general, a brigadier, and a senior police officer—comprising a new team occupying the same offices—are present with him. Irwin looks at him, endeavoring to grasp the significance of the act, while the senior police officer offers his assistance."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Walker finds himself utterly captivated and completely absorbed by the unfolding ceremony. It’s so mesmerizing that he finds himself unable to jot down any notes. The intensity and profound depth of emotions layered within the voices and eyes of both Gandhi and Ba, as they draw closer to their long-awaited meeting, are overwhelmingly absorbing. Finally, Ba takes that decisive, last step forward, positioning herself directly face to face with Gandhi. In that fleeting moment, their eyes lock, and within those locked gazes lies a myriad of unspoken dreams, hopes, pains, and love that have accumulated over many years, while Walker watches on, his face drawn taut with raw emotion. Gandhi then raises his hand slowly, and in this simple gesture, both Walker and Collins, particularly Collins—the overtly cynical American—find themselves profoundly moved. As Gandhi shifts his attention toward them, an enchanting, picturesque city begins to emerge steeply from the Arabian Sea, with its buildings' pristine white facades bathed in the amber and golden hues cast by the shining sun.\n\nSitting solemnly upon a promontory, Gandhi immerses himself deeply in a state of meditation as he observes the glorious sunrise. Just then, he becomes aware of footsteps steadily approaching. He turns around to find Walker making his way toward him, carrying a small knapsack slung casually over his shoulder, causing a gentle smile to form on Gandhi’s face. Walker arrives at his side, gazing out over the expansive bay and the city beyond, genuinely impressed by the awe-inspiring view, and then he glances down at Gandhi, who peers back up at him with a scowl in the soft, early morning light. Together, they pause to watch the waves gently lap against the shore, with the sunrise casting ever-changing hues on the city’s pristine white walls. As Gandhi continues to gaze out to the vast sea, images of Walker, the ocean, and the sunlit town flit through his mind. Walker observes him intently as Gandhi reaches a profound insight, reflecting deeply while staring out to the endless sea.\n\nSuddenly, Gandhi’s head lifts, his eyes brighten with alertness, and an air of excitement begins to fill him. He rises to his feet, exuding an air of optimism and enthusiasm. Walker stares at him intently, then shifts his gaze downward to focus on what Gandhi appears to be concentrating on—the rhythmic waves below. As Walker glances back at Gandhi, puzzled by his reaction, he cannot miss the radiant glow that has settled across Gandhi’s face. Gandhi looks at him with a teasing smile, which broadens into a wide grin as he begins to briskly descend the promontory, with Walker quickly following in his wake. Gulls soar gracefully above them in the growing light, and Gandhi turns away from the sea to face Walker, his eyes reflecting both confidence and elation, before continuing his descent. Still mystified and filled with curiosity, Walker casts another glance at the sea before continuing to follow Gandhi. The waves crash rhythmically against the shore as Walker looks on, astonished at his principal secretary. His ADC, a general, a brigadier, and a senior police officer—comprising this new team occupying the same offices—are present with him. Irwin looks at him, endeavoring to grasp the full significance of the act, while the senior police officer stands ready, offering his assistance."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Walker is utterly captivated by the unfolding ceremony and the complex emotions reflected in the voices and eyes of Gandhi and Ba, leaving him too entranced to jot down notes. As Ba and Gandhi draw closer, Ba takes the final step until they stand face to face, their eyes locked and conveying a tapestry of dreams, hopes, pain, and love accumulated over many years. Walker observes this profound moment, his face tight with emotion, as Gandhi gradually lifts his hand, an action that stirs both Walker and Collins, especially the notably skeptical American. Gandhi then shifts his attention to them, even as a stunningly beautiful city emerges sharply from the Arabian Sea, its white-walled buildings delicately tinged with amber and gold by the sun. As Gandhi sits on a promontory, absorbed in solemn meditation while watching the sunrise, he becomes aware of footsteps approaching. Turning to see Walker drawing near, with a small knapsack slung over his shoulder, Gandhi responds with a smile. Walker joins him, gazing out over the bay and city with genuine admiration, then glances down at Gandhi, who looks up at him with a scowl in the early light. Together, they pause to watch the waves lapping against the shore, the sunrise casting shifting shades on the city’s white structures. Gandhi's gaze extends out to sea, and this is interspersed with glimpses of Walker, the ocean, and the sunlit town. Walker scrutinizes Gandhi as he reaches a deep insight, pondering the vast sea before him. Abruptly, Gandhi's head lifts, his eyes become alert with excitement, and he rises with a demeanor brimming with optimism. Walker regards him intently and follows his gaze to the sea below, perplexed yet unable to ignore the enthusiastic glow illuminating Gandhi's face. Gandhi meets Walker's puzzled look with a teasing smile, his grin widening as he begins a brisk descent down the promontory, prompting Walker to hastily follow. Seagulls soar overhead in the brightening sky, and Gandhi casts a confident and elated glance back at Walker before continuing his descent. Still bewildered, Walker takes another look at the sea and proceeds after Gandhi. As the waves crash against the shore, Walker, in astonishment, observes his principal secretary, accompanied by an ADC, a general, a brigadier, and a senior police officer, forming a new team occupying the same positions. Irwin looks on, striving to grasp the significance of the act, while the senior police officer provides assistance in understanding."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Walker becomes captivated by the depth of emotions shared between Gandhi and Ba as they meet, holding a profound gaze filled with years of dreams, hopes, pain, and love. This scene impacts both Walker and a cynical Collins. Gandhi then shifts focus to a nearby city rising out of the Arabian Sea, its white buildings glowing amber and gold in the sunrise. Seated on a promontory, Gandhi meditates on the scene until Walker arrives, bearing a knapsack. They take in the view together, the changing hues of the sunrise reflecting on both the city and their contemplations.\n\nGandhi, reaching a profound insight, suddenly exudes optimism and stands, drawing Walker's attention. Gandhi's teasing smile prompts him to head briskly down the promontory, with Walker scrambling to follow. As they descend, the symbolism of the unfolding scene resonates with Walker, though its full significance remains elusive to him. Meanwhile, amidst the awakening city, Irwin and a team of officials—including a general, a brigadier, and a senior police officer—observe, trying to grasp the deeper meaning of Gandhi's actions."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Walker is too entranced by the ceremony and the depth of layered emotions in Gandhi and Ba's voices and eyes to take notes as Ba and Gandhi come near to meeting. The famous couple, known for their pivotal roles in India's struggle for independence, share a rich history. Ba takes the last step so that they are face to face, and for a moment, their eyes hold the many dreams, hopes, pain, and love of many years, while Walker watches with his face taut with emotion. Gandhi, the iconic leader known for his philosophy of nonviolence, slowly lifts his hand, and both Walker and Collins, especially the overtly cynical American journalist known for his skepticism towards idealistic movements, are touched. Gandhi turns to them, and then a tiny, beautiful city rises steeply out of the Arabian Sea with buildings whose white walls are tinted amber and gold by the sun. This is Mumbai, a city that would later become an economic powerhouse of India. Gandhi sits on a promontory watching the sunrise in solemn meditation and becomes aware of footsteps. He turns to see Walker approaching, a little knapsack over his shoulder, a traveler seeking stories of truth, and Gandhi smiles. Walker joins him, looking out over the bay and city, truly impressed, and looks down at Gandhi, who scowls up in the early light. They both watch the waves on the shore a moment, with the changing hues of the sunrise on the city's whites. Gandhi looks out to sea, intercut with images of Walker, the vast Arabian Sea, and the town itself in the sun. Walker studies him as Gandhi reaches a profound insight, one that would later contribute to his vision for a free India, staring out to sea in reflection. Suddenly, Gandhi's head lifts, his eyes become alert, he feels excitement, and stands, his manner full of optimism reminiscent of his early days leading the freedom movement. Walker stares at him and then at what Gandhi seems to be looking at, the waves below them. Walker turns back to Gandhi, puzzled, but cannot mistake the glow in Gandhi's face, the same glow that inspired millions. Gandhi looks at him with a teasing smile, and his grin broadens as he starts briskly down the promontory, with Walker scrambling after him. Gulls fly over them in the growing light, a common sight symbolizing freedom and perspective, and Gandhi turns from the sea to Walker, his eyes confident and elated, a reflection of the hope he instilled in many, before continuing down the promontory. Still baffled, Walker glances at the sea and follows Gandhi. The waves run against the shore as he looks in astonishment at his principal secretary. His ADC, a general, a brigadier, and a senior police officer are with him, symbolizing the layers of bureaucracy Gandhi navigated, a new team holding the same offices. Irwin, historically known as Lord Irwin, the then Viceroy of India, looks at him, trying to understand the act's significance, and the senior police officer helps, reflecting the cooperation needed for significant societal change."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "They both watch the waves on the shore a moment with the changing hues of the sunrise on the city's whites The waves run against the shore as he looks in astonishment at his principal secretary Walker is too entranced by the ceremony and the depth of layered emotions in Gandhi and Ba's voices and eyes to take notes Still baffled Walker glances at the sea and follows Gandhi Gandhi looks out to sea intercut with images of Walker the sea and the town itself in the sun as Ba and Gandhi come near to meeting Ba takes the last step so that they are face to face and for a moment their eyes hold the many dreams hopes pain and love of many years while Walker watches with his face taut with emotion Irwin looks at him trying to understand the act's significance and the senior police officer helps Gandhi slowly lifts his hand and both Walker and Collins especially the overtly cynical American are touched he feels excitement and stands his manner full of optimism Gandhi slowly lifts his hand and both Walker and Collins especially the overtly cynical American are touched Gandhi turns to them and then a tiny beautiful city rises steeply out of the Arabian Sea with buildings whose white walls are tinted amber and gold by the sun Gandhi sits on a promontory watching the sunrise in solemn meditation and becomes aware of footsteps He turns to see Walker approaching a little knapsack over his shoulder and Gandhi smiles Walker joins him looking out over the bay and city truly impressed and looks down at Gandhi who scowls up in the early light They both watch the waves on the shore a moment with the changing hues of the sunrise on the city's whites Gandhi looks out to sea intercut with images of Walker the sea and the town itself in the sun Walker studies him as Gandhi reaches a profound insight staring out to sea in reflection as Ba and Gandhi come near to meeting Ba takes the last step so that they are face to face and for a moment their eyes hold the many dreams hopes pain and love of many years while Walker watches with his face taut with emotion Suddenly Gandhi's head lifts his eyes become alert he feels excitement and stands his manner full of optimism Suddenly Gandhi's head lifts his eyes become alert Walker is too entranced by the ceremony and the depth of layered emotions in Gandhi and Ba's voices and eyes to take notes Walker stares at him and then at what Gandhi seems to be looking at the waves below them Walker turns back to Gandhi puzzled but cannot mistake the glow in Gandhi's face Gandhi looks at him with a teasing smile and his grin broadens as he starts briskly down the promontory with Walker scrambling after him Gulls fly over them in the growing light and Gandhi turns from the sea to Walker his eyes confident and elated before continuing down the promontory Still baffled Walker glances at the sea and follows Gandhi Gandhi turns to them and then a tiny beautiful city rises steeply out of the Arabian Sea with buildings whose white walls are tinted amber and gold by the sun The waves run against the shore as he looks in astonishment at his principal secretary His ADC a general a brigadier and a senior police officer are with him a new team holding the same offices Irwin looks at him trying to understand the act's significance and the senior police officer helps"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Walker is too entranced by the ceremony and the depth of layered emotions in Gandhi and Ba's voices and eyes to take notes. as Ba and Gandhi come near to meeting Ba takes the last step so that they are face to face and for a moment their eyes hold the many dreams hopes pain and love of many years while Walker watches with his face taut with emotion. Gandhi slowly lifts his hand and both Walker and Collins especially the overtly cynical American are touched. Gandhi turns to them and then a tiny beautiful city rises steeply out of the Arabian Sea with buildings whose white walls are tinted amber and gold by the sun. Gandhi sits on a promontory watching the sunrise in solemn meditation and becomes aware of footsteps. He turns to see Walker approaching a little knapsack over his shoulder and Gandhi smiles. Walker joins him looking out over the bay and city truly impressed and looks down at Gandhi who scowls up in the early light. They both watch the waves on the shore a moment with the changing hues of the sunrise on the city's whites. Gandhi looks out to sea intercut with images of Walker the sea and the town itself in the sun. Walker studies him as Gandhi reaches a profound insight staring out to sea in reflection. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Suddenly Gandhi's head lifts his eyes become alert. he feels excitement and stands his manner full of optimism. Walker stares at him and then at what Gandhi seems to be looking at the waves below them. Walker turns back to Gandhi puzzled but cannot mistake the glow in Gandhi's face. Gandhi looks at him with a teasing smile and his grin broadens as he starts briskly down the promontory with Walker scrambling after him. Gulls fly over them in the growing light and Gandhi turns from the sea to Walker his eyes confident and elated before continuing down the promontory. Still baffled Walker glances at the sea and follows Gandhi. The waves run against the shore as he looks in astonishment at his principal secretary. His ADC a general a brigadier and a senior police officer are with him. a new team holding the same offices. Irwin looks at him trying to understand the act's significance and the senior police officer helps."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Walker is too entranced by the ceremony and the depth of layered emotions in Gandhi and Ba's voices and eyes to take notes. as Ba and Gandhi come near to meeting Ba takes the last step so that they are face to face and for a moment their eyes hold the many dreams hopes pain and love of many years while Walker watches with his face taut with emotion. Gandhi slowly lifts his hand and both Walker and Collins especially the overtly cynical American are touched. Gandhi turns to them and then a tiny beautiful city rises steeply out of the Arabian Sea with buildings whose white walls are tinted amber and gold by the sun. Gandhi sits on a promontory watching the sunrise in solemn meditation and becomes aware of footsteps. He turns to see Walker approaching a little knapsack over his shoulder and Gandhi smiles. Walker joins him looking out over the bay and city truly impressed and looks down at Gandhi who scowls up in the early light. They both watch the waves on the shore a moment with the changing hues of the sunrise on the city's whites. Gandhi looks out to sea intercut with images of Walker the sea and the town itself in the sun. Walker studies him as Gandhi reaches a profound insight staring out to sea in reflection. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Suddenly Gandhi's head lifts his eyes become alert. he feels excitement and stands his manner full of optimism. Walker stares at him and then at what Gandhi seems to be looking at the waves below them. Walker turns back to Gandhi puzzled but cannot mistake the glow in Gandhi's face. Gandhi looks at him with a teasing smile and his grin broadens as he starts briskly down the promontory with Walker scrambling after him. Gulls fly over them in the growing light and Gandhi turns from the sea to Walker his eyes confident and elated before continuing down the promontory. Still baffled Walker glances at the sea and follows Gandhi. The waves run against the shore as he looks in astonishment at his principal secretary. His ADC a general a brigadier and a senior police officer are with him. a new team holding the same offices. Irwin looks at him trying to understand the act's significance and the senior police officer helps."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Walker is too entranced by the ceremony and the depth of layered emotions in Gandhi and Ba's voices and eyes to take notes. as Ba and Gandhi come near to meeting Ba takes the last step so that they are face to face and for a moment their eyes hold the many dreams hopes pain and love of many years while Walker watches with his face taut with emotion. Gandhi slowly lifts his hand and both Walker and Collins especially the overtly cynical American are touched. Gandhi turns to them and then a tiny beautiful city rises steeply out of the Arabian Sea with buildings whose white walls are tinted amber and gold by the sun. Gandhi sits on a promontory watching the sunrise in solemn meditation and becomes aware of footsteps. Gulls fly over them in the growing light and Gandhi turns from the sea to Walker his eyes confident and elated before continuing down the promontory. Still baffled Walker glances at the sea and follows Gandhi. The waves run against the shore as he looks in astonishment at his principal secretary. His ADC a general a brigadier and a senior police officer are with him. a new team holding the same offices. Irwin looks at him trying to understand the act's significance and the senior police officer helps."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Walker is too entranced by the ceremony and the depth of layered emotions in Gandhi and Ba's voices and eyes to take notes. as Ba and Gandhi come near to meeting Ba takes the last step so that they are face to face and for a moment their eyes hold the many dreams hopes pain and love of many years while Walker watches with his face taut with emotion. His ADC a general a brigadier and a senior police officer are with him. a new team holding the same offices. Irwin looks at him trying to understand the act's significance and the senior police officer helps."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Dolphin is too entranced by the ceremony and the depth of layered emotions in the artist and the teacher's voices and eyes to take notes as the teacher and the artist come near to meeting. The teacher takes the last step so that they are face to face, and for a moment, their eyes hold the many dreams, hopes, pain, and love of many years, while Dolphin watches with her face taut with emotion. The artist slowly lifts her hand, and both Dolphin and the pilot, especially the overtly cynical American, are touched. The artist turns to them, and then a tiny, beautiful city rises steeply out of the Arabian Sea with buildings whose white walls are tinted amber and gold by the sun. The artist sits on a promontory watching the sunrise in solemn meditation and becomes aware of footsteps. She turns to see Dolphin approaching, a little knapsack over her shoulder, and the artist smiles. Dolphin joins her, looking out over the bay and city, truly impressed, and looks down at the artist, who scowls up in the early light. They both watch the waves on the shore a moment, with the changing hues of the sunrise on the city's whites. The artist looks out to sea, intercut with images of Dolphin, the sea, and the town itself in the sun. Dolphin studies her as the artist reaches a profound insight, staring out to sea in reflection. Suddenly, the artist's head lifts, her eyes become alert, she feels excitement, and stands, her manner full of optimism. Dolphin stares at her and then at what the artist seems to be looking at, the waves below them. Dolphin turns back to the artist, puzzled, but cannot mistake the glow in the artist's face. The artist looks at her with a teasing smile, and her grin broadens as she starts briskly down the promontory, with Dolphin scrambling after her. Gulls fly over them in the growing light, and the artist turns from the sea to Dolphin, her eyes confident and elated, before continuing down the promontory. Still baffled, Dolphin glances at the sea and follows the artist. The waves run against the shore as she looks in astonishment at her principal secretary. Her ADC, a general, a brigadier, and a senior police officer are with her, a new team holding the same offices. The gardener looks at her, trying to understand the act's significance, and the senior police officer helps."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Walker is too entranced by the festival and the depth of layered emotions in Gandhi and Ba's voices and eyes to take notes as Ba and Gandhi come near to meeting. Ba takes the last step so that they are face to face, and for a moment, their eyes hold the many dreams, hopes, pain, and love of many years, while Walker watches with his face taut with emotion. Gandhi slowly lifts his hand, and both Walker and Collins, especially the overtly cynical American, are touched. Gandhi turns to them, and then a tiny, beautiful village rises steeply out of the Pacific Ocean with structures whose red walls are tinted silver and blue by the moon. Gandhi sits on a hillock watching the sunset in solemn meditation and becomes aware of footsteps. He turns to see Walker approaching, a little briefcase over his shoulder, and Gandhi smiles. Walker joins him, looking out over the harbor and village, truly impressed, and looks down at Gandhi, who scowls up in the evening light. They both watch the ripples on the shore a moment, with the changing hues of the sunset on the village's reds. Gandhi looks out to sea, intercut with images of Walker, the sea, and the village itself in the moon. Walker studies him as Gandhi reaches a profound insight, staring out to sea in reflection. Suddenly, Gandhi's head lifts, his eyes become alert, he feels excitement, and stands, his manner full of optimism. Walker stares at him and then at what Gandhi seems to be looking at, the ripples below them. Walker turns back to Gandhi, puzzled, but cannot mistake the glow in Gandhi's face. Gandhi looks at him with a teasing smile, and his grin broadens as he starts briskly down the hillock, with Walker scrambling after him. Parrots fly over them in the softening light, and Gandhi turns from the sea to Walker, his eyes confident and elated, before continuing down the hillock. Still baffled, Walker glances at the sea and follows Gandhi. The ripples lap against the shore as he looks in astonishment at his principal consultant. His aide, a marshal, a colonel, and a senior detective are with him, a new team holding the same offices. Irwin looks at him, trying to understand the act's significance, and the senior detective helps."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Walker is too captivated by the ceremony and the depth of layered emotions in Gandhi and Ba's voices and eyes to record thoughts as Ba and Gandhi draw near to meeting. Ba skips the last step so that they are face to face, and for a moment, their eyes capture the many dreams, hopes, pain, and love of many years, while Walker observes with his face tight with emotion. Gandhi slowly waves his hand, and both Walker and Collins, especially the overtly cynical American, are stirred. Gandhi turns to them, and then a tiny, beautiful city descends abruptly into the Arabian Sea with buildings whose white walls are tinted amber and gold by the sun. Gandhi kneels on a promontory watching the sunrise in solemn contemplation and becomes alert to whispers. He turns to see Walker approaching, a little knapsack over his shoulder, and Gandhi grins. Walker settles beside him, looking out over the bay and city, truly fascinated, and glances down at Gandhi, who scowls up in the early light. They both observe the waves on the shore a moment, with the changing hues of the sunrise on the city's whites. Gandhi glances out to sea, intercut with images of Walker, the sea, and the town itself in the sun. Walker examines him as Gandhi unfolds a profound insight, staring out to sea in reflection. Suddenly, Gandhi's head tilts, his eyes become sharp, he feels exhilaration, and leaps, his manner full of anticipation. Walker gapes at him and then at what Gandhi seems to be observing, the waves below them. Walker turns back to Gandhi, bemused, but cannot mistake the glow on Gandhi's face. Gandhi looks at him with a teasing grin, and his smile broadens as he strolls briskly down the promontory, with Walker scampering after him. Gulls soar over them in the growing light, and Gandhi turns from the sea to Walker, his eyes confident and thrilled, before moving down the promontory. Still bewildered, Walker peeks at the sea and trails Gandhi. The waves dance against the shore as he gazes in amazement at his principal secretary. His ADC, a general, a brigadier, and a senior police officer are with him, a new team occupying the same offices. Irwin gazes at him, attempting to grasp the act's significance, and the senior police officer clarifies."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Caramel is too entranced by the festival and the depth of layered emotions in the violin and drum's shadows and colors to take notes as the drum and violin come near to meeting. The drum takes the last step so that they are face to face, and for a moment, their shadows hold the many dreams, hopes, pain, and love of many years, while Caramel watches with its lid taut with emotion. The violin slowly lifts its pedal, and both Caramel and Biscuit, especially the overtly cynical cat, are touched. The violin turns to them, and then a tiny, beautiful iceberg rises steeply out of the Indian Ocean with towers whose white shells are tinted amber and gold by the moon. The violin sits on a plateau watching the moonrise in solemn meditation and becomes aware of shadows. It turns to see Caramel approaching, a little suitcase over its shoulder, and the violin smiles. Caramel joins it, looking out over the reef and iceberg, truly impressed, and looks down at the violin, which scowls up in the early light. They both watch the ripples on the reef a moment, with the changing hues of the moonrise on the iceberg's whites. The violin looks out to ocean, intercut with images of Caramel, the ocean, and the iceberg itself in the moon. Caramel studies it as the violin reaches a profound insight, staring out to ocean in reflection. Suddenly, the violin's knob lifts, its colors become alert, it feels excitement, and stands, its manner full of optimism. Caramel stares at it and then at what the violin seems to be looking at, the ripples below them. Caramel turns back to the violin, puzzled, but cannot mistake the glow in the violin's knob. The violin looks at it with a teasing smile, and its grin broadens as it starts briskly down the plateau, with Caramel scrambling after it. Kites fly over them in the growing light, and the violin turns from the ocean to Caramel, its colors confident and elated, before continuing down the plateau. Still baffled, Caramel glances at the ocean and follows the violin. The ripples run against the reef as it looks in astonishment at its principal navigator. Its ADC, a gardener, a captain, and a senior librarian are with it, a new team holding the same maps. Icicle looks at it, trying to understand the dance's significance, and the senior librarian helps."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Longfellow is too captivated by the masquerade and the depth of layered emotions in Picasso and Renoir's voices and eyes to paint sketches as Renoir and Picasso come near to dancing. Renoir makes the final move so that they are face to face, and for a moment, their eyes reflect the many adventures, quests, sorrow, and joy of many years, while Longfellow observes with his face lined with nostalgia. Picasso gently raises his hand, and both Longfellow and Hemingway, especially the overtly cynical Brit, are moved. Picasso gestures to them, and then a tiny, mesmerizing garden emerges steeply out of the Atlantic with flowers whose petals are painted crimson and lavender by the dawn. Picasso sits on a dune watching the sunrise in serene reflection and becomes aware of whispers. He turns to see Longfellow meandering, a little knapsack over his shoulder, and Picasso chuckles. Longfellow joins him, gazing out over the meadow and garden, truly enthralled, and looks down at Picasso, who frowns up in the early light. They both watch the blossoms swaying a moment, with the changing shades of the sunrise on the garden's tones. Picasso looks out to the horizon, intercut with scenes of Longfellow, the meadow, and the grove itself in the dawn. Longfellow examines him as Picasso reaches a profound realization, gazing out to the horizon in contemplation. Suddenly, Picasso's head lifts, his eyes become keen, he feels anticipation, and stands, his manner full of exhilaration. Longfellow gapes at him and then at what Picasso seems to be gazing at, the meadow below them. Longfellow turns back to Picasso, bewildered, but cannot overlook the radiance in Picasso's face. Picasso looks at him with a playful smile, and his grin widens as he starts eagerly down the dune, with Longfellow hurrying after him. Butterflies flit over them in the brightening light, and Picasso turns from the horizon to Longfellow, his eyes assured and joyful, before continuing down the dune. Still mystified, Longfellow glances at the horizon and follows Picasso. The grass flows against the breeze as he gazes in amazement at his principal architect. His aide, a captain, a colonel, and a senior detective are with him, a fresh crew holding the same roles. Orwell looks at him, trying to decipher the gesture's meaning, and the senior detective assists."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Walker is too distracted by the festival and the intensity of layered emotions in Gandhi and Ba's voices and eyes to draw doodles as Ba and Gandhi come near to encountering. Ba takes the final leap so that they are nose to nose, and for a moment, their eyes hold the myriad fantasies, aspirations, sorrow, and affection of many years, while Walker observes with his face taut with feeling. Gandhi gently raises his foot, and both Walker and Collins, particularly the overtly skeptical American, are moved. Gandhi turns to them, and then a tiny, picturesque village emerges abruptly out of the Mediterranean Sea with structures whose blue walls are shaded crimson and silver by the moon. Gandhi lies on a plateau watching the sunset in quiet reflection and becomes aware of whispers. He turns to see Walker approaching, a small guitar over his shoulder, and Gandhi grins. Walker joins him, gazing out over the gulf and village, genuinely astonished, and glances down at Gandhi, who frowns up in the early dusk. They both watch the dolphins on the horizon for a moment, with the shifting tones of the sunset on the village's blues. Gandhi gazes out to ocean, intercut with images of Walker, the ocean, and the hamlet itself in the sunset. Walker examines him as Gandhi reaches a deep conclusion, gazing out to ocean in contemplation. Suddenly, Gandhi's eyes widen, his pupils become sharp, he feels a thrill, and jumps, his manner full of enthusiasm. Walker gazes at him and then at what Gandhi seems to be focusing on, the dolphins below them. Walker turns back to Gandhi, confused, but cannot mistake the shine in Gandhi's eyes. Gandhi looks at him with a joking grin, and his smile broadens as he begins swiftly down the plateau, with Walker stumbling after him. Eagles soar over them in the growing dusk, and Gandhi turns from the ocean to Walker, his gaze assured and joyful, before continuing down the plateau. Still perplexed, Walker glances at the ocean and follows Gandhi. The dolphins dance against the horizon as he looks in awe at his principal advisor. His ADC, a captain, a colonel, and a junior fire chief are with him, a new team holding the same ranks. Irwin looks at him, trying to comprehend the gesture's meaning, and the junior fire chief assists."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Traveller is too captivated by the parade and the layers of mixed feelings in Aesop and Luna's tones and gazes to sketch plans as Luna and Aesop approach a moment of connection. Luna takes the final stride so that they are eye to eye, and for an instant, their gazes contain the numerous aspirations, desires, sorrow, and affection of countless seasons, while Traveller observes with his expression tight with feelings. Aesop gradually raises his palm, and both Traveller and Smith, particularly the noticeably skeptical Canadian, are moved. Aesop turns to them, and then a small, exquisite village ascends sharply from the Baltic Sea with houses whose stone walls gleam with sapphire and silver in the twilight. Aesop rests on a cliff observing the moonrise in thoughtful contemplation and senses the approach of footsteps. He turns to spot Traveller nearing, a tiny suitcase in hand, and Aesop grins. Traveller joins him, admiring the gulf and village, genuinely impressed, and gazes at Aesop, who frowns in the fading glow. They both watch the cresting tides for a moment, with the shifting shades of twilight on the village's stones. Aesop gazes toward the horizon, intercut with glimpses of Traveller, the ocean, and the settlement itself under the moon. Traveller examines him as Aesop reaches a deep realization, gazing at the horizon in introspection. Abruptly, Aesop's head rises, his eyes become keen, he senses exhilaration, and rises, his demeanor brimming with hope. Traveller gazes at him and then at what Aesop appears to be observing, the tides below them. Traveller turns back to Aesop, bewildered, but cannot miss the radiance in Aesop's visage. Aesop looks at him with a playful grin, and his smile widens as he begins eagerly descending the cliff, with Traveller chasing him. Eagles soar over them in the increasing dimness, and Aesop turns from the horizon to Traveller, his eyes assured and jubilant, before proceeding down the cliff. Still perplexed, Traveller glimpses the horizon and trails Aesop. The tides lap against the coastline as he looks in amazement at his chief advisor. His assistant, a minister, a colonel, and a chief detective join him, a new group occupying the identical roles. Nelson gazes at him, attempting to grasp the importance of the gesture, and the chief detective aids."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Walker is captivated by the ceremony and the emotions in Gandhi and Ba's eyes as they meet, holding years of dreams and love. As Gandhi lifts his hand, both Walker and the skeptical Collins are moved. The scene shifts to a city emerging from the Arabian Sea as Gandhi meditates at sunrise. Walker approaches with a knapsack, joining Gandhi on the promontory. They watch the waves, and Gandhi reaches a profound insight, becoming optimistic and excited. Walker, puzzled but noticing Gandhi's joy, follows him down the promontory. Gandhi, confident and elated, continues with Walker trailing. The waves crash as Gandhi's entourage, including his ADC, a general, a brigadier, and a senior police officer, watch Irwin trying to grasp the act's significance."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Irwin looks at him trying to understand the act's significance and the senior police officer helps a new team holding the same offices His ADC a general a brigadier and a senior police officer are with him The waves run against the shore as he looks in astonishment at his principal secretary Still baffled Walker glances at the sea and follows Gandhi Gulls fly over them in the growing light and Gandhi turns from the sea to Walker his eyes confident and elated before continuing down the promontory Gandhi looks at him with a teasing smile and his grin broadens as he starts briskly down the promontory with Walker scrambling after him Walker turns back to Gandhi puzzled but cannot mistake the glow in Gandhi's face Walker stares at him and then at what Gandhi seems to be looking at the waves below them he feels excitement and stands his manner full of optimism Suddenly Gandhi's head lifts his eyes become alert Walker studies him as Gandhi reaches a profound insight staring out to sea in reflection Gandhi looks out to sea intercut with images of Walker the sea and the town itself in the sun They both watch the waves on the shore a moment with the changing hues of the sunrise on the city's whites Walker joins him looking out over the bay and city truly impressed and looks down at Gandhi who scowls up in the early light He turns to see Walker approaching a little knapsack over his shoulder and Gandhi smiles Gandhi sits on a promontory watching the sunrise in solemn meditation and becomes aware of footsteps Gandhi turns to them and then a tiny beautiful city rises steeply out of the Arabian Sea with buildings whose white walls are tinted amber and gold by the sun Gandhi slowly lifts his hand and both Walker and Collins especially the overtly cynical American are touched as Ba and Gandhi come near to meeting Ba takes the last step so that they are face to face and for a moment their eyes hold the many dreams hopes pain and love of many years while Walker watches with his face taut with emotion Walker is too entranced by the ceremony and the depth of layered emotions in Gandhi and Ba's voices and eyes to take notes"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "a new team holding the same offices He turns to see Walker approaching a little knapsack over his shoulder and Gandhi smiles Gandhi looks at him with a teasing smile and his grin broadens as he starts briskly down the promontory with Walker scrambling after him Gandhi sits on a promontory watching the sunrise in solemn meditation and becomes aware of footsteps Walker studies him as Gandhi reaches a profound insight staring out to sea in reflection Walker turns back to Gandhi puzzled but cannot mistake the glow in Gandhi's face Gulls fly over them in the growing light and Gandhi turns from the sea to Walker his eyes confident and elated before continuing down the promontory His ADC a general a brigadier and a senior police officer are with him Walker joins him looking out over the bay and city truly impressed and looks down at Gandhi who scowls up in the early light Walker stares at him and then at what Gandhi seems to be looking at the waves below them The waves run against the shore as he looks in astonishment at his principal secretary Suddenly Gandhi's head lifts his eyes become alert as Ba and Gandhi come near to meeting Ba takes the last step so that they are face to face and for a moment their eyes hold the many dreams hopes pain and love of many years while Walker watches with his face taut with emotion he feels excitement and stands his manner full of optimism Gandhi slowly lifts his hand and both Walker and Collins especially the overtly cynical American are touched Still baffled Walker glances at the sea and follows Gandhi They both watch the waves on the shore a moment with the changing hues of the sunrise on the city's whites Gandhi looks out to sea intercut with images of Walker the sea and the town itself in the sun Walker is too entranced by the ceremony and the depth of layered emotions in Gandhi and Ba's voices and eyes to take notes Gandhi turns to them and then a tiny beautiful city rises steeply out of the Arabian Sea with buildings whose white walls are tinted amber and gold by the sun Irwin looks at him trying to understand the act's significance and the senior police officer helps"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "he feels excitement and stands his manner full of optimism Walker stares at him and then at what Gandhi seems to be looking at the waves below them Walker turns back to Gandhi puzzled but cannot mistake the glow in Gandhi's face Gandhi looks at him with a teasing smile and his grin broadens as he starts briskly down the promontory with Walker scrambling after him Gulls fly over them in the growing light and Gandhi turns from the sea to Walker his eyes confident and elated before continuing down the promontory Still baffled Walker glances at the sea and follows Gandhi The waves run against the shore as he looks in astonishment at his principal secretary His ADC a general a brigadier and a senior police officer are with him a new team holding the same offices Irwin looks at him trying to understand the act's significance and the senior police officer helps Walker is too entranced by the ceremony and the depth of layered emotions in Gandhi and Ba's voices and eyes to take notes as Ba and Gandhi come near to meeting Ba takes the last step so that they are face to face and for a moment their eyes hold the many dreams hopes pain and love of many years while Walker watches with his face taut with emotion Gandhi slowly lifts his hand and both Walker and Collins especially the overtly cynical American are touched Gandhi turns to them and then a tiny beautiful city rises steeply out of the Arabian Sea with buildings whose white walls are tinted amber and gold by the sun Gandhi sits on a promontory watching the sunrise in solemn meditation and becomes aware of footsteps He turns to see Walker approaching a little knapsack over his shoulder and Gandhi smiles Walker joins him looking out over the bay and city truly impressed and looks down at Gandhi who scowls up in the early light They both watch the waves on the shore a moment with the changing hues of the sunrise on the city's whites Gandhi looks out to sea intercut with images of Walker the sea and the town itself in the sun Walker studies him as Gandhi reaches a profound insight staring out to sea in reflection Suddenly Gandhi's head lifts his eyes become alert"
        }
      ]
    }
  ]
}