{
  "ground_truth": "Lester, still listening, looks like he's about to implode. Jane covers her ears and starts singing to drown her out. Jane's singing stops, and panicked, Lester scurries down the hall. Angela crosses to the window and looks out. We see Angela standing at the window in her underwear, looking down at us. We're across from Jane's window, looking in. We zoom toward her, even as Angela poses in the window; we're clearly not interested in Angela. Finally, we settle on the small make-up mirror where we see a reflection of Jane, back at her computer. Ricky sits in darkness with his digicam, videotaping. She's smiling. Then suddenly the drapes close and she's gone. He lowers the camera and smiles, then something below catches his attention. Through a window on the side of the Burnham's garage door, we see Lester, still in his suit, digging through shelves against the back wall. Lester digs through stuff stored on the shelves, searching for something as if his very life depended on it. Suddenly we hear someone trying to open a locked door. Moving swiftly, Ricky pulls the drapes shut and switches on a light. His room is a haven of high-tech. A state-of-the-art multimedia computer crowds his desk, and high-end stereo and video equipment line the shelves, as well as hundreds of CDs. There is easily twenty thousand dollars worth of equipment in this room. Ricky opens the door. The Colonel stands outside, eyeing him. The Colonel holds out a small plastic cup with a cap. He disappears down the hall. Ricky smiles, shuts and locks his door. He puts the plastic cup on the shelf, then crosses to a mini refrigerator in the corner of his room and takes out a cup-sized Tupperware container from the freezer, already filled with urine, albeit frozen, and places it on a saucer to thaw overnight. Carolyn lies sleeping. Lester is awake, staring at the ceiling. After a moment, he gets up, taking care not to disturb Carolyn, and walks toward the bathroom. The room is filled with steam. Lester looks around, confused, then focuses on: Across from us, in a pedestal bathtub, is Angela. Rose petals float on the surface of the water, obscuring her naked body. Lester kneels by the bathtub like a man in church. She arches her back and looks up at him provocatively. Lester gives her a hard look, then slowly slips his hand into the water between her legs. Her eyes widen and she throws her head back. Close on Carolyn, her eyes wide, listening to the rhythmic brush of Lester's hand as he masturbates under the covers. She flips over and faces him. Carolyn gets out of bed, repelled.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Lester, still eavesdropping, appears like he's about to burst. Jane shields her ears and begins crooning to muffle her out. Jane's crooning halts, and frantic, Lester dashes down the corridor. Angela strides to the glass and gazes out. We observe Angela standing at the glass in her lingerie, peering down at us. We're opposite Jane's glass, peering in. We zoom toward her, even as Angela poses in the glass; we're evidently not focused on Angela. Ultimately, we settle on the small cosmetic mirror where we perceive a reflection of Jane, back at her workstation. Ricky sits in shadow with his digicam, recording. She's grinning. Then abruptly the curtains close and she's vanished. He lowers the camera and grins, then something below attracts his notice. Through a glass on the flank of the Burnham's garage door, we discern Lester, still in his attire, rifling through racks against the rear wall. Lester rummages through items stored on the racks, hunting for something as though his very existence hinged on it. Abruptly we hear someone attempting to unlatch a locked door. Moving rapidly, Ricky yanks the curtains shut and flicks on a lamp. His space is a shelter of high-tech. A state-of-the-art multimedia computer fills his desk, and premium stereo and video apparatus line the racks, as well as hundreds of CDs. There is readily twenty thousand dollars worth of apparatus in this space. Ricky opens the door. The Colonel stands outdoors, inspecting him. The Colonel extends a small plastic cup with a cap. He vanishes down the corridor. Ricky grins, shuts and secures his door. He places the plastic cup on the rack, then strides to a mini refrigerator in the corner of his space and removes a cup-sized Tupperware container from the freezer, already filled with urine, albeit frozen, and sets it on a plate to thaw overnight. Carolyn lies slumbering. Lester is awake, gazing at the ceiling. After a moment, he rises, taking care not to rouse Carolyn, and strolls toward the bathroom. The space is filled with steam. Lester glances around, perplexed, then concentrates on: Opposite us, in a pedestal bathtub, is Angela. Rose petals drift on the surface of the liquid, obscuring her nude form. Lester kneels by the bathtub like a man in church. She arches her back and gazes up at him suggestively. Lester gives her a hard look, then gradually slips his hand into the liquid between her limbs. Her eyes widen and she throws her head back. Close on Carolyn, her eyes wide, listening to the rhythmic brush of Lester's hand as he masturbates under the covers. She flips over and faces him. Carolyn gets out of bed, repelled."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Lester, still listening, appears as if he's about to implode. Her ears are covered by Jane, who starts singing to drown her out. Jane's singing stops, and in a panic, the hall is scurried down by Lester. The window is crossed to by Angela, who looks out. Angela is seen standing at the window in her underwear, looking down at us. Jane's window is across from us, where we look in. We are zoomed toward her, even as Angela poses in the window; Angela is clearly not of interest to us. Finally, we settle on the small make-up mirror, which shows a reflection of Jane back at her computer. Ricky sits in darkness, videotaping with his digicam. She smiles. Then suddenly, the drapes are closed and she's gone. The camera is lowered by him, and he smiles, then something below catches his attention. Seen through a window on the side of the Burnham's garage door is Lester, still in his suit, digging through shelves against the back wall. Through the stuff stored on the shelves, Lester digs, searching for something as if his very life depended on it. Suddenly, someone is heard trying to open a locked door. Moving swiftly, the drapes are pulled shut by Ricky, and a light is switched on. His room is made a haven of high-tech. A state-of-the-art multimedia computer crowds his desk, and high-end stereo and video equipment line the shelves, accompanied by hundreds of CDs. Easily, twenty thousand dollars worth of equipment is in this room. The door is opened by Ricky. The Colonel stands outside, eyeing him. A small plastic cup with a cap is held out by the Colonel. He disappears down the hall. Ricky smiles, shuts and locks his door. The plastic cup is put on the shelf by him, then he crosses to a mini refrigerator in the corner of his room and takes out a cup-sized Tupperware container from the freezer, already filled with urine, albeit frozen, and places it on a saucer to thaw overnight. Sleeping, Carolyn lies. The ceiling is stared at by Lester, who is awake. After a moment, he gets up, taking care not to disturb Carolyn, and walks toward the bathroom. The room is filled with steam. Around, Lester looks, confused, then focuses on: Across from us, in a pedestal bathtub, is Angela. The surface of the water is obscured by rose petals, hiding her naked body. The bathtub is knelt by Lester like a man in church. Her back is arched by her, and she looks up at him provocatively. A hard look is given to her by Lester, then his hand is slowly slipped into the water between her legs. Her eyes widen and her head is thrown back by her. Close on Carolyn, her eyes wide, she listens to the rhythmic brush of Lester's hand as he masturbates under the covers. Over she flips and faces him. Out of bed, Carolyn gets, repelled."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Lester, on edge, looks ready to implode. Jane covers her ears, singing to drown out the noise. Panicked, Lester hurries down the hall. Angela stands at the window in her underwear, looking out. We zoom past her to a make-up mirror reflecting Jane at her computer. Ricky, in darkness, videotapes her smiling. Suddenly, the drapes close. He lowers the camera, smiling, then notices something below. Through the Burnham's garage window, Lester, still in his suit, searches shelves frantically. Hearing someone at a locked door, Ricky swiftly shuts the drapes and turns on a light. His room is filled with high-tech gear worth twenty thousand dollars. Ricky opens the door to the Colonel, who hands him a small plastic cup. The Colonel leaves, and Ricky locks the door, placing the cup on a shelf. He retrieves a frozen urine-filled container from the mini fridge to thaw overnight. Carolyn sleeps while Lester, awake, stares at the ceiling. He quietly heads to the bathroom, filled with steam, and sees Angela in a bathtub with rose petals. Kneeling like a man in church, Lester reaches into the water. Angela arches provocatively. Carolyn, wide-eyed, listens to Lester's rhythmic movements under the covers, then turns away, repelled."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Lester, tense, looks ready to implode. Jane covers her ears and sings to block her out. When Jane stops, Lester panics and hurries down the hall. Angela walks to the window, gazing out. We see Angela in underwear at the window, looking down at us across from Jane’s. As we zoom in, Angela poses, but our focus is Jane’s reflection in a small mirror; she’s at her computer, smiling. Ricky films her in the dark. Suddenly, the drapes close—Jane disappears. Ricky lowers the camera, smiling, then notices something outside. Through the Burnhams' garage window, Lester, still in his suit, frantically searches shelves. A locked door rattles. Ricky quickly shuts the drapes and turns on a light. His room, filled with high-end multimedia gear and CDs, is worth twenty grand. Ricky opens the door to the Colonel, who hands him a capped plastic cup, then leaves. Ricky locks the door, sets the cup on a shelf, retrieves a frozen urine container from his mini-fridge, and sets it to thaw. Carolyn sleeps. Lester, awake, stares at the ceiling, then quietly heads to the bathroom. Amid steam, he finds Angela in a tub of rose-petal-covered water. Kneeling beside her, he slips his hand into the water. She arches provocatively, eyes wide. Carolyn listens to Lester masturbating, flips over to face him, then gets out of bed, disgusted."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Lester, still intently listening, appears as though he is on the verge of imploding from the tension. Meanwhile, Jane, in an attempt to block out the noise, covers her ears and begins to sing loudly to drown out the sound. Her singing abruptly comes to a halt, and in a state of panic, Lester hurriedly scurries down the hallway. Angela, on the other hand, makes her way over to the window and gazes out thoughtfully. We observe Angela standing at the window, dressed only in her underwear, as she looks down at us. Our perspective is from across Jane's window, peering in. We zoom in toward her, even as Angela strikes a pose in the window; it is evident that our interest does not lie with Angela. Eventually, our focus shifts to the small make-up mirror, where we catch a reflection of Jane, who is back at her computer. Ricky sits in the darkness, holding his digicam, as he records the scene. Jane is smiling. Then, quite suddenly, the drapes close, and she disappears from view. Ricky lowers his camera and smiles, but then something below captures his attention. Through a window on the side of the Burnham's garage door, we catch sight of Lester, still clad in his suit, as he rummages through the shelves against the back wall. Lester is frantically digging through the items stored on the shelves, searching for something as if his very life depended on finding it. Suddenly, we hear the sound of someone attempting to open a locked door. Moving swiftly, Ricky pulls the drapes shut and switches on a light. His room is a sanctuary of high-tech equipment. A state-of-the-art multimedia computer dominates his desk, and high-end stereo and video equipment line the shelves, along with hundreds of CDs. There is easily twenty thousand dollars worth of equipment in this room. Ricky opens the door to reveal the Colonel standing outside, eyeing him suspiciously. The Colonel holds out a small plastic cup with a cap and then disappears down the hall. Ricky smiles, shuts, and locks his door. He places the plastic cup on the shelf, then crosses to a mini refrigerator in the corner of his room. From the freezer, he retrieves a cup-sized Tupperware container already filled with urine, albeit frozen, and places it on a saucer to thaw overnight. Meanwhile, Carolyn lies sleeping peacefully. Lester, however, is wide awake, staring up at the ceiling. After a moment, he carefully gets up, taking care not to disturb Carolyn, and walks toward the bathroom. The room is filled with steam, creating a hazy atmosphere. Lester looks around, momentarily confused, then focuses on the scene before him: Across from us, in a pedestal bathtub, is Angela. Rose petals float delicately on the surface of the water, obscuring her naked body. Lester kneels by the bathtub, like a man in church, filled with reverence. Angela arches her back and looks up at him provocatively. Lester gives her a hard, intense look, then slowly slips his hand into the water between her legs. Her eyes widen in response, and she throws her head back. Close on Carolyn, her eyes wide open, listening to the rhythmic brush of Lester's hand as he masturbates under the covers. She flips over and faces him, repelled by the scene. Carolyn gets out of bed, unable to bear it any longer."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Lester, who is still intently listening to everything happening around him, gives the impression of someone who is on the brink of imploding due to the intense pressure of the moment. At the same time, Jane, in an earnest effort to block out the intrusive noise that is overwhelming her, covers her ears firmly with her hands and begins to sing loudly, her voice rising in volume to drown out the unwelcome sound. Her singing comes to a sudden and abrupt stop, and in a state of sheer panic, Lester quickly scurries down the hallway, almost as if fleeing from the tension. Angela, in contrast, calmly makes her way over to the window and gazes out thoughtfully, lost in her own world. We observe Angela standing at the window, dressed only in her underwear, her figure framed against the glass as she looks down at us. Our perspective is one from across Jane's window, where we are peering in. We zoom in toward Angela, even as she strikes a pose in the window, yet it becomes evident that our interest does not center on Angela. Eventually, our focus shifts to the small make-up mirror, where we catch a glimpse of Jane's reflection as she resumes working at her computer. Ricky sits quietly in the darkness, holding his digicam with steady hands, as he diligently records the entire scene. Jane is smiling, seemingly pleased. Then, quite suddenly and without warning, the drapes close, and she vanishes from view. Ricky lowers his camera and smiles contentedly, but then something below catches his attention. Through a window located on the side of the Burnham's garage door, we catch sight of Lester, still clad in his suit, as he frantically rummages through the shelves against the back wall. Lester is digging through the stored items with urgency, searching desperately as if his very life depends on finding whatever it is he seeks. Suddenly, we hear the sound of someone trying to open a locked door with determination. Moving with swift precision, Ricky pulls the drapes shut and switches on a light that brightens his room, which serves as a sanctuary filled with high-tech equipment. A state-of-the-art multimedia computer takes center stage on his desk, while high-end stereo and video equipment line the shelves, accompanied by hundreds of CDs. There is easily twenty thousand dollars worth of gear in this technologically advanced room. Ricky opens the door to reveal the Colonel standing outside, eyeing him suspiciously. The Colonel extends a small plastic cup with a cap before disappearing down the hall. Ricky smiles, then shuts and locks his door securely. He places the plastic cup on a nearby shelf, then crosses over to a mini refrigerator positioned in the corner of his room. From the freezer compartment, he retrieves a cup-sized Tupperware container already filled with urine, albeit frozen solid, and places it carefully on a saucer to thaw overnight. Meanwhile, Carolyn lies sleeping peacefully, undisturbed by the chaos. Lester, however, is wide awake, staring up at the ceiling with a restless mind. After a few moments, he carefully gets up, taking great care not to disturb Carolyn, and walks toward the bathroom. The room is filled with steam, creating a hazy and dreamlike atmosphere. Lester looks around, momentarily confused, then focuses on the scene before him: Across from us, in a pedestal bathtub, we see Angela. Rose petals float delicately on the surface of the water, artfully obscuring her naked body. Lester kneels by the bathtub, like a man in church, filled with reverence and awe. Angela arches her back and looks up at him provocatively, invitingly. Lester gives her a hard, intense look, then slowly and deliberately slips his hand into the water between her legs. Her eyes widen in response, and she throws her head back in reaction. Close on Carolyn, her eyes wide open, listening to the rhythmic brush of Lester's hand as he masturbates under the covers. She flips over and faces him, repelled by the scene she can no longer bear. Carolyn gets out of bed, unable to tolerate it any longer."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Lester, still listening intently, appears as though he is on the verge of imploding from the tension. Meanwhile, Jane, in an attempt to block out the noise, covers her ears with her hands and begins to sing loudly, her voice rising to drown out the surrounding sounds. As Jane's singing abruptly ceases, a wave of panic overtakes Lester, prompting him to scurry hurriedly down the hall, his movements quick and frantic. Angela, in a separate part of the scene, crosses the room with deliberate steps toward the window, where she peers out, her gaze directed downward. From our vantage point across from Jane's window, we observe Angela standing there in her underwear, looking down at us with a detached air. Our focus shifts as we zoom in toward her, even as Angela strikes a pose in the window, though our interest clearly lies elsewhere. Our attention finally settles on a small make-up mirror, where the reflection reveals Jane, now back at her computer, her face illuminated by the screen. In the dimly lit room, Ricky sits with his digicam, capturing the moment on video. Jane's face breaks into a smile, but suddenly, the drapes are drawn shut, and she disappears from view. Ricky lowers his camera, a smile playing on his lips, but then something below catches his eye. Through a window on the side of the Burnham's garage door, we catch sight of Lester, still clad in his suit, as he rummages through the shelves against the back wall with a sense of urgency, as if searching for something vital. Suddenly, the sound of someone attempting to open a locked door echoes through the space. Reacting swiftly, Ricky pulls the drapes shut and flicks on a light, revealing his room, a sanctuary of high-tech equipment. A state-of-the-art multimedia computer dominates his desk, while high-end stereo and video equipment line the shelves, alongside hundreds of CDs, the total value easily reaching twenty thousand dollars. Ricky moves to open the door, revealing the Colonel standing outside, scrutinizing him with a keen eye. The Colonel extends a small plastic cup with a cap toward Ricky before disappearing down the hall. Ricky, still smiling, closes and locks the door behind him. He places the plastic cup on a shelf, then crosses the room to a mini refrigerator in the corner, retrieving a cup-sized Tupperware container from the freezer, already filled with frozen urine, and sets it on a saucer to thaw overnight. Meanwhile, Carolyn lies asleep, her breathing steady, while Lester remains awake, his eyes fixed on the ceiling. After a moment of contemplation, he carefully rises from the bed, ensuring not to disturb Carolyn, and makes his way toward the bathroom. The room is enveloped in steam, creating a hazy atmosphere. Lester looks around, momentarily disoriented, before his gaze settles on the scene before him: across from us, in a pedestal bathtub, lies Angela, her body obscured by rose petals floating on the water's surface. Kneeling by the bathtub like a man in prayer, Lester watches as Angela arches her back, meeting his gaze with a provocative look. Lester returns her gaze with intensity, then slowly, deliberately, slips his hand into the water between her legs. Angela's eyes widen in response, and she throws her head back. Meanwhile, close on Carolyn, her eyes snap open, wide and alert, as she listens to the rhythmic sound of Lester's hand moving under the covers. Repulsed, Carolyn flips over to face him, then decisively gets out of bed, distancing herself from the scene."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Lester appears overwhelmed as Jane covers her ears and sings to drown out the noise. Panicked, Lester hurries down the hall while Angela looks out the window, posing in her underwear. We focus on a small make-up mirror reflecting Jane at her computer, smiling as Ricky videotapes her from the darkness. Suddenly, the drapes close, and Ricky lowers his camera, smiling before noticing something below. Through the Burnham's garage window, Lester, still in his suit, frantically searches the shelves. Hearing someone trying to open a locked door, Ricky swiftly closes the drapes and turns on a light, revealing his high-tech room filled with expensive equipment. He opens the door to the Colonel, who hands him a small plastic cup before leaving. Ricky locks the door, places the cup on a shelf, and retrieves a frozen urine sample from his mini fridge to thaw overnight. Meanwhile, Carolyn sleeps as Lester, awake, stares at the ceiling before quietly heading to the bathroom. There, he finds Angela in a bathtub filled with rose petals. Kneeling by the tub, he reaches into the water, prompting Angela to react provocatively. Back in bed, Carolyn listens to Lester's rhythmic movements under the covers, then turns to face him before getting out of bed, repelled."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Lester, still listening to the torrent of arguments that have filled their home lately, looks like he's about to implode. Jane covers her ears and starts singing a line from a popular Beatles song to drown her out. Jane's singing stops abruptly as the chaos intensifies, and panicked, Lester scurries down the hall of their suburban home, which has recently felt more like a battleground than a sanctuary. Angela crosses to the window and looks out, her silhouette framed against the early evening sky. We see Angela standing at the window in her underwear, a boldness that reflects the modern societal shift towards body positivity, looking down at us. We're across from Jane's window, looking in from the vantage point of the neighbor's sprawling elm tree. We zoom toward her, even as Angela poses in the window; we're clearly not interested in Angela. Finally, we settle on the small make-up mirror where we see a reflection of Jane, back at her computer, a refuge for the teenager overwhelmed by her parents' ongoing disputes. Ricky sits in darkness with his digicam, a model known for its high resolution, videotaping clandestinely. She's smiling, a rare moment of joy in her otherwise tumultuous household. Then suddenly the drapes close and she's gone. He lowers the camera and smiles with a mix of satisfaction and sadness, then something below catches his attention. Through a window on the side of the Burnham's garage door, we see Lester, still in his suit from his demoralizing job selling advertising, digging through shelves against the back wall. Lester digs through stuff stored on the shelves, searching for something as if his very life depended on it, perhaps a metaphor for his desperate search for meaning. Suddenly we hear someone trying to open a locked door, the sound echoing like a warning bell. Moving swiftly, Ricky pulls the drapes shut and switches on a light. His room is a haven of high-tech, reflecting his father's military discipline and his own rebellion through technological means. A state-of-the-art multimedia computer crowds his desk, and high-end stereo and video equipment line the shelves, as well as hundreds of CDs, cherished artifacts in the age of digital music. There is easily twenty thousand dollars worth of equipment in this room, a testament to his hidden talents. Ricky opens the door. The Colonel, his father known for his strict demeanor, stands outside, eyeing him with a mixture of suspicion and disappointment. The Colonel holds out a small plastic cup with a cap, a compulsory drug test that has become a ritual between them. He disappears down the hall, the silence heavy with unspoken words. Ricky smiles, shuts and locks his door, a symbolic gesture of maintaining control over his fragmented world. He puts the plastic cup on the shelf, then crosses to a mini refrigerator in the corner of his room and takes out a cup-sized Tupperware container from the freezer, already filled with urine, albeit frozen, a clever ruse to pass his father's tests, and places it on a saucer to thaw overnight. Carolyn lies sleeping beside Lester, who is awake, staring at the ceiling as if seeking answers in the stippled plaster. After a moment, he gets up, taking care not to disturb Carolyn, and walks toward the bathroom. The room is filled with steam, the remnants of a late-night shower. Lester looks around, confused, then focuses on: Across from us, in a pedestal bathtub, is Angela, a vision that haunts his midlife crisis. Rose petals float on the surface of the water, obscuring her naked body, a scene reminiscent of classical art, yet tinged with modern desire. Lester kneels by the bathtub like a man in church, caught between lust and reverence. She arches her back and looks up at him provocatively, aware of the power she holds. Lester gives her a hard look, then slowly slips his hand into the water between her legs, a bold move driven by months of suppressed longing. Her eyes widen and she throws her head back, caught in the intensity of the moment. Close on Carolyn, her eyes wide, listening to the rhythmic brush of Lester's hand as he masturbates under the covers, the sound like a taunt to her unfulfilled desires. She flips over and faces him, the reality of their distant marriage weighing heavily. Carolyn gets out of bed, repelled by the growing chasm between them."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Lester still listening looks like he is about to implode. Jane covers her ears and starts singing to drown her out. Jane's singing stops and panicked Lester scurries down the hall. Angela crosses to the window and looks out. We see Angela standing at the window in her underwear looking down at us. We are across from Jane's window looking in. We zoom toward her. even as Angela poses in the window we are clearly not interested in Angela. Finally we settle on the small makeup mirror where we see a reflection of Jane back at her computer. Ricky sits in darkness with his digicam videotaping. She is smiling. Then suddenly the drapes close and she is gone. He lowers the camera and smiles. then something below catches his attention. Through a window on the side of the Burnham's garage door we see Lester still in his suit digging through shelves against the back wall. Lester digs through stuff stored on the shelves searching for something as if his very life depended on it. Suddenly we hear someone trying to open a locked door. Moving swiftly Ricky pulls the drapes shut and switches on a light. His room is a haven of hightech. A stateoftheart multimedia computer crowds his desk and highend stereo and video equipment line the shelves as well as hundreds of CDs. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. There is easily twenty thousand dollars worth of equipment in this room. Ricky opens the door. The Colonel stands outside eyeing him. The Colonel holds out a small plastic cup with a cap. He disappears down the hall. Ricky smiles shuts and locks his door. He puts the plastic cup on the shelf then crosses to a mini refrigerator in the corner of his room and takes out a cupsized Tupperware container from the freezer already filled with urine albeit frozen and places it on a saucer to thaw overnight. Carolyn lies sleeping. Lester is awake staring at the ceiling. After a moment he gets up taking care not to disturb Carolyn and walks toward the bathroom. The room is filled with steam. Lester looks around confused then focuses on. Across from us in a pedestal bathtub is Angela. Rose petals float on the surface of the water obscuring her naked body. Lester kneels by the bathtub like a man in church. She arches her back and looks up at him provocatively. Lester gives her a hard look then slowly slips his hand into the water between her legs. Her eyes widen and she throws her head back. Close on Carolyn her eyes wide listening to the rhythmic brush of Lester's hand as he masturbates under the covers. She flips over and faces him. Carolyn gets out of bed repelled."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Lester still listening looks like he is about to implode. Jane covers her ears and starts singing to drown her out. Jane's singing stops and panicked Lester scurries down the hall. Angela crosses to the window and looks out. We see Angela standing at the window in her underwear looking down at us. We are across from Jane's window looking in. We zoom toward her. even as Angela poses in the window we are clearly not interested in Angela. Finally we settle on the small makeup mirror where we see a reflection of Jane back at her computer. Ricky sits in darkness with his digicam videotaping. She is smiling. Then suddenly the drapes close and she is gone. He lowers the camera and smiles. then something below catches his attention. Through a window on the side of the Burnham's garage door we see Lester still in his suit digging through shelves against the back wall. Lester digs through stuff stored on the shelves searching for something as if his very life depended on it. Suddenly we hear someone trying to open a locked door. Moving swiftly Ricky pulls the drapes shut and switches on a light. His room is a haven of hightech. A stateoftheart multimedia computer crowds his desk and highend stereo and video equipment line the shelves as well as hundreds of CDs. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. There is easily twenty thousand dollars worth of equipment in this room. Ricky opens the door. The Colonel stands outside eyeing him. The Colonel holds out a small plastic cup with a cap. He disappears down the hall. Ricky smiles shuts and locks his door. He puts the plastic cup on the shelf then crosses to a mini refrigerator in the corner of his room and takes out a cupsized Tupperware container from the freezer already filled with urine albeit frozen and places it on a saucer to thaw overnight. Carolyn lies sleeping. Lester is awake staring at the ceiling. After a moment he gets up taking care not to disturb Carolyn and walks toward the bathroom. The room is filled with steam. Lester looks around confused then focuses on. Across from us in a pedestal bathtub is Angela. Rose petals float on the surface of the water obscuring her naked body. Lester kneels by the bathtub like a man in church. She arches her back and looks up at him provocatively. Lester gives her a hard look then slowly slips his hand into the water between her legs. Her eyes widen and she throws her head back. Close on Carolyn her eyes wide listening to the rhythmic brush of Lester's hand as he masturbates under the covers. She flips over and faces him. Carolyn gets out of bed repelled."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Lester still listening looks like he is about to implode. Jane covers her ears and starts singing to drown her out. Jane's singing stops and panicked Lester scurries down the hall. Angela crosses to the window and looks out. We see Angela standing at the window in her underwear looking down at us. We are across from Jane's window looking in. We zoom toward her. even as Angela poses in the window we are clearly not interested in Angela. Finally we settle on the small makeup mirror where we see a reflection of Jane back at her computer. Ricky sits in darkness with his digicam videotaping. The room is filled with steam. Lester looks around confused then focuses on. Across from us in a pedestal bathtub is Angela. Rose petals float on the surface of the water obscuring her naked body. Lester kneels by the bathtub like a man in church. She arches her back and looks up at him provocatively. Lester gives her a hard look then slowly slips his hand into the water between her legs. Her eyes widen and she throws her head back. Close on Carolyn her eyes wide listening to the rhythmic brush of Lester's hand as he masturbates under the covers. She flips over and faces him. Carolyn gets out of bed repelled."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Lester still listening looks like he is about to implode. Jane covers her ears and starts singing to drown her out. Jane's singing stops and panicked Lester scurries down the hall. Angela crosses to the window and looks out. Lester gives her a hard look then slowly slips his hand into the water between her legs. Her eyes widen and she throws her head back. Close on Carolyn her eyes wide listening to the rhythmic brush of Lester's hand as he masturbates under the covers. She flips over and faces him. Carolyn gets out of bed repelled."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Ronald, lost in thought, feels like he's about to explode. Mary plugs her nose and begins whispering to block him out. Mary's whispering ends, and worried, Ronald sprints across the kitchen. Emma drifts to the bookshelf and gazes at it. We notice Emma standing by the bookshelf in her pajamas, glaring at us. We're beside Mary's bookshelf, staring in. We glide towards her, even as Emma stretches at the bookshelf; we're clearly not fascinated by Emma. Eventually, we focus on the tiny hand mirror where we glimpse a reflection of Mary, back at her typewriter. Alex hides in shadows with his camera, filming. She's beaming. Then abruptly the curtains shut, and she's vanished. He places the camera down and grins, then something outside catches his eye. Through a window on the side of the Johnson's shed door, we spot Ronald, still in his coat, rummaging through boxes near the side wall. Ronald rifles through objects stacked on the boxes, searching for an item as if his entire existence hinged on it. Suddenly, we catch someone attempting to unlock a sealed gate. Acting quickly, Alex draws the curtains closed and flicks on a lantern. His space is a sanctuary of cutting-edge gadgets. A brand-new digital workstation takes over his table, and advanced audio and video devices fill the shelves, along with stacks of records. There is easily thirty thousand dollars worth of gadgets in this space. Alex opens the gate. The General waits outside, watching him. The General extends a tiny glass jar with a lid. He vanishes into the corridor. Alex grins, secures and latches his gate. He places the glass jar on the box, then heads toward a mini freezer in the corner of his space and withdraws a jar-sized metal container from the cooler, already filled with ice cream, albeit solid, and positions it on a plate to melt overnight. Emma dozes off. Ronald is alert, inspecting the chandelier. After a while, he rises, being cautious not to unsettle Emma, and heads toward the kitchen. The space is heavy with smoke. Ronald surveys the scene, perplexed, then fixates on: Beside us, in a corner shower, is Emma. Daffodils float on the top of the liquid, concealing her clothed figure. Ronald bows by the shower like a man at a temple. She stretches her neck and glances at him suggestively. Ronald shoots her a serious glance, then slowly dips his hand into the liquid near her feet. Her eyes widen and she tilts her head sideways. Close on Emma, her eyes wide, hearing the steady hum of Ronald's hand as he massages beneath the sheets. She turns over and gazes at him. Emma climbs out of bed, disgusted."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Lester appears overwhelmed as Jane sings to drown out his thoughts. Angela stands at the window in her underwear, but the focus shifts to Jane at her computer, watched by Ricky with his digicam. Ricky captures Jane's smile until she disappears behind closed drapes. He notices Lester, in a suit, searching the garage frantically. Someone tries to unlock Ricky's door, prompting him to hide his high-tech room and prepare for a drug test. Meanwhile, Lester dreams of Angela in a bathtub filled with rose petals. As he fantasizes, Carolyn is disturbed by Lester's actions in bed and turns away, repelled by him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Carolyn gets out of bed repelled She flips over and faces him  Close on Carolyn her eyes wide listening to the rhythmic brush of Lester's hand as he masturbates under the covers  Her eyes widen and she throws her head back  Lester gives her a hard look then slowly slips his hand into the water between her legs  She arches her back and looks up at him provocatively  Lester kneels by the bathtub like a man in church  Rose petals float on the surface of the water obscuring her naked body  Across from us in a pedestal bathtub is Angela  Lester looks around confused then focuses on  The room is filled with steam  After a moment he gets up taking care not to disturb Carolyn and walks toward the bathroom  Lester is awake staring at the ceiling  Carolyn lies sleeping  He puts the plastic cup on the shelf then crosses to a mini refrigerator in the corner of his room and takes out a cupsized Tupperware container from the freezer already filled with urine albeit frozen and places it on a saucer to thaw overnight  Ricky smiles shuts and locks his door  He disappears down the hall  The Colonel holds out a small plastic cup with a cap  The Colonel stands outside eyeing him  Ricky opens the door  There is easily twenty thousand dollars worth of equipment in this room  A stateoftheart multimedia computer crowds his desk and highend stereo and video equipment line the shelves as well as hundreds of CDs  His room is a haven of hightech  Moving swiftly Ricky pulls the drapes shut and switches on a light  Suddenly we hear someone trying to open a locked door  Lester digs through stuff stored on the shelves searching for something as if his very life depended on it  Through a window on the side of the Burnham's garage door we see Lester still in his suit digging through shelves against the back wall  then something below catches his attention  He lowers the camera and smiles  Then suddenly the drapes close and she's gone  She's smiling  Ricky sits in darkness with his digicam videotaping  Finally we settle on the small makeup mirror where we see a reflection of Jane back at her computer  even as Angela poses in the window we're clearly not interested in Angela  We zoom toward her  We're across from Jane's window looking in  We see Angela standing at the window in her underwear looking down at us  Angela crosses to the window and looks out  Lester scurries down the hall  Jane's singing stops and panicked  Jane covers her ears and starts singing to drown her out  Lester still listening looks like he's about to implode "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Jane covers her ears and starts singing to drown her out Lester still listening looks like he is about to implode Angela crosses to the window and looks out Jane's singing stops and panicked Lester scurries down the hall We are across from Jane's window looking in We see Angela standing at the window in her underwear looking down at us even as Angela poses in the window we are clearly not interested in Angela We zoom toward her Ricky sits in darkness with his digicam videotaping Finally we settle on the small makeup mirror where we see a reflection of Jane back at her computer Then suddenly the drapes close and she is gone She is smiling then something below catches his attention He lowers the camera and smiles Lester digs through stuff stored on the shelves searching for something as if his very life depended on it Through a window on the side of the Burnham's garage door we see Lester still in his suit digging through shelves against the back wall Moving swiftly Ricky pulls the drapes shut and switches on a light Suddenly we hear someone trying to open a locked door A stateoftheart multimedia computer crowds his desk and highend stereo and video equipment line the shelves as well as hundreds of CDs His room is a haven of hightech Ricky opens the door There is easily twenty thousand dollars worth of equipment in this room The Colonel holds out a small plastic cup with a cap The Colonel stands outside eyeing him Ricky smiles shuts and locks his door He disappears down the hall Carolyn lies sleeping He puts the plastic cup on the shelf then crosses to a mini refrigerator in the corner of his room and takes out a cupsized Tupperware container from the freezer already filled with urine albeit frozen and places it on a saucer to thaw overnight After a moment he gets up taking care not to disturb Carolyn and walks toward the bathroom Lester is awake staring at the ceiling Lester looks around confused then focuses on The room is filled with steam Rose petals float on the surface of the water obscuring her naked body Across from us in a pedestal bathtub is Angela She arches her back and looks up at him provocatively Lester kneels by the bathtub like a man in church Her eyes widen and she throws her head back Lester gives her a hard look then slowly slips his hand into the water between her legs She flips over and faces him Close on Carolyn her eyes wide listening to the rhythmic brush of Lester's hand as he masturbates under the covers Carolyn gets out of bed repelled"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "There is easily twenty thousand dollars worth of equipment in this room  Ricky opens the door  The Colonel stands outside eyeing him  The Colonel holds out a small plastic cup with a cap  He disappears down the hall  Ricky smiles shuts and locks his door  He puts the plastic cup on the shelf then crosses to a mini refrigerator in the corner of his room and takes out a cupsized Tupperware container from the freezer already filled with urine albeit frozen and places it on a saucer to thaw overnight  Carolyn lies sleeping  Lester is awake staring at the ceiling  After a moment he gets up taking care not to disturb Carolyn and walks toward the bathroom  The room is filled with steam  Lester looks around confused then focuses on  Across from us in a pedestal bathtub is Angela  Rose petals float on the surface of the water obscuring her naked body  Lester kneels by the bathtub like a man in church  She arches her back and looks up at him provocatively  Lester gives her a hard look then slowly slips his hand into the water between her legs  Her eyes widen and she throws her head back  Close on Carolyn her eyes wide listening to the rhythmic brush of Lester's hand as he masturbates under the covers  She flips over and faces him  Carolyn gets out of bed repelled Lester still listening looks like he's about to implode  Jane covers her ears and starts singing to drown her out  Jane's singing stops and panicked  Lester scurries down the hall  Angela crosses to the window and looks out  We see Angela standing at the window in her underwear looking down at us  We're across from Jane's window looking in  We zoom toward her  even as Angela poses in the window we're clearly not interested in Angela  Finally we settle on the small makeup mirror where we see a reflection of Jane back at her computer  Ricky sits in darkness with his digicam videotaping  She's smiling  Then suddenly the drapes close and she's gone  He lowers the camera and smiles  then something below catches his attention  Through a window on the side of the Burnham's garage door we see Lester still in his suit digging through shelves against the back wall  Lester digs through stuff stored on the shelves searching for something as if his very life depended on it  Suddenly we hear someone trying to open a locked door  Moving swiftly Ricky pulls the drapes shut and switches on a light  His room is a haven of hightech  A stateoftheart multimedia computer crowds his desk and highend stereo and video equipment line the shelves as well as hundreds of CDs "
        }
      ]
    }
  ]
}