{
  "ground_truth": "An Indian regimental band strikes up martial music as a detachment of Indian Royal Air Force comes to attention at the shouted command of their NCO. An elaborately dressed military aide opens the door, and Lord Louis Mountbatten, resplendent in naval uniform, steps out onto the platform. He pauses and renders a salute. Nehru, Lady Mountbatten, and dignitaries look on as English and Indians watch Mountbatten approach a group of microphones identified as NBC, CBS, BBC, etc. He grins in his youthful, beguiling manner and makes the pranam to the cheering crowd, but it is cut off by the sound of a door being opened, close. Jinnah stands by one of the great pillars of the immense portico. It is a break in their Independence Conference, and as he lights a cigarette, a weary Gandhi approaches him with Azad. Jinnah's anger is clearly too deep to be left at the conference table. He slaps his lighter shut and addresses Gandhi in hushed but fiercely felt words. Nehru and Patel are approaching from the conference room, both of them looking worn and angry too. Jinnah raises his voice deliberately so Nehru will hear and sneers at the idea, though he cools a little. Gandhi is staring at Jinnah, trying to fathom the source of his anger and fear. He turns to see that Mountbatten has been standing in the open door to the conference room, as torn as Gandhi by the conflict, feeling it best controlled in formal discussion. Gandhi nods, and reluctantly the adversaries move back to the conference room with Gandhi the last through the door. Meanwhile, featuring Godse waving a black flag and shouting, a gathering of Hindu youths is near the entrance to the ashram. The youths and Kallenbach look back toward the ashram as Nehru steps out onto the porch and glares at the youths, his presence silencing them. Gandhi is rising from the floor, where his spinning wheel sits, and he stops halfway up, listening, then exhales a weary sigh. Mirabehn is spinning across the room and lifts her head as a signal to someone out of shot. Gandhi's two grandnieces, Manu and Abha, who help Mirabehn now that Ba is gone, rise quickly at Mirabehn's signal, with Manu helping with his shawl and Abha holding his sandals so that he can slip into them. It's cross—he's worried about other things, but Mirabehn just smiles at it. Gandhi looks down at Abha and taps her sharply on the top of the head. She nods obediently, a flicker of a smile around her mouth, youthful and irrepressible. The beauty of it almost saddens Gandhi. He taps her again—gently—and goes out.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "An Indian regimental ensemble strikes up martial melodies as a detachment of Indian Royal Air Force comes to attention at the shouted order of their NCO. An elaborately dressed military aide opens the portal, and Lord Louis Mountbatten, resplendent in naval attire, steps out onto the platform. He pauses and renders a salute. Nehru, Lady Mountbatten, and dignitaries look on as English and Indians observe Mountbatten approach a cluster of microphones identified as NBC, CBS, BBC, etc. He grins in his youthful, beguiling manner and makes the pranam to the cheering throng, but it is cut off by the sound of an entrance being opened, close. Jinnah stands by one of the grand columns of the immense portico. It is a break in their Independence Conference, and as he lights a cigarette, a fatigued Gandhi approaches him with Azad. Jinnah's ire is clearly too profound to be left at the conference table. He snaps his lighter shut and addresses Gandhi in hushed but fiercely felt words. Nehru and Patel are approaching from the conference chamber, both of them looking worn and indignant too. Jinnah raises his voice deliberately so Nehru will hear and sneers at the notion, though he cools a bit. Gandhi is staring at Jinnah, trying to fathom the source of his ire and dread. He turns to see that Mountbatten has been standing in the open portal to the conference chamber, as torn as Gandhi by the conflict, feeling it best controlled in formal discourse. Gandhi nods, and reluctantly the adversaries move back to the conference chamber with Gandhi the last through the entrance. Meanwhile, featuring Godse waving a black banner and shouting, a gathering of Hindu youths is near the entry to the ashram. The youths and Kallenbach look back toward the ashram as Nehru steps out onto the veranda and glares at the youths, his presence silencing them. Gandhi is rising from the floor, where his spinning implement sits, and he stops halfway up, listening, then exhales a weary sigh. Mirabehn is spinning across the chamber and lifts her head as a signal to someone out of shot. Gandhi's two grandnieces, Manu and Abha, who assist Mirabehn now that Ba is gone, rise quickly at Mirabehn's signal, with Manu helping with his shawl and Abha holding his footwear so that he can slip into them. It's cross—he's worried about other matters, but Mirabehn just smiles at it. Gandhi looks down at Abha and taps her sharply on the top of the head. She nods obediently, a flicker of a smile around her lips, youthful and irrepressible. The beauty of it almost saddens Gandhi. He taps her again—gently—and goes out."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "An Indian regimental band strikes up martial music as martial music is struck up by a detachment of Indian Royal Air Force at the shouted command of their NCO. The door is opened by an elaborately dressed military aide, and Lord Louis Mountbatten, resplendent in naval uniform, steps out onto the platform. A salute is rendered by him as he pauses. Nehru, Lady Mountbatten, and dignitaries look on while Mountbatten is approached by English and Indians watching a group of microphones identified as NBC, CBS, BBC, etc. This youthful, beguiling manner grins him and the pranam is made to the cheering crowd, but it cuts off the door being opened, close. Jinnah stands by one of the great pillars of the immense portico. It is a break in their Independence Conference, and a cigarette is lit by Jinnah as a weary Gandhi approaches him with Azad. The anger of Jinnah is clearly too deep to be left at the conference table. His lighter is slapped shut by him and Gandhi is addressed by him in hushed but fiercely felt words. Nehru and Patel approach from the conference room, both of them looking worn and angry too. The voice of Jinnah is deliberately raised by him so Nehru will hear and he sneers at the idea, though a little is cooled. Jinnah is stared at by Gandhi, trying to fathom the source of his anger and fear. He turns to see that Mountbatten has been standing in the open door to the conference room, as torn as Gandhi by the conflict, feeling it best controlled in formal discussion. Gandhi nods, and the adversaries are reluctantly moved back to the conference room by him with Gandhi the last through the door. Meanwhile, Godse is featured waving a black flag and shouting near the entrance to the ashram by a gathering of Hindu youths. The ashram is looked back toward by the youths and Kallenbach as Nehru steps out onto the porch and their silence is caused by him. Gandhi is rising from the floor, where his spinning wheel sits, and halfway up he stops, listening, then a weary sigh is exhaled by him. Mirabehn is spinning across the room and her head is lifted as a signal to someone out of shot. Gandhi's two grandnieces, Manu and Abha, who help Mirabehn now that Ba is gone, quickly rise at Mirabehn's signal, with his shawl being helped by Manu and his sandals held by Abha so that they can be slipped into by him. It's cross—he's worried about other things, but it is just smiled at by Mirabehn. Abha is looked down at by Gandhi and a sharp tap is given by him on the top of her head. A nod is given obediently by her, a flicker of a smile around her mouth, youthful and irrepressible. It almost saddens Gandhi, the beauty of it. She is tapped again by him—gently—and out he goes."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "An Indian regimental band plays martial music as the Indian Royal Air Force detachment comes to attention at their NCO's command. A military aide opens the door for Lord Louis Mountbatten, who steps out in naval uniform and salutes. Nehru, Lady Mountbatten, and dignitaries watch as Mountbatten approaches microphones marked NBC, CBS, BBC, etc. He grins and makes the pranam to the crowd, interrupted by a door opening. Jinnah stands by the portico, lighting a cigarette as Gandhi and Azad approach during a break in their Independence Conference. Jinnah, deeply angry, speaks harshly to Gandhi. Nehru and Patel, also weary, approach from the conference room. Jinnah raises his voice, but Gandhi tries to understand his anger. Mountbatten stands by the conference room door, hoping formal discussions will help. Gandhi nods, and the adversaries return to the conference room. Meanwhile, Godse waves a black flag as Hindu youths gather near the ashram entrance. Nehru steps out, silencing them. Gandhi, rising from the floor by his spinning wheel, listens and sighs. Mirabehn signals Gandhi's grandnieces, Manu and Abha, who help him with his shawl and sandals. Gandhi taps Abha gently on the head, and she smiles, almost saddening him. He taps her again gently before leaving."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "An Indian regimental band plays as the Indian Royal Air Force stands at attention. An aide opens the door, and Lord Louis Mountbatten, in naval uniform, salutes. Nehru, Lady Mountbatten, and others watch as Mountbatten greets the crowd at microphones labeled NBC, CBS, BBC. Jinnah stands by a pillar, smoking, as a tired Gandhi approaches. Jinnah's deep anger is evident as he addresses Gandhi, loud enough for Nehru and Patel to hear. As tensions rise, Mountbatten stands in the doorway, hoping for control through discussion. Gandhi nods, leading adversaries back to the conference. Meanwhile, Godse waves a black flag as Hindu youths gather near the ashram. Nehru emerges, quieting them with his glare. Gandhi, rising from his spinning, sighs. Mirabehn spins and signals for help. Manu helps with Gandhi’s shawl, and Abha offers his sandals. Gandhi taps Abha on the head, and her smile almost saddens him. He gently taps her again before leaving."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In the midst of a buzzing ceremonial atmosphere, an Indian regimental band begins to play stirring martial music, setting the scene with their resonant melodies. As the commanding voice of their non-commissioned officer rings out, a detachment of the Indian Royal Air Force snaps to attention with disciplined precision. Meanwhile, an aide, adorned in elaborate military attire, carefully opens the door to reveal the arrival of Lord Louis Mountbatten. Dressed impressively in his distinguished naval uniform, Mountbatten steps out onto the welcoming platform. He halts momentarily and respectfully renders a formal salute. Observing the proceedings are Nehru, Lady Mountbatten, and various dignitaries, while both English and Indian onlookers watch intently as Mountbatten makes his way towards a cluster of microphones from media giants such as NBC, CBS, and BBC. Exhibiting a youthful and captivating charm, he offers a pranam to the jubilant crowd, though this gesture is abruptly interrupted by the sound of a door creaking open nearby. \n\nStanding close to one of the massive pillars of the grand portico is Jinnah, who is momentarily pausing from their ongoing Independence Conference. As he lights a cigarette, a fatigued Gandhi approaches, accompanied by Azad. Jinnah's frustration is palpably intense, refusing to be confined to the confines of the conference table. With a sharp flick, he closes his lighter and addresses Gandhi with words that are softly spoken yet heavily laden with emotion. Meanwhile, Nehru and Patel are seen emerging from the conference room, both visibly exhausted and frustrated as well. Jinnah, raising his voice deliberately, ensures that Nehru overhears his disdainful remarks, though he starts to compose himself slightly. Gandhi, looking intently at Jinnah, tries to discern the roots of his deep anger and apprehension. Turning his head, he notices that Mountbatten has been quietly standing in the open doorway of the conference room, as conflicted as Gandhi himself, believing that the situation could best be managed through structured dialogue. Acknowledging this, Gandhi nods, and with some reluctance, the opponents slowly return to the negotiation table, with Gandhi being the last to pass through the door.\n\nSimultaneously, near the entrance to the ashram, a crowd of Hindu youths, led by Godse who waves a black flag and shouts, is assembled. The presence of Kallenbach among them adds to the tension as they turn their eyes toward the ashram’s direction. Nehru steps out onto the porch and fixes the youths with a stern glare, his appearance alone sufficient to quiet them. Inside, Gandhi is in the process of rising from the floor where his spinning wheel sits, pausing midway to listen before exhaling a long, weary sigh. Across the room, Mirabehn is also engaged in spinning, but upon sensing something, she raises her head as a discreet signal to someone out of view. In response, Gandhi's two grandnieces, Manu and Abha, who assist Mirabehn now that Ba is no longer there, quickly spring into action. Manu adeptly helps Gandhi with his shawl, and Abha holds out his sandals, ready for him to step into them. Despite the tension of the moment, Mirabehn merely smiles, unfazed. Gandhi, glancing down at Abha, taps her gently but sharply on the top of her head. She acknowledges with a nod, a hint of a smile playing around her youthful, lively mouth. The sight of her youthful vitality almost brings a sense of sadness to Gandhi. He taps her again—this time more softly—and then proceeds to make his way outside."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Amidst the vibrant and energetic aura of a ceremonious gathering, an Indian regimental band commences the event with stirring and evocative martial music, their resonant melodies beautifully filling the air and setting the perfect scene. At this moment, the commanding and assertive voice of the non-commissioned officer rings out clearly, prompting a detachment of the Indian Royal Air Force to snap to attention with extraordinary and disciplined precision. Simultaneously, an aide, impressively adorned in elaborate and ornate military attire, carefully and meticulously opens the door, revealing the grand arrival of Lord Louis Mountbatten. Dressed with notable elegance in his distinguished and commendable naval uniform, Mountbatten steps gracefully onto the welcoming platform. He pauses momentarily with intention and respect, rendering a formal and dignified salute. Observing the proceedings with keen interest are Nehru, Lady Mountbatten, and several other dignitaries, while both English and Indian onlookers watch intently as Mountbatten makes his way towards a positioned cluster of microphones belonging to media giants such as NBC, CBS, and BBC. Displaying an aura of youthful and captivating charm, he offers a pranam to the jubilant and enthusiastic crowd, a gesture that is suddenly and abruptly interrupted by the unexpected sound of a door creaking open nearby.\n\nPositioned close to one of the massive and imposing pillars of the grand portico stands Jinnah, momentarily pausing from the ongoing and crucial Independence Conference. As he lights a cigarette, a fatigued and weary Gandhi approaches, accompanied by Azad. Jinnah's frustration is palpably intense, a visible testament to his refusal to be confined to the restrictive confines of the conference table. With a sharp flick of resolve, he closes his lighter and addresses Gandhi with words that are softly spoken yet heavily laden with emotion and significance. Meanwhile, Nehru and Patel are seen emerging from the conference room, both visibly exhausted and manifesting signs of deep frustration. Jinnah, deliberately raising his voice, ensures that Nehru overhears his disdainful and critical remarks, although he starts to compose his demeanor slightly. Gandhi, looking intently at Jinnah, strives to discern and understand the roots of his deep-seated anger and apprehension. As he turns his head, he notices that Mountbatten has been quietly standing in the open doorway of the conference room, appearing as conflicted as Gandhi himself, with the belief that the situation could be best managed and resolved through structured dialogue. Acknowledging this, Gandhi nods, and with some degree of reluctance, the opponents slowly return to the negotiation table, with Gandhi being the last to pass through the door.\n\nSimultaneously, near the entrance to the peaceful ashram, a crowd of Hindu youths, led by Godse, who waves a black flag and shouts loudly, is assembled in protest. The presence of Kallenbach among them adds additional tension and intensity as they turn their eyes toward the ashram’s direction in expectant anticipation. Nehru steps out onto the porch and fixes the youths with a stern and penetrating glare, his mere presence and appearance proving enough to quiet them. Inside, Gandhi is in the process of rising from the floor where his spinning wheel sits, pausing midway to listen intently before exhaling a long, weary sigh of resignation. Across the room, Mirabehn is also engaged in spinning, but upon sensing something, she raises her head as a discreet and subtle signal to someone out of view. In response, Gandhi's two grandnieces, Manu and Abha, who assist Mirabehn now that Ba is no longer there, quickly spring into action. Manu adeptly assists Gandhi with his shawl, while Abha holds out his sandals, ready and waiting for him to step into them. Despite the palpable tension of the moment, Mirabehn merely smiles, appearing unfazed and serene. Gandhi, glancing down at Abha, taps her gently but sharply on the top of her head. She acknowledges with a nod, a hint of a smile playing around her youthful and lively mouth. The sight of her youthful vitality almost brings a poignant sense of sadness to Gandhi. He taps her again—this time more softly—and subsequently proceeds to make his careful way outside."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the Indian regimental band fills the air with martial music, the anticipation builds as a detachment of the Indian Royal Air Force smartly comes to attention in response to the shouted command from their non-commissioned officer. Amid this display of discipline and ceremony, an elaborately dressed military aide steps forward with precision to open the door, revealing Lord Louis Mountbatten. Clad in his resplendent naval uniform, he steps out onto the platform with a deliberate grace, pausing momentarily to render a formal salute. Observers, including Nehru, Lady Mountbatten, and other dignitaries, along with an audience of both English and Indian onlookers, keenly watch as Mountbatten approaches a cluster of microphones marked with the logos of NBC, CBS, BBC, and others. With a youthful, beguiling grin, he acknowledges the exuberant crowd, performing the traditional pranam. However, the exuberance of the reception is abruptly interrupted when the sound of a door opening close by captures everyone's attention. Standing by one of the towering pillars of the vast portico is Jinnah, who, amidst a break in their Independence Conference, draws on the moment to light a cigarette. His demeanor conveys a deep-seated anger that refuses to be left behind at the conference table. As Gandhi wearily approaches with Azad, Jinnah snaps his lighter shut with a sharp motion and directs his words towards Gandhi in a hushed yet intensely passionate tone. Meanwhile, Nehru and Patel emerge from the conference room, their expressions worn and fraught with frustration. As Nehru draws closer, Jinnah purposely raises his voice, ensuring that his scorn reaches Nehru's ears, before he finally tempers his tone. Gandhi, deeply contemplative, fixates on Jinnah, endeavoring to comprehend the roots of his anger and apprehension. Gandhi's gaze shifts to Mountbatten, who stands at the open door of the conference room, mirroring Gandhi's internal conflict and promoting the belief that the issues are best addressed within the framework of formal discussions. Acknowledging this, Gandhi nods, and the adversaries prepare to return to the conference room, with Gandhi being the last to pass through the door. Meanwhile, a scene unfolds near the entrance to the ashram, where Godse prominently waves a black flag and shouts among a congregation of Hindu youths. Their attention, along with that of Kallenbach, is drawn towards the ashram just as Nehru emerges onto the porch. His imposing presence and intense glare immediately calm the chattering youths. Inside, Gandhi rises from the floor, beside his spinning wheel, pausing halfway to listen intently before releasing a weary sigh of resignation. Across the room, Mirabehn, engaged in her own spinning, lifts her head purposefully, signaling discreetly to someone off-camera. In response to Mirabehn's signal, Gandhi's two grandnieces, Manu and Abha, swiftly rise to their feet, with Manu dutifully assisting Gandhi with his shawl while Abha ensures his sandals are ready for him to slip on with ease. Despite concerns occupying his mind, Gandhi catches Mirabehn's serene smile and, momentarily, finds solace. He glances down at Abha with affectionate sternness, gently tapping her on the top of her head. Abha nods in understanding, a playful, irrepressible smile dancing at the corners of her mouth, a sight that tugs at Gandhi's heart with its tender beauty. With another gentle tap on Abha's head, Gandhi gracefully moves to step outside, carrying the weight of his thoughts with him."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "An Indian regimental band plays martial music as the Indian Royal Air Force detachment stands at attention. Lord Louis Mountbatten, in naval uniform, steps onto the platform, salutes, and then approaches a group of microphones labeled with international media outlets as Nehru, Lady Mountbatten, and other dignitaries look on. He greets the cheering crowd with a warm smile and a traditional pranam before the door opens revealing Jinnah by a massive portico pillar. During a break in the Independence Conference, Jinnah lights a cigarette as a weary Gandhi, accompanied by Azad, approaches. Displaying deep anger, Jinnah snaps his lighter shut and exchanges tense words with Gandhi. As Nehru and Patel, equally worn and angry, approach, Jinnah's voice rises for Nehru to hear. Gandhi observes Jinnah, attempting to understand his anger, then notices Mountbatten standing at the conference room door, conflicted but preferring formal discussions. With Gandhi's nod, the adversaries reluctantly return to the conference room, Gandhi last through the door. Nearby, Godse and Hindu youths protest at the ashram entrance until Nehru's commanding presence silences them. Inside, Gandhi, rising from his spinning wheel, listens to the commotion with a sigh. Mirabehn signals Gandhi's grandnieces, Manu and Abha, who quickly assist with his shawl and sandals. Despite Gandhi’s preoccupation, Mirabehn remains cheerful. Gandhi gently taps Abha on the head, eliciting her obedient smile. Touched by the moment's beauty, Gandhi lightly taps her again before leaving."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "An Indian regimental band, showcasing the country's rich tradition of military music, strikes up martial music as a detachment of Indian Royal Air Force, an institution established during British rule and gaining prominence, comes to attention at the shouted command of their NCO. An elaborately dressed military aide opens the door, and Lord Louis Mountbatten, the last Viceroy of India known for his diplomatic efforts during India's transition to independence, steps out onto the platform. He pauses and renders a salute. Nehru, an influential leader in the Indian independence movement and the first Prime Minister of India, Lady Mountbatten, his wife known for her humanitarian work, and dignitaries look on as English and Indians watch Mountbatten approach a group of microphones identified as NBC, CBS, BBC, major broadcasting networks of the time that covered global events extensively. He grins in his youthful, beguiling manner and makes the pranam, a traditional Indian gesture of respect, to the cheering crowd, but it is cut off by the sound of a door being opened, close. Jinnah, a key figure in the formation of Pakistan and often at odds with Gandhi, stands by one of the great pillars of the immense portico. It is a break in their Independence Conference, where crucial discussions around India's future are underway, and as he lights a cigarette, a weary Gandhi, the iconic leader of the Indian independence movement known for his philosophy of non-violence, approaches him with Azad, another prominent freedom fighter. Jinnah's anger, fueled by the contentious negotiations over partition, is clearly too deep to be left at the conference table. He slaps his lighter shut and addresses Gandhi in hushed but fiercely felt words. Nehru and Patel, who played significant roles in India's independence and subsequent political landscape, are approaching from the conference room, both of them looking worn and angry too. Jinnah raises his voice deliberately so Nehru will hear and sneers at the idea, though he cools a little. Gandhi is staring at Jinnah, trying to fathom the source of his anger and fear. He turns to see that Mountbatten has been standing in the open door to the conference room, as torn as Gandhi by the conflict, feeling it best controlled in formal discussion. Gandhi nods, and reluctantly the adversaries move back to the conference room with Gandhi the last through the door. Meanwhile, featuring Godse, who would later be known for assassinating Gandhi, waving a black flag and shouting, a gathering of Hindu youths is near the entrance to the ashram, a place Gandhiji embraced for its simplicity and communal living. The youths and Kallenbach, an associate and supporter of Gandhi, look back toward the ashram as Nehru steps out onto the porch and glares at the youths, his presence silencing them with the authority he commanded. Gandhi is rising from the floor, where his spinning wheel, symbolizing self-reliance and resistance to colonial imports, sits, and he stops halfway up, listening, then exhales a weary sigh. Mirabehn, originally named Madeleine Slade, who was a devoted follower of Gandhi, is spinning across the room and lifts her head as a signal to someone out of shot. Gandhi's two grandnieces, Manu and Abha, who help Mirabehn now that Ba, Kasturba Gandhi, Gandhi's deceased wife and companion in his political journey, is gone, rise quickly at Mirabehn's signal, with Manu helping with his shawl and Abha holding his sandals so that he can slip into them. It's cross—he's worried about other things, but Mirabehn just smiles at it. Gandhi looks down at Abha and taps her sharply on the top of the head. She nods obediently, a flicker of a smile around her mouth, youthful and irrepressible. The beauty of it—her youthful resilience—almost saddens Gandhi. He taps her again—gently—and goes out."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "An Indian regimental band strikes up martial music as a detachment of Indian Royal Air Force comes to attention at the shouted command of their NCO. An elaborately dressed military aide opens the door and Lord Louis Mountbatten resplendent in naval uniform steps out onto the platform. He pauses and renders a salute. Nehru Lady Mountbatten and dignitaries look on as English and Indians watch Mountbatten approach a group of microphones identified as NBC CBS BBC etc. He grins in his youthful beguiling manner and makes the pranam to the cheering crowd but it is cut off by the sound of a door being opened close. Jinnah stands by one of the great pillars of the immense portico. It is a break in their Independence Conference and as he lights a cigarette a weary Gandhi approaches him with Azad. Jinnah's anger is clearly too deep to be left at the conference table. He slaps his lighter shut and addresses Gandhi in hushed but fiercely felt words. Nehru and Patel are approaching from the conference room both of them looking worn and angry too. Jinnah raises his voice deliberately so Nehru will hear and sneers at the idea though he cools a little. Gandhi is staring at Jinnah trying to fathom the source of his anger and fear. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. He turns to see that Mountbatten has been standing in the open door to the conference room as torn as Gandhi by the conflict feeling it best controlled in formal discussion. Gandhi nods and reluctantly the adversaries move back to the conference room with Gandhi the last through the door. Meanwhile featuring Godse waving a black flag and shouting a gathering of Hindu youths is near the entrance to the ashram. The youths and Kallenbach look back toward the ashram as Nehru steps out onto the porch and glares at the youths his presence silencing them. Gandhi is rising from the floor where his spinning wheel sits and he stops halfway up listening then exhales a weary sigh. Mirabehn is spinning across the room and lifts her head as a signal to someone out of shot. Gandhi's two grandnieces Manu and Abha who help Mirabehn now that Ba is gone rise quickly at Mirabehn's signal with Manu helping with his shawl and Abha holding his sandals so that he can slip into them. It is cross—he is worried about other things but Mirabehn just smiles at it. Gandhi looks down at Abha and taps her sharply on the top of the head. She nods obediently a flicker of a smile around her mouth youthful and irrepressible. The beauty of it almost saddens Gandhi. He taps her again—gently—and goes out."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "An Indian regimental band strikes up martial music as a detachment of Indian Royal Air Force comes to attention at the shouted command of their NCO. An elaborately dressed military aide opens the door and Lord Louis Mountbatten resplendent in naval uniform steps out onto the platform. He pauses and renders a salute. Nehru Lady Mountbatten and dignitaries look on as English and Indians watch Mountbatten approach a group of microphones identified as NBC CBS BBC etc. He grins in his youthful beguiling manner and makes the pranam to the cheering crowd but it is cut off by the sound of a door being opened close. Jinnah stands by one of the great pillars of the immense portico. It is a break in their Independence Conference and as he lights a cigarette a weary Gandhi approaches him with Azad. Jinnah's anger is clearly too deep to be left at the conference table. He slaps his lighter shut and addresses Gandhi in hushed but fiercely felt words. Nehru and Patel are approaching from the conference room both of them looking worn and angry too. Jinnah raises his voice deliberately so Nehru will hear and sneers at the idea though he cools a little. Gandhi is staring at Jinnah trying to fathom the source of his anger and fear. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. He turns to see that Mountbatten has been standing in the open door to the conference room as torn as Gandhi by the conflict feeling it best controlled in formal discussion. Gandhi nods and reluctantly the adversaries move back to the conference room with Gandhi the last through the door. Meanwhile featuring Godse waving a black flag and shouting a gathering of Hindu youths is near the entrance to the ashram. The youths and Kallenbach look back toward the ashram as Nehru steps out onto the porch and glares at the youths his presence silencing them. Gandhi is rising from the floor where his spinning wheel sits and he stops halfway up listening then exhales a weary sigh. Mirabehn is spinning across the room and lifts her head as a signal to someone out of shot. Gandhi's two grandnieces Manu and Abha who help Mirabehn now that Ba is gone rise quickly at Mirabehn's signal with Manu helping with his shawl and Abha holding his sandals so that he can slip into them. It is cross—he is worried about other things but Mirabehn just smiles at it. Gandhi looks down at Abha and taps her sharply on the top of the head. She nods obediently a flicker of a smile around her mouth youthful and irrepressible. The beauty of it almost saddens Gandhi. He taps her again—gently—and goes out."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "An Indian regimental band strikes up martial music as a detachment of Indian Royal Air Force comes to attention at the shouted command of their NCO. An elaborately dressed military aide opens the door and Lord Louis Mountbatten resplendent in naval uniform steps out onto the platform. He pauses and renders a salute. Nehru Lady Mountbatten and dignitaries look on as English and Indians watch Mountbatten approach a group of microphones identified as NBC CBS BBC etc. He grins in his youthful beguiling manner and makes the pranam to the cheering crowd but it is cut off by the sound of a door being opened close. Jinnah stands by one of the great pillars of the immense portico. Gandhi's two grandnieces Manu and Abha who help Mirabehn now that Ba is gone rise quickly at Mirabehn's signal with Manu helping with his shawl and Abha holding his sandals so that he can slip into them. It is cross—he is worried about other things but Mirabehn just smiles at it. Gandhi looks down at Abha and taps her sharply on the top of the head. She nods obediently a flicker of a smile around her mouth youthful and irrepressible. The beauty of it almost saddens Gandhi. He taps her again—gently—and goes out."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "An Indian regimental band strikes up martial music as a detachment of Indian Royal Air Force comes to attention at the shouted command of their NCO. An elaborately dressed military aide opens the door and Lord Louis Mountbatten resplendent in naval uniform steps out onto the platform. He pauses and renders a salute. The beauty of it almost saddens Gandhi. He taps her again—gently—and goes out."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "A Norwegian choir hums a classical tune as a group of French Railway Workers relaxes at the whispered suggestion of their manager. A casually dressed postal worker closes the window, and Sir Winston Churchill, radiant in racing attire, shuffles onto the balcony. He hesitates and waves a handkerchief. Smith, Mr. Churchill, and travelers glance over as Canadians and Germans observe Churchill wander toward a cluster of telephones labeled as CNN, NPR, ABC, etc. He smirks in his elderly, charming way and performs the namaste to the applauding audience, but it is interrupted by the sound of a window being closed, nearby. Roosevelt lounges beside one of the large statues of the vast colonnade. It is an intermission in their Election Rally, and as he chews gum, a tired Eisenhower strolls up with Johnson. Roosevelt's irritation is evidently too profound to be discarded at the party podium. He snaps his gum packet shut and questions Eisenhower in low but intensely spoken remarks. Smith and Brown are strolling from the party hall, both of them appearing frazzled and irritated as well. Roosevelt elevates his tone on purpose so Smith will notice and mocks the notion, despite calming somewhat. Eisenhower is gazing at Roosevelt, attempting to uncover the root of his frustration and dread. He pivots to observe that Churchill has been leaning in the open window of the party hall, as conflicted as Eisenhower by the confrontation, believing it best managed in structured dialogue. Eisenhower nods, and grudgingly the opponents return to the party hall with Eisenhower the last through the window. Meanwhile, featuring Einstein waving a white banner and chanting, a cluster of Buddhist adults is near the exit to the inn. The adults and Oppenheimer turn around toward the inn as Smith walks onto the patio and squints at the adults, his appearance quieting them. Eisenhower is getting up from the bench, where his typewriter rests, and he pauses partially upright, listening, then releases a deep breath. Madam Curie is typing around the corner and raises her gaze as a cue to someone off-camera. Eisenhower's two cousins, Sally and Beth, who assist Madam Curie now that Dan is missing, stand promptly at Madam Curie's cue, with Sally aiding with his jacket and Beth holding his glasses so that he can slide them on. It's fatigued—he's preoccupied with additional matters, but Madam Curie merely grins at it. Eisenhower glances down at Beth and pats her softly on the shoulder. She acknowledges obediently, a twinkle of amusement on her lips, aged and indomitable. The elegance of it nearly dismays Eisenhower. He pats her once more—tenderly—and exits."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "An Indian regimental band plays as the Indian Royal Air Force stands at attention. Lord Louis Mountbatten, in naval uniform, exits onto the platform, saluting before approaching a group of microphones. Nehru, Lady Mountbatten, and other dignitaries watch. Suddenly, a door opens, and Jinnah stands by the portico during a break in the Independence Conference. Weary Gandhi and Azad approach him, but Jinnah’s anger overflows into a harsh exchange, overheard by Nehru and Patel. Gandhi, trying to understand Jinnah’s hostility, notices Mountbatten at the conference room door, advocating formal discussions. Reluctantly, the men return to the conference room, led by Gandhi. Meanwhile, Godse leads a group of Hindu youths protesting at the ashram entrance, but Nehru’s presence silences them. Inside, Gandhi, tired, works at his spinning wheel. Mirabehn signals Gandhi’s grandnieces, Manu and Abha, to assist him. They prepare him, showing obedience and a hint of youthful spirit. Gandhi’s gentle gesture to Abha brings a fleeting sadness, but they continue with their duties."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He taps her again—gently—and goes out The beauty of it almost saddens Gandhi She nods obediently a flicker of a smile around her mouth youthful and irrepressible Gandhi looks down at Abha and taps her sharply on the top of the head It is cross—he is worried about other things but Mirabehn just smiles at it Gandhi's two grandnieces Manu and Abha who help Mirabehn now that Ba is gone rise quickly at Mirabehn's signal with Manu helping with his shawl and Abha holding his sandals so that he can slip into them Mirabehn is spinning across the room and lifts her head as a signal to someone out of shot Gandhi is rising from the floor where his spinning wheel sits and he stops halfway up listening then exhales a weary sigh The youths and Kallenbach look back toward the ashram as Nehru steps out onto the porch and glares at the youths his presence silencing them Meanwhile featuring Godse waving a black flag and shouting a gathering of Hindu youths is near the entrance to the ashram Gandhi nods and reluctantly the adversaries move back to the conference room with Gandhi the last through the door He turns to see that Mountbatten has been standing in the open door to the conference room as torn as Gandhi by the conflict feeling it best controlled in formal discussion Gandhi is staring at Jinnah trying to fathom the source of his anger and fear Jinnah raises his voice deliberately so Nehru will hear and sneers at the idea though he cools a little Nehru and Patel are approaching from the conference room both of them looking worn and angry too He slaps his lighter shut and addresses Gandhi in hushed but fiercely felt words Jinnah's anger is clearly too deep to be left at the conference table It is a break in their Independence Conference and as he lights a cigarette a weary Gandhi approaches him with Azad Jinnah stands by one of the great pillars of the immense portico He grins in his youthful beguiling manner and makes the pranam to the cheering crowd but it is cut off by the sound of a door being opened close Nehru Lady Mountbatten and dignitaries look on as English and Indians watch Mountbatten approach a group of microphones identified as NBC CBS BBC etc He pauses and renders a salute An elaborately dressed military aide opens the door and Lord Louis Mountbatten resplendent in naval uniform steps out onto the platform An Indian regimental band strikes up martial music as a detachment of Indian Royal Air Force comes to attention at the shouted command of their NCO"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "An elaborately dressed military aide opens the door and Lord Louis Mountbatten resplendent in naval uniform steps out onto the platform An Indian regimental band strikes up martial music as a detachment of Indian Royal Air Force comes to attention at the shouted command of their NCO Nehru Lady Mountbatten and dignitaries look on as English and Indians watch Mountbatten approach a group of microphones identified as NBC CBS BBC etc He pauses and renders a salute Jinnah stands by one of the great pillars of the immense portico He grins in his youthful beguiling manner and makes the pranam to the cheering crowd but it is cut off by the sound of a door being opened close Jinnah's anger is clearly too deep to be left at the conference table It is a break in their Independence Conference and as he lights a cigarette a weary Gandhi approaches him with Azad Nehru and Patel are approaching from the conference room both of them looking worn and angry too He slaps his lighter shut and addresses Gandhi in hushed but fiercely felt words Gandhi is staring at Jinnah trying to fathom the source of his anger and fear Jinnah raises his voice deliberately so Nehru will hear and sneers at the idea though he cools a little Gandhi nods and reluctantly the adversaries move back to the conference room with Gandhi the last through the door He turns to see that Mountbatten has been standing in the open door to the conference room as torn as Gandhi by the conflict feeling it best controlled in formal discussion The youths and Kallenbach look back toward the ashram as Nehru steps out onto the porch and glares at the youths his presence silencing them Meanwhile featuring Godse waving a black flag and shouting a gathering of Hindu youths is near the entrance to the ashram Mirabehn is spinning across the room and lifts her head as a signal to someone out of shot Gandhi is rising from the floor where his spinning wheel sits and he stops halfway up listening then exhales a weary sigh It is cross—he is worried about other things but Mirabehn just smiles at it Gandhi's two grandnieces Manu and Abha who help Mirabehn now that Ba is gone rise quickly at Mirabehn's signal with Manu helping with his shawl and Abha holding his sandals so that he can slip into them She nods obediently a flicker of a smile around her mouth youthful and irrepressible Gandhi looks down at Abha and taps her sharply on the top of the head He taps her again—gently—and goes out The beauty of it almost saddens Gandhi"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He turns to see that Mountbatten has been standing in the open door to the conference room as torn as Gandhi by the conflict feeling it best controlled in formal discussion Gandhi nods and reluctantly the adversaries move back to the conference room with Gandhi the last through the door Meanwhile featuring Godse waving a black flag and shouting a gathering of Hindu youths is near the entrance to the ashram The youths and Kallenbach look back toward the ashram as Nehru steps out onto the porch and glares at the youths his presence silencing them Gandhi is rising from the floor where his spinning wheel sits and he stops halfway up listening then exhales a weary sigh Mirabehn is spinning across the room and lifts her head as a signal to someone out of shot Gandhi's two grandnieces Manu and Abha who help Mirabehn now that Ba is gone rise quickly at Mirabehn's signal with Manu helping with his shawl and Abha holding his sandals so that he can slip into them It is cross—he is worried about other things but Mirabehn just smiles at it Gandhi looks down at Abha and taps her sharply on the top of the head She nods obediently a flicker of a smile around her mouth youthful and irrepressible The beauty of it almost saddens Gandhi He taps her again—gently—and goes out An Indian regimental band strikes up martial music as a detachment of Indian Royal Air Force comes to attention at the shouted command of their NCO An elaborately dressed military aide opens the door and Lord Louis Mountbatten resplendent in naval uniform steps out onto the platform He pauses and renders a salute Nehru Lady Mountbatten and dignitaries look on as English and Indians watch Mountbatten approach a group of microphones identified as NBC CBS BBC etc He grins in his youthful beguiling manner and makes the pranam to the cheering crowd but it is cut off by the sound of a door being opened close Jinnah stands by one of the great pillars of the immense portico It is a break in their Independence Conference and as he lights a cigarette a weary Gandhi approaches him with Azad Jinnah's anger is clearly too deep to be left at the conference table He slaps his lighter shut and addresses Gandhi in hushed but fiercely felt words Nehru and Patel are approaching from the conference room both of them looking worn and angry too Jinnah raises his voice deliberately so Nehru will hear and sneers at the idea though he cools a little Gandhi is staring at Jinnah trying to fathom the source of his anger and fear"
        }
      ]
    }
  ]
}