{
  "ground_truth": "Carolyn switches on the bedside light and sinks into a chair, stunned, as it's clear he knows where she's most vulnerable. He sees this, and likes it; it feels good to win for a change, so he curls up under the covers contentedly. Close on Lester, smiling. We are flying high above the neighborhood, and below we see the two Jims jogging. We approach them steadily and are now at street level, following the two Jims. Still running, the Jims turn back in perfect unison as Lester runs into frame, wearing a baggy sweatshirt and a pair of faded old sweatpants. The Jims slow down until he catches up, and the three men run together in the early morning light. The Colonel stands, scowling, as Ricky comes out of the house, holding the urine sample in front of him. The Colonel is washing his Ford Explorer, squatting to scrub the bumper, when something catches his eye: Lester and the Jims jog down the street. Lester breaks off from the two Jims and jogs up to Ricky and the Colonel, out of breath. He grabs hold of his knees and bends over, panting, then laughs and extends his hand to the Colonel, saluting him good-naturedly, grinning. An awkward beat follows, and then he heads into the house. Lester waves at the Colonel, then follows him. The Colonel watches them go, his eyes dark. Ricky enters, followed by Lester. He gives the urine specimen to Lester, then locks the door. Lester picks up a CD case from a shelf and examines it while Ricky crosses to a bureau, opens a drawer, takes clothing out, and piles it on his bed. Ricky, having emptied the drawer, now removes a false bottom, revealing rows of marijuana tightly packed in Zip-loc bags. Lester smiles, thinking this kid's cool. Carolyn, carrying a basket of fresh cut roses, passes by the garage window and stops to sniff the air, frowning. She peers through the window and sees Lester, in a T-shirt and gym shorts, lying on a new weight bench, doing bench presses with shiny new barbells. The garage is in the process of becoming Lester's sanctuary. Lester finishes his last rep, straining, then puts the weights in their rack and sits up. He looks up, squinting, as the door raises to reveal Carolyn, silhouetted against the bright sunlight outside, pointing a remote at us. Lester leans back on the bench and grabs the weights, and then she's gone. Elsewhere, Brad is seated behind his desk, reading a document as Lester sits across from him, smiling. Brad laughs, stops laughing, then leans back in his chair, studying Lester. Exhilarated, Lester walks down a corridor, his belongings in a box on his shoulder, happier than he's been in years.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Carolyn toggles on the bedside lamp and sinks into a seat, astonished, as it's evident he understands where she's most susceptible. He perceives this, and enjoys it; it feels pleasant to succeed for a shift, so he curls up beneath the blankets contentedly. Close on Lester, grinning. We are soaring high above the vicinity, and below we observe the two Jims jogging. We approach them steadily and are now at road level, pursuing the two Jims. Still running, the Jims turn back in flawless unison as Lester runs into frame, wearing a loose sweatshirt and a pair of faded old sweatpants. The Jims slow down until he catches up, and the three men run collectively in the early dawn light. The Colonel stands, glaring, as Ricky emerges from the residence, clutching the urine specimen in front of him. The Colonel is cleaning his Ford Explorer, crouching to scrub the fender, when something attracts his attention: Lester and the Jims jog down the lane. Lester breaks off from the two Jims and jogs up to Ricky and the Colonel, out of breath. He seizes hold of his knees and bends over, panting, then chuckles and extends his palm to the Colonel, saluting him amiably, grinning. An awkward moment follows, and then he heads into the house. Lester waves at the Colonel, then follows him. The Colonel observes them go, his eyes dark. Ricky enters, followed by Lester. He gives the urine sample to Lester, then secures the door. Lester picks up a CD case from a shelf and scrutinizes it while Ricky crosses to a chest, opens a drawer, takes garments out, and stacks it on his bed. Ricky, having emptied the drawer, now removes a false bottom, revealing rows of cannabis tightly packed in Zip-loc bags. Lester grins, thinking this youth's cool. Carolyn, carrying a basket of fresh cut roses, passes by the garage window and halts to inhale the air, frowning. She peers through the window and sees Lester, in a T-shirt and gym shorts, lying on a new weight bench, doing bench presses with shiny new dumbbells. The garage is in the process of becoming Lester's sanctuary. Lester completes his last rep, straining, then puts the weights in their rack and sits up. He looks up, squinting, as the door elevates to reveal Carolyn, silhouetted against the bright sunlight outside, pointing a remote at us. Lester reclines back on the bench and grabs the weights, and then she's gone. Elsewhere, Brad is seated behind his desk, perusing a document as Lester sits across from him, grinning. Brad chuckles, stops chuckling, then leans back in his chair, examining Lester. Thrilled, Lester strides down a corridor, his possessions in a box on his shoulder, happier than he's been in years."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Carolyn switches on the bedside light and sinks into a chair, stunned, as it's clear he knows where she's most vulnerable. This is seen by him, and he likes it; it feels good for him to win for a change, so the covers are curled up under contentedly by him. Lester, smiling, is closed on. We fly high above the neighborhood, and the two Jims are seen jogging below. They are approached steadily by us and now we are at street level, following the two Jims. Still running, the Jims turn back in perfect unison as the frame is run into by Lester, who is wearing a baggy sweatshirt and a pair of faded old sweatpants. The Jims slow down until he catches up, and the three men are run together with in the early morning light. The Colonel stands, scowling, as the house is exited by Ricky, who is holding the urine sample in front of him. The Ford Explorer is washed by the Colonel, who squats to scrub the bumper, when his eye catches something: the street is jogged down by Lester and the Jims. The two Jims are broken off from by Lester, who jogs up to Ricky and the Colonel, out of breath. His knees are grabbed hold of by him, and he bends over, panting, then laughs and extends his hand to the Colonel, saluting him good-naturedly, grinning. An awkward beat follows, and then the house is headed into by him. The Colonel is waved at by Lester, then Lester follows him. Their departure is watched by the Colonel, his eyes dark. Lester is followed by Ricky as he enters. The urine specimen is given to Lester by him, then the door is locked by him. A CD case is picked up from a shelf and examined by Lester while Ricky crosses to a bureau, opens a drawer, takes clothing out, and piles it on his bed. The drawer having been emptied by Ricky, a false bottom is now removed by him, revealing rows of marijuana tightly packed in Zip-loc bags. Lester smiles, thinking this kid's cool. Carrying a basket of fresh-cut roses, the garage window is passed by Carolyn, and the air is sniffed by her, frowning. She peers through the window and Lester, in a T-shirt and gym shorts, is seen by her lying on a new weight bench, doing bench presses with shiny new barbells. The garage is in the process of becoming Lester's sanctuary. His last rep is finished by Lester, straining, then the weights are put in their rack by him and he sits up. The door raises to reveal Carolyn, silhouetted against the bright sunlight outside, pointing a remote at us as he's looked up at, squinting. Lester leans back on the bench and the weights are grabbed by him, and then she's gone. Elsewhere, Brad sits behind his desk, reading a document as Lester sits across from him, smiling. A laugh is given by Brad, who then stops laughing, then he leans back in his chair, studying Lester. Exhilarated, Lester walks down a corridor with his belongings in a box on his shoulder, feeling happier than he's been in years."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Carolyn turns on the light and sinks into a chair, shocked at his awareness of her vulnerability. He enjoys this victory, curling up contentedly under the covers. Close on Lester, smiling. We soar above the neighborhood, watching the Jims jogging. We descend to street level, following them. Lester, in a baggy sweatshirt and sweatpants, runs into view. The Jims slow until he catches up, all jogging together in the morning light. The Colonel scowls as Ricky emerges with a urine sample. He cleans his Ford Explorer when he spots Lester and the Jims jogging. Lester splits from the Jims, approaches the Colonel and Ricky, breathless, and laughs, greeting the Colonel warmly. After an awkward moment, he enters the house with Ricky, waving at the Colonel, who watches with dark eyes. Inside, Ricky gives Lester the urine sample and locks the door. Lester examines a CD case, while Ricky opens a drawer, revealing a stash of marijuana. Lester smiles, impressed. Carolyn, with a basket of roses, stops by the garage window, frowning as she sniffs the air. She sees Lester in gym shorts, using his new weight bench. The garage is becoming his sanctuary. He finishes a rep, putting the weights away as Carolyn, silhouetted against sunlight, raises the garage door. Lester resumes lifting as she leaves. Elsewhere, Brad reads at his desk; Lester sits across, smiling. Brad laughs, then studies Lester, who walks down a corridor, box in hand, happier than ever."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Carolyn switches on the bedside light, sinking into a chair, realizing he knows where she's vulnerable. He feels victorious, curling up contentedly. Lester smiles. Above the neighborhood, we spot the two Jims jogging. At street level, they run as Lester joins in his baggy sweatshirt and faded sweatpants. The Jims slow until he catches up, and they run together. The Colonel scowls as Ricky emerges with a urine sample. Washing his Ford Explorer, he notices Lester and the Jims jogging. Lester approaches Ricky and the Colonel, panting, then laughs and salutes the Colonel. Awkwardly, he heads into the house. Ricky hands the urine sample to Lester, locks the door, and reveals marijuana hidden in a drawer. Lester admires Ricky's coolness. Carolyn, with roses, smells the air, frowning. Through a window, she sees Lester bench pressing in the garage. He finishes, sits up, and sees Carolyn silhouetted, raising the door with a remote. Elsewhere, Brad reads a document as Lester smiles across from him. Brad laughs, studies Lester. Ecstatic, Lester walks down a corridor, belongings in a box, happier than in years."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Carolyn, feeling the weight of her emotions, switches on the soft glow of the bedside light and sinks heavily into the chair, utterly stunned. It is painfully obvious to her now that he possesses an acute awareness of her most vulnerable spots. Observing this realization in her, he feels a sense of gratification and enjoys the moment. It feels exceptionally good for him to experience the rare sensation of victory, so with a contented heart, he curls up cozily under the warm covers. The scene shifts, focusing intently on Lester, who is smiling to himself. \n\nWe are transported to an aerial view, soaring high above the peaceful neighborhood, and below us, we catch sight of the two Jims jogging. Our perspective steadily descends, and we find ourselves at street level, closely following the two athletic figures. As they continue to run, the Jims, as if synchronized, turn their heads back in perfect unison. That's when Lester, appearing unexpectedly, bounds into the frame, clad in a comfortably baggy sweatshirt and an old pair of faded sweatpants. The two Jims gradually reduce their pace, allowing him to catch up, and together, the trio runs harmoniously through the soft, early morning light.\n\nMeanwhile, the Colonel stands nearby, his expression a scowl, as Ricky emerges from the house, holding out the urine sample in front of him with care. The Colonel, engaged in washing his Ford Explorer, is squatting down to scrub the bumper diligently when something captures his attention. He spots Lester and the two Jims as they jog down the street. At this moment, Lester decides to separate from the two Jims, jogging directly toward Ricky and the Colonel, his breathing labored. He pauses to catch his breath, leaning forward, hands on knees, then bursts into a cheerful laugh and extends his hand in a friendly salute to the Colonel, offering a warm, good-natured grin. After a somewhat awkward pause, he turns and makes his way into the house. Lester waves with a friendly gesture at the Colonel before he follows after him. The Colonel's gaze is pensive, watching them disappear, his eyes a shade darker. As Ricky enters the house, with Lester trailing behind, he hands the urine specimen to Lester and proceeds to lock the door securely.\n\nInside, Lester picks up a CD case from a shelf, inspecting it with curiosity, while Ricky crosses over to a bureau. There, he opens a drawer, takes out several pieces of clothing, and begins piling them neatly on his bed. After emptying the drawer, Ricky reveals a false bottom, uncovering tightly packed rows of marijuana in Zip-loc bags, hidden away. Lester observes this display with a smile, thinking to himself that this kid is undeniably cool.\n\nMeanwhile, Carolyn, carrying a basket brimming with fresh cut roses, strolls past the garage window. She pauses to sniff the air, her expression turning to a frown. Peering inside, she spots Lester, dressed in a simple T-shirt and gym shorts, lying on a brand new weight bench, engaged in bench presses with shiny new barbells. The garage is steadily being transformed into Lester's personal sanctuary. Having completed his last challenging repetition, Lester strains, placing the weights back onto their rack and sitting upright. He glances upward, squinting against the light, as the garage door rises, revealing Carolyn silhouetted against the bright sunshine outside. She is pointing a remote at him. Lester reclines back on the bench, gripping the weights once more, and just like that, she’s gone.\n\nElsewhere, Brad is seated behind his desk, engrossed in reading a document, while Lester sits across from him, wearing a smile. Brad lets out a laugh, then abruptly stops, shifting in his chair to study Lester closely. Feeling exhilarated and full of newfound joy, Lester walks down a corridor, a box containing his belongings perched on his shoulder. He feels a happiness that he hasn't experienced in years."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Carolyn, feeling the heavy burden of her swirling emotions, gently switches on the soft, comforting glow of the bedside lamp and sinks deeply into the welcoming embrace of the chair, utterly stunned and overwhelmed by her thoughts. It has become far too painfully clear to her now that he possesses an almost uncanny awareness of the most vulnerable, hidden spots within her heart and mind. Observing this profound realization dawning upon her, he feels a distinct sense of gratification and takes the opportunity to savor the moment. It feels exceptionally satisfying for him to relish in the rare sensation of triumphant victory, so with a contented and happy heart, he curls up cozily under the inviting warmth of the covers. The scene shifts its focus, zeroing in intently on Lester, who is smiling quietly to himself with a sense of self-satisfaction.\n\nWe are then transported to an expansive aerial view, soaring high above the serene and peaceful neighborhood below. From this vantage point, we catch sight of the two Jims as they are steadily jogging along the quiet streets. As our perspective gradually descends, we find ourselves at street level, closely following these two athletic figures as they continue their run. The Jims, as if perfectly synchronized, turn their heads back in flawless unison. It is at this precise moment that Lester, appearing quite unexpectedly, bounds into the frame, dressed in a comfortably baggy sweatshirt and an old, well-worn pair of faded sweatpants. The two Jims gradually reduce their pace, allowing him to catch up, and together, the trio runs with a harmonious rhythm through the soft and gentle light of early morning.\n\nMeanwhile, the Colonel stands nearby, his expression fixed in a stern and contemplative scowl, as Ricky emerges from the house, carefully holding out the urine sample in front of him with a cautious hand. The Colonel, busily engaged in washing his Ford Explorer, is squatting down to diligently scrub the bumper when something catches his attention. He notices Lester and the two Jims as they jog down the street with ease and energy. At this pivotal moment, Lester decides to separate from the two Jims, jogging directly toward Ricky and the Colonel with labored breathing. He takes a brief pause to catch his breath, leaning forward with his hands resting on his knees, then bursts into a cheerful laugh and extends his hand in a friendly salute to the Colonel, offering a warm and good-natured grin. After a moment of somewhat awkward pause, Lester turns and makes his way into the house, waving with a friendly gesture at the Colonel before he follows after him. The Colonel's gaze is reflective and pensive, watching them disappear from view, his eyes a shade darker with thought. As Ricky enters the house, with Lester trailing right behind him, he hands the urine specimen to Lester and proceeds to lock the door securely behind them.\n\nInside, Lester casually picks up a CD case from a nearby shelf, inspecting it with a curious eye, while Ricky crosses over to a bureau. There, Ricky opens a drawer and takes out several pieces of clothing, which he begins to pile neatly on his bed. After emptying the drawer, Ricky reveals a false bottom, uncovering several tightly packed rows of marijuana sealed in Zip-loc bags, cleverly hidden away. Lester observes this surprising display with a smile, thinking to himself that this kid is undeniably cool and resourceful.\n\nMeanwhile, Carolyn, carrying a basket that is brimming with fresh cut roses, strolls gracefully past the garage window. She pauses for a moment to sniff the fragrant air, her expression gradually turning to a frown. Peering inside, she spots Lester, dressed simply in a T-shirt and gym shorts, lying on a brand new weight bench, fully engaged in bench presses with shiny new barbells. The garage is steadily being transformed into Lester's personal sanctuary and workout haven. Having completed his last challenging repetition, Lester strains slightly, placing the weights back onto their rack and sitting upright. He glances upward, squinting against the light, as the garage door rises, revealing Carolyn silhouetted against the bright and dazzling sunshine outside. She is pointing a remote at him with intent. Lester reclines back on the bench, gripping the weights firmly once more, and just like that, she’s gone, disappearing from sight.\n\nElsewhere, in a different part of the narrative, Brad is seated behind his desk, deeply engrossed in reading a document, while Lester sits calmly across from him, wearing a relaxed, pleasant smile. Brad lets out a hearty laugh, then abruptly stops, shifting in his chair to study Lester closely with newfound interest. Feeling a sense of exhilaration and filled with a rush of newfound joy, Lester walks confidently down a corridor, carrying a box containing his personal belongings perched securely on his shoulder. He feels an overwhelming happiness that he hasn't experienced in many years, as if a new chapter in his life is unfolding before him."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Carolyn reaches out to switch on the bedside light, and as the warm glow illuminates the room, she sinks into a chair, overwhelmed and stunned by the realization that he knows exactly where she is most vulnerable. Observing her reaction, he understands the power he holds in this moment, and a sense of satisfaction washes over him. With a newfound contentment, he casually curls up under the covers, feeling triumphant. Close by, Lester wears a smile that speaks volumes about his internal state. We find ourselves soaring high above the neighborhood, where the world below unfolds like a living map. From this aerial perspective, we spot the two Jims jogging, their movements synchronized with precision. As we close in on them from above, the distance between us lessens until we are at street level, seamlessly following their rhythmic strides. Mid-run, the Jims execute a graceful turn, their motion synchronized like clockwork. Suddenly, Lester enters the frame, his casual appearance marked by a baggy sweatshirt and a pair of faded old sweatpants. In response, the Jims reduce their pace, allowing Lester to catch up, and together, the trio continues their run in the crisp, early morning light. Meanwhile, the Colonel stands nearby, his expression a mix of scorn and suspicion, as Ricky emerges from the house, carefully holding a urine sample in front of him. The Colonel, engaged in washing his Ford Explorer, crouches to scrub the bumper with meticulous attention. As he does so, something captures his gaze—Lester and the Jims appear jogging down the street. Lester veers away from the duo, nearing Ricky and the Colonel, his breath labored from exertion. He leans forward, hands clutching his knees, and pants heavily before laughter bubbles up from within him. Extending his hand amicably, he offers the Colonel a lighthearted salute, his grin wide and genuine. An awkward moment hangs in the air, then Lester makes his way into the house, waving at the Colonel before following him. The Colonel watches their retreating figures, his eyes shadowed with unspoken thoughts. Ricky enters the home, with Lester trailing behind. Ricky hands the urine specimen to Lester and subsequently locks the door securely. Lester, with curiosity piqued, picks up a CD case from a shelf and inspects it with interest, while Ricky moves to a bureau, opens a drawer, and systematically removes clothing, piling it neatly onto the bed. With the drawer emptied, Ricky reveals a cunning false bottom, beneath which are rows of marijuana, neatly packed into Zip-loc bags. Lester's smile broadens, impressed by Ricky’s ingenuity, thinking that the kid is undeniably cool. Outside, Carolyn, holding a basket brimming with freshly cut roses, walks past the garage window. Suddenly catching an unusual scent, she pauses, inhales deeply, and frowns, her curiosity piqued. Peering through the window, she observes Lester, dressed in a T-shirt and gym shorts, lying on a brand-new weight bench. He focuses intently on his workout, lifting shiny new barbells with deliberate effort. The garage is visibly transforming into Lester's personal sanctuary. Completing his final bench press rep, Lester strains with exertion, then carefully places the weights back into their rack. He sits up, catching a glimpse of the outside as the door slowly rises to reveal Carolyn, silhouetted against the dazzling sunlight. She stands there, remote in hand, pointing it toward them. Lester reclines back onto the bench, grips the weights anew, and as quickly as she appeared, Carolyn disappears from view. Elsewhere, Brad sits at his desk, immersed in reading a document, while opposite him, Lester relaxes confidently, a smile playing across his lips. Brad chuckles, his laughter echoing briefly, then he stops, leaning back in his chair to study Lester thoughtfully. Exhilarated by the encounter, Lester strides down a corridor, a box of his belongings balanced on his shoulder, feeling lighter and more content than he has in years."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Carolyn switches on the bedside light and sinks into a chair, stunned by his awareness of her vulnerabilities, while he contentedly curls up under the covers, feeling triumphant. As we soar above the neighborhood, we glimpse the two Jims jogging, and then join them at street level. The Jims turn back in unison as Lester, clad in a baggy sweatshirt and faded sweatpants, runs into frame. They slow down until he catches up, and the three run together in the morning light. The Colonel, scowling, washes his Ford Explorer, but his attention shifts as Lester and the Jims jog down the street. Lester detaches from the group and approaches Ricky and the Colonel, breathless but jovial, saluting the Colonel with a laugh before heading inside with Ricky. Lester receives a urine specimen from Ricky, locks the door, and notices rows of marijuana in a false bottom of Ricky's drawer, thinking the kid is cool. Meanwhile, Carolyn, with a basket of fresh-cut roses, peers into the garage to find Lester doing bench presses on a new weight bench, marking his transformation of the space into his sanctuary. Completing his workout, Lester is surprised by Carolyn's silhouette in the sunlight as the garage door opens, but she quickly departs. Elsewhere, Brad and Lester share a moment of laughter in Brad's office, and Lester exits, exhilarated, carrying a box of his belongings down the corridor, feeling happier than he has in years."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Carolyn switches on the bedside light crafted in the vintage Tiffany style and sinks into a plush, overstuffed chair popular in mid-century design, stunned, as it's clear he knows where she's most vulnerable, a trait he learned from years of observing people in his psychological studies. He sees this, and likes it; it feels good to win for a change, so he curls up under the covers contentedly in their luxurious Egyptian cotton sheets. Close on Lester, smiling with a sense of triumph he rarely feels. We are flying high above the suburban neighborhood, designed in the post-war boom of the 1950s, and below we see the two Jims, known locally for their marathon training, jogging. We approach them steadily and are now at street level, following the two Jims, each wearing identical high-performance running shoes. Still running, the Jims turn back in perfect unison as Lester runs into frame, wearing a baggy sweatshirt and a pair of faded old sweatpants reminiscent of 1980s athletic wear. The Jims slow down until he catches up, and the three men run together in the early morning light, which casts long shadows on the quiet street. The Colonel, a retired military officer known for his strict demeanor, stands, scowling, as Ricky comes out of the house, holding the urine sample intended to pass a drug test in front of him. The Colonel is washing his Ford Explorer, an SUV model popular for its rugged design, squatting to scrub the bumper, when something catches his eye: Lester and the Jims jog down the street, their camaraderie evident. Lester breaks off from the two Jims and jogs up to Ricky and the Colonel, out of breath from his recent endeavor to get fit. He grabs hold of his knees and bends over, panting, then laughs and extends his hand to the Colonel, saluting him good-naturedly, grinning with the easy confidence of a man who never takes life too seriously. An awkward beat follows, and then he heads into the house, the door creaking slightly as he enters. Lester waves at the Colonel, a gesture of casual friendliness, then follows him. The Colonel watches them go, his eyes dark with suspicion. Ricky enters, followed by Lester, a hint of conspiracy in their actions. He gives the urine specimen to Lester, then locks the door with a practiced twist. Lester picks up a CD case, one featuring an album from a classic rock band, from a shelf and examines it while Ricky crosses to a bureau, opens a drawer, takes clothing out, and piles it on his bed. Ricky, having emptied the drawer, now removes a false bottom, revealing rows of marijuana tightly packed in Zip-loc bags, a secret stash unknown to most. Lester smiles, thinking this kid's cool, his appreciation for rebellion showing through. Carolyn, carrying a basket of fresh-cut roses from her meticulously tended garden, passes by the garage window and stops to sniff the air, frowning as she detects an unfamiliar scent. She peers through the window and sees Lester, in a T-shirt and gym shorts, lying on a new weight bench, doing bench presses with shiny new barbells he had purchased from a local sporting goods store. The garage is in the process of becoming Lester's sanctuary, a place where he can escape the pressures of daily life. Lester finishes his last rep, straining as he pushes the weights upward, then puts the weights in their rack and sits up, wiping sweat from his forehead. He looks up, squinting, as the door raises to reveal Carolyn, silhouetted against the bright sunlight outside, pointing a remote at us, her figure a stark contrast to the dim interior. Lester leans back on the bench and grabs the weights, feeling his muscles tense, and then she's gone, leaving behind a sense of unresolved tension. Elsewhere, Brad, a high-powered executive known for his no-nonsense approach, is seated behind his mahogany desk, reading a document as Lester sits across from him, smiling with the confidence of someone who's just played a winning hand. Brad laughs, stops laughing abruptly as he realizes the implications, then leans back in his chair, studying Lester with newfound respect. Exhilarated, Lester walks down a corridor lined with motivational posters, his belongings in a box on his shoulder, happier than he's been in years, feeling a newfound sense of freedom and possibility."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Carolyn switches on the bedside light and sinks into a chair stunned as it is clear he knows where she is most vulnerable. He sees this and likes it. it feels good to win for a change so he curls up under the covers contentedly. Close on Lester smiling. We are flying high above the neighborhood and below we see the two Jims jogging. We approach them steadily and are now at street level following the two Jims. Still running the Jims turn back in perfect unison as Lester runs into frame wearing a baggy sweatshirt and a pair of faded old sweatpants. The Jims slow down until he catches up and the three men run together in the early morning light. The Colonel stands scowling as Ricky comes out of the house holding the urine sample in front of him. The Colonel is washing his Ford Explorer squatting to scrub the bumper when something catches his eye. Lester and the Jims jog down the street. Lester breaks off from the two Jims and jogs up to Ricky and the Colonel out of breath. He grabs hold of his knees and bends over panting then laughs and extends his hand to the Colonel saluting him goodnaturedly grinning. An awkward beat follows and then he heads into the house. Lester waves at the Colonel then follows him. The Colonel watches them go his eyes dark. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Ricky enters followed by Lester. He gives the urine specimen to Lester then locks the door. Lester picks up a CD case from a shelf and examines it. while Ricky crosses to a bureau opens a drawer takes clothing out and piles it on his bed. Ricky having emptied the drawer now removes a false bottom revealing rows of marijuana tightly packed in Ziploc bags. Lester smiles thinking this kid's cool. Carolyn carrying a basket of fresh cut roses passes by the garage window and stops to sniff the air frowning. She peers through the window and sees Lester in a Tshirt and gym shorts lying on a new weight bench doing bench presses with shiny new barbells. The garage is in the process of becoming Lester's sanctuary. Lester finishes his last rep straining then puts the weights in their rack and sits up. He looks up squinting as the door raises to reveal Carolyn silhouetted against the bright sunlight outside pointing a remote at us. Lester leans back on the bench and grabs the weights and then she is gone. Elsewhere. Brad is seated behind his desk reading a document as Lester sits across from him smiling. Brad laughs stops laughing then leans back in his chair studying Lester. Exhilarated Lester walks down a corridor his belongings in a box on his shoulder happier than he is been in years."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Carolyn switches on the bedside light and sinks into a chair stunned as it is clear he knows where she is most vulnerable. He sees this and likes it. it feels good to win for a change so he curls up under the covers contentedly. Close on Lester smiling. We are flying high above the neighborhood and below we see the two Jims jogging. We approach them steadily and are now at street level following the two Jims. Still running the Jims turn back in perfect unison as Lester runs into frame wearing a baggy sweatshirt and a pair of faded old sweatpants. The Jims slow down until he catches up and the three men run together in the early morning light. The Colonel stands scowling as Ricky comes out of the house holding the urine sample in front of him. The Colonel is washing his Ford Explorer squatting to scrub the bumper when something catches his eye. Lester and the Jims jog down the street. Lester breaks off from the two Jims and jogs up to Ricky and the Colonel out of breath. He grabs hold of his knees and bends over panting then laughs and extends his hand to the Colonel saluting him goodnaturedly grinning. An awkward beat follows and then he heads into the house. Lester waves at the Colonel then follows him. The Colonel watches them go his eyes dark. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Ricky enters followed by Lester. He gives the urine specimen to Lester then locks the door. Lester picks up a CD case from a shelf and examines it. while Ricky crosses to a bureau opens a drawer takes clothing out and piles it on his bed. Ricky having emptied the drawer now removes a false bottom revealing rows of marijuana tightly packed in Ziploc bags. Lester smiles thinking this kid's cool. Carolyn carrying a basket of fresh cut roses passes by the garage window and stops to sniff the air frowning. She peers through the window and sees Lester in a Tshirt and gym shorts lying on a new weight bench doing bench presses with shiny new barbells. The garage is in the process of becoming Lester's sanctuary. Lester finishes his last rep straining then puts the weights in their rack and sits up. He looks up squinting as the door raises to reveal Carolyn silhouetted against the bright sunlight outside pointing a remote at us. Lester leans back on the bench and grabs the weights and then she is gone. Elsewhere. Brad is seated behind his desk reading a document as Lester sits across from him smiling. Brad laughs stops laughing then leans back in his chair studying Lester. Exhilarated Lester walks down a corridor his belongings in a box on his shoulder happier than he is been in years."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Carolyn switches on the bedside light and sinks into a chair stunned as it is clear he knows where she is most vulnerable. He sees this and likes it. it feels good to win for a change so he curls up under the covers contentedly. Close on Lester smiling. We are flying high above the neighborhood and below we see the two Jims jogging. We approach them steadily and are now at street level following the two Jims. Still running the Jims turn back in perfect unison as Lester runs into frame wearing a baggy sweatshirt and a pair of faded old sweatpants. The Jims slow down until he catches up and the three men run together in the early morning light. The garage is in the process of becoming Lester's sanctuary. Lester finishes his last rep straining then puts the weights in their rack and sits up. He looks up squinting as the door raises to reveal Carolyn silhouetted against the bright sunlight outside pointing a remote at us. Lester leans back on the bench and grabs the weights and then she is gone. Elsewhere. Brad is seated behind his desk reading a document as Lester sits across from him smiling. Brad laughs stops laughing then leans back in his chair studying Lester. Exhilarated Lester walks down a corridor his belongings in a box on his shoulder happier than he is been in years."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Carolyn switches on the bedside light and sinks into a chair stunned as it is clear he knows where she is most vulnerable. He sees this and likes it. it feels good to win for a change so he curls up under the covers contentedly. Close on Lester smiling. Brad is seated behind his desk reading a document as Lester sits across from him smiling. Brad laughs stops laughing then leans back in his chair studying Lester. Exhilarated Lester walks down a corridor his belongings in a box on his shoulder happier than he is been in years."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Theresa ignites the chandelier lamp and perches on a cushion, shocked, as it's apparent the cat knows where she's most invincible. The rabbit perceives this, and enjoys it; it feels amusing to gain for a shift, so the rabbit sprawls out above the quilt blissfully. Close on Dexter, chuckling. We are soaring low above the convention, and beneath we spot the two Alans skipping. We near them gently and are now at park level, joining the two Alans. Still leaping, the Alans twist forward in perfect disorder as Dexter hops into frame, wearing a ragged blazer and a pair of worn-out old jeans. The Alans halt until the rabbit catches up, and the three insects hop together in the late afternoon shadow. The General paces, laughing, as Roger bursts into the hut, hoisting the compass artifact behind him. The General is dusting his Tesla Roadster, standing to polish the windshield, when nothing grabs his toe: Dexter and the Alans skip up the lane. Dexter separates from the two Alans and skips down to Roger and the General, full of energy. The rabbit releases hold of his paws and stretches backward, panting, then cries and shakes his ear to the General, kicking him clumsily, grinning. A graceful moment follows, and then the rabbit hurries into the hut. Dexter dances at the General, then chases him. The General senses them arrive, his smile bright. Roger escapes, with Dexter following. The rabbit gives the compass trinket to Dexter, then unlocks the gate. Dexter lifts a toy box from a crate and inspects it while Roger skips to a cupboard, closes a drawer, puts shoes in, and spills it on his sofa. Roger, having filled the cupboard, now inserts a true lid, hiding columns of feathers loosely placed in fabric pouches. Dexter frowns, guessing this bird's strange. Theresa, dragging a basket of ripe sliced lemons, breezes by the mansion porch and resumes to smell the clouds, smiling. She glances through the porch and observes Dexter, in a sweater and hiking gear, sitting on a vintage rowing machine, doing leg curls with rusty old dumbbells. The porch is in the process of becoming Dexter's haven. Dexter finishes his first rep, relaxing, then drops the dumbbells in their drawer and stands down. The rabbit peers down, glaring, as the window closes to display Theresa, masked against the faint moonlight inside, aiming a projector at us. Dexter folds forward on the machine and catches the dumbbells, and then the cat's gone. Nowhere, Frank is reclining behind his table, tearing a letter as Dexter stands outside him, frowning. Frank cries, starts crying, then curls forward in his couch, ignoring Dexter. Defeated, Dexter crawls up a stairway, his tools in a sack on his hat, calmer than he's been in ages."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Carolyn turns on the light and sits down, shocked, as her vulnerability is exposed. Meanwhile, Lester feels triumphant and relaxed. Outside, the two Jims jog, later joined by Lester, and the trio runs together. The Colonel, washing his car, notices them. Lester breaks from the Jims to greet the Colonel, panting but cheerful, then enters the house with Ricky. Inside, Ricky reveals a stash of marijuana hidden in a drawer. Lester, impressed, observes the scene. Carolyn passes the garage, frowns at the scent, and sees Lester exercising with new equipment, turning the space into his refuge. She disappears as Lester continues. Elsewhere, Lester meets Brad, who reacts with mixed emotions. Lester, feeling free, leaves the building with a newfound happiness."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Exhilarated Lester walks down a corridor his belongings in a box on his shoulder happier than he is been in years Brad laughs stops laughing then leans back in his chair studying Lester Brad is seated behind his desk reading a document as Lester sits across from him smiling Elsewhere Lester leans back on the bench and grabs the weights and then she is gone He looks up squinting as the door raises to reveal Carolyn silhouetted against the bright sunlight outside pointing a remote at us Lester finishes his last rep straining then puts the weights in their rack and sits up The garage is in the process of becoming Lester's sanctuary She peers through the window and sees Lester in a Tshirt and gym shorts lying on a new weight bench doing bench presses with shiny new barbells Carolyn carrying a basket of fresh cut roses passes by the garage window and stops to sniff the air frowning Lester smiles thinking this kid's cool Ricky having emptied the drawer now removes a false bottom revealing rows of marijuana tightly packed in Ziploc bags while Ricky crosses to a bureau opens a drawer takes clothing out and piles it on his bed Lester picks up a CD case from a shelf and examines it He gives the urine specimen to Lester then locks the door Ricky enters followed by Lester The Colonel watches them go his eyes dark Lester waves at the Colonel then follows him An awkward beat follows and then he heads into the house He grabs hold of his knees and bends over panting then laughs and extends his hand to the Colonel saluting him goodnaturedly grinning Lester breaks off from the two Jims and jogs up to Ricky and the Colonel out of breath Lester and the Jims jog down the street The Colonel is washing his Ford Explorer squatting to scrub the bumper when something catches his eye The Colonel stands scowling as Ricky comes out of the house holding the urine sample in front of him The Jims slow down until he catches up and the three men run together in the early morning light Still running the Jims turn back in perfect unison as Lester runs into frame wearing a baggy sweatshirt and a pair of faded old sweatpants We approach them steadily and are now at street level following the two Jims We are flying high above the neighborhood and below we see the two Jims jogging Close on Lester smiling it feels good to win for a change so he curls up under the covers contentedly He sees this and likes it Carolyn switches on the bedside light and sinks into a chair stunned as it is clear he knows where she is most vulnerable"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He sees this and likes it Carolyn switches on the bedside light and sinks into a chair stunned as it is clear he knows where she is most vulnerable Close on Lester smiling it feels good to win for a change so he curls up under the covers contentedly We approach them steadily and are now at street level following the two Jims We are flying high above the neighborhood and below we see the two Jims jogging The Jims slow down until he catches up and the three men run together in the early morning light Still running the Jims turn back in perfect unison as Lester runs into frame wearing a baggy sweatshirt and a pair of faded old sweatpants The Colonel is washing his Ford Explorer squatting to scrub the bumper when something catches his eye The Colonel stands scowling as Ricky comes out of the house holding the urine sample in front of him Lester breaks off from the two Jims and jogs up to Ricky and the Colonel out of breath Lester and the Jims jog down the street An awkward beat follows and then he heads into the house He grabs hold of his knees and bends over panting then laughs and extends his hand to the Colonel saluting him goodnaturedly grinning The Colonel watches them go his eyes dark Lester waves at the Colonel then follows him He gives the urine specimen to Lester then locks the door Ricky enters followed by Lester while Ricky crosses to a bureau opens a drawer takes clothing out and piles it on his bed Lester picks up a CD case from a shelf and examines it Lester smiles thinking this kid's cool Ricky having emptied the drawer now removes a false bottom revealing rows of marijuana tightly packed in Ziploc bags She peers through the window and sees Lester in a Tshirt and gym shorts lying on a new weight bench doing bench presses with shiny new barbells Carolyn carrying a basket of fresh cut roses passes by the garage window and stops to sniff the air frowning Lester finishes his last rep straining then puts the weights in their rack and sits up The garage is in the process of becoming Lester's sanctuary Lester leans back on the bench and grabs the weights and then she is gone He looks up squinting as the door raises to reveal Carolyn silhouetted against the bright sunlight outside pointing a remote at us Brad is seated behind his desk reading a document as Lester sits across from him smiling Elsewhere Exhilarated Lester walks down a corridor his belongings in a box on his shoulder happier than he is been in years Brad laughs stops laughing then leans back in his chair studying Lester"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Ricky enters followed by Lester He gives the urine specimen to Lester then locks the door Lester picks up a CD case from a shelf and examines it while Ricky crosses to a bureau opens a drawer takes clothing out and piles it on his bed Ricky having emptied the drawer now removes a false bottom revealing rows of marijuana tightly packed in Ziploc bags Lester smiles thinking this kid's cool Carolyn carrying a basket of fresh cut roses passes by the garage window and stops to sniff the air frowning She peers through the window and sees Lester in a Tshirt and gym shorts lying on a new weight bench doing bench presses with shiny new barbells The garage is in the process of becoming Lester's sanctuary Lester finishes his last rep straining then puts the weights in their rack and sits up He looks up squinting as the door raises to reveal Carolyn silhouetted against the bright sunlight outside pointing a remote at us Lester leans back on the bench and grabs the weights and then she is gone Elsewhere Brad is seated behind his desk reading a document as Lester sits across from him smiling Brad laughs stops laughing then leans back in his chair studying Lester Exhilarated Lester walks down a corridor his belongings in a box on his shoulder happier than he is been in years Carolyn switches on the bedside light and sinks into a chair stunned as it is clear he knows where she is most vulnerable He sees this and likes it it feels good to win for a change so he curls up under the covers contentedly Close on Lester smiling We are flying high above the neighborhood and below we see the two Jims jogging We approach them steadily and are now at street level following the two Jims Still running the Jims turn back in perfect unison as Lester runs into frame wearing a baggy sweatshirt and a pair of faded old sweatpants The Jims slow down until he catches up and the three men run together in the early morning light The Colonel stands scowling as Ricky comes out of the house holding the urine sample in front of him The Colonel is washing his Ford Explorer squatting to scrub the bumper when something catches his eye Lester and the Jims jog down the street Lester breaks off from the two Jims and jogs up to Ricky and the Colonel out of breath He grabs hold of his knees and bends over panting then laughs and extends his hand to the Colonel saluting him goodnaturedly grinning An awkward beat follows and then he heads into the house Lester waves at the Colonel then follows him The Colonel watches them go his eyes dark"
        }
      ]
    }
  ]
}