{
  "ground_truth": "Nehru crosses and kneels so that he is almost at Gandhi's eyeline, causing Gandhi to take his eyes from his writing and look, almost moved to tears at the sight of Nehru. Gandhi's hand shakes a little as he holds it out to him and turns to pat their joined hands with his other hand with effort, eventually seeing Patel. Patel sits near the head of the cot, placing the three of them on a level. Outside the canopied area, Bourke-White is crouched, with her camera framing the three of them. Gandhi smiles and reaches to touch hands with him, then shakes his head. However, Nehru feels he has an antidote for that despair, which Bourke-White captures, showing the sense of elation on his face. From her discreet distance, she lowers the camera, holding it against her mouth, waiting for Gandhi's response. Gandhi nods to Nehru, accepting the news with sad wistfulness, and glances at Patel, recognizing with him that their belief they could talk Gandhi out of the fast was deeply misplaced. Nehru turns back with no confidence, only concern, while Gandhi smiles, pain etched in his eyes, and touches Nehru's hand. Nehru stares at him, feeling sudden fear that Gandhi means it, and Patel, Mirabehn, Azad, Bourke-White share the same realization. An outside broadcast truck is parked among the usual crowd, which has grown larger, including more women. The crowd spreads from Gandhi along the street, pressing against walls, staring and terrified to move. Among them are the frightened, apprehensive faces of Godse, with Apte and Karkare nearby. Nehru stands, staring at them all, his face seething with anger. On the cover is an image of rioting men fighting diagonally across a cut-out of Gandhi on his cot. Mirabehn rises, leaving the magazine at her feet, and moves to Nehru and Suhrawardy as Azad ushers them into the canopied area, while Abdul Ghaffar Khan sits quietly in the background. Mirabehn speaks softly, and Nehru looks across at Gandhi. The doctor, testing Gandhi's pulse again, glances back at the two—offering no encouragement—and moves away. Nehru moves to the side of the cot, where Gandhi smiles weakly and holds out a hand, but he is in pain. Gandhi looks up at Suhrawardy, who nods, then back at Nehru, smiling whimsically and touching him again, though there is no change in his attitude. Nehru looks at him hopelessly as a huge crowd and some smoke from distant buildings are visible, indicating they are still in Calcutta, and all is not yet at peace.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Nehru traverses and bends so that he is almost at Gandhi's eyeline, causing Gandhi to remove his gaze from his inscription and regard, almost moved to tears at the vision of Nehru. Gandhi's hand trembles a bit as he extends it out to him and rotates to pat their united hands with his opposite hand with endeavor, eventually noticing Patel. Patel perches near the head of the cot, positioning the trio on a tier. Outside the canopied vicinity, Bourke-White is crouched, with her camera framing the trio. Gandhi grins and extends to touch hands with him, then shakes his head. However, Nehru senses he has a remedy for that despair, which Bourke-White captures, displaying the sense of elation on his countenance. From her discreet span, she lowers the camera, holding it against her mouth, waiting for Gandhi's response. Gandhi nods to Nehru, accepting the tidings with sad wistfulness, and glances at Patel, recognizing with him that their belief they could persuade Gandhi out of the fast was deeply misguided. Nehru rotates back with no assurance, only worry, while Gandhi grins, agony engraved in his eyes, and touches Nehru's hand. Nehru stares at him, sensing sudden dread that Gandhi means it, and Patel, Mirabehn, Azad, Bourke-White share the same realization. An exterior broadcast truck is stationed among the usual assembly, which has grown larger, including more women. The crowd disperses from Gandhi along the road, pressing against barriers, staring and terrified to move. Among them are the frightened, apprehensive visages of Godse, with Apte and Karkare nearby. Nehru stands, staring at them all, his face seething with fury. On the cover is an image of rioting men battling diagonally across a cut-out of Gandhi on his cot. Mirabehn rises, leaving the magazine at her feet, and moves to Nehru and Suhrawardy as Azad ushers them into the canopied vicinity, while Abdul Ghaffar Khan sits quietly in the background. Mirabehn speaks softly, and Nehru gazes across at Gandhi. The physician, assessing Gandhi's pulse once more, glances back at the pair—offering no encouragement—and moves away. Nehru traverses to the side of the cot, where Gandhi grins weakly and extends out a hand, but he is in agony. Gandhi glances up at Suhrawardy, who nods, then back at Nehru, grinning whimsically and touching him again, though there is no alteration in his demeanor. Nehru gazes at him hopelessly as a vast throng and some fumes from distant edifices are observable, indicating they are still in Calcutta, and all is not yet at tranquility."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Nehru crosses and kneels so that Gandhi's eyeline is almost met, causing Gandhi to take his eyes from his writing and look, almost moved to tears at Nehru's sight. A little shake is felt by Gandhi's hand as it is held out to Nehru, and their joined hands are patted by Gandhi with effort before Patel is eventually seen. Near the head of the cot sits Patel, placing the three of them on a level. Outside the canopied area, Bourke-White crouches, with her camera framing the three of them. A smile is given by Gandhi, and hands are reached to touch with him, then he shakes his head. However, an antidote for that despair is felt by Nehru, which is captured by Bourke-White, showing the sense of elation on his face. From her discreet distance, the camera is lowered by her, holding it against her mouth, waiting for Gandhi's response. A nod is given by Gandhi to Nehru, accepting the news with sad wistfulness, and a glance is cast at Patel, recognizing with him that their belief they could talk Gandhi out of the fast was deeply misplaced. With no confidence, only concern, Nehru turns back, while a smile is given by Gandhi, pain etched in his eyes, and Nehru's hand is touched. At him, Nehru stares, feeling sudden fear that it is meant by Gandhi, and the same realization is shared by Patel, Mirabehn, Azad, Bourke-White. Among the usual crowd, an outside broadcast truck parks, which has grown larger, including more women. From Gandhi along the street, the spreading crowd presses against walls, staring and terrified to move. Among them are the frightened, apprehensive faces of Godse, with Apte and Karkare nearby. At them all, Nehru stands, staring, his face seething with anger. On the cover is an image of rioting men fighting diagonally across a cut-out of Gandhi on his cot. Rising, leaving the magazine at her feet, Mirabehn moves to Nehru and Suhrawardy as Azad ushers them into the canopied area, while Abdul Ghaffar Khan sits quietly in the background. Softly, Mirabehn speaks, and across to Gandhi, Nehru looks. Testing Gandhi's pulse again, the doctor glances back at the two—offering no encouragement—and moves away. To the side of the cot, Nehru moves, where a weak smile is given by Gandhi, and a hand is held out, but pain is felt by him. Up at Suhrawardy, Gandhi looks, who nods, then back at Nehru, a whimsical smile is given, and touching is repeated again, though no change in his attitude occurs. At him, hopelessly, Nehru looks as a huge crowd and some smoke from distant buildings are visible, indicating they are still in Calcutta, and all is not yet at peace."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Nehru kneels to meet Gandhi's eyeline, causing Gandhi to pause his writing, almost tearful at Nehru's sight. Gandhi's hand trembles as he reaches out, patting their joined hands before seeing Patel. Patel sits near the cot's head, aligning them. Outside, Bourke-White, camera ready, frames them. Gandhi smiles, touches hands with Bourke-White, then shakes his head. Nehru thinks he has an antidote for despair, which Bourke-White captures, showing elation on his face. She lowers the camera, waiting for Gandhi's response. Gandhi nods to Nehru, accepting the news with sad wistfulness, recognizing with Patel their mistaken belief in convincing Gandhi to end the fast. Nehru turns back, concerned, while Gandhi smiles painfully, touching Nehru's hand. Nehru senses Gandhi's resolve, shared by Patel, Mirabehn, Azad, and Bourke-White. Outside, a broadcast truck is among the larger crowd, including more women. The crowd stretches down the street, pressed against walls, afraid to move. Among them are the fearful faces of Godse, Apte, and Karkare. Nehru stands angrily, glaring at them. On a magazine cover, rioting men fight across an image of Gandhi. Mirabehn leaves the magazine, joining Nehru and Suhrawardy as Azad brings them into the canopy, where Abdul Ghaffar Khan sits silently. Mirabehn whispers, and Nehru looks at Gandhi. The doctor checks Gandhi's pulse, offering no hope, and leaves. Nehru approaches the cot; Gandhi smiles weakly, in pain, reaching out. Gandhi looks at Suhrawardy, who nods, then at Nehru, smiling whimsically, yet unchanged. Nehru watches hopelessly as a large crowd and distant smoke indicate they're in Calcutta, where peace hasn't yet prevailed."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Nehru kneels beside Gandhi, prompting him to look away from his writing, almost moved to tears. Gandhi's hand shakes as he extends it to Nehru, patting their joined hands, and sees Patel nearby. Outside, Bourke-White frames them with her camera. Gandhi disheartens Nehru with a headshake, but Bourke-White captures Nehru's hopeful expression. From afar, she notes Gandhi's nod to Nehru, accepting his news with wistful sadness, realizing their belief they could stop Gandhi's fast was wrong. Nehru turns back, worried, as Gandhi smiles painfully, touching Nehru's hand, evoking shared fear in Patel, Mirabehn, Azad, and Bourke-White. A broadcast truck is parked among a growing crowd, including more women and the frightened faces of Godse, Apte, and Karkare. Nehru stands, angrily observing. A magazine cover shows rioting men and Gandhi on his cot. Mirabehn leaves it at her feet, joining Nehru and Suhrawardy as Azad ushers them inside, with Abdul Ghaffar Khan sitting quietly. Mirabehn speaks softly as Nehru gazes at Gandhi. A doctor checks Gandhi's pulse, offering no hope, and departs. Nehru stands by the cot, where Gandhi weakly smiles and extends his hand in pain, looking at Suhrawardy, who nods, then back at Nehru. Nehru looks on hopelessly as smoke from distant buildings signals unrest in Calcutta."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "With deliberate intent, Nehru crosses over and kneels gently so that he is nearly at Gandhi's eyeline, an action that prompts Gandhi to momentarily lift his eyes from the writing before him, appearing almost moved to tears by the poignant sight of Nehru's proximity. As Gandhi extends his hand towards Nehru, it trembles slightly, and with considerable effort, he turns to gently pat their joined hands with his other hand. Eventually, Gandhi's gaze shifts towards Patel, who is seated nearby, close to the head of the cot, creating a sense of equal footing among the three of them. Outside the covered area, Bourke-White is strategically crouched, her camera carefully framing the three of them together. Gandhi's face softens into a smile as he reaches out to touch hands with him, then thoughtfully shakes his head. However, Nehru harbors a conviction that he possesses an antidote to that pervasive despair, a sentiment that Bourke-White captures, her lens capturing the evident sense of elation displayed on Nehru's face. From her unobtrusive vantage point, she lowers the camera to rest against her mouth, poised and waiting for Gandhi's response. Gandhi slightly nods to Nehru, acknowledging the news with a mixture of sad wistfulness, and casts a glance at Patel, recognizing together that their belief in persuading Gandhi to abandon the fast was fundamentally misguided. Nehru turns back with palpable lack of confidence, but his expression is tinged with deep concern, while Gandhi manages a smile, though pain is clearly etched into his eyes, and he reaches out to touch Nehru's hand. Nehru gazes at him intently, feeling a sudden surge of fear that Gandhi truly means it, and Patel, Mirabehn, Azad, Bourke-White share in this unsettling realization. Beyond this intimate scene, an outside broadcast truck sits parked within the usual crowd, which has now swelled significantly, including a noticeably larger presence of women. This growing crowd extends from Gandhi along the street, pressing closely against walls, staring intently, too frightened to move. Among the crowd are the frightened, apprehensive faces of Godse, with Apte and Karkare positioned nearby. Nehru stands, observing them all, his face a picture of seething anger. On the magazine cover lies an image depicting rioting men engaged in combat diagonally across a cut-out image of Gandhi lying on his cot. Mirabehn rises gracefully, leaving the magazine discarded at her feet, and moves purposefully towards Nehru and Suhrawardy as Azad gently ushers them into the canopied area, while Abdul Ghaffar Khan sits quietly, observing from the background. Mirabehn speaks softly, her voice barely a whisper, and Nehru casts a glance across at Gandhi. The doctor, who is testing Gandhi's pulse for the second time, glances back at the two of them—offering no words of encouragement—and eventually moves away. Nehru shifts to the other side of the cot, where Gandhi greets him with a weak smile and extends a hand, though it is clear he is in significant pain. Gandhi then looks up at Suhrawardy, who nods calmly, before turning back to Nehru, smiling whimsically and touching him yet again, even though there is no discernible change in his demeanor. Nehru gazes at him with a sense of hopelessness as a massive crowd and spirals of smoke from distant buildings become visible, indicating they are unmistakably still in Calcutta, and it is evident that peace has not yet been fully restored."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With careful and deliberate intent, Nehru makes his way across the room and gently kneels down until he is almost at eye level with Gandhi. This thoughtful gesture prompts Gandhi to briefly lift his eyes from the writing in front of him, and in doing so, he seems nearly moved to tears by the poignant sight of Nehru's close presence. As Gandhi extends his hand toward Nehru, his hand trembles ever so slightly, and with a considerable amount of effort, he turns and gently pats their joined hands with his other hand. Eventually, Gandhi's gaze shifts away from Nehru toward Patel, who is seated nearby, close to the head of the cot, creating a shared sense of equal standing among the three of them. Just outside the covered area, Bourke-White is strategically crouched down, her camera carefully framing the three of them together in a single shot. Gandhi's face softens into a gentle smile as he extends his hand to touch Nehru's hand and then thoughtfully shakes his head. However, Nehru harbors a firm conviction that he holds an antidote to that pervasive sense of despair, a sentiment that Bourke-White captures through her lens, capturing the evident sense of elation displayed on Nehru's face. From her discreet and unobtrusive vantage point, she lowers the camera to rest against her mouth, waiting patiently and poised for Gandhi's response. Gandhi slightly nods in Nehru's direction, acknowledging the news with a mixture of sad wistfulness, and casts a glance at Patel, recognizing together that their belief in persuading Gandhi to abandon the fast was fundamentally misguided. Nehru turns back with a palpable lack of confidence, but his expression is tinged with deep concern, while Gandhi manages a small smile, though pain is clearly etched into his eyes, and he reaches out to touch Nehru's hand once more. Nehru gazes at him intently, feeling a sudden surge of fear that Gandhi truly means it, and Patel, Mirabehn, Azad, and Bourke-White all share in this unsettling realization. Beyond this intimate scene, outside, an outside broadcast truck sits parked amidst the usual crowd, which has now swelled significantly, and there is a noticeably larger presence of women among them. This growing crowd extends outward from Gandhi along the street, pressing closely against the walls, staring intently, too frightened to move. Among the crowd are the frightened and apprehensive faces of Godse, with Apte and Karkare positioned nearby. Nehru stands there, observing them all, his face a picture of seething anger. On the magazine cover lies an image depicting rioting men engaged in combat diagonally across a cut-out image of Gandhi lying on his cot. Mirabehn rises gracefully, leaving the magazine discarded at her feet, and moves purposefully toward Nehru and Suhrawardy, as Azad gently ushers them into the canopied area, while Abdul Ghaffar Khan sits quietly in the background, observing the scene. Mirabehn speaks softly, her voice barely rising above a whisper, and Nehru casts a glance across at Gandhi. The doctor, who is testing Gandhi's pulse for the second time, glances back at the two of them—offering no words of encouragement—and eventually moves away. Nehru shifts to the other side of the cot, where Gandhi greets him with a weak smile and extends a hand, though it is clear he is in significant pain. Gandhi then looks up at Suhrawardy, who nods calmly, before turning back to Nehru, smiling whimsically and touching him yet again, even though there is no discernible change in his demeanor. Nehru gazes at him with a sense of hopelessness as a massive crowd and spirals of smoke from distant buildings become visible, indicating they are unmistakably still in Calcutta, and it is evident that peace has not yet been fully restored."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Nehru slowly crosses the distance between them, moving with deliberate care before lowering himself into a kneeling position so that his eyes are almost level with Gandhi's. This gentle act prompts Gandhi to pause mid-writing, his attention drawn to Nehru, who looks at him in a way that nearly brings tears to Gandhi's eyes. As they lock eyes, Gandhi extends his hand towards Nehru, his fingers trembling slightly with the emotional weight of the moment. He then uses his other hand, turning it over with visible effort, to pat the top of their joined hands. This gesture is shared before Gandhi's gaze shifts to Patel, who is seated near the head of the cot, completing a triangle of connection among them. Meanwhile, outside the canopied enclosure, Bourke-White crouches low, her camera carefully framing the scene that includes the three pivotal figures. With an expressive smile, Gandhi reaches out to touch hands with Nehru again, only to subtly shake his head. Nehru, sensing a deeper meaning in Gandhi's gesture, feels that he possesses an antidote to Gandhi's despair. Bourke-White captures this moment intricately, her lens capturing the elation that washes over Nehru's face. Holding her camera close to her mouth, she waits for Gandhi's reaction, her anticipation palpable from her discreet vantage point. Gandhi nods in acknowledgment of Nehru's news, his nod carrying a heavy dose of sad wistfulness. He turns his head slightly, exchanging a glance with Patel. Both men recognize a shared understanding: their hope to dissuade Gandhi from his fast was misguided. Nehru, turning back towards Gandhi, carries only concern, his confidence dwindled. Gandhi, in return, offers a smile touched with agony and reaches out to place a comforting hand on Nehru's. As Nehru studies Gandhi's face, a sudden fear grips him—fear that Gandhi is resolute. This realization dawns simultaneously on Patel, Mirabehn, Azad, and Bourke-White, as they too are overtaken by the gravity of the situation. Beyond the intimate circle, an outside broadcast truck is parked amongst a growing throng that includes more women than before. The crowd extends from Gandhi's location, spreading along the street and pressing against the walls, a silent sea of individuals too entranced or terrified to move. Among them are the uneasy faces of Godse, with Apte and Karkare positioned nearby, their presence adding to the tension. Nehru rises, casting a steady gaze over the crowd, his face a mask of seething anger. Surrounded by the chaos, a magazine lies on the ground with its cover showing an image of men rioting, diagonally intersected by a cut-out of Gandhi on his cot—a stark reminder of the turmoil. Mirabehn stands and leaves the magazine where it lies, moving towards Nehru and Suhrawardy as Azad gently directs them into the sheltered area, while Abdul Ghaffar Khan sits quietly in the background, a silent observer. Mirabehn addresses Nehru softly, her words intended to soothe, leading him to glance towards Gandhi for reassurance. At that moment, the doctor, who is monitoring Gandhi's pulse once again, offers no glimmer of hope as he looks back at Nehru and Mirabehn, then steps away. Nehru approaches the side of the cot, where Gandhi greets him with a weak smile and an outstretched hand, revealing his enduring struggle. Gandhi looks past Nehru to Suhrawardy, who gives a supportive nod, then returns his gaze to Nehru, providing a whimsical smile and a gentle touch—a gesture that conveys unchanged resolve. Nehru gazes back, feeling a sense of hopelessness as he becomes acutely aware of the immense crowd and the faint outlines of distant smoke rising from buildings, stark reminders that they remain in Calcutta, where peace has yet to prevail."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Nehru approaches Gandhi, kneeling to meet his gaze, which prompts Gandhi to momentarily put aside his writing. Almost moved to tears, Gandhi extends a shaky hand, patting their joined hands with visible effort before noticing Patel's presence nearby, positioning the three of them at eye level. Outside the canopy, Bourke-White captures the scene with her camera, framing the trio. Gandhi acknowledges Nehru with a touch and a nod, which Bourke-White captures, conveying Nehru's hopeful demeanor. She waits discreetly for Gandhi's response, camera poised. Despite Nehru's belief in hopeful news, Gandhi's nod to him is marked by sad wistfulness as he and Patel reluctantly accept they can't deter Gandhi from his fast. Nehru's concern is evident as Gandhi, in pain, smiles and touches his hand. A shared realization of Gandhi's resolve dawns on Nehru, Patel, Mirabehn, Azad, and Bourke-White. Outside, a growing crowd, including more women and distressed faces like Godse's, presses against walls amid mounting tension. Nehru, filled with anger, observes the crowd. Meanwhile, Mirabehn, leaving a magazine featuring rioting imagery behind, joins Nehru and Suhrawardy as Azad welcomes them into the canopy, while Abdul Ghaffar Khan remains seated quietly. Mirabehn speaks softly to Nehru, who looks over at Gandhi. The doctor checks Gandhi's pulse, offering no encouragement, then retreats. Nehru moves closer to Gandhi, who smiles weakly despite his pain and again reaches out to Nehru. Gandhi exchanges a knowing look with Suhrawardy before returning his whimsical smile to Nehru, unchanged in his resolve. Nehru's gaze reflects hopelessness as he looks out over Calcutta's unrest, visible through the smoke and vast crowd."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Nehru crosses and kneels so that he is almost at Gandhi's eyeline, causing Gandhi, the leader who staunchly advocated for non-violence and played a pivotal role in India’s struggle for independence, to take his eyes from his writing and look, almost moved to tears at the sight of Nehru. Gandhi's hand shakes a little as he holds it out to him and turns to pat their joined hands with his other hand with effort, eventually seeing Patel, a key figure in India's political landscape known for unifying various princely states. Patel sits near the head of the cot, placing the three of them on a level. Outside the canopied area, Bourke-White, a renowned photojournalist famous for her iconic images of historical moments, is crouched, with her camera framing the three of them. Gandhi smiles and reaches to touch hands with him, then shakes his head. However, Nehru feels he has an antidote for that despair, which Bourke-White captures, showing the sense of elation on his face. From her discreet distance, she lowers the camera, holding it against her mouth, waiting for Gandhi's response. Gandhi nods to Nehru, accepting the news with sad wistfulness, and glances at Patel, recognizing with him that their belief they could talk Gandhi out of the fast was deeply misplaced. Nehru turns back with no confidence, only concern, while Gandhi smiles, pain etched in his eyes, and touches Nehru's hand. Nehru stares at him, feeling sudden fear that Gandhi, who had undertaken multiple fasts as a form of protest, means it, and Patel, Mirabehn—a British follower of Gandhi, Azad, Bourke-White share the same realization. An outside broadcast truck, reflective of the growing interest and concern worldwide, is parked among the usual crowd, which has grown larger, including more women, highlighting the inclusive nature of Gandhi's movement. The crowd spreads from Gandhi along the street, pressing against walls, staring and terrified to move. Among them are the frightened, apprehensive faces of Godse, later known as Gandhi's assassin, with Apte and Karkare nearby. Nehru stands, staring at them all, his face seething with anger. On the cover is an image of rioting men fighting diagonally across a cut-out of Gandhi on his cot. Mirabehn rises, leaving the magazine at her feet, and moves to Nehru and Suhrawardy, a prominent politician active during India's partition, as Azad ushers them into the canopied area, while Abdul Ghaffar Khan, known as the Frontier Gandhi for his similar philosophy of non-violence, sits quietly in the background. Mirabehn speaks softly, and Nehru looks across at Gandhi. The doctor, testing Gandhi's pulse again, glances back at the two—offering no encouragement—and moves away. Nehru moves to the side of the cot, where Gandhi smiles weakly and holds out a hand, but he is in pain. Gandhi looks up at Suhrawardy, who nods, then back at Nehru, smiling whimsically and touching him again, though there is no change in his attitude. Nehru looks at him hopelessly as a huge crowd and some smoke from distant buildings are visible, indicating they are still in Calcutta, a city rife with communal tensions following the partition, and all is not yet at peace."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Nehru crosses and kneels so that he is almost at Gandhi's eyeline causing Gandhi to take his eyes from his writing and look almost moved to tears at the sight of Nehru. Gandhi's hand shakes a little as he holds it out to him and turns to pat their joined hands with his other hand with effort eventually seeing Patel. Patel sits near the head of the cot placing the three of them on a level. Outside the canopied area BourkeWhite is crouched with her camera framing the three of them. Gandhi smiles and reaches to touch hands with him then shakes his head. However Nehru feels he has an antidote for that despair which BourkeWhite captures showing the sense of elation on his face. From her discreet distance she lowers the camera holding it against her mouth waiting for Gandhi's response. Gandhi nods to Nehru accepting the news with sad wistfulness and glances at Patel recognizing with him that their belief they could talk Gandhi out of the fast was deeply misplaced. Nehru turns back with no confidence only concern while Gandhi smiles pain etched in his eyes and touches Nehru's hand. Nehru stares at him feeling sudden fear that Gandhi means it and Patel Mirabehn Azad BourkeWhite share the same realization. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. An outside broadcast truck is parked among the usual crowd which has grown larger including more women. The crowd spreads from Gandhi along the street pressing against walls staring and terrified to move. Among them are the frightened apprehensive faces of Godse with Apte and Karkare nearby. Nehru stands staring at them all his face seething with anger. On the cover is an image of rioting men fighting diagonally across a cutout of Gandhi on his cot. Mirabehn rises leaving the magazine at her feet and moves to Nehru and Suhrawardy as Azad ushers them into the canopied area while Abdul Ghaffar Khan sits quietly in the background. Mirabehn speaks softly and Nehru looks across at Gandhi. The doctor testing Gandhi's pulse again glances back at the two—offering no encouragement—and moves away. Nehru moves to the side of the cot where Gandhi smiles weakly and holds out a hand but he is in pain. Gandhi looks up at Suhrawardy who nods then back at Nehru smiling whimsically and touching him again though there is no change in his attitude. Nehru looks at him hopelessly as a huge crowd and some smoke from distant buildings are visible indicating they are still in Calcutta and all is not yet at peace."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Nehru crosses and kneels so that he is almost at Gandhi's eyeline causing Gandhi to take his eyes from his writing and look almost moved to tears at the sight of Nehru. Gandhi's hand shakes a little as he holds it out to him and turns to pat their joined hands with his other hand with effort eventually seeing Patel. Patel sits near the head of the cot placing the three of them on a level. Outside the canopied area BourkeWhite is crouched with her camera framing the three of them. Gandhi smiles and reaches to touch hands with him then shakes his head. However Nehru feels he has an antidote for that despair which BourkeWhite captures showing the sense of elation on his face. From her discreet distance she lowers the camera holding it against her mouth waiting for Gandhi's response. Gandhi nods to Nehru accepting the news with sad wistfulness and glances at Patel recognizing with him that their belief they could talk Gandhi out of the fast was deeply misplaced. Nehru turns back with no confidence only concern while Gandhi smiles pain etched in his eyes and touches Nehru's hand. Nehru stares at him feeling sudden fear that Gandhi means it and Patel Mirabehn Azad BourkeWhite share the same realization. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. An outside broadcast truck is parked among the usual crowd which has grown larger including more women. The crowd spreads from Gandhi along the street pressing against walls staring and terrified to move. Among them are the frightened apprehensive faces of Godse with Apte and Karkare nearby. Nehru stands staring at them all his face seething with anger. On the cover is an image of rioting men fighting diagonally across a cutout of Gandhi on his cot. Mirabehn rises leaving the magazine at her feet and moves to Nehru and Suhrawardy as Azad ushers them into the canopied area while Abdul Ghaffar Khan sits quietly in the background. Mirabehn speaks softly and Nehru looks across at Gandhi. The doctor testing Gandhi's pulse again glances back at the two—offering no encouragement—and moves away. Nehru moves to the side of the cot where Gandhi smiles weakly and holds out a hand but he is in pain. Gandhi looks up at Suhrawardy who nods then back at Nehru smiling whimsically and touching him again though there is no change in his attitude. Nehru looks at him hopelessly as a huge crowd and some smoke from distant buildings are visible indicating they are still in Calcutta and all is not yet at peace."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Nehru crosses and kneels so that he is almost at Gandhi's eyeline causing Gandhi to take his eyes from his writing and look almost moved to tears at the sight of Nehru. Gandhi's hand shakes a little as he holds it out to him and turns to pat their joined hands with his other hand with effort eventually seeing Patel. Patel sits near the head of the cot placing the three of them on a level. Outside the canopied area BourkeWhite is crouched with her camera framing the three of them. Gandhi smiles and reaches to touch hands with him then shakes his head. Mirabehn rises leaving the magazine at her feet and moves to Nehru and Suhrawardy as Azad ushers them into the canopied area while Abdul Ghaffar Khan sits quietly in the background. Mirabehn speaks softly and Nehru looks across at Gandhi. The doctor testing Gandhi's pulse again glances back at the two—offering no encouragement—and moves away. Nehru moves to the side of the cot where Gandhi smiles weakly and holds out a hand but he is in pain. Gandhi looks up at Suhrawardy who nods then back at Nehru smiling whimsically and touching him again though there is no change in his attitude. Nehru looks at him hopelessly as a huge crowd and some smoke from distant buildings are visible indicating they are still in Calcutta and all is not yet at peace."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Nehru crosses and kneels so that he is almost at Gandhi's eyeline causing Gandhi to take his eyes from his writing and look almost moved to tears at the sight of Nehru. Gandhi's hand shakes a little as he holds it out to him and turns to pat their joined hands with his other hand with effort eventually seeing Patel. Nehru moves to the side of the cot where Gandhi smiles weakly and holds out a hand but he is in pain. Gandhi looks up at Suhrawardy who nods then back at Nehru smiling whimsically and touching him again though there is no change in his attitude. Nehru looks at him hopelessly as a huge crowd and some smoke from distant buildings are visible indicating they are still in Calcutta and all is not yet at peace."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Mandela tiptoes and somersaults so that he is almost at Da Vinci's eyeline, causing Da Vinci to drop his paintbrush and glance, almost giggling at the sight of Mandela. Da Vinci's foot taps a little as he extends it out to him and twists to ruffle their intertwined feet with his other foot with effort, eventually spotting Tesla. Tesla lounges near the edge of the hammock, aligning the three of them at a level. Beyond the draped zone, O'Keeffe is crouched, with her easel framing the trio. Da Vinci chuckles and extends to tap toes with her, then shakes his elbow. However, Mandela senses he has a potion for that joy, which O'Keeffe captures, portraying the sparkle on his visage. From her subtle perch, she lowers the easel, pressing it against her ear, awaiting Da Vinci's reaction. Da Vinci bobs to Mandela, absorbing the tidings with cheerful wistfulness, and darts at Tesla, acknowledging with him that their assumption they could persuade Da Vinci out of the painting was utterly mistaken. Mandela spins around with no hope, only worry, while Da Vinci chuckles, mirth embedded in his gaze, and taps Mandela's toe. Mandela gazes at him, feeling abrupt anxiety that Da Vinci means it, and Tesla, Earhart, Hawking, O'Keeffe share the same awareness. A radio dirigible is parked among the typical assembly, which has swelled, including more children. The crowd extends from Da Vinci along the alley, leaning against fences, gawking and scared to shift. Among them are the uneasy, anxious expressions of Tesla, with Curie and Pasteur nearby. Mandela stands, glaring at them all, his expression boiling with fury. On the canvas is an image of dancing women twirling diagonally across a cut-out of Da Vinci on his hammock. Earhart rises, leaving the canvas at her toes, and shuffles to Mandela and Turing as Hawking guides them into the draped area, while Sagan lounges quietly in the shadows. Earhart whispers gently, and Mandela peers across at Da Vinci. The herbalist, checking Da Vinci's aura again, peeks back at the pair—offering no hope—and retreats. Mandela inches to the rim of the hammock, where Da Vinci snickers faintly and extends a foot, but he is in discomfort. Da Vinci peers up at Turing, who nods, then back at Mandela, grinning whimsically and tapping him again, though there is no shift in his stance. Mandela observes him despondently as an enormous congregation and some mist from remote fires are visible, indicating they are still in Paris, and tranquility has not yet prevailed."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Nehru kneels to meet Gandhi's eyes, almost moving Gandhi to tears. Gandhi, with shaking hands, reaches out to Nehru, acknowledging both Nehru and Patel at his side. Outside, Bourke-White captures the moment with her camera, documenting Nehru’s hopeful expression as Gandhi acknowledges the gravity of the situation with a nod, hinting the fast will continue. Nehru, Patel, Mirabehn, Azad, and Bourke-White realize Gandhi's determination. An increased crowd forms around Gandhi's area, including fearful figures like Godse, Apte, and Karkare, while Nehru burns with anger. The scene shifts to a cover showing rioters over an image of Gandhi on his cot. Mirabehn approaches Nehru and Suhrawardy as Azad leads them inside, with Abdul Ghaffar Khan in the background. The doctor checks Gandhi's pulse, offering little hope. Gandhi, in pain, smiles weakly at Nehru and Suhrawardy, who nods, while the distant smoke and crowd suggest unrest in Calcutta."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Nehru looks at him hopelessly as a huge crowd and some smoke from distant buildings are visible indicating they are still in Calcutta and all is not yet at peace Gandhi looks up at Suhrawardy who nods then back at Nehru smiling whimsically and touching him again though there is no change in his attitude Nehru moves to the side of the cot where Gandhi smiles weakly and holds out a hand but he is in pain The doctor testing Gandhi's pulse again glances back at the two—offering no encouragement—and moves away Mirabehn speaks softly and Nehru looks across at Gandhi Mirabehn rises leaving the magazine at her feet and moves to Nehru and Suhrawardy as Azad ushers them into the canopied area while Abdul Ghaffar Khan sits quietly in the background On the cover is an image of rioting men fighting diagonally across a cutout of Gandhi on his cot Nehru stands staring at them all his face seething with anger Among them are the frightened apprehensive faces of Godse with Apte and Karkare nearby The crowd spreads from Gandhi along the street pressing against walls staring and terrified to move An outside broadcast truck is parked among the usual crowd which has grown larger including more women Nehru stares at him feeling sudden fear that Gandhi means it and Patel Mirabehn Azad BourkeWhite share the same realization Nehru turns back with no confidence only concern while Gandhi smiles pain etched in his eyes and touches Nehru's hand Gandhi nods to Nehru accepting the news with sad wistfulness and glances at Patel recognizing with him that their belief they could talk Gandhi out of the fast was deeply misplaced From her discreet distance she lowers the camera holding it against her mouth waiting for Gandhi's response However Nehru feels he has an antidote for that despair which BourkeWhite captures showing the sense of elation on his face Gandhi smiles and reaches to touch hands with him then shakes his head Outside the canopied area BourkeWhite is crouched with her camera framing the three of them Patel sits near the head of the cot placing the three of them on a level Gandhi's hand shakes a little as he holds it out to him and turns to pat their joined hands with his other hand with effort eventually seeing Patel Nehru crosses and kneels so that he is almost at Gandhi's eyeline causing Gandhi to take his eyes from his writing and look almost moved to tears at the sight of Nehru"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Gandhi's hand shakes a little as he holds it out to him and turns to pat their joined hands with his other hand with effort eventually seeing Patel Nehru crosses and kneels so that he is almost at Gandhi's eyeline causing Gandhi to take his eyes from his writing and look almost moved to tears at the sight of Nehru Outside the canopied area BourkeWhite is crouched with her camera framing the three of them Patel sits near the head of the cot placing the three of them on a level However Nehru feels he has an antidote for that despair which BourkeWhite captures showing the sense of elation on his face Gandhi smiles and reaches to touch hands with him then shakes his head Gandhi nods to Nehru accepting the news with sad wistfulness and glances at Patel recognizing with him that their belief they could talk Gandhi out of the fast was deeply misplaced From her discreet distance she lowers the camera holding it against her mouth waiting for Gandhi's response Nehru stares at him feeling sudden fear that Gandhi means it and Patel Mirabehn Azad BourkeWhite share the same realization Nehru turns back with no confidence only concern while Gandhi smiles pain etched in his eyes and touches Nehru's hand The crowd spreads from Gandhi along the street pressing against walls staring and terrified to move An outside broadcast truck is parked among the usual crowd which has grown larger including more women Nehru stands staring at them all his face seething with anger Among them are the frightened apprehensive faces of Godse with Apte and Karkare nearby Mirabehn rises leaving the magazine at her feet and moves to Nehru and Suhrawardy as Azad ushers them into the canopied area while Abdul Ghaffar Khan sits quietly in the background On the cover is an image of rioting men fighting diagonally across a cutout of Gandhi on his cot The doctor testing Gandhi's pulse again glances back at the two—offering no encouragement—and moves away Mirabehn speaks softly and Nehru looks across at Gandhi Gandhi looks up at Suhrawardy who nods then back at Nehru smiling whimsically and touching him again though there is no change in his attitude Nehru moves to the side of the cot where Gandhi smiles weakly and holds out a hand but he is in pain Nehru looks at him hopelessly as a huge crowd and some smoke from distant buildings are visible indicating they are still in Calcutta and all is not yet at peace"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The crowd spreads from Gandhi along the street pressing against walls staring and terrified to move Among them are the frightened apprehensive faces of Godse with Apte and Karkare nearby Nehru stands staring at them all his face seething with anger On the cover is an image of rioting men fighting diagonally across a cutout of Gandhi on his cot Mirabehn rises leaving the magazine at her feet and moves to Nehru and Suhrawardy as Azad ushers them into the canopied area while Abdul Ghaffar Khan sits quietly in the background Mirabehn speaks softly and Nehru looks across at Gandhi The doctor testing Gandhi's pulse again glances back at the two—offering no encouragement—and moves away Nehru moves to the side of the cot where Gandhi smiles weakly and holds out a hand but he is in pain Gandhi looks up at Suhrawardy who nods then back at Nehru smiling whimsically and touching him again though there is no change in his attitude Nehru looks at him hopelessly as a huge crowd and some smoke from distant buildings are visible indicating they are still in Calcutta and all is not yet at peace Nehru crosses and kneels so that he is almost at Gandhi's eyeline causing Gandhi to take his eyes from his writing and look almost moved to tears at the sight of Nehru Gandhi's hand shakes a little as he holds it out to him and turns to pat their joined hands with his other hand with effort eventually seeing Patel Patel sits near the head of the cot placing the three of them on a level Outside the canopied area BourkeWhite is crouched with her camera framing the three of them Gandhi smiles and reaches to touch hands with him then shakes his head However Nehru feels he has an antidote for that despair which BourkeWhite captures showing the sense of elation on his face From her discreet distance she lowers the camera holding it against her mouth waiting for Gandhi's response Gandhi nods to Nehru accepting the news with sad wistfulness and glances at Patel recognizing with him that their belief they could talk Gandhi out of the fast was deeply misplaced Nehru turns back with no confidence only concern while Gandhi smiles pain etched in his eyes and touches Nehru's hand Nehru stares at him feeling sudden fear that Gandhi means it and Patel Mirabehn Azad BourkeWhite share the same realization An outside broadcast truck is parked among the usual crowd which has grown larger including more women"
        }
      ]
    }
  ]
}