{
  "ground_truth": "The camera sweeps over the crowd, past the loudspeakers on their poles. We see surly knots of belligerent rowdies, mostly young, but not all, hanging on the fringes as we move over the heads of the mass of listening people to a platform where Nehru speaks. Azad, Suhrawardy, and others sit on the floor behind him. Featuring the Muslim leader Suhrawardy, leaning against a wall, watching an action out of shot with evident tension. There are five men facing Gandhi. They wear black trousers and black knit vests. There are thongs around their arms that make their bulging muscles seem even more powerful. Their clothes are dirty -- and they are too -- but they are laying knives and guns at Gandhi's feet. Mirabehn, Azad, Pyarelal, the doctor and others on the roof watch fascinated, a little frightened. Gandhi is looking at him, testing, not giving or accepting anything that is mere gesture. The Goondas stand. They glance at Suhrawardy; he smiles tautly and they start to leave, but one (Nahari) lingers. Suddenly he moves violently toward Gandhi, taking a flat piece of Indian bread (chapati) from his trousers and tossing it forcefully on Gandhi. Mirabehn and Azad start to move toward him -- the man looks immensely strong and immensely unstable. But Gandhi holds up a shaking hand, stopping them. Nahari's face is knotted in emotion, half anger, half almost a child's fear -- but there is a wild menace in that instability. Gandhi stares at him, breathless. It is as though the man has told him of some terrible self-inflicted wound. Almost reflexively he holds his hand out to indicate the height of his son. He glares at Suhrawardy and then back at Gandhi. He is sobbing, but in his anger it seems almost as though he means to kill Gandhi in retaliation. A long moment, as Gandhi meets his pain and wrath. Nahari sneers, but there is just a flicker of desperate curiosity. He raises his hand to the height Nahari has indicated as his son's. Nahari has listened. His face almost cracks -- it is a chink of light, but it does not illumine his darkness. And now the light falls on Nahari. His face stiffens, he swallows, fighting any show of emotion; then he turns to go. But he takes only a step and he turns back, going to his knees, the sobs breaking again and again from his heaving body as he holds his head to Gandhi's feet in the traditional greeting of Hindu son to Hindu father. A second, and Gandhi reaches out and touches the top of his head. Trucks with riot squads (shields and truncheons) in place, but they are lounging, waiting.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The camera scans over the gathering, past the loudspeakers on their poles. We observe sullen clusters of aggressive hooligans, mostly young, but not all, lingering on the peripheries as we move over the heads of the crowd of attentive individuals to a stage where Nehru orates. Azad, Suhrawardy, and others sit on the floor behind him. Featuring the Muslim leader Suhrawardy, reclining against a wall, observing an activity out of view with apparent stress. There are five men opposing Gandhi. They wear black pants and black knit vests. There are straps around their arms that make their protruding muscles seem even more formidable. Their garments are filthy -- and they are too -- but they are placing daggers and firearms at Gandhi's feet. Mirabehn, Azad, Pyarelal, the physician and others on the roof observe captivated, a bit scared. Gandhi is regarding him, assessing, not giving or accepting anything that is mere sign. The Goondas stand. They glance at Suhrawardy; he grins tensely and they begin to depart, but one (Nahari) hesitates. Abruptly he moves fiercely toward Gandhi, taking a flat piece of Indian bread (chapati) from his pants and hurling it vigorously on Gandhi. Mirabehn and Azad begin to move toward him -- the man looks immensely strong and immensely unpredictable. But Gandhi raises a trembling hand, stopping them. Nahari's visage is twisted in emotion, half rage, half almost a child's trepidation -- but there is a wild threat in that unpredictability. Gandhi gazes at him, breathless. It is as though the man has told him of some dreadful self-inflicted injury. Almost reflexively he holds his hand out to indicate the stature of his son. He glares at Suhrawardy and then back at Gandhi. He is weeping, but in his fury it seems almost as though he means to slay Gandhi in retaliation. A long moment, as Gandhi meets his agony and fury. Nahari smirks, but there is just a glimmer of desperate inquisitiveness. He lifts his hand to the stature Nahari has indicated as his son's. Nahari has listened. His visage almost cracks -- it is a slit of light, but it does not illuminate his obscurity. And now the light falls on Nahari. His visage hardens, he gulps, resisting any display of emotion; then he turns to depart. But he takes only a step and he turns back, sinking to his knees, the sobs breaking repeatedly from his shuddering body as he holds his head to Gandhi's feet in the conventional greeting of Hindu son to Hindu father. A second, and Gandhi extends out and touches the crown of his head. Trucks with riot contingents (shields and truncheons) in place, but they are lounging, waiting."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The crowd is swept over by the camera, and the loudspeakers on their poles are passed by it. Surly knots of belligerent rowdies, mostly young but not all, are seen by us hanging on the fringes as the heads of the mass of listening people are moved over to a platform where Nehru is speaking. Azad, Suhrawardy, and others are sitting on the floor behind him. The Muslim leader Suhrawardy is featured, leaning against a wall and watching an action out of shot with evident tension. Gandhi is faced by five men. Black trousers and black knit vests are worn by them. Thongs are around their arms, making their bulging muscles seem even more powerful. Their clothes and they are dirty -- but knives and guns are laid at Gandhi's feet by them. Fascinated, a little frightened, Mirabehn, Azad, Pyarelal, the doctor and others watch from the roof. Him, Gandhi is looking at, testing, not giving or accepting anything that is mere gesture. The Goondas stand. Suhrawardy is glanced at by them; a taut smile is given by him and they start to leave, but Nahari, one of them, lingers. Suddenly, Gandhi is moved toward violently by him, as a flat piece of Indian bread (chapati) is taken from his trousers and tossed forcefully on Gandhi. Mirabehn and Azad start moving toward him -- the man seems immensely strong and immensely unstable. But a shaking hand is held up by Gandhi, stopping them. Nahari's face, knotted in emotion, is half anger and half almost a child's fear -- but a wild menace is in that instability. Him, Gandhi stares at, breathless. It is as though some terrible self-inflicted wound has been told to him by the man. Almost reflexively, his hand is held out by him to indicate the height of his son. A glare is directed at Suhrawardy by him and then back at Gandhi. Sobbing, he is, but in his anger, it seems almost as though Gandhi is meant to be killed by him in retaliation. A long moment, Gandhi meets his pain and wrath. Nahari sneers, but just a flicker of desperate curiosity is there. To the height, Nahari has indicated as his son's, his hand is raised by him. Nahari has listened. Almost cracking, his face is -- it is a chink of light, but his darkness is not illuminated by it. And now, Nahari is fallen on by the light. His face stiffens, swallowing, fighting any show of emotion; then he is turned to go. But only a step is taken and he is turned back, going to his knees, the sobs breaking again and again from his heaving body as his head is held to Gandhi's feet in the traditional greeting of a Hindu son to a Hindu father. A second, the top of his head is reached out and touched by Gandhi. Trucks with riot squads (shields and truncheons) are in place, but lounging and waiting are done by them."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The camera sweeps over the crowd, past loudspeakers on poles. Surly, mostly young rowdies hang at the fringes as we pass over the listening masses to a platform where Nehru speaks. Azad, Suhrawardy, and others sit behind him. Suhrawardy, leaning against a wall, watches tensely. Five men face Gandhi, wearing black trousers, black knit vests, and thongs around their arms that highlight bulging muscles. Dirty and grimy, they lay knives and guns at Gandhi’s feet. Mirabehn, Azad, Pyarelal, the doctor, and others watch from the roof, both fascinated and slightly afraid. Gandhi tests the moment, offering no gesture. The Goondas stand, glance at Suhrawardy—he smiles tautly—and begin to leave. One, Nahari, lingers, then suddenly hurls a chapati from his trousers at Gandhi. Mirabehn and Azad move, but Gandhi halts them with a trembling hand. Nahari’s face twists—angry, fearful, unstable. Gandhi stares, sensing a deep, self-inflicted wound. Reflexively, he gestures to indicate a child’s height. Nahari glares at Suhrawardy, then back at Gandhi, sobbing with rage as if blaming Gandhi. A tense moment as Gandhi absorbs the fury. Nahari sneers, but with a flicker of curiosity. Gandhi raises his hand to the height Nahari indicated. Nahari hears it. A crack appears in his face—a faint light that doesn't pierce his darkness. Light falls on him. His face hardens, he swallows emotion, then turns to go. But after a step, he drops to his knees, sobbing, pressing his head to Gandhi’s feet in a Hindu son's gesture to a father. Gandhi touches his head. Riot squads lounge nearby, ready but waiting."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The camera pans over the crowd and loudspeakers. Surly rowdies, mostly young, linger on the edges as Nehru speaks from a platform. Azad, Suhrawardy, and others sit behind him. Muslim leader Suhrawardy watches tensely. Five men face Gandhi, wearing black clothes with dirty thongs accentuating their muscles. They lay weapons at Gandhi's feet. Mirabehn, Azad, and others watch, fascinated and frightened. Gandhi tests, not accepting gestures. The Goondas glance at Suhrawardy, who smiles, and they leave, but Nahari lingers. He violently throws a chapati at Gandhi. Mirabehn and Azad move, but Gandhi stops them. Nahari's face shows anger and fear, with wild menace. Gandhi meets his pain and wrath as Nahari sneers with curiosity. Nahari listens, his face almost cracks, but darkness remains. Light falls on Nahari, he fights emotion, then kneels, sobbing at Gandhi's feet. Gandhi touches his head. Riot squads wait in trucks."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The camera gracefully sweeps over the expansive crowd, moving past the towering loudspeakers perched on their sturdy poles. We observe surly clusters of belligerent rowdies, predominantly young in age, though not exclusively, lingering on the fringes as the camera glides over the heads of the attentive mass of listening people, eventually focusing on a platform where Nehru is delivering a speech. Behind him, seated on the floor, are Azad, Suhrawardy, and several others. The scene prominently features the Muslim leader Suhrawardy, who is leaning against a wall, watching an action that is out of the camera's shot with evident tension and concern. \n\nIn front of Gandhi, there are five men standing. They are dressed in black trousers and black knit vests, with thongs wrapped around their arms, making their bulging muscles appear even more powerful and intimidating. Their clothes are dirty, and they themselves are unkempt, yet they are laying down knives and guns at Gandhi's feet. On the roof, Mirabehn, Azad, Pyarelal, the doctor, and others watch the scene with fascination, mixed with a little fear. Gandhi is observing the men, testing them, neither giving nor accepting anything that is merely a gesture. The Goondas stand there, glancing at Suhrawardy, who smiles tautly, and they begin to leave, but one of them, Nahari, lingers behind. \n\nSuddenly, Nahari moves violently toward Gandhi, taking a flat piece of Indian bread, known as chapati, from his trousers and tossing it forcefully at Gandhi. Mirabehn and Azad start to move toward him, sensing the danger, as the man appears immensely strong and immensely unstable. However, Gandhi raises a shaking hand, stopping them in their tracks. Nahari's face is twisted with emotion, a mix of anger and almost a child's fear, yet there is a wild menace in his instability. Gandhi stares at him, breathless, as if the man has revealed some terrible self-inflicted wound. Almost reflexively, Gandhi holds his hand out to indicate the height of his son. Nahari glares at Suhrawardy and then back at Gandhi, sobbing, but in his anger, it seems almost as though he intends to kill Gandhi in retaliation. \n\nA long moment passes as Gandhi meets Nahari's pain and wrath. Nahari sneers, but there is a flicker of desperate curiosity in his eyes. Gandhi raises his hand to the height Nahari has indicated as his son's. Nahari listens, and his face almost cracks, revealing a chink of light, but it does not fully illuminate his darkness. The light now falls on Nahari. His face stiffens, and he swallows, fighting to suppress any show of emotion; then he turns to leave. But he takes only a step before turning back, going to his knees, the sobs breaking again and again from his heaving body as he bows his head to Gandhi's feet in the traditional greeting of a Hindu son to a Hindu father. After a moment, Gandhi reaches out and gently touches the top of his head. Meanwhile, trucks with riot squads, equipped with shields and truncheons, are in place, but the officers are lounging, waiting for any further developments."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The camera moves gracefully and with a sense of purpose, sweeping over the expansive crowd that fills the area below. It moves deftly past the towering loudspeakers, which are perched securely on their sturdy poles. We observe clusters of surly individuals, predominantly young rowdies, though not exclusively, who appear belligerent as they linger on the fringes of the scene. The camera continues to glide smoothly over the attentive mass of people who are listening intently, eventually focusing its lens on a particular platform. Here, we see Nehru, who is in the midst of delivering an impassioned speech. Behind him, seated on the floor in a position of reverence, are Azad, Suhrawardy, and several other notable figures. Among these, the scene prominently features Suhrawardy, the Muslim leader, who is depicted leaning against a wall. He watches an action that remains out of the camera's shot, his demeanor tense and concerned.\n\nDirectly in front of Gandhi, there stand five men who present a striking image. They are dressed identically in black trousers and matching black knit vests, while thongs are wrapped around their arms. This attire serves to make their already bulging muscles appear even more powerful and intimidating. Although their clothes are dirty and they themselves appear unkempt, the men are in the process of laying down knives and guns at Gandhi's feet. High above on the roof, individuals such as Mirabehn, Azad, Pyarelal, the doctor, and others watch the unfolding scene with an air of fascination, mixed with a tinge of fear. Meanwhile, Gandhi is observing the men with a discerning eye, testing them as if to determine something important, neither offering nor accepting anything that would merely be a gesture. The Goondas stand there, casting glances toward Suhrawardy, who responds with a taut and uneasy smile. As they begin to leave, one among them, named Nahari, lingers behind.\n\nWithout warning, Nahari makes a sudden and violent movement toward Gandhi. He retrieves a flat piece of Indian bread, known as chapati, from his trousers and throws it forcefully at Gandhi. Sensing the potential danger, Mirabehn and Azad begin to move toward him, as Nahari exudes an aura of immense strength coupled with immense instability. Yet Gandhi raises a trembling hand, effectively halting them in their tracks. Nahari's face is contorted with a tumult of emotions, a mix of anger and the fear reminiscent of a child's, yet there is a wild menace within his instability. Gandhi stares at him, seemingly breathless, as though the man has revealed some terrible, self-inflicted wound. Almost reflexively, Gandhi raises his hand to indicate a height akin to that of his son. Nahari shifts his intense glare from Suhrawardy back to Gandhi, and he begins to sob. His anger suggests that he harbors a dangerous intent, even possibly to kill Gandhi in retaliation.\n\nA long, drawn-out moment passes as Gandhi meets Nahari's agonized pain and wrath with a calm gaze. Nahari sneers, but within his eyes, there is a flicker of desperate curiosity. Gandhi again raises his hand to the height Nahari has shown as that of his own son. Nahari listens intently, and his face nearly cracks open, revealing a small chink of light, yet it does not fully dispel the darkness within him. The light now falls on Nahari, illuminating his face as it stiffens. He swallows hard, fighting to suppress any outward show of emotion, before he turns to leave. But he takes only a single step before he turns back, going down to his knees. The sobs wrack his heaving body repeatedly as he bows his head to Gandhi's feet in the traditional greeting, reminiscent of a Hindu son paying respect to a Hindu father. After a moment, Gandhi reaches out with gentle compassion and softly touches the top of Nahari's head. Meanwhile, trucks filled with riot squads, equipped with shields and truncheons, remain in place, yet the officers are lounging idly, waiting for any further developments to occur."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The camera begins its journey by sweeping over the crowd, capturing the scene from above and moving past the loudspeakers perched on their poles. As it glides over the heads of the gathered mass, it reveals surly knots of belligerent rowdies, mostly young but not exclusively, who linger on the fringes of the assembly. The camera continues its path, moving over the attentive crowd to focus on a platform where Nehru is delivering a speech. Behind him, Azad, Suhrawardy, and others are seated on the floor, forming a backdrop to the scene. The camera then highlights the Muslim leader Suhrawardy, who is leaning against a wall, his gaze fixed on an action occurring out of the camera's view, his expression tense and watchful. In another part of the scene, five men stand facing Gandhi. They are dressed in black trousers and black knit vests, with thongs wrapped around their arms, accentuating their bulging muscles. Their clothes, like their bodies, are dirty, yet they proceed to lay down knives and guns at Gandhi's feet. Observing this from the roof are Mirabehn, Azad, Pyarelal, the doctor, and others, who watch with a mix of fascination and fear. Gandhi, meanwhile, is focused intently on the men, his gaze testing and unyielding, refusing to engage in mere gestures. The Goondas, as they are called, stand and exchange glances with Suhrawardy, who responds with a taut smile, prompting them to begin their departure. However, one of them, Nahari, hesitates and suddenly moves with violent intent toward Gandhi, extracting a flat piece of Indian bread, a chapati, from his trousers and hurling it forcefully at Gandhi. Mirabehn and Azad instinctively start to move toward Nahari, sensing his immense strength and instability, but Gandhi raises a trembling hand to halt them. Nahari's face is contorted with emotion, a mix of anger and a child's fear, yet there is a wild menace in his instability. Gandhi meets his gaze, breathless, as if Nahari has revealed a deep, self-inflicted wound. Almost reflexively, Gandhi raises his hand to indicate the height of Nahari's son, a gesture that Nahari acknowledges with a glare at Suhrawardy before returning his gaze to Gandhi. Nahari is sobbing, his anger so intense it seems he might retaliate against Gandhi. A long moment passes as Gandhi confronts Nahari's pain and wrath. Nahari sneers, but a flicker of desperate curiosity crosses his face. Gandhi raises his hand again to the height Nahari indicated for his son, and Nahari listens, his face nearly breaking with emotion—a small chink of light in his darkness. As the light falls on Nahari, his face stiffens, and he swallows, struggling to suppress his emotions. He turns to leave but takes only a step before turning back, dropping to his knees, and succumbing to sobs that wrack his body as he bows his head to Gandhi's feet in the traditional greeting of a Hindu son to a Hindu father. In that moment, Gandhi reaches out and gently touches the top of Nahari's head. Meanwhile, trucks with riot squads, equipped with shields and truncheons, are stationed nearby, their occupants lounging and waiting, ready to respond if needed."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The camera sweeps over the crowd, past the loudspeakers, capturing surly knots of belligerent rowdies on the fringes as it moves over the heads of the listening masses to a platform where Nehru speaks, with Azad, Suhrawardy, and others seated behind him. Suhrawardy, the Muslim leader, leans against a wall, watching an off-screen action with evident tension. Five men, wearing black trousers and knit vests with thongs accentuating their muscles, stand before Gandhi, laying knives and guns at his feet. Despite their dirty appearance, they are watched with fascination and a hint of fear by Mirabehn, Azad, Pyarelal, the doctor, and others on the roof. Gandhi, testing the situation, neither gives nor accepts mere gestures. The Goondas stand, glance at Suhrawardy, who smiles tautly, and begin to leave, but one, Nahari, lingers. He suddenly moves toward Gandhi, tossing a chapati from his trousers at him. As Mirabehn and Azad start to intervene, Gandhi raises a shaking hand to stop them. Nahari, his face knotted with emotion, half anger, half childlike fear, exudes a wild menace. Gandhi meets his pain and wrath, as Nahari, sobbing, seems almost ready to retaliate against Gandhi. In a moment of desperate curiosity, Gandhi raises his hand to indicate the height of Nahari's son, which Nahari acknowledges. His face almost cracks, revealing a chink of light in his darkness. As the light falls on Nahari, he stiffens, swallows, and fights to hide his emotions, then turns to leave. However, he quickly returns, going to his knees, sobbing as he places his head at Gandhi's feet in a traditional gesture of respect. Gandhi reaches out and touches the top of his head. Meanwhile, trucks with riot squads, equipped with shields and truncheons, lounge nearby, waiting."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The camera sweeps over the crowd, past the loudspeakers on their poles, which are commonly used in large gatherings in India to ensure everyone hears the speakers. We see surly knots of belligerent rowdies, mostly young but not all, hanging on the fringes as we move over the heads of the mass of listening people to a platform where Nehru, the first Prime Minister of India and a key figure in the independence movement, speaks. Azad, a freedom fighter and close confidant of Gandhi, Suhrawardy, a prominent Muslim leader and former Prime Minister of Bengal, and others sit on the floor behind him. Featuring the Muslim leader Suhrawardy, leaning against a wall, watching an action out of shot with evident tension. There are five men facing Gandhi, the leader of the Indian independence movement known for his philosophy of nonviolence. They wear black trousers and black knit vests, attire that suggests both readiness for conflict and alignment with political extremism. There are thongs around their arms that make their bulging muscles seem even more powerful. Their clothes are dirty -- and they are too -- but they are laying knives and guns at Gandhi's feet, an act symbolizing a renunciation of violence in his presence. Mirabehn, a British woman who became one of Gandhi's closest disciples, Azad, Pyarelal, an aide to Gandhi, the doctor, and others on the roof watch fascinated, a little frightened. Gandhi is looking at him, testing, not giving or accepting anything that is mere gesture, embodying his deep commitment to truth and sincerity. The Goondas, colloquially known as troublemakers or thugs in India, stand. They glance at Suhrawardy; he smiles tautly and they start to leave, but one (Nahari) lingers. Suddenly he moves violently toward Gandhi, taking a flat piece of Indian bread, known as a chapati, from his trousers and tossing it forcefully on Gandhi. Mirabehn and Azad start to move toward him -- the man looks immensely strong and immensely unstable. But Gandhi holds up a shaking hand, stopping them, his gesture a testament to his belief in the power of nonviolent resistance. Nahari's face is knotted in emotion, half anger, half almost a child's fear -- but there is a wild menace in that instability. Gandhi stares at him, breathless. It is as though the man has told him of some terrible self-inflicted wound, an allegory for the internal struggles faced during the tumultuous period of partition. Almost reflexively he holds his hand out to indicate the height of his son. He glares at Suhrawardy and then back at Gandhi. He is sobbing, but in his anger it seems almost as though he means to kill Gandhi in retaliation. A long moment, as Gandhi meets his pain and wrath, representing his steadfastness in challenging moments. Nahari sneers, but there is just a flicker of desperate curiosity. He raises his hand to the height Nahari has indicated as his son's, showing an understanding of Nahari's profound loss. Nahari has listened. His face almost cracks -- it is a chink of light, but it does not illumine his darkness. And now the light falls on Nahari. His face stiffens, he swallows, fighting any show of emotion; then he turns to go. But he takes only a step and he turns back, going to his knees, the sobs breaking again and again from his heaving body as he holds his head to Gandhi's feet in the traditional greeting of Hindu son to Hindu father, signifying respect and seeking forgiveness. A second, and Gandhi reaches out and touches the top of his head, an act of acceptance and blessing. Trucks with riot squads equipped with shields and truncheons are in place, but they are lounging, waiting, a reminder of the constant threat of violence in this era of social unrest."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The camera sweeps over the crowd past the loudspeakers on their poles. We see surly knots of belligerent rowdies mostly young but not all hanging on the fringes as we move over the heads of the mass of listening people to a platform where Nehru speaks. Azad. Suhrawardy and others sit on the floor behind him. Featuring the Muslim leader. Suhrawardy leaning against a wall watching an action out of shot with evident tension. There are five men facing Gandhi. They wear black trousers and black knit vests. There are thongs around their arms that make their bulging muscles seem even more powerful. Their clothes are dirty  and they are too  but they are laying knives and guns at Gandhi's feet. Mirabehn Azad Pyarelal the doctor and others on the roof watch fascinated a little frightened. Gandhi is looking at him testing not giving or accepting anything that is mere gesture. The Goondas stand. They glance at Suhrawardy. he smiles tautly and they start to leave but one Nahari lingers. Suddenly he moves violently toward Gandhi taking a flat piece of Indian bread chapati from his trousers and tossing it forcefully on Gandhi. Mirabehn and Azad start to move toward him. the man looks immensely strong and immensely unstable. But Gandhi holds up a shaking hand stopping them. Nahari's face is knotted in emotion half anger half almost a child's fear. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. but there is a wild menace in that instability. Gandhi stares at him breathless. It is as though the man has told him of some terrible selfinflicted wound. Almost reflexively he holds his hand out to indicate the height of his son. He glares at Suhrawardy and then back at Gandhi. He is sobbing but in his anger it seems almost as though he means to kill Gandhi in retaliation. A long moment as Gandhi meets his pain and wrath. Nahari sneers but there is just a flicker of desperate curiosity. He raises his hand to the height Nahari has indicated as his son's. Nahari has listened. His face almost cracks. it is a chink of light but it does not illumine his darkness. And now the light falls on Nahari. His face stiffens. he swallows fighting any show of emotion. then he turns to go. But he takes only a step and he turns back going to his knees. the sobs breaking again and again from his heaving body as he holds his head to Gandhi's feet in the traditional greeting of Hindu son to Hindu father. A second and Gandhi reaches out and touches the top of his head. Trucks with riot squads shields and truncheons in place but they are lounging waiting."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The camera sweeps over the crowd past the loudspeakers on their poles. We see surly knots of belligerent rowdies mostly young but not all hanging on the fringes as we move over the heads of the mass of listening people to a platform where Nehru speaks. Azad. Suhrawardy and others sit on the floor behind him. Featuring the Muslim leader. Suhrawardy leaning against a wall watching an action out of shot with evident tension. There are five men facing Gandhi. They wear black trousers and black knit vests. There are thongs around their arms that make their bulging muscles seem even more powerful. Their clothes are dirty  and they are too  but they are laying knives and guns at Gandhi's feet. Mirabehn Azad Pyarelal the doctor and others on the roof watch fascinated a little frightened. Gandhi is looking at him testing not giving or accepting anything that is mere gesture. The Goondas stand. They glance at Suhrawardy. he smiles tautly and they start to leave but one Nahari lingers. Suddenly he moves violently toward Gandhi taking a flat piece of Indian bread chapati from his trousers and tossing it forcefully on Gandhi. Mirabehn and Azad start to move toward him. the man looks immensely strong and immensely unstable. But Gandhi holds up a shaking hand stopping them. Nahari's face is knotted in emotion half anger half almost a child's fear. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. but there is a wild menace in that instability. Gandhi stares at him breathless. It is as though the man has told him of some terrible selfinflicted wound. Almost reflexively he holds his hand out to indicate the height of his son. He glares at Suhrawardy and then back at Gandhi. He is sobbing but in his anger it seems almost as though he means to kill Gandhi in retaliation. A long moment as Gandhi meets his pain and wrath. Nahari sneers but there is just a flicker of desperate curiosity. He raises his hand to the height Nahari has indicated as his son's. Nahari has listened. His face almost cracks. it is a chink of light but it does not illumine his darkness. And now the light falls on Nahari. His face stiffens. he swallows fighting any show of emotion. then he turns to go. But he takes only a step and he turns back going to his knees. the sobs breaking again and again from his heaving body as he holds his head to Gandhi's feet in the traditional greeting of Hindu son to Hindu father. A second and Gandhi reaches out and touches the top of his head. Trucks with riot squads shields and truncheons in place but they are lounging waiting."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The camera sweeps over the crowd past the loudspeakers on their poles. We see surly knots of belligerent rowdies mostly young but not all hanging on the fringes as we move over the heads of the mass of listening people to a platform where Nehru speaks. Azad. Suhrawardy and others sit on the floor behind him. Featuring the Muslim leader. Suhrawardy leaning against a wall watching an action out of shot with evident tension. There are five men facing Gandhi. They wear black trousers and black knit vests. There are thongs around their arms that make their bulging muscles seem even more powerful. Their clothes are dirty  and they are too  but they are laying knives and guns at Gandhi's feet. His face almost cracks. it is a chink of light but it does not illumine his darkness. And now the light falls on Nahari. His face stiffens. he swallows fighting any show of emotion. then he turns to go. But he takes only a step and he turns back going to his knees. the sobs breaking again and again from his heaving body as he holds his head to Gandhi's feet in the traditional greeting of Hindu son to Hindu father. A second and Gandhi reaches out and touches the top of his head. Trucks with riot squads shields and truncheons in place but they are lounging waiting."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The camera sweeps over the crowd past the loudspeakers on their poles. We see surly knots of belligerent rowdies mostly young but not all hanging on the fringes as we move over the heads of the mass of listening people to a platform where Nehru speaks. Azad. Suhrawardy and others sit on the floor behind him. But he takes only a step and he turns back going to his knees. the sobs breaking again and again from his heaving body as he holds his head to Gandhi's feet in the traditional greeting of Hindu son to Hindu father. A second and Gandhi reaches out and touches the top of his head. Trucks with riot squads shields and truncheons in place but they are lounging waiting."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The parrot glides above the village, over the lanterns on their posts. We spot grumpy clusters of defiant sailors, mostly elderly, but some are young, loitering on the outskirts as we drift over the roofs of the gathering of dancing animals to a podium where a jester sings. A clown, a mime, and others recline on the steps beside him. Showcasing the artist mime, leaning against a tree, observing a spectacle offstage with obvious relief. There are two cats confronting a scarecrow. They sport red jackets and red woolen scarves. There are garlands around their necks that make their flimsy bodies appear even more robust. Their attire is pristine -- and they are groomed -- but they are setting apples and oranges at the scarecrow's base. An acrobat, a clown, a farmer, the nurse and others on the hill gaze entranced, slightly confused. The scarecrow is staring at him, pondering, neither refusing nor offering anything that is mere charade. The jesters rise. They peer at the mime; he grins broadly and they begin to depart, but one (Bobo) tarries. Instantly he leaps joyfully toward the scarecrow, pulling a crispy leaf from his pocket and pitching it gracefully at the scarecrow. The acrobat and the clown begin to approach him -- the creature looks tremendously agile and tremendously unpredictable. But the scarecrow lifts a trembling branch, halting them. Bobo's expression is twisted with feeling, half laughter, half nearly a puppy's delight -- but there is a fiery excitement in that unpredictability. The scarecrow gazes at him, breathless. It is as though the creature has revealed some dreadful secret. Almost instinctively he lifts his branch to indicate the height of his friend. He scowls at the mime and then back at the scarecrow. He is giggling, yet in his laughter it seems almost as though he intends to hug the scarecrow in celebration. A prolonged silence, as the scarecrow confronts his joy and excitement. Bobo smirks, but there is just a glimmer of hesitant wonder. He lifts his limb to the height Bobo has suggested as his friend's. Bobo has observed. His expression nearly breaks -- it is a beam of hope, but it does not brighten his gloom. And now the glow shines on Bobo. His visage hardens, he gulps, restraining any display of delight; then he pivots to depart. But he makes merely a movement and he pivots back, going to his paws, the giggles bursting repeatedly from his quivering form as he places his snout to the scarecrow's toes in the customary salutation of feline friend to feline companion. A moment later, and the scarecrow extends a branch and caresses the top of his snout. Caravans with parade bands (torches and drums) in position, but they are reclining, observing."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The camera pans over a crowd to a platform where Nehru speaks, with Azad, Suhrawardy, and others seated behind him. Five men, appearing rugged and powerful, lay down weapons before Gandhi. Among them, Nahari, showing conflicted emotions, suddenly hurls a chapati at Gandhi. Mirabehn and Azad are ready to intervene, but Gandhi gestures them to stop. Nahari, filled with anger and fear, seems on the verge of violence, but Gandhi's composed demeanor connects with him. Nahari, overwhelmed, indicates his son's height and eventually kneels before Gandhi, showing respect. Gandhi gently touches Nahari's head, signifying reconciliation amidst the tension. Nearby, trucks with riot squads are on standby, but remain inactive."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Trucks with riot squads shields and truncheons in place but they are lounging waiting A second and Gandhi reaches out and touches the top of his head  the sobs breaking again and again from his heaving body as he holds his head to Gandhi's feet in the traditional greeting of Hindu son to Hindu father  But he takes only a step and he turns back going to his knees  then he turns to go  he swallows fighting any show of emotion  His face stiffens  And now the light falls on Nahari  it is a chink of light but it does not illumine his darkness  His face almost cracks   Nahari has listened  He raises his hand to the height Nahari has indicated as his son's  Nahari sneers but there is just a flicker of desperate curiosity  A long moment as Gandhi meets his pain and wrath  He is sobbing but in his anger it seems almost as though he means to kill Gandhi in retaliation  He glares at Suhrawardy and then back at Gandhi  Almost reflexively he holds his hand out to indicate the height of his son  It is as though the man has told him of some terrible selfinflicted wound  Gandhi stares at him breathless  but there is a wild menace in that instability  Nahari's face is knotted in emotion half anger half almost a child's fear   But Gandhi holds up a shaking hand stopping them  the man looks immensely strong and immensely unstable  Mirabehn and Azad start to move toward him   Suddenly he moves violently toward Gandhi taking a flat piece of Indian bread chapati from his trousers and tossing it forcefully on Gandhi  he smiles tautly and they start to leave but one Nahari lingers  They glance at Suhrawardy  The Goondas stand  Gandhi is looking at him testing not giving or accepting anything that is mere gesture  Mirabehn Azad Pyarelal the doctor and others on the roof watch fascinated a little frightened  Their clothes are dirty  and they are too  but they are laying knives and guns at Gandhi's feet  There are thongs around their arms that make their bulging muscles seem even more powerful  They wear black trousers and black knit vests  There are five men facing Gandhi  Suhrawardy leaning against a wall watching an action out of shot with evident tension  Featuring the Muslim leader  Suhrawardy and others sit on the floor behind him  Azad  We see surly knots of belligerent rowdies mostly young but not all hanging on the fringes as we move over the heads of the mass of listening people to a platform where Nehru speaks  The camera sweeps over the crowd past the loudspeakers on their poles "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "We see surly knots of belligerent rowdies mostly young but not all hanging on the fringes as we move over the heads of the mass of listening people to a platform where Nehru speaks The camera sweeps over the crowd past the loudspeakers on their poles Suhrawardy and others sit on the floor behind him Azad Suhrawardy leaning against a wall watching an action out of shot with evident tension Featuring the Muslim leader They wear black trousers and black knit vests There are five men facing Gandhi Their clothes are dirty  and they are too  but they are laying knives and guns at Gandhi's feet There are thongs around their arms that make their bulging muscles seem even more powerful Gandhi is looking at him testing not giving or accepting anything that is mere gesture Mirabehn Azad Pyarelal the doctor and others on the roof watch fascinated a little frightened They glance at Suhrawardy The Goondas stand Suddenly he moves violently toward Gandhi taking a flat piece of Indian bread chapati from his trousers and tossing it forcefully on Gandhi he smiles tautly and they start to leave but one Nahari lingers the man looks immensely strong and immensely unstable Mirabehn and Azad start to move toward him Nahari's face is knotted in emotion half anger half almost a child's fear But Gandhi holds up a shaking hand stopping them Gandhi stares at him breathless but there is a wild menace in that instability Almost reflexively he holds his hand out to indicate the height of his son It is as though the man has told him of some terrible selfinflicted wound He is sobbing but in his anger it seems almost as though he means to kill Gandhi in retaliation He glares at Suhrawardy and then back at Gandhi Nahari sneers but there is just a flicker of desperate curiosity A long moment as Gandhi meets his pain and wrath Nahari has listened He raises his hand to the height Nahari has indicated as his son's it is a chink of light but it does not illumine his darkness His face almost cracks His face stiffens And now the light falls on Nahari then he turns to go he swallows fighting any show of emotion the sobs breaking again and again from his heaving body as he holds his head to Gandhi's feet in the traditional greeting of Hindu son to Hindu father But he takes only a step and he turns back going to his knees Trucks with riot squads shields and truncheons in place but they are lounging waiting A second and Gandhi reaches out and touches the top of his head"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "but there is a wild menace in that instability  Gandhi stares at him breathless  It is as though the man has told him of some terrible selfinflicted wound  Almost reflexively he holds his hand out to indicate the height of his son  He glares at Suhrawardy and then back at Gandhi  He is sobbing but in his anger it seems almost as though he means to kill Gandhi in retaliation  A long moment as Gandhi meets his pain and wrath  Nahari sneers but there is just a flicker of desperate curiosity  He raises his hand to the height Nahari has indicated as his son's  Nahari has listened  His face almost cracks   it is a chink of light but it does not illumine his darkness  And now the light falls on Nahari  His face stiffens  he swallows fighting any show of emotion  then he turns to go  But he takes only a step and he turns back going to his knees  the sobs breaking again and again from his heaving body as he holds his head to Gandhi's feet in the traditional greeting of Hindu son to Hindu father  A second and Gandhi reaches out and touches the top of his head  Trucks with riot squads shields and truncheons in place but they are lounging waiting The camera sweeps over the crowd past the loudspeakers on their poles  We see surly knots of belligerent rowdies mostly young but not all hanging on the fringes as we move over the heads of the mass of listening people to a platform where Nehru speaks  Azad  Suhrawardy and others sit on the floor behind him  Featuring the Muslim leader  Suhrawardy leaning against a wall watching an action out of shot with evident tension  There are five men facing Gandhi  They wear black trousers and black knit vests  There are thongs around their arms that make their bulging muscles seem even more powerful  Their clothes are dirty  and they are too  but they are laying knives and guns at Gandhi's feet  Mirabehn Azad Pyarelal the doctor and others on the roof watch fascinated a little frightened  Gandhi is looking at him testing not giving or accepting anything that is mere gesture  The Goondas stand  They glance at Suhrawardy  he smiles tautly and they start to leave but one Nahari lingers  Suddenly he moves violently toward Gandhi taking a flat piece of Indian bread chapati from his trousers and tossing it forcefully on Gandhi  Mirabehn and Azad start to move toward him   the man looks immensely strong and immensely unstable  But Gandhi holds up a shaking hand stopping them  Nahari's face is knotted in emotion half anger half almost a child's fear  "
        }
      ]
    }
  ]
}