{
  "ground_truth": "He holds up his hand for attention and forces a smile, then starts reading. It is flat and dull, like someone reading a speech to themselves, and those in the crowd who had hesitated before wandering off shrug and continue on their way. Gandhi is unnerved by it a little but he struggles on -- louder, but just as colorlessly. This last has come more firmly, and he lifts his head to the crowd, as though expecting a reaction. Three or four committed supporters applaud as on cue, but his technique is so inexpert that it draws nothing but blank faces from the bulk of them. He glances nervously at Ba, who is embarrassed for them both now. He holds it up. A constable glances at the police sergeant. And he turns and drops his pass in the wire basket over the fire. The flames engulf it. The police sergeant's eyes go wide with disbelief. The crowd murmurs in shock. At last Gandhi has got a reaction, but the dropping of the card has been as matter-of-fact as his speaking, with none of the drama one might expect from so startling a gesture. He takes Gandhi's notes from him, and faces the crowd. It is the end of the speech. He looks at the crowd. Gandhi harrumphs -- gesturing to a shallow box Singh holds. Kahn turns back, extemporizing rather lamely. He is facing the crowd. Behind him, Khan holds himself erect and slowly takes his own card from his pocket. He holds it aloft and then lowers it resolutely into the wire basket. The crowd reacts and the sergeant turns just in time to see it dropped in the flame. He gestures to a constable, who turns from the crowd and marches to Khan, seizing him by the arm and marching him to the paddy wagon. As he passes the sergeant, the sergeant takes his billy club, and faces the crowd, rapping the club menacingly against his hand. Behind him, Gandhi wavers indecisively a moment, then takes the box from Singh and moves to the fire. Gandhi is at the fire. For a second, his eyes lock with the sergeant's -- and then nervously, he takes a card and drops it in the wire basket, and another. Again, a murmur from the crowd turns him. Gandhi, on his hands and knees, blood trickling from his abraded cheek, has picked up a card from the ground and he leans forward apprehensively, his eyes fearfully on the sergeant, but he drops it defiantly in the basket. The sergeant's fury bursts -- and he slams the billy club down on Gandhi's head. Gandhi sags to the ground. Ba screams. She starts to run to him, but the other women seize her.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He raises up his hand for notice and compels a grin, then begins reading. It is flat and boring, like someone reading a monologue to themselves, and those in the crowd who had paused before straying off shrug and proceed on their way. Gandhi is unsettled by it a little but he perseveres on -- louder, but just as drably. This last has come more securely, and he raises his head to the crowd, as though anticipating a reaction. Three or four dedicated supporters clap as on cue, but his technique is so unskilled that it draws nothing but blank visages from the bulk of them. He peeks nervously at Ba, who is ashamed for them both now. He holds it up. A constable peeks at the police sergeant. And he turns and drops his pass in the wire container over the blaze. The flames consume it. The police sergeant's eyes go wide with incredulity. The crowd mutters in shock. At last Gandhi has obtained a reaction, but the dropping of the card has been as matter-of-fact as his speaking, with none of the drama one might anticipate from so startling a gesture. He takes Gandhi's notes from him, and confronts the crowd. It is the end of the monologue. He looks at the crowd. Gandhi clears throat -- gesturing to a shallow box Singh holds. Kahn turns back, improvising rather weakly. He is confronting the crowd. Behind him, Khan holds himself upright and slowly takes his own card from his pocket. He holds it aloft and then lowers it determinedly into the wire container. The crowd reacts and the sergeant turns just in time to see it dropped in the blaze. He gestures to a constable, who turns from the crowd and marches to Khan, grabbing him by the arm and marching him to the paddy wagon. As he passes the sergeant, the sergeant takes his billy club, and confronts the crowd, tapping the club menacingly against his hand. Behind him, Gandhi falters indecisively a moment, then takes the box from Singh and moves to the blaze. Gandhi is at the blaze. For a second, his eyes lock with the sergeant's -- and then anxiously, he takes a card and drops it in the wire container, and another. Again, a mutter from the crowd turns him. Gandhi, on his hands and knees, blood trickling from his abraded cheek, has picked up a card from the ground and he leans forward apprehensively, his eyes fearfully on the sergeant, but he drops it defiantly in the container. The sergeant's rage erupts -- and he smashes the billy club down on Gandhi's head. Gandhi droops to the ground. Ba screams. She starts to run to him, but the other women grab her."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "His hand is held up for attention and a smile is forced by him, then the reading is started by him. It sounds flat and dull, like a speech is being read to oneself, and those in the crowd who had hesitated before wandering off shrug and continue on their way. It unnerves Gandhi a little, but he struggles on -- louder, but just as colorlessly. This last is delivered more firmly by him, and his head is lifted to the crowd, as though a reaction is expected by him. Three or four committed supporters applaud as on cue, but so inexpert is his technique that nothing but blank faces are drawn from the bulk of them. A nervous glance is cast at Ba by him, who is embarrassed for both of them now. It is held up by him. The police sergeant is glanced at by a constable. And the pass is turned and dropped by him in the wire basket over the fire. It is engulfed by the flames. Disbelief widens the police sergeant's eyes. Shock is murmured by the crowd. At last a reaction has been gotten by Gandhi, but the dropping of the card has been as matter-of-fact as his speaking, with none of the drama one might expect from so startling a gesture. Gandhi’s notes are taken from him, and the crowd is faced. It signals the end of the speech. He looks at the crowd. A harrumph is made by Gandhi -- gesturing to a shallow box held by Singh. Kahn turns back, rather lamely extemporizing. He faces the crowd. Behind him, the card is taken from his pocket by Khan as he holds himself erect. It is held aloft by him and then resolutely lowered into the wire basket. The crowd reacts and, just in time, it is seen dropped in the flame by the sergeant. A constable is gestured to by him, who turns from the crowd and marches to Khan, seizing him by the arm and marching him to the paddy wagon. As the sergeant is passed, the billy club is taken by the sergeant, and the crowd is faced, the club is rapped menacingly against his hand. Behind him, a moment of indecisiveness is wavered by Gandhi, then the box is taken from Singh by Gandhi and the fire is moved to. Gandhi is at the fire. For a second, the sergeant's eyes lock with his -- and then a card is nervously taken and dropped in the wire basket, and another is dropped by him. Again, a murmur from the crowd turns him. On his hands and knees, blood trickling from Gandhi’s abraded cheek, a card is picked up from the ground and he apprehensively leans forward, his eyes fearfully on the sergeant, but defiantly it is dropped in the basket by him. Fury bursts from the sergeant -- and Gandhi’s head is slammed by the billy club. He sags to the ground. A scream is let out by Ba. She starts to run to him, but she is seized by the other women."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He raises his hand for attention, forces a smile, and begins reading flatly, like someone reciting to themselves. The hesitant crowd shrugs and disperses. Gandhi, slightly unnerved, continues louder but still dull. Expecting a reaction, he looks to the crowd; only a few supporters applaud on cue, drawing blank looks from others. Nervously, he glances at Ba, who is embarrassed. He holds up his pass, drops it into the fire, and the flames consume it. The sergeant is shocked, and the crowd murmurs. The dramatic gesture is as unremarkable as his speech. He takes Gandhi's notes and addresses the crowd. It's the speech’s end. Gandhi gestures to a box Singh holds. Kahn, facing the crowd, awkwardly improvises. Behind him, Khan takes his card, holds it up, and lowers it into the fire. The crowd reacts; the sergeant sees it burn. He signals a constable, who seizes Khan, marching him to the paddy wagon. The sergeant menacingly taps his billy club. Gandhi hesitates, takes the box, and moves to the fire. Locking eyes with the sergeant, he nervously drops cards into the flames. A murmur arises. Gandhi, bleeding, picks up a card, fearfully watches the sergeant, and defiantly drops it in. Furious, the sergeant slams his club on Gandhi's head, and he collapses. Ba screams, trying to reach him, but other women hold her back."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He raises his hand for attention, forcing a smile, then reads flatly. The crowd, uninterested, moves on. Gandhi struggles on, louder but still colorless. A few supporters applaud, drawing blank stares. Nervously, he checks Ba, embarrassed for them both. He drops his pass into the fire, shocking the crowd. Without drama, he finishes his speech, gesturing to a shallow box Singh holds. Kahn takes his card, drops it into the flames, and is arrested by a constable. The sergeant menacingly faces the crowd. Gandhi hesitates, then drops a card into the basket. The crowd murmurs as he drops another, eyeing the sergeant nervously. Defiantly, he drops another card, but the sergeant strikes him down with a billy club. Gandhi collapses, Ba screams, and other women hold her back."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He confidently raises his hand with an air of authority, seeking the crowd's attention, and attempts to force out a smile that doesn't quite reach his eyes. With some hesitation, he begins to read aloud. His delivery is flat and uninspiring, resembling someone reciting a speech to themselves without an audience in mind. Those in the crowd who had initially paused their departure shrug indifferently and continue on their way without looking back. Gandhi, feeling somewhat unsettled by his own lack of impact, perseveres, speaking louder but with no more enthusiasm or vigor. Despite his increased volume, there is still a lack of passion in his voice. He stands there, hoping for some reaction from the audience as he lifts his head expectantly towards them. A mere three or four dedicated supporters clap at seemingly predetermined moments, following the expected cue, but his lack of polish and skill in public speaking only elicits blank, uninterested expressions from the majority of the onlookers. Nervously, he steals a glance at Ba, feeling her discomfort and shared embarrassment for the situation they find themselves in.\n\nHe holds the item he had been carrying high above for everyone to see. A constable, standing nearby, throws a questioning look at the police sergeant. Without a word, he turns away and lets his identification pass fall into the wire basket sitting atop the fire. The flames eagerly consume it. The police sergeant’s eyes widen in disbelief, unable to comprehend the audacity of the action. The crowd, previously unmoved, now stirs, murmuring in shock and surprise. Finally, Gandhi manages to provoke a reaction, though his release of the card is done with the same matter-of-fact tone as his speech, lacking any dramatic flourish that might have been anticipated with such a bold gesture. He hands over his notes to another, who confidently turns to face the crowd, signaling the conclusion of the speech. Gandhi surveys the crowd once more before clearing his throat with a hint of frustration, gesturing towards a shallow box that Singh is holding. Turning back, Kahn attempts to improvise but does so awkwardly, trying to maintain the crowd's attention. He, too, faces the gathered people, standing strong and determined. Behind him, Khan maintains a dignified posture, slowly retrieving his own card from his pocket. He holds it high for all to witness before resolutely placing it into the wire basket. The crowd reacts audibly, and the sergeant spins around just in time to watch it fall into the flames. He motions to a constable, who steps away from the crowd, advancing towards Khan with purpose. He grips Khan by the arm, escorting him to the waiting paddy wagon. As they pass the sergeant, the sergeant takes the billy club in hand, turning to face the crowd once more, tapping the club ominously against his palm.\n\nBehind this unfolding drama, Gandhi hesitates, caught in a moment of indecision, before taking the box from Singh and making his way to the fire with determination. Upon reaching the fire, Gandhi's eyes lock onto the sergeant's, nerves fraying. Bracing himself, he takes a card and deliberately drops it into the wire basket, quickly followed by another. The crowd’s reaction, a soft murmur, turns his focus back to them. Gandhi, now on his hands and knees with blood slowly seeping from his grazed cheek, retrieves a card from the ground and, with a mix of fear and defiance in his eyes as he glances at the sergeant, drops it into the basket with determination. The sergeant's anger explodes violently, and he brings the billy club crashing down onto Gandhi's head with brutal force. Gandhi collapses to the ground, beaten and injured. Ba, witnessing the scene, screams in horror and attempts to rush to his aid, but the other women hold her back, preventing her from reaching him."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He confidently raises his hand with an air of unmistakable authority, seeking to command the attention of the sizable crowd gathered around, and attempts to force out a smile, though the attempt does not quite reach his eyes, betraying his inner unease. With a moment of hesitation, he begins to read aloud. His delivery is flat and uninspiring, resembling someone reciting a speech solely to themselves, without having any audience in mind. Those individuals in the crowd who had initially paused their departure shrug indifferently and continue on their way without looking back even once. Gandhi, feeling somewhat unsettled by his own apparent lack of impact, perseveres, speaking louder now, though still with no more visible enthusiasm or vigor. Despite his increased volume, there is still a noticeable lack of passion in his voice. He stands there, hoping for some reaction from the audience as he lifts his head expectantly towards them. A mere three or four dedicated supporters clap, seemingly at predetermined moments, dutifully following the expected cue. However, his lack of polish and skill in public speaking only manages to elicit blank, uninterested expressions from the majority of the onlookers. Nervously, he steals a glance at Ba, feeling her discomfort and shared embarrassment for the situation in which they find themselves.\n\nHe holds the item he had been carrying high above for everyone there to see. A constable, positioned nearby, throws a questioning look in the direction of the police sergeant. Without uttering a word, he turns away and lets his identification pass fall into the wire basket sitting atop the fire. The flames eagerly consume it. The police sergeant’s eyes widen in disbelief, unable to comprehend the audacity of the action. The crowd, previously unmoved, now stirs, murmuring in shock and surprise. Finally, Gandhi manages to provoke a reaction, though his release of the card is done with the same matter-of-fact tone as his speech, lacking any dramatic flourish that might have been anticipated with such a bold gesture. He hands over his notes to another, who confidently turns to face the crowd, signaling the conclusion of the speech. Gandhi surveys the crowd once more before clearing his throat with a hint of frustration, gesturing towards a shallow box that Singh is holding. Turning back, Kahn attempts to improvise but does so awkwardly, trying to maintain the crowd's attention. He, too, faces the gathered people, standing strong and determined. Behind him, Khan maintains a dignified posture, slowly retrieving his own card from his pocket. He holds it high for all to witness before resolutely placing it into the wire basket. The crowd reacts audibly, and the sergeant spins around just in time to watch it fall into the flames. He motions to a constable, who steps away from the crowd, advancing towards Khan with purpose. He grips Khan by the arm, escorting him to the waiting paddy wagon. As they pass the sergeant, the sergeant takes the billy club in hand, turning to face the crowd once more, tapping the club ominously against his palm.\n\nBehind this unfolding drama, Gandhi hesitates, caught in a moment of indecision, before taking the box from Singh and making his way to the fire with determination. Upon reaching the fire, Gandhi's eyes lock onto the sergeant's, nerves fraying. Bracing himself, he takes a card and deliberately drops it into the wire basket, quickly followed by another. The crowd’s reaction, a soft murmur, turns his focus back to them. Gandhi, now on his hands and knees with blood slowly seeping from his grazed cheek, retrieves a card from the ground and, with a mix of fear and defiance in his eyes as he glances at the sergeant, drops it into the basket with determination. The sergeant's anger explodes violently, and he brings the billy club crashing down onto Gandhi's head with brutal force. Gandhi collapses to the ground, beaten and injured. Ba, witnessing the scene, screams in horror and attempts to rush to his aid, but the other women hold her back, preventing her from reaching him."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He raises his hand high in the air, seeking to capture the attention of those around, and as he forces a smile onto his face, he begins to read aloud. His voice is flat and uninspired, carrying the tone of someone reading a speech to themselves without passion, causing those in the crowd who had initially paused to listen to lose interest and resume their wandering. Despite feeling slightly unsettled by the lack of engagement, Gandhi persists, raising his voice in an attempt to project more strongly, though it remains devoid of any vibrancy. With more firmness now, he lifts his head hopeful for a response from the audience, yet only three or four dedicated supporters clap on cue while the majority of the crowd remains impassive, their faces betraying no recognition of his effort. Feeling the tension, he casts a nervous glance towards Ba, who shares in his embarrassment without speaking. He raises the object once more. A local constable momentarily directs his gaze towards the police sergeant present. Turning with resolve, he lets his pass slip from his fingers into the wire basket positioned above the fire, where it is swiftly consumed by the flames. Observing this, the police sergeant widens his eyes in disbelief, while murmurs of shock ripple through the crowd, indicating that Gandhi has finally elicited a reaction, though the act of discarding the card was as straightforward as his earlier speaking, lacking the theatrical flair such a bold gesture might have warranted. Another steps forward, taking Gandhi's notes from him, and faces the crowd to indicate the conclusion of the speech. He surveys the crowd intently. Gandhi clears his throat with a gesture towards the shallow box that Singh holds. As Kahn turns back, trying to improvise with little success, he positions himself to face the crowd. Behind him, another individual, Khan, stands tall and solemnly retrieves his own card from his pocket, holding it up for all to see before resolutely lowering it into the wire basket. The crowd reacts audibly, and the sergeant turns just in time to witness the card being consumed by the flame. He signals to a constable, who promptly detaches from the crowd, marching determinedly toward Khan, grasping him by the arm, and escorting him forcefully towards the waiting paddy wagon. As they pass by, the sergeant intercepts them, gripping his billy club and turning to the crowd, tapping the club with an intimidating rhythm against his hand. Behind this unfolding scene, Gandhi hesitates, caught in a moment of indecision, then decisively takes the box from Singh and approaches the fire. Standing there, he locks eyes briefly with the sergeant, his gaze filled with apprehension. Nervously, he takes a card, dropping it in the wire basket, and follows with another. A murmur spreads through the crowd once again, drawing Gandhi's attention. Now on his hands and knees, blood trickling from his scraped cheek, he retrieves a card from the ground, leaning forward with apprehension while keeping a wary eye on the sergeant. Defiantly, he releases the card into the basket. The sergeant cannot contain his anger any longer, and in a furious burst, he brings the billy club crashing down on Gandhi's head. Gandhi collapses to the ground under the blow. Ba screams, filled with terror and rushes forward to reach him, but is restrained by the other women who hold her back from advancing further."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Gandhi raises his hand to gain attention and forces a smile as he begins reading his speech. His delivery is flat, causing the crowd to lose interest and wander off, despite a few supporters applauding obediently. Feeling embarrassed, Gandhi glances at Ba for reassurance. He then drops his pass into a fire, which surprises the police sergeant and elicits a shocked murmur from the crowd, though his action is as undramatic as his speech. Kahn takes the notes, addresses the crowd, and follows suit by burning his own card, prompting a constable to arrest him and lead him to a paddy wagon. The sergeant, now on alert, menaces the crowd with his billy club. Gandhi hesitates but ultimately takes a box from Singh, approaches the fire, and begins dropping cards into it. The sergeant's eyes lock with his as he nervously continues. After suffering a blow from the sergeant's club, Gandhi falls, bleeding and defiant, as he picks up a card from the ground and defiantly throws it into the fire. Ba screams and attempts to run to him, but the other women hold her back."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He holds up his hand for attention and forces a smile, then starts reading. It is flat and dull, like someone reading a speech to themselves, and those in the crowd who had hesitated before wandering off shrug and continue on their way. Gandhi, known for his leadership in India's struggle for independence through nonviolent resistance, is unnerved by it a little but he struggles on -- louder, but just as colorlessly. This last has come more firmly, and he lifts his head to the crowd, as though expecting a reaction. Three or four committed supporters, aware of Gandhi's influence in the Indian National Congress, applaud as on cue, but his technique is so inexpert that it draws nothing but blank faces from the bulk of them. He glances nervously at Ba, his wife and close confidante, who is embarrassed for them both now. He holds it up. A constable glances at the police sergeant. And he turns and drops his pass, a symbolic act of defiance against the oppressive pass laws of South Africa, in the wire basket over the fire. The flames engulf it. The police sergeant's eyes go wide with disbelief. The crowd murmurs in shock. At last Gandhi has got a reaction, but the dropping of the card has been as matter-of-fact as his speaking, with none of the drama one might expect from so startling a gesture. He takes Gandhi's notes from him, and faces the crowd. It is the end of the speech. He looks at the crowd. Gandhi harrumphs -- gesturing to a shallow box Singh holds. Kahn, an ally in the struggle against apartheid, turns back, extemporizing rather lamely. He is facing the crowd. Behind him, Khan holds himself erect and slowly takes his own card from his pocket. He holds it aloft and then lowers it resolutely into the wire basket. The crowd reacts and the sergeant turns just in time to see it dropped in the flame. He gestures to a constable, who turns from the crowd and marches to Khan, seizing him by the arm and marching him to the paddy wagon, a vehicle used to transport prisoners. As he passes the sergeant, the sergeant takes his billy club, a symbol of his authority and readiness to enforce order, and faces the crowd, rapping the club menacingly against his hand. Behind him, Gandhi wavers indecisively a moment, then takes the box from Singh and moves to the fire. Gandhi, resolute in his commitment to civil disobedience, is at the fire. For a second, his eyes lock with the sergeant's -- and then nervously, he takes a card and drops it in the wire basket, and another. Again, a murmur from the crowd turns him. Gandhi, on his hands and knees, blood trickling from his abraded cheek, has picked up a card from the ground and he leans forward apprehensively, his eyes fearfully on the sergeant, but he drops it defiantly in the basket. The sergeant's fury bursts -- and he slams the billy club down on Gandhi's head. Gandhi sags to the ground. Ba screams. She starts to run to him, but the other women, aware of the possible repercussions, seize her."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He holds up his hand for attention and forces a smile then starts reading. It is flat and dull like someone reading a speech to themselves. and those in the crowd who had hesitated before wandering off shrug and continue on their way. Gandhi is unnerved by it a little but he struggles on  louder but just as colorlessly. This last has come more firmly and he lifts his head to the crowd as though expecting a reaction. Three or four committed supporters applaud as on cue but his technique is so inexpert that it draws nothing but blank faces from the bulk of them. He glances nervously at Ba who is embarrassed for them both now. He holds it up. A constable glances at the police sergeant. And he turns and drops his pass in the wire basket over the fire. The flames engulf it. The police sergeant's eyes go wide with disbelief. The crowd murmurs in shock. At last Gandhi has got a reaction but the dropping of the card has been as matteroffact as his speaking with none of the drama one might expect from so startling a gesture. He takes Gandhi's notes from him and faces the crowd. It is the end of the speech. He looks at the crowd. Gandhi harrumphs  gesturing to a shallow box. Singh holds. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Kahn turns back extemporizing rather lamely. He is facing the crowd. Behind him. Khan holds himself erect and slowly takes his own card from his pocket. He holds it aloft and then lowers it resolutely into the wire basket. The crowd reacts and the sergeant turns just in time to see it dropped in the flame. He gestures to a constable who turns from the crowd and marches to Khan seizing him by the arm and marching him to the paddy wagon. As he passes the sergeant the sergeant takes his billy club and faces the crowd rapping the club menacingly against his hand. Behind him. Gandhi wavers indecisively a moment then takes the box from Singh and moves to the fire. Gandhi is at the fire. For a second his eyes lock with the sergeant's  and then nervously he takes a card and drops it in the wire basket. and another. Again a murmur from the crowd turns him. Gandhi on his hands and knees blood trickling from his abraded cheek has picked up a card from the ground and he leans forward apprehensively his eyes fearfully on the sergeant but he drops it defiantly in the basket. The sergeant's fury bursts  and he slams the billy club down on Gandhi's head. Gandhi sags to the ground. Ba screams. She starts to run to him but the other women seize her."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He holds up his hand for attention and forces a smile then starts reading. It is flat and dull like someone reading a speech to themselves. and those in the crowd who had hesitated before wandering off shrug and continue on their way. Gandhi is unnerved by it a little but he struggles on  louder but just as colorlessly. This last has come more firmly and he lifts his head to the crowd as though expecting a reaction. Three or four committed supporters applaud as on cue but his technique is so inexpert that it draws nothing but blank faces from the bulk of them. He glances nervously at Ba who is embarrassed for them both now. He holds it up. A constable glances at the police sergeant. And he turns and drops his pass in the wire basket over the fire. The flames engulf it. The police sergeant's eyes go wide with disbelief. The crowd murmurs in shock. At last Gandhi has got a reaction but the dropping of the card has been as matteroffact as his speaking with none of the drama one might expect from so startling a gesture. He takes Gandhi's notes from him and faces the crowd. It is the end of the speech. He looks at the crowd. Gandhi harrumphs  gesturing to a shallow box. Singh holds. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. Kahn turns back extemporizing rather lamely. He is facing the crowd. Behind him. Khan holds himself erect and slowly takes his own card from his pocket. He holds it aloft and then lowers it resolutely into the wire basket. The crowd reacts and the sergeant turns just in time to see it dropped in the flame. He gestures to a constable who turns from the crowd and marches to Khan seizing him by the arm and marching him to the paddy wagon. As he passes the sergeant the sergeant takes his billy club and faces the crowd rapping the club menacingly against his hand. Behind him. Gandhi wavers indecisively a moment then takes the box from Singh and moves to the fire. Gandhi is at the fire. For a second his eyes lock with the sergeant's  and then nervously he takes a card and drops it in the wire basket. and another. Again a murmur from the crowd turns him. Gandhi on his hands and knees blood trickling from his abraded cheek has picked up a card from the ground and he leans forward apprehensively his eyes fearfully on the sergeant but he drops it defiantly in the basket. The sergeant's fury bursts  and he slams the billy club down on Gandhi's head. Gandhi sags to the ground. Ba screams. She starts to run to him but the other women seize her."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He holds up his hand for attention and forces a smile then starts reading. It is flat and dull like someone reading a speech to themselves. and those in the crowd who had hesitated before wandering off shrug and continue on their way. Gandhi is unnerved by it a little but he struggles on  louder but just as colorlessly. This last has come more firmly and he lifts his head to the crowd as though expecting a reaction. Three or four committed supporters applaud as on cue but his technique is so inexpert that it draws nothing but blank faces from the bulk of them. He glances nervously at Ba who is embarrassed for them both now. He holds it up. A constable glances at the police sergeant. And he turns and drops his pass in the wire basket over the fire. Gandhi is at the fire. For a second his eyes lock with the sergeant's  and then nervously he takes a card and drops it in the wire basket. and another. Again a murmur from the crowd turns him. Gandhi on his hands and knees blood trickling from his abraded cheek has picked up a card from the ground and he leans forward apprehensively his eyes fearfully on the sergeant but he drops it defiantly in the basket. The sergeant's fury bursts  and he slams the billy club down on Gandhi's head. Gandhi sags to the ground. Ba screams. She starts to run to him but the other women seize her."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He holds up his hand for attention and forces a smile then starts reading. It is flat and dull like someone reading a speech to themselves. and those in the crowd who had hesitated before wandering off shrug and continue on their way. Gandhi is unnerved by it a little but he struggles on  louder but just as colorlessly. The sergeant's fury bursts  and he slams the billy club down on Gandhi's head. Gandhi sags to the ground. Ba screams. She starts to run to him but the other women seize her."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The parrot flaps up its wing for attention and fakes a chuckle, then starts painting. It is stale and bland, like someone painting a canvas to themselves, and those in the orchard who had paused before flying off nod and continue on their way. Einstein is startled by it a little but he paddles on -- louder, but just as monotonously. This last has come more boldly, and he raises his beak to the orchard, as though expecting a response. Three or four devoted gardeners clap as on signal, but his artistry is so awkward that it draws nothing but blank wings from the majority of them. He peeks nervously at Tesla, who is flustered for them both now. He flaps it up. A lifeguard peeks at the life coach. And he swivels and tosses his pebble in the tin bucket over the bonfire. The embers consume it. The life coach's eyes go wide with astonishment. The orchard hums in surprise. At last Einstein has got a response, but the tossing of the pebble has been as mundane as his painting, with none of the thrill one might expect from so surprising a maneuver. He snatches Einstein's brushes from him, and faces the orchard. It is the conclusion of the masterpiece. He gazes at the orchard. Einstein grumbles -- gesturing to a shallow crate Tesla clutches. Curie swivels back, improvising rather feebly. He is facing the orchard. Behind him, Curie stands straight and slowly grabs his own pebble from his satchel. He flaps it high and then lowers it firmly into the tin bucket. The orchard reacts and the coach swivels just in time to see it tossed in the ember. He gestures to a lifeguard, who swivels from the orchard and marches to Curie, grabbing him by the wing and marching him to the fish bowl. As he passes the coach, the coach snatches his broomstick, and faces the orchard, tapping the stick menacingly against his talon. Behind him, Einstein trembles uncertainly a moment, then grabs the crate from Tesla and glides to the bonfire. Einstein is at the bonfire. For a second, his beak locks with the coach's -- and then nervously, he grabs a pebble and tosses it in the tin bucket, and another. Again, a hum from the orchard spins him. Einstein, on his wings and knees, sap trickling from his bruised feather, has picked up a pebble from the dirt and he leans forward timidly, his beak anxiously on the coach, but he tosses it defiantly in the bucket. The coach's rage erupts -- and he whacks the broomstick down on Einstein's beak. Einstein slumps to the dirt. Tesla squawks. She flutters to glide to him, but the other birds clutch her."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Gandhi attempts to engage a crowd with a monotonous speech, drawing little reaction except from a few supporters. His wife, Ba, is embarrassed by his lack of impact. To provoke a stronger response, Gandhi drops his pass into a fire, shocking the crowd and the police sergeant. Confronted with disbelief, another man, Khan, follows suit, resulting in his arrest. As the sergeant menaces the crowd with his billy club, Gandhi hesitates but then defiantly discards more cards into the flames. Despite being bloodied by the sergeant's violent response, Gandhi persists, dropping a final card with defiance, prompting a scream from Ba as she is restrained by other women."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She starts to run to him but the other women seize her Ba screams Gandhi sags to the ground The sergeant's fury bursts  and he slams the billy club down on Gandhi's head Gandhi on his hands and knees blood trickling from his abraded cheek has picked up a card from the ground and he leans forward apprehensively his eyes fearfully on the sergeant but he drops it defiantly in the basket Again a murmur from the crowd turns him and another For a second his eyes lock with the sergeant's  and then nervously he takes a card and drops it in the wire basket Gandhi is at the fire Gandhi wavers indecisively a moment then takes the box from Singh and moves to the fire Behind him As he passes the sergeant the sergeant takes his billy club and faces the crowd rapping the club menacingly against his hand He gestures to a constable who turns from the crowd and marches to Khan seizing him by the arm and marching him to the paddy wagon The crowd reacts and the sergeant turns just in time to see it dropped in the flame He holds it aloft and then lowers it resolutely into the wire basket Khan holds himself erect and slowly takes his own card from his pocket Behind him He is facing the crowd Kahn turns back extemporizing rather lamely Singh holds Gandhi harrumphs  gesturing to a shallow box He looks at the crowd It is the end of the speech He takes Gandhi's notes from him and faces the crowd At last Gandhi has got a reaction but the dropping of the card has been as matteroffact as his speaking with none of the drama one might expect from so startling a gesture The crowd murmurs in shock The police sergeant's eyes go wide with disbelief The flames engulf it And he turns and drops his pass in the wire basket over the fire A constable glances at the police sergeant He holds it up He glances nervously at Ba who is embarrassed for them both now Three or four committed supporters applaud as on cue but his technique is so inexpert that it draws nothing but blank faces from the bulk of them This last has come more firmly and he lifts his head to the crowd as though expecting a reaction Gandhi is unnerved by it a little but he struggles on  louder but just as colorlessly and those in the crowd who had hesitated before wandering off shrug and continue on their way It is flat and dull like someone reading a speech to themselves He holds up his hand for attention and forces a smile then starts reading"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "It is flat and dull like someone reading a speech to themselves He holds up his hand for attention and forces a smile then starts reading Gandhi is unnerved by it a little but he struggles on  louder but just as colorlessly and those in the crowd who had hesitated before wandering off shrug and continue on their way Three or four committed supporters applaud as on cue but his technique is so inexpert that it draws nothing but blank faces from the bulk of them This last has come more firmly and he lifts his head to the crowd as though expecting a reaction He holds it up He glances nervously at Ba who is embarrassed for them both now And he turns and drops his pass in the wire basket over the fire A constable glances at the police sergeant The police sergeant's eyes go wide with disbelief The flames engulf it At last Gandhi has got a reaction but the dropping of the card has been as matteroffact as his speaking with none of the drama one might expect from so startling a gesture The crowd murmurs in shock It is the end of the speech He takes Gandhi's notes from him and faces the crowd Gandhi harrumphs  gesturing to a shallow box He looks at the crowd Kahn turns back extemporizing rather lamely Singh holds Behind him He is facing the crowd He holds it aloft and then lowers it resolutely into the wire basket Khan holds himself erect and slowly takes his own card from his pocket He gestures to a constable who turns from the crowd and marches to Khan seizing him by the arm and marching him to the paddy wagon The crowd reacts and the sergeant turns just in time to see it dropped in the flame Behind him As he passes the sergeant the sergeant takes his billy club and faces the crowd rapping the club menacingly against his hand Gandhi is at the fire Gandhi wavers indecisively a moment then takes the box from Singh and moves to the fire and another For a second his eyes lock with the sergeant's  and then nervously he takes a card and drops it in the wire basket Gandhi on his hands and knees blood trickling from his abraded cheek has picked up a card from the ground and he leans forward apprehensively his eyes fearfully on the sergeant but he drops it defiantly in the basket Again a murmur from the crowd turns him Gandhi sags to the ground The sergeant's fury bursts  and he slams the billy club down on Gandhi's head She starts to run to him but the other women seize her Ba screams"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Kahn turns back extemporizing rather lamely He is facing the crowd Behind him Khan holds himself erect and slowly takes his own card from his pocket He holds it aloft and then lowers it resolutely into the wire basket The crowd reacts and the sergeant turns just in time to see it dropped in the flame He gestures to a constable who turns from the crowd and marches to Khan seizing him by the arm and marching him to the paddy wagon As he passes the sergeant the sergeant takes his billy club and faces the crowd rapping the club menacingly against his hand Behind him Gandhi wavers indecisively a moment then takes the box from Singh and moves to the fire Gandhi is at the fire For a second his eyes lock with the sergeant's  and then nervously he takes a card and drops it in the wire basket and another Again a murmur from the crowd turns him Gandhi on his hands and knees blood trickling from his abraded cheek has picked up a card from the ground and he leans forward apprehensively his eyes fearfully on the sergeant but he drops it defiantly in the basket The sergeant's fury bursts  and he slams the billy club down on Gandhi's head Gandhi sags to the ground Ba screams She starts to run to him but the other women seize her He holds up his hand for attention and forces a smile then starts reading It is flat and dull like someone reading a speech to themselves and those in the crowd who had hesitated before wandering off shrug and continue on their way Gandhi is unnerved by it a little but he struggles on  louder but just as colorlessly This last has come more firmly and he lifts his head to the crowd as though expecting a reaction Three or four committed supporters applaud as on cue but his technique is so inexpert that it draws nothing but blank faces from the bulk of them He glances nervously at Ba who is embarrassed for them both now He holds it up A constable glances at the police sergeant And he turns and drops his pass in the wire basket over the fire The flames engulf it The police sergeant's eyes go wide with disbelief The crowd murmurs in shock At last Gandhi has got a reaction but the dropping of the card has been as matteroffact as his speaking with none of the drama one might expect from so startling a gesture He takes Gandhi's notes from him and faces the crowd It is the end of the speech He looks at the crowd Gandhi harrumphs  gesturing to a shallow box Singh holds"
        }
      ]
    }
  ]
}