{
  "ground_truth": "She fights loose, but one of the constables takes her firmly. The sergeant turns from the commotion to see that Gandhi, his head oozing blood, has crawled to his knees again and is picking up another card. The crowd watches. The newspaper reporter watches. Ba stares in anguish. Gandhi lifts the card. The sergeant stares at him, angry but his emotions somewhat in control after the first blow. An instant of hesitation, then Gandhi drops the card into the basket. The sergeant almost stops, but he strikes again. A quiver of distaste at his own act crosses his face as Gandhi sags. Ba's anguished face is wet with tears. The newspaper reporter stares without making notes. Khan, at the paddy wagon, watches in wonder. Gandhi, his head bleeding badly now, rises to his knees -- a breath and he gropes around the ground for another card. His fingers finally clutch one. The sergeant stares, his face wracked with uncertainty and confusion. Gandhi lifts the card and painfully holds it over the fire, then drops it in the basket. The sergeant slams the billy club down again -- firmly, but with a manifest reluctance. The crowd watches breathlessly, the newspaper reporter stares. The sergeant draws a breath, grasping the club, but he bites his lip as he sees Gandhi lift his head feebly, his shaking hands, stained with his own blood, groping for another card. Ba is gently removing Gandhi's suit coat, staring fearfully at a bandage on his head, another along the side of his face. The room is gas lit, over furnished in the Victorian manner. Gandhi sits carefully on the bed, where some newspapers are spread out, English-language ones among them. Ba reaches forth, gently touching the bandages on his head. Before Gandhi can retort there is a knock on the door. A small, round ayah (an Indian nursemaid) pushes open the door and proudly admits her charges, Gandhi's sons: Harilal (ten), Manilal (six), and Ramdas (two). They are all dressed in European suits, ties, and stiff collars. They step forward, one by one, making the pranam (the Hindu gesture of greeting), then bending and touching the hands and lips to Gandhi's feet in the traditional obeisance of child to father. Gandhi smiles. And Ramdas runs to him and Gandhi bends to kiss him as Ramdas puts his arms around his neck. The boys bow and leave like boys used to household discipline. The ayah closes the door and we hear their chatter as they go down the hall. Gandhi is stretching out on the bed, taking up another paper. Ba comes and sits down on the bed beside him, maneuvering so that she can get at the bandage.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She struggles free, but one of the officers grips her firmly. The inspector turns from the uproar to perceive that Gandhi, his head seeping blood, has crawled to his knees again and is picking up another card. The throng observes. The journalist observes. Ba gazes in torment. Gandhi raises the card. The inspector gazes at him, irate but his emotions somewhat in check after the first strike. An instant of indecision, then Gandhi lets the card fall into the basket. The inspector nearly halts, but he strikes again. A tremor of aversion at his own deed passes his visage as Gandhi wilts. Ba's tormented visage is wet with tears. The journalist stares without taking notes. Khan, at the patrol wagon, observes in awe. Gandhi, his head hemorrhaging severely now, rises to his knees -- a breath and he fumbles around the ground for another card. His fingers finally grasp one. The inspector gazes, his visage filled with uncertainty and perplexity. Gandhi lifts the card and painfully holds it above the flame, then drops it in the basket. The inspector pounds the truncheon down again -- firmly, but with a manifest unwillingness. The throng observes breathlessly, the journalist stares. The inspector draws a breath, clutching the truncheon, but he bites his lip as he sees Gandhi raise his head feebly, his trembling hands, stained with his own blood, fumbling for another card. Ba is gently removing Gandhi's suit jacket, staring fearfully at a bandage on his head, another along the side of his visage. The room is gas lit, over furnished in the Victorian style. Gandhi sits carefully on the bed, where some newspapers are spread out, English-language ones among them. Ba reaches forth, gently touching the bandages on his head. Before Gandhi can reply there is a knock on the door. A small, round ayah (an Indian nursemaid) pushes open the door and proudly introduces her charges, Gandhi's sons: Harilal (ten), Manilal (six), and Ramdas (two). They are all dressed in European suits, ties, and stiff collars. They step forward, one by one, making the pranam (the Hindu gesture of greeting), then bending and touching the hands and lips to Gandhi's feet in the traditional homage of child to father. Gandhi smiles. And Ramdas runs to him and Gandhi bends to kiss him as Ramdas puts his arms around his neck. The boys bow and depart like boys accustomed to household discipline. The ayah closes the door and we hear their chatter as they go down the corridor. Gandhi is stretching out on the bed, taking up another journal. Ba comes and sits down on the bed beside him, maneuvering so that she can access the bandage."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "She fights loose, but she is taken firmly by one of the constables. The sergeant turns from the commotion to see that Gandhi, his head oozing blood, has crawled to his knees again and is picking up another card. The crowd watches. The newspaper reporter watches. Ba stares in anguish. The card is lifted by Gandhi. The sergeant stares at him, angry but his emotions somewhat in control after the first blow. An instant of hesitation occurs, then the card is dropped into the basket by Gandhi. The sergeant almost stops, but he strikes again. A quiver of distaste crosses his face as he acknowledges his own act while Gandhi sags. Ba's anguished face is wet with tears. The newspaper reporter stares without making notes. Khan, at the paddy wagon, watches in wonder. With his head bleeding badly now, Gandhi rises to his knees -- a breath and he gropes around the ground for another card. One is finally clutched by his fingers. The sergeant's face is wracked with uncertainty and confusion as he stares. The card is lifted by Gandhi and painfully held over the fire, then it is dropped in the basket. The billy club is slammed down again by the sergeant -- firmly, but with manifest reluctance. The crowd watches breathlessly, while the newspaper reporter stares. The sergeant draws a breath, grasping the club, but he bites his lip as he sees Gandhi feebly lift his head, his shaking hands, stained with his own blood, groping for another card. Gandhi's suit coat is being gently removed by Ba, who stares fearfully at a bandage on his head, another along the side of his face. The room is gas lit, over furnished in the Victorian manner. Gandhi sits carefully on the bed, where some newspapers have been spread out, English-language ones among them. The bandages on his head are gently touched by Ba. Before Gandhi can retort, there is a knock on the door. A small, round ayah (an Indian nursemaid) pushes open the door and proudly admits her charges, Gandhi's sons: Harilal (ten), Manilal (six), and Ramdas (two). They are all dressed in European suits, ties, and stiff collars. They step forward, one by one, making the pranam (the Hindu gesture of greeting), then they bend and touch their hands and lips to Gandhi's feet in the traditional obeisance of child to father. Gandhi smiles. Ramdas runs to him, and Gandhi bends to kiss him as Ramdas puts his arms around his neck. The boys bow and leave like boys used to household discipline. The ayah closes the door, and their chatter is heard as they go down the hall. Gandhi stretches out on the bed, taking up another paper. Ba comes and sits down on the bed beside him, maneuvering so that the bandage can be accessed by her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "She struggles, but a constable holds her firmly. The sergeant turns to see Gandhi, bleeding, on his knees picking up another card. The crowd and a newspaper reporter watch. Ba looks on in anguish. Gandhi lifts the card. The sergeant, angry but composed, hesitates, then Gandhi drops the card into the basket. The sergeant almost stops but strikes again, showing distaste for his actions as Gandhi sags. Ba's face is wet with tears. The reporter stares without taking notes. Khan watches in wonder. Gandhi, bleeding heavily, rises and finds another card. The sergeant, uncertain, watches as Gandhi painfully drops it in the basket. The sergeant strikes again, reluctantly. The crowd watches breathlessly. The sergeant hesitates, seeing Gandhi's bloody hands reaching for another card. Ba removes Gandhi's coat, worried about his bandages. The room is gas-lit and Victorian. Gandhi sits on the bed with newspapers, including English ones. Ba gently touches his bandages. There's a knock, and an ayah enters with Gandhi's sons: Harilal, Manilal, and Ramdas, all in European suits. They greet Gandhi with pranam and touch his feet. Gandhi smiles, kissing Ramdas as he hugs him. The boys leave, disciplined, and the ayah closes the door. Gandhi stretches on the bed with a paper, and Ba sits beside him, adjusting his bandage."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "She struggles, but a constable holds her. The sergeant sees Gandhi, bleeding, picking another card. The crowd and reporter watch. Ba is anguished. Gandhi drops the card in the basket. The sergeant hesitates, then strikes again, feeling distaste. Ba cries. The reporter watches silently. Khan watches amazed. Gandhi, bleeding heavily, finds another card, drops it in the basket. The sergeant hits reluctantly. The crowd watches, the reporter stares. The sergeant hesitates as Gandhi, bleeding, reaches for another card. Ba removes Gandhi's coat, worried about his bandages. The room is gas-lit, Victorian. Gandhi sits on the bed with newspapers. Ba touches his bandages. A knock at the door. An ayah enters with Gandhi's sons, dressed in suits. They greet him traditionally. Gandhi smiles, kisses Ramdas. The boys leave. The ayah closes the door. Gandhi stretches on the bed, reading. Ba sits beside him, adjusting the bandage."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "She struggles against the grip, but one of the constables holds her with a firm and unyielding grasp. The sergeant, momentarily distracted by the commotion, turns his attention to see that Gandhi, with blood oozing from his head, has managed to crawl back to his knees. Despite his injuries, he is determinedly reaching for another card. The crowd stands in silent observation, their eyes fixed on the unfolding scene. The newspaper reporter, too, watches intently, his pen momentarily still. Ba, filled with anguish, gazes at the scene with tears in her eyes. Gandhi, with a determined yet pained expression, lifts the card. The sergeant, his face a mix of anger and a struggle to maintain control after the initial blow, stares at him. There is a brief moment of hesitation, and then Gandhi lets the card fall into the basket. The sergeant almost pauses, but then he strikes once more. A flicker of distaste for his own actions crosses his face as Gandhi collapses. Ba's face is wet with tears of anguish. The newspaper reporter continues to watch, his notebook untouched. Khan, standing by the paddy wagon, observes in wonder. Gandhi, his head now bleeding profusely, rises once more to his knees. He takes a breath and begins to search the ground for yet another card. His fingers finally find one. The sergeant, his face showing signs of uncertainty and confusion, stares at him. Gandhi painfully lifts the card and holds it over the fire before dropping it into the basket. The sergeant brings the billy club down again, this time with a firm hand but evident reluctance. The crowd watches with bated breath, and the newspaper reporter continues to stare. The sergeant takes a deep breath, gripping the club tightly, but hesitates as he sees Gandhi lift his head weakly, his hands trembling and stained with his own blood, reaching for another card. Ba is gently removing Gandhi's suit coat, her eyes filled with fear as she looks at the bandage on his head and another along the side of his face. The room is illuminated by gaslight and is over-furnished in the ornate Victorian style. Gandhi sits carefully on the bed, where several newspapers are spread out, including some in English. Ba reaches out, gently touching the bandages on his head. Before Gandhi can respond, there is a knock at the door. A small, round ayah, an Indian nursemaid, opens the door with pride and ushers in her charges, Gandhi's sons: Harilal, who is ten, Manilal, who is six, and Ramdas, who is two. They are all dressed in European-style suits, complete with ties and stiff collars. They step forward one by one, performing the pranam, the Hindu gesture of greeting, and then bend to touch their hands and lips to Gandhi's feet in the traditional show of respect from child to father. Gandhi smiles warmly. Ramdas runs to him, and Gandhi bends down to kiss him as Ramdas wraps his arms around his neck. The boys bow and leave, displaying the discipline of children accustomed to household rules. The ayah closes the door behind them, and their chatter can be heard as they make their way down the hall. Gandhi stretches out on the bed, picking up another newspaper. Ba sits down beside him, carefully maneuvering to tend to the bandage."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "She struggles fiercely against the restrictive grip, but one of the constables maintains a firm, unyielding hold on her. The sergeant, who is momentarily distracted by the commotion around him, shifts his attention to observe Gandhi, who now has blood oozing from a wound on his head. With remarkable determination, Gandhi has managed to crawl back onto his knees. Despite his painful injuries, he is resolutely reaching out for another card. The crowd stands in silent, attentive observation, their eyes fixed intently on the unfolding scene before them. The newspaper reporter, too, is watching with deep concentration, his pen pausing to capture the intensity of the moment. Ba, overwhelmed with anguish, gazes upon the scene, her eyes brimming with tears. Gandhi, wearing an expression of both determination and pain, lifts the card with care. The sergeant, his face an uneasy blend of anger and the struggle to maintain control after the initial blow, continues to stare at him. There is a brief moment of hesitation in the air, and then Gandhi lets the card slip from his fingers into the basket. The sergeant almost pauses, but unable to help himself, he strikes again. A flicker of distaste, perhaps even regret for his own actions, briefly crosses his face as Gandhi collapses once more. Ba's face is now wet with tears of profound sorrow. The newspaper reporter keeps watching, his notebook remains untouched by notes. Khan, who is standing by the paddy wagon, observes the scene with a sense of wonder. Gandhi, his head now bleeding more profusely, rises once again to his knees. He takes a deep breath, gathering himself, and begins searching the ground for yet another card. After a moment, his fingers manage to find one. The sergeant, his face now showing signs of uncertainty and perhaps a hint of confusion, stares at him. Gandhi painfully lifts the card, holding it over the fire before letting it drop into the basket. The sergeant brings the billy club down again with a firm hand, but his reluctance is evident. The crowd continues to watch with bated breath, and the newspaper reporter maintains his steady gaze. The sergeant takes another deep breath, gripping the club tightly in his hands, but hesitates as he sees Gandhi lift his head weakly once more. Gandhi's hands are trembling, stained with his own blood, as he reaches again for another card. Ba, filled with fear, is gently removing Gandhi's suit coat, her eyes fixed on the bandage wrapping his head and another placed along the side of his face. The room is softly illuminated by the warm glow of gaslight, and it is over-furnished in the lavish and ornate Victorian style. Gandhi sits carefully on the bed, where several newspapers are spread out before him, including some printed in English. Ba reaches out tenderly, gently touching the bandages on his head with great care. Before Gandhi can respond, there comes a knock at the door. A small, round ayah, who serves as an Indian nursemaid, opens the door with a sense of pride and ushers in her charges, Gandhi's sons: Harilal, who is ten years old, Manilal, who is six, and Ramdas, who is two. They are all dressed neatly in European-style suits, complete with ties and stiff collars. The boys step forward one by one, performing the pranam, which is the Hindu gesture of respectful greeting, before bending down to touch their hands and lips to Gandhi's feet in a traditional show of respect from child to father. Gandhi smiles warmly at the affectionate display. Ramdas, the youngest, runs to him, and Gandhi bends down to kiss him as Ramdas wraps his small arms around his neck in a tender embrace. The boys bow and take their leave, displaying the discipline of children who are well-accustomed to household rules. The ayah closes the door behind them, and their chatter can be heard echoing softly as they make their way down the hall. Gandhi stretches out on the bed, reaching for another newspaper. Ba sits down beside him, carefully maneuvering to tend to the bandage on his head with gentle hands."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "She struggles to break free, but one of the constables grips her firmly, preventing her escape. Meanwhile, the sergeant, momentarily distracted by the commotion, turns his attention to Gandhi, who, despite his head oozing blood, has managed to crawl back to his knees. With determination, Gandhi reaches out and picks up another card from the ground. The crowd stands in silent anticipation, their eyes fixed on the unfolding scene, while the newspaper reporter observes intently, his pen poised but unmoving. Ba, filled with anguish, watches the events with tears in her eyes. Gandhi, with a steady hand, lifts the card, and the sergeant, though angry, maintains a semblance of control over his emotions after delivering the first blow. Gandhi hesitates for a brief moment before letting the card fall into the basket. The sergeant, almost stopping himself, strikes Gandhi again, and a flicker of distaste for his own actions crosses his face as Gandhi collapses. Ba's face is wet with tears, reflecting her deep sorrow. The newspaper reporter continues to stare, still not taking notes, while Khan, standing by the paddy wagon, watches in wonder. Despite his head bleeding profusely, Gandhi rises once more to his knees, takes a deep breath, and begins to search the ground for another card. His fingers finally find one, and he clutches it tightly. The sergeant, his face showing signs of uncertainty and confusion, watches as Gandhi painfully lifts the card and holds it over the fire before dropping it into the basket. The sergeant, with a firm yet reluctant motion, brings the billy club down again. The crowd holds its breath, and the newspaper reporter remains transfixed. The sergeant, drawing a deep breath and gripping the club, hesitates as he sees Gandhi feebly lift his head, his hands trembling and stained with his own blood, reaching for yet another card. Ba gently removes Gandhi's suit coat, her eyes filled with fear as she gazes at the bandage on his head and another along the side of his face. The room, lit by gas lamps and over-furnished in the Victorian style, provides a somber backdrop as Gandhi carefully sits on the bed, where newspapers, including some in English, are spread out. Ba reaches out, her touch gentle as she examines the bandages on his head. Before Gandhi can respond, a knock on the door interrupts them. A small, round ayah, an Indian nursemaid, opens the door and proudly ushers in Gandhi's sons: Harilal, aged ten, Manilal, aged six, and Ramdas, aged two. Dressed in European suits, ties, and stiff collars, the boys step forward one by one, performing the pranam, a Hindu gesture of greeting, before bending to touch their hands and lips to Gandhi's feet in a traditional show of respect from child to father. Gandhi smiles warmly, and Ramdas runs to him, prompting Gandhi to bend down and kiss him as Ramdas wraps his arms around his neck. The boys, accustomed to household discipline, bow and leave the room. The ayah closes the door behind them, and their chatter fades as they walk down the hall. Gandhi stretches out on the bed, picking up another newspaper, while Ba sits beside him, carefully maneuvering to tend to his bandage."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "She struggles briefly, but a constable restrains her. The sergeant turns to see Gandhi, bleeding from the head, kneeling and picking up another card. The crowd, including a newspaper reporter and Ba, watches intently. Gandhi lifts the card, and after a moment's hesitation, drops it into the basket. The sergeant, conflicted but resolute, strikes Gandhi again, visibly disturbed by his own actions. Ba weeps, the reporter observes silently, and Khan watches in awe. Despite his worsening condition, Gandhi rises, retrieves another card, and drops it into the basket, prompting another reluctant strike from the sergeant. The crowd remains breathless, and the sergeant hesitates as Gandhi, bloodied and trembling, reaches for yet another card. Meanwhile, Ba gently removes Gandhi's coat, revealing bandages on his head and face. In a gas-lit, Victorian-furnished room, Gandhi sits on a bed covered with newspapers, including English-language ones. Ba tenderly touches his bandages. A knock interrupts them, and an ayah proudly introduces Gandhi's sons—Harilal, Manilal, and Ramdas—dressed in European attire. They greet Gandhi with traditional gestures, and Ramdas runs to embrace him. Gandhi smiles, kisses Ramdas, and the boys leave with disciplined grace. The ayah closes the door, their chatter fading down the hall. Gandhi stretches out on the bed with a newspaper, while Ba sits beside him, tending to his bandage."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She fights loose, but one of the constables, part of the British colonial law enforcement in India, takes her firmly. The sergeant, whose authority reflects the tension between British rule and Indian nationalism, turns from the commotion to see that Gandhi, the prominent leader of the Indian independence movement, his head oozing blood, has crawled to his knees again and is picking up another card. The crowd, likely gathered as part of a nonviolent protest organized by Gandhi, watches. The newspaper reporter, representing the international scrutiny of British-Indian relations, watches. Ba stares in anguish. Gandhi lifts the card, likely a symbol of a prohibited action like burning identification cards. The sergeant stares at him, angry but his emotions somewhat in control after the first blow. An instant of hesitation, then Gandhi drops the card into the basket, an act of defiance against British authority. The sergeant almost stops, but he strikes again. A quiver of distaste at his own act crosses his face as Gandhi sags. Ba's anguished face is wet with tears. The newspaper reporter stares without making notes, perhaps stunned by the unfolding violence. Khan, at the paddy wagon used for transporting prisoners, watches in wonder. Gandhi, his head bleeding badly now, rises to his knees -- a breath and he gropes around the ground for another card. His fingers finally clutch one. The sergeant stares, his face wracked with uncertainty and confusion about the morality of his actions. Gandhi lifts the card and painfully holds it over the fire, then drops it in the basket. The sergeant slams the billy club down again -- firmly, but with a manifest reluctance. The crowd watches breathlessly, the newspaper reporter stares. The sergeant draws a breath, grasping the club, but he bites his lip as he sees Gandhi lift his head feebly, his shaking hands, stained with his own blood, groping for another card. Ba is gently removing Gandhi's suit coat, staring fearfully at a bandage on his head, another along the side of his face. The room is gas lit, a common feature of the time, over furnished in the Victorian manner popular among colonials. Gandhi sits carefully on the bed, where some newspapers are spread out, English-language ones among them. Ba reaches forth, gently touching the bandages on his head, which hide the wounds from the previous day's protest. Before Gandhi can retort there is a knock on the door. A small, round ayah, an Indian nursemaid employed by many colonial households, pushes open the door and proudly admits her charges, Gandhi's sons: Harilal (ten), Manilal (six), and Ramdas (two). They are all dressed in European suits, ties, and stiff collars, a reflection of the cultural assimilation of the period. They step forward, one by one, making the pranam, the Hindu gesture of greeting, then bending and touching the hands and lips to Gandhi's feet in the traditional obeisance of child to father. Gandhi smiles. And Ramdas runs to him and Gandhi bends to kiss him as Ramdas puts his arms around his neck. The boys bow and leave like boys used to household discipline prevalent in that era. The ayah closes the door and we hear their chatter as they go down the hall. Gandhi is stretching out on the bed, taking up another paper, perhaps contemplating the next move in his campaign for Indian self-rule. Ba comes and sits down on the bed beside him, maneuvering so that she can get at the bandage."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "She fights loose but one of the constables takes her firmly. The sergeant turns from the commotion to see that Gandhi his head oozing blood has crawled to his knees again and is picking up another card. The crowd watches. The newspaper reporter watches. Ba stares in anguish. Gandhi lifts the card. The sergeant stares at him angry but his emotions somewhat in control after the first blow. An instant of hesitation. then Gandhi drops the card into the basket. The sergeant almost stops but he strikes again. A quiver of distaste at his own act crosses his face as Gandhi sags. Ba's anguished face is wet with tears. The newspaper reporter stares without making notes. Khan at the paddy wagon watches in wonder. Gandhi his head bleeding badly now rises to his knees  a breath and he gropes around the ground for another card. His fingers finally clutch one. The sergeant stares his face wracked with uncertainty and confusion. Gandhi lifts the card and painfully holds it over the fire then drops it in the basket. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. The sergeant slams the billy club down again  firmly but with a manifest reluctance. The crowd watches breathlessly. the newspaper reporter stares. The sergeant draws a breath grasping the club but he bites his lip as he sees Gandhi lift his head feebly his shaking hands stained with his own blood groping for another card. Ba is gently removing Gandhi's suit coat staring fearfully at a bandage on his head another along the side of his face. The room is gas lit over furnished in the Victorian manner. Gandhi sits carefully on the bed where some newspapers are spread out Englishlanguage ones among them. Ba reaches forth gently touching the bandages on his head. Before Gandhi can retort there is a knock on the door. A small round ayah an Indian nursemaid pushes open the door and proudly admits her charges. Gandhi's sons Harilal ten Manilal six and Ramdas two. They are all dressed in European suits ties and stiff collars. They step forward one by one making the pranam the Hindu gesture of greeting then bending and touching the hands and lips to Gandhi's feet in the traditional obeisance of child to father. Gandhi smiles. And Ramdas runs to him and Gandhi bends to kiss him as Ramdas puts his arms around his neck. The boys bow and leave like boys used to household discipline. The ayah closes the door and we hear their chatter as they go down the hall. Gandhi is stretching out on the bed taking up another paper. Ba comes and sits down on the bed beside him maneuvering so that she can get at the bandage."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "She fights loose but one of the constables takes her firmly. The sergeant turns from the commotion to see that Gandhi his head oozing blood has crawled to his knees again and is picking up another card. The crowd watches. The newspaper reporter watches. Ba stares in anguish. Gandhi lifts the card. The sergeant stares at him angry but his emotions somewhat in control after the first blow. An instant of hesitation. then Gandhi drops the card into the basket. The sergeant almost stops but he strikes again. A quiver of distaste at his own act crosses his face as Gandhi sags. Ba's anguished face is wet with tears. The newspaper reporter stares without making notes. Khan at the paddy wagon watches in wonder. Gandhi his head bleeding badly now rises to his knees  a breath and he gropes around the ground for another card. His fingers finally clutch one. The sergeant stares his face wracked with uncertainty and confusion. Gandhi lifts the card and painfully holds it over the fire then drops it in the basket. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. The sergeant slams the billy club down again  firmly but with a manifest reluctance. The crowd watches breathlessly. the newspaper reporter stares. The sergeant draws a breath grasping the club but he bites his lip as he sees Gandhi lift his head feebly his shaking hands stained with his own blood groping for another card. Ba is gently removing Gandhi's suit coat staring fearfully at a bandage on his head another along the side of his face. The room is gas lit over furnished in the Victorian manner. Gandhi sits carefully on the bed where some newspapers are spread out Englishlanguage ones among them. Ba reaches forth gently touching the bandages on his head. Before Gandhi can retort there is a knock on the door. A small round ayah an Indian nursemaid pushes open the door and proudly admits her charges. Gandhi's sons Harilal ten Manilal six and Ramdas two. They are all dressed in European suits ties and stiff collars. They step forward one by one making the pranam the Hindu gesture of greeting then bending and touching the hands and lips to Gandhi's feet in the traditional obeisance of child to father. Gandhi smiles. And Ramdas runs to him and Gandhi bends to kiss him as Ramdas puts his arms around his neck. The boys bow and leave like boys used to household discipline. The ayah closes the door and we hear their chatter as they go down the hall. Gandhi is stretching out on the bed taking up another paper. Ba comes and sits down on the bed beside him maneuvering so that she can get at the bandage."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "She fights loose but one of the constables takes her firmly. The sergeant turns from the commotion to see that Gandhi his head oozing blood has crawled to his knees again and is picking up another card. The crowd watches. The newspaper reporter watches. Ba stares in anguish. Gandhi lifts the card. The sergeant stares at him angry but his emotions somewhat in control after the first blow. An instant of hesitation. then Gandhi drops the card into the basket. A small round ayah an Indian nursemaid pushes open the door and proudly admits her charges. Gandhi's sons Harilal ten Manilal six and Ramdas two. They are all dressed in European suits ties and stiff collars. They step forward one by one making the pranam the Hindu gesture of greeting then bending and touching the hands and lips to Gandhi's feet in the traditional obeisance of child to father. Gandhi smiles. And Ramdas runs to him and Gandhi bends to kiss him as Ramdas puts his arms around his neck. The boys bow and leave like boys used to household discipline. The ayah closes the door and we hear their chatter as they go down the hall. Gandhi is stretching out on the bed taking up another paper. Ba comes and sits down on the bed beside him maneuvering so that she can get at the bandage."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "She fights loose but one of the constables takes her firmly. The sergeant turns from the commotion to see that Gandhi his head oozing blood has crawled to his knees again and is picking up another card. The crowd watches. The newspaper reporter watches. The boys bow and leave like boys used to household discipline. The ayah closes the door and we hear their chatter as they go down the hall. Gandhi is stretching out on the bed taking up another paper. Ba comes and sits down on the bed beside him maneuvering so that she can get at the bandage."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "She tumbles free, but one of the gardeners grips her gently. The teacher swivels away from the ruckus to notice that Newton, his nose leaking ink, has slithered to his feet again and is grasping a different spoon. The audience observes. The weather forecaster observes. Sam gazes in sorrow. Newton hoists the spoon. The teacher gawks at him, irritated but his sensations somewhat restrained after the first kick. A moment of indecision, then Newton throws the spoon into the bucket. The teacher nearly hesitates, but he kicks anew. A tremor of distaste at his own deed crosses his face as Newton collapses. Sam's sorrowful face is damp with raindrops. The weather forecaster gazes without jotting down notes. Yusef, at the tricycle, observes in amazement. Newton, his nose dripping profusely now, climbs to his feet -- a gasp and he fumbles around the dirt for another spoon. His toes eventually grasp one. The teacher gawks, his expression contorted with doubt and bewilderment. Newton lifts the spoon and painfully holds it over the candle, then drops it in the bucket. The teacher slams the ruler down again -- gently, but with a clear unwillingness. The audience observes breathlessly, the weather forecaster gazes. The teacher exhales, gripping the ruler, but he chews his fingernail as he watches Newton raise his chin weakly, his quivering toes, stained with his own ink, searching for another spoon. Sam is softly removing Newton's wool coat, gazing anxiously at a wrap on his nose, another along the edge of his cheek. The chamber is candlelit, over adorned in the Edwardian style. Newton perches cautiously on the hammock, where some magazines are strewn about, French-language ones among them. Sam reaches over, delicately touching the wraps on his nose. Before Newton can respond there is a tap on the curtain. A tiny, square artist (a European painter) nudges aside the curtain and proudly escorts her pupils, Newton's daughters: Leah (eight), Rachel (five), and Martha (three). They are all dressed in Chinese dresses, scarves, and soft caps. They glide forth, one by one, making the curtsy (the traditional gesture of welcome), then bowing and pressing the toes and ears to Newton's knees in the customary reverence of offspring to parent. Newton grins. And Martha darts to him and Newton leans to kiss her as Martha wraps her arms around his waist. The daughters curtsy and exit like children accustomed to familial protocols. The artist shuts the curtain and we hear their lilting as they drift through the corridor. Newton is reclining on the hammock, picking up another magazine. Sam approaches and settles onto the hammock beside him, adjusting so she can reach at the wrap."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A constable restrains a struggling woman as a sergeant watches Gandhi, bleeding, pick up another card. Despite the sergeant's initial anger and hesitation, Gandhi drops the card into a basket. Although conflicted, the sergeant strikes him again, displaying a momentary distaste. Gandhi, heavily bleeding, remains determined, finding another card and dropping it into the fire, prompting the sergeant to hit him reluctantly. The crowd, including a reporter and Khan, observes intently. Ba, in tears, removes Gandhi's coat, revealing his bandaged wounds. Later, in a Victorian-furnished room, Ba tends to Gandhi's bandages. Their sons, dressed in European attire, enter, greeting Gandhi with the traditional pranam before leaving. As they depart, Gandhi relaxes on the bed, reading a newspaper, while Ba adjusts his bandage."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Ba comes and sits down on the bed beside him maneuvering so that she can get at the bandage Gandhi is stretching out on the bed taking up another paper  The ayah closes the door and we hear their chatter as they go down the hall  The boys bow and leave like boys used to household discipline  And Ramdas runs to him and Gandhi bends to kiss him as Ramdas puts his arms around his neck  Gandhi smiles  They step forward one by one making the pranam the Hindu gesture of greeting then bending and touching the hands and lips to Gandhi's feet in the traditional obeisance of child to father  They are all dressed in European suits ties and stiff collars  Gandhi's sons Harilal ten Manilal six and Ramdas two  A small round ayah an Indian nursemaid pushes open the door and proudly admits her charges  Before Gandhi can retort there is a knock on the door  Ba reaches forth gently touching the bandages on his head  Gandhi sits carefully on the bed where some newspapers are spread out Englishlanguage ones among them  The room is gas lit over furnished in the Victorian manner  Ba is gently removing Gandhi's suit coat staring fearfully at a bandage on his head another along the side of his face  The sergeant draws a breath grasping the club but he bites his lip as he sees Gandhi lift his head feebly his shaking hands stained with his own blood groping for another card  the newspaper reporter stares  The crowd watches breathlessly  The sergeant slams the billy club down again  firmly but with a manifest reluctance  Gandhi lifts the card and painfully holds it over the fire then drops it in the basket  The sergeant stares his face wracked with uncertainty and confusion  His fingers finally clutch one  Gandhi his head bleeding badly now rises to his knees  a breath and he gropes around the ground for another card  Khan at the paddy wagon watches in wonder  The newspaper reporter stares without making notes  Ba's anguished face is wet with tears  A quiver of distaste at his own act crosses his face as Gandhi sags  The sergeant almost stops but he strikes again  then Gandhi drops the card into the basket  An instant of hesitation  The sergeant stares at him angry but his emotions somewhat in control after the first blow  Gandhi lifts the card  Ba stares in anguish  The newspaper reporter watches  The crowd watches  The sergeant turns from the commotion to see that Gandhi his head oozing blood has crawled to his knees again and is picking up another card  She fights loose but one of the constables takes her firmly "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The sergeant turns from the commotion to see that Gandhi his head oozing blood has crawled to his knees again and is picking up another card She fights loose but one of the constables takes her firmly The newspaper reporter watches The crowd watches Gandhi lifts the card Ba stares in anguish An instant of hesitation The sergeant stares at him angry but his emotions somewhat in control after the first blow The sergeant almost stops but he strikes again then Gandhi drops the card into the basket Ba's anguished face is wet with tears A quiver of distaste at his own act crosses his face as Gandhi sags Khan at the paddy wagon watches in wonder The newspaper reporter stares without making notes His fingers finally clutch one Gandhi his head bleeding badly now rises to his knees  a breath and he gropes around the ground for another card Gandhi lifts the card and painfully holds it over the fire then drops it in the basket The sergeant stares his face wracked with uncertainty and confusion The crowd watches breathlessly The sergeant slams the billy club down again  firmly but with a manifest reluctance The sergeant draws a breath grasping the club but he bites his lip as he sees Gandhi lift his head feebly his shaking hands stained with his own blood groping for another card the newspaper reporter stares The room is gas lit over furnished in the Victorian manner Ba is gently removing Gandhi's suit coat staring fearfully at a bandage on his head another along the side of his face Ba reaches forth gently touching the bandages on his head Gandhi sits carefully on the bed where some newspapers are spread out Englishlanguage ones among them A small round ayah an Indian nursemaid pushes open the door and proudly admits her charges Before Gandhi can retort there is a knock on the door They are all dressed in European suits ties and stiff collars Gandhi's sons Harilal ten Manilal six and Ramdas two Gandhi smiles They step forward one by one making the pranam the Hindu gesture of greeting then bending and touching the hands and lips to Gandhi's feet in the traditional obeisance of child to father The boys bow and leave like boys used to household discipline And Ramdas runs to him and Gandhi bends to kiss him as Ramdas puts his arms around his neck Gandhi is stretching out on the bed taking up another paper The ayah closes the door and we hear their chatter as they go down the hall Ba comes and sits down on the bed beside him maneuvering so that she can get at the bandage"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The crowd watches breathlessly  the newspaper reporter stares  The sergeant draws a breath grasping the club but he bites his lip as he sees Gandhi lift his head feebly his shaking hands stained with his own blood groping for another card  Ba is gently removing Gandhi's suit coat staring fearfully at a bandage on his head another along the side of his face  The room is gas lit over furnished in the Victorian manner  Gandhi sits carefully on the bed where some newspapers are spread out Englishlanguage ones among them  Ba reaches forth gently touching the bandages on his head  Before Gandhi can retort there is a knock on the door  A small round ayah an Indian nursemaid pushes open the door and proudly admits her charges  Gandhi's sons Harilal ten Manilal six and Ramdas two  They are all dressed in European suits ties and stiff collars  They step forward one by one making the pranam the Hindu gesture of greeting then bending and touching the hands and lips to Gandhi's feet in the traditional obeisance of child to father  Gandhi smiles  And Ramdas runs to him and Gandhi bends to kiss him as Ramdas puts his arms around his neck  The boys bow and leave like boys used to household discipline  The ayah closes the door and we hear their chatter as they go down the hall  Gandhi is stretching out on the bed taking up another paper  Ba comes and sits down on the bed beside him maneuvering so that she can get at the bandage She fights loose but one of the constables takes her firmly  The sergeant turns from the commotion to see that Gandhi his head oozing blood has crawled to his knees again and is picking up another card  The crowd watches  The newspaper reporter watches  Ba stares in anguish  Gandhi lifts the card  The sergeant stares at him angry but his emotions somewhat in control after the first blow  An instant of hesitation  then Gandhi drops the card into the basket  The sergeant almost stops but he strikes again  A quiver of distaste at his own act crosses his face as Gandhi sags  Ba's anguished face is wet with tears  The newspaper reporter stares without making notes  Khan at the paddy wagon watches in wonder  Gandhi his head bleeding badly now rises to his knees  a breath and he gropes around the ground for another card  His fingers finally clutch one  The sergeant stares his face wracked with uncertainty and confusion  Gandhi lifts the card and painfully holds it over the fire then drops it in the basket  The sergeant slams the billy club down again  firmly but with a manifest reluctance "
        }
      ]
    }
  ]
}