{
  "ground_truth": "He turns and waves to the parlor window, where the three boys are — all bigger — and Ba holds a new addition; they all wave. Gandhi turns back and starts down the long, hilly street, gesturing Charlie on and starting to walk. Charlie nods uncertainly, looks back at the cab in confusion, signals the driver to follow, and hurries on to match strides with Gandhi's brisk pace. They come to a turning, nearer to town, where the area is poorer and run-down. Ahead of them, three youths in working clothes, carrying lunch boxes, lean indolently against a building directly in their path. They react to the sight of Gandhi — fun — and stride the pavement menacingly. One of them tosses aside his cigarette, and Gandhi restrains him and shakes his head. Gandhi starts to move forward. Charlie hesitates, then follows nervously, more nervous for Gandhi than himself. They are getting closer, with the youths laughing and whispering. One youth has flicked his cigarette hard, and it lands at Gandhi's feet. Gandhi pauses, looking at the youth, then starts forward again, almost on the youths, clearly frightened but determined. As he reaches forth to haul Gandhi from the pavement, a woman leans out of an upstairs window, looking down at the fracas disconcertedly. It is the first youth's mother, and her presence reduces the pitch of his hostility considerably. A snickering response comes from the other youths, who are embarrassed by the questioning disapproval of the mother's attitude. Gandhi steps back on the pavement, addressing the first youth, and steps around him, Charlie trailing, as the first youth stares at them sullenly. As they stride on, Charlie glances back, and Gandhi laughs as they turn the corner. They enter a busy street in the center of the town. Gandhi and Charlie come around the corner into it, and he pauses before an office where a young girl, Sonja, has come out to speak to him about something of urgency, but she hovers, not interrupting. He turns to Sonja, whose tone is loaded with foreboding, and Gandhi absorbs the news stiffly. Meanwhile, a strong masculine hand scrawls a signature across a document. Beneath the signature is the boldly printed identification: Jan Christian Smuts. A cameraman records the moment with a flash photo. General Smuts, whose presence matches his office, addresses someone out of shot as a male secretary removes the document. The reporter standing opposite him is Walker, much younger, almost boyish compared to the way we saw him at the funeral. Smuts has risen, knowing how to concede with grace. The gaze is firm, strong, and cynical, as the sides are half up, but it is dusty and hot.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He rotates and waves to the lounge window, where the three lads are — all larger — and Ba holds a recent addition; they all wave. Gandhi turns back and commences down the lengthy, sloping road, motioning Charlie on and beginning to stroll. Charlie nods hesitantly, glances back at the taxi in bewilderment, signals the chauffeur to follow, and rushes on to match steps with Gandhi's swift gait. They arrive at a corner, nearer to town, where the vicinity is poorer and dilapidated. Ahead of them, three youths in working attire, bearing lunch containers, recline lazily against a structure directly in their route. They react to the view of Gandhi — amusement — and stride the sidewalk threateningly. One of them flicks away his cigarette, and Gandhi detains him and shakes his head. Gandhi commences to proceed forward. Charlie wavers, then follows anxiously, more uneasy for Gandhi than himself. They are approaching, with the youths chuckling and whispering. One youth has flicked his cigarette forcefully, and it lands at Gandhi's feet. Gandhi halts, observing the youth, then proceeds forward again, almost upon the youths, clearly terrified but resolute. As he extends forth to pull Gandhi from the sidewalk, a woman leans out of an upstairs window, looking down at the commotion disconcertedly. It is the first youth's mother, and her presence diminishes the intensity of his aggression considerably. A snickering reaction comes from the other youths, who are embarrassed by the examining disapproval of the mother's demeanor. Gandhi steps back on the sidewalk, addressing the first youth, and steps around him, Charlie following, as the first youth glares at them sulkily. As they pace on, Charlie glances back, and Gandhi chuckles as they turn the corner. They enter a bustling street in the heart of the town. Gandhi and Charlie come around the corner into it, and he pauses before an establishment where a young girl, Sonja, has emerged to speak to him about something of urgency, but she hovers, not interrupting. He turns to Sonja, whose tone is laden with foreboding, and Gandhi absorbs the news rigidly. Meanwhile, a strong masculine hand scribbles a signature across a document. Beneath the signature is the boldly printed identification: Jan Christian Smuts. A cameraman captures the moment with a flash photograph. General Smuts, whose presence matches his office, addresses someone out of view as a male secretary removes the document. The reporter standing opposite him is Walker, much younger, almost youthful compared to the way we saw him at the funeral. Smuts has risen, knowing how to yield with grace. The gaze is firm, strong, and cynical, as the margins are half up, but it is dusty and hot."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He turns and waves to the parlor window, where a new addition is held by Ba; they all wave. Gandhi is turned back to and a start down the long, hilly street is made by him, with Charlie being gestured on and walking being started. An uncertain nod is given by Charlie, and he looks back at the cab in confusion, signals the driver to follow, and hurries on to match strides with Gandhi's brisk pace. They are met with a turning closer to town, where the area is poorer and run-down. Ahead of them, three youths in working clothes, who carry lunch boxes, indolently lean against a building directly in their path. The sight of Gandhi is reacted to by them — fun — and the pavement is strode by them menacingly. A cigarette is tossed aside by one of them, and he is restrained by Gandhi, who shakes his head. A forward move is started by Gandhi. A hesitation takes place by Charlie, then nervously following is done by him, more nervous for Gandhi than himself. As they become closer, laughter and whispering come from the youths. The cigarette is flicked hard by one youth, and it lands at Gandhi's feet. A pause is made by Gandhi, who looks at the youth, then a forward move is started again, almost on the youths, clearly frightened but determined. As Gandhi is reached for by the youth to be hauled from the pavement, an upstairs window is leaned out of by a woman, who looks down at the fracas disconcertedly. The mother of the first youth is revealed to be her, and his hostility is considerably reduced by her presence. Snickering responses are given by the other youths, who are embarrassed by the questioning disapproval of the mother's attitude. The pavement is stepped back on by Gandhi, who addresses the first youth, and around him is stepped by Gandhi, Charlie following, as the first youth stares at them sullenly. Striding on is done by them, with a glance back being cast by Charlie, and laughter is shared by Gandhi as the corner is turned by them. A busy street in the center of the town is entered by them. The corner is rounded into by Gandhi and Charlie, a pause is made by him before an office where something of urgency is spoken about by a young girl, Sonja, but her hovering prevents interruption. He turns to Sonja, whose tone is loaded with foreboding, and stiff absorption of the news is done by Gandhi. Meanwhile, a strong masculine hand scrawls a signature across a document. Beneath the signature is the boldly printed identification: Jan Christian Smuts. A moment is recorded by a cameraman with a flash photo. General Smuts, whose presence matches his office, addresses someone out of shot as a male secretary removes the document. Opposite him is the reporter Walker, much younger, almost boyish compared to the way we saw him at the funeral. Smuts rises, knowing how to concede with grace. The gaze is made firm, strong, and cynical, as the sides are half up, but dust and heat are pervasive."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Gandhi waves to the parlor window where Ba and the three bigger boys, with a new addition, wave back. He turns and starts down the hilly street, signaling Charlie to follow. Charlie nods, confused, gestures the cab driver, and hurries to match Gandhi's brisk pace. Nearing town, the area is poorer, and three youths lean against a building ahead, reacting to Gandhi with menace. One flicks his cigarette toward Gandhi, who pauses, then continues, determined yet scared. As one youth approaches Gandhi, his mother appears at an upstairs window, reducing his hostility. Gandhi addresses him and steps around, with Charlie trailing. They turn the corner, and Gandhi laughs as they enter a busy street. A young girl, Sonja, emerges to speak urgently, but hesitates. Gandhi listens, absorbing troubling news. Meanwhile, Jan Christian Smuts signs a document as a cameraman captures the moment. General Smuts, strong and cynical, addresses someone unseen, as Walker, much younger now, stands opposite him. Smuts concedes with grace, in a hot, dusty environment."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Gandhi waves to the parlor window at the three boys and Ba with a new addition. He begins down the hilly street, urging Charlie to follow, who hesitantly signals the cab driver and walks with Gandhi. In a poorer part of town, three youths lean against a building, reacting threateningly to Gandhi. One discards their cigarette, but Gandhi restrains him and moves forward. A woman leans from a window, reducing her son's hostility. Gandhi and Charlie pass, with the youths embarrassed by the mother's disapproval. Gandhi laughs with Charlie as they enter a busy street, meeting Sonja with urgent news that Gandhi processes seriously. Meanwhile, General Smuts signs a document, recorded by a cameraman, as Walker observes. Smuts acknowledges with a firm, cynical gaze."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He turns graciously and sends a friendly wave toward the parlor window, where the three boys—now all bigger and more grown than before—are gathered together. Ba is there as well, tenderly cradling a new addition to the family. They all raise their hands in a warm, collective wave. Gandhi, with a mindful air, turns back and begins his journey down the lengthy, hilly street. He gestures for Charlie to join him, setting a brisk pace as he starts to walk. Charlie, feeling uncertain, nods slightly, casting a confused glance back at the waiting cab. He quickly signals the driver to follow along and hurries to match the brisk strides of Gandhi.\n\nAs they proceed, they come to a turning point nearer to the heart of the town, an area that appears poorer and somewhat run-down. Ahead of them, three youths dressed in working clothes, each carrying a lunch box, stand idly leaning against a building directly in their path. Their posture is languid, and they react with amusement to the sight of Gandhi, stepping onto the pavement with a menacing stride. One of them, with a casual flick, tosses aside his cigarette. Gandhi, ever the peacemaker, gently restrains the youth and shakes his head as a gesture of admonition. Gandhi then starts to move forward again. Charlie hesitates for a moment, feeling a growing nervousness more for Gandhi's safety than his own, and then follows apprehensively. \n\nThe gap closes between them and the youths, who are snickering and murmuring among themselves. One of the youths flicks his cigarette forcefully, causing it to land at Gandhi's feet. Gandhi pauses momentarily, looking at the youth with a composed gaze, before moving forward once more. He approaches the youths, clearly frightened yet resolutely determined. Just as one youth reaches out to pull Gandhi from the path, a woman leans out of an upstairs window, looking down at the scene with disconcerted eyes. It turns out to be the first youth's mother, whose presence significantly diminishes the intensity of his hostility. Laughter, mixed with embarrassment, is heard from the other youths, who are visibly unsettled by the mother's questioning disapproval.\n\nGandhi steps back onto the pavement, calmly addressing the first youth, then steps around him as Charlie follows closely behind. The first youth watches them go with a sullen stare. As they continue on their way, Charlie glances back, and Gandhi, with a light heart, chuckles as they turn the corner. They find themselves entering a bustling street located at the center of the town. As Gandhi and Charlie come around the corner, he pauses purposefully before an office, where a young girl, Sonja, emerges to speak with him about something urgent. However, she hovers nearby, not wishing to interrupt. Gandhi turns his attention to Sonja, whose voice carries a tone heavy with foreboding. Gandhi listens intently, absorbing the news with a stiff demeanor.\n\nMeanwhile, elsewhere, a strong masculine hand swiftly scrawls a signature across an important document. Beneath this bold signature is the prominently printed identification: Jan Christian Smuts. A cameraman captures the moment with a brilliant flash photo. General Smuts, whose commanding presence is fitting for his office, addresses someone out of the camera's view as a male secretary retrieves the document. The reporter standing across from him is Walker, noticeably younger and almost boyish compared to the way he appeared at the funeral earlier. Smuts has stood up, demonstrating his ability to concede with a certain grace. His gaze is steady and strong, carrying a tinge of cynicism. The sides of the area are half up, and the environment is dusty and oppressively hot."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He graciously turns on his heel and sends a warm, friendly wave toward the parlor window, where the three boys—each one now noticeably bigger and more mature than before—are gathered together. Ba is present as well, tenderly cradling the newest addition to their family. In unison, they all raise their hands in a warm, collective wave. Gandhi, with his characteristic mindful air, turns back to his path and begins his journey down the lengthy, hilly street. With a gesture, he encourages Charlie to join him, setting a brisk pace as he confidently strides forward. Charlie, feeling a bit uncertain, nods slightly, casting a confused glance back at the waiting cab. He quickly signals for the driver to follow along and hurries to match Gandhi's brisk strides.\n\nAs they continue, they approach a turning point closer to the heart of the town, an area that appears poorer and somewhat run-down. Ahead of them, three youths dressed in working clothes, each carrying a lunch box, stand idly leaning against a building directly in their path. Their posture is languid and relaxed, and they react with a certain amusement to Gandhi's presence, stepping onto the pavement with a menacing kind of stride. One of them, with a casual flick of his wrist, tosses aside his cigarette. Gandhi, ever the peacemaker, gently restrains the youth and shakes his head as a gesture of admonition. Gandhi then begins to move forward again. Charlie hesitates momentarily, feeling a growing sense of nervousness for Gandhi's safety more than for his own, and then follows with a sense of apprehension.\n\nThe gap between them and the youths continues to close, the youths snickering and murmuring among themselves. One of the youths flicks his cigarette forcefully, causing it to land directly at Gandhi's feet. Gandhi pauses, looking at the youth with a composed and steady gaze, before moving forward once more. He approaches the youths, clearly frightened yet resolutely determined. Just as one youth reaches out with an intention to pull Gandhi from the path, a woman leans out of an upstairs window, looking down at the unfolding scene with disconcerted eyes. It turns out to be the first youth's mother, her presence significantly diminishing the intensity of his hostility. Laughter, mixed with embarrassment, echoes from the other youths, who are visibly unsettled by the mother's questioning disapproval.\n\nGandhi steps back onto the pavement, calmly addressing the first youth, then steps around him as Charlie follows closely behind. The first youth watches them go with a sullen stare on his face. As they continue on their way, Charlie glances back, and Gandhi, with a light heart, chuckles softly as they turn the corner. They find themselves entering a bustling street located at the very center of the town. As Gandhi and Charlie come around the corner, he pauses purposefully before an office, where a young girl named Sonja emerges to speak with him about something of apparent urgency. However, she hovers nearby, not wishing to interrupt. Gandhi turns his attention to Sonja, whose voice carries a weighty tone heavy with foreboding. Gandhi listens intently, absorbing the news with a stiff and thoughtful demeanor.\n\nMeanwhile, elsewhere, a strong masculine hand swiftly scrawls a signature across an important document. Beneath this bold signature is the prominently printed identification: Jan Christian Smuts. A cameraman captures the moment with a brilliant flash photo. General Smuts, whose commanding presence is perfectly fitting for his esteemed office, addresses someone out of the camera's view as a male secretary retrieves the document. The reporter standing across from him is Walker, noticeably younger and almost boyish compared to the way he appeared at the funeral earlier. Smuts has stood up, demonstrating his ability to concede with a certain grace. His gaze is steady and strong, carrying with it a tinge of cynicism. The sides of the area are half up, and the environment is dusty and oppressively hot."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As he turns towards the parlor window, he waves cheerfully to the three boys inside, each of whom is larger than before, while Ba holds a new addition in her arms; they respond with waves of their own. He then shifts his attention back to the street and sets off down the long, hilly road, signaling for Charlie to follow along as he begins to walk with steady determination. Charlie, with a face of uncertainty, glances back at the cab with confusion, making a quick decision to signal the driver to trail them before hurrying to sync his steps with Gandhi's brisk pace. They soon approach a turning, drawing nearer to the town, where the surroundings take on a noticeably poorer and more rundown appearance. Ahead, three young men clad in work clothes and gripping lunch boxes lean lazily against a building that stands directly in their path. At the sight of Gandhi, a sense of amusement lights up their faces, prompting them to stride across the pavement in a manner that appears menacing. One of the youths casually flicks his cigarette aside, and Gandhi, with a controlled gesture, reaches out to gently restrain him, shaking his head in silent disapproval before continuing to move forward. Charlie hesitates momentarily but then follows, his nervousness more pronounced for Gandhi’s safety than his own. As they draw nearer, the youths break into laughter and whisper among themselves, and the flicked cigarette lands at Gandhi's feet. Gandhi pauses momentarily, casting a calm yet firm gaze in the youth's direction before resolutely moving forward again. As one of the youths reaches out, seemingly intent on dragging Gandhi off the pavement, a woman suddenly leans out from an upstairs window, observing the scene below with a mix of disconcertment and authority. Her presence, being the first youth's mother, significantly diminishes his aggressive demeanor. The other youths, feeling the sting of embarrassment under the mother's disapproving watch, respond with snickers. Gandhi steps back onto the pavement, addressing the first youth directly before calmly stepping around him, with Charlie following closely behind, while the first youth watches them with a sullen look. As they continue on their way, Charlie steals a glance backward, and Gandhi, now amused, breaks into laughter as they turn the corner. They emerge onto a bustling street in the heart of the town. Upon rounding the corner, Gandhi pauses in front of an office where a young girl named Sonja stands, clearly intending to relay something urgent. Her presence signals a grave matter, and Gandhi turns to face her, absorbing the loaded tone of her words with a composed, yet visibly stiff demeanor. Meanwhile, within a nearby office, a strong masculine hand briskly scrawls a signature across a document, the name boldly identified as Jan Christian Smuts. A cameraman captures this moment with a flash photo as General Smuts, exuding an air befitting his authority, addresses someone just outside the camera’s view while a male secretary efficiently removes the signed document. Standing opposite is a reporter named Walker, considerably younger and almost boyish in comparison to the older visage seen at the funeral. Smuts stands, a figure of graceful concession, his expression firm, strong, and laced with cynicism, even as the environment around them remains dusty and swelteringly hot."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Gandhi waves to the parlor window, acknowledging the three boys and Ba with a new addition, who wave back. He then starts walking down the long, hilly street with a gesture for Charlie to follow. Charlie, slightly confused, signals the cab driver to follow and hurries to match Gandhi’s brisk pace. As they enter a poorer area of town, they encounter three youths lounging against a building. The youths react to Gandhi's presence with amusement and move assertively toward him. Gandhi calmly restrains one youth who flicks a cigarette, shaking his head disapprovingly. Despite being nervous, Charlie follows Gandhi's determined advance. The tension eases when the mother of one youth leans out of a window, causing the youths to reconsider their hostility. Gandhi addresses the first youth and steps around him with Charlie trailing. As they move on, Gandhi laughs at Charlie’s glance back, and they turn a corner into a bustling town street. Here, Sonja approaches Gandhi with urgent news, which he receives with a serious demeanor. Concurrently, General Jan Christian Smuts signs a document, captured by a cameraman, while his secretary removes the document. Walker, appearing much younger than at the funeral, stands opposite Smuts, who maintains a firm, cynical gaze despite the dusty, hot environment."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He turns and waves to the parlor window, where the three boys are — all bigger — and Ba holds a new addition; they all wave. Gandhi, known for his philosophy of nonviolent resistance and recently visiting this town as part of his campaign, turns back and starts down the long, hilly street, gesturing Charlie on and starting to walk. Charlie nods uncertainly, looks back at the cab in confusion, signals the driver to follow, and hurries on to match strides with Gandhi's brisk pace, which often surprised people given his age and frail appearance. They come to a turning, nearer to town, where the area is poorer and run-down, reminiscent of many urban areas Gandhi had visited in his efforts to support the underprivileged. Ahead of them, three youths in working clothes, typical of the local labor force, carrying lunch boxes, lean indolently against a building directly in their path. They react to the sight of Gandhi — fun — and stride the pavement menacingly, a common reaction from those unfamiliar with Gandhi's peaceful demeanor. One of them tosses aside his cigarette, and Gandhi, who abhors smoking for its health impacts, restrains him and shakes his head. Gandhi starts to move forward. Charlie hesitates, then follows nervously, more nervous for Gandhi than himself, aware of the volatile nature of such confrontations. They are getting closer, with the youths laughing and whispering, reminiscent of schoolyard bullies but with a more dangerous edge. One youth has flicked his cigarette hard, and it lands at Gandhi's feet, an act of disrespect usually aimed at provoking a reaction. Gandhi pauses, looking at the youth, then starts forward again, almost on the youths, clearly frightened but determined, embodying his creed of facing hostility with courage. As he reaches forth to haul Gandhi from the pavement, a woman leans out of an upstairs window, looking down at the fracas disconcertedly. It is the first youth's mother, and her presence reduces the pitch of his hostility considerably, revealing the often unnoticed influence of parental authority. A snickering response comes from the other youths, who are embarrassed by the questioning disapproval of the mother's attitude, cutting through the bravado. Gandhi steps back on the pavement, addressing the first youth with his characteristic calm, and steps around him, Charlie trailing, as the first youth stares at them sullenly, his earlier bravado now deflated. As they stride on, Charlie glances back, and Gandhi laughs as they turn the corner, revealing his ability to find light even in tense situations. They enter a busy street in the center of the town, the hustle and bustle indicative of economic activity despite the surrounding poverty. Gandhi and Charlie come around the corner into it, and he pauses before an office where a young girl, Sonja, has come out to speak to him about something of urgency, but she hovers, not interrupting, aware of the weight her message carries. He turns to Sonja, whose tone is loaded with foreboding, and Gandhi absorbs the news stiffly, his expression betraying the gravity of the situation. Meanwhile, a strong masculine hand scrawls a signature across a document. Beneath the signature is the boldly printed identification: Jan Christian Smuts, a prominent South African statesman known for his complex relationship with Gandhi. A cameraman records the moment with a flash photo, capturing a moment of historical significance. General Smuts, whose presence matches his office, addresses someone out of shot as a male secretary removes the document, symbolizing the administrative power plays of the era. The reporter standing opposite him is Walker, much younger, almost boyish compared to the way we saw him at the funeral, his career seemingly just beginning. Smuts has risen, knowing how to concede with grace, reflecting his political acumen. The gaze is firm, strong, and cynical, as the sides are half up, but it is dusty and hot, a reminder of the challenging conditions endured by those involved in the struggle."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "they all wave He turns and waves to the parlor window where the three boys are — all bigger — and Ba holds a new addition Gandhi starts to move forward they all wave Gandhi and Charlie come around the corner into it and he pauses before an office where a young girl Sonja has come out to speak to him about something of urgency but she hovers not interrupting Gandhi turns back and starts down the long hilly street gesturing Charlie on and starting to walk Charlie nods uncertainly looks back at the cab in confusion signals the driver to follow and hurries on to match strides with Gandhi's brisk pace They come to a turning nearer to town where the area is poorer and rundown Ahead of them three youths in working clothes carrying lunch boxes lean indolently against a building directly in their path They react to the sight of Gandhi — fun — and stride the pavement menacingly The reporter standing opposite him is Walker much younger almost boyish compared to the way we saw him at the funeral One of them tosses aside his cigarette and Gandhi restrains him and shakes his head Gandhi starts to move forward Charlie hesitates then follows nervously more nervous for Gandhi than himself Jan Christian Smuts They are getting closer with the youths laughing and whispering Charlie trailing as the first youth stares at them sullenly One youth has flicked his cigarette hard and it lands at Gandhi's feet Charlie nods uncertainly looks back at the cab in confusion signals the driver to follow and hurries on to match strides with Gandhi's brisk pace As he reaches forth to haul Gandhi from the pavement a woman leans out of an upstairs window looking down at the fracas disconcertedly He turns and waves to the parlor window where the three boys are — all bigger — and Ba holds a new addition Gandhi pauses looking at the youth then starts forward again almost on the youths clearly frightened but determined As he reaches forth to haul Gandhi from the pavement a woman leans out of an upstairs window looking down at the fracas disconcertedly It is the first youth's mother and her presence reduces the pitch of his hostility considerably A snickering response comes from the other youths who are embarrassed by the questioning disapproval of the mother's attitude Gandhi steps back on the pavement addressing the first youth and steps around him Charlie trailing as the first youth stares at them sullenly As they stride on Charlie glances back and Gandhi laughs as they turn the corner They enter a busy street in the center of the town Gandhi and Charlie come around the corner into it and he pauses before an office where a young girl Sonja has come out to speak to him about something of urgency but she hovers not interrupting Smuts has risen knowing how to concede with grace Gandhi turns back and starts down the long hilly street gesturing Charlie on and starting to walk He turns to Sonja whose tone is loaded with foreboding and Gandhi absorbs the news stiffly Meanwhile a strong masculine hand scrawls a signature across a document Beneath the signature is the boldly printed identification Jan Christian Smuts A cameraman records the moment with a flash photo General Smuts whose presence matches his office addresses someone out of shot as a male secretary removes the document The reporter standing opposite him is Walker much younger almost boyish compared to the way we saw him at the funeral Smuts has risen knowing how to concede with grace As they stride on Charlie glances back and Gandhi laughs as they turn the corner They come to a turning nearer to town where the area is poorer and rundown Beneath the signature is the boldly printed identification The gaze is firm strong and cynical as the sides are half up but it is dusty and hot One of them tosses aside his cigarette and Gandhi restrains him and shakes his head"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He turns and waves to the parlor window where the three boys are — all bigger — and Ba holds a new addition. they all wave. Gandhi turns back and starts down the long hilly street gesturing Charlie on and starting to walk. Charlie nods uncertainly looks back at the cab in confusion signals the driver to follow and hurries on to match strides with Gandhi's brisk pace. They come to a turning nearer to town where the area is poorer and rundown. Ahead of them three youths in working clothes carrying lunch boxes lean indolently against a building directly in their path. They react to the sight of Gandhi — fun — and stride the pavement menacingly. One of them tosses aside his cigarette and Gandhi restrains him and shakes his head. Gandhi starts to move forward. Charlie hesitates then follows nervously more nervous for Gandhi than himself. They are getting closer with the youths laughing and whispering. One youth has flicked his cigarette hard and it lands at Gandhi's feet. Gandhi pauses looking at the youth then starts forward again almost on the youths clearly frightened but determined. As he reaches forth to haul Gandhi from the pavement a woman leans out of an upstairs window looking down at the fracas disconcertedly. It is the first youth's mother and her presence reduces the pitch of his hostility considerably. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. A snickering response comes from the other youths who are embarrassed by the questioning disapproval of the mother's attitude. Gandhi steps back on the pavement addressing the first youth and steps around him. Charlie trailing as the first youth stares at them sullenly. As they stride on Charlie glances back and Gandhi laughs as they turn the corner. They enter a busy street in the center of the town. Gandhi and Charlie come around the corner into it and he pauses before an office where a young girl Sonja has come out to speak to him about something of urgency but she hovers not interrupting. He turns to Sonja whose tone is loaded with foreboding and Gandhi absorbs the news stiffly. Meanwhile a strong masculine hand scrawls a signature across a document. Beneath the signature is the boldly printed identification. Jan Christian Smuts. A cameraman records the moment with a flash photo. General Smuts whose presence matches his office addresses someone out of shot as a male secretary removes the document. The reporter standing opposite him is Walker much younger almost boyish compared to the way we saw him at the funeral. Smuts has risen knowing how to concede with grace. The gaze is firm strong and cynical as the sides are half up but it is dusty and hot."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He turns and waves to the parlor window where the three boys are — all bigger — and Ba holds a new addition. they all wave. Gandhi turns back and starts down the long hilly street gesturing Charlie on and starting to walk. Charlie nods uncertainly looks back at the cab in confusion signals the driver to follow and hurries on to match strides with Gandhi's brisk pace. They come to a turning nearer to town where the area is poorer and rundown. Ahead of them three youths in working clothes carrying lunch boxes lean indolently against a building directly in their path. They react to the sight of Gandhi — fun — and stride the pavement menacingly. One of them tosses aside his cigarette and Gandhi restrains him and shakes his head. Gandhi starts to move forward. Charlie hesitates then follows nervously more nervous for Gandhi than himself. They are getting closer with the youths laughing and whispering. One youth has flicked his cigarette hard and it lands at Gandhi's feet. Gandhi pauses looking at the youth then starts forward again almost on the youths clearly frightened but determined. As he reaches forth to haul Gandhi from the pavement a woman leans out of an upstairs window looking down at the fracas disconcertedly. It is the first youth's mother and her presence reduces the pitch of his hostility considerably. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. A snickering response comes from the other youths who are embarrassed by the questioning disapproval of the mother's attitude. Gandhi steps back on the pavement addressing the first youth and steps around him. Charlie trailing as the first youth stares at them sullenly. As they stride on Charlie glances back and Gandhi laughs as they turn the corner. They enter a busy street in the center of the town. Gandhi and Charlie come around the corner into it and he pauses before an office where a young girl Sonja has come out to speak to him about something of urgency but she hovers not interrupting. He turns to Sonja whose tone is loaded with foreboding and Gandhi absorbs the news stiffly. Meanwhile a strong masculine hand scrawls a signature across a document. Beneath the signature is the boldly printed identification. Jan Christian Smuts. A cameraman records the moment with a flash photo. General Smuts whose presence matches his office addresses someone out of shot as a male secretary removes the document. The reporter standing opposite him is Walker much younger almost boyish compared to the way we saw him at the funeral. Smuts has risen knowing how to concede with grace. The gaze is firm strong and cynical as the sides are half up but it is dusty and hot."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He turns and waves to the parlor window where the three boys are — all bigger — and Ba holds a new addition. they all wave. Gandhi turns back and starts down the long hilly street gesturing Charlie on and starting to walk. Charlie nods uncertainly looks back at the cab in confusion signals the driver to follow and hurries on to match strides with Gandhi's brisk pace. They come to a turning nearer to town where the area is poorer and rundown. Ahead of them three youths in working clothes carrying lunch boxes lean indolently against a building directly in their path. They react to the sight of Gandhi — fun — and stride the pavement menacingly. One of them tosses aside his cigarette and Gandhi restrains him and shakes his head. Beneath the signature is the boldly printed identification. Jan Christian Smuts. A cameraman records the moment with a flash photo. General Smuts whose presence matches his office addresses someone out of shot as a male secretary removes the document. The reporter standing opposite him is Walker much younger almost boyish compared to the way we saw him at the funeral. Smuts has risen knowing how to concede with grace. The gaze is firm strong and cynical as the sides are half up but it is dusty and hot."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He turns and waves to the parlor window where the three boys are — all bigger — and Ba holds a new addition. they all wave. Gandhi turns back and starts down the long hilly street gesturing Charlie on and starting to walk. The reporter standing opposite him is Walker much younger almost boyish compared to the way we saw him at the funeral. Smuts has risen knowing how to concede with grace. The gaze is firm strong and cynical as the sides are half up but it is dusty and hot."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "She turns and waves to the parlor window, where the three dogs are — all bigger — and the baker holds a new addition; they all wave. A rabbit turns back and starts down the long, hilly street, gesturing a painter on and starting to walk. The painter nods uncertainly, looks back at the cab in confusion, signals the driver to follow, and hurries on to match strides with the rabbit's brisk pace. They come to a turning, nearer to town, where the area is poorer and run-down. Ahead of them, three birds in working clothes, carrying lunch boxes, lean indolently against a building directly in their path. They react to the sight of a rabbit — fun — and stride the pavement menacingly. One of them tosses aside his cigarette, and the rabbit restrains him and shakes its head. The rabbit starts to move forward. The painter hesitates, then follows nervously, more nervous for the rabbit than herself. They are getting closer, with the birds laughing and whispering. One bird has flicked his cigarette hard, and it lands at the rabbit's feet. The rabbit pauses, looking at the bird, then starts forward again, almost on the birds, clearly frightened but determined. As she reaches forth to haul the rabbit from the pavement, a boy leans out of an upstairs window, looking down at the fracas disconcertedly. It is the first bird's brother, and his presence reduces the pitch of his hostility considerably. A snickering response comes from the other birds, who are embarrassed by the questioning disapproval of the brother's attitude. The rabbit steps back on the pavement, addressing the first bird, and steps around him, the painter trailing, as the first bird stares at them sullenly. As they stride on, the painter glances back, and the rabbit laughs as they turn the corner. They enter a busy street in the center of the town. The rabbit and the painter come around the corner into it, and it pauses before an office where a young squirrel, Sonja, has come out to speak to it about something of urgency, but she hovers, not interrupting. It turns to Sonja, whose tone is loaded with foreboding, and the rabbit absorbs the news stiffly. Meanwhile, a strong feminine hand scrawls a signature across a document. Beneath the signature is the boldly printed identification: Hector the Horse. A photographer records the moment with a flash photo. General Horse, whose presence matches her office, addresses someone out of shot as a female secretary removes the document. The reporter standing opposite her is Walker, much younger, almost boyish compared to the way we saw him at the funeral. Horse has risen, knowing how to concede with grace. The gaze is firm, strong, and cynical, as the sides are half up, but it is dusty and hot."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He turns and waves to the library window, where the three cats are — all larger — and Ba holds a new addition; they all wave. Gandhi turns back and starts down the long, sandy trail, gesturing Charlie on and starting to walk. Charlie nods uncertainly, looks back at the cart in confusion, signals the driver to follow, and hurries on to match strides with Gandhi's brisk pace. They come to a turning, nearer to town, where the area is poorer and run-down. Ahead of them, three youths in gardening attire, carrying sketchbooks, lean indolently against a fence directly in their path. They react to the sight of Gandhi — fun — and stride the grass menacingly. One of them tosses aside his lollipop, and Gandhi restrains him and shakes his head. Gandhi starts to move forward. Charlie hesitates, then follows nervously, more nervous for Gandhi than himself. They are getting closer, with the youths laughing and whispering. One youth has flicked his lollipop hard, and it lands at Gandhi's feet. Gandhi pauses, looking at the youth, then starts forward again, almost on the youths, clearly frightened but determined. As he reaches forth to haul Gandhi from the grass, a woman leans out of an upstairs balcony, looking down at the fracas disconcertedly. It is the first youth's grandmother, and her presence reduces the pitch of his hostility considerably. A snickering response comes from the other youths, who are embarrassed by the questioning disapproval of the grandmother's attitude. Gandhi steps back on the grass, addressing the first youth, and steps around him, Charlie trailing, as the first youth stares at them sullenly. As they stride on, Charlie glances back, and Gandhi laughs as they turn the corner. They enter a bustling plaza in the center of the town. Gandhi and Charlie come around the corner into it, and he pauses before an atelier where a young girl, Sonja, has come out to speak to him about something of urgency, but she hovers, not interrupting. He turns to Sonja, whose tone is loaded with foreboding, and Gandhi absorbs the news stiffly. Meanwhile, a strong feminine hand scrawls a signature across a canvas. Beneath the signature is the boldly printed identification: Jan Christian Smuts. A painter records the moment with a flash sketch. General Smuts, whose presence matches her atelier, addresses someone out of shot as a female assistant removes the canvas. The reporter standing opposite her is Walker, much younger, almost boyish compared to the way we saw him at the gallery. Smuts has risen, knowing how to concede with grace. The gaze is firm, strong, and cynical, as the sides are half up, but it is breezy and sunny."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He spins and salutes to the parlor window, where the three boys are — all bigger — and Ba juggles a new addition; they all salute. Gandhi spins back and hops down the long, hilly street, signaling Charlie on and starting to jog. Charlie shrugs uncertainly, glances back at the cab in confusion, beckons the driver to remain, and shuffles on to match strides with Gandhi's quick pace. They approach a turning, nearer to town, where the area is poorer and run-down. Ahead of them, three youths in working clothes, with lunch boxes, recline lazily against a building directly in their path. They cheer the sight of Gandhi — amusement — and climb the pavement aggressively. One of them flicks aside his cigarette, and Gandhi pats him and shakes his head. Gandhi hops to move forward. Charlie falters, then trails nervously, more uneasy for Gandhi than himself. They are inching closer, with the youths chuckling and whispering. One youth has tossed his cigarette hard, and it lands at Gandhi's feet. Gandhi halts, observing the youth, then hops forward again, nearly on the youths, visibly alarmed but resolute. As he stretches forth to yank Gandhi from the pavement, a woman leans out of an upstairs window, peering down at the scuffle disconcertedly. It is the first youth's mother, and her presence reduces the pitch of his hostility considerably. A giggling reaction comes from the other youths, who are flustered by the questioning disapproval of the mother's attitude. Gandhi hops back on the pavement, addressing the first youth, and skips around him, Charlie trailing, as the first youth glares at them sullenly. As they skip on, Charlie peeks back, and Gandhi chuckles as they round the corner. They step into a bustling street in the center of the town. Gandhi and Charlie bounce around the corner into it, and he pauses before an office where a young girl, Sonja, has emerged to communicate with him about something significant, but she hesitates, not intruding. He spins to Sonja, whose tone is laced with apprehension, and Gandhi absorbs the news stiffly. Meanwhile, a strong masculine hand scribes a signature across a document. Beneath the signature is the boldly printed identification: Jan Christian Smuts. A cameraman seizes the moment with a flash photo. General Smuts, whose presence matches his office, voices to someone out of frame as a male secretary extracts the document. The reporter standing opposite him is Walker, much younger, almost boyish compared to the way we saw him at the funeral. Smuts has stood, adept at yielding with grace. The gaze is firm, strong, and cynical, as the sides are half up, but it is dusty and hot."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The kite turns and waves to the ceiling fan, where the three tables are — all bigger — and the shoe holds a new addition; they all wave. The candle turns back and starts down the long, hilly bookshelf, gesturing the watermelon on and starting to walk. The watermelon nods uncertainly, looks back at the refrigerator in confusion, signals the bicycle to follow, and hurries on to match strides with the candle's brisk pace. They come to a turning, nearer to the book, where the area is poorer and run-down. Ahead of them, three chairs in working clothes, carrying lunch trays, lean indolently against a postcard directly in their path. They react to the sight of the candle — fun — and stride the coaster menacingly. One of them tosses aside his pencil, and the candle restrains him and shakes his head. The candle starts to move forward. The watermelon hesitates, then follows nervously, more nervous for the candle than itself. They are getting closer, with the chairs laughing and whispering. One chair has flicked his pencil hard, and it lands at the candle's feet. The candle pauses, looking at the chair, then starts forward again, almost on the chairs, clearly frightened but determined. As it reaches forth to haul the candle from the coaster, a cloud leans out of an upstairs painting, looking down at the fracas disconcertedly. It is the first chair's eagle, and its presence reduces the pitch of his hostility considerably. A snickering response comes from the other chairs, who are embarrassed by the questioning disapproval of the eagle's attitude. The candle steps back on the coaster, addressing the first chair, and steps around him, the watermelon trailing, as the first chair stares at them sullenly. As they stride on, the watermelon glances back, and the candle laughs as they turn the corner. They enter a busy mug in the center of the book. The candle and the watermelon come around the corner into it, and it pauses before a desk where a young spoon, Velvet, has come out to speak to it about something of urgency, but she hovers, not interrupting. It turns to Velvet, whose tone is loaded with foreboding, and the candle absorbs the news stiffly. Meanwhile, a strong masculine shoe scrawls a signature across a dictionary. Beneath the signature is the boldly printed identification: Tim Electric Guitar. A doorknob records the moment with a flash kite. Major Guitar, whose presence matches his desk, addresses someone out of shoe as a male stapler removes the dictionary. The flashlight standing opposite him is Parcel, much younger, almost boyish compared to the way we saw it at the drum. Guitar has risen, knowing how to concede with grace. The gaze is firm, strong, and cynical, as the scooters are half up, but it is dusty and hot."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "She rotates and signals to the garden window, where the three kittens are — all older — and Ma grasps a new toy; they all nod. Newton twirls back and slips down the narrow, winding lane, nudging Alex on and starting to skip. Alex shrugs uncertainly, glances back at the bus in confusion, gestures to the driver to wait, and scampers on to synchronize with Newton's cheerful pace. They arrive at a fork, closer to the city, where the neighborhood is wealthier and opulent. Ahead of them, three dancers in party attire, holding bouquets, rest lazily against a fountain directly in their path. They react to the sight of Newton — curiosity — and block the path ominously. One of them discards his hat, and Newton halts him and shakes his head. Newton begins to glide forward. Alex hesitates, then trails anxiously, more anxious for Newton than himself. They are nearing, with the dancers giggling and muttering. One dancer has flipped his cap forcefully, and it lands at Newton's feet. Newton stands still, gazing at the dancer, then glides forward again, nearly upon the dancers, visibly worried but steadfast. As he stretches forth to yank Newton from the walkway, a child pokes out of a lower window, gazing down at the spectacle uneasily. It is the first dancer's sister, and her presence diminishes his aggression significantly. A chuckling reaction comes from the other dancers, who are flustered by the curious scrutiny of the sister's demeanor. Newton skips back onto the walkway, addressing the first dancer, and skips past him, Alex lagging, as the first dancer glares at them irritably. As they skip on, Alex casts a look back, and Newton chuckles as they round the bend. They arrive at a quiet lane at the heart of the city. Newton and Alex round the bend into it, and she halts before a library where an old man, Leo, has emerged to inform her about something trivial, but he lingers, not speaking. She turns to Leo, whose expression is filled with warning, and Newton absorbs the message tensely. Meanwhile, a delicate feminine hand pens a doodle across a note. Beside the note is the subtly printed title: Marie Curie. A painter captures the moment with a quick sketch. Professor Curie, whose presence contrasts with her laboratory, addresses someone nearby as a female assistant removes the note. The historian standing adjacent to her is Miller, much older, almost grandfatherly compared to how we saw him at the birth. Curie has settled, understanding how to proceed with wisdom. The expression is gentle, calm, and knowing, as the curtains are half drawn, but it is breezy and cool."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He whirls and salutes to the garden fence, where the three cats are — all larger — and Ba holds a fresh addition; they all salute. Gandhi whirls back and descends down the long, sandy beach, beckoning Charlie along and beginning to jog. Charlie shrugs uncertainly, glances back at the rickshaw in bewilderment, signals the conductor to trail, and dashes on to synchronize steps with Gandhi's quick trot. They arrive at a crossroads, closer to town, where the region is poorer and dilapidated. Ahead of them, three teenagers in school uniforms, carrying backpacks, lounge lazily against a shop directly in their way. They react to the sight of Gandhi — amusement — and saunter the sidewalk intimidatingly. One of them flicks away his chewing gum, and Gandhi holds him back and nods his head. Gandhi begins to move onward. Charlie wavers, then trails apprehensively, more worried for Gandhi than himself. They are approaching, with the teenagers giggling and murmuring. One teenager has flicked his chewing gum forcefully, and it lands at Gandhi's feet. Gandhi halts, gazing at the teenager, then begins onward again, almost upon the teenagers, visibly anxious but resolute. As he reaches out to escort Gandhi from the sidewalk, a woman peers out of an upstairs door, gazing down at the commotion unsettlingly. It is the first teenager's aunt, and her presence diminishes the level of his aggression substantially. A chuckling reaction comes from the other teenagers, who are embarrassed by the skeptical disapproval of the aunt's demeanor. Gandhi steps back onto the sidewalk, addressing the first teenager, and maneuvers around him, Charlie trailing, as the first teenager gawks at them sulkily. As they march on, Charlie peeks back, and Gandhi chuckles as they pivot around the corner. They enter a bustling thoroughfare in the heart of the town. Gandhi and Charlie curve around the corner into it, and he halts before a store where a young girl, Sonja, has emerged to converse with him about something pressing, but she lingers, not interjecting. He turns to Sonja, whose voice is imbued with forewarning, and Gandhi takes in the news rigidly. Meanwhile, a strong masculine hand doodles an autograph across a petition. Beneath the autograph is the prominently printed label: Jan Christian Smuts. A videographer captures the instance with a burst of recording. General Smuts, whose demeanor complements his workspace, addresses someone unseen as a male aide removes the petition. The correspondent standing opposite him is Walker, much younger, almost juvenile compared to the way we saw him at the gathering. Smuts has risen, knowing how to yield with poise. The gaze is firm, strong, and skeptical, as the sides are half lifted, but it is sandy and balmy."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The owl swivels and salutes to the bakery door, where the trio of cats sits — all larger — and Flo cradles an ancient artifact; they all salute. Einstein swivels back and skips down the short, flat avenue, beckoning Max onward and bouncing to skip. Max blinks doubtfully, peers back at the tractor in bewilderment, signals the farmer to chase, and rushes on to match hops with Einstein's quick rhythm. They arrive at a bend, farther from the village, where the region is wealthier and pristine. In front of them, a trio of squirrels in formal attire, holding baskets of fruit, reclines lazily against a tree directly in their route. They recoil at the sight of Einstein — amusement — and amble the path affably. One of them flings aside his apple core, and Einstein halts it and shakes his beak. Einstein skips forward. Max lingers, then proceeds anxiously, more anxious for Einstein than himself. They are nearing, with the squirrels chuckling and murmuring. One squirrel has tossed his apple core forcefully, and it strikes Einstein's claws. Einstein halts, gazing at the squirrel, then skips forward again, almost upon the squirrels, visibly anxious but resolute. As he reaches forth to whisk Einstein from the path, a fish leans out of an underground cavern, peering up at the spectacle confusedly. It is the first squirrel's aunt, and her presence diminishes the level of his aggression substantially. A giggling reaction comes from the other squirrels, who are humiliated by the inquisitive disappointment of the aunt's demeanor. Einstein steps back on the path, addressing the first squirrel, and skips around him, Max trailing, as the first squirrel gazes at them gloomily. As they leap on, Max peeks back, and Einstein giggles as they round the bend. They hop into a quiet lane in the outskirts of the village. Einstein and Max bounce around the bend into it, and he halts before an orchard where a young rabbit, Lola, has appeared to converse with him about something significant, but she lingers, not intruding. He swivels to Lola, whose tone is tinged with anticipation, and Einstein receives the update rigidly. Meanwhile, a feeble feminine paw scribbles an autograph across a parchment. Below the autograph is the faintly etched designation: Tom Arnold Wiseman. A baker captures the instant with a quick sketch. Chef Wiseman, whose demeanor matches his kitchen, addresses someone offstage as a female accountant collects the parchment. The artist standing opposite him is Tailor, much older, almost grown-up compared to the way we perceived him at the exhibit. Wiseman has reclined, knowing how to relent with poise. The glance is gentle, weak, and skeptical, as the curtains are half drawn, but it is breezy and cool."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Gandhi, after waving goodbye to his family, walks briskly with Charlie down a hilly street towards a poorer area of town. They encounter three menacing youths who mock Gandhi. Despite his nervousness, Charlie follows Gandhi, who remains determined yet frightened. As tension rises, a mother intervenes from a window, reducing hostility. Gandhi calmly addresses the youths and walks past with Charlie. They soon reach a busy street where Sonja, a young girl with urgent news, approaches Gandhi. Meanwhile, General Jan Christian Smuts signs a document, observed by a younger Walker, hinting at significant political developments."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The gaze is firm strong and cynical as the sides are half up but it is dusty and hot Smuts has risen knowing how to concede with grace The reporter standing opposite him is Walker much younger almost boyish compared to the way we saw him at the funeral General Smuts whose presence matches his office addresses someone out of shot as a male secretary removes the document A cameraman records the moment with a flash photo Jan Christian Smuts Beneath the signature is the boldly printed identification Meanwhile a strong masculine hand scrawls a signature across a document He turns to Sonja whose tone is loaded with foreboding and Gandhi absorbs the news stiffly Gandhi and Charlie come around the corner into it and he pauses before an office where a young girl Sonja has come out to speak to him about something of urgency but she hovers not interrupting They enter a busy street in the center of the town As they stride on Charlie glances back and Gandhi laughs as they turn the corner Charlie trailing as the first youth stares at them sullenly Gandhi steps back on the pavement addressing the first youth and steps around him A snickering response comes from the other youths who are embarrassed by the questioning disapproval of the mother's attitude It is the first youth's mother and her presence reduces the pitch of his hostility considerably As he reaches forth to haul Gandhi from the pavement a woman leans out of an upstairs window looking down at the fracas disconcertedly Gandhi pauses looking at the youth then starts forward again almost on the youths clearly frightened but determined One youth has flicked his cigarette hard and it lands at Gandhi's feet They are getting closer with the youths laughing and whispering Charlie hesitates then follows nervously more nervous for Gandhi than himself Gandhi starts to move forward One of them tosses aside his cigarette and Gandhi restrains him and shakes his head They react to the sight of Gandhi — fun — and stride the pavement menacingly Ahead of them three youths in working clothes carrying lunch boxes lean indolently against a building directly in their path They come to a turning nearer to town where the area is poorer and rundown Charlie nods uncertainly looks back at the cab in confusion signals the driver to follow and hurries on to match strides with Gandhi's brisk pace Gandhi turns back and starts down the long hilly street gesturing Charlie on and starting to walk they all wave He turns and waves to the parlor window where the three boys are — all bigger — and Ba holds a new addition"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "They enter a busy street in the center of the town It is the first youth's mother and her presence reduces the pitch of his hostility considerably They are getting closer with the youths laughing and whispering General Smuts whose presence matches his office addresses someone out of shot as a male secretary removes the document Meanwhile a strong masculine hand scrawls a signature across a document They react to the sight of Gandhi — fun — and stride the pavement menacingly Ahead of them three youths in working clothes carrying lunch boxes lean indolently against a building directly in their path Gandhi pauses looking at the youth then starts forward again almost on the youths clearly frightened but determined One youth has flicked his cigarette hard and it lands at Gandhi's feet A snickering response comes from the other youths who are embarrassed by the questioning disapproval of the mother's attitude Charlie hesitates then follows nervously more nervous for Gandhi than himself A cameraman records the moment with a flash photo The gaze is firm strong and cynical as the sides are half up but it is dusty and hot He turns to Sonja whose tone is loaded with foreboding and Gandhi absorbs the news stiffly Gandhi steps back on the pavement addressing the first youth and steps around him The reporter standing opposite him is Walker much younger almost boyish compared to the way we saw him at the funeral they all wave As he reaches forth to haul Gandhi from the pavement a woman leans out of an upstairs window looking down at the fracas disconcertedly As they stride on Charlie glances back and Gandhi laughs as they turn the corner Gandhi turns back and starts down the long hilly street gesturing Charlie on and starting to walk Charlie trailing as the first youth stares at them sullenly Smuts has risen knowing how to concede with grace They come to a turning nearer to town where the area is poorer and rundown Jan Christian Smuts One of them tosses aside his cigarette and Gandhi restrains him and shakes his head Gandhi starts to move forward Beneath the signature is the boldly printed identification He turns and waves to the parlor window where the three boys are — all bigger — and Ba holds a new addition Charlie nods uncertainly looks back at the cab in confusion signals the driver to follow and hurries on to match strides with Gandhi's brisk pace Gandhi and Charlie come around the corner into it and he pauses before an office where a young girl Sonja has come out to speak to him about something of urgency but she hovers not interrupting"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "A snickering response comes from the other youths who are embarrassed by the questioning disapproval of the mother's attitude Gandhi steps back on the pavement addressing the first youth and steps around him Charlie trailing as the first youth stares at them sullenly As they stride on Charlie glances back and Gandhi laughs as they turn the corner They enter a busy street in the center of the town Gandhi and Charlie come around the corner into it and he pauses before an office where a young girl Sonja has come out to speak to him about something of urgency but she hovers not interrupting He turns to Sonja whose tone is loaded with foreboding and Gandhi absorbs the news stiffly Meanwhile a strong masculine hand scrawls a signature across a document Beneath the signature is the boldly printed identification Jan Christian Smuts A cameraman records the moment with a flash photo General Smuts whose presence matches his office addresses someone out of shot as a male secretary removes the document The reporter standing opposite him is Walker much younger almost boyish compared to the way we saw him at the funeral Smuts has risen knowing how to concede with grace The gaze is firm strong and cynical as the sides are half up but it is dusty and hot He turns and waves to the parlor window where the three boys are — all bigger — and Ba holds a new addition they all wave Gandhi turns back and starts down the long hilly street gesturing Charlie on and starting to walk Charlie nods uncertainly looks back at the cab in confusion signals the driver to follow and hurries on to match strides with Gandhi's brisk pace They come to a turning nearer to town where the area is poorer and rundown Ahead of them three youths in working clothes carrying lunch boxes lean indolently against a building directly in their path They react to the sight of Gandhi — fun — and stride the pavement menacingly One of them tosses aside his cigarette and Gandhi restrains him and shakes his head Gandhi starts to move forward Charlie hesitates then follows nervously more nervous for Gandhi than himself They are getting closer with the youths laughing and whispering One youth has flicked his cigarette hard and it lands at Gandhi's feet Gandhi pauses looking at the youth then starts forward again almost on the youths clearly frightened but determined As he reaches forth to haul Gandhi from the pavement a woman leans out of an upstairs window looking down at the fracas disconcertedly It is the first youth's mother and her presence reduces the pitch of his hostility considerably"
        }
      ]
    }
  ]
}