{
  "ground_truth": "Another cheer rises, and when it subsides, Tyeb Mohammed stands near the back, seated with several other young men. The police half rise to look back at him, but there is a smattering of applause, and several people stand to look as well. Gandhi waits and then looks at the audience. This is the more sober Gandhi they have come to know. He looks down at the police to emphasize his point. The audience reacts tentatively but with uncertainty. Gandhi now has their attention and receives the response he wanted, a firm, mature, determined one. Gandhi holds up his hand and looks at the audience. After a moment, a merchant stands to signify his pledge, followed by Tyeb Mohammed and the youths around him. Then, throughout the theater and on the stage, everyone begins to stand until all are standing. Gandhi looks at the full theater, all standing, and takes a step forward. A prison door slams, focusing on one face, then another slam, another face, rhythmically in time with marching feet. Gandhi, Singh, and Tyeb Mohammed lead a large procession of Indian mine workers along a dirt road from a mining complex with sheds, elevator platforms, and pulleys toward a distant city. Tyeb Mohammed touches Gandhi's arm and nods ahead as a canvas-topped open touring car (circa 1910) emerges from a turning between two factory buildings and approaches them. There is little hesitation in the ranks as the car gets closer. In it, there are two uniformed policemen and a civilian, who smiles slowly. He looks from Gandhi to the miners and then looks at Gandhi sharply before smiling derisively and signaling the car off. As it pulls away, Tyeb Mohammed and Singh approach Gandhi, both wary of the man's evident satisfaction with what has transpired. Gandhi watches the disappearing car worriedly but then turns to signal the miners to move on, and they start forward. The car rides past the factory building from which it turned, and suddenly mounted police swing out from the buildings to face the procession. Tracking back before Gandhi, Singh, and Tyeb Mohammed as they move forward, fear suddenly makes their pace more labored, while tracking back before the fast-approaching mounted police with batons at the ready. Gandhi screws up his courage and marches on. Tyeb Mohammed sets his jaw in defiance, and Singh forces himself along at Gandhi's side as the mounted police ride on with batons ready. Gandhi is in the front rank of the procession, watching the horses approach, with a blunt farmer's face.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Another ovation ascends, and when it diminishes, Tyeb Mohammed positions near the rear, seated with several other youthful men. The constabulary half rise to glance back at him, but there is a scattering of commendations, and several individuals rise to observe as well. Gandhi pauses and then gazes at the spectators. This is the more solemn Gandhi they have come to recognize. He glances down at the constabulary to underscore his point. The spectators respond cautiously but with doubt. Gandhi now has their focus and obtains the reaction he desired, a steady, mature, resolute one. Gandhi raises his hand and gazes at the spectators. After a moment, a trader rises to signify his commitment, followed by Tyeb Mohammed and the youths surrounding him. Then, throughout the theater and on the platform, everyone commences to rise until all are upright. Gandhi gazes at the filled theater, all standing, and takes a stride forward. A jail gate slams, concentrating on one visage, then another slam, another countenance, rhythmically in synchrony with marching feet. Gandhi, Singh, and Tyeb Mohammed lead a sizable procession of Indian mine laborers along an unpaved path from a mining establishment with sheds, elevator platforms, and pulleys toward a distant municipality. Tyeb Mohammed touches Gandhi's limb and nods ahead as a canvas-covered open touring vehicle (circa 1910) emerges from a bend between two factory edifices and nears them. There is minimal hesitation in the ranks as the vehicle approaches. In it, there are two uniformed constables and a civilian, who grins slowly. He glances from Gandhi to the miners and then glances at Gandhi keenly before grinning contemptuously and signaling the vehicle away. As it pulls away, Tyeb Mohammed and Singh approach Gandhi, both cautious of the man's evident gratification with what has unfolded. Gandhi observes the receding vehicle anxiously but then turns to signal the miners to proceed, and they commence forward. The vehicle rides past the factory edifice from which it emerged, and suddenly mounted constables swing out from the edifices to confront the procession. Tracking back before Gandhi, Singh, and Tyeb Mohammed as they advance, apprehension suddenly makes their stride more labored, while tracking back before the rapidly approaching mounted constables with truncheons at the ready. Gandhi musters his bravery and marches on. Tyeb Mohammed sets his jaw in defiance, and Singh compels himself along at Gandhi's flank as the mounted constables ride on with truncheons ready. Gandhi is in the foremost rank of the procession, observing the steeds approach, with a blunt farmer's countenance."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Another cheer is raised, and when it subsides, Tyeb Mohammed is stood near the back, seated with several other young men. The police half rise to look back at him, but a smattering of applause is given, and several people stand to look as well. The audience is waited for by Gandhi, and then he looks at them. This is the more sober Gandhi that they have come to know. The police are looked down upon by him to emphasize his point. Tentative but uncertain reactions are given by the audience. Gandhi now has their attention and gets the response he wanted, a firm, mature, determined one. Gandhi's hand is held up by him and the audience is looked at. After a moment, a pledge is signified by a merchant standing, followed by Tyeb Mohammed and the youths around him. Then, throughout the theater and on the stage, everyone begins to stand until standing is done by all. The full theater, all standing, is looked at by Gandhi, and a step forward is taken by him. A prison door is slammed, focusing on one face, then another slam, another face, rhythmically in time with marching feet. A large procession of Indian mine workers is led by Gandhi, Singh, and Tyeb Mohammed along a dirt road from a mining complex with sheds, elevator platforms, and pulleys toward a distant city. Gandhi's arm is touched by Tyeb Mohammed, and he nods ahead as a canvas-topped open touring car (circa 1910) is seen emerging from a turning between two factory buildings and it approaches them. There is little hesitation in the ranks as the car gets closer. In it, two uniformed policemen and a civilian, who smiles slowly, are seated. He looks at Gandhi and then at the miners sharply before a derisive smile is given, and the car is signaled off. As it pulls away, Tyeb Mohammed and Singh approach Gandhi, both wary of the man's evident satisfaction with what had transpired. Gandhi watches the disappearing car worriedly but then signals for the miners to move on, and forward movement is started by them. The factory building is ridden past by the car from which it turned, and suddenly mounted police swing out from the buildings to face the procession. Tracking back before Gandhi, Singh, and Tyeb Mohammed as they are moved forward by fear, suddenly makes their pace more labored, while tracking back before the fast-approaching mounted police with batons at the ready. His courage is screwed up by Gandhi, and marching on is done by him. Tyeb Mohammed sets his jaw in defiance, and Singh forces himself along at Gandhi's side as the mounted police ride on with batons ready. The front rank of the procession is led by Gandhi, watching the horses approach, with a blunt farmer's face."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Another cheer rises. Tyeb Mohammed sits at the back with young men, and the police half rise to see him. There's applause as many people stand to look. Gandhi waits, projecting the sober demeanor they recognize, and emphasizes his point to the police. The audience responds with tentative uncertainty, giving Gandhi the firm, mature attention he seeks. Gandhi raises his hand; a merchant stands, followed by Tyeb Mohammed and the youths. Soon, everyone in the theater stands. Gandhi advances as a prison door slams, focusing on various faces in time with marching feet. Gandhi, Singh, and Tyeb Mohammed lead Indian mine workers along a dirt road from a mining complex toward a city. Tyeb Mohammed nods ahead as a 1910 canvas-topped touring car emerges, carrying two policemen and a civilian. The civilian smiles derisively at Gandhi and signals the car away. Tyeb Mohammed and Singh approach Gandhi, wary of the man's evident satisfaction. Gandhi, worried, signals the miners to continue. As the car passes a factory, mounted police emerge to confront the procession. Tracking back before Gandhi, Singh, and Tyeb Mohammed, their pace becomes labored with fear, while the mounted police approach, batons ready. Gandhi courageously marches on, with Tyeb Mohammed and Singh at his side, determined as the horses approach."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A cheer rises, and as it fades, Tyeb Mohammed sits near the back with young men. The police half-rise to see him, causing applause and curiosity. Gandhi, appearing sober, gains the audience's attention, receiving a firm response. A merchant stands to pledge, followed by Tyeb Mohammed and others, until everyone is standing. Gandhi steps forward, and a prison door slams rhythmically in time with marching feet, focusing on faces. Gandhi, Singh, and Tyeb Mohammed lead Indian mine workers from a mining complex toward a distant city. Tyeb nods as a 1910 touring car appears from factory buildings. In it are two policemen and a smiling civilian who signals the car away. As it leaves, Tyeb and Singh approach Gandhi, wary. Gandhi watches the car worriedly but signals the miners forward. The car passes the factory, and mounted police appear, facing the procession. Fear slows their pace as they and the mounted police advance. Gandhi, in the front rank, marches on despite fear, with Tyeb and Singh by his sides."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As yet another cheer rises from the crowd, Tyeb Mohammed, positioned near the back of the room, is seen seated alongside several other young men. The police, half rising from their seats, turn to look in his direction, accompanied by a smattering of applause and several individuals standing to get a better view. Gandhi patiently waits for the commotion to settle before casting his gaze over the audience. This is the more serious and sober expression of Gandhi that the audience has grown accustomed to witnessing. He deliberately directs his attention to the police officers to underscore his point. The audience’s reaction is tentative, filled with a sense of uncertainty. However, Gandhi now holds their full attention and garners the response he desires—one that is firm, mature, and resolute. Gandhi raises his hand, looking deliberately at the audience. After a brief moment, a merchant stands up, signaling his pledge, and is soon followed by Tyeb Mohammed and the young men clustered around him. Gradually, throughout the theater, from the stage to the gallery, individuals begin to rise until everyone is standing in a unified gesture. Gandhi surveys the crowded theater, with everyone on their feet, and takes a purposeful step forward. A prison door slams shut, focusing intently on one face, followed by another slam and another face, rhythmically harmonizing with the sound of marching feet. Gandhi, accompanied by Singh and Tyeb Mohammed, leads a sizable procession of Indian mine workers along a dusty dirt road leading away from a sprawling mining complex, complete with sheds, elevator platforms, and a network of pulleys, toward a distant cityscape. Tyeb Mohammed reaches out to touch Gandhi's arm, nodding ahead as he spots a canvas-topped open touring car, reminiscent of circa 1910, emerging from a turn between two imposing factory buildings and approaching their procession. As the vehicle draws closer, there is barely a moment of hesitation among the ranks. Inside the car, two uniformed policemen sit alongside a civilian, who offers a slow, deliberate smile. His gaze shifts from Gandhi to the assembled miners, then back to Gandhi, before he smiles derisively and gesturally signals the car to move on. As the vehicle pulls away, Tyeb Mohammed and Singh step forward to meet Gandhi, both cautious of the man's evident satisfaction with the recent events. Gandhi, observing the car as it vanishes into the distance with worry etched on his face, turns to signal the miners to continue moving, and they press forward. As the car progresses past the factory building from which it initially emerged, suddenly mounted police swing out from the shadows of the buildings to confront the procession. The focus tracks back on Gandhi, Singh, and Tyeb Mohammed as they progress forward, their pace becoming more labored with an undercurrent of fear, while tracking back in front of the rapidly advancing mounted police brandishing batons at the ready. Gandhi, summoning all his courage, continues to march resolutely onward. Tyeb Mohammed clenches his jaw in a display of defiance, while Singh, forcing himself to keep pace alongside Gandhi, steels himself as the mounted police approach with batons poised. Gandhi maintains his position at the forefront of the procession, eyes fixed ahead, resolutely watching the oncoming horses, with the steadfast expression of a blunt, determined farmer."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As another cheer enthusiastically rises from the lively crowd, Tyeb Mohammed can be seen positioned near the back of the crowded room, seated comfortably alongside several other young men, who exude camaraderie. The police officers, half rising from their seats with a sense of alertness, turn their attention to look in his direction, their movements accompanied by a smattering of polite applause and several individuals standing up to get a better view of the unfolding scene. Gandhi patiently waits for the restless commotion to settle down before he casts his gaze over the attentive audience. This is the more serious and sober expression of Gandhi, an expression that the audience has grown quite accustomed to witnessing over time. He deliberately directs and fixes his attention on the police officers to underscore his critical point. The audience’s reaction is marked by tentativeness, as it is filled with a palpable sense of uncertainty. However, Gandhi now successfully holds their full attention and elicits the response he desires—one that is characterized by firmness, maturity, and resoluteness. Gandhi raises his hand with a deliberate, steady motion, looking intently at the audience. After a brief, suspenseful moment, a merchant stands up, signaling his solemn pledge, and is soon followed by Tyeb Mohammed along with the young men closely clustered around him. Gradually, and somewhat hesitantly at first, throughout the entire theater, from the stage to the gallery, individuals begin to rise until everyone is standing together in a unified, powerful gesture. Gandhi surveys the crowded theater with everyone on their feet and takes a purposeful step forward. A prison door slams shut with a sharp clang, focusing intently on one face, followed by another slam and yet another face, rhythmically harmonizing with the steady sound of marching feet. Gandhi, accompanied by Singh and Tyeb Mohammed, leads a sizable procession of Indian mine workers, marching along a dusty dirt road that leads away from a sprawling mining complex. This complex is complete with sheds, towering elevator platforms, and a complicated network of pulleys, all leading toward a distant cityscape. Tyeb Mohammed reaches out to gently touch Gandhi's arm, nodding ahead as he spots a canvas-topped open touring car, reminiscent of an era circa 1910, emerging purposefully from a turn between two imposing factory buildings, approaching their determined procession. As the vehicle draws closer, there is barely a noticeable moment of hesitation among the ranks. Inside the car, two uniformed policemen sit alongside a civilian, who offers a slow, deliberate smile filled with condescension. His gaze shifts knowingly from Gandhi to the assembled miners, then back again to Gandhi, before he smiles derisively and gesturally signals the car to move on its way. As the vehicle pulls away, Tyeb Mohammed and Singh step forward to meet Gandhi, both cautious of the man's evident satisfaction with the recent events. Gandhi, observing the car as it slowly vanishes into the distance with worry visibly etched on his face, turns to signal the miners to continue moving, and they press resolutely forward. As the car progresses past the factory building from which it initially emerged, suddenly mounted police swing out from the shadows of the buildings to confront the growing procession. The focus returns to Gandhi, Singh, and Tyeb Mohammed as they progress determinedly forward, their pace becoming more labored, underscored by an undeniable undercurrent of fear, while tracking back in front of the rapidly advancing mounted police brandishing batons at the ready. Gandhi, summoning all of his considerable courage, continues to march resolutely onward. Tyeb Mohammed clenches his jaw, a visible display of defiance, while Singh, forcing himself to keep pace alongside Gandhi, steels himself as the mounted police approach with batons poised. Gandhi maintains his steadfast position at the very forefront of the determined procession, eyes fixed resolutely ahead, watching the oncoming horses with the steadfast expression and demeanor of a blunt, determined farmer."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "In the dimly lit room, another cheer rises, crescendo-like, and as it subsides into a low murmur, Tyeb Mohammed is positioned near the back, seated among a cluster of other young men, their expressions a mix of anticipation and resolve. The police, seated strategically throughout the venue, half-rise from their positions to turn and direct their attention toward him, their eyes narrowing with curiosity or suspicion. A smattering of applause interrupts the stillness, prompting several attendees to rise from their seats, craning their necks to gain a better view of the young man who commands their curiosity. Gandhi, observing the evolving dynamics within the room, waits patiently, sensing the shifting energy before deliberately directing his gaze toward the audience. This Gandhi, more contemplative and measured, is the one the audience has come to recognize—a leader whose presence demands their focus. He purposefully lowers his gaze to the police, underscoring his point without uttering a word. The audience, caught in the brief tension, reacts tentatively, their unsure murmurs betraying a hint of uncertainty. But Gandhi, holding the room in the palm of his hand, has successfully captured their attention and elicits the reaction he desires—a response that is firm, mature, and embodies determination. With a measured gesture, he raises his hand, his eyes surveying the crowd with unwavering resolve. After a moment of expectant silence, a merchant rises to his feet, signaling his commitment to the cause. His action sets off a chain reaction, with Tyeb Mohammed and the youths around him following suit, standing in solidarity. This momentum spreads like wildfire throughout the theater and onto the stage, as if by an unspoken cue, until everyone is standing, united in purpose. Gandhi, taking in the sight of a fully standing theater, steps forward with quiet confidence. Abruptly, the atmosphere shifts as a prison door slams shut, the sound sharp and resonant, drawing the narrative to focus on one determined face before another slam reveals another face, all in rhythm with the measured cadence of marching feet. Gandhi, alongside Singh and Tyeb Mohammed, leads a formidable procession of Indian mine workers along a dusty, well-trodden dirt road that stretches out from the mining complex—a labyrinth of sheds, elevator platforms, and pulleys—toward a city that looms distantly on the horizon. Tyeb Mohammed, walking close to Gandhi, reaches out to lightly touch his arm, nodding ahead to draw attention to a looming presence—a canvas-topped open touring car, reminiscent of an era bygone, emerging from a narrow turn between two imposing factory buildings. It approaches them with measured speed. As the car draws nearer, the ranks of the procession hesitate only momentarily, maintaining their resolve. Within the vehicle sit two uniformed policemen, their postures assertive, alongside a civilian who wears a slowly blooming smile of amusement or disdain. His eyes flit from Gandhi to the mass of miners, and then, with a sudden sharpness, he fixes Gandhi with a piercing gaze before his smile turns derisive, his hand casually signaling the driver to move on. As the car rolls away, Tyeb Mohammed and Singh gravitate toward Gandhi, their expressions tinged with wariness, sensing the civilian's evident satisfaction at the interaction. Gandhi, watching the car's silhouette fade into the distance, briefly allows worry to crease his features, but then, resolute, he pivots to signal the miners to continue moving, and, obedient to the silent cue, they press forward. The car glides past the factory's ominous facade from whence it came, and suddenly, with calculated intent, mounted police officers burst forth from the buildings, effectively blocking the procession's path. The camera tracks back, capturing Gandhi, Singh, and Tyeb Mohammed in their forward march, their steps now heavy with a dawning fear, matching the ferocity of the mounted police who charge forward, their batons poised for confrontation. Gandhi, resolute and unbowed, gathers his courage and continues to march with a determined vigor. Beside him, Tyeb Mohammed sets his jaw, a silent declaration of defiance, while Singh steels himself to keep pace with Gandhi. Their pace quickens as the mounted police approach with increasing speed, batons ready to clash. At the forefront of the procession, Gandhi, displaying the rugged resilience of a farmer, watches the advancing horses with an unwavering gaze, his determination etched in every line of his face."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As another cheer rises and subsides, Tyeb Mohammed sits near the back with several young men, drawing attention as the police and others glance back. Gandhi observes the audience, embodying a more sober persona they've grown familiar with, and emphasizes his point by looking at the police. The audience, initially tentative, becomes attentive, responding in the firm, mature manner Gandhi anticipated. Gandhi raises his hand, prompting a merchant to pledge his support, followed by Tyeb Mohammed and the other youths, and soon everyone in the theater stands in unity. Gandhi steps forward, surveying the unified crowd, as scenes shift to a rhythmic sequence of prison doors slamming.\n\nGandhi, Singh, and Tyeb Mohammed lead a procession of Indian mine workers along a dirt road from a mining complex toward a distant city. Tyeb points out a canvas-topped touring car, circa 1910, emerging from between two factory buildings. The car, carrying two uniformed policemen and a civilian, approaches without causing much hesitation among the ranks. The civilian's slow smile, directed at Gandhi and the miners, turns derisive as he signals the car to move on. Tyeb and Singh, wary, approach Gandhi, noticing the civilian's evident satisfaction. Gandhi looks worried as the car disappears but signals the miners to proceed.\n\nAs the car passes a factory, mounted police suddenly emerge, ready to face the procession. Gandhi, Singh, and Tyeb advance resolutely, though fear makes their steps heavy. Gandhi gathers his courage, continuing to march as Tyeb sets his jaw in defiance, with Singh beside them. The mounted police close in, batons at the ready, as Gandhi, with a farmer's stoic resolve, watches their approach from the front rank."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Another cheer rises, and when it subsides, Tyeb Mohammed, a young activist known for his persuasive speeches during the movement for Indian independence, stands near the back, seated with several other young men. The police half rise to look back at him, but there is a smattering of applause, and several people stand to look as well. Gandhi, a central figure in the struggle against British colonial rule, waits and then looks at the audience. This is the more sober Gandhi they have come to know, characterized by his strategic patience and moral authority. He looks down at the police to emphasize his point. The audience reacts tentatively but with uncertainty. Gandhi now has their attention and receives the response he wanted, a firm, mature, determined one. Gandhi holds up his hand and looks at the audience. After a moment, a merchant stands to signify his pledge, followed by Tyeb Mohammed and the youths around him, all inspired by Gandhi's call for nonviolent resistance. Then, throughout the theater and on the stage, everyone begins to stand until all are standing. Gandhi looks at the full theater, all standing, and takes a step forward, symbolizing the growing unity among diverse groups in the independence movement. A prison door slams, focusing on one face, then another slam, another face, rhythmically in time with marching feet, reflecting the oppressive measures used by colonial authorities. Gandhi, Singh, a local leader known for his dedication to grassroots organizing, and Tyeb Mohammed lead a large procession of Indian mine workers along a dirt road from a mining complex with sheds, elevator platforms, and pulleys toward a distant city that represents the colonial power's industrial interests. Tyeb Mohammed touches Gandhi's arm and nods ahead as a canvas-topped open touring car from the early 1900s emerges from a turning between two factory buildings and approaches them. There is little hesitation in the ranks as the car gets closer. In it, there are two uniformed policemen and a civilian, likely a British official involved in maintaining order, who smiles slowly. He looks from Gandhi to the miners and then looks at Gandhi sharply before smiling derisively and signaling the car off. As it pulls away, Tyeb Mohammed and Singh approach Gandhi, both wary of the man's evident satisfaction with what has transpired, symbolic of the challenges faced during the movement. Gandhi watches the disappearing car worriedly but then turns to signal the miners to move on, and they start forward. The car rides past the factory building from which it turned, and suddenly mounted police swing out from the buildings to face the procession, a common tactic used to intimidate and disperse gatherings. Tracking back before Gandhi, Singh, and Tyeb Mohammed as they move forward, fear suddenly makes their pace more labored, while tracking back before the fast-approaching mounted police with batons at the ready, reminding them of past brutalities. Gandhi, who embodies the principle of nonviolent resistance, screws up his courage and marches on. Tyeb Mohammed sets his jaw in defiance, and Singh forces himself along at Gandhi's side as the mounted police ride on with batons ready. Gandhi is in the front rank of the procession, watching the horses approach, with a blunt farmer's face, representing the resilient spirit of India's rural masses."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Another cheer rises and when it subsides Tyeb Mohammed stands near the back seated with several other young men. The police half rise to look back at him but there is a smattering of applause and several people stand to look as well. Gandhi waits and then looks at the audience. This is the more sober Gandhi they have come to know. He looks down at the police to emphasize his point. The audience reacts tentatively but with uncertainty. Gandhi now has their attention and receives the response. he wanted a firm mature determined one. Gandhi holds up his hand and looks at the audience. After a moment a merchant stands to signify his pledge followed by Tyeb Mohammed and the youths around him. Then throughout the theater and on the stage everyone begins to stand until all are standing. Gandhi looks at the full theater all standing and takes a step forward. A prison door slams focusing on one face then another slam another face rhythmically in time with marching feet. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Gandhi Singh and Tyeb Mohammed lead a large procession of Indian mine workers along a dirt road from a mining complex with sheds elevator platforms and pulleys toward a distant city. Tyeb Mohammed touches Gandhi's arm and nods ahead as a canvastopped open touring car circa 1910 emerges from a turning between two factory buildings and approaches them. There is little hesitation in the ranks as the car gets closer. In it there are two uniformed policemen and a civilian who smiles slowly. He looks from Gandhi to the miners and then looks at Gandhi sharply before smiling derisively and signaling the car off. As it pulls away Tyeb Mohammed and Singh approach Gandhi both wary of the man's evident satisfaction with what has transpired. Gandhi watches the disappearing car worriedly but then turns to signal the miners to move on and they start forward. The car rides past the factory building from which it turned and suddenly mounted police swing out from the buildings to face the procession. Tracking back before Gandhi. Singh and Tyeb Mohammed as they move forward. fear suddenly makes their pace more labored while tracking back before the fastapproaching mounted police with batons at the ready. Gandhi screws up his courage and marches on. Tyeb Mohammed sets his jaw in defiance and Singh forces himself along at Gandhi's side as the mounted police ride on with batons ready. Gandhi is in the front rank of the procession watching the horses approach with a blunt farmer's face."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Another cheer rises and when it subsides Tyeb Mohammed stands near the back seated with several other young men. The police half rise to look back at him but there is a smattering of applause and several people stand to look as well. Gandhi waits and then looks at the audience. This is the more sober Gandhi they have come to know. He looks down at the police to emphasize his point. The audience reacts tentatively but with uncertainty. Gandhi now has their attention and receives the response. he wanted a firm mature determined one. Gandhi holds up his hand and looks at the audience. After a moment a merchant stands to signify his pledge followed by Tyeb Mohammed and the youths around him. Then throughout the theater and on the stage everyone begins to stand until all are standing. Gandhi looks at the full theater all standing and takes a step forward. A prison door slams focusing on one face then another slam another face rhythmically in time with marching feet. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. Gandhi Singh and Tyeb Mohammed lead a large procession of Indian mine workers along a dirt road from a mining complex with sheds elevator platforms and pulleys toward a distant city. Tyeb Mohammed touches Gandhi's arm and nods ahead as a canvastopped open touring car circa 1910 emerges from a turning between two factory buildings and approaches them. There is little hesitation in the ranks as the car gets closer. In it there are two uniformed policemen and a civilian who smiles slowly. He looks from Gandhi to the miners and then looks at Gandhi sharply before smiling derisively and signaling the car off. As it pulls away Tyeb Mohammed and Singh approach Gandhi both wary of the man's evident satisfaction with what has transpired. Gandhi watches the disappearing car worriedly but then turns to signal the miners to move on and they start forward. The car rides past the factory building from which it turned and suddenly mounted police swing out from the buildings to face the procession. Tracking back before Gandhi. Singh and Tyeb Mohammed as they move forward. fear suddenly makes their pace more labored while tracking back before the fastapproaching mounted police with batons at the ready. Gandhi screws up his courage and marches on. Tyeb Mohammed sets his jaw in defiance and Singh forces himself along at Gandhi's side as the mounted police ride on with batons ready. Gandhi is in the front rank of the procession watching the horses approach with a blunt farmer's face."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Another cheer rises and when it subsides Tyeb Mohammed stands near the back seated with several other young men. The police half rise to look back at him but there is a smattering of applause and several people stand to look as well. Gandhi waits and then looks at the audience. This is the more sober Gandhi they have come to know. He looks down at the police to emphasize his point. The audience reacts tentatively but with uncertainty. Gandhi now has their attention and receives the response. The car rides past the factory building from which it turned and suddenly mounted police swing out from the buildings to face the procession. Tracking back before Gandhi. Singh and Tyeb Mohammed as they move forward. fear suddenly makes their pace more labored while tracking back before the fastapproaching mounted police with batons at the ready. Gandhi screws up his courage and marches on. Tyeb Mohammed sets his jaw in defiance and Singh forces himself along at Gandhi's side as the mounted police ride on with batons ready. Gandhi is in the front rank of the procession watching the horses approach with a blunt farmer's face."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Another cheer rises and when it subsides Tyeb Mohammed stands near the back seated with several other young men. The police half rise to look back at him but there is a smattering of applause and several people stand to look as well. Gandhi waits and then looks at the audience. Gandhi screws up his courage and marches on. Tyeb Mohammed sets his jaw in defiance and Singh forces himself along at Gandhi's side as the mounted police ride on with batons ready. Gandhi is in the front rank of the procession watching the horses approach with a blunt farmer's face."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "A roar erupts, and as it quiets, Julio Ramirez lounges by the entrance, standing with a few other elderly women. The firefighters fully stand to gaze back at her, but there is a sprinkling of boos, and many creatures pause to gaze as well. Einstein pauses and then peers at the crowd. This is the more lively Einstein they have come to forget. He stares up at the firefighters to conceal his idea. The crowd responds hesitantly but with confidence. Einstein now has their curiosity and obtains the reaction he dreaded, a weak, immature, unsure one. Einstein lowers his foot and glances at the crowd. After an hour, a sailor jumps to break his vow, followed by Julio Ramirez and the elders beside her. Then, throughout the park and on the roof, everyone starts to sit until none are seated. Einstein peeks at the empty park, all seated, and leaps backward. A cage door creaks, focusing on one hand, then another creak, another hand, rhythmically in time with hopping birds. Einstein, Patel, and Julio Ramirez lead a tiny parade of Brazilian chefs along a smooth street from a farming compound with barns, conveyor belts, and cranes toward a nearby village. Julio Ramirez pats Einstein's shoulder and shakes her head behind as a wooden-roofed closed flying carpet (circa 1895) emerges from a jumping beneath three warehouse towers and retreats from them. There is significant pause in the lines as the carpet moves away. Upon it, there are ten unarmored soldiers and a magician, who frowns quickly. She shifts from Einstein to the chefs and then peers at Einstein softly before frowning proudly and urging the carpet on. As it flies away, Julio Ramirez and Patel watch Einstein, both cautious of the woman's clear disappointment with what has occurred. Einstein listens to the reappearing carpet sadly but then pivots to direct the chefs to stay put, and they halt backward. The carpet flies past the warehouse tower over which it jumped, and suddenly floating dancers swing out from the towers to follow the parade. Zooming in front of Einstein, Patel, and Julio Ramirez as they halt backward, joyfully slowing their pace less eagerly, while zooming in front of the slow-approaching floating dancers with violins at a distance. Einstein collects his comfort and stays put. Julio Ramirez opens her mouth in surprise, and Patel drags himself behind Einstein's back as the floating dancers fly in with violins in their hands. Einstein is in the back row of the parade, watching the camels retreat, with a sharp sailor's shoulder."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In the theater, Tyeb Mohammed stands, attracting attention alongside other young men, and Gandhi, embodying a sober demeanor, commands the audience's focus. Gandhi's poised leadership prompts a collective pledge as the audience rises in unity. Gandhi, Tyeb Mohammed, and Singh then lead a procession of Indian mine workers down a road toward a city. As they progress, a vehicle carrying police passes by, its occupants including a civilian who derisively signals the car away. Although Gandhi shows concern, he encourages the miners to continue. Suddenly, mounted police emerge, confronting the procession, prompting fear and tension. Despite this, Gandhi, Tyeb Mohammed, and Singh resolutely march forward as the mounted police prepare to engage with batons. Gandhi, with steadfast resolve, leads the procession, facing the oncoming horses."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Gandhi is in the front rank of the procession watching the horses approach with a blunt farmer's face Tyeb Mohammed sets his jaw in defiance and Singh forces himself along at Gandhi's side as the mounted police ride on with batons ready Gandhi screws up his courage and marches on fear suddenly makes their pace more labored while tracking back before the fastapproaching mounted police with batons at the ready Singh and Tyeb Mohammed as they move forward Tracking back before Gandhi The car rides past the factory building from which it turned and suddenly mounted police swing out from the buildings to face the procession Gandhi watches the disappearing car worriedly but then turns to signal the miners to move on and they start forward As it pulls away Tyeb Mohammed and Singh approach Gandhi both wary of the man's evident satisfaction with what has transpired He looks from Gandhi to the miners and then looks at Gandhi sharply before smiling derisively and signaling the car off In it there are two uniformed policemen and a civilian who smiles slowly There is little hesitation in the ranks as the car gets closer Tyeb Mohammed touches Gandhi's arm and nods ahead as a canvastopped open touring car circa 1910 emerges from a turning between two factory buildings and approaches them Gandhi Singh and Tyeb Mohammed lead a large procession of Indian mine workers along a dirt road from a mining complex with sheds elevator platforms and pulleys toward a distant city A prison door slams focusing on one face then another slam another face rhythmically in time with marching feet Gandhi looks at the full theater all standing and takes a step forward Then throughout the theater and on the stage everyone begins to stand until all are standing After a moment a merchant stands to signify his pledge followed by Tyeb Mohammed and the youths around him Gandhi holds up his hand and looks at the audience he wanted a firm mature determined one Gandhi now has their attention and receives the response The audience reacts tentatively but with uncertainty He looks down at the police to emphasize his point This is the more sober Gandhi they have come to know Gandhi waits and then looks at the audience The police half rise to look back at him but there is a smattering of applause and several people stand to look as well Another cheer rises and when it subsides Tyeb Mohammed stands near the back seated with several other young men"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The police half rise to look back at him but there is a smattering of applause and several people stand to look as well Another cheer rises and when it subsides Tyeb Mohammed stands near the back seated with several other young men This is the more sober Gandhi they have come to know Gandhi waits and then looks at the audience The audience reacts tentatively but with uncertainty He looks down at the police to emphasize his point he wanted a firm mature determined one Gandhi now has their attention and receives the response After a moment a merchant stands to signify his pledge followed by Tyeb Mohammed and the youths around him Gandhi holds up his hand and looks at the audience Gandhi looks at the full theater all standing and takes a step forward Then throughout the theater and on the stage everyone begins to stand until all are standing Gandhi Singh and Tyeb Mohammed lead a large procession of Indian mine workers along a dirt road from a mining complex with sheds elevator platforms and pulleys toward a distant city A prison door slams focusing on one face then another slam another face rhythmically in time with marching feet There is little hesitation in the ranks as the car gets closer Tyeb Mohammed touches Gandhi's arm and nods ahead as a canvastopped open touring car circa 1910 emerges from a turning between two factory buildings and approaches them He looks from Gandhi to the miners and then looks at Gandhi sharply before smiling derisively and signaling the car off In it there are two uniformed policemen and a civilian who smiles slowly Gandhi watches the disappearing car worriedly but then turns to signal the miners to move on and they start forward As it pulls away Tyeb Mohammed and Singh approach Gandhi both wary of the man's evident satisfaction with what has transpired Tracking back before Gandhi The car rides past the factory building from which it turned and suddenly mounted police swing out from the buildings to face the procession fear suddenly makes their pace more labored while tracking back before the fastapproaching mounted police with batons at the ready Singh and Tyeb Mohammed as they move forward Tyeb Mohammed sets his jaw in defiance and Singh forces himself along at Gandhi's side as the mounted police ride on with batons ready Gandhi screws up his courage and marches on Gandhi is in the front rank of the procession watching the horses approach with a blunt farmer's face"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Tyeb Mohammed touches Gandhi's arm and nods ahead as a canvastopped open touring car circa 1910 emerges from a turning between two factory buildings and approaches them There is little hesitation in the ranks as the car gets closer In it there are two uniformed policemen and a civilian who smiles slowly He looks from Gandhi to the miners and then looks at Gandhi sharply before smiling derisively and signaling the car off As it pulls away Tyeb Mohammed and Singh approach Gandhi both wary of the man's evident satisfaction with what has transpired Gandhi watches the disappearing car worriedly but then turns to signal the miners to move on and they start forward The car rides past the factory building from which it turned and suddenly mounted police swing out from the buildings to face the procession Tracking back before Gandhi Singh and Tyeb Mohammed as they move forward fear suddenly makes their pace more labored while tracking back before the fastapproaching mounted police with batons at the ready Gandhi screws up his courage and marches on Tyeb Mohammed sets his jaw in defiance and Singh forces himself along at Gandhi's side as the mounted police ride on with batons ready Gandhi is in the front rank of the procession watching the horses approach with a blunt farmer's face Another cheer rises and when it subsides Tyeb Mohammed stands near the back seated with several other young men The police half rise to look back at him but there is a smattering of applause and several people stand to look as well Gandhi waits and then looks at the audience This is the more sober Gandhi they have come to know He looks down at the police to emphasize his point The audience reacts tentatively but with uncertainty Gandhi now has their attention and receives the response he wanted a firm mature determined one Gandhi holds up his hand and looks at the audience After a moment a merchant stands to signify his pledge followed by Tyeb Mohammed and the youths around him Then throughout the theater and on the stage everyone begins to stand until all are standing Gandhi looks at the full theater all standing and takes a step forward A prison door slams focusing on one face then another slam another face rhythmically in time with marching feet Gandhi Singh and Tyeb Mohammed lead a large procession of Indian mine workers along a dirt road from a mining complex with sheds elevator platforms and pulleys toward a distant city"
        }
      ]
    }
  ]
}