{
  "ground_truth": "Chili watches a woman on the sidewalk pause to tighten the scarf around her neck, then turns and studies Tommy for a moment before Tommy looks at him. As Chili gets up from the table, the other men around the table follow his lead as he finishes up some jokes. He merely watches in the glass as Tommy turns up his collar and steps out into the cold Miami day. A moment later, the manager, an old Italian guy in a black suit, joins him in the doorway, looks off-screen, and begins speaking in Italian. Chili stares straight ahead, rubs his hands together, and tries to stay warm. Tommy drives, and Chili points out the window. Tommy looks up at the hotel as Chili takes a pair of leather gloves from the top of the dash and opens the door. Tommy pulls up out front, and Chili knocks on the door three times; he waits, pulls the right-hand glove on tight, so that when Ray Bones opens the door, Chili nails him with one punch. Later, Chili and Tommy each sit in a barber chair, reading the newspaper, while Fred and Ed sit nearby playing checkers. A car pulls up, and Chili is no longer listening to Tommy but instead watching as Ray Bones and a Black Guy get out of the car. Ray Bones eyes Chili, then nods to Fred and Ed, while Tommy looks over as Ray Bones, with a smaller bandage on the top of his head, and his man enter the shop. The two guys leave as the Black Guy steps up to Chili, who exchanges a look with Tommy, watches as 'Mr. Bones' goes down the hall into the back office, then turns to the Black Guy. Ray Bones comes out with the collection book open, looking at all of the names of who owes what, stepping over to Chili. Ray Bones checks his man for some appreciation, but the guy is too busy looking at the hair rinses and other items on the counter. Tommy watches as the Black Guy picks up a pair of scissors, runs his hand along the edge, and Ray throws the book at Chili and walks out, his man right behind him. Ray Bones then nods to his man, who grabs Chili and holds the point of the scissors to Chili's throat. Chili looks over at Tommy. Finally, Chili sits with Fay Devoe, an attractive woman in her thirties wearing a sundress, on her patio. They each have a drink, and she looks at him, touching her drink to the side of her face as they sit there in silence for a moment. Fay reaches over, puts a hand on his leg, and Chili finishes his drink, setting it down. She finally looks at Chili.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Chili observes a lady on the pavement halt to fasten the muffler around her throat, then pivots and examines Tommy for an instant before Tommy glances at him. As Chili rises from the table, the other men around the table follow his example as he concludes some quips. He simply observes in the glass as Tommy turns up his collar and strides out into the chilly Miami daytime. An instant later, the director, an aged Italian fellow in a black suit, joins him in the entryway, gazes off-screen, and starts speaking in Italian. Chili stares directly onward, rubs his hands together, and endeavors to remain warm. Tommy drives, and Chili indicates out the window. Tommy glances up at the lodge as Chili takes a pair of leather mittens from the top of the dash and opens the door. Tommy pulls up out front, and Chili taps on the door thrice; he waits, pulls the right-hand mitten on snug, so that when Ray Bones opens the door, Chili smacks him with one blow. Subsequently, Chili and Tommy each sit in a barber chair, perusing the newspaper, while Fred and Ed sit nearby playing checkers. An automobile pulls up, and Chili is no longer listening to Tommy but instead observing as Ray Bones and a Black Guy exit the vehicle. Ray Bones glances at Chili, then nods to Fred and Ed, while Tommy looks over as Ray Bones, with a smaller bandage on the top of his head, and his man enter the shop. The two fellows leave as the Black Guy steps up to Chili, who exchanges a look with Tommy, watches as 'Mr. Bones' proceeds down the corridor into the rear office, then turns to the Black Guy. Ray Bones emerges with the ledger open, scanning all of the names of who owes what, stepping over to Chili. Ray Bones checks his man for some recognition, but the guy is too occupied examining the hair rinses and other items on the counter. Tommy watches as the Black Guy picks up a pair of shears, runs his hand along the edge, and Ray throws the book at Chili and walks out, his man right behind him. Ray Bones then nods to his man, who seizes Chili and holds the tip of the shears to Chili's throat. Chili glances over at Tommy. Ultimately, Chili sits with Fay Devoe, an alluring lady in her thirties wearing a sundress, on her patio. They each have a drink, and she looks at him, touching her drink to the side of her face as they sit there in silence for a moment. Fay reaches over, places a hand on his leg, and Chili finishes his drink, setting it down. She finally looks at Chili."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A woman on the sidewalk is watched by Chili as she pauses to tighten the scarf around her neck, then Tommy is studied by him for a moment before he is looked at by Tommy. As the table is left by Chili, his lead is followed by the other men around the table as some jokes are finished by him. He merely watches in the glass as the collar is turned up by Tommy and the cold Miami day is stepped out into by him. A moment later, he is joined in the doorway by the manager, an old Italian guy in a black suit, who looks off-screen and begins speaking in Italian. Straight ahead is stared at by Chili, who rubs his hands together and tries to stay warm. Chili points out the window as Tommy drives. The hotel is looked up at by Tommy as a pair of leather gloves is taken by Chili from the top of the dash, and the door is opened by him. The car is pulled up out front by Tommy, and the door is knocked on three times by Chili; the right-hand glove is pulled on tightly by him, so that when the door is opened by Ray Bones, he is nailed with one punch by Chili. Later, in a barber chair each sits Chili and Tommy, reading the newspaper, while nearby Fred and Ed play checkers. A car pulls up, and Tommy is no longer listened to by Chili but instead Ray Bones and a Black Guy are watched as they get out of the car by him. Chili is eyed by Ray Bones, then Fred and Ed are nodded to by him, while over looks Tommy as Ray Bones, with a smaller bandage on the top of his head, and his man enter the shop. The shop is left by the two guys as Chili is stepped up to by the Black Guy, who exchanges a look with Tommy, watches as the hall into the back office is gone down by 'Mr. Bones', then turns to the Black Guy. Ray Bones comes out with the collection book open, looking at all of the names of who owes what, stepping over to Chili. Some appreciation is checked for his man by Ray Bones, but the guy is kept too busy looking at the hair rinses and other items on the counter. Tommy watches as a pair of scissors is picked up by the Black Guy, who runs his hand along the edge, and the book is thrown at Chili by Ray, who walks out, his man right behind him. Ray Bones then nods to his man, who grabs Chili and holds the point of the scissors to Chili's throat. Tommy is looked over at by Chili. Finally, with Fay Devoe, an attractive woman in her thirties wearing a sundress, on her patio sits Chili. They each have a drink, and she looks at him, touching her drink to the side of her face as a moment is sat there in silence by them. His leg is put a hand on by Fay as his drink is finished by Chili, setting it down. Finally, Chili is looked at by her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Chili observes a woman tightening her scarf on the sidewalk, then turns his attention to Tommy. As Chili rises from the table, others follow, finishing some jokes. He watches through the glass as Tommy turns up his collar and steps into the chilly Miami day. An old Italian manager in a black suit joins him at the doorway, speaking in Italian. Chili rubs his hands to stay warm while Tommy drives, and Chili gestures out the window. Tommy glances at the hotel as Chili dons leather gloves and opens the door. Tommy stops in front, and Chili knocks three times before punching Ray Bones as he opens the door. Later, Chili and Tommy read newspapers in barber chairs while Fred and Ed play checkers. A car arrives, and Chili watches Ray Bones and another man exit. Ray acknowledges Chili, nods to Fred and Ed, and enters with a smaller bandage on his head. The pair leave as the Black Guy approaches Chili, who exchanges looks with Tommy. Ray Bones departs with a collection book, noting debts, and checks his man, who's distracted by the counter items. Tommy observes the Black Guy picking up scissors, testing their edge, as Ray throws the book at Chili and leaves with his man. Ray's man grabs Chili, holding scissors to his throat, while Chili looks at Tommy. Finally, Chili sits with Fay Devoe, an attractive woman in her thirties, on her patio. They enjoy drinks in silence until Fay touches Chili's leg, and he finishes his drink. She then looks at Chili."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Chili watches a woman adjust her scarf, glances at Tommy, and rises from the table as others follow him. He watches as Tommy turns up his collar and exits into the cold Miami day. An old Italian manager in a black suit joins him, speaking in Italian. Chili, trying to stay warm, sees Tommy drive, points out the window, and takes leather gloves from the dash as they stop at a hotel. Chili knocks, waits, and punches Ray Bones when he answers. Later, Chili and Tommy read newspapers in barber chairs while Fred and Ed play checkers. A car arrives carrying Ray Bones and a Black Guy. Ray, with a bandaged head, enters the shop, nods at Fred and Ed. The Black Guy approaches Chili as Mr. Bones goes into the back office. Ray examines a collection book, throws it at Chili, and exits. His man grabs Chili, holding scissors to his throat. Chili glances at Tommy. Finally, Chili sits with Fay Devoe, an attractive woman in a sundress, on her patio. They drink in silence until Fay touches her face with her drink, then places a hand on Chili's leg. Chili finishes his drink, and she looks at him."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Chili, from his vantage point, attentively observes a woman on the bustling sidewalk as she pauses momentarily to adjust and snugly fasten the scarf wrapped around her neck. Afterward, he shifts his gaze to study Tommy, albeit briefly, before Tommy turns his attention toward him. As Chili rises from the table, the other men seated around it are quick to follow his example while he wraps up telling a series of jokes. With a nonchalant demeanor, he observes through the window as Tommy turns up the collar of his coat and steps out into the brisk, chilly air of a cold day in Miami. \n\nShortly thereafter, the manager, an elderly Italian gentleman attired in a classic black suit, joins Tommy at the doorway. He gazes off into the distance before beginning to speak animatedly in Italian. Chili looks straight ahead, an intent expression on his face, and rubs his hands together in an attempt to generate warmth. As Tommy drives the car, Chili gestures out the window, pointing something out. Tommy, in response, gazes upward at the hotel as Chili retrieves a pair of fine leather gloves from the dashboard. He opens the car door decisively, and as Tommy stops the vehicle at the entrance, Chili approaches the door, knocking firmly three times. He waits, pulling the right-hand glove on snugly, so that when Ray Bones opens the door, Chili lands a swift, effective punch.\n\nLater on, both Chili and Tommy are comfortably seated in barber chairs, engrossed in reading the newspaper, as Fred and Ed sit close by, engaged in a game of checkers. A car arrives, drawing Chili's attention away from their conversation, and he becomes alert as Ray Bones and a Black Guy exit the vehicle. Ray Bones scrutinizes Chili, offering a nod to Fred and Ed, while Tommy shifts his focus toward Ray Bones, who now bears a small bandage atop his head. As Ray Bones and his associate enter the establishment, the two other men make their exit. The Black Guy approaches Chili, who exchanges a knowing glance with Tommy, observing as Ray Bones proceeds down the hall into the back office, and then turns his attention to the Black Guy.\n\nRay Bones emerges, holding the open collection book, scrutinizing the list of names detailing who owes money. He strides over to Chili, glancing at his associate for approval or acknowledgment, but the man remains preoccupied, distracted by the array of hair rinses and other items displayed on the counter. Tommy watches intently as the Black Guy picks up a pair of scissors, running his hand carefully along the sharp edge. Ray Bones, in a sudden motion, throws the book at Chili, taking his leave with his associate trailing closely behind. Ray Bones then signals his man, who seizes Chili by the arms, holding the sharp point of the scissors menacingly against Chili's throat. Chili glances over toward Tommy in a silent communication.\n\nEventually, Chili finds himself seated with Fay Devoe, an alluring woman in her thirties, dressed in a light, flowing sundress, as they relax on her patio. Each holding a drink, they share a companionable silence. Fay gazes at Chili, gently pressing the cool glass against her cheek, and after a moment, she reaches out, placing a hand gently on his leg. Chili finishes his drink, setting the empty glass down with a quiet resolution. She finally turns her gaze on Chili, their eyes meeting in a moment of understanding."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "From his vantage point, Chili attentively observes a woman positioned on the bustling, lively sidewalk. She pauses for a fleeting moment to adjust and snugly fasten the scarf that is wrapped securely around her neck. After completing this task, Chili shifts his gaze to briefly study Tommy before Tommy turns his own attention directly toward him. As Chili leisurely rises from the table, the other men seated in his company promptly follow his lead, doing so while he wraps up telling a series of amusing jokes. With an air of nonchalance, he peers through the window, witnessing Tommy as he turns up the collar of his coat and steps out into the brisk, chilly air typical of a cold day in the vibrant city of Miami.\n\nIn a short span of time thereafter, the manager, an elderly Italian gentleman who is attired in a classic, well-fitted black suit, joins Tommy standing at the doorway. He gazes off into the distance before he begins to speak animatedly in fluent Italian. Meanwhile, Chili looks straight ahead, with an intent expression etched onto his face, as he rubs his hands together in an effort to generate some warmth. As Tommy drives the car, Chili gestures out of the window, pointing something out with purposeful clarity. In response, Tommy gazes upward at the towering hotel as Chili retrieves a pair of fine leather gloves from the dashboard. With determined decisiveness, he opens the car door and, as Tommy brings the vehicle to a halt at the entrance, Chili approaches the door, knocking firmly and deliberately three times. He waits, pulling the right glove on snugly and securely, and when Ray Bones opens the door, Chili delivers a swift, effective punch without hesitation.\n\nLater on in the sequence of events, both Chili and Tommy find themselves comfortably seated in barber chairs, engrossed in reading their newspapers, as Fred and Ed sit in close proximity, deeply engaged in a game of checkers. A car arrives, drawing Chili's attention away from their conversation, and he becomes suddenly alert as Ray Bones and a Black Guy exit the vehicle. Ray Bones scrutinizes Chili carefully, offering a small nod to Fred and Ed, while Tommy shifts his focus toward Ray Bones, who now sports a small bandage perched atop his head. As Ray Bones and his associate enter the establishment, the two other men make their exit, leaving the scene. The Black Guy approaches Chili, who exchanges a knowing, meaningful glance with Tommy, observing as Ray Bones proceeds down the hall into the back office, and then Chili turns his attention to the Black Guy, keenly aware of the unfolding situation.\n\nRay Bones eventually emerges, holding the open collection book, carefully scrutinizing the list of names that details who owes money. He strides confidently over to Chili, glancing at his associate for a form of approval or acknowledgment, but the man remains preoccupied, distracted by the array of hair rinses and other assorted items displayed neatly on the counter. Tommy watches the scene intently as the Black Guy picks up a pair of scissors, running his hand carefully along the sharp edge with deliberate caution. In a sudden, unexpected motion, Ray Bones throws the collection book at Chili before taking his leave, with his associate trailing closely behind him. Ray Bones then signals to his man, who swiftly seizes Chili by the arms, holding the sharp point of the scissors menacingly against Chili's throat. Chili glances over toward Tommy in a silent, wordless communication, sharing the urgency of the moment.\n\nEventually, Chili finds himself seated in a relaxed manner with Fay Devoe, an alluring woman in her thirties, who is dressed in a light, flowing sundress as they unwind on her patio. Each of them holds a drink, and they share a companionable silence that is comforting and pleasant. Fay gazes at Chili, gently pressing the cool surface of the glass against her cheek, and after a brief moment of consideration, she reaches out, placing a hand gently on his leg, offering a gesture of connection. Chili finishes his drink, setting the empty glass down with a quiet, but firm, resolution. She finally turns her gaze directly onto Chili, and their eyes meet in a moment of mutual understanding and shared sentiment."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Chili stands on the sidewalk, attentively observing a woman as she pauses to adjust her scarf, carefully tightening it around her neck. His attention then shifts as he turns to study Tommy, taking a brief moment to scrutinize him until Tommy notices and makes eye contact with him. As Chili makes the decision to rise from his seated position at the table, the men sitting around him instinctively follow his lead and stand up as well. During this transition, Chili rounds off his conversation by wrapping up a few jokes. Meanwhile, his gaze drifts to the reflection in the glass, where he sees Tommy adjusting his collar before stepping out into the crisp air of a cold Miami day. In the next moment, the manager, an elderly Italian man dressed in a sleek black suit, joins Chili at the doorway. The manager looks into the distance, begins speaking in Italian, while Chili fixes his gaze straight ahead, rubbing his hands together to generate warmth and stave off the cold. Eventually, Tommy is behind the wheel, driving, as Chili, seated beside him, gestures out of the window. Tommy glances up at the hotel that Chili is pointing out, leading Chili to retrieve a pair of leather gloves from the dashboard's top. Without hesitation, he pushes open the car door, stepping out as Tommy maneuvers the vehicle to a stop in front. Once there, Chili raps on the door three times, waits momentarily, then pulls on his right glove with precision, preparing to unleash a punch as Ray Bones opens the door. The scene shifts to later, where both Chili and Tommy occupy barber chairs, engrossed in their newspapers, while Fred and Ed are engaged in a game of checkers nearby. As a car pulls up, Chili's focus shifts away from Tommy's conversation to the sight of Ray Bones and a Black Guy exiting the vehicle. Ray Bones momentarily locks eyes with Chili, offering a nod to Fred and Ed, before Tommy's attention is also drawn to Ray Bones, who sports a small bandage on his head. Ray Bones and his companion make their way into the barber shop, prompting the two men to depart. The Black Guy approaches Chili, who, exchanging a glance with Tommy, redirects his attention as 'Mr. Bones' strides down the hall into the back office. Ray Bones emerges with a collection book, flipping through the pages of debts owed, before converging towards Chili. Ray Bones momentarily checks his companion for any acknowledgment, but the man is preoccupied, examining the various hair rinses and items displayed on the counter. Tommy observes as the Black Guy picks up a pair of scissors, running his hand along its sharp edges. Abruptly, Ray Bones hurls the collection book at Chili, exits the shop, his man trailing closely behind. Ray Bones signals to his man, who quickly grips Chili, pressing the scissors' point against his throat. In this tense moment, Chili glances over at Tommy for reassurance. Later, the scene softens as Chili finds himself seated on a patio with Fay Devoe, an attractive woman in her thirties clad in a sundress. Each holding a drink, Fay gently presses her glass to her face as they share a silent moment. She then reaches over, placing a comforting hand on Chili's leg. In response, Chili finishes his drink, setting the glass down with finality. Finally, Fay turns her gaze to meet Chili's, creating a moment of connection."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Chili observes a woman on the sidewalk adjusting her scarf and then briefly shifts his attention to Tommy. As Chili rises from the table, the other men follow, completing their conversation. He watches through the glass as Tommy turns up his collar and steps into the chilly Miami air. Soon after, an old Italian manager in a black suit joins Chili in the doorway, conversing in Italian. Chili focuses ahead, warms his hands, and points out the window as Tommy drives. Chili grabs leather gloves from the dash, and as Tommy stops in front of the hotel, Chili exits and knocks on the door. When Ray Bones opens it, Chili swiftly punches him. Later, Chili and Tommy relax in barber chairs, reading newspapers, while Fred and Ed play checkers nearby. When a car arrives, Chili notices Ray Bones and another man disembark and head into the shop. Ray, with a bandaged head, acknowledges Fred and Ed before entering with his companion. As Ray proceeds to the back office, the Black Guy confronts Chili, who exchanges a look with Tommy. Ray returns with the collection book, reviews it, and throws it at Chili before departing with his man. Signaling his companion, Ray leaves Chili with scissors pointed at his throat. Later, Chili sits quietly with Fay Devoe on her patio. They share a silent moment, drinks in hand, until Fay places a hand on his leg and Chili finishes his drink."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Chili watches a woman on the sidewalk, a bustling part of Miami known for its art deco architecture, pause to tighten the scarf around her neck, then turns and studies Tommy for a moment before Tommy looks at him. As Chili gets up from the table at a small, iconic Miami café famous for its Cuban coffee, the other men around the table follow his lead as he finishes up some jokes. He merely watches in the reflective glass window as Tommy turns up his collar and steps out into the cold Miami day, which is uncharacteristically chilly for this subtropical city known for its warm climate. A moment later, the manager, an old Italian guy with a history of running neighborhood delis in Little Italy, now in a black suit, joins him in the doorway, looks off-screen, and begins speaking in Italian, a language reflecting his heritage. Chili stares straight ahead, rubs his hands together to fend off the unusual cold, and tries to stay warm. Tommy drives the classic car, a vintage Cadillac, and Chili points out the window at the passing palm trees. Tommy looks up at the hotel, a historic building once frequented by movie stars in the 1950s, as Chili takes a pair of leather gloves from the top of the dash and opens the door. Tommy pulls up out front, and Chili knocks on the door three times; he waits, pulls the right-hand glove on tight, so that when Ray Bones, a notorious local enforcer with a grudge against Chili, opens the door, Chili nails him with one punch. Later, Chili and Tommy each sit in a barber chair, reading the newspaper that features articles on the latest Miami Beach developments, while Fred and Ed sit nearby playing checkers, a game popular in this neighborhood barbershop. A car pulls up, and Chili is no longer listening to Tommy but instead watching as Ray Bones and a Black Guy, known in the area for his connections to the underground scene, get out of the car. Ray Bones eyes Chili with lingering resentment, then nods to Fred and Ed, while Tommy looks over as Ray Bones, with a smaller bandage on the top of his head from the earlier punch, and his man enter the shop. The two guys leave as the Black Guy steps up to Chili, who exchanges a look with Tommy, watches as 'Mr. Bones' goes down the hall into the back office used for private dealings, then turns to the Black Guy. Ray Bones comes out with the collection book open, a record of debts and credits within his circle, looking at all of the names of who owes what, stepping over to Chili. Ray Bones checks his man for some appreciation, but the guy is too busy looking at the hair rinses and other items on the counter, typical products found where locals catch up on the neighborhood gossip. Tommy watches as the Black Guy picks up a pair of scissors, runs his hand along the edge to test their sharpness, and Ray throws the book at Chili and walks out, his man right behind him. Ray Bones then nods to his man, who grabs Chili and holds the point of the scissors to Chili's throat, a warning gesture in a precarious situation. Chili looks over at Tommy, seeking a sign of reassurance. Finally, Chili sits with Fay Devoe, an attractive woman in her thirties known for her successful art gallery, on her patio, a space overlooking a lush garden. They each have a drink, and she looks at him, touching her drink to the side of her face as they sit there in silence for a moment, the tension of the day melting away. Fay reaches over, puts a hand on his leg, and Chili finishes his drink, setting it down with a sense of finality. She finally looks at Chili, her eyes searching for unspoken understanding."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Chili watches a woman on the sidewalk pause to tighten the scarf around her neck then turns and studies Tommy for a moment before Tommy looks at him. As Chili gets up from the table the other men around the table follow his lead as he finishes up some jokes. He merely watches in the glass as Tommy turns up his collar and steps out into the cold Miami day. A moment later the manager an old Italian guy in a black suit joins him in the doorway looks offscreen and begins speaking in Italian. Chili stares straight ahead rubs his hands together and tries to stay warm. Tommy drives and Chili points out the window. Tommy looks up at the hotel as Chili takes a pair of leather gloves from the top of the dash and opens the door. Tommy pulls up out front and Chili knocks on the door three times. he waits pulls the righthand glove on tight so that when Ray Bones opens the door Chili nails him with one punch. Later Chili and Tommy each sit in a barber chair reading the newspaper while Fred and Ed sit nearby playing checkers. A car pulls up and Chili is no longer listening to Tommy but instead watching as Ray Bones and a Black Guy get out of the car. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Ray Bones eyes. Chili then nods to Fred and Ed while Tommy looks over as Ray Bones with a smaller bandage on the top of his head and his man enter the shop. The two guys leave as the Black Guy steps up to Chili who exchanges a look with Tommy watches as 'Mr Bones' goes down the hall into the back office then turns to the Black Guy. Ray Bones comes out with the collection book open looking at all of the names of who owes what stepping over to Chili. Ray Bones checks his man for some appreciation but the guy is too busy looking at the hair rinses and other items on the counter. Tommy watches as the Black Guy picks up a pair of scissors runs his hand along the edge and Ray throws the book at Chili and walks out his man right behind him. Ray Bones then nods to his man who grabs Chili and holds the point of the scissors to Chili's throat. Chili looks over at Tommy. Finally Chili sits with Fay Devoe an attractive woman in her thirties wearing a sundress on her patio. They each have a drink and she looks at him touching her drink to the side of her face as they sit there in silence for a moment. Fay reaches over puts a hand on his leg and Chili finishes his drink setting it down. She finally looks at Chili."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Chili watches a woman on the sidewalk pause to tighten the scarf around her neck then turns and studies Tommy for a moment before Tommy looks at him. As Chili gets up from the table the other men around the table follow his lead as he finishes up some jokes. He merely watches in the glass as Tommy turns up his collar and steps out into the cold Miami day. A moment later the manager an old Italian guy in a black suit joins him in the doorway looks offscreen and begins speaking in Italian. Chili stares straight ahead rubs his hands together and tries to stay warm. Tommy drives and Chili points out the window. Tommy looks up at the hotel as Chili takes a pair of leather gloves from the top of the dash and opens the door. Tommy pulls up out front and Chili knocks on the door three times. he waits pulls the righthand glove on tight so that when Ray Bones opens the door Chili nails him with one punch. Later Chili and Tommy each sit in a barber chair reading the newspaper while Fred and Ed sit nearby playing checkers. A car pulls up and Chili is no longer listening to Tommy but instead watching as Ray Bones and a Black Guy get out of the car. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Ray Bones eyes. Chili then nods to Fred and Ed while Tommy looks over as Ray Bones with a smaller bandage on the top of his head and his man enter the shop. The two guys leave as the Black Guy steps up to Chili who exchanges a look with Tommy watches as 'Mr Bones' goes down the hall into the back office then turns to the Black Guy. Ray Bones comes out with the collection book open looking at all of the names of who owes what stepping over to Chili. Ray Bones checks his man for some appreciation but the guy is too busy looking at the hair rinses and other items on the counter. Tommy watches as the Black Guy picks up a pair of scissors runs his hand along the edge and Ray throws the book at Chili and walks out his man right behind him. Ray Bones then nods to his man who grabs Chili and holds the point of the scissors to Chili's throat. Chili looks over at Tommy. Finally Chili sits with Fay Devoe an attractive woman in her thirties wearing a sundress on her patio. They each have a drink and she looks at him touching her drink to the side of her face as they sit there in silence for a moment. Fay reaches over puts a hand on his leg and Chili finishes his drink setting it down. She finally looks at Chili."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Chili watches a woman on the sidewalk pause to tighten the scarf around her neck then turns and studies Tommy for a moment before Tommy looks at him. As Chili gets up from the table the other men around the table follow his lead as he finishes up some jokes. He merely watches in the glass as Tommy turns up his collar and steps out into the cold Miami day. A moment later the manager an old Italian guy in a black suit joins him in the doorway looks offscreen and begins speaking in Italian. Chili stares straight ahead rubs his hands together and tries to stay warm. Tommy drives and Chili points out the window. Ray Bones then nods to his man who grabs Chili and holds the point of the scissors to Chili's throat. Chili looks over at Tommy. Finally Chili sits with Fay Devoe an attractive woman in her thirties wearing a sundress on her patio. They each have a drink and she looks at him touching her drink to the side of her face as they sit there in silence for a moment. Fay reaches over puts a hand on his leg and Chili finishes his drink setting it down. She finally looks at Chili."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Chili watches a woman on the sidewalk pause to tighten the scarf around her neck then turns and studies Tommy for a moment before Tommy looks at him. As Chili gets up from the table the other men around the table follow his lead as he finishes up some jokes. They each have a drink and she looks at him touching her drink to the side of her face as they sit there in silence for a moment. Fay reaches over puts a hand on his leg and Chili finishes his drink setting it down. She finally looks at Chili."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Frosty observes a giraffe on the boardwalk hesitate to adjust the hat on its horn, then spins and examines Jerry for a second before Jerry glances at him. As Frosty stands from the bench, the other penguins around the bench mimic his actions as he wraps up some riddles. He only peers in the mirror as Jerry flips up his hood and slides out into the warm Arctic evening. Moments later, the chef, an elderly French parrot in a red tie, joins him in the archway, gazes off-camera, and starts speaking in French. Frosty gazes directly ahead, claps his wings together, and attempts to keep cool. Jerry flies, and Frosty gestures toward the shelf. Jerry peeks up at the bakery as Frosty grabs a pair of wool socks from the edge of the ceiling and slides open the window. Jerry floats to the entrance, and Frosty taps on the wall three times; he pauses, pulls the left sock snugly, so that when Carl Stones swings open the window, Frosty surprises him with a single flick. Later, Frosty and Jerry each relax in a beach chair, skimming the magazine, while Rick and Dan sit nearby playing dominoes. An airplane descends, and Frosty is no longer chatting with Jerry but instead observing as Carl Stones and a White Wolf jump from the airplane. Carl Stones scrutinizes Frosty, then gestures to Rick and Dan, while Jerry glances over as Carl Stones, with a smaller cap on the back of his paw, and his companion enter the lounge. The two animals depart as the White Wolf approaches Frosty, who shares a glance with Jerry, watches as 'Mr. Stones' strolls down the corridor into the main cabin, then pivots to the White Wolf. Carl Stones emerges with the ledger open, scrutinizing all of the listings of who owns what, striding over to Frosty. Carl Stones checks his companion for some gratitude, but the wolf is too preoccupied inspecting the shoe polishes and other gadgets on the rack. Jerry observes as the White Wolf picks up a roll of tape, brushes his paw along the surface, and Carl flings the ledger at Frosty and strides out, his wolf right after him. Carl Stones then gestures to his wolf, who snatches Frosty and presses the edge of the tape to Frosty's chin. Frosty glances over at Jerry. At last, Frosty reclines with Sally Monaco, a charming octopus in her nineties sporting a trench coat, on her dock. They each hold a flower, and she glances at him, pressing her flower to the side of her ear as they linger there in silence for a beat. Sally reaches over, places a tentacle on his knee, and Frosty drains his flower, placing it down. She ultimately gazes at Frosty."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Chili observes a woman adjusting her scarf before he and Tommy notice each other. Rising from his table, Chili, followed by other men, finishes his jokes before stepping into the cold Miami day. Joining Tommy in the car, Chili dons leather gloves and knocks on Ray Bones' door, delivering a decisive punch when it opens. Later, Chili and Tommy sit in barber chairs, ignoring their surroundings as Ray Bones, now bandaged, arrives with an associate. The tension mounts as Ray throws a debt collection book at Chili, then instructs his man to threaten Chili with scissors to the throat. Eventually, Chili shares a quiet, intimate moment with Fay Devoe on her patio, where she gently places a hand on his leg, prompting Chili to finish his drink as they sit in silence."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She finally looks at Chili Fay reaches over puts a hand on his leg and Chili finishes his drink setting it down They each have a drink and she looks at him touching her drink to the side of her face as they sit there in silence for a moment Finally Chili sits with Fay Devoe an attractive woman in her thirties wearing a sundress on her patio Chili looks over at Tommy Ray Bones then nods to his man who grabs Chili and holds the point of the scissors to Chili's throat Tommy watches as the Black Guy picks up a pair of scissors runs his hand along the edge and Ray throws the book at Chili and walks out his man right behind him Ray Bones checks his man for some appreciation but the guy is too busy looking at the hair rinses and other items on the counter Ray Bones comes out with the collection book open looking at all of the names of who owes what stepping over to Chili The two guys leave as the Black Guy steps up to Chili who exchanges a look with Tommy watches as 'Mr Bones' goes down the hall into the back office then turns to the Black Guy Chili then nods to Fred and Ed while Tommy looks over as Ray Bones with a smaller bandage on the top of his head and his man enter the shop Ray Bones eyes A car pulls up and Chili is no longer listening to Tommy but instead watching as Ray Bones and a Black Guy get out of the car Later Chili and Tommy each sit in a barber chair reading the newspaper while Fred and Ed sit nearby playing checkers he waits pulls the righthand glove on tight so that when Ray Bones opens the door Chili nails him with one punch Tommy pulls up out front and Chili knocks on the door three times Tommy looks up at the hotel as Chili takes a pair of leather gloves from the top of the dash and opens the door Tommy drives and Chili points out the window Chili stares straight ahead rubs his hands together and tries to stay warm A moment later the manager an old Italian guy in a black suit joins him in the doorway looks offscreen and begins speaking in Italian He merely watches in the glass as Tommy turns up his collar and steps out into the cold Miami day As Chili gets up from the table the other men around the table follow his lead as he finishes up some jokes Chili watches a woman on the sidewalk pause to tighten the scarf around her neck then turns and studies Tommy for a moment before Tommy looks at him"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "As Chili gets up from the table the other men around the table follow his lead as he finishes up some jokes Chili watches a woman on the sidewalk pause to tighten the scarf around her neck then turns and studies Tommy for a moment before Tommy looks at him A moment later the manager an old Italian guy in a black suit joins him in the doorway looks offscreen and begins speaking in Italian He merely watches in the glass as Tommy turns up his collar and steps out into the cold Miami day Tommy drives and Chili points out the window Chili stares straight ahead rubs his hands together and tries to stay warm Tommy pulls up out front and Chili knocks on the door three times Tommy looks up at the hotel as Chili takes a pair of leather gloves from the top of the dash and opens the door Later Chili and Tommy each sit in a barber chair reading the newspaper while Fred and Ed sit nearby playing checkers he waits pulls the righthand glove on tight so that when Ray Bones opens the door Chili nails him with one punch Ray Bones eyes A car pulls up and Chili is no longer listening to Tommy but instead watching as Ray Bones and a Black Guy get out of the car The two guys leave as the Black Guy steps up to Chili who exchanges a look with Tommy watches as 'Mr Bones' goes down the hall into the back office then turns to the Black Guy Chili then nods to Fred and Ed while Tommy looks over as Ray Bones with a smaller bandage on the top of his head and his man enter the shop Ray Bones checks his man for some appreciation but the guy is too busy looking at the hair rinses and other items on the counter Ray Bones comes out with the collection book open looking at all of the names of who owes what stepping over to Chili Ray Bones then nods to his man who grabs Chili and holds the point of the scissors to Chili's throat Tommy watches as the Black Guy picks up a pair of scissors runs his hand along the edge and Ray throws the book at Chili and walks out his man right behind him Finally Chili sits with Fay Devoe an attractive woman in her thirties wearing a sundress on her patio Chili looks over at Tommy Fay reaches over puts a hand on his leg and Chili finishes his drink setting it down They each have a drink and she looks at him touching her drink to the side of her face as they sit there in silence for a moment She finally looks at Chili"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Chili then nods to Fred and Ed while Tommy looks over as Ray Bones with a smaller bandage on the top of his head and his man enter the shop The two guys leave as the Black Guy steps up to Chili who exchanges a look with Tommy watches as 'Mr Bones' goes down the hall into the back office then turns to the Black Guy Ray Bones comes out with the collection book open looking at all of the names of who owes what stepping over to Chili Ray Bones checks his man for some appreciation but the guy is too busy looking at the hair rinses and other items on the counter Tommy watches as the Black Guy picks up a pair of scissors runs his hand along the edge and Ray throws the book at Chili and walks out his man right behind him Ray Bones then nods to his man who grabs Chili and holds the point of the scissors to Chili's throat Chili looks over at Tommy Finally Chili sits with Fay Devoe an attractive woman in her thirties wearing a sundress on her patio They each have a drink and she looks at him touching her drink to the side of her face as they sit there in silence for a moment Fay reaches over puts a hand on his leg and Chili finishes his drink setting it down She finally looks at Chili Chili watches a woman on the sidewalk pause to tighten the scarf around her neck then turns and studies Tommy for a moment before Tommy looks at him As Chili gets up from the table the other men around the table follow his lead as he finishes up some jokes He merely watches in the glass as Tommy turns up his collar and steps out into the cold Miami day A moment later the manager an old Italian guy in a black suit joins him in the doorway looks offscreen and begins speaking in Italian Chili stares straight ahead rubs his hands together and tries to stay warm Tommy drives and Chili points out the window Tommy looks up at the hotel as Chili takes a pair of leather gloves from the top of the dash and opens the door Tommy pulls up out front and Chili knocks on the door three times he waits pulls the righthand glove on tight so that when Ray Bones opens the door Chili nails him with one punch Later Chili and Tommy each sit in a barber chair reading the newspaper while Fred and Ed sit nearby playing checkers A car pulls up and Chili is no longer listening to Tommy but instead watching as Ray Bones and a Black Guy get out of the car Ray Bones eyes"
        }
      ]
    }
  ]
}