{
  "ground_truth": "Harry's smile goes away as Chili smiles at her, and they appear hooked. Martin is leaning and then leans forward. Bo Catlett exchanges a look with the Bear and signals the waiter. Karen, Martin, and Chili walk out to the driveway, and Chili follows Martin over to the minivan, opening the door for him. In the meantime, Bo Catlett and Harry are laughing, with Harry very drunk as he finishes another drink. Harry looks at Bo, unable to believe what's happening to his life, thinks for a moment, shakes his head, and looks around the restaurant. Bo and the Bear exchange looks as Chili and Karen enter the restaurant. Chili checks out the bar, sees they aren't there, then looks up at the railing, keeping his eyes up there as he speaks. Another glance at the Bear, and they all look. Chili moves to the staircase, seeing the Bear in his Hawaiian shirt standing a few steps from the top, and slowly moves his gaze up through hibiscus until he's looking at the man's bearded face. Chili continues up the stairs to where Bo Catlett stands beside the table, unbuttons his coat, and gets within three steps of the guy before stopping, keeping his eyes fixed on the man's gut. Bo walks past Chili and goes down the stairs. Karen watches as Bo Catlett puts a hand in his coat pocket and steps right up to Chili; she looks at him. Even Karen is looking at him differently now as they slide into the booth with a now shocked, rapidly sobering Harry. Karen and Chili look at each other as Harry finishes his drink, and Harry looks at the two of them differently now. Chili looks at Karen, smiles, and shakes his head. Harry looks at him and then hangs up at the other end. Bones thinks about it a moment and tosses the book aside, while phone to his ear, Harry downs another drink and sits up as Bones bursts out of the john, grabs the phone, getting Bones's attention. Bones stares at the phone, sits there a moment, also staring at the phone, while Chili stands as Curtis opens Chili's wallet, looks at the driver's license, and Dunbar in the plaid shirt pulls the Lakers T-shirt out of the athletic bag, feels around inside. Chili watches Curtis pick up the note with the Newark Flight number and arrival time written on it, glances about to make sure no one's around, then pulls the key for the 'right' locker out from a crack in the pavement near the stairwell. Now there's a big guy in a plaid wool shirt next to him, the same guy seen when Bo Catlett was there, and another guy down the aisle talking on his hand radio.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Harry's grin fades as Chili grins at her, and they seem captivated. Martin is reclining and then inclines forward. Bo Catlett swaps a glance with the Bear and signals the server. Karen, Martin, and Chili stroll out to the driveway, and Chili trails Martin over to the minivan, opening the door for him. Meanwhile, Bo Catlett and Harry are chuckling, with Harry very intoxicated as he finishes another beverage. Harry gazes at Bo, unable to believe what's occurring to his existence, thinks for a moment, shakes his head, and glances around the restaurant. Bo and the Bear swap glances as Chili and Karen enter the restaurant. Chili checks out the bar, sees they aren't there, then looks up at the railing, keeping his eyes up there as he speaks. Another glance at the Bear, and they all look. Chili moves to the staircase, seeing the Bear in his Hawaiian shirt standing a few steps from the summit, and slowly moves his gaze up through hibiscus until he's gazing at the man's bearded visage. Chili continues up the stairs to where Bo Catlett stands beside the table, unbuttons his coat, and gets within three steps of the guy before stopping, keeping his eyes fixed on the man's stomach. Bo walks past Chili and descends the stairs. Karen watches as Bo Catlett puts a hand in his coat pocket and steps right up to Chili; she gazes at him. Even Karen is gazing at him differently now as they slide into the booth with a now stunned, rapidly sobering Harry. Karen and Chili gaze at each other as Harry finishes his beverage, and Harry gazes at the two of them differently now. Chili gazes at Karen, grins, and shakes his head. Harry gazes at him and then hangs up at the other end. Bones considers it a moment and tosses the publication aside, while phone to his ear, Harry downs another beverage and sits up as Bones bursts out of the john, grabs the phone, getting Bones's attention. Bones stares at the phone, sits there a moment, also staring at the phone, while Chili stands as Curtis opens Chili's wallet, gazes at the driver's license, and Dunbar in the plaid shirt pulls the Lakers T-shirt out of the athletic bag, feels around inside. Chili watches Curtis pick up the note with the Newark Flight number and arrival time written on it, glances about to ensure no one's around, then pulls the key for the 'right' locker out from a crack in the pavement near the stairwell. Now there's a big guy in a plaid wool shirt next to him, the same guy observed when Bo Catlett was there, and another guy down the aisle talking on his hand radio."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Harry's smile fades as he is smiled at by Chili, and they appear hooked. The posture is leaned on by Martin, and then he leans forward. A look is exchanged by Bo Catlett with the Bear, and the waiter is signaled by him. Karen, Martin, and Chili walk out to the driveway, and Martin is followed by Chili over to the minivan, with the door being opened by Chili for him. In the meantime, Bo Catlett and Harry are laughing, with another drink being finished by the very drunk Harry. Bo is looked at by Harry, unable to believe what's happening to his life; he thinks for a moment, shakes his head, and looks around the restaurant. Looks are exchanged by Bo and the Bear as Chili and Karen enter the restaurant. The bar is checked out by Chili, who sees they aren't there, then looks up at the railing, keeping his eyes up there as he speaks. Another glance is cast at the Bear, and they are all looked at. The staircase is moved to by Chili, who sees the Bear in his Hawaiian shirt standing a few steps from the top, and the man's bearded face is looked at by him as his gaze moves slowly up through hibiscus. The stairs are continued up by Chili to where Bo Catlett stands beside the table; his coat is unbuttoned by him, and he gets within three steps of the guy before stopping, keeping his eyes fixed on the man's gut. Chili is passed by Bo, who walks down the stairs. Bo Catlett is watched by Karen as he puts a hand in his coat pocket and steps right up to Chili; Bo is looked at by her. Even Karen is looking at him differently now as the booth is slid into by them with a now shocked, rapidly sobering Harry. Karen and Chili look at each other as Harry finishes his drink, and Harry looks at the two of them differently now. Karen is looked at by Chili, who smiles and shakes his head. Chili is looked at by Harry and then hangs up at the other end. The book is thought about by Bones a moment and tossed aside. While the phone is to his ear, another drink is downed by Harry, who sits up as Bones bursts out of the john, grabs the phone, and gets Bones's attention. The phone is stared at by Bones, who sits there a moment, also staring at the phone, while Curtis stands by Chili, opens Chili's wallet, looks at the driver's license, and Dunbar in the plaid shirt pulls the Lakers T-shirt out of the athletic bag, feeling around inside. Curtis is watched by Chili as he picks up the note with the Newark Flight number and arrival time written on it, glances about to make sure no one's around, then pulls the key for the 'right' locker out from a crack in the pavement near the stairwell. Now there's a big guy in a plaid wool shirt next to him, the same guy when Bo Catlett was there, and another guy is down the aisle talking on his hand radio."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Harry's smile fades as Chili grins at her, and they seem captivated. Martin leans forward, while Bo Catlett exchanges a look with the Bear and signals the waiter. Karen, Martin, and Chili exit to the driveway, and Chili opens the minivan door for Martin. Meanwhile, Bo Catlett and a very drunk Harry laugh. Harry, unable to grasp what's happening, looks around the restaurant. Bo and the Bear exchange glances as Chili and Karen enter. Chili checks the bar, notices their absence, then looks up at the railing, keeping his eyes there while speaking. He notices the Bear in a Hawaiian shirt on the stairs and watches his face. Chili ascends to Bo Catlett by a table, unbuttons his coat, and pauses a few steps away, staring at the man's gut. Bo passes Chili and descends. Karen watches as Bo approaches Chili with a hand in his coat pocket; she looks at Chili differently now as they sit with a shocked, sobering Harry. Karen and Chili exchange looks as Harry finishes his drink and views them differently. Chili smiles at Karen and shakes his head. Harry looks at him before hanging up. Bones thinks briefly and tosses the book, phone in hand. Harry downs another drink, sits up as Bones emerges, grabs the phone, catching Bones's attention. Bones stares at the phone, while Chili stands. Curtis opens Chili's wallet, checks the license, as Dunbar pulls a Lakers T-shirt from an athletic bag, feeling inside. Chili watches Curtis take a note with Newark flight details, ensuring no one's watching, then retrieves a locker key from the pavement. A big guy in a plaid shirt appears next to him, the same seen with Bo Catlett, and another guy down the aisle talks on his hand radio."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Harry's smile fades as Chili smiles at her, and they're hooked. Martin leans forward. Bo Catlett exchanges glances with the Bear and signals the waiter. Karen, Martin, and Chili leave for the driveway, and Chili opens the minivan door for Martin. Meanwhile, a drunk Harry and Bo laugh together. Harry looks at Bo, contemplates his life, shakes his head, and scans the restaurant. Bo and the Bear exchange looks as Chili and Karen enter. Chili checks the bar, then looks up at the railing. He glances at the Bear as Chili heads to the stairs, sees the Bear in a Hawaiian shirt, and slowly looks at his bearded face. Chili continues upstairs to Bo, unbuttons his coat, and halts three steps away, eyeing his gut. Bo passes Chili and descends. Karen observes as Bo puts a hand in his coat and approaches Chili. They slide into a booth with a shocked, sobering Harry. Karen and Chili exchange a look as Harry finishes his drink, viewing them differently. Chili smiles and shakes his head at Karen. Harry hangs up. Bones thinks, discards a book, and Harry drinks as Bones grabs the phone, getting his attention. Bones stares at the phone while Chili watches Curtis inspect his wallet. Dunbar, in a plaid shirt, removes a Lakers T-shirt from a bag. Chili notes Curtis picking up a note with a Newark Flight number, checks his surroundings, then retrieves a key from a crack in the pavement. A big guy in a plaid wool shirt stands nearby, the same one seen with Bo earlier, while another man talks on a hand radio."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Harry's once radiant smile fades as Chili grins at her, and the two seem captivated, appearing deeply engrossed in each other's presence. Meanwhile, Martin is initially leaning casually but then shifts his posture to lean forward with intent. Bo Catlett shares a meaningful glance with the Bear before discretely signaling the waiter. Together, Karen, Martin, and Chili make their way out to the driveway; Chili dutifully follows Martin to the waiting minivan, courteously opening the door for him. Meanwhile, back inside, Bo Catlett and Harry find themselves laughing heartily, though Harry, clearly very drunk, finishes yet another drink. He looks over at Bo, his expression one of disbelief as he tries to fathom the state of his life. After pausing to ponder for a moment, he shakes his head in dismay and scans the restaurant. While this unfolds, Bo and the Bear exchange knowing looks just as Chili and Karen make their entrance into the establishment. Chili surveys the bar, noting their absence, then shifts his gaze upward toward the railing, maintaining his focus in that direction while he speaks. Casting another glance toward the Bear, they all turn their attention. Chili proceeds toward the staircase, noticing the Bear donning a Hawaiian shirt, and standing just a few steps from the top. His gaze travels slowly upward through vivid hibiscus patterns until he meets the man's bearded face. Chili continues his ascent up the steps until he reaches the spot where Bo Catlett stands beside the table. As Chili unbuttons his coat, he comes within three steps of the man before halting, choosing to keep his eyes locked on the man's midsection. Bo nonchalantly walks past Chili, descending the stairs. Observing this, Karen sees Bo Catlett put a hand in his coat pocket before stepping right up to Chili, and she regards him intently. Even Karen's perception of him seems to shift as they settle into the booth with Harry, who is now visibly shocked and rapidly sobering. Karen exchanges a significant look with Chili as Harry finishes his drink, now viewing the pair differently. Chili glances at Karen, offering a smile before shaking his head in mild disbelief. Harry turns his gaze toward him and then disengages from the conversation. Elsewhere, Bones takes a moment to contemplate before nonchalantly tossing the book aside. While still on the phone, Harry downs yet another drink, straightening up as Bones bursts out of the restroom, urgently grabbing the phone, which seizes Bones's attention. Bones fixes a stare on the phone, sits momentarily, also staring at the phone in a stupefied manner, while Chili stands by. Curtis opens Chili's wallet, inspects the driver's license, as Dunbar, clad in a plaid shirt, pulls the Lakers T-shirt from an athletic bag and fumbles around inside it. Chili observes as Curtis picks up the note bearing the Newark Flight number and its specific arrival time. He casts a cautious glance around to ensure no one's watching before retrieving the key for the 'right' locker from a subtle crack in the pavement near the stairwell. At this moment, a big guy in a plaid wool shirt stands beside him, the same individual seen with Bo Catlett earlier, while yet another person is down the aisle engaged in conversation on his hand radio."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Harry's once radiant and infectious smile diminishes as Chili grins at her with a knowing look, creating a moment where the two seem utterly captivated, their attention deeply engrossed in each other's presence as if the world around them has paused. Meanwhile, Martin, who initially stands with a casual lean, adjusts his posture and leans forward with a newfound intent and purpose. Bo Catlett, in a moment of silent communication, shares a meaningful glance with the Bear before discreetly and subtly signaling the waiting waiter. Together, Karen, Martin, and Chili make their way out to the expansive driveway; Chili, in a gesture of respect, dutifully follows Martin to the patiently waiting minivan, courteously opening the door for him with a gentlemanly nod. Meanwhile, back inside the bustling establishment, Bo Catlett and Harry find themselves erupting into hearty laughter, though Harry, now clearly inebriated beyond his normal state, finishes yet another drink. His expression shifts to one of disbelief as he looks over at Bo, trying to comprehend the chaotic state of his life. After a brief pause, spent pondering the situation, he shakes his head slowly in dismay, casting his gaze across the restaurant as if in search of answers.\n\nAs this unfolds, Bo and the Bear exchange knowing, conspiratorial looks just as Chili and Karen make their re-entrance into the lively establishment. Chili surveys the bar area, noting with a look of keen observation their absence, then shifts his gaze upward toward the railing, maintaining his focus in that elevated direction while he speaks with a calm demeanor. Casting yet another glance toward the Bear, they all turn their attention collectively. Chili proceeds with determined steps toward the staircase, taking note of the Bear who is donning a vibrant Hawaiian shirt, standing just a few steps from the top. His gaze travels slowly, tracing through the vivid hibiscus patterns until he meets the man's bearded face with a steady, unwavering look. Chili continues his deliberate ascent up the steps until he reaches the spot where Bo Catlett stands beside the table. As he unbuttons his coat, he comes within three steps of the man before stopping, choosing to keep his focused eyes locked intently on the man's midsection. Bo, with a casual air, nonchalantly walks past Chili, descending the stairs in a relaxed manner. Observing this, Karen sees Bo Catlett put a hand in his coat pocket before stepping right up to Chili, and she regards him with intense curiosity. Even Karen’s perception seems to shift subtly as they all settle into the booth with Harry, who is now visibly shocked and rapidly sobering up from his earlier state. Karen exchanges a significant, understanding look with Chili as Harry finishes his drink, now viewing the pair in a different light. Chili glances at Karen with a soft smile before shaking his head in mild disbelief. Harry turns his gaze toward him and then chooses to disengage from the conversation.\n\nElsewhere within the establishment, Bones takes a moment to contemplate thoughtfully before nonchalantly tossing the book aside with a careless flick of his wrist. While still engaged on the phone, Harry quickly downs yet another drink, straightening up just as Bones bursts out of the restroom, urgently grabbing the phone, which instantly seizes Bones's scattered attention. Bones fixes a steady stare on the phone, sits momentarily, also staring at the device in a stupefied manner, while Chili stands by, surveying the scene. Curtis, with a meticulous air, opens Chili's wallet, inspects the driver's license with scrutiny, while Dunbar, clad in a casual plaid shirt, pulls the Lakers T-shirt from an athletic bag and fumbles around inside it with a distracted air. Chili observes intently as Curtis picks up the note bearing the Newark Flight number along with its specific arrival time. He casts a cautious glance around, ensuring no one's watching his actions, before stealthily retrieving the key for the 'right' locker from a subtle crack in the pavement near the stairwell. At this precise moment, a big guy in a thick plaid wool shirt stands beside him, the same individual who was seen earlier with Bo Catlett, while yet another person is further down the aisle, engaged in an animated conversation on his hand radio."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Harry's smile fades gradually as Chili directs a smile toward her, and they both appear captivated by the moment. Martin finds himself leaning slightly before shifting his weight to lean forward even more. Bo Catlett shares an intense look with the Bear and makes a subtle gesture to the waiter, signaling him discreetly. Meanwhile, Karen, Martin, and Chili proceed to walk toward the driveway, and Chili attentively trails Martin over to the minivan, reaching out to open the door for him with a courteous gesture. All the while, Bo Catlett and Harry are sharing a hearty laugh, with Harry notably intoxicated as he polishes off yet another drink. Harry casts a bewildered gaze toward Bo, grappling with disbelief over the current state of his life, pausing momentarily to contemplate his circumstances before shaking his head in a mix of resignation and confusion. He surveys the restaurant, taking in the surroundings with a discerning look. Bo and the Bear engage in another wordless exchange as Chili and Karen make their entrance into the restaurant. Chili scans the bar area, noting their absence, before directing his gaze upward to the railing, keeping his focus there as he begins to speak. Another quick glance at the Bear follows, prompting everyone to shift their attention. Chili then advances toward the staircase, pinpointing the Bear in his conspicuous Hawaiian shirt situated a few steps from the top, and he gradually raises his gaze through a patch of vibrant hibiscus until he meets the bearded man's face. Chili ascends the stairs to approach Bo Catlett, who stands beside a table, unfastening his coat and halting three steps away while maintaining his stare fixed on the man's midsection. Bo proceeds to pass by Chili, descending the stairs as Karen observes. Bo Catlett, with a hand tucked away in his coat pocket, steps directly up to Chili; Karen watches him keenly. Even Karen regards him with a newfound perspective as they settle into the booth alongside a now startled and sobering Harry. Karen and Chili exchange meaningful glances as Harry finishes off his drink and perceives the two of them in a new light. Chili turns to Karen, offering a smile of acknowledgment while giving a slight shake of his head. Harry observes him for a moment before turning away to hang up the call on the other end of the phone. Contemplating the situation briefly, Bones dismissively tosses a book aside, holding the phone to his ear while Harry downs yet another drink, sitting upright as Bones bursts out of the bathroom. Bones swiftly grabs the phone, drawing Bones's attention as he fixates on it, pausing briefly to stare at the device. During this moment, Chili stands attentively as Curtis opens Chili's wallet, scrutinizing the driver's license while Dunbar, clad in a plaid shirt, retrieves a Lakers T-shirt from an athletic bag and feels around inside. Chili watches intently as Curtis picks up a note with the Newark Flight number and arrival time inscribed on it, cautiously scanning his surroundings to ensure solitude, before deftly extracting a key from a crack in the pavement near the stairwell—intended for the 'right' locker. Now, there's a burly figure in a plaid wool shirt standing nearby, the same individual present when Bo Catlett was around, accompanied by another man farther down the aisle engaged in a conversation over his hand radio."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Harry's smile fades as he and Chili exchange focused looks, while Martin leans forward. Bo Catlett signals the waiter after exchanging looks with the Bear. Outside, Karen, Martin, and Chili head to the driveway, with Chili opening the minivan door for Martin. Meanwhile, a drunken Harry and Bo share a laugh, with Harry pondering his life choices, shaking his head, and scanning the restaurant. As Chili and Karen enter, Chili surveys the bar, then the railing, maintaining his gaze upward while conversing. He notices the Bear on the staircase, and his attention moves up to the man’s face. Chili ascends the stairs toward Bo Catlett, unbuttons his coat, and pauses near him, focusing on his midsection. Bo passes Chili and descends the stairs, while Karen observes his approach, noting his hand in his pocket. As they settle into the booth with a now-alert Harry, Karen and Chili exchange significant looks. Harry finishes his drink, now seeing them differently. Chili smiles at Karen and shakes his head. Harry hangs up the phone after considering the situation. Bones, meanwhile, discards a book, continues with the phone, and draws Curtis’s attention as Bones emerges from the restroom. Curtis examines Chili's wallet and a note with flight details, discreetly retrieves a locker key from near the stairwell, while a big guy in plaid and another with a hand radio nearby complete the scene."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Harry's smile goes away as Chili, a charismatic loan shark with a knack for reading people, smiles at her, and they appear hooked. Martin, a film producer known for his intense focus on details, is leaning and then leans forward. Bo Catlett, a small-time criminal with big ambitions, exchanges a look with the Bear, a stoic enforcer known for his intimidating presence, and signals the waiter. Karen, Martin, and Chili walk out to the driveway, and Chili, who often displays surprising moments of chivalry, follows Martin over to the minivan, opening the door for him. In the meantime, Bo Catlett and Harry are laughing, with Harry very drunk after downing yet another glass of bourbon, a drink he often turns to during moments of stress, as he finishes another drink. Harry looks at Bo, unable to believe what's happening to his life as his career spirals out of control, thinks for a moment, shakes his head, and looks around the upscale restaurant, known for its exclusive clientele. Bo and the Bear exchange looks as Chili and Karen enter the restaurant. Chili checks out the bar, sees they aren't there, then looks up at the railing of the elegantly designed interior, keeping his eyes up there as he speaks. Another glance at the Bear, whose reputation precedes him, and they all look. Chili moves to the staircase, seeing the Bear in his brightly colored Hawaiian shirt, standing a few steps from the top, and slowly moves his gaze up through the vibrant hibiscus flowers in the shirt's print until he's looking at the man's bearded face. Chili continues up the stairs to where Bo Catlett stands beside the table, unbuttons his coat, and gets within three steps of the guy before stopping, keeping his eyes fixed on the man's gut, remembering the stories he's heard about Bo's dealings. Bo walks past Chili and goes down the stairs. Karen watches as Bo Catlett, with an air of calculated nonchalance, puts a hand in his coat pocket and steps right up to Chili; she looks at him. Even Karen, an actress used to reading people, is looking at him differently now as they slide into the booth with a now shocked, rapidly sobering Harry. Karen and Chili look at each other as Harry finishes his drink, and Harry looks at the two of them differently now, seeing a new alliance forming. Chili looks at Karen, smiles, and shakes his head, perhaps amused at the sudden change in their dynamic. Harry looks at him and then hangs up at the other end, ending a call that could shift his fortunes. Bones, known for his impulsive decisions, thinks about it a moment and tosses the book aside, while phone to his ear, Harry downs another drink and sits up as Bones bursts out of the john, grabbing the phone, getting Bones's attention. Bones stares at the phone, sits there a moment, also staring at the phone, caught in a moment of indecision, while Chili stands as Curtis opens Chili's wallet, looks at the driver's license, and Dunbar in the plaid shirt pulls the Lakers T-shirt out of the athletic bag, feeling the quality of the fabric. Chili watches Curtis pick up the note with the Newark Flight number and arrival time written on it, glances about to make sure no one's around, then pulls the key for the 'right' locker out from a crack in the pavement near the stairwell, a location often used for discreet transactions. Now there's a big guy in a plaid wool shirt next to him, the same guy seen when Bo Catlett was there, and another guy down the aisle talking on his hand radio, ensuring their operation runs smoothly."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Bo walks past Chili and goes down the stairs Harry's smile goes away as Chili smiles at her and they appear hooked looks as Chili and Karen enter the restaurant Martin is leaning and then leans forward Bo Catlett exchanges a look with the Bear and signals the waiter Karen Martin and Chili walk out to the driveway and Chili follows Martin over to the minivan opening the door for him Harry looks at him and then hangs up at the other end In the meantime Bo Catlett and Harry are laughing with Harry very drunk as he finishes another drink Harry looks at Bo unable to believe what is happening to his life thinks for a moment shakes his head and looks around the restaurant Martin is leaning and then leans forward Bo and the Bear exchange looks as Chili and Karen enter the restaurant Chili checks out the bar sees they are not there then looks up at the railing keeping his eyes up there as he speaks Chili's wallet looks at the driver's license and Dunbar in the plaid shirt pulls the Lakers Tshirt out of the athletic bag feels around inside Another glance at the Bear and they all look Bones thinks about it a moment and tosses the book aside while phone to his ear Chili moves to the staircase seeing the Bear in his Hawaiian shirt standing a few steps from the top and slowly moves his gaze up through hibiscus until he is looking at the man's bearded face Karen Chili looks at Harry's smile goes away as Chili smiles at her and they appear hooked Chili continues up the stairs to where Bo Catlett stands beside the table unbuttons his coat and gets within three steps of the guy before stopping keeping his eyes fixed on the man's gut Bo walks past Chili and goes down the stairs Karen watches as Bo Catlett puts a hand in his coat pocket and steps right up to Chili she looks at him Even Karen is looking at him differently now as they slide into the booth with a now shocked rapidly sobering Harry Karen and Chili look at each other as Harry finishes his drink and Harry looks at the two of them differently now Chili looks at Karen smiles and shakes his head Harry looks at him and then hangs up at the other end the same guy seen when Bo Catlett was there and another guy down the aisle talking on his hand Karen and Chili look at each other as Harry finishes his drink and Harry looks at the two of them differently now Bones thinks about it a moment and tosses the book aside while phone to his ear Harry downs another drink and sits up as Bones bursts out of the john grabs the phone getting Bones's attention Bones stares at the phone sits there a moment also staring at the phone while Chili stands as Curtis opens Chili's wallet looks at the driver's license and Dunbar in the plaid shirt pulls the Lakers Tshirt out of the athletic bag feels around inside Chili watches Curtis pick up the note with the Newark Flight number and arrival time written on it glances about to make sure no one's around then pulls the key for the 'right' locker out from a crack in the pavement near the stairwell Now there is a big guy in a plaid wool shirt next to him Bo Catlett exchanges a look with the Bear and signals the waiter Martin and Chili walk out to the driveway and Chili follows Martin over to the minivan opening the door for him Bones stares at the phone sits there a moment also staring at the phone the same guy seen when Bo Catlett was there and another guy down the aisle talking on his hand Now there is a big guy in a plaid wool shirt next to him Bo and the Bear exchange radio"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Harry's smile goes away as Chili smiles at her and they appear hooked. Martin is leaning and then leans forward. Bo Catlett exchanges a look with the Bear and signals the waiter. Karen. Martin and Chili walk out to the driveway and Chili follows Martin over to the minivan opening the door for him. In the meantime Bo Catlett and Harry are laughing with Harry very drunk as he finishes another drink. Harry looks at Bo unable to believe what is happening to his life thinks for a moment shakes his head and looks around the restaurant. Bo and the Bear exchange. looks as Chili and Karen enter the restaurant. Chili checks out the bar sees they are not there then looks up at the railing keeping his eyes up there as he speaks. Another glance at the Bear and they all look. Chili moves to the staircase seeing the Bear in his Hawaiian shirt standing a few steps from the top and slowly moves his gaze up through hibiscus until he is looking at the man's bearded face. Chili continues up the stairs to where Bo Catlett stands beside the table unbuttons his coat and gets within three steps of the guy before stopping keeping his eyes fixed on the man's gut. Bo walks past Chili and goes down the stairs. Karen watches as Bo Catlett puts a hand in his coat pocket and steps right up to Chili. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. she looks at him. Even Karen is looking at him differently now as they slide into the booth with a now shocked rapidly sobering Harry. Karen and Chili look at each other as Harry finishes his drink and Harry looks at the two of them differently now. Chili looks at. Karen smiles and shakes his head. Harry looks at him and then hangs up at the other end. Bones thinks about it a moment and tosses the book aside while phone to his ear. Harry downs another drink and sits up as Bones bursts out of the john grabs the phone getting Bones's attention. Bones stares at the phone sits there a moment also staring at the phone. while Chili stands as Curtis opens. Chili's wallet looks at the driver's license and Dunbar in the plaid shirt pulls the Lakers Tshirt out of the athletic bag feels around inside. Chili watches. Curtis pick up the note with the Newark Flight number and arrival time written on it glances about to make sure no one's around then pulls the key for the 'right' locker out from a crack in the pavement near the stairwell. Now there is a big guy in a plaid wool shirt next to him. the same guy seen when Bo Catlett was there and another guy down the aisle talking on his hand. radio."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Harry's smile goes away as Chili smiles at her and they appear hooked. Martin is leaning and then leans forward. Bo Catlett exchanges a look with the Bear and signals the waiter. Karen. Martin and Chili walk out to the driveway and Chili follows Martin over to the minivan opening the door for him. In the meantime Bo Catlett and Harry are laughing with Harry very drunk as he finishes another drink. Harry looks at Bo unable to believe what is happening to his life thinks for a moment shakes his head and looks around the restaurant. Bo and the Bear exchange. looks as Chili and Karen enter the restaurant. Chili checks out the bar sees they are not there then looks up at the railing keeping his eyes up there as he speaks. Another glance at the Bear and they all look. Chili moves to the staircase seeing the Bear in his Hawaiian shirt standing a few steps from the top and slowly moves his gaze up through hibiscus until he is looking at the man's bearded face. Chili continues up the stairs to where Bo Catlett stands beside the table unbuttons his coat and gets within three steps of the guy before stopping keeping his eyes fixed on the man's gut. Bo walks past Chili and goes down the stairs. Karen watches as Bo Catlett puts a hand in his coat pocket and steps right up to Chili. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. she looks at him. Even Karen is looking at him differently now as they slide into the booth with a now shocked rapidly sobering Harry. Karen and Chili look at each other as Harry finishes his drink and Harry looks at the two of them differently now. Chili looks at. Karen smiles and shakes his head. Harry looks at him and then hangs up at the other end. Bones thinks about it a moment and tosses the book aside while phone to his ear. Harry downs another drink and sits up as Bones bursts out of the john grabs the phone getting Bones's attention. Bones stares at the phone sits there a moment also staring at the phone. while Chili stands as Curtis opens. Chili's wallet looks at the driver's license and Dunbar in the plaid shirt pulls the Lakers Tshirt out of the athletic bag feels around inside. Chili watches. Curtis pick up the note with the Newark Flight number and arrival time written on it glances about to make sure no one's around then pulls the key for the 'right' locker out from a crack in the pavement near the stairwell. Now there is a big guy in a plaid wool shirt next to him. the same guy seen when Bo Catlett was there and another guy down the aisle talking on his hand. radio."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Harry's smile goes away as Chili smiles at her and they appear hooked. Martin is leaning and then leans forward. Bo Catlett exchanges a look with the Bear and signals the waiter. Karen. Martin and Chili walk out to the driveway and Chili follows Martin over to the minivan opening the door for him. In the meantime Bo Catlett and Harry are laughing with Harry very drunk as he finishes another drink. Harry looks at Bo unable to believe what is happening to his life thinks for a moment shakes his head and looks around the restaurant. Bo and the Bear exchange. Bones stares at the phone sits there a moment also staring at the phone. while Chili stands as Curtis opens. Chili's wallet looks at the driver's license and Dunbar in the plaid shirt pulls the Lakers Tshirt out of the athletic bag feels around inside. Chili watches. Curtis pick up the note with the Newark Flight number and arrival time written on it glances about to make sure no one's around then pulls the key for the 'right' locker out from a crack in the pavement near the stairwell. Now there is a big guy in a plaid wool shirt next to him. the same guy seen when Bo Catlett was there and another guy down the aisle talking on his hand. radio."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Harry's smile goes away as Chili smiles at her and they appear hooked. Martin is leaning and then leans forward. Bo Catlett exchanges a look with the Bear and signals the waiter. Curtis pick up the note with the Newark Flight number and arrival time written on it glances about to make sure no one's around then pulls the key for the 'right' locker out from a crack in the pavement near the stairwell. Now there is a big guy in a plaid wool shirt next to him. the same guy seen when Bo Catlett was there and another guy down the aisle talking on his hand. radio."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Harry's smile goes away as the panda smiles at her, and they appear hooked. The dolphin is leaning and then leans forward. The pineapple exchanges a look with the rabbit and signals the waiter. The iguana, the dolphin, and the panda walk out to the driveway, and the panda follows the dolphin over to the minivan, opening the door for him. In the meantime, the pineapple and Harry are laughing, with Harry very drunk as he finishes another drink. Harry looks at the pineapple, unable to believe what's happening to his life, thinks for a moment, shakes his head, and looks around the restaurant. The pineapple and the rabbit exchange looks as the panda and the iguana enter the restaurant. The panda checks out the bar, sees they aren't there, then looks up at the railing, keeping his eyes up there as he speaks. Another glance at the rabbit, and they all look. The panda moves to the staircase, seeing the rabbit in his Hawaiian shirt standing a few steps from the top, and slowly moves his gaze up through hibiscus until he's looking at the man's bearded face. The panda continues up the stairs to where the pineapple stands beside the table, unbuttons his coat, and gets within three steps of the guy before stopping, keeping his eyes fixed on the man's gut. The pineapple walks past the panda and goes down the stairs. The iguana watches as the pineapple puts a hand in his coat pocket and steps right up to the panda; she looks at him. Even the iguana is looking at him differently now as they slide into the booth with a now shocked, rapidly sobering Harry. The iguana and the panda look at each other as Harry finishes his drink, and Harry looks at the two of them differently now. The panda looks at the iguana, smiles, and shakes his head. Harry looks at him and then hangs up at the other end. The turtle thinks about it a moment and tosses the book aside, while phone to his ear, Harry downs another drink and sits up as the turtle bursts out of the john, grabs the phone, getting the turtle's attention. The turtle stares at the phone, sits there a moment, also staring at the phone, while the panda stands as the chicken opens the panda's wallet, looks at the driver's license, and the dinosaur in the plaid shirt pulls the Lakers T-shirt out of the athletic bag, feels around inside. The panda watches the chicken pick up the note with the Newark Flight number and arrival time written on it, glances about to make sure no one's around, then pulls the key for the 'right' locker out from a crack in the pavement near the stairwell. Now there's a big guy in a plaid wool shirt next to him, the same guy seen when the pineapple was there, and another guy down the aisle talking on his hand radio."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Harry's grin fades as Chili grins at her, and they appear enthralled. Martin is reclining and then leans forward. Bo Catlett exchanges a look with the Panda and signals the librarian. Karen, Martin, and Chili walk out to the garden path, and Chili follows Martin over to the hovercraft, opening the door for him. In the meantime, Bo Catlett and Harry are laughing, with Harry very tipsy as he finishes another milkshake. Harry looks at Bo, unable to believe what's happening to his career, thinks for a moment, shakes his head, and looks around the museum. Bo and the Panda exchange looks as Chili and Karen enter the museum. Chili checks out the exhibit, sees they aren't there, then looks up at the canopy, keeping his eyes up there as he speaks. Another glance at the Panda, and they all look. Chili moves to the escalator, seeing the Panda in his Hawaiian shorts standing a few steps from the top, and slowly moves his gaze up through ferns until he's looking at the man's bearded face. Chili continues up the escalator to where Bo Catlett stands beside the easel, unbuttons his vest, and gets within three steps of the guy before stopping, keeping his eyes fixed on the man's elbow. Bo walks past Chili and goes down the escalator. Karen watches as Bo Catlett puts a hand in his jacket pocket and steps right up to Chili; she looks at him. Even Karen is looking at him differently now as they slide into the alcove with a now shocked, rapidly sobering Harry. Karen and Chili look at each other as Harry finishes his milkshake, and Harry looks at the two of them differently now. Chili looks at Karen, smiles, and shakes his head. Harry looks at him and then hangs up at the other end. Bones thinks about it a moment and tosses the scroll aside, while phone to his ear, Harry downs another milkshake and sits up as Bones bursts out of the storage room, grabs the phone, getting Bones's attention. Bones stares at the phone, sits there a moment, also staring at the phone, while Chili stands as Curtis opens Chili's backpack, looks at the boarding pass, and Dunbar in the plaid jacket pulls the Dodgers cap out of the duffel bag, feels around inside. Chili watches Curtis pick up the postcard with the Denver Flight number and arrival time written on it, glances about to make sure no one's around, then pulls the key for the 'right' drawer out from a crack in the sidewalk near the escalator. Now there's a big guy in a plaid flannel jacket next to him, the same guy seen when Bo Catlett was there, and another guy down the aisle talking on his wristwatch."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Harry's smile disappears as Chili waves at her, and they appear intrigued. Martin is lounging and then shifts forward. Bo Catlett shares a look with the Bear and nods to the waiter. Karen, Martin, and Chili stroll out to the driveway, and Chili accompanies Martin over to the minivan, holding the door open for him. Meanwhile, Bo Catlett and Harry are chuckling, with Harry very drunk as he starts another drink. Harry glances at Bo, unable to comprehend what's happening to his life, ponders for a moment, shrugs his shoulders, and scans the restaurant. Bo and the Bear share looks as Chili and Karen enter the restaurant. Chili surveys the bar, notices they aren't there, then glances up at the railing, keeping his gaze there as he talks. Another peek at the Bear, and they all gaze. Chili approaches the staircase, spotting the Bear in his Hawaiian shirt a few steps from the top, and gradually lifts his gaze up through hibiscus until he's peering at the man's bearded face. Chili advances up the stairs to where Bo Catlett stands beside the table, loosens his coat, and pauses within three steps of the guy, keeping his eyes on the man's gut. Bo strides past Chili and descends the stairs. Karen observes as Bo Catlett places a hand in his coat pocket and strides right up to Chili; she glances at him. Even Karen is eyeing him differently now as they slide into the booth with a now astonished, rapidly sobering Harry. Karen and Chili exchange looks as Harry finishes his drink, and Harry regards the two of them differently now. Chili glances at Karen, grins, and nods. Harry peers at him and then disconnects at the other end. Bones ponders it a moment and flings the book aside, while phone to his ear, Harry gulps another drink and straightens up as Bones charges out of the john, seizes the phone, getting Bones's attention. Bones glares at the phone, sits there a moment, also glaring at the phone, while Chili rises as Curtis flips through Chili's wallet, examines the driver's license, and Dunbar in the plaid shirt extracts the Lakers T-shirt out of the athletic bag, rummages around inside. Chili observes Curtis lift the note with the Newark Flight number and arrival time written on it, glances about to ensure no one's watching, then extracts the key for the 'right' locker out from a gap in the pavement near the stairwell. Now there's a big guy in a plaid wool shirt next to him, the same guy seen when Bo Catlett was there, and another guy down the aisle speaking on his hand radio."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Jupiter's frown goes away as Neptune grins at them, and they seem fascinated. Venus is standing and then tips forward. Saturn trades a look with the Sun and signals the balloon. Mercury, Venus, and Neptune stroll out to the porch, and Neptune trails Venus over to the scooter, opening the window for them. Meanwhile, Saturn and Jupiter are giggling, with Jupiter very tipsy as they finish another soda. Jupiter looks at Saturn, unable to comprehend what's occurring to their existence, ponders for a moment, shakes their elbow, and glances around the playground. Saturn and the Sun share glances as Neptune and Mercury enter the playground. Neptune scans the fountain, notices they aren't present, then glances up at the fence, keeping their gaze there as they converse. Another peek at the Sun, and they all observe. Neptune drifts to the ladder, noticing the Sun in their floral jacket standing a few rungs from the peak and gradually lifts their gaze up through orchids until they're staring at the person's mustached visage. Neptune proceeds up the ladder to where Saturn stands beside the bench, unbuttons their sweater, and gets within three steps of the person before halting, keeping their gaze fixed on the person's belly. Saturn strolls past Neptune and descends the ladder. Mercury observes as Saturn places a hand in their sweater pouch and steps right up to Neptune; they glance at them. Even Mercury is observing them differently now as they slip into the cave with a now startled, quickly waking Jupiter. Mercury and Neptune exchange glances as Jupiter concludes their soda, and Jupiter views the pair differently now. Neptune glances at Mercury, grins, and shakes their elbow. Jupiter gazes at them and then hangs on at the opposite end. Stars muse over it a moment and flips the magazine aside, while ear to their elbow, Jupiter gulps another soda and sits up as Stars burst out of the kiosk, snatches the magazine, getting Stars' attention. Stars glare at the magazine, perches there a moment, also glaring at the magazine, while Neptune stands as Orion opens Neptune's purse, glances at the identity card, and Galaxy in the striped jacket pulls the Bulls jersey out of the gym duffel, feels around inside. Neptune observes Orion pick up the slip with the Boston Train number and departure time penned on it, peeks around to ensure no one's close, then extracts the token for the 'correct' basket from a crevice in the alley near the ladder. Now there's a tall character in a striped wool jacket beside them, the same character seen when Saturn was around, and another character down the path chatting on their wrist device."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Ron's grin fades as Clover grins at him, and they appear mesmerized. Sam is reclining and then bends sideways. Joe Finley trades a look with the Hawk and gestures to the chef. Lisa, Sam, and Clover jog out to the terrace, and Clover trails Sam over to the sedan, shutting the door for him. Meanwhile, Joe Finley and Ron are chuckling, with Ron quite tipsy as he pours another drink. Ron glances at Joe, unable to comprehend what's happening to his life, ponders briefly, nods his head, and scans the bistro. Joe and the Hawk trade glances as Clover and Lisa enter the bistro. Clover glances at the lounge, notices they aren't present, then glances up at the banister, keeping his eyes there as he converses. Another look at the Hawk, and they all observe. Clover proceeds to the escalator, spotting the Hawk in his floral vest standing a few steps from the summit, and leisurely shifts his gaze up through orchids until he's gazing at the man's mustached face. Clover proceeds up the escalator to where Joe Finley stands beside the counter, fastens his jacket, and gets within three steps of the fellow before halting, keeping his eyes fixed on the man's torso. Joe walks past Clover and descends the escalator. Lisa observes as Joe Finley places a hand in his jacket pocket and steps right up to Clover; she glances at him. Even Lisa is observing him differently now as they squeeze into the booth with a now astonished, quickly sobering Ron. Lisa and Clover gaze at each other as Ron polishes off his drink, and Ron observes the two of them differently now. Clover glances at Lisa, grins, and nods his head. Ron glances at him and then hangs at the other corner. Rocks ponders it momentarily and flings the magazine aside, while handset to his ear, Ron gulps another drink and stands up as Rocks darts out of the lavatory, snatches the handset, getting Rocks's attention. Rocks gawks at the handset, sits there for a moment, also gawking at the handset, while Clover rises as Tyler opens Clover's purse, glances at the ID card, and Simmons in the checkered vest draws the Knicks cap out of the duffel bag, feels around inside. Clover observes Tyler pick up the slip with the Denver Flight digits and landing time scribbled on it, peers about to ensure no one's near, then retrieves the token for the 'correct' locker out from a crevice in the floor near the escalator. Now there's a tall fellow in a checkered wool vest beside him, the same fellow seen when Joe Finley was there, and another fellow down the corridor chatting on his walkie-talkie."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Harry's grin fades as Chili grins at her, and they seem captivated. Martin is reclining and then reclines backward. Bo Catlett trades a gesture with the Bear and gestures to the gardener. Karen, Martin, and Chili amble out to the porch, and Chili trails Martin over to the bicycle, closing the gate for him. Meanwhile, Bo Catlett and Harry are giggling, with Harry very merry as he samples another cupcake. Harry glances at Bo, perplexed by what's occurring, ponders briefly, jerks his hand, and scans the buffet. Bo and the Bear share gestures as Chili and Karen enter the buffet. Chili surveys the piano, notices they aren't present, then gazes up at the chandelier, keeping his attention there as he articulates. Another glance at the Bear, and they all peer. Chili drifts to the escalator, spotting the Bear in his Hawaiian shorts standing a few steps from the bottom, and gradually shifts his glance down through orchids until he's observing the man's spectacled face. Chili proceeds down the escalator to where Bo Catlett stands beside the fountain, buttons his hat, and gets within three paces of the guy before halting, keeping his gaze fixed on the man's shoes. Bo strides past Chili and ascends the escalator. Karen observes as Bo Catlett places a hand in his jacket pocket and strolls right past Chili; she surveys him. Even Karen is regarding him differently now as they drift into the carousel with a now surprised, rapidly awakening Harry. Karen and Chili gaze at each other as Harry tips his cupcake, and Harry regards the duo differently now. Chili glances at Karen, grins, and nods his hand. Harry stares at him and then hangs up at the alternate end. Bones ponders it a moment and hurls the magazine aside, while phone to his shoulder, Harry gulps another cupcake and stretches up as Bones dashes out of the closet, grabs the phone, catching Bones's interest. Bones gapes at the phone, settles there a moment, also gaping at the phone, while Chili rises as Curtis examines Chili's backpack, checks the library card, and Dunbar in the striped sweater pulls the Yankees cap out of the picnic basket, digs around inside. Chili observes Curtis lift the memo with the Boston Train number and departure time scribbled on it, glances around to ensure no one's nearby, then retrieves the coin for the 'left' locker out from a shrub near the elevator. Now there's a huge guy in a checkered denim jacket next to him, the same guy spotted when Bo Catlett was there, and another guy down the corridor chatting on his shoe radio."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Flora's frown appears as Whiskers grins at him, and they seem captivated. Oliver is reclining and then slouches backward. Duke trades a glance with the Fox and gestures to the chef. Sarah, Oliver, and Whiskers stroll into the garden, and Whiskers trails Oliver over to the bicycle, closing the gate behind her. Meanwhile, Duke and Flora are chuckling, with Flora quite tipsy as she gulps another soda. Flora gazes at Duke, unable to fathom what's occurring with her career, ponders for an instant, nods, and glances around the gallery. Duke and the Fox swap glances as Whiskers and Sarah exit the gallery. Whiskers examines the cafe, notices they aren't present, then peers down at the chandelier, maintaining his gaze there as he whispers. Another peek at the Fox, and they all peer. Whiskers drifts to the elevator, spotting the Fox in his denim jacket lingering a few feet from the summit and gradually shifts his focus down through magnolias until she's staring at the woman's unshaven chin. Whiskers proceeds down the elevator to where Duke stands beside the chair, zips his jacket, and halts within ten feet of the gal before pausing, fixing his focus on the woman's shoes. Duke strolls in front of Whiskers and ascends the elevator. Sarah observes as Duke slips a finger into his jacket pocket and steps left next to Whiskers; he glances at her. Even Sarah is observing her strangely now as they glide into the corner seat with a now astonished, rapidly awakening Flora. Sarah and Whiskers glance at one another as Flora gulps her soda, and Flora stares at the pair differently now. Whiskers glances at Sarah, grins, and nods. Flora glances at her and then hangs down at the other edge. Pebbles reflects on it briefly and flings the parchment aside, while headset to her nose, Flora nurses another soda and leans back as Pebbles darts out of the living room, snatches the headset, grabbing Pebbles's intrigue. Pebbles glares at the headset, perches there briefly, also glaring at the headset, while Whiskers reclines as Marvin reveals Whiskers's handbag, inspects the library card, and Thatcher in the striped jacket tugs the Rockets hoodie from the gymnasium bag, digs around inside. Whiskers observes Marvin lift the list with the Boston Train number and departure time inscribed on it, scans around to ensure no one's nearby, then extracts the token for the 'left' safe out from a fissure in the sidewalk beneath the doorway. Now there's a tall lady in a striped cotton jacket beside her, the same person noticed when Duke was nearby, and another person down the lane chatting on his wristwatch."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Harry becomes despondent as Chili and Martin, appearing connected, walk to the minivan. Meanwhile, Bo Catlett and a drunk Harry laugh, with Harry contemplating his life at the restaurant. As Chili and Karen enter, Chili notices the Bear in a Hawaiian shirt on the stairs and approaches Bo Catlett. Karen and Chili join a shocked Harry in a booth, who is gradually sobering. Chili smiles at Karen, signaling a new understanding between them. Amidst Harry's drinking and phone call, Bones bursts in, drawing attention. Curtis examines Chili's wallet and notes a flight number and key hidden near the stairwell, observed by a man in plaid previously seen with Bo Catlett."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "radio the same guy seen when Bo Catlett was there and another guy down the aisle talking on his hand Now there is a big guy in a plaid wool shirt next to him Curtis pick up the note with the Newark Flight number and arrival time written on it glances about to make sure no one's around then pulls the key for the 'right' locker out from a crack in the pavement near the stairwell Chili watches Chili's wallet looks at the driver's license and Dunbar in the plaid shirt pulls the Lakers Tshirt out of the athletic bag feels around inside while Chili stands as Curtis opens Bones stares at the phone sits there a moment also staring at the phone Harry downs another drink and sits up as Bones bursts out of the john grabs the phone getting Bones's attention Bones thinks about it a moment and tosses the book aside while phone to his ear Harry looks at him and then hangs up at the other end Karen smiles and shakes his head Chili looks at Karen and Chili look at each other as Harry finishes his drink and Harry looks at the two of them differently now Even Karen is looking at him differently now as they slide into the booth with a now shocked rapidly sobering Harry she looks at him Karen watches as Bo Catlett puts a hand in his coat pocket and steps right up to Chili Bo walks past Chili and goes down the stairs Chili continues up the stairs to where Bo Catlett stands beside the table unbuttons his coat and gets within three steps of the guy before stopping keeping his eyes fixed on the man's gut Chili moves to the staircase seeing the Bear in his Hawaiian shirt standing a few steps from the top and slowly moves his gaze up through hibiscus until he is looking at the man's bearded face Another glance at the Bear and they all look Chili checks out the bar sees they are not there then looks up at the railing keeping his eyes up there as he speaks looks as Chili and Karen enter the restaurant Bo and the Bear exchange Harry looks at Bo unable to believe what is happening to his life thinks for a moment shakes his head and looks around the restaurant In the meantime Bo Catlett and Harry are laughing with Harry very drunk as he finishes another drink Martin and Chili walk out to the driveway and Chili follows Martin over to the minivan opening the door for him Karen Bo Catlett exchanges a look with the Bear and signals the waiter Martin is leaning and then leans forward Harry's smile goes away as Chili smiles at her and they appear hooked"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Karen smiles and shakes his head Karen watches as Bo Catlett puts a hand in his coat pocket and steps right up to Chili Another glance at the Bear and they all look while Chili stands as Curtis opens Curtis pick up the note with the Newark Flight number and arrival time written on it glances about to make sure no one's around then pulls the key for the 'right' locker out from a crack in the pavement near the stairwell Harry looks at Bo unable to believe what is happening to his life thinks for a moment shakes his head and looks around the restaurant In the meantime Bo Catlett and Harry are laughing with Harry very drunk as he finishes another drink Chili continues up the stairs to where Bo Catlett stands beside the table unbuttons his coat and gets within three steps of the guy before stopping keeping his eyes fixed on the man's gut Chili moves to the staircase seeing the Bear in his Hawaiian shirt standing a few steps from the top and slowly moves his gaze up through hibiscus until he is looking at the man's bearded face she looks at him Chili checks out the bar sees they are not there then looks up at the railing keeping his eyes up there as he speaks Chili watches radio Harry downs another drink and sits up as Bones bursts out of the john grabs the phone getting Bones's attention Even Karen is looking at him differently now as they slide into the booth with a now shocked rapidly sobering Harry Now there is a big guy in a plaid wool shirt next to him Martin is leaning and then leans forward Bo walks past Chili and goes down the stairs Chili looks at Bo Catlett exchanges a look with the Bear and signals the waiter Karen and Chili look at each other as Harry finishes his drink and Harry looks at the two of them differently now Bones thinks about it a moment and tosses the book aside while phone to his ear the same guy seen when Bo Catlett was there and another guy down the aisle talking on his hand Martin and Chili walk out to the driveway and Chili follows Martin over to the minivan opening the door for him Chili's wallet looks at the driver's license and Dunbar in the plaid shirt pulls the Lakers Tshirt out of the athletic bag feels around inside Bo and the Bear exchange looks as Chili and Karen enter the restaurant Bones stares at the phone sits there a moment also staring at the phone Harry's smile goes away as Chili smiles at her and they appear hooked Karen Harry looks at him and then hangs up at the other end"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Even Karen is looking at him differently now as they slide into the booth with a now shocked rapidly sobering Harry Karen and Chili look at each other as Harry finishes his drink and Harry looks at the two of them differently now Chili looks at Karen smiles and shakes his head Harry looks at him and then hangs up at the other end Bones thinks about it a moment and tosses the book aside while phone to his ear Harry downs another drink and sits up as Bones bursts out of the john grabs the phone getting Bones's attention Bones stares at the phone sits there a moment also staring at the phone while Chili stands as Curtis opens Chili's wallet looks at the driver's license and Dunbar in the plaid shirt pulls the Lakers Tshirt out of the athletic bag feels around inside Chili watches Curtis pick up the note with the Newark Flight number and arrival time written on it glances about to make sure no one's around then pulls the key for the 'right' locker out from a crack in the pavement near the stairwell Now there is a big guy in a plaid wool shirt next to him the same guy seen when Bo Catlett was there and another guy down the aisle talking on his hand radio Harry's smile goes away as Chili smiles at her and they appear hooked Martin is leaning and then leans forward Bo Catlett exchanges a look with the Bear and signals the waiter Karen Martin and Chili walk out to the driveway and Chili follows Martin over to the minivan opening the door for him In the meantime Bo Catlett and Harry are laughing with Harry very drunk as he finishes another drink Harry looks at Bo unable to believe what is happening to his life thinks for a moment shakes his head and looks around the restaurant Bo and the Bear exchange looks as Chili and Karen enter the restaurant Chili checks out the bar sees they are not there then looks up at the railing keeping his eyes up there as he speaks Another glance at the Bear and they all look Chili moves to the staircase seeing the Bear in his Hawaiian shirt standing a few steps from the top and slowly moves his gaze up through hibiscus until he is looking at the man's bearded face Chili continues up the stairs to where Bo Catlett stands beside the table unbuttons his coat and gets within three steps of the guy before stopping keeping his eyes fixed on the man's gut Bo walks past Chili and goes down the stairs Karen watches as Bo Catlett puts a hand in his coat pocket and steps right up to Chili she looks at him"
        }
      ]
    }
  ]
}