{
  "ground_truth": "Lynda gets out of bed. She is nude and looks beautiful and sensuous in the candlelight. She walks over to the phone. The ghost stands in the doorway. She starts to dial the phone. In the background, the ghost starts walking toward her. The shape moves forward. Laurie is sitting on the couch knitting. Laurie crosses to answer the phone. Lynda holds the phone to her ear. The ghost walks up slowly behind her. Laurie answers the telephone. He raises his hands to grab her. Lynda hears Laurie's hello as the ghost grabs the phone. He takes the telephone cord and wraps it around her neck. She squirms and writhes. He wraps the cord around her neck. Laurie hears squeals and rustling sounds across the phone. Laurie continues to hear weird sounds. He pulls tight. Lynda tries to fight off the ghost. Lynda gasps and tries to scream. The man pulls the cord tighter. She opens her mouth, trying to get air, then slowly slumps forward and remains motionless. Lynda reaches up and pulls on the sheet. It slides off the man, to reveal the grotesque Halloween mask. The shape picks up the receiver and puts it to his ear. Suddenly the phone goes dead. Laurie stares at the receiver, then hangs up. She crosses to the window and looks out toward the Wallace house. The street is quiet, dark, and windy. Bob's car is parked in front of the Wallace house. She stares at the house, puzzled. Laurie moves from the window back to the telephone and dials Annie's number. Laurie finally hangs up the phone. She stands for a moment considering it, then turns and walks upstairs. The kids are asleep. Tommy and Lindsey are sound asleep on the bed. She looks at them a moment, then closes the door behind her. Loomis sits in silence behind the hedge watching the Myers house. For a moment he glances back at the Myers house, then starts down the quiet residential street. He turns away from the street. It is empty except for a station wagon parked several blocks away. Then a thought strikes him. He looks again. Frustrated, he gets up and walks to the street. Slowly Loomis starts walking down the street toward the station wagon. Tracking shot with Loomis as he walks up the street. The station wagon moves closer. He recognizes it and races forward. Camera tracks in to the station wagon, right up to the state emblem emblazoned on the side. Loomis stands by his car glancing up and down the empty street. Finally, he makes up his mind and starts moving down the street, almost running, looking back and forth at the rows of houses on either side for something out of place.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Lynda rises out of bed. She is unclothed and appears attractive and alluring in the candlelight. She strides over to the telephone. The apparition stands in the entryway. She begins to dial the telephone. In the backdrop, the apparition starts strolling toward her. The figure advances forward. Laurie is seated on the sofa knitting. Laurie crosses to respond to the telephone. Lynda holds the telephone to her ear. The apparition approaches slowly behind her. Laurie answers the telephone. He elevates his hands to seize her. Lynda hears Laurie's greeting as the apparition seizes the telephone. He takes the telephone cord and coils it around her neck. She squirms and wriggles. He wraps the cord around her neck. Laurie hears shrieks and rustling noises across the telephone. Laurie continues to hear strange noises. He pulls taut. Lynda tries to fend off the apparition. Lynda gasps and attempts to shout. The male pulls the cord snugger. She opens her mouth, trying to get air, then gradually slumps forward and remains unmoving. Lynda reaches up and tugs on the sheet. It glides off the male, to reveal the monstrous Halloween mask. The figure picks up the receiver and places it to his ear. Abruptly the telephone goes dead. Laurie gazes at the receiver, then hangs up. She crosses to the window and peers out toward the Wallace residence. The street is silent, dark, and blustery. Bob's car is stationed in front of the Wallace residence. She gazes at the residence, perplexed. Laurie moves from the window back to the telephone and dials Annie's number. Laurie finally hangs up the telephone. She stands for a moment pondering it, then turns and walks upstairs. The children are asleep. Tommy and Lindsey are sound asleep on the bed. She gazes at them a moment, then closes the door behind her. Loomis sits in silence behind the shrub watching the Myers residence. For a moment he glances back at the Myers residence, then starts down the silent residential street. He turns away from the street. It is vacant except for a station wagon parked several blocks away. Then a thought strikes him. He looks again. Frustrated, he rises and walks to the street. Gradually Loomis starts strolling down the street toward the station wagon. Tracking shot with Loomis as he strides up the street. The station wagon draws nearer. He recognizes it and races forward. Camera tracks in to the station wagon, right up to the state insignia emblazoned on the side. Loomis stands by his car glancing up and down the vacant street. Finally, he makes up his mind and starts moving down the street, almost sprinting, looking back and forth at the rows of homes on either side for something out of place."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Lynda gets out of bed. She appears nude and is made to look beautiful and sensuous in the candlelight. The phone is walked over to by her. The doorway is occupied by the ghost. The phone is started to be dialed by her. In the background, the ghost starts walking toward her. The shape is moved forward by it. Laurie sits on the couch knitting. The phone is crossed to by Laurie to answer it. The phone is held to her ear by Lynda. Slowly, the ghost walks up behind her. The telephone is answered by Laurie. His hands are raised to grab her. Laurie is heard through the phone by Lynda saying hello as the phone is grabbed by the ghost. The telephone cord is taken by him, and her neck is wrapped with it. She is squirmed and writhed by him. He wraps the cord around her neck. Squeals and rustling sounds are heard by Laurie across the phone. Weird sounds are continued to be heard by Laurie. The cord is pulled tight by him. The ghost is tried to be fought off by Lynda. Lynda gasps and attempts to scream. The man pulls the cord tighter. Her mouth is opened by her, trying to get air, then she slowly slumps forward and remains motionless. The sheet is reached up to and pulled by Lynda. Off the man, it slides, revealing the grotesque Halloween mask. The receiver is picked up by the shape and put to his ear. Suddenly, the phone goes dead. The receiver is stared at by Laurie, then it is hung up by her. The window is crossed to by her and the Wallace house is looked out toward. The street is quiet, dark, and windy. In front of the Wallace house, Bob's car is parked. The house is stared at by her, puzzled. The window is moved from by Laurie back to the telephone, and Annie's number is dialed by her. Finally, the phone is hung up by Laurie. She stands for a moment considering it, then the stairs are turned and walked up by her. The kids are asleep. On the bed, Tommy and Lindsey are sound asleep. They are looked at by her for a moment, then the door is closed by her behind her. Behind the hedge, Loomis sits in silence watching the Myers house. For a moment, back at the Myers house, he glances, then the quiet residential street is started down by him. Away from the street, he turns. Except for a station wagon parked several blocks away, it is empty. Then a thought strikes him. Again, it is looked at by him. Frustrated, he gets up and the street is walked to by him. Slowly, Loomis starts walking down the street toward the station wagon. A tracking shot is taken with Loomis as the street is walked up by him. The station wagon is moved closer. It is recognized by him, and he races forward. The camera tracks in to the station wagon, right up to the state emblem emblazoned on the side. By his car, Loomis stands glancing up and down the empty street. Finally, his mind is made up by him, and down the street is started moving by him, almost running, looking back and forth at the rows of houses on either side for something out of place."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Lynda gets out of bed, nude and beautiful in the candlelight, and walks to the phone. A ghost stands in the doorway and moves toward her as she dials. Laurie, knitting on the couch, answers the phone. The ghost approaches Lynda, grabs the phone, and wraps the cord around her neck. Laurie hears strange sounds as Lynda struggles and gasps for air, then slumps forward. Lynda pulls off the sheet, revealing a grotesque Halloween mask. The ghost picks up the receiver, and the phone goes dead. Laurie hangs up, looks out the window at the quiet, dark street, and sees Bob's car by the Wallace house. Puzzled, she dials Annie's number, then hangs up and checks on the sleeping kids, Tommy and Lindsey. Loomis watches the Myers house, then walks down the empty street, noticing a station wagon parked blocks away. Recognizing it, he races forward, sees the state emblem, and stands by his car, scanning the street. He decides to move quickly, almost running, searching the rows of houses for anything unusual."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Lynda gets out of bed, nude and beautiful in candlelight, and walks to the phone. A ghost stands in the doorway and moves toward her as she dials. Laurie, knitting on the couch, answers the phone. The ghost grabs Lynda, wrapping the cord around her neck. Laurie hears strange sounds as Lynda struggles, gasps, and slumps forward. Lynda pulls off the sheet, revealing a grotesque mask. The ghost picks up the receiver, and the phone goes dead. Laurie hangs up, looks out at the quiet, dark street, and sees Bob's car at the Wallace house. She dials Annie's number, then checks on the sleeping kids, Tommy and Lindsey, before closing the door. Loomis watches the Myers house, then walks down the empty street, noticing a station wagon. Recognizing it, he races forward, seeing the state emblem. Loomis stands by his car, then moves quickly down the street, scanning the houses for anything unusual."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Lynda slowly rises from her bed, her movements graceful and deliberate. She is completely nude, her beauty and sensuality accentuated by the soft, flickering candlelight that casts gentle shadows across the room. With a purposeful stride, she makes her way over to the telephone. Meanwhile, a ghostly figure stands ominously in the doorway, watching her intently. As she begins to dial the phone, the ghost in the background starts to move, advancing toward her with a silent, eerie determination. The shape continues to move forward, closing the distance between them.\n\nIn another part of the house, Laurie is comfortably seated on the couch, absorbed in her knitting. She notices the phone ringing and crosses the room to answer it. At the same time, Lynda holds the phone to her ear, unaware of the ghost approaching slowly from behind. Laurie picks up the telephone and greets the caller with a friendly \"hello.\" Just then, the ghost reaches Lynda, raising his hands with sinister intent. Lynda hears Laurie's voice just as the ghost seizes the phone from her grasp. He swiftly takes the telephone cord and begins to wrap it tightly around her neck. Lynda struggles, her body writhing and squirming in a desperate attempt to break free. The ghost methodically wraps the cord around her neck, pulling it tighter with each loop.\n\nLaurie, still on the line, hears strange squeals and rustling noises coming from the other end of the phone. The unsettling sounds continue, causing her concern. Meanwhile, the ghost pulls the cord even tighter, and Lynda fights with all her strength, gasping and trying to scream for help. Her mouth opens wide in a futile attempt to draw in air, but she slowly slumps forward, her body going limp and motionless. In a final act of defiance, Lynda reaches up and tugs on the sheet, which slides off the ghost, revealing a grotesque Halloween mask beneath. The shape, now fully exposed, picks up the receiver and places it to his ear. Suddenly, the phone line goes dead, leaving Laurie staring at the receiver in confusion before she hangs up.\n\nLaurie crosses the room to the window, peering out toward the Wallace house. The street outside is quiet, shrouded in darkness, and a chilly wind rustles the leaves. Bob's car is parked conspicuously in front of the Wallace house, adding to the eerie stillness. Laurie gazes at the house, her expression puzzled and concerned. She moves away from the window, returning to the telephone to dial Annie's number. After a moment of contemplation, she finally hangs up the phone, standing in silence as she considers the situation. With a determined look, she turns and ascends the stairs. Upstairs, the children, Tommy and Lindsey, are sound asleep on the bed. Laurie pauses to watch them for a moment, then gently closes the door behind her.\n\nMeanwhile, Loomis sits in silence behind a hedge, his eyes fixed on the Myers house. He glances back at the ominous structure before starting down the quiet, residential street. The street is deserted, save for a lone station wagon parked several blocks away. A sudden thought strikes him, and he looks again, his frustration mounting. Determined, he rises and walks to the street, his pace quickening as he heads toward the station wagon. The camera tracks Loomis as he moves purposefully up the street, the station wagon drawing nearer. Recognizing the vehicle, he breaks into a run, racing forward with urgency. The camera zooms in on the station wagon, focusing on the state emblem emblazoned on its side. Loomis stands by his car, his eyes scanning the empty street. Finally, he makes a decision and starts moving down the street, almost running, his gaze darting back and forth at the rows of houses on either side, searching for anything out of place."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Lynda gradually rises from her bed, her every motion characterized by a gracefulness and deliberation that is almost hypnotic. She is entirely without clothes, her natural beauty and alluring sensuality highlighted by the gentle, flickering candlelight. The soft illumination dances across the room, casting tender shadows on the walls. With a determined and purposeful stride, she makes her way over to the telephone, driven by a clear sense of intent. Meanwhile, an eerie, ghostly figure stands ominously in the doorway, its presence unsettling as it watches her with unwavering attention. As Lynda begins to dial the telephone, the ghostly figure remains in the background, but now it starts to move forward with a silent, eerie determination, closing the gap between itself and Lynda.\n\nIn a different part of the same house, Laurie is comfortably seated on the couch, fully absorbed in the soothing activity of knitting. She hears the phone begin to ring, and so she rises, crossing the room to answer it. At that same moment, Lynda is holding the phone to her ear, completely unaware of the ghost that is slowly approaching her from behind. Laurie picks up the telephone and greets the caller on the other end of the line with a friendly \"hello.\" At that precise instant, the ghost reaches Lynda and raises its hands with a sinister intent. Just as Lynda hears Laurie’s voice through the receiver, the ghost forcibly seizes the phone from her grasp. In a swift, deliberate motion, he takes the telephone cord and begins to wrap it tightly around her neck. Lynda struggles fiercely, her body writhing and squirming in a desperate attempt to break free from the tightening cord. The ghost methodically wraps the cord around her neck, pulling it tighter with each successive loop.\n\nLaurie, still on the line, begins to hear strange squeals and rustling noises emanating from the other end of the phone. These disturbing and unsettling sounds continue, heightening her concern. Meanwhile, the ghost is relentless, pulling the cord even tighter as Lynda fights with all the strength she can muster, gasping and making a futile attempt to scream for help. Her mouth opens wide in an effort to draw in air, but gradually, she slumps forward, her body going limp and motionless. In one last, defiant act of resistance, Lynda reaches up and tugs on the sheet, which slides off the ghost to reveal a grotesque Halloween mask hiding beneath it. Now fully exposed, the shape picks up the receiver and places it to his ear. Suddenly and unexpectedly, the phone line goes dead, leaving Laurie staring at the silent receiver in confusion before she hangs up.\n\nLaurie crosses the room and moves to the window, peering out toward the nearby Wallace house. The street outside is enveloped in darkness, with a chilling wind rustling through the leaves, adding to the eerie atmosphere. Bob's car is conspicuously parked in front of the Wallace house, enhancing the unsettling stillness of the scene. Laurie gazes intently at the house, her expression puzzled and tinged with concern. She moves away from the window and returns to the telephone, dialing Annie's number. After a moment of contemplation and indecision, she ultimately hangs up the phone, standing silently as she processes the situation. With a determined look on her face, she turns and begins to ascend the stairs. Upstairs, the children, Tommy and Lindsey, are soundly asleep on the bed. Laurie pauses for a moment to watch them, then gently closes the door behind her as she leaves.\n\nMeanwhile, Loomis sits in silence behind a hedge, his eyes fixed intently on the ominous silhouette of the Myers house. He glances back at the foreboding structure before he starts on his way down the quiet, residential street. The street is deserted, devoid of life, save for a lone station wagon parked several blocks away. A sudden thought strikes him, prompting him to look again, his frustration visibly mounting. With determination, he rises and walks toward the street, quickening his pace as he heads straight for the station wagon. The camera tracks Loomis as he moves purposefully up the deserted street, bringing the station wagon closer into view. Recognizing the vehicle, he breaks into a run, racing forward with a sense of urgency. The camera zooms in on the station wagon, focusing on the state emblem boldly emblazoned on its side. Loomis stands by his car, his eyes carefully scanning the empty street. Finally, he reaches a decision and starts moving swiftly down the street, almost running. His gaze darts back and forth at the rows of houses on either side, searching intently for anything that seems out of place or unusual."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Lynda slowly rises from her bed, her movements gentle and deliberate as she emerges from the sheets, her nude form illuminated beautifully and sensuously by the flickering candlelight that casts soft shadows across the room. She gracefully makes her way over to the phone, each step measured and purposeful. As she reaches for the phone, the ghostly figure stands ominously in the doorway, its presence a silent but looming threat. Lynda begins to dial the phone, her fingers pressing each button with a sense of urgency. In the background, the ghost starts to move, its shape advancing steadily toward her. Meanwhile, Laurie is seated comfortably on the couch, her hands deftly working the knitting needles. She notices the phone ringing and rises, crossing the room to answer it. Lynda lifts the phone to her ear, her attention focused on the call, unaware of the ghost's slow approach from behind. Laurie picks up the telephone, her voice greeting Lynda with a simple hello. At that moment, the ghost raises its hands, preparing to strike. Lynda hears Laurie's voice just as the ghost seizes the phone from her grasp. With swift, menacing intent, the ghost takes the telephone cord and begins to wrap it tightly around Lynda's neck. She struggles, her body writhing in a desperate attempt to free herself. The cord constricts further, and Laurie, still on the line, hears the unsettling sounds of squeals and rustling. The ghost pulls the cord tighter, and Lynda gasps, her attempts to scream stifled by the tightening noose. Her mouth opens in a silent plea for air, but her strength wanes, and she slowly slumps forward, her body going limp and motionless. In a final act of defiance, Lynda reaches up, her fingers grasping at the sheet, pulling it away to reveal the grotesque Halloween mask of her attacker. The shape, now exposed, picks up the receiver and places it to his ear, but the line suddenly goes dead. Laurie, puzzled by the abrupt silence, stares at the receiver before hanging up. She moves to the window, her gaze fixed on the Wallace house across the street. The scene outside is eerily quiet, the street dark and windy, with Bob's car parked conspicuously in front of the house. Laurie, her mind racing with questions, turns away from the window and returns to the telephone, dialing Annie's number in a bid for answers. After a moment of contemplation, she hangs up the phone, her decision made. She stands in thought, then turns and ascends the stairs, her footsteps soft and cautious. Upstairs, she finds the children, Tommy and Lindsey, sound asleep on the bed, their peaceful slumber a stark contrast to the chaos unfolding elsewhere. She watches them for a moment, ensuring their safety, before gently closing the door behind her. Meanwhile, Loomis sits in silence behind the hedge, his eyes fixed on the foreboding Myers house. He glances back at the house, then begins his solitary walk down the quiet residential street, his mind alert to any sign of danger. The street is deserted, save for a station wagon parked several blocks away. A sudden realization strikes him, prompting a second look. Frustrated by his earlier oversight, he rises and strides purposefully to the street, his pace quickening as he heads toward the station wagon. The camera tracks his determined progress, capturing the moment he recognizes the vehicle and breaks into a run. The camera zooms in on the station wagon, highlighting the state emblem emblazoned on its side. Loomis stands by his car, his eyes scanning the empty street for any anomaly. Resolute, he makes up his mind and starts moving down the street, his pace almost a run, his gaze darting back and forth across the rows of houses, searching for anything out of place."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Lynda rises from bed, her beauty accentuated by the candlelight, and moves to the phone as a ghostly figure appears in the doorway. As she begins dialing, the ghost approaches. Meanwhile, Laurie, knitting on the couch, answers the phone just as the ghost reaches Lynda, wrapping the cord around her neck. Lynda struggles, gasping for air, but eventually slumps forward, revealing the ghost's grotesque Halloween mask. The ghost picks up the receiver, and the line goes dead. Laurie, puzzled by the strange sounds, hangs up and looks out the window toward the Wallace house, noticing Bob's car parked outside. She dials Annie's number, but after no response, she hangs up and checks on the sleeping children, Tommy and Lindsey, before closing the door. Loomis, sitting behind a hedge near the Myers house, notices a station wagon parked nearby. Realizing its significance, he races toward it, recognizing the state emblem. Determined, he moves quickly down the street, scanning the houses for anything unusual."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Lynda gets out of bed in the dimly lit room. She is nude and looks beautiful and sensuous in the candlelight, reminiscent of an ethereal painting by a master artist. She walks over to the rotary phone, which was a common household item in the 1970s. The ghost, a spectral presence known in folklore to haunt the living, stands in the doorway. She starts to dial the phone. In the background, the ghost starts walking toward her, its movements deliberate and unnerving. The shape, often a term used to describe a formless entity, moves forward. Laurie is sitting on the couch knitting, an age-old craft that brings comfort and warmth. Laurie crosses to answer the phone. Lynda holds the phone to her ear, feeling the cool plastic. The ghost walks up slowly behind her, exuding an air of impending doom. Laurie answers the telephone, her voice steady. He raises his hands to grab her. Lynda hears Laurie's hello as the ghost grabs the phone with an unnerving swiftness. He takes the telephone cord, a lifeline of communication, and wraps it around her neck. She squirms and writhes, fighting for survival. He wraps the cord around her neck with a cold determination. Laurie hears squeals and rustling sounds across the phone, sounds often associated with distress. Laurie continues to hear weird sounds, her concern growing. He pulls tight. Lynda tries to fight off the ghost, her strength waning. Lynda gasps and tries to scream, a primal reaction to fear. The man pulls the cord tighter. She opens her mouth, trying to get air, then slowly slumps forward and remains motionless. Lynda reaches up and pulls on the sheet. It slides off the man, to reveal the grotesque Halloween mask, a symbol of anonymity and terror. The shape picks up the receiver and puts it to his ear, as if mocking the silence. Suddenly the phone goes dead. Laurie stares at the receiver, perplexed, then hangs up. She crosses to the window and looks out toward the Wallace house, a typical suburban home. The street is quiet, dark, and windy, creating an atmosphere of unease. Bob's car, an old sedan with a sputtering engine, is parked in front of the Wallace house. She stares at the house, puzzled by the stillness. Laurie moves from the window back to the telephone and dials Annie's number, seeking reassurance. Laurie finally hangs up the phone. She stands for a moment considering it, then turns and walks upstairs. The kids are asleep, their rhythmic breathing a comforting sound. Tommy and Lindsey are sound asleep on the bed, looking peaceful and vulnerable. She looks at them a moment, then closes the door behind her, feeling the weight of responsibility. Loomis, a doctor obsessed with justice, sits in silence behind the hedge watching the Myers house, a place notorious for its dark history. For a moment he glances back at the Myers house, then starts down the quiet residential street. He turns away from the street. It is empty except for a station wagon parked several blocks away, its engine still warm. Then a thought strikes him, a realization that quickens his pulse. He looks again. Frustrated, he gets up and walks to the street. Slowly Loomis starts walking down the street toward the station wagon. Tracking shot with Loomis as he walks up the street, his determination evident in his stride. The station wagon moves closer, the headlights casting long shadows. He recognizes it, recalling its significance, and races forward. Camera tracks in to the station wagon, right up to the state emblem emblazoned on the side, indicating its official use. Loomis stands by his car glancing up and down the empty street. Finally, he makes up his mind and starts moving down the street, almost running, looking back and forth at the rows of houses on either side for something out of place, a sign, perhaps, of the sinister presence he suspects."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Lynda gets out of bed. She is nude and looks beautiful and sensuous in the candlelight. She walks over to the phone. The ghost stands in the doorway. She starts to dial the phone. In the background the ghost starts walking toward her. The shape moves forward. Laurie is sitting on the couch knitting. Laurie crosses to answer the phone. Lynda holds the phone to her ear. The ghost walks up slowly behind her. Laurie answers the telephone. He raises his hands to grab her. Lynda hears Laurie's hello as the ghost grabs the phone. He takes the telephone cord and wraps it around her neck. She squirms and writhes. He wraps the cord around her neck. Laurie hears squeals and rustling sounds across the phone. Laurie continues to hear weird sounds. He pulls tight. Lynda tries to fight off the ghost. Lynda gasps and tries to scream. The man pulls the cord tighter. She opens her mouth trying to get air then slowly slumps forward and remains motionless. Lynda reaches up and pulls on the sheet. It slides off the man to reveal the grotesque Halloween mask. The shape picks up the receiver and puts it to his ear. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. Suddenly the phone goes dead. Laurie stares at the receiver then hangs up. She crosses to the window and looks out toward the Wallace house. The street is quiet dark and windy. Bob's car is parked in front of the Wallace house. She stares at the house puzzled. Laurie moves from the window back to the telephone and dials Annie's number. Laurie finally hangs up the phone. She stands for a moment considering it then turns and walks upstairs. The kids are asleep. Tommy and Lindsey are sound asleep on the bed. She looks at them a moment then closes the door behind her. Loomis sits in silence behind the hedge watching the Myers house. For a moment he glances back at the Myers house then starts down the quiet residential street. He turns away from the street. It is empty except for a station wagon parked several blocks away. Then a thought strikes him. He looks again. Frustrated he gets up and walks to the street. Slowly. Loomis starts walking down the street toward the station wagon. Tracking shot with Loomis as he walks up the street. The station wagon moves closer. He recognizes it and races forward. Camera tracks in to the station wagon right up to the state emblem emblazoned on the side. Loomis stands by his car glancing up and down the empty street. Finally he makes up his mind and starts moving down the street almost running looking back and forth at the rows of houses on either side for something out of place."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Lynda gets out of bed. She is nude and looks beautiful and sensuous in the candlelight. She walks over to the phone. The ghost stands in the doorway. She starts to dial the phone. In the background the ghost starts walking toward her. The shape moves forward. Laurie is sitting on the couch knitting. Laurie crosses to answer the phone. Lynda holds the phone to her ear. The ghost walks up slowly behind her. Laurie answers the telephone. He raises his hands to grab her. Lynda hears Laurie's hello as the ghost grabs the phone. He takes the telephone cord and wraps it around her neck. She squirms and writhes. He wraps the cord around her neck. Laurie hears squeals and rustling sounds across the phone. Laurie continues to hear weird sounds. He pulls tight. Lynda tries to fight off the ghost. Lynda gasps and tries to scream. The man pulls the cord tighter. She opens her mouth trying to get air then slowly slumps forward and remains motionless. Lynda reaches up and pulls on the sheet. It slides off the man to reveal the grotesque Halloween mask. The shape picks up the receiver and puts it to his ear. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Suddenly the phone goes dead. Laurie stares at the receiver then hangs up. She crosses to the window and looks out toward the Wallace house. The street is quiet dark and windy. Bob's car is parked in front of the Wallace house. She stares at the house puzzled. Laurie moves from the window back to the telephone and dials Annie's number. Laurie finally hangs up the phone. She stands for a moment considering it then turns and walks upstairs. The kids are asleep. Tommy and Lindsey are sound asleep on the bed. She looks at them a moment then closes the door behind her. Loomis sits in silence behind the hedge watching the Myers house. For a moment he glances back at the Myers house then starts down the quiet residential street. He turns away from the street. It is empty except for a station wagon parked several blocks away. Then a thought strikes him. He looks again. Frustrated he gets up and walks to the street. Slowly. Loomis starts walking down the street toward the station wagon. Tracking shot with Loomis as he walks up the street. The station wagon moves closer. He recognizes it and races forward. Camera tracks in to the station wagon right up to the state emblem emblazoned on the side. Loomis stands by his car glancing up and down the empty street. Finally he makes up his mind and starts moving down the street almost running looking back and forth at the rows of houses on either side for something out of place."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Lynda gets out of bed. She is nude and looks beautiful and sensuous in the candlelight. She walks over to the phone. The ghost stands in the doorway. She starts to dial the phone. In the background the ghost starts walking toward her. The shape moves forward. Laurie is sitting on the couch knitting. Laurie crosses to answer the phone. Lynda holds the phone to her ear. The ghost walks up slowly behind her. Laurie answers the telephone. He raises his hands to grab her. Lynda hears Laurie's hello as the ghost grabs the phone. He turns away from the street. It is empty except for a station wagon parked several blocks away. Then a thought strikes him. He looks again. Frustrated he gets up and walks to the street. Slowly. Loomis starts walking down the street toward the station wagon. Tracking shot with Loomis as he walks up the street. The station wagon moves closer. He recognizes it and races forward. Camera tracks in to the station wagon right up to the state emblem emblazoned on the side. Loomis stands by his car glancing up and down the empty street. Finally he makes up his mind and starts moving down the street almost running looking back and forth at the rows of houses on either side for something out of place."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Lynda gets out of bed. She is nude and looks beautiful and sensuous in the candlelight. She walks over to the phone. The ghost stands in the doorway. She starts to dial the phone. In the background the ghost starts walking toward her. The station wagon moves closer. He recognizes it and races forward. Camera tracks in to the station wagon right up to the state emblem emblazoned on the side. Loomis stands by his car glancing up and down the empty street. Finally he makes up his mind and starts moving down the street almost running looking back and forth at the rows of houses on either side for something out of place."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Betty jumps out of the hammock. She is clothed and appears rugged and athletic in the moonlight. She strolls over to the blender. The cat lounges in the hallway. She begins to strum the guitar. In the foreground, the cat starts bouncing toward her. The creature leaps forward. Mark is reclining on the beanbag painting. Mark tiptoes to strum the guitar. Betty holds the blender to her forehead. The cat bounces up quickly beside her. Mark plays the harmonica. It lifts its paws to nudge her. Betty hears Mark's harmonica as the cat nudges the blender. It grabs the extension cord and drapes it around her waist. She giggles and dances. It drapes the cord around her waist. Mark hears snickers and humming noises over the harmonica. Mark continues to hear peculiar noises. It pulls firmly. Betty tries to dance with the cat. Betty chuckles and attempts to sing. The woman pulls the cord looser. She shuts her lips, trying to catch a breeze, then gradually slinks backward and remains still. Betty reaches down and tugs on the curtain. It flies off the woman, to uncover the bizarre carnival hat. The creature lifts the megaphone and places it near its nose. Instantly the blender goes quiet. Mark fixes his gaze on the harmonica, then places it down. He strolls to the balcony and peers out toward the Martinez garage. The alley is bustling, bright, and breezy. Jill's scooter is stationed in front of the Martinez garage. He observes the garage, bewildered. Mark ambles from the balcony back to the blender and plucks Sidney's book. Mark eventually places the blender down. He stands for an instant pondering it, then spins and skips downstairs. The kittens are restless. Timmy and Lucy are wide awake on the sofa. He glances at them briefly, then swings the curtain before him. Penelope lounges in peace atop the bush inspecting the Parker cabin. For a brief moment, she peeks back at the Parker cabin, then skips down the lively commercial alley. She twists toward the alley. It is bustling except for a bicycle resting several meters away. Then a notion crosses her mind. She glances once more. Dejected, she rises and jaunts to the alley. Gradually Penelope begins strolling down the alley toward the bicycle. Panning shot with Penelope as she jaunts along the avenue. The bicycle rolls closer. She identifies it and dashes onward. Camera pans in to the bicycle, directly to the city insignia embossed on the frame. Penelope stands beside her scooter peering around the bustling alley. Finally, she decides and commences jaunting down the alley, nearly sprinting, scanning from side to side at the rows of shops on either side for anything unusual."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Lynda gets out of bed and walks to the phone, unaware of the ghost approaching behind her. As she dials, the ghost grabs the phone cord and strangles her, causing her to gasp and slump forward. Laurie, on the other end, hears strange noises before the line goes dead. She hangs up, confused, and looks out toward the Wallace house, puzzled by the quiet, dark scene and Bob's car parked outside. Laurie tries calling Annie but hangs up, deciding to check on the sleeping kids, Tommy and Lindsey, before leaving the room.\n\nMeanwhile, Loomis watches the Myers house from behind a hedge. He notices an empty street with a station wagon parked several blocks away, prompting him to investigate. Recognizing the vehicle, he races toward it and identifies the state emblem on the side. Determined, Loomis walks swiftly down the street, scanning the houses for signs of disturbance."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Finally he makes up his mind and starts moving down the street almost running looking back and forth at the rows of houses on either side for something out of place Loomis stands by his car glancing up and down the empty street  Camera tracks in to the station wagon right up to the state emblem emblazoned on the side  He recognizes it and races forward  The station wagon moves closer  Tracking shot with Loomis as he walks up the street  Loomis starts walking down the street toward the station wagon  Slowly  Frustrated he gets up and walks to the street  He looks again  Then a thought strikes him  It is empty except for a station wagon parked several blocks away  He turns away from the street  For a moment he glances back at the Myers house then starts down the quiet residential street  Loomis sits in silence behind the hedge watching the Myers house  She looks at them a moment then closes the door behind her  Tommy and Lindsey are sound asleep on the bed  The kids are asleep  She stands for a moment considering it then turns and walks upstairs  Laurie finally hangs up the phone  Laurie moves from the window back to the telephone and dials Annie's number  She stares at the house puzzled  Bob's car is parked in front of the Wallace house  The street is quiet dark and windy  She crosses to the window and looks out toward the Wallace house  Laurie stares at the receiver then hangs up  Suddenly the phone goes dead  The shape picks up the receiver and puts it to his ear  It slides off the man to reveal the grotesque Halloween mask  Lynda reaches up and pulls on the sheet  She opens her mouth trying to get air then slowly slumps forward and remains motionless  The man pulls the cord tighter  Lynda gasps and tries to scream  Lynda tries to fight off the ghost  He pulls tight  Laurie continues to hear weird sounds  Laurie hears squeals and rustling sounds across the phone  He wraps the cord around her neck  She squirms and writhes  He takes the telephone cord and wraps it around her neck  Lynda hears Laurie's hello as the ghost grabs the phone  He raises his hands to grab her  Laurie answers the telephone  The ghost walks up slowly behind her  Lynda holds the phone to her ear  Laurie crosses to answer the phone  Laurie is sitting on the couch knitting  The shape moves forward  In the background the ghost starts walking toward her  She starts to dial the phone  The ghost stands in the doorway  She walks over to the phone  She is nude and looks beautiful and sensuous in the candlelight  Lynda gets out of bed "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "She is nude and looks beautiful and sensuous in the candlelight Lynda gets out of bed The ghost stands in the doorway She walks over to the phone In the background the ghost starts walking toward her She starts to dial the phone Laurie is sitting on the couch knitting The shape moves forward Lynda holds the phone to her ear Laurie crosses to answer the phone Laurie answers the telephone The ghost walks up slowly behind her Lynda hears Laurie's hello as the ghost grabs the phone He raises his hands to grab her She squirms and writhes He takes the telephone cord and wraps it around her neck Laurie hears squeals and rustling sounds across the phone He wraps the cord around her neck He pulls tight Laurie continues to hear weird sounds Lynda gasps and tries to scream Lynda tries to fight off the ghost She opens her mouth trying to get air then slowly slumps forward and remains motionless The man pulls the cord tighter It slides off the man to reveal the grotesque Halloween mask Lynda reaches up and pulls on the sheet Suddenly the phone goes dead The shape picks up the receiver and puts it to his ear She crosses to the window and looks out toward the Wallace house Laurie stares at the receiver then hangs up Bob's car is parked in front of the Wallace house The street is quiet dark and windy Laurie moves from the window back to the telephone and dials Annie's number She stares at the house puzzled She stands for a moment considering it then turns and walks upstairs Laurie finally hangs up the phone Tommy and Lindsey are sound asleep on the bed The kids are asleep Loomis sits in silence behind the hedge watching the Myers house She looks at them a moment then closes the door behind her He turns away from the street For a moment he glances back at the Myers house then starts down the quiet residential street Then a thought strikes him It is empty except for a station wagon parked several blocks away Frustrated he gets up and walks to the street He looks again Loomis starts walking down the street toward the station wagon Slowly The station wagon moves closer Tracking shot with Loomis as he walks up the street Camera tracks in to the station wagon right up to the state emblem emblazoned on the side He recognizes it and races forward Finally he makes up his mind and starts moving down the street almost running looking back and forth at the rows of houses on either side for something out of place Loomis stands by his car glancing up and down the empty street"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Suddenly the phone goes dead  Laurie stares at the receiver then hangs up  She crosses to the window and looks out toward the Wallace house  The street is quiet dark and windy  Bob's car is parked in front of the Wallace house  She stares at the house puzzled  Laurie moves from the window back to the telephone and dials Annie's number  Laurie finally hangs up the phone  She stands for a moment considering it then turns and walks upstairs  The kids are asleep  Tommy and Lindsey are sound asleep on the bed  She looks at them a moment then closes the door behind her  Loomis sits in silence behind the hedge watching the Myers house  For a moment he glances back at the Myers house then starts down the quiet residential street  He turns away from the street  It is empty except for a station wagon parked several blocks away  Then a thought strikes him  He looks again  Frustrated he gets up and walks to the street  Slowly  Loomis starts walking down the street toward the station wagon  Tracking shot with Loomis as he walks up the street  The station wagon moves closer  He recognizes it and races forward  Camera tracks in to the station wagon right up to the state emblem emblazoned on the side  Loomis stands by his car glancing up and down the empty street  Finally he makes up his mind and starts moving down the street almost running looking back and forth at the rows of houses on either side for something out of place Lynda gets out of bed  She is nude and looks beautiful and sensuous in the candlelight  She walks over to the phone  The ghost stands in the doorway  She starts to dial the phone  In the background the ghost starts walking toward her  The shape moves forward  Laurie is sitting on the couch knitting  Laurie crosses to answer the phone  Lynda holds the phone to her ear  The ghost walks up slowly behind her  Laurie answers the telephone  He raises his hands to grab her  Lynda hears Laurie's hello as the ghost grabs the phone  He takes the telephone cord and wraps it around her neck  She squirms and writhes  He wraps the cord around her neck  Laurie hears squeals and rustling sounds across the phone  Laurie continues to hear weird sounds  He pulls tight  Lynda tries to fight off the ghost  Lynda gasps and tries to scream  The man pulls the cord tighter  She opens her mouth trying to get air then slowly slumps forward and remains motionless  Lynda reaches up and pulls on the sheet  It slides off the man to reveal the grotesque Halloween mask  The shape picks up the receiver and puts it to his ear "
        }
      ]
    }
  ]
}