{
  "ground_truth": "She turns and faces the hallway, her sweetness dissolves in a flash, replaced by repulsion, and quickly she reverses herself, re-entering her apartment and closing the door behind her. Meanwhile, all his considerable talent and strength are focused on seducing a tiny dog into the elevator door he holds open, sniffing at a particular spot on the hall carpeting. Melvin lets the elevator door close and advances on the mutt, who ignores him; the dog lifts his leg just as Melvin lunges and picks him up with a decisive heft, causing dog urine to squirt on the hall wall. Sensing a kindred spirit, the dog starts to growl and bark, taking a snap at Melvin, but Melvin, much meaner and quicker, holds the dog's snout shut with his hand and reaches for the garbage chute door, stuffing the dog in the chute and letting go, just as another apartment door opens, emitting loud party sounds and Simon Nye, in his early 30s, bolts into the hall. Melvin is about to enter his apartment when he notices Simon at the far end of the hall, starts to walk back to his apartment door directly opposite Simon's, and sees his black friend. Then he notices the handyman, tongue in cheek, trying to suppress his amusement. Melvin barely reacts as we hear a loud knocking, and he bursts from his chair. As Simon hears Melvin through the door, he takes a step back, and Melvin throws open the door, looking demonic. Melvin walks back into the apartment, about to close the door when Simon has another burst of bravery, but Melvin enters his apartment and slams the door shut. Meanwhile, Frank smiles affectionately; Simon turns serious as Frank waits patiently and Melvin jerks his door back open. Frank immediately grabs Melvin by his shirt, jerking him forward, and Melvin is scared but appears impressed. On a crowded and dirty street, Melvin comes walking briskly, like an animal wanting to pass through danger without giving off the scent of mounting fear, placing his palms together and extending his arms to cut a path through people, pointedly avoiding stepping on cracks and keeping his eyes focused on the terrain. Elsewhere, Carol Connelly talks with another mother, a customer, about her son for the umpteenth time; the mother nods too sympathetically, but Carol interrupts, and they turn away as Melvin walks a few paces to the waitress station where waitresses Lisa and Carol are talking.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She rotates and confronts the corridor, her amiability disintegrates in an instant, substituted by disgust, and promptly she reverses herself, re-entering her flat and shutting the portal behind her. Meanwhile, all his substantial skill and power are concentrated on enticing a diminutive canine into the lift portal he holds ajar, sniffing at a specific area on the passage rug. Melvin permits the lift portal to close and advances on the pooch, who disregards him; the canine elevates his limb just as Melvin lunges and picks him up with a conclusive heft, causing canine urine to squirt on the passage partition. Perceiving a kindred soul, the canine commences to growl and bark, taking a snap at Melvin, but Melvin, much nastier and quicker, holds the canine's snout shut with his hand and reaches for the refuse chute portal, stuffing the canine in the chute and letting go, just as another flat portal opens, emitting loud festivity noises and Simon Nye, in his early 30s, dashes into the passage. Melvin is about to enter his flat when he observes Simon at the far end of the passage, starts to stroll back to his flat portal directly opposite Simon's, and sees his ebony companion. Then he notices the repairman, tongue in cheek, attempting to suppress his laughter. Melvin barely reacts as we hear a loud knocking, and he bursts from his seat. As Simon hears Melvin through the portal, he takes a step back, and Melvin throws open the portal, looking diabolical. Melvin walks back into the flat, about to close the portal when Simon has another surge of courage, but Melvin enters his flat and slams the portal shut. Meanwhile, Frank beams affectionately; Simon turns solemn as Frank waits patiently and Melvin yanks his portal back open. Frank immediately seizes Melvin by his shirt, jerking him forward, and Melvin is frightened but appears impressed. On a congested and grimy street, Melvin comes striding briskly, like a creature wanting to pass through peril without giving off the scent of mounting dread, placing his palms together and extending his arms to cut a path through people, pointedly avoiding stepping on fissures and keeping his eyes focused on the landscape. Elsewhere, Carol Connelly converses with another mother, a client, about her child for the umpteenth occasion; the mother nods too sympathetically, but Carol interrupts, and they turn away as Melvin walks a few strides to the waitress station where waitresses Lisa and Carol are conversing."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "She turns and faces the hallway, her sweetness dissolves in a flash, replaced by repulsion, and quickly she reverses herself, re-entering her apartment and closing the door behind her. Meanwhile, he focuses all his considerable talent and strength on seducing a tiny dog into the elevator door he holds open, as it sniffs at a particular spot on the hall carpeting. The elevator door is let close by Melvin, and he advances on the mutt, who ignores him; the dog's leg is lifted just as Melvin lunges and picks him up with a decisive heft, causing dog urine to squirt on the hall wall. A kindred spirit is sensed by the dog, and it starts to growl and bark, taking a snap at Melvin, but Melvin, much meaner and quicker, holds the dog's snout shut with his hand and reaches for the garbage chute door, stuffing the dog in the chute and letting go, just as another apartment door opens, emitting loud party sounds and Simon Nye, in his early 30s, bolts into the hall. Melvin is about to enter his apartment when Simon is noticed by him at the far end of the hall; he starts to walk back to his apartment door directly opposite Simon's, and his black friend is seen by him. Then, the handyman is noticed by him, tongue in cheek, trying to suppress his amusement. As a loud knocking is heard and Melvin bursts from his chair, he barely reacts. As Melvin's voice is heard by Simon through the door, Simon takes a step back, and Melvin throws open the door, looking demonic. Back into the apartment, Melvin walks, about to close the door when Simon has another burst of bravery, but his apartment is entered by Melvin, and the door is slammed shut by him. Meanwhile, Frank smiles affectionately; Simon turns serious as Frank waits patiently and Melvin jerks his door back open. Frank immediately grabs Melvin by his shirt, jerking him forward, and Melvin is scared but appears impressed. On a crowded and dirty street, Melvin walks briskly, like an animal wanting to pass through danger without giving off the scent of mounting fear, placing his palms together and extending his arms to cut a path through people, pointedly avoiding stepping on cracks and keeping his eyes focused on the terrain. Elsewhere, Carol Connelly talks with another mother, a customer, about her son for the umpteenth time; the mother nods too sympathetically, but Carol interrupts, and they turn away as a few paces to the waitress station are walked by Melvin where waitresses Lisa and Carol are talking."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "She turns to face the hallway, her sweetness vanishing instantly, replaced by disgust. She quickly re-enters her apartment, closing the door. Meanwhile, he focuses on coaxing a small dog into the elevator, sniffing a spot on the carpet. Melvin lets the elevator door close, approaches the dog, and picks it up, causing it to urinate on the wall. The dog growls and snaps at Melvin, but he holds its snout shut and stuffs it into the garbage chute. As another door opens with loud party sounds, Simon Nye, in his early 30s, rushes into the hall. Melvin notices Simon and the amused handyman, barely reacting to the loud knocking. Melvin bursts from his chair, opens the door, looking demonic, and then slams it shut. Frank smiles affectionately; Simon turns serious as Frank waits. Melvin jerks his door open, and Frank grabs him by the shirt, impressing Melvin despite his fear. On a crowded street, Melvin walks briskly, avoiding cracks and cutting a path through people. Elsewhere, Carol Connelly talks with another mother about her son; the mother nods sympathetically, but Carol interrupts. They turn away as Melvin approaches the waitress station where Lisa and Carol are talking."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "She turns to the hallway, her sweetness vanishing, replaced by repulsion, and quickly re-enters her apartment, closing the door. Meanwhile, he focuses on coaxing a small dog into the elevator, sniffing a spot on the carpet. Melvin lets the door close, approaches the dog, and picks it up, causing it to urinate on the wall. The dog growls and snaps at Melvin, but he holds its snout shut and stuffs it into the garbage chute as another door opens, revealing Simon Nye, who bolts into the hall. Melvin notices Simon and the amused handyman, barely reacting to loud knocking. Melvin bursts from his chair, opens the door, looking demonic, and slams it shut after Simon's brief bravery. Frank smiles at Simon, who turns serious as Frank waits, and Melvin reopens the door. Frank grabs Melvin, who is scared but impressed. On a crowded street, Melvin walks briskly, avoiding cracks and focusing on the terrain. Elsewhere, Carol Connelly talks with another mother about her son; Carol interrupts, and they turn away as Melvin approaches the waitress station where Lisa and Carol are talking."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "She turns around and faces the hallway, and in an instant, her sweetness vanishes, replaced by a sudden wave of repulsion. Quickly, she reverses her direction, re-entering her apartment and firmly closing the door behind her. Meanwhile, all of his considerable talent and strength are concentrated on the task of enticing a tiny dog into the elevator, which he holds open, as the dog sniffs curiously at a particular spot on the hallway carpet. Melvin allows the elevator door to close and advances toward the little mutt, who pays him no attention; the dog lifts its leg just as Melvin lunges forward and picks it up with a decisive heft, causing a stream of dog urine to squirt onto the hallway wall. Sensing a kindred spirit, the dog begins to growl and bark, snapping at Melvin, but Melvin, who is much meaner and quicker, holds the dog's snout shut with his hand. He then reaches for the garbage chute door, stuffing the dog inside and letting go, just as another apartment door swings open, releasing loud party sounds and Simon Nye, a man in his early 30s, who bolts into the hallway. Melvin is about to enter his own apartment when he notices Simon at the far end of the hall. He starts to walk back to his apartment door, which is directly opposite Simon's, and sees his black friend. Then he notices the handyman, who has his tongue in his cheek, trying to suppress his amusement. Melvin barely reacts as we hear a loud knocking, and he bursts from his chair. As Simon hears Melvin through the door, he takes a step back, and Melvin throws open the door, looking demonic. Melvin walks back into the apartment, about to close the door when Simon has another burst of bravery, but Melvin enters his apartment and slams the door shut. Meanwhile, Frank smiles affectionately; Simon turns serious as Frank waits patiently, and Melvin jerks his door back open. Frank immediately grabs Melvin by his shirt, jerking him forward, and Melvin is scared but appears impressed. On a crowded and dirty street, Melvin comes walking briskly, like an animal wanting to pass through danger without giving off the scent of mounting fear, placing his palms together and extending his arms to cut a path through people, pointedly avoiding stepping on cracks and keeping his eyes focused on the terrain. Elsewhere, Carol Connelly is engaged in conversation with another mother, a customer, about her son for what seems like the umpteenth time; the mother nods too sympathetically, but Carol interrupts, and they both turn away as Melvin walks a few paces to the waitress station where waitresses Lisa and Carol are talking."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "She pivots around and directs her gaze down the hallway, and in the blink of an eye, the sweetness that once graced her features is replaced by an overwhelming wave of repulsion. Without delay, she swiftly reverses her direction, retreating back into the sanctuary of her apartment and closing the door behind her with a firm resolve. Meanwhile, all of his considerable talent and strength are fully concentrated on the challenging task of coaxing a tiny dog into the elevator, which he keeps propped open, while the dog sniffs with great curiosity at a particular spot on the hallway carpet. Melvin allows the elevator doors to slide shut and advances toward the little mutt, who remains uninterested in him; the dog lifts its leg just at the moment Melvin lunges forward, scooping it up with a decisive heft, resulting in a stream of dog urine spraying onto the hallway wall. Sensing a kindred spirit, the dog begins to growl and bark, snapping at Melvin, yet Melvin, who possesses a much meaner streak and quicker reflexes, firmly holds the dog's snout shut using his hand. He then reaches for the garbage chute door, stuffing the dog inside and letting go, just as another apartment door swings open, releasing a burst of loud party sounds and Simon Nye, a man in his early 30s, who bolts into the hallway. Melvin is on the verge of entering his own apartment when he notices Simon at the far end of the hall. He starts to make his way back to his apartment door, which is situated directly opposite Simon's, and notices his black friend. Then he observes the handyman, who has his tongue in his cheek, struggling to suppress his amusement. Melvin barely reacts as a loud knocking echoes, prompting him to burst from his chair. As Simon hears Melvin through the door, he instinctively takes a step back, and Melvin throws open the door, appearing almost demonic. Melvin strides back into the apartment, about to close the door when Simon musters another burst of bravery, but Melvin resolutely enters his apartment and slams the door shut with finality. Meanwhile, Frank smiles with a touch of affection; Simon adopts a serious demeanor as Frank waits patiently, and Melvin jerks his door back open. Frank immediately seizes Melvin by his shirt, jerking him forward, causing Melvin to feel a mixture of fear and a begrudging admiration. On a crowded and grimy street, Melvin walks briskly, much like an animal intent on passing through danger without emitting a scent of mounting fear, placing his palms together and extending his arms to carve a path through the throng of people, making a point to avoid stepping on cracks and keeping his eyes intently focused on the terrain ahead. Elsewhere, Carol Connelly is engaged in a conversation with another mother, who is also a customer, about her son for what seems like the umpteenth time; the mother nods with overly sympathetic gestures, but Carol interrupts, and they both turn away simultaneously as Melvin walks a few paces to the waitress station where waitresses Lisa and Carol are deep in conversation."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "She turns to face the hallway, and in an instant, her sweetness vanishes, replaced by a look of repulsion. Quickly, she pivots on her heel, re-enters her apartment, and firmly closes the door behind her. Meanwhile, all of his considerable talent and strength are concentrated on coaxing a tiny dog into the elevator, which he holds open, as the dog sniffs intently at a particular spot on the hall carpeting. Melvin allows the elevator door to close and advances toward the mutt, who pays him no mind; just as the dog lifts his leg, Melvin lunges forward and scoops him up with a decisive heft, causing a stream of dog urine to squirt onto the hall wall. The dog, sensing a kindred spirit, begins to growl and bark, snapping at Melvin, but Melvin, being much meaner and quicker, clamps the dog's snout shut with his hand. He then reaches for the garbage chute door, stuffs the dog inside, and releases his grip just as another apartment door swings open, releasing a burst of loud party sounds and revealing Simon Nye, in his early 30s, who bolts into the hall. Melvin is on the verge of entering his apartment when he catches sight of Simon at the far end of the hall. He starts to walk back to his apartment door, which is directly opposite Simon's, and notices his black friend. Then, he observes the handyman, who is trying to suppress his amusement with his tongue in his cheek. Melvin barely reacts as a loud knocking is heard, and he bursts from his chair. As Simon hears Melvin through the door, he instinctively takes a step back, and Melvin throws open the door, looking demonic. Melvin strides back into the apartment, about to close the door when Simon experiences another burst of bravery, but Melvin enters his apartment and slams the door shut. Meanwhile, Frank smiles affectionately; Simon turns serious as Frank waits patiently, and Melvin jerks his door back open. Frank immediately seizes Melvin by his shirt, jerking him forward, and Melvin, though scared, appears impressed. On a crowded and dirty street, Melvin walks briskly, like an animal wanting to pass through danger without emitting the scent of mounting fear. He places his palms together and extends his arms to carve a path through the throng of people, pointedly avoiding stepping on cracks and keeping his eyes focused on the terrain. Elsewhere, Carol Connelly is engaged in conversation with another mother, a customer, about her son for what seems like the umpteenth time; the mother nods with excessive sympathy, but Carol interrupts, and they both turn away as Melvin walks a few paces to the waitress station where waitresses Lisa and Carol are engaged in conversation."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "She turns to face the hallway, her demeanor shifting from sweetness to repulsion, and quickly retreats into her apartment, closing the door behind her. Meanwhile, Melvin focuses on coaxing a small dog into the elevator, but when the dog ignores him and urinates on the hall wall, Melvin decisively picks it up, silencing its growls by holding its snout shut. He stuffs the dog into the garbage chute just as Simon Nye, in his early 30s, emerges from a party-filled apartment. Melvin notices Simon and the amused handyman before a loud knocking prompts him to burst from his chair. As Simon steps back, Melvin opens his door, looking demonic, then retreats inside, slamming the door shut. Frank smiles at Simon, who turns serious, and when Melvin reopens the door, Frank grabs him by the shirt, impressing the initially scared Melvin. On a crowded street, Melvin briskly navigates through people, avoiding cracks and focusing on the ground. Elsewhere, Carol Connelly interrupts a sympathetic customer while discussing her son, then turns away as Melvin approaches the waitress station where Lisa and Carol are talking."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She turns and faces the hallway, her sweetness dissolves in a flash, replaced by repulsion akin to the sudden shift in mood caused by a foul odor wafting from the trash chute, and quickly she reverses herself, re-entering her apartment and closing the door behind her. Meanwhile, all his considerable talent and strength, honed from years of dealing with unruly pets in the building, are focused on seducing a tiny dog into the elevator door he holds open, sniffing at a particular spot on the hall carpeting notorious for lingering smells. Melvin lets the elevator door close and advances on the mutt, who ignores him; the dog lifts his leg just as Melvin lunges, reminiscent of a gamekeeper catching a stray animal, and picks him up with a decisive heft, causing dog urine to squirt on the hall wall marked by previous mishaps. Sensing a kindred spirit despite the circumstances, the dog starts to growl and bark, taking a snap at Melvin, but Melvin, much meaner and quicker due to his irritable nature, holds the dog's snout shut with his hand and reaches for the garbage chute door, a place of many discarded items, stuffing the dog in the chute and letting go, just as another apartment door, the one renowned for frequent lively gatherings, opens, emitting loud party sounds and Simon Nye, in his early 30s known for his career in graphic design, bolts into the hall. Melvin is about to enter his apartment when he notices Simon at the far end of the hall, starts to walk back to his apartment door directly opposite Simon's in a building designed with mirror-image layouts, and sees his black friend, recognized in the community for his charming wit. Then he notices the handyman, a man of few words but many skills, tongue in cheek, trying to suppress his amusement. Melvin barely reacts as we hear a loud knocking, and he bursts from his chair as if suddenly awakened. As Simon hears Melvin through the door, he takes a step back, and Melvin throws open the door, looking demonic with eyes wide and unyielding. Melvin walks back into the apartment, about to close the door when Simon has another burst of bravery, his courage fueled by past confrontations, but Melvin enters his apartment and slams the door shut with a resounding echo. Meanwhile, Frank, known for his patient demeanor, smiles affectionately; Simon turns serious as Frank waits patiently and Melvin jerks his door back open. Frank immediately grabs Melvin by his shirt, jerking him forward, and Melvin is scared but appears impressed by Frank's unexpected assertiveness. On a crowded and dirty street noted for its bustling activity and litter, Melvin comes walking briskly, like an animal wanting to pass through danger without giving off the scent of mounting fear, placing his palms together and extending his arms to cut a path through people, pointedly avoiding stepping on cracks, an idiosyncrasy linked to superstition, and keeping his eyes focused on the terrain. Elsewhere, Carol Connelly talks with another mother, a customer familiar with Carol's daily narrative, about her son for the umpteenth time; the mother nods too sympathetically, but Carol interrupts, and they turn away as Melvin walks a few paces to the waitress station where waitresses Lisa and Carol, who have been working together for years, are talking."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "She turns and faces the hallway her sweetness dissolves in a flash replaced by repulsion and quickly she reverses herself reentering her apartment and closing the door behind her. Meanwhile all his considerable talent and strength are focused on seducing a tiny dog into the elevator door. he holds open sniffing at a particular spot on the hall carpeting. Melvin let us the elevator door close and advances on the mutt who ignores him. the dog lifts his leg just as Melvin lunges and picks him up with a decisive heft causing dog urine to squirt on the hall wall. Sensing a kindred spirit the dog starts to growl and bark taking a snap at Melvin but Melvin much meaner and quicker holds the dog's snout shut with his hand and reaches for the garbage chute door stuffing the dog in the chute and letting go just as another apartment door opens emitting loud party sounds and Simon Nye in his early 30s bolts into the hall. Melvin is about to enter his apartment when he notices Simon at the far end of the hall starts to walk back to his apartment door directly opposite Simon's and sees his black friend. Then he notices the handyman tongue in cheek trying to suppress his amusement. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. Melvin barely reacts as we hear a loud knocking and he bursts from his chair. As Simon hears Melvin through the door he takes a step back and Melvin throws open the door looking demonic. Melvin walks back into the apartment about to close the door when Simon has another burst of bravery but Melvin enters his apartment and slams the door shut. Meanwhile Frank smiles affectionately. Simon turns serious as Frank waits patiently and Melvin jerks his door back open. Frank immediately grabs Melvin by his shirt jerking him forward and Melvin is scared but appears impressed. On a crowded and dirty street Melvin comes walking briskly like an animal wanting to pass through danger without giving off the scent of mounting fear placing his palms together and extending his arms to cut a path through people pointedly avoiding stepping on cracks and keeping his eyes focused on the terrain. Elsewhere Carol Connelly talks with another mother a customer about her son for the umpteenth time. the mother nods too sympathetically but Carol interrupts and they turn away as Melvin walks a few paces to the waitress station where waitresses Lisa and Carol are talking."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "She turns and faces the hallway her sweetness dissolves in a flash replaced by repulsion and quickly she reverses herself reentering her apartment and closing the door behind her. Meanwhile all his considerable talent and strength are focused on seducing a tiny dog into the elevator door. he holds open sniffing at a particular spot on the hall carpeting. Melvin let us the elevator door close and advances on the mutt who ignores him. the dog lifts his leg just as Melvin lunges and picks him up with a decisive heft causing dog urine to squirt on the hall wall. Sensing a kindred spirit the dog starts to growl and bark taking a snap at Melvin but Melvin much meaner and quicker holds the dog's snout shut with his hand and reaches for the garbage chute door stuffing the dog in the chute and letting go just as another apartment door opens emitting loud party sounds and Simon Nye in his early 30s bolts into the hall. Melvin is about to enter his apartment when he notices Simon at the far end of the hall starts to walk back to his apartment door directly opposite Simon's and sees his black friend. Then he notices the handyman tongue in cheek trying to suppress his amusement. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Melvin barely reacts as we hear a loud knocking and he bursts from his chair. As Simon hears Melvin through the door he takes a step back and Melvin throws open the door looking demonic. Melvin walks back into the apartment about to close the door when Simon has another burst of bravery but Melvin enters his apartment and slams the door shut. Meanwhile Frank smiles affectionately. Simon turns serious as Frank waits patiently and Melvin jerks his door back open. Frank immediately grabs Melvin by his shirt jerking him forward and Melvin is scared but appears impressed. On a crowded and dirty street Melvin comes walking briskly like an animal wanting to pass through danger without giving off the scent of mounting fear placing his palms together and extending his arms to cut a path through people pointedly avoiding stepping on cracks and keeping his eyes focused on the terrain. Elsewhere Carol Connelly talks with another mother a customer about her son for the umpteenth time. the mother nods too sympathetically but Carol interrupts and they turn away as Melvin walks a few paces to the waitress station where waitresses Lisa and Carol are talking."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "She turns and faces the hallway her sweetness dissolves in a flash replaced by repulsion and quickly she reverses herself reentering her apartment and closing the door behind her. Meanwhile all his considerable talent and strength are focused on seducing a tiny dog into the elevator door. he holds open sniffing at a particular spot on the hall carpeting. Melvin let us the elevator door close and advances on the mutt who ignores him. Simon turns serious as Frank waits patiently and Melvin jerks his door back open. Frank immediately grabs Melvin by his shirt jerking him forward and Melvin is scared but appears impressed. On a crowded and dirty street Melvin comes walking briskly like an animal wanting to pass through danger without giving off the scent of mounting fear placing his palms together and extending his arms to cut a path through people pointedly avoiding stepping on cracks and keeping his eyes focused on the terrain. Elsewhere Carol Connelly talks with another mother a customer about her son for the umpteenth time. the mother nods too sympathetically but Carol interrupts and they turn away as Melvin walks a few paces to the waitress station where waitresses Lisa and Carol are talking."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "She turns and faces the hallway her sweetness dissolves in a flash replaced by repulsion and quickly she reverses herself reentering her apartment and closing the door behind her. Meanwhile all his considerable talent and strength are focused on seducing a tiny dog into the elevator door. Elsewhere Carol Connelly talks with another mother a customer about her son for the umpteenth time. the mother nods too sympathetically but Carol interrupts and they turn away as Melvin walks a few paces to the waitress station where waitresses Lisa and Carol are talking."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "She flips and faces the stairwell, her calm shatters in a blink, replaced by anger, and quickly she shifts herself, re-entering her studio and locking the portal behind her. Meanwhile, all her considerable skill and cunning are centered on enticing a small parrot into the escalator gate she holds ajar, pecking at a specific mark on the stair tiling. Marvin lets the escalator gate shut and advances on the bird, who disregards him; the parrot flaps its wing just as Marvin darts and grabs it with a swift snatch, causing parrot seeds to scatter on the stair banister. Detecting a similar nature, the parrot begins to squawk and chirp, taking a peck at Marvin, but Marvin, much tougher and swifter, clamps the parrot's beak with his fingers and reaches for the laundry chute cover, cramming the parrot in the chute and releasing it, just as another studio entrance opens, emitting loud music sounds and Stanley Long, in his late 20s, races into the stairwell. Marvin is about to step into his studio when he notices Stanley at the far end of the stairwell, starts to amble back to his studio entrance directly facing Stanley's, and spots his blue companion. Then he observes the gardener, smirking silently, attempting to hold back his laughter. Marvin barely responds as we hear a loud pounding, and he leaps from his couch. As Stanley hears Marvin through the portal, he takes a stride backward, and Marvin flings open the portal, looking menacing. Marvin strides back into the studio, about to latch the entrance when Stanley has another surge of courage, but Marvin enters his studio and slams the entrance shut. Meanwhile, Fred grins tenderly; Stanley turns solemn as Fred stands quietly and Marvin yanks his entrance back open. Fred instantly seizes Marvin by his jacket, pulling him ahead, and Marvin is startled but seems intrigued. On a congested and grimy boulevard, Marvin strolls swiftly, like a panther wanting to glide through peril without projecting the scent of rising anxiety, placing his fingers together and stretching his arms to slice a trail through people, intentionally avoiding treading on stones and keeping his gaze fixed on the surface. Elsewhere, Wanda Cassidy discusses with another teacher, a shopper, about her daughter for the umpteenth time; the teacher nods overly empathetically, but Wanda cuts off, and they pivot away as Marvin ambles a few strides to the chef station where chefs Laura and Wanda are chatting."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "She turns towards the hallway, her sweetness replaced by repulsion, and retreats into her apartment. Meanwhile, Melvin attempts to coax a small dog into the elevator, but the dog urinates on the wall as Melvin picks it up. The dog growls and snaps at Melvin, who counters by holding its snout and stuffing it into the garbage chute just as Simon Nye rushes out of his apartment. Melvin notices Simon and a handyman suppressing laughter. Simon hears Melvin and steps back as Melvin bursts out, appearing demonic. After a tense moment, Simon regains bravery, but Melvin slams his door shut. Frank smiles affectionately; when Melvin reopens the door, Frank grabs him, and Melvin is both scared and impressed. On a crowded street, Melvin briskly walks, avoiding cracks and cutting through people. Meanwhile, Carol Connelly discusses her son with another mother but is interrupted and turns away as Melvin approaches the waitress station where Lisa and Carol talk."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "the mother nods too sympathetically but Carol interrupts and they turn away as Melvin walks a few paces to the waitress station where waitresses Lisa and Carol are talking Elsewhere Carol Connelly talks with another mother a customer about her son for the umpteenth time  On a crowded and dirty street Melvin comes walking briskly like an animal wanting to pass through danger without giving off the scent of mounting fear placing his palms together and extending his arms to cut a path through people pointedly avoiding stepping on cracks and keeping his eyes focused on the terrain  Frank immediately grabs Melvin by his shirt jerking him forward and Melvin is scared but appears impressed  Simon turns serious as Frank waits patiently and Melvin jerks his door back open  Meanwhile Frank smiles affectionately  Melvin walks back into the apartment about to close the door when Simon has another burst of bravery but Melvin enters his apartment and slams the door shut  As Simon hears Melvin through the door he takes a step back and Melvin throws open the door looking demonic  Melvin barely reacts as we hear a loud knocking and he bursts from his chair  Then he notices the handyman tongue in cheek trying to suppress his amusement  Melvin is about to enter his apartment when he notices Simon at the far end of the hall starts to walk back to his apartment door directly opposite Simon's and sees his black friend  Sensing a kindred spirit the dog starts to growl and bark taking a snap at Melvin but Melvin much meaner and quicker holds the dog's snout shut with his hand and reaches for the garbage chute door stuffing the dog in the chute and letting go just as another apartment door opens emitting loud party sounds and Simon Nye in his early 30s bolts into the hall  the dog lifts his leg just as Melvin lunges and picks him up with a decisive heft causing dog urine to squirt on the hall wall  Melvin lets the elevator door close and advances on the mutt who ignores him  he holds open sniffing at a particular spot on the hall carpeting  Meanwhile all his considerable talent and strength are focused on seducing a tiny dog into the elevator door  She turns and faces the hallway her sweetness dissolves in a flash replaced by repulsion and quickly she reverses herself reentering her apartment and closing the door behind her "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Meanwhile all his considerable talent and strength are focused on seducing a tiny dog into the elevator door She turns and faces the hallway her sweetness dissolves in a flash replaced by repulsion and quickly she reverses herself reentering her apartment and closing the door behind her Melvin let us the elevator door close and advances on the mutt who ignores him he holds open sniffing at a particular spot on the hall carpeting Sensing a kindred spirit the dog starts to growl and bark taking a snap at Melvin but Melvin much meaner and quicker holds the dog's snout shut with his hand and reaches for the garbage chute door stuffing the dog in the chute and letting go just as another apartment door opens emitting loud party sounds and Simon Nye in his early 30s bolts into the hall the dog lifts his leg just as Melvin lunges and picks him up with a decisive heft causing dog urine to squirt on the hall wall Then he notices the handyman tongue in cheek trying to suppress his amusement Melvin is about to enter his apartment when he notices Simon at the far end of the hall starts to walk back to his apartment door directly opposite Simon's and sees his black friend As Simon hears Melvin through the door he takes a step back and Melvin throws open the door looking demonic Melvin barely reacts as we hear a loud knocking and he bursts from his chair Meanwhile Frank smiles affectionately Melvin walks back into the apartment about to close the door when Simon has another burst of bravery but Melvin enters his apartment and slams the door shut Frank immediately grabs Melvin by his shirt jerking him forward and Melvin is scared but appears impressed Simon turns serious as Frank waits patiently and Melvin jerks his door back open Elsewhere Carol Connelly talks with another mother a customer about her son for the umpteenth time On a crowded and dirty street Melvin comes walking briskly like an animal wanting to pass through danger without giving off the scent of mounting fear placing his palms together and extending his arms to cut a path through people pointedly avoiding stepping on cracks and keeping his eyes focused on the terrain the mother nods too sympathetically but Carol interrupts and they turn away as Melvin walks a few paces to the waitress station where waitresses Lisa and Carol are talking"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "As Simon hears Melvin through the door he takes a step back and Melvin throws open the door looking demonic  Melvin walks back into the apartment about to close the door when Simon has another burst of bravery but Melvin enters his apartment and slams the door shut  Meanwhile Frank smiles affectionately  Simon turns serious as Frank waits patiently and Melvin jerks his door back open  Frank immediately grabs Melvin by his shirt jerking him forward and Melvin is scared but appears impressed  On a crowded and dirty street Melvin comes walking briskly like an animal wanting to pass through danger without giving off the scent of mounting fear placing his palms together and extending his arms to cut a path through people pointedly avoiding stepping on cracks and keeping his eyes focused on the terrain  Elsewhere Carol Connelly talks with another mother a customer about her son for the umpteenth time  the mother nods too sympathetically but Carol interrupts and they turn away as Melvin walks a few paces to the waitress station where waitresses Lisa and Carol are talking She turns and faces the hallway her sweetness dissolves in a flash replaced by repulsion and quickly she reverses herself reentering her apartment and closing the door behind her  Meanwhile all his considerable talent and strength are focused on seducing a tiny dog into the elevator door  he holds open sniffing at a particular spot on the hall carpeting  Melvin lets the elevator door close and advances on the mutt who ignores him  the dog lifts his leg just as Melvin lunges and picks him up with a decisive heft causing dog urine to squirt on the hall wall  Sensing a kindred spirit the dog starts to growl and bark taking a snap at Melvin but Melvin much meaner and quicker holds the dog's snout shut with his hand and reaches for the garbage chute door stuffing the dog in the chute and letting go just as another apartment door opens emitting loud party sounds and Simon Nye in his early 30s bolts into the hall  Melvin is about to enter his apartment when he notices Simon at the far end of the hall starts to walk back to his apartment door directly opposite Simon's and sees his black friend  Then he notices the handyman tongue in cheek trying to suppress his amusement  Melvin barely reacts as we hear a loud knocking and he bursts from his chair "
        }
      ]
    }
  ]
}