{
  "ground_truth": "Laurie glances back at the bushes behind them. The two girls stop in front of Annie's house, another small suburban home. Annie walks up to her door. For a moment Laurie looks around cautiously before searching down the sidewalk again, with the camera tracking with her. Again she turns around and glances back down the street. Suddenly, Laurie walks right into a man standing on the sidewalk in front of her. She screams and drops her books. It is Lee Brackett, Annie's father, a tall man in a county sheriff's uniform. Laurie bundles her books and hurries up the street as Brackett walks down the sidewalk to his house. Laurie walks up on the front porch of her house, pauses a moment, and glances down the street. Several children in costumes are going door to door collecting their treats. She slams the receiver down. Almost immediately, the phone rings again. Laurie looks at it and picks it up. The camera begins on the trees that line the residential street, twisting and writhing in the dusk wind. Laurie carries a tote bag with schoolbooks and knitting needles inside, and a large pumpkin. The sun is a pale glow behind the trees. Slowly, the camera booms down to Laurie waiting outside her house by the street. Laurie turns her gaze down the street, where more children in costumes walk from house to house, some with mothers and sisters, trick or treating. The wind blows their costumes, billowing them outward. She watches the trick-or-treaters as a car swings around the corner and pulls up in front of her. There is a wide shot of an old graveyard on a windy hillside. The camera booms down as a car pulls up on the small road in the foreground. Sam Loomis gets out, along with Taylor, the graveyard owner. He glances at a small notepad. The two men begin walking along the graveyard, winding around headstones and flowers. Taylor stops cold and points to a plot right in front of them. Taylor gives Loomis a quizzical look as Loomis stares. The headstone is missing, uprooted from the ground. Loomis shakes his head and looks across the graveyard. Taylor checks his notebook, then counts the rows and plots. Behind them, through the rear-view mirror, we see Loomis' station wagon pull out of an alley and follow along. Annie points up ahead and quickly hides the joint as Annie's car drives through the main square of Haddonfield, with the station wagon following behind. Two police cars are parked in the street in front of Nichols Hardware Store. Annie's car stops at the police cars. They quickly roll down the windows and begin wildly clearing out the marijuana smoke. Lee Brackett strolls out to the car and leans down to the window.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Laurie glances back at the shrubs behind them. The two girls halt in front of Annie's residence, another small suburban homestead. Annie walks up to her entrance. For a moment Laurie looks around cautiously before searching down the pavement again, with the camera tracking with her. Again she turns around and glances back down the thoroughfare. Suddenly, Laurie walks right into a man standing on the pavement in front of her. She screams and drops her books. It is Lee Brackett, Annie's father, a tall man in a county sheriff's attire. Laurie bundles her books and hurries up the thoroughfare as Brackett walks down the pavement to his residence. Laurie walks up on the front porch of her residence, pauses a moment, and glances down the thoroughfare. Several children in costumes are going door to door collecting their treats. She slams the receiver down. Almost immediately, the phone rings again. Laurie looks at it and picks it up. The camera begins on the trees that line the residential thoroughfare, twisting and writhing in the dusk breeze. Laurie carries a tote bag with schoolbooks and knitting needles inside, and a large pumpkin. The sun is a pale glow behind the trees. Slowly, the camera booms down to Laurie waiting outside her residence by the thoroughfare. Laurie turns her gaze down the thoroughfare, where more children in costumes walk from residence to residence, some with mothers and siblings, trick or treating. The breeze blows their costumes, billowing them outward. She watches the trick-or-treaters as a vehicle swings around the corner and pulls up in front of her. There is a wide shot of an old cemetery on a gusty hillside. The camera booms down as a vehicle pulls up on the small road in the foreground. Sam Loomis gets out, along with Taylor, the cemetery owner. He glances at a small notepad. The two men begin walking along the cemetery, winding around tombstones and blooms. Taylor stops cold and points to a plot right in front of them. Taylor gives Loomis a quizzical look as Loomis stares. The tombstone is missing, uprooted from the earth. Loomis shakes his head and looks across the cemetery. Taylor checks his notebook, then counts the rows and plots. Behind them, through the rear-view mirror, we see Loomis' station wagon pull out of an alley and follow along. Annie points up ahead and quickly hides the joint as Annie's vehicle drives through the main square of Haddonfield, with the station wagon following behind. Two police vehicles are parked in the thoroughfare in front of Nichols Hardware Store. Annie's vehicle stops at the police vehicles. They quickly roll down the windows and begin wildly clearing out the cannabis smoke. Lee Brackett strolls out to the vehicle and leans down to the window."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Laurie’s glances are cast back at the bushes behind them. In front of Annie's house, another small suburban home is where the two girls stop. The door is approached by Annie. For a moment, Laurie’s cautious look is cast around before her search continues down the sidewalk again, with the camera tracking her. Again, the street is glanced back down by her. Suddenly, a man standing on the sidewalk in front of her is walked right into by Laurie. A scream is let out by her, and her books are dropped. It is Lee Brackett, Annie's father, a tall man in a county sheriff's uniform. Her books are bundled by Laurie as she hurries up the street while Brackett walks down the sidewalk to his house. The front porch of her house is walked up on by Laurie; a moment is paused by her, and the street is glanced down. Costumed children are going door to door collecting their treats. The receiver is slammed down by her. Almost immediately, the phone rings again. It is looked at by Laurie, and it is picked up. The camera begins on the trees that line the residential street, twisting and writhing in the dusk wind. A tote bag with schoolbooks and knitting needles inside, along with a large pumpkin, is carried by Laurie. The sun is a pale glow behind the trees. Slowly, Laurie is waited for by the camera outside her house by the street. Her gaze is turned down the street by Laurie, where more children in costumes walk from house to house, some with mothers and sisters, trick or treating. The wind blows their costumes, billowing them outward. The trick-or-treaters are watched by her as a car swings around the corner and pulls up in front of her. A wide shot of an old graveyard on a windy hillside is shown. Down booms the camera as a car pulls up on the small road in the foreground. Out gets Sam Loomis, along with Taylor, the graveyard owner. A small notepad is glanced at by him. Along the graveyard, the two men begin walking, winding around headstones and flowers. Taylor stops cold and points to a plot right in front of them. A quizzical look is given by Taylor to Loomis as Loomis stares. The headstone is missing, uprooted from the ground. His head is shaken by Loomis, and the graveyard is looked across. Taylor checks his notebook, then counts the rows and plots. Through the rear-view mirror, behind them, Loomis' station wagon is seen pulling out of an alley and following along. Up ahead is pointed to by Annie, and the joint is quickly hidden as Annie's car drives through the main square of Haddonfield, with the station wagon following behind. In front of Nichols Hardware Store, two police cars are parked in the street. At the police cars, Annie's car stops. The windows are quickly rolled down, and the marijuana smoke is wildly cleared out. Lee Brackett strolls out to the car and leans down to the window."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Laurie glances back at the bushes behind them as the girls stop at Annie's suburban house. Annie heads to her door while Laurie cautiously looks around before moving down the sidewalk. Suddenly, she bumps into a man, dropping her books. It’s Lee Brackett, Annie's father, in a sheriff's uniform. Laurie gathers her books and hurries away as Brackett heads to his house. On her porch, Laurie pauses, glancing down the street at costumed children trick-or-treating. She slams the phone down but it rings again. Laurie picks it up as the camera shows trees lining the street, moving in the dusk wind. She carries a tote with schoolbooks, knitting needles, and a large pumpkin as the sun sets. Laurie watches more children in costumes trick-or-treating as a car pulls up in front of her. A wide shot follows a graveyard on a windy hillside. Sam Loomis and Taylor, the graveyard owner, walk among headstones. Taylor points to a plot with a missing headstone. Loomis shakes his head and looks across the graveyard, while Taylor counts the rows. Loomis' station wagon is seen pulling out of an alley. Annie's car, followed by the station wagon, drives through Haddonfield's main square, approaching police cars outside Nichols Hardware Store. Annie's car stops, and they quickly clear marijuana smoke as Lee Brackett approaches the window."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Laurie glances at the bushes and stops with a friend at Annie's house. Annie enters while Laurie looks around. She bumps into Lee Brackett, Annie’s father in a sheriff's uniform, and drops her books, hurrying away. Laurie pauses on her porch and watches kids in costumes trick-or-treating. The phone rings after she slams the receiver down. Laurie, with her schoolbooks, knitting needles, and a pumpkin, stands by the street as a car pulls up. A graveyard shot shows Sam Loomis and Taylor finding a missing headstone. Loomis shakes his head while Taylor checks a notebook. Meanwhile, Annie hides a joint as her car, followed by a station wagon, reaches the police cars at Nichols Hardware Store. They clear marijuana smoke as Lee Brackett approaches."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Laurie, with a cautious and slightly anxious demeanor, glances back over her shoulder at the dense bushes situated directly behind them. The two girls then come to a halt in front of Annie's house, which is yet another modest suburban home in the neighborhood. Annie confidently strides up to her front door. Meanwhile, Laurie takes a brief moment to look around cautiously, scanning her surroundings with a sense of vigilance before she once again resumes her watch along the sidewalk, with the camera steadily tracking her movements. Once more, she pivots around and casts a glance back down the street. In that instant, Laurie unexpectedly walks right into a man who happens to be standing directly on the sidewalk in her path. Startled, she lets out a scream and her books tumble from her grip. The man is identified as Lee Brackett, who is Annie's father, and he stands tall and authoritative in his county sheriff's uniform. Hastily gathering her books, Laurie then hurries up the street while Brackett makes his way down the sidewalk toward his house. Laurie approaches the front porch of her own home, where she pauses for a brief moment, casting a glance down the street. There, she observes several children dressed in costumes, joyfully going from door to door collecting their Halloween treats. Laurie abruptly slams the phone receiver down, only for it to suddenly ring again almost immediately. She hesitates, then looks at it and picks it up once more. The camera takes in a wide view of the trees lining the residential street, their branches twisting and writhing in the dusky wind. Laurie carries with her a tote bag filled with her schoolbooks, knitting needles, and a sizable pumpkin. The sun casts a pale glow behind the trees, slowly setting. Deliberately, the camera lowers its gaze to Laurie, who waits patiently outside her house near the street. She turns her attention down the street, watching as more children in costumes make their rounds from house to house, some accompanied by mothers or sisters, as they delight in the tradition of trick-or-treating. The wind catches their costumes, causing them to billow outward dramatically. She continues to observe the trick-or-treaters as a car swings around the corner, coming to a stop right in front of her. Meanwhile, the camera captures a sweeping wide shot of an old graveyard situated on a windy hillside. As the camera lowers, a car drives up along the small road in the foreground. Sam Loomis steps out of the vehicle, accompanied by Taylor, the graveyard's caretaker. Taylor quickly glances at a small notepad he carries. The two men proceed to walk along the winding path of the graveyard, meandering around the headstones and the scattered flowers. Unexpectedly, Taylor halts in his tracks and points to a plot directly in front of them. He casts a quizzical look in Loomis' direction as Loomis stares at the disturbing sight in front of them. The headstone, which should be firmly in place, is conspicuously missing, having been uprooted from the ground. Loomis shakes his head in disbelief and gazes across the expanse of the graveyard. Taylor rechecks his notebook, counting the rows and plots meticulously. Behind them, visible through the rear-view mirror, is the image of Loomis' station wagon as it pulls out of an alley, closely following along. Annie, in her vehicle, points up ahead and quickly hides the joint when she realizes that Annie's car is navigating through the bustling main square of Haddonfield, with the station wagon trailing not far behind. Two police cars are parked prominently in the street right in front of Nichols Hardware Store. Annie's car comes to a stop next to the police cars. Rapidly, they roll down the windows and frantically begin clearing out the lingering marijuana smoke. Lee Brackett then casually strolls out toward the car, leaning down to peer through the window."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Laurie, carrying an air of caution and a slightly anxious demeanor, casts a wary glance back over her shoulder at the thick, dense bushes situated directly behind them. The two girls then come to a stop right in front of Annie's house, which is yet another modest and unassuming suburban home nestled within the neighborhood. Annie, with a sense of confidence, strides purposefully up to her front door. Meanwhile, Laurie pauses for a brief moment to cautiously scan her surroundings, her eyes flickering with a sense of alertness as she resumes her vigilant watch along the sidewalk, with the camera steadily tracking her every movement. Yet again, she pivots around, casting another glance back down the street. In that unexpected instant, Laurie walks right into a man who happens to be standing precisely on the sidewalk in her path. Startled, she lets out a scream, and her books fall from her grip, scattering onto the ground. The man is identified as Lee Brackett, who is Annie's father. He stands tall and authoritative, dressed in his county sheriff's uniform. Hastily gathering her scattered books, Laurie then hurries up the street, while Brackett makes his way down the sidewalk toward his own house. Laurie approaches the front porch of her own home, where she pauses momentarily to cast a glance down the street. There, she observes several children dressed in vibrant costumes, joyfully going from door to door, eagerly collecting their Halloween treats. Laurie abruptly slams the phone receiver down, only for it to ring again almost immediately. She hesitates for a moment, looks at it intently, and then picks it up once more. The camera pans to take in a wide view of the stately trees lining the residential street, their branches twisting and writhing gracefully in the dusky wind. Laurie carries with her a tote bag filled with her schoolbooks, knitting needles, and a sizable pumpkin. The sun casts a pale, soft glow behind the trees as it slowly sets beyond the horizon. Deliberately, the camera lowers its gaze to Laurie, who waits patiently outside her house, near the edge of the street. She turns her attentive gaze down the street, watching as more children in colorful costumes make their rounds from house to house, some accompanied by mothers or sisters, delighting in the cherished tradition of trick-or-treating. The wind catches their costumes, causing them to billow outward dramatically in the breeze. She continues to observe the trick-or-treaters with interest as a car swings around the corner, smoothly coming to a stop right in front of her. Meanwhile, the camera captures a sweeping, wide shot of an old graveyard situated on a windy, desolate hillside. As the camera lowers, a car drives up along the small road in the foreground. Sam Loomis steps out of the vehicle, accompanied by Taylor, the graveyard's caretaker. Taylor quickly glances at a small notepad he carries with him. The two men proceed to walk along the winding path of the graveyard, meandering around the headstones and the scattered flowers that dot the area. Unexpectedly, Taylor halts abruptly in his tracks and points to a plot directly in front of them. He casts a quizzical look in Loomis' direction as Loomis stares intently at the disturbing sight before them. The headstone, which should be securely in place, is conspicuously missing, having been uprooted from the ground. Loomis shakes his head slowly in disbelief and gazes across the expanse of the graveyard. Taylor rechecks his notebook, carefully counting the rows and plots with meticulous attention. Behind them, visible through the rear-view mirror, is the image of Loomis' station wagon as it pulls out of an alley, closely following along. Annie, in her vehicle, points up ahead and quickly hides the joint when she realizes that Annie's car is navigating through the bustling main square of Haddonfield, with the station wagon trailing closely not far behind. Two police cars are parked prominently in the street, right in front of Nichols Hardware Store. Annie's car comes to a stop next to the police cars. Rapidly, they roll down the windows and begin frantically clearing out the lingering marijuana smoke. Lee Brackett then casually strolls out toward the car, leaning down to peer through the window with curiosity."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Laurie casts a quick glance back at the bushes behind her, a cautious movement that reflects her unease. In tandem with this action, the two girls halt their steps in front of Annie's house, another typical suburban residence nestled in the quiet neighborhood. Annie confidently strides up to her front door, leaving Laurie to momentarily scan her surroundings with a cautious eye. Her gaze shifts once more, this time she methodically searches down the sidewalk, her perspective seamlessly tracked by the camera. Once again, Laurie pivots, her head turning to send another glance back down the street behind them. Abruptly, without warning, Laurie collides with a man standing right in her path on the sidewalk. The sudden impact startles her, eliciting a scream as she loses her grip and her schoolbooks tumble to the ground. This man is revealed to be Lee Brackett, Annie's father, a tall figure dressed in the official attire of a county sheriff. Hastily gathering her scattered books, Laurie then makes a quick retreat, hurrying up the street away from Brackett as he casually continues his walk down the sidewalk toward his home. Upon reaching her own house, Laurie steps onto the front porch, taking a brief moment to pause and survey the street once more. Below her, several children donning various costumes move from door to door in a lively procession of trick-or-treating, their excitement palpable. In an abrupt motion, she slams the phone receiver down, only to have it ring almost immediately, drawing her attention back as she looks at it before picking it up. The scene transitions, beginning with a shot of the trees aligning the residential street, their branches twisting and writhing as the wind of dusk sweeps through. Laurie, now carrying a tote bag filled with schoolbooks, knitting needles, and a large pumpkin, stands against this backdrop. The sun, though faint, casts a pale glow beyond the tree line. Gradually, the camera shifts its focus down to Laurie, who waits patiently outside her house by the street. Her eyes turn toward the street, observing as more costumed children, some accompanied by mothers and sisters, move house to house in the ritual of trick-or-treating, their costumes animated by the gusts of wind. She watches them intently, just as a car navigates around the corner, smoothly pulling up in front of her. The scene expands to reveal a panoramic view of an old graveyard situated on a windy hillside. The camera descends as a car approaches on the narrow road in the foreground. From the vehicle emerges Sam Loomis alongside Taylor, the graveyard's caretaker, glancing at a small notepad in his hand. The duo sets off, meandering along the graveyard's paths, weaving around headstones and scattered flowers. Their movement comes to an abrupt halt when Taylor freezes, his finger extending to indicate a plot directly in front of them, drawing attention to the evident absence of a headstone. Loomis, confronted with this anomaly, simply stares, a puzzled expression settling across his features. Taylor returns his gaze, equally perplexed, as Loomis shakes his head, casting his eyes across the expanse of the graveyard. Taylor, seeking some clarity, refers back to his notebook, methodically counting the rows and plots, a task that lends the scene an air of anxious scrutiny. Meanwhile, in the background, seen through the rear-view mirror, Loomis' station wagon emerges from an alley, subtly trailing behind. Concurrently, Annie points to something up ahead, quickly concealing the joint as her car glides through the bustling main square of Haddonfield, with the station wagon maintaining its pursuit. Two police cars sit stationary in the street, positioned in front of Nichols Hardware Store. Annie's car pulls to a stop next to the police vehicles, and without delay, she and her passengers roll down the windows, frantically dispersing the lingering marijuana smoke. Lee Brackett, having noticed the commotion, approaches the car in a leisurely stroll, bending down to peer through the window, adding another layer of tension to the unfolding scene."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Laurie and the two girls pause outside Annie's suburban home. As Annie heads to her door, Laurie cautiously scans her surroundings, glancing back down the street. Distracted, she bumps into Lee Brackett, Annie’s father, a tall man in a sheriff's uniform, and drops her books in surprise. Gathering them quickly, she hurries up the street while Brackett continues to his house. Upon reaching her front porch, Laurie pauses to observe trick-or-treaters wandering from house to house before slamming down the phone receiver. The phone rings again, prompting her to answer as the camera captures the dusk wind twisting the trees lining the residential street. Laurie stands outside her house, carrying a tote with schoolbooks, knitting needles, and a large pumpkin, as more costumed children trick-or-treat nearby. A car approaches, pulling up in front of her. Meanwhile, Sam Loomis and Taylor, the graveyard owner, arrive at a windy hillside graveyard. After consulting a notepad, Taylor points out a plot with a missing headstone, prompting Loomis to survey the area while Taylor counts rows and plots. Their discussion is mirrored by a station wagon pulling out of an alley and following them. In Haddonfield’s main square, Annie hides a joint as her car, tailed by the station wagon, approaches Nichols Hardware Store, where police cars are parked. Rolling down their windows, Annie and her passengers clear out marijuana smoke as Lee Brackett approaches the car."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Laurie glances back at the bushes behind them, which are thick with autumn foliage often found in this suburban region during late October. The two girls stop in front of Annie's house, another small suburban home typical of 1970s architecture in the Midwest. Annie walks up to her door, painted in a cheerful hue that stands out on this quiet street. For a moment Laurie looks around cautiously before searching down the sidewalk again, with the camera tracking with her. Again she turns around and glances back down the street, which is lined with trees that have just begun to shed their leaves. Suddenly, Laurie walks right into a man standing on the sidewalk in front of her. She screams and drops her books. It is Lee Brackett, Annie's father, a tall man in a county sheriff's uniform, a position that gives him authority over local law enforcement matters. Laurie bundles her books and hurries up the street as Brackett walks down the sidewalk to his house, which is known in the neighborhood for its well-tended garden. Laurie walks up on the front porch of her house, pauses a moment, and glances down the street. Several children in costumes, celebrating Halloween, are going door to door collecting their treats. She slams the receiver down after a tense conversation. Almost immediately, the phone rings again, a sound that feels ominous in the quiet evening. Laurie looks at it and picks it up. The camera begins on the trees that line the residential street, twisting and writhing in the dusk wind common to fall evenings in this area. Laurie carries a tote bag with schoolbooks and knitting needles inside, and a large pumpkin, a symbol of the Halloween season. The sun is a pale glow behind the trees as it sets earlier each day at this time of year. Slowly, the camera booms down to Laurie waiting outside her house by the street. Laurie turns her gaze down the street, where more children in costumes walk from house to house, some with mothers and sisters, trick or treating. The wind blows their costumes, billowing them outward in a playful manner. She watches the trick-or-treaters as a car swings around the corner and pulls up in front of her. There is a wide shot of an old graveyard on a windy hillside, a place often visited by those seeking the history of their ancestors. The camera booms down as a car pulls up on the small road in the foreground. Sam Loomis gets out, along with Taylor, the graveyard owner, who has been maintaining these grounds for decades. He glances at a small notepad. The two men begin walking along the graveyard, winding around headstones and flowers left by loved ones. Taylor stops cold and points to a plot right in front of them. Taylor gives Loomis a quizzical look as Loomis stares. The headstone is missing, uprooted from the ground, which is unusual and troubling for both men. Loomis shakes his head and looks across the graveyard, scanning for any other signs of disturbance. Taylor checks his notebook, then counts the rows and plots to confirm his suspicions. Behind them, through the rear-view mirror, we see Loomis' station wagon pull out of an alley and follow along, hinting at someone watching their every move. Annie points up ahead and quickly hides the joint as Annie's car drives through the main square of Haddonfield, a town known for its traditional Halloween celebrations, with the station wagon following behind. Two police cars are parked in the street in front of Nichols Hardware Store, a local business that has been part of the community for years. Annie's car stops at the police cars. They quickly roll down the windows and begin wildly clearing out the marijuana smoke, hoping to avoid trouble with the law. Lee Brackett strolls out to the car and leans down to the window, his sheriff's badge gleaming in the streetlights."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Laurie glances back at the bushes behind them. The two girls stop in front of Annie's house another small suburban home. Annie walks up to her door. For a moment Laurie looks around cautiously before searching down the sidewalk again with the camera tracking with her. Again she turns around and glances back down the street. Suddenly Laurie walks right into a man standing on the sidewalk in front of her. She screams and drops her books. It is Lee Brackett Annie's father a tall man in a county sheriff's uniform. Laurie bundles her books and hurries up the street as Brackett walks down the sidewalk to his house. Laurie walks up on the front porch of her house pauses a moment and glances down the street. Several children in costumes are going door to door collecting their treats. She slams the receiver down. Almost immediately the phone rings again. Laurie looks at it and picks it up. The camera begins on the trees that line the residential street twisting and writhing in the dusk wind. Laurie carries a tote bag with schoolbooks and knitting needles inside and a large pumpkin. The sun is a pale glow behind the trees. Slowly the camera booms down to Laurie waiting outside her house by the street. Laurie turns her gaze down the street where more children in costumes walk from house to house some with mothers and sisters trick or treating. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. The wind blows their costumes billowing them outward. She watches the trickortreaters as a car swings around the corner and pulls up in front of her. There is a wide shot of an old graveyard on a windy hillside. The camera booms down as a car pulls up on the small road in the foreground. Sam Loomis gets out along with Taylor the graveyard owner. He glances at a small notepad. The two men begin walking along the graveyard winding around headstones and flowers. Taylor stops cold and points to a plot right in front of them. Taylor gives Loomis a quizzical look as Loomis stares. The headstone is missing uprooted from the ground. Loomis shakes his head and looks across the graveyard. Taylor checks his notebook then counts the rows and plots. Behind them. through the rearview mirror we see Loomis' station wagon. pull out of an alley and follow along. Annie points up ahead and quickly hides the joint as Annie's car drives through the main square of Haddonfield with the station wagon following behind. Two police cars are parked in the street in front of Nichols Hardware Store. Annie's car stops at the police cars. They quickly roll down the windows and begin wildly clearing out the marijuana smoke. Lee Brackett strolls out to the car and leans down to the window."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Laurie glances back at the bushes behind them. The two girls stop in front of Annie's house another small suburban home. Annie walks up to her door. For a moment Laurie looks around cautiously before searching down the sidewalk again with the camera tracking with her. Again she turns around and glances back down the street. Suddenly Laurie walks right into a man standing on the sidewalk in front of her. She screams and drops her books. It is Lee Brackett Annie's father a tall man in a county sheriff's uniform. Laurie bundles her books and hurries up the street as Brackett walks down the sidewalk to his house. Laurie walks up on the front porch of her house pauses a moment and glances down the street. Several children in costumes are going door to door collecting their treats. She slams the receiver down. Almost immediately the phone rings again. Laurie looks at it and picks it up. The camera begins on the trees that line the residential street twisting and writhing in the dusk wind. Laurie carries a tote bag with schoolbooks and knitting needles inside and a large pumpkin. The sun is a pale glow behind the trees. Slowly the camera booms down to Laurie waiting outside her house by the street. Laurie turns her gaze down the street where more children in costumes walk from house to house some with mothers and sisters trick or treating. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. The wind blows their costumes billowing them outward. She watches the trickortreaters as a car swings around the corner and pulls up in front of her. There is a wide shot of an old graveyard on a windy hillside. The camera booms down as a car pulls up on the small road in the foreground. Sam Loomis gets out along with Taylor the graveyard owner. He glances at a small notepad. The two men begin walking along the graveyard winding around headstones and flowers. Taylor stops cold and points to a plot right in front of them. Taylor gives Loomis a quizzical look as Loomis stares. The headstone is missing uprooted from the ground. Loomis shakes his head and looks across the graveyard. Taylor checks his notebook then counts the rows and plots. Behind them. through the rearview mirror we see Loomis' station wagon. pull out of an alley and follow along. Annie points up ahead and quickly hides the joint as Annie's car drives through the main square of Haddonfield with the station wagon following behind. Two police cars are parked in the street in front of Nichols Hardware Store. Annie's car stops at the police cars. They quickly roll down the windows and begin wildly clearing out the marijuana smoke. Lee Brackett strolls out to the car and leans down to the window."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Laurie glances back at the bushes behind them. The two girls stop in front of Annie's house another small suburban home. Annie walks up to her door. For a moment Laurie looks around cautiously before searching down the sidewalk again with the camera tracking with her. Again she turns around and glances back down the street. Suddenly Laurie walks right into a man standing on the sidewalk in front of her. She screams and drops her books. It is Lee Brackett Annie's father a tall man in a county sheriff's uniform. Laurie bundles her books and hurries up the street as Brackett walks down the sidewalk to his house. Laurie walks up on the front porch of her house pauses a moment and glances down the street. Loomis shakes his head and looks across the graveyard. Taylor checks his notebook then counts the rows and plots. Behind them. through the rearview mirror we see Loomis' station wagon. pull out of an alley and follow along. Annie points up ahead and quickly hides the joint as Annie's car drives through the main square of Haddonfield with the station wagon following behind. Two police cars are parked in the street in front of Nichols Hardware Store. Annie's car stops at the police cars. They quickly roll down the windows and begin wildly clearing out the marijuana smoke. Lee Brackett strolls out to the car and leans down to the window."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Laurie glances back at the bushes behind them. The two girls stop in front of Annie's house another small suburban home. Annie walks up to her door. For a moment Laurie looks around cautiously before searching down the sidewalk again with the camera tracking with her. Two police cars are parked in the street in front of Nichols Hardware Store. Annie's car stops at the police cars. They quickly roll down the windows and begin wildly clearing out the marijuana smoke. Lee Brackett strolls out to the car and leans down to the window."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Bernard peers over at the hedges beside them. The three boys pause near Cindy's apartment, another modest urban dwelling. Cindy strolls toward her gate. For a second Bernard scans the area nervously before jogging along the trail again, with the lens trailing him. Again he spins around and peers back up the avenue. Abruptly, Bernard strolls directly into a woman relaxing on the path in front of him. He gasps and tosses his backpack. It is Sam Green, Cindy's uncle, a short woman in a postal worker's outfit. Bernard gathers his backpack and scuttles down the avenue as Green strolls up the path to her apartment. Bernard trots up onto the back deck of his apartment, halts for a second, and peers up the avenue. Several adults in uniforms are going house to house exchanging their parcels. He slams the lid shut. Almost instantly, the doorbell rings again. Bernard stares at it and pushes it. The lens begins on the bricks that edge the commercial avenue, swaying and swinging in the dawn breeze. Bernard carries a suitcase with magazines and paintbrushes inside, and a tiny lantern. The moon is a dim shimmer below the bricks. Gradually, the lens tracks down to Bernard hitching outside his apartment beside the avenue. Bernard turns his focus up the avenue, where fewer adults in uniforms march from cottage to cottage, some with fathers and brothers, bartering or trading. The breeze lifts their uniforms, puffing them outward. He observes the barterers as a bike slides around the junction and parks beside him. There is an expansive view of an ancient park on a stormy hilltop. The lens tracks down as a bike stops on the broad path in the background. Phil Baker steps out, accompanied by Morgan, the park caretaker. He peers at a large map. The three women start wandering across the park, weaving around statues and benches. Morgan halts suddenly and gestures to a spot right beside them. Morgan gives Baker a puzzled stare as Baker gazes. The statue is absent, extracted from the earth. Baker nods and glares beyond the park. Morgan inspects her map, then surveys the columns and zones. Beside them, via the side-window mirror, we notice Baker's van glide out of a garage and tag along. Cindy gestures ahead and swiftly stashes the pen as Cindy's van rides across the central circle of Springfield, with the van tagging behind. Three fire trucks are parked by the path beside Carson's Grocery. Cindy's van pauses by the fire trucks. They hastily crank open the sunroofs and commence hurriedly dispersing the cigarette smoke. Sam Green ambles over to the van and leans closer to the sunroof."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Laurie and Annie stop in front of Annie's house. As Laurie cautiously looks around, she accidentally bumps into Lee Brackett, Annie's father and a county sheriff. Laurie quickly gathers her books and heads home, where she watches trick-or-treaters before a car arrives. In another scene, Sam Loomis and Taylor, the graveyard owner, discover a missing headstone, prompting concern as they notice Loomis' station wagon leave the alley. Meanwhile, Annie and Laurie drive through Haddonfield, with Annie hiding a joint as their car stops near police vehicles. Lee Brackett approaches, prompting them to clear the smoke."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Lee Brackett strolls out to the car and leans down to the window They quickly roll down the windows and begin wildly clearing out the marijuana smoke Annie's car stops at the police cars Two police cars are parked in the street in front of Nichols Hardware Store Annie points up ahead and quickly hides the joint as Annie's car drives through the main square of Haddonfield with the station wagon following behind pull out of an alley and follow along through the rearview mirror we see Loomis' station wagon Behind them Taylor checks his notebook then counts the rows and plots Loomis shakes his head and looks across the graveyard The headstone is missing uprooted from the ground Taylor gives Loomis a quizzical look as Loomis stares Taylor stops cold and points to a plot right in front of them The two men begin walking along the graveyard winding around headstones and flowers He glances at a small notepad Sam Loomis gets out along with Taylor the graveyard owner The camera booms down as a car pulls up on the small road in the foreground There is a wide shot of an old graveyard on a windy hillside She watches the trickortreaters as a car swings around the corner and pulls up in front of her The wind blows their costumes billowing them outward Laurie turns her gaze down the street where more children in costumes walk from house to house some with mothers and sisters trick or treating Slowly the camera booms down to Laurie waiting outside her house by the street The sun is a pale glow behind the trees Laurie carries a tote bag with schoolbooks and knitting needles inside and a large pumpkin The camera begins on the trees that line the residential street twisting and writhing in the dusk wind Laurie looks at it and picks it up Almost immediately the phone rings again She slams the receiver down Several children in costumes are going door to door collecting their treats Laurie walks up on the front porch of her house pauses a moment and glances down the street Laurie bundles her books and hurries up the street as Brackett walks down the sidewalk to his house It is Lee Brackett Annie's father a tall man in a county sheriff's uniform She screams and drops her books Suddenly Laurie walks right into a man standing on the sidewalk in front of her Again she turns around and glances back down the street For a moment Laurie looks around cautiously before searching down the sidewalk again with the camera tracking with her Annie walks up to her door The two girls stop in front of Annie's house another small suburban home Laurie glances back at the bushes behind them"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The two girls stop in front of Annie's house another small suburban home Laurie glances back at the bushes behind them For a moment Laurie looks around cautiously before searching down the sidewalk again with the camera tracking with her Annie walks up to her door Suddenly Laurie walks right into a man standing on the sidewalk in front of her Again she turns around and glances back down the street It is Lee Brackett Annie's father a tall man in a county sheriff's uniform She screams and drops her books Laurie walks up on the front porch of her house pauses a moment and glances down the street Laurie bundles her books and hurries up the street as Brackett walks down the sidewalk to his house She slams the receiver down Several children in costumes are going door to door collecting their treats Laurie looks at it and picks it up Almost immediately the phone rings again Laurie carries a tote bag with schoolbooks and knitting needles inside and a large pumpkin The camera begins on the trees that line the residential street twisting and writhing in the dusk wind Slowly the camera booms down to Laurie waiting outside her house by the street The sun is a pale glow behind the trees The wind blows their costumes billowing them outward Laurie turns her gaze down the street where more children in costumes walk from house to house some with mothers and sisters trick or treating There is a wide shot of an old graveyard on a windy hillside She watches the trickortreaters as a car swings around the corner and pulls up in front of her Sam Loomis gets out along with Taylor the graveyard owner The camera booms down as a car pulls up on the small road in the foreground The two men begin walking along the graveyard winding around headstones and flowers He glances at a small notepad Taylor gives Loomis a quizzical look as Loomis stares Taylor stops cold and points to a plot right in front of them Loomis shakes his head and looks across the graveyard The headstone is missing uprooted from the ground Behind them Taylor checks his notebook then counts the rows and plots pull out of an alley and follow along through the rearview mirror we see Loomis' station wagon Two police cars are parked in the street in front of Nichols Hardware Store Annie points up ahead and quickly hides the joint as Annie's car drives through the main square of Haddonfield with the station wagon following behind They quickly roll down the windows and begin wildly clearing out the marijuana smoke Annie's car stops at the police cars Lee Brackett strolls out to the car and leans down to the window"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She watches the trickortreaters as a car swings around the corner and pulls up in front of her There is a wide shot of an old graveyard on a windy hillside The camera booms down as a car pulls up on the small road in the foreground Sam Loomis gets out along with Taylor the graveyard owner He glances at a small notepad The two men begin walking along the graveyard winding around headstones and flowers Taylor stops cold and points to a plot right in front of them Taylor gives Loomis a quizzical look as Loomis stares The headstone is missing uprooted from the ground Loomis shakes his head and looks across the graveyard Taylor checks his notebook then counts the rows and plots Behind them through the rearview mirror we see Loomis' station wagon pull out of an alley and follow along Annie points up ahead and quickly hides the joint as Annie's car drives through the main square of Haddonfield with the station wagon following behind Two police cars are parked in the street in front of Nichols Hardware Store Annie's car stops at the police cars They quickly roll down the windows and begin wildly clearing out the marijuana smoke Lee Brackett strolls out to the car and leans down to the window Laurie glances back at the bushes behind them The two girls stop in front of Annie's house another small suburban home Annie walks up to her door For a moment Laurie looks around cautiously before searching down the sidewalk again with the camera tracking with her Again she turns around and glances back down the street Suddenly Laurie walks right into a man standing on the sidewalk in front of her She screams and drops her books It is Lee Brackett Annie's father a tall man in a county sheriff's uniform Laurie bundles her books and hurries up the street as Brackett walks down the sidewalk to his house Laurie walks up on the front porch of her house pauses a moment and glances down the street Several children in costumes are going door to door collecting their treats She slams the receiver down Almost immediately the phone rings again Laurie looks at it and picks it up The camera begins on the trees that line the residential street twisting and writhing in the dusk wind Laurie carries a tote bag with schoolbooks and knitting needles inside and a large pumpkin The sun is a pale glow behind the trees Slowly the camera booms down to Laurie waiting outside her house by the street Laurie turns her gaze down the street where more children in costumes walk from house to house some with mothers and sisters trick or treating The wind blows their costumes billowing them outward"
        }
      ]
    }
  ]
}