{
  "ground_truth": "Brackett bends down to the object, then he steps closer to it. He slowly walks toward it and stands back up, looking at Loomis. Both men look down off screen at the animal, and Brackett gets a disgusted expression and steps away, looking back at the dead animal. They glance at each other and Brackett just looks at Loomis a moment before turning and walking out of the bedroom. Loomis walks over to the spot where the sister was sitting, turns, and glances at the window. He stops by the window, stares at the rain gutter in the broken window, and the camera slowly tracks in toward the window. Brackett draws his gun, and the two men step inside. Laurie sits with Tommy Doyle on the couch reading him a story, while Tommy, in his Halloween costume, has a big bag of candy on the floor. Tommy pulls out a stack of comic books from underneath the couch and Laurie glances through the stack. Laurie goes to answer it, picks up the receiver in the den, and Tommy rushes out of the den. Tommy dashes up to the front window and looks out as we see the man pass under a streetlight. Tommy runs to the window in the den and points, and Laurie walks over with the phone and looks. The shape moves to see inside a window of the Wallaces' house where Annie stands by the kitchen stove making popcorn. The shape stands close to the camera watching Annie make popcorn as she starts to pour the butter over the popcorn but instead pours it on herself. Annie hangs up, quickly takes off her blouse and blue jeans, and stands in the kitchen with only her panties on. She pulls a box of cornstarch out of the closet and sprinkles it out on the stains of butter. The shape moves closer to the kitchen window and knocks over a potted plant, which crashes noisily against the side of the house. Annie is startled by the crash, looks outside the window, and a hanging plant swings in the wind. The shape leans up close to the kitchen window, looking inside. From the darkness of the backyard, Lester, a large, ferocious-looking German shepherd, springs forward into the camera, snarling and barking viciously. The shape darts away from the kitchen window, the dog snapping right after him.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Brackett stoops down to the item, then he paces nearer to it. He leisurely strides toward it and stands back up, gazing at Loomis. Both men gaze down off screen at the creature, and Brackett acquires a disgusted expression and steps away, gazing back at the deceased creature. They peer at each other and Brackett just gazes at Loomis a moment before turning and strolling out of the bedroom. Loomis strolls over to the place where the sister was sitting, swivels, and peers at the window. He halts by the window, stares at the rain gutter in the shattered window, and the camera gradually tracks in toward the window. Brackett draws his firearm, and the two men step inside. Laurie sits with Tommy Doyle on the sofa reading him a tale, while Tommy, in his Halloween outfit, has a sizable sack of sweets on the floor. Tommy extracts a pile of comic books from beneath the sofa and Laurie peers through the pile. Laurie goes to answer it, picks up the handset in the den, and Tommy rushes out of the den. Tommy dashes up to the front window and gazes out as we see the man pass under a streetlight. Tommy runs to the window in the den and indicates, and Laurie strolls over with the telephone and gazes. The shape moves to see inside a window of the Wallaces' residence where Annie stands by the kitchen stove preparing popcorn. The shape stands close to the camera observing Annie prepare popcorn as she begins to pour the butter over the popcorn but instead pours it on herself. Annie hangs up, swiftly removes her blouse and blue jeans, and stands in the kitchen with only her panties on. She pulls a box of cornstarch out of the closet and sprinkles it out on the stains of butter. The shape moves nearer to the kitchen window and knocks over a potted plant, which crashes noisily against the side of the house. Annie is startled by the crash, gazes outside the window, and a hanging plant swings in the breeze. The shape leans up close to the kitchen window, gazing inside. From the obscurity of the backyard, Lester, a large, ferocious-looking German shepherd, springs forward into the camera, snarling and barking viciously. The shape darts away from the kitchen window, the canine snapping right after him."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The object is bent down to by Brackett, then it is stepped closer to by him. It is slowly walked toward by him and he stands back up, looking at Loomis. The animal is looked down at off-screen by both men, and a disgusted expression is gotten by Brackett as he steps away, looking back at the dead animal. Each other is glanced at by them and Loomis is just looked at by Brackett for a moment before the bedroom is turned and walked out of by him. The spot where the sister was sitting is walked over to by Loomis, turned to, and the window is glanced at. The window is stopped by, stared at by him, specifically the rain gutter in the broken window, and the camera is slowly tracked in toward it. The gun is drawn by Brackett, and inside is stepped by the two men. Laurie is sat with by Tommy Doyle on the couch, who is being read a story by her, while a big bag of candy is on the floor in Tommy's Halloween costume. A stack of comic books is pulled out from underneath the couch by Tommy, and the stack is glanced through by Laurie. The receiver is picked up by Laurie in the den when it is answered by her, and out of the den is rushed by Tommy. The front window is dashed up to by Tommy, and the man is seen passing under a streetlight as it is looked out by him. The window in the den is run to by Tommy and he points, and with the phone, the window is walked toward by Laurie and looked at. Inside a window of the Wallaces' house is moved to by the shape where the kitchen stove, making popcorn, is stood by Annie. The camera is stood close to by the shape watching popcorn being made by Annie as the butter is started to be poured over the popcorn but instead on herself by her. The phone is hung up by Annie, quickly her blouse and blue jeans are taken off, and only her panties are stood in the kitchen in by her. A box of cornstarch is pulled out of the closet by her and sprinkled out on the stains of butter. The kitchen window is moved closer to by the shape and a potted plant is knocked over, which crashes noisily against the side of the house. The crash startles Annie, the window is looked outside at by her, and in the wind, a hanging plant swings. The kitchen window is leaned up close to by the shape, looking inside. From the darkness of the backyard, the camera is sprung forward into by Lester, a large, ferocious-looking German Shepherd, snarling and barking viciously. Away from the kitchen window, the shape darts, snapping right after him by the dog."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Brackett bends down to the object, steps closer, then looks at Loomis. Both men glance at the animal off screen, and Brackett steps away, disgusted, then exits the bedroom. Loomis moves to where the sister sat, gazes at the window's broken rain gutter, and the camera tracks in. Brackett draws his gun, and they enter. Laurie sits with Tommy Doyle, reading a story; Tommy, in his Halloween costume, has a candy bag on the floor. He retrieves comic books from under the couch, and Laurie glances through them. Laurie answers the phone in the den as Tommy rushes out, then peers out the window to see a man pass under a streetlight. Tommy points, and Laurie looks from the den. The shape observes Annie through the Wallaces' window as she makes popcorn, accidentally pouring butter on herself. Annie removes her blouse and jeans, then uses cornstarch on the butter stains. The shape knocks over a potted plant, startling Annie. She peers outside as a hanging plant swings. The shape leans close to the window. From the backyard darkness, Lester, a large German shepherd, lunges, snarling. The shape darts away with the dog snapping."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Brackett bends toward the object, then steps closer, standing back up to look at Loomis. Both men look off-screen at the animal. Brackett appears disgusted, steps away, and they exchange glances before Brackett exits the bedroom. Loomis goes to where the sister was sitting, looks at the window, and the camera tracks in. Brackett draws his gun, and they enter. Laurie reads to Tommy Doyle on the couch, surrounded by candy and comics. Laurie answers the phone, and Tommy rushes to the window, seeing a man under a streetlight. The shape watches Annie make popcorn in the Wallaces' house, accidentally pouring butter on herself. Annie quickly removes her clothes, stands in her panties, and applies cornstarch. The shape knocks over a plant, startling Annie. Lester, a German shepherd, snarls from the darkness, chasing the shape away from the window."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Brackett crouches down slowly, getting closer to the mysterious object on the ground. He then takes a deliberate step nearer to it, slowly approaching and eventually standing upright again, directing his gaze toward Loomis. The two men focus their attention downward at something off-screen—a motionless animal—prompting Brackett to display a look of pure disgust. He instinctively retreats a little, casting another glance back at the lifeless creature. They exchange a meaningful look, a silent communication passing between them, before Brackett simply turns away, leaving the space by exiting the bedroom. Loomis, on the other hand, moves thoughtfully over to the very spot where the sister had been seated earlier, then he turns his attention toward the window. He pauses near the window, his eyes lingering on the rain gutter visible through the broken glass. As this happens, the camera begins to slowly zoom in, drawing closer to the damaged window.\n\nMeanwhile, Brackett draws his gun cautiously as he and Loomis make their way inside. In a different scene, Laurie is comfortably seated on the couch alongside Tommy Doyle, reading him an engaging story. Tommy, dressed up in his Halloween costume, has an impressively large bag of candy resting on the floor nearby. Eagerly, Tommy reaches under the couch, pulling out a stack of comic books, and Laurie takes a moment to glance through the colorful pile. Suddenly, Laurie moves to answer a ringing sound, picking up the receiver in the den, while Tommy quickly rushes out of the room. Tommy dashes toward the front window, curiously peering out just in time to see a mysterious figure passing under the glow of a streetlight. He hastily runs to the window in the den, pointing excitedly, and Laurie walks over, still holding the phone, to join him and look out.\n\nThe ominous shape moves stealthily, peering through a window of the Wallaces' house where Annie is busy in the kitchen by the stove, making popcorn. The shadowy figure stands close, intently observing as Annie goes about her task, starting to pour melted butter over the popcorn but clumsily spilling it all over herself. Annie quickly ends her call, hurriedly removing her butter-stained blouse and blue jeans, leaving herself clad only in her panties in the kitchen. She fetches a box of cornstarch from the closet and hastily sprinkles it over the greasy stains. As the shape edges closer to the kitchen window, it accidentally knocks over a potted plant, which crashes loudly against the side of the house. Startled by the sudden noise, Annie glances outside to see a hanging plant swinging in the wind. The shape leans in closer, peering ominously through the kitchen window.\n\nFrom the shadowy depths of the backyard, Lester, a large and ferocious-looking German shepherd, suddenly lunges into view, snarling and barking viciously at the intruder. The shape quickly darts away from the kitchen window, trying to escape as the aggressive dog snaps menacingly right at its heels."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Brackett, with careful and deliberate movements, crouches down slowly, inching his way closer to the enigmatic and mysterious object that lies on the ground. He then takes a measured and purposeful step nearer to it, approaching with caution until he eventually stands upright once more, turning his focused gaze toward Loomis. Both men fix their concentrated attention downward on something unseen off the edge of the screen—a still and motionless animal—that provokes a strong reaction in Brackett, leading him to display a look of sheer and utter disgust. He instinctively retreats a little, stepping back as he casts another glance at the lifeless creature. They exchange a significant and meaningful look, engaging in a silent form of communication that passes between them, before Brackett simply turns away, deciding to leave the scene by exiting the confines of the bedroom. Loomis, in contrast, moves with thoughtful intent over to the very spot where the sister had previously been seated and then redirects his attention toward the window. He pauses momentarily near the window, allowing his eyes to linger on the rain gutter that is visible through the cracked and broken glass. As this unfolds, the camera begins to gradually zoom in, drawing ever closer to the damaged window.\n\nMeanwhile, Brackett draws his gun with caution as he, along with Loomis, carefully makes his way inside. In a separate scene altogether, Laurie is seated comfortably on the couch alongside young Tommy Doyle, reading to him an engaging and captivating story. Tommy, dressed up in his vibrant Halloween costume, has an impressively large and bulging bag of candy resting on the floor close by. Eagerly, Tommy reaches under the couch, retrieving a stack of comic books, and Laurie takes a brief moment to glance through the colorful and eye-catching pile. Suddenly, Laurie moves to answer a ringing sound, picking up the receiver in the den as Tommy quickly and excitedly rushes out of the room. Tommy dashes eagerly toward the front window, peering out with curiosity just in time to witness a mysterious figure passing beneath the dim glow of a streetlight. He hastily runs to the window in the den, pointing with excitement, and Laurie walks over, still holding the phone, to join him and look out.\n\nThe ominous shape, moving stealthily, peers intently through a window of the Wallaces' house where Annie is occupied in the kitchen by the stove, busily making popcorn. The shadowy figure stands near, watching closely as Annie goes about her task, beginning to pour melted butter over the popcorn but clumsily spilling it all over herself in the process. Annie quickly concludes her call, hurriedly removing her butter-stained blouse and blue jeans, leaving herself clad in just her panties in the kitchen. She obtains a box of cornstarch from the closet and hastily sprinkles it over the greasy stains. As the shape edges nearer to the kitchen window, it accidentally knocks over a potted plant, which crashes loudly against the side of the house. Startled by the sudden noise, Annie glances outside to see a hanging plant swinging in the wind. The shape leans in closer, peering ominously through the kitchen window.\n\nFrom the shadowy and dark depths of the backyard, Lester, a large and ferocious-looking German shepherd, suddenly lunges into view, snarling and barking with vigor at the intruder. The shape quickly darts away from the kitchen window, attempting to make a swift escape as the aggressive dog snaps menacingly right at its heels."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Brackett carefully bends down to examine the object before him, shifting his position to step closer and scrutinize it more thoroughly. He begins to walk slowly toward it with deliberate steps, eventually standing back upright, directing his gaze toward Loomis. Both men then simultaneously lower their eyes offscreen to take in the sight of the animal lying there, prompting Brackett to form a disgusted expression as he takes a step back, unable to look away from the deceased creature. They cast brief glances at one another, and Brackett fixes his eyes on Loomis for a moment before decisively turning his back and exiting the bedroom. Meanwhile, Loomis approaches the spot where the sister had been seated, pivots, and lets his eyes fall upon the window. He comes to a halt by the window and focuses intently on the rain gutter adorning the broken window, as the camera gradually zooms in on the window, emphasizing its importance in the scene. In another location, Brackett draws his firearm, and with a sense of caution, both men proceed to enter an interior space. Concurrently, Laurie is seated comfortably on the couch alongside Tommy Doyle, engrossed in narrating a story to him, while Tommy, adorned in his Halloween costume, has a sizable bag of candy resting on the floor beside him. With a burst of excitement, Tommy retrieves a stack of comic books hidden beneath the couch, and Laurie takes a moment to glance through the collection. Hearing a noise, Laurie rises to address it, making her way to the den, where she picks up the phone receiver. As she does, Tommy excitedly dashes out of the den, running to the front window and peering outside just as a figure passes under a streetlight, casting an ominous presence. Tommy quickly moves to the window in the den, pointing animatedly, prompting Laurie to approach with the phone in hand to see for herself. The enigmatic shape shifts its attention to peer through the window of the Wallaces' house, where Annie stands by the kitchen stove preoccupied with making popcorn. The shape stands eerily close to the camera, fixated on Annie as she begins to pour butter over the popcorn, only to accidentally drench herself instead. Reacting swiftly, Annie hangs up the phone and hurriedly strips off her butter-stained blouse and blue jeans, leaving her clad only in her panties in the kitchen. She reaches into the closet, pulls out a box of cornstarch, and hastily sprinkles it over the butter stains. As the shape ominously nears the kitchen window, it accidentally knocks over a potted plant, which crashes loudly against the side of the house, causing Annie to jump in surprise and glance out the window to see a hanging plant swaying in the wind. The shape leans closer to the kitchen window, peering inside with unsettling intent. From the shadows of the backyard, Lester, a formidable German shepherd with a menacing demeanor, suddenly leaps forward, snarling and barking fiercely at the intruder. Startled by the dog's aggressive display, the shape quickly retreats from the kitchen window, with Lester snapping ferociously in pursuit."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Brackett bends down to inspect the object and then stands up, exchanging a glance with Loomis. Both men react with disgust to the sight of the dead animal before exchanging another look, after which Brackett exits the bedroom. Loomis moves to where the sister was sitting, observing both the room and the broken window. Brackett draws his gun as they both step inside. Meanwhile, Laurie reads a story to Tommy Doyle on the couch, surrounded by Tommy's Halloween costume and candy. As Tommy retrieves his comic books from under the couch for Laurie to glance through, the phone rings. Laurie answers in the den while Tommy rushes to the front window, watching a man pass under a streetlight. He points excitedly, prompting Laurie to look with him. The figure, meanwhile, observes Annie through a window as she makes popcorn in the Wallaces' kitchen, accidentally pouring butter on herself. Annie, startled, removes her blouse and jeans, covering the butter stains with cornstarch. The figure knocks over a potted plant, causing a noisy crash that startles Annie. As she checks outside, the shape leans closer to the window, only to be chased away by Lester, a large German shepherd, who barks and snarls viciously."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Brackett, the town sheriff, bends down to the object, then he steps closer to it. He slowly walks toward it and stands back up, looking at Loomis, a psychiatrist who has been pursuing a dangerous escaped patient. Both men look down off screen at the animal, a deceased dog that might be connected to their investigation, and Brackett gets a disgusted expression and steps away, looking back at the dead animal. They glance at each other, and Brackett just looks at Loomis a moment before turning and walking out of the bedroom in the old Myers house, a site notorious in the town's dark lore. Loomis walks over to the spot where the sister, a previous victim of the patient, was sitting, turns, and glances at the window. He stops by the window, stares at the rain gutter in the broken window, recalling its state from the night of the infamous murder, and the camera slowly tracks in toward the window. Brackett draws his gun, and the two men step inside the decrepit house once again. Laurie, a high school student spending the night babysitting, sits with Tommy Doyle on the couch reading him a story, while Tommy, in his Halloween costume as a pirate, has a big bag of candy on the floor. Tommy pulls out a stack of comic books from underneath the couch, a collection mainly of horror and superhero genres, and Laurie glances through the stack. Laurie goes to answer it, picks up the receiver in the den, and Tommy rushes out of the den. Tommy dashes up to the front window and looks out as we see the man, the elusive patient, pass under a streetlight. Tommy runs to the window in the den and points, and Laurie walks over with the phone and looks. The shape, a moniker for the patient in disguise, moves to see inside a window of the Wallaces' house where Annie stands by the kitchen stove making popcorn. The shape stands close to the camera watching Annie make popcorn as she starts to pour the butter over the popcorn but instead pours it on herself. Annie hangs up, quickly takes off her blouse and blue jeans, and stands in the kitchen with only her panties on, aware of the stain's discomfort. She pulls a box of cornstarch out of the closet, an old trick for absorbing grease, and sprinkles it out on the stains of butter. The shape moves closer to the kitchen window and knocks over a potted plant, which crashes noisily against the side of the house. Annie is startled by the crash, looks outside the window, and a hanging plant swings in the wind that has picked up as night falls. The shape leans up close to the kitchen window, looking inside. From the darkness of the backyard, Lester, a large, ferocious-looking German shepherd providing unexpected security for the night, springs forward into the camera, snarling and barking viciously. The shape darts away from the kitchen window, the dog snapping right after him, adding tension to the already eerie atmosphere."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Brackett bends down to the object then he steps closer to it. He slowly walks toward it and stands back up looking at Loomis. Both men look down off screen at the animal and Brackett gets a disgusted expression and steps away looking back at the dead animal. They glance at each other and Brackett just looks at Loomis a moment before turning and walking out of the bedroom. Loomis walks over to the spot where the sister was sitting turns and glances at the window. He stops by the window stares at the rain gutter in the broken window and the camera slowly tracks in toward the window. Brackett draws his gun and the two men step inside. Laurie sits with Tommy Doyle on the couch reading him a story while Tommy in his Halloween costume has a big bag of candy on the floor. Tommy pulls out a stack of comic books from underneath the couch and Laurie glances through the stack. Laurie goes to answer it picks up the receiver in the den and Tommy rushes out of the den. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Tommy dashes up to the front window and looks out as we see the man pass under a streetlight. Tommy runs to the window in the den and points and Laurie walks over with the phone and looks. The shape moves to see inside a window of the Wallaces' house where Annie stands by the kitchen stove making popcorn. The shape stands close to the camera watching Annie make popcorn as she starts to pour the butter over the popcorn but instead pours it on herself. Annie hangs up quickly takes off her blouse and blue jeans and stands in the kitchen with only her panties on. She pulls a box of cornstarch out of the closet and sprinkles it out on the stains of butter. The shape moves closer to the kitchen window and knocks over a potted plant which crashes noisily against the side of the house. Annie is startled by the crash looks outside the window and a hanging plant swings in the wind. The shape leans up close to the kitchen window looking inside. From the darkness of the backyard Lester a large ferociouslooking German shepherd springs forward into the camera snarling and barking viciously. The shape darts away from the kitchen window the dog snapping right after him."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Brackett bends down to the object then he steps closer to it. He slowly walks toward it and stands back up looking at Loomis. Both men look down off screen at the animal and Brackett gets a disgusted expression and steps away looking back at the dead animal. They glance at each other and Brackett just looks at Loomis a moment before turning and walking out of the bedroom. Loomis walks over to the spot where the sister was sitting turns and glances at the window. He stops by the window stares at the rain gutter in the broken window and the camera slowly tracks in toward the window. Brackett draws his gun and the two men step inside. Laurie sits with Tommy Doyle on the couch reading him a story while Tommy in his Halloween costume has a big bag of candy on the floor. Tommy pulls out a stack of comic books from underneath the couch and Laurie glances through the stack. Laurie goes to answer it picks up the receiver in the den and Tommy rushes out of the den. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Tommy dashes up to the front window and looks out as we see the man pass under a streetlight. Tommy runs to the window in the den and points and Laurie walks over with the phone and looks. The shape moves to see inside a window of the Wallaces' house where Annie stands by the kitchen stove making popcorn. The shape stands close to the camera watching Annie make popcorn as she starts to pour the butter over the popcorn but instead pours it on herself. Annie hangs up quickly takes off her blouse and blue jeans and stands in the kitchen with only her panties on. She pulls a box of cornstarch out of the closet and sprinkles it out on the stains of butter. The shape moves closer to the kitchen window and knocks over a potted plant which crashes noisily against the side of the house. Annie is startled by the crash looks outside the window and a hanging plant swings in the wind. The shape leans up close to the kitchen window looking inside. From the darkness of the backyard Lester a large ferociouslooking German shepherd springs forward into the camera snarling and barking viciously. The shape darts away from the kitchen window the dog snapping right after him."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Brackett bends down to the object then he steps closer to it. He slowly walks toward it and stands back up looking at Loomis. Both men look down off screen at the animal and Brackett gets a disgusted expression and steps away looking back at the dead animal. They glance at each other and Brackett just looks at Loomis a moment before turning and walking out of the bedroom. Loomis walks over to the spot where the sister was sitting turns and glances at the window. She pulls a box of cornstarch out of the closet and sprinkles it out on the stains of butter. The shape moves closer to the kitchen window and knocks over a potted plant which crashes noisily against the side of the house. Annie is startled by the crash looks outside the window and a hanging plant swings in the wind. The shape leans up close to the kitchen window looking inside. From the darkness of the backyard Lester a large ferociouslooking German shepherd springs forward into the camera snarling and barking viciously. The shape darts away from the kitchen window the dog snapping right after him."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Brackett bends down to the object then he steps closer to it. He slowly walks toward it and stands back up looking at Loomis. The shape leans up close to the kitchen window looking inside. From the darkness of the backyard Lester a large ferociouslooking German shepherd springs forward into the camera snarling and barking viciously. The shape darts away from the kitchen window the dog snapping right after him."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Nebula crouches beside the feather, then she hops away from it. She quickly dances toward it and kneels back down, gazing at Stardust. Both women peer up off screen at the painting, and Nebula gets a delighted expression and hops closer, gazing back at the colorful painting. They smirk at each other and Nebula just gazes at Stardust for a moment before twirling and galloping out of the attic. Stardust skips over to the site where the elephant was flying, spins, and peers at the mirror. She halts by the mirror, gazes at the chandelier in the shattered mirror, and the lens slowly zooms out from the mirror. Nebula strums her lute, and the two women leap outside. Celeste lounges with Benny Bear on the hammock singing him a song, while Benny, in his jester outfit, has a tiny pile of pebbles on the shelf. Benny retrieves a bundle of greeting cards from behind the hammock and Celeste peers through the bundle. Celeste goes to water it, picks up the vase in the garden, and Benny skips out of the garden. Benny prances up to the garage door and peers out as we see the unicorn prance over a lamppost. Benny hops to the door in the garden and gestures, and Celeste skips over with the watering can and peers. The silhouette slides to spy through a doorway of the Bakers' home where Maggie stands by the dining table flipping pancakes. The silhouette stands far from the lens observing Maggie flip pancakes as she begins to drizzle the syrup over the pancakes but instead drizzles it on herself. Maggie hangs up, quickly steps out of her robe and pink slippers, and stands in the dining room with only her apron on. She retrieves a bag of flour out of the cabinet and scatters it over the puddles of syrup. The silhouette drifts nearer to the dining room door and tips over a ceramic vase, which crashes noisily against the corner of the house. Maggie is startled by the noise, peers outside the door, and a swinging lantern sways in the breeze. The silhouette peers far from the dining room door, observing inside. From the brightness of the lawn, Ginger, a tiny, adorable-looking Chinchilla, flutters backward into the lens, chirping and whistling melodiously. The silhouette floats away from the dining room door, the chinchilla cooing closely behind her."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Brackett and Loomis examine a dead animal, exchanging a look of disgust, before Brackett exits the bedroom. Loomis inspects the window, focusing on the rain gutter, as the camera zooms in. Brackett draws his gun and enters with Loomis. Meanwhile, Laurie sits with Tommy Doyle, who is in a Halloween costume, reading him a story. Tommy spots a man under a streetlight and alerts Laurie. The man, known as the shape, watches Annie making popcorn in the Wallaces' kitchen. She accidentally spills butter on herself, removes her clothes, and applies cornstarch to the stains. A crash from a potted plant startles her, and she checks outside. The shape peers inside, but a barking German shepherd chases him away from the window."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The shape darts away from the kitchen window the dog snapping right after him From the darkness of the backyard Lester a large ferociouslooking German shepherd springs forward into the camera snarling and barking viciously The shape leans up close to the kitchen window looking inside Annie is startled by the crash looks outside the window and a hanging plant swings in the wind The shape moves closer to the kitchen window and knocks over a potted plant which crashes noisily against the side of the house She pulls a box of cornstarch out of the closet and sprinkles it out on the stains of butter Annie hangs up quickly takes off her blouse and blue jeans and stands in the kitchen with only her panties on The shape stands close to the camera watching Annie make popcorn as she starts to pour the butter over the popcorn but instead pours it on herself The shape moves to see inside a window of the Wallaces' house where Annie stands by the kitchen stove making popcorn Tommy runs to the window in the den and points and Laurie walks over with the phone and looks Tommy dashes up to the front window and looks out as we see the man pass under a streetlight Laurie goes to answer it picks up the receiver in the den and Tommy rushes out of the den Tommy pulls out a stack of comic books from underneath the couch and Laurie glances through the stack Laurie sits with Tommy Doyle on the couch reading him a story while Tommy in his Halloween costume has a big bag of candy on the floor Brackett draws his gun and the two men step inside He stops by the window stares at the rain gutter in the broken window and the camera slowly tracks in toward the window Loomis walks over to the spot where the sister was sitting turns and glances at the window They glance at each other and Brackett just looks at Loomis a moment before turning and walking out of the bedroom Both men look down off screen at the animal and Brackett gets a disgusted expression and steps away looking back at the dead animal He slowly walks toward it and stands back up looking at Loomis Brackett bends down to the object then he steps closer to it"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He slowly walks toward it and stands back up looking at Loomis Brackett bends down to the object then he steps closer to it They glance at each other and Brackett just looks at Loomis a moment before turning and walking out of the bedroom Both men look down off screen at the animal and Brackett gets a disgusted expression and steps away looking back at the dead animal He stops by the window stares at the rain gutter in the broken window and the camera slowly tracks in toward the window Loomis walks over to the spot where the sister was sitting turns and glances at the window Laurie sits with Tommy Doyle on the couch reading him a story while Tommy in his Halloween costume has a big bag of candy on the floor Brackett draws his gun and the two men step inside Laurie goes to answer it picks up the receiver in the den and Tommy rushes out of the den Tommy pulls out a stack of comic books from underneath the couch and Laurie glances through the stack Tommy runs to the window in the den and points and Laurie walks over with the phone and looks Tommy dashes up to the front window and looks out as we see the man pass under a streetlight The shape stands close to the camera watching Annie make popcorn as she starts to pour the butter over the popcorn but instead pours it on herself The shape moves to see inside a window of the Wallaces' house where Annie stands by the kitchen stove making popcorn She pulls a box of cornstarch out of the closet and sprinkles it out on the stains of butter Annie hangs up quickly takes off her blouse and blue jeans and stands in the kitchen with only her panties on Annie is startled by the crash looks outside the window and a hanging plant swings in the wind The shape moves closer to the kitchen window and knocks over a potted plant which crashes noisily against the side of the house From the darkness of the backyard Lester a large ferociouslooking German shepherd springs forward into the camera snarling and barking viciously The shape leans up close to the kitchen window looking inside The shape darts away from the kitchen window the dog snapping right after him"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Tommy runs to the window in the den and points and Laurie walks over with the phone and looks The shape moves to see inside a window of the Wallaces' house where Annie stands by the kitchen stove making popcorn The shape stands close to the camera watching Annie make popcorn as she starts to pour the butter over the popcorn but instead pours it on herself Annie hangs up quickly takes off her blouse and blue jeans and stands in the kitchen with only her panties on She pulls a box of cornstarch out of the closet and sprinkles it out on the stains of butter The shape moves closer to the kitchen window and knocks over a potted plant which crashes noisily against the side of the house Annie is startled by the crash looks outside the window and a hanging plant swings in the wind The shape leans up close to the kitchen window looking inside From the darkness of the backyard Lester a large ferociouslooking German shepherd springs forward into the camera snarling and barking viciously The shape darts away from the kitchen window the dog snapping right after him Brackett bends down to the object then he steps closer to it He slowly walks toward it and stands back up looking at Loomis Both men look down off screen at the animal and Brackett gets a disgusted expression and steps away looking back at the dead animal They glance at each other and Brackett just looks at Loomis a moment before turning and walking out of the bedroom Loomis walks over to the spot where the sister was sitting turns and glances at the window He stops by the window stares at the rain gutter in the broken window and the camera slowly tracks in toward the window Brackett draws his gun and the two men step inside Laurie sits with Tommy Doyle on the couch reading him a story while Tommy in his Halloween costume has a big bag of candy on the floor Tommy pulls out a stack of comic books from underneath the couch and Laurie glances through the stack Laurie goes to answer it picks up the receiver in the den and Tommy rushes out of the den Tommy dashes up to the front window and looks out as we see the man pass under a streetlight"
        }
      ]
    }
  ]
}