{
  "ground_truth": "Annie listens to the growling of the dog and turns to Lindsey in the living room. We see the shape's legs a few feet from the house, next to Lester's legs, kicking and struggling a few feet above the ground; off screen, the shape is strangling the dog in mid-air. Finally, the dog's legs stop moving and dangle lifelessly. Laurie and Tommy are sitting on the couch watching the Horror-thon on TV. Laurie holds out her hand, and Tommy takes it, and together they walk into the kitchen. Annie walks through the passageway to the laundry room, wearing a nylon robe and carrying her clothes to be washed. The wind blows the robe open as the door creaks open, and Annie walks into the dark laundry room. In the light from the main house, Annie sees the light switch. Almost immediately, the wind blows the door shut. Annie stands motionless for a moment, then begins looking for the light switch and turns toward the slightly open door. Behind the door, we see the outline of the shape standing there. The wind blows the door open a little wider, and she glances outside the door. She steps back inside and crosses to the washing machine, opens the top, and dumps her clothes inside. Suddenly, a big gust of wind comes through the opened window above her, and the door slams shut. Annie hurries to the door and tries to open it, but she is unsuccessful and tries to pull the door open. Meanwhile, Lindsey Wallace, 8 years old with a pretty face, watches the Horror Marathon at top volume on TV and lets the phone ring away. Annie turns and glances at the window above the washing machine, where we see the shape looking in, but then the shape is gone. She quickly crosses to the washing machine, climbs up on top of it, and starts out the window, but halfway through she gets stuck. Lindsey finally gets up and walks to the phone, her eyes pivoted on the TV. Lindsey pulls on Annie's legs, and she slides from the window onto the dryer. As Annie and Lindsey walk back into the house, the phone rings, and from the house, Annie hears the phone ring. Lindsey races across the room and picks it up, then sets down the receiver and walks out of the kitchen. Annie gives Lindsey a dirty look and picks it up. Suddenly, behind Annie, the shape walks through the hallway between the living room and the kitchen. Annie then walks into the living room.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Annie heeds to the snarling of the canine and pivots to Lindsey in the residing chamber. We perceive the figure's limbs a few yards from the residence, adjacent to Lester's limbs, thrashing and writhing a few yards above the earth; off screen, the figure is throttling the canine in mid-air. Finally, the canine's limbs cease moving and hang lifelessly. Laurie and Tommy are seated on the settee observing the Horror-thon on TV. Laurie extends out her hand, and Tommy grasps it, and jointly they stroll into the culinary area. Annie strolls through the corridor to the laundry chamber, wearing a nylon gown and bearing her garments to be laundered. The breeze blows the gown open as the portal squeaks open, and Annie strolls into the dim laundry chamber. In the illumination from the main residence, Annie perceives the light switch. Almost instantly, the breeze blows the portal shut. Annie stands still for a moment, then commences searching for the light switch and pivots toward the slightly ajar portal. Behind the portal, we perceive the silhouette of the figure standing there. The breeze blows the portal open a little broader, and she peeks outside the portal. She steps rearward inside and crosses to the washing apparatus, opens the top, and deposits her garments inside. Abruptly, a large gust of wind arrives through the opened casement above her, and the portal bangs shut. Annie hastens to the portal and attempts to open it, but she is unsuccessful and endeavors to pull the portal open. Meanwhile, Lindsey Wallace, 8 years of age with an attractive countenance, observes the Horror Marathon at top intensity on TV and lets the telephone chime away. Annie pivots and peeks at the casement above the washing apparatus, where we perceive the figure gazing in, but then the figure is absent. She swiftly crosses to the washing apparatus, ascends up on top of it, and starts out the casement, but midway through she becomes wedged. Lindsey finally rises and ambles to the telephone, her eyes riveted on the TV. Lindsey pulls on Annie's limbs, and she slides from the casement onto the dryer. As Annie and Lindsey stroll back into the residence, the telephone chimes, and from the residence, Annie hears the telephone chime. Lindsey races across the chamber and picks it up, then sets down the handset and strolls out of the culinary area. Annie gives Lindsey a dirty glance and picks it up. Abruptly, behind Annie, the figure strolls through the corridor between the residing chamber and the culinary area. Annie then strolls into the residing chamber."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The growling of the dog is listened to by Annie, and Lindsey is turned to by her in the living room. The legs of the shape are seen by us a few feet from the house, next to Lester's legs, which kick and struggle a few feet above the ground; offscreen, the dog is strangled by the shape in mid-air. Finally, the dog's legs are stopped from moving and dangle lifelessly. The couch is sat on by Laurie and Tommy while they watch the Horror-thon on TV. Laurie's hand is held out, and it is taken by Tommy, and together the kitchen is walked into by them. The passageway to the laundry room is walked through by Annie, wearing a nylon robe and carrying her clothes to be washed. The robe is blown open by the wind as the door is opened by a creak, and the dark laundry room is walked into by Annie. In the light from the main house, the light switch is seen by Annie. Almost immediately, the door is blown shut by the wind. A moment is spent motionless by Annie, then the light switch is looked for by her as she turns toward the slightly open door. Behind the door, the outline of the shape is seen by us standing there. A little wider, the door is blown open by the wind, and the outside of the door is glanced at by her. Inside is stepped back by her and the washing machine is crossed to, the top is opened, and her clothes are dumped inside. Suddenly, through the opened window above her, a big gust of wind comes, and the door is slammed shut. The door is hurried to by Annie, and it is tried to be opened by her, but the door is unsuccessfully pulled open by her. Meanwhile, the Horror Marathon is watched at top volume on TV by Lindsey Wallace, 8 years old with a pretty face, and the phone is let ring by her. Annie turns and glances at the window above the washing machine, where the shape is seen looking in, but then the shape is gone. The washing machine is quickly crossed to by her, she climbs up on top of it, and out the window is started by her, but halfway through she gets stuck. Finally, Lindsey gets up and walks to the phone, her eyes pivoted on the TV. On Annie's legs, Lindsey pulls, and she is slid from the window onto the dryer. Back into the house is walked by Annie and Lindsey, and the phone rings, and from the house, the phone is heard ring by Annie. Lindsey races across the room, picks it up, sets down the receiver, and walks out of the kitchen. A dirty look is given to Lindsey by Annie, and it is picked up by her. Suddenly, behind Annie, the hallway between the living room and the kitchen is walked through by the shape. The living room is then walked into by Annie."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Annie hears the dog growling and turns to Lindsey in the living room. The shape's legs are near the house, strangling the dog off-screen. The dog's legs stop moving and hang lifelessly. Laurie and Tommy sit on the couch watching a Horror-thon on TV. Laurie extends her hand, and Tommy takes it as they walk into the kitchen. Annie, in a nylon robe, carries her clothes to the laundry room. The wind blows her robe open as she enters the dark room. In the light from the main house, she sees the light switch, but the wind shuts the door. Annie pauses, searches for the switch, and turns toward the slightly open door, seeing the shape's outline. The wind opens the door wider, and she looks outside before returning to the washing machine. A gust slams the door shut. Annie tries to open it but fails. Meanwhile, 8-year-old Lindsey Wallace watches the Horror Marathon on TV, ignoring the ringing phone. Annie glances at the window above the washing machine, sees the shape, but it vanishes. She climbs onto the washing machine to escape through the window but gets stuck. Lindsey finally answers the phone, eyes on the TV, and helps Annie slide onto the dryer. As they return inside, the phone rings. Lindsey answers it, sets it down, and leaves the kitchen. Annie gives her a look and picks up the phone. Suddenly, the shape walks through the hallway between the living room and kitchen as Annie enters the living room."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Annie hears the dog growling and turns to Lindsey in the living room. Outside, the shape strangles the dog mid-air, and its legs stop moving. Laurie and Tommy watch TV, then walk to the kitchen hand in hand. Annie, in a nylon robe, heads to the laundry room with clothes. The wind blows the robe as she enters the dark room, sees the light switch, but the wind shuts the door. She searches for the switch, notices the shape behind the door, and dumps her clothes in the washer. A gust slams the door shut. Annie struggles to open it. Meanwhile, Lindsey, 8, watches TV loudly, ignoring the ringing phone. Annie sees the shape at the window, but it vanishes. She climbs the washer to escape but gets stuck. Lindsey finally answers the phone, then helps Annie down. As they return inside, the phone rings again. Lindsey answers, then leaves. Annie picks up the phone, unaware the shape is nearby. She walks into the living room."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Annie attentively listens to the ominous growling of the dog and instinctively turns her gaze toward Lindsey, who is comfortably situated in the living room. We catch a glimpse of the shape's legs positioned just a few feet away from the house, ominously close to Lester's legs, which are seen kicking and struggling a few feet above the ground. Off screen, the shape is in the process of strangling the dog in mid-air. Eventually, the dog's legs cease their movement and hang lifelessly, devoid of any motion. Meanwhile, Laurie and Tommy are seated on the couch, engrossed in watching the Horror-thon on the television. Laurie extends her hand, and Tommy takes it, and together they make their way into the kitchen. Annie, clad in a nylon robe and carrying her clothes to be washed, walks through the passageway leading to the laundry room. The wind catches the robe, causing it to flutter open as the door creaks open, and Annie steps into the dimly lit laundry room. In the faint light emanating from the main house, Annie spots the light switch. Almost immediately, the wind blows the door shut with a sudden force. Annie stands still for a brief moment, then begins searching for the light switch and turns her attention toward the slightly ajar door. Behind the door, the outline of the shape is visible, standing there menacingly. The wind blows the door open a little wider, prompting her to glance outside. She steps back inside and crosses over to the washing machine, opens the top, and deposits her clothes inside. Suddenly, a strong gust of wind rushes through the open window above her, causing the door to slam shut with a loud bang. Annie hurries to the door, attempting to open it, but her efforts are in vain as she struggles to pull the door open. Meanwhile, Lindsey Wallace, an 8-year-old with a pretty face, is absorbed in watching the Horror Marathon on the TV at top volume, allowing the phone to ring incessantly. Annie turns and glances at the window above the washing machine, where the shape is momentarily visible, peering in, but then it vanishes. She quickly moves to the washing machine, climbs up on top of it, and begins to make her way out the window, but halfway through, she becomes stuck. Lindsey finally rises from her seat and walks over to the phone, her eyes still glued to the TV screen. Lindsey tugs on Annie's legs, helping her slide from the window onto the dryer. As Annie and Lindsey make their way back into the house, the phone rings again, and from inside the house, Annie hears the persistent ringing. Lindsey dashes across the room, picks up the phone, then sets down the receiver and walks out of the kitchen. Annie shoots Lindsey a disapproving look and picks up the phone. Suddenly, behind Annie, the shape silently moves through the hallway that connects the living room and the kitchen. Annie then proceeds to walk into the living room."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Annie, with a heightened sense of awareness, listens carefully to the menacing growling sound coming from the dog, and almost by instinct, she turns her gaze to where Lindsey is comfortably settled in the living room. From our vantage point, we manage to catch a brief glimpse of the legs belonging to the shape, positioned just a mere few feet from the house, alarmingly close to Lester's legs, which are seen kicking and struggling a short distance above the ground. Off screen, the shape is engaged in the act of strangling the dog in mid-air. Eventually, the dog's legs lose all movement, hanging lifelessly without any sign of motion. Meanwhile, Laurie and Tommy are seated on the couch, deeply engrossed in watching the Horror-thon playing on the television. Laurie reaches out her hand, and Tommy takes it, and together they make their way toward the kitchen. Annie, dressed in nothing but a nylon robe and carrying her laundry, walks along the passageway that leads to the laundry room. A gust of wind catches her robe, causing it to flutter open as she steps through the creaking door into the dimly illuminated laundry room. In the faint glow coming from the main house, Annie manages to spot the light switch. Almost immediately, a sudden gust blows the door shut with unexpected force. Annie pauses momentarily, then begins searching for the light switch again and turns her attention to the slightly ajar door. Behind this door, she can clearly see the menacing outline of the shape standing there. As the wind blows the door open a little wider, she glances outside briefly. She steps back inside, crossing over to the washing machine, where she opens the top and deposits her clothes inside. Suddenly, a powerful gust of wind comes rushing in through the open window above her, causing the door to slam shut with a loud and startling bang. Annie hurries to the door, trying desperately to open it, but all her attempts are in vain as she struggles to pull the door open. Meanwhile, Lindsey Wallace, a pretty-faced 8-year-old, is deeply absorbed in watching the Horror Marathon playing on the TV at a deafening volume, allowing the phone to ring incessantly without a care. Annie turns her attention to the window above the washing machine, where, for a brief moment, the shape is visible, peering in before it vanishes again. She quickly moves toward the washing machine, climbs up on top of it, and begins attempting to make her way out the window, but halfway through, she becomes hopelessly stuck. Lindsey finally rises from her spot and walks over to the phone, her eyes remaining glued to the TV screen. Lindsey tugs on Annie's legs, helping her slide from the window onto the dryer. As Annie and Lindsey head back into the house, the phone rings yet again, and from inside, Annie hears the persistent and unmistakable ringing. Lindsey dashes across the room, picks up the phone with haste, then sets down the receiver casually and walks out of the kitchen. Annie gives Lindsey a disapproving look before picking up the phone herself. Suddenly, behind Annie, the shape moves silently and stealthily through the hallway connecting the living room and the kitchen. Annie then proceeds to walk into the living room."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Annie stands still, her ears attuned to the ominous growling of the dog, prompting her to turn her attention toward Lindsey, who is situated in the living room. Meanwhile, outside, the shape's legs are visible just a few feet from the house, positioned next to Lester's legs, which are kicking and struggling a few feet above the ground as the shape, unseen, strangles the dog in mid-air. Gradually, the dog's legs cease their movement and hang lifelessly. Inside, Laurie and Tommy are comfortably seated on the couch, engrossed in watching the Horror-thon on TV. Laurie extends her hand toward Tommy, who takes it, and together they rise from the couch and make their way into the kitchen. Annie, clad in a nylon robe and carrying her laundry, moves through the passageway leading to the laundry room. As she approaches, the wind catches her robe, causing it to flutter open, while the door creaks open, allowing her to step into the dimly lit laundry room. The faint illumination from the main house reveals the location of the light switch to Annie. Just as she notices it, the wind abruptly blows the door shut, leaving her momentarily motionless. She then begins to search for the light switch, turning her attention toward the slightly ajar door. Behind this door, the outline of the shape is discernible. The wind nudges the door open a bit wider, prompting Annie to glance outside before retreating back inside. She crosses over to the washing machine, opens the lid, and deposits her clothes inside. Suddenly, a strong gust of wind rushes through the open window above her, causing the door to slam shut with force. Annie quickly moves to the door, attempting to open it, but her efforts prove futile as she struggles to pull it open. Meanwhile, Lindsey Wallace, an 8-year-old with a pretty face, is absorbed in the Horror Marathon on TV, the volume turned up high, as she lets the phone continue ringing. Annie turns her gaze toward the window above the washing machine, catching sight of the shape peering in, only for it to vanish moments later. In haste, she crosses back to the washing machine, climbs atop it, and begins to maneuver herself out the window, only to find herself stuck halfway through. Finally, Lindsey rises from her spot, her eyes still glued to the TV, and makes her way to the phone. She tugs on Annie's legs, helping her slide from the window onto the dryer. As Annie and Lindsey re-enter the house, the phone rings once more, and Annie hears it from inside. Lindsey dashes across the room, picks up the phone, sets down the receiver, and exits the kitchen. Annie shoots Lindsey a disapproving look before picking up the phone herself. Suddenly, behind Annie, the shape silently traverses the hallway that connects the living room and the kitchen. Annie then proceeds to walk into the living room."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Annie hears the dog growling and turns to Lindsey in the living room, while outside, the shape strangles the dog until it stops moving. Inside, Laurie and Tommy sit on the couch watching a Horror-thon on TV. Laurie extends her hand to Tommy, and they walk together into the kitchen. Meanwhile, Annie, wearing a nylon robe, heads to the laundry room with her clothes. As she enters the dark room, the wind blows her robe open and the door creaks shut. She pauses, then searches for the light switch, noticing the shape's outline behind the slightly open door. The wind blows the door wider, and she glances outside before proceeding to the washing machine to dump her clothes. A gust of wind slams the door shut, trapping her inside. Annie struggles to open it, while Lindsey, engrossed in the Horror Marathon, ignores the ringing phone. Annie notices the shape at the window, but it quickly disappears. She climbs onto the washing machine to escape through the window but gets stuck. Lindsey finally answers the phone, then helps Annie slide back inside. As they return to the house, the phone rings again. Lindsey picks it up and leaves the kitchen, prompting Annie to give her a dirty look before answering. Meanwhile, the shape moves through the hallway between the living room and the kitchen as Annie enters the living room."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Annie listens to the growling of the dog, a large hound known in the neighborhood for its fierce loyalty, and turns to Lindsey in the living room. We see the shape's legs, obscured in the shadows but menacing in their presence, a few feet from the house, next to Lester's legs, kicking and struggling a few feet above the ground; off screen, the shape is strangling the dog in mid-air, a terrifying act of strength. Finally, the dog's legs stop moving and dangle lifelessly, a sight that mirrors the suspenseful atmosphere of a horror film. Laurie and Tommy are sitting on the couch watching the Horror-thon on TV, an annual event known for showcasing classic horror movies. Laurie holds out her hand, and Tommy takes it, and together they walk into the kitchen, a small but cozy space that often serves as the heart of their evenings. Annie walks through the passageway to the laundry room, which is known for its frequent drafts, wearing a nylon robe and carrying her clothes to be washed. The wind, a frequent visitor in this creaky old house, blows the robe open as the door creaks open, and Annie walks into the dark laundry room. In the light from the main house, Annie sees the light switch, one that often flickers due to faulty wiring. Almost immediately, the wind blows the door shut, a common nuisance in this part of the house. Annie stands motionless for a moment, then begins looking for the light switch and turns toward the slightly open door. Behind the door, we see the outline of the shape standing there, a silent sentinel of fear. The wind blows the door open a little wider, and she glances outside the door. She steps back inside and crosses to the washing machine, a vintage model known for its durability, opens the top, and dumps her clothes inside. Suddenly, a big gust of wind comes through the opened window above her, known to stick open on stormy nights, and the door slams shut. Annie hurries to the door and tries to open it, but she is unsuccessful and tries to pull the door open. Meanwhile, Lindsey Wallace, 8 years old with a pretty face and an adventurous spirit, watches the Horror Marathon at top volume on TV and lets the phone ring away, too absorbed in the cinematic scares to notice. Annie turns and glances at the window above the washing machine, where we see the shape looking in, but then the shape is gone, disappearing as silently as it appeared. She quickly crosses to the washing machine, climbs up on top of it, and starts out the window, but halfway through she gets stuck, a predicament all too common with this narrow escape route. Lindsey finally gets up and walks to the phone, her eyes pivoted on the TV, a suspenseful masterpiece from the mid-20th century. Lindsey pulls on Annie's legs, and she slides from the window onto the dryer, landing with a soft thud. As Annie and Lindsey walk back into the house, the phone rings, a persistent ring that echoes through the evening air, and from the house, Annie hears the phone ring. Lindsey races across the room and picks it up, then sets down the receiver and walks out of the kitchen, her mind already drifting back to the horror on screen. Annie gives Lindsey a dirty look and picks it up. Suddenly, behind Annie, the shape walks through the hallway between the living room and the kitchen, its presence foreboding and silent. Annie then walks into the living room, a space now tinged with an unseen tension."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Annie listens to the growling of the dog and turns to Lindsey in the living room. We see the shape's legs a few feet from the house next to Lester's legs kicking and struggling a few feet above the ground off screen. the shape is strangling the dog in midair. Finally the dog's legs stop moving and dangle lifelessly. Laurie and Tommy are sitting on the couch watching the Horrorthon on TV. Laurie holds out her hand and Tommy takes it and together they walk into the kitchen. Annie walks through the passageway to the laundry room wearing a nylon robe and carrying her clothes to be washed. The wind blows the robe open as the door creaks open and Annie walks into the dark laundry room. In the light from the main house Annie sees the light switch. Almost immediately the wind blows the door shut. Annie stands motionless for a moment then begins looking for the light switch and turns toward the slightly open door. Behind the door we see the outline of the shape standing there. The wind blows the door open a little wider and she glances outside the door. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. She steps back inside and crosses to the washing machine opens the top and dumps her clothes inside. Suddenly a big gust of wind comes through the opened window above her and the door slams shut. Annie hurries to the door and tries to open it but she is unsuccessful and tries to pull the door open. Meanwhile Lindsey Wallace 8 years old with a pretty face watches the Horror Marathon at top volume on TV and let us the phone ring away. Annie turns and glances at the window above the washing machine where we see the shape looking in but then the shape is gone. She quickly crosses to the washing machine climbs up on top of it and starts out the window but halfway through she gets stuck. Lindsey finally gets up and walks to the phone her eyes pivoted on the TV. Lindsey pulls on Annie's legs and she slides from the window onto the dryer. As Annie and Lindsey walk back into the house the phone rings and from the house Annie hears the phone ring. Lindsey races across the room and picks it up. then sets down the receiver and walks out of the kitchen. Annie gives Lindsey a dirty look and picks it up. Suddenly behind Annie the shape walks through the hallway between the living room and the kitchen. Annie then walks into the living room."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Annie listens to the growling of the dog and turns to Lindsey in the living room. We see the shape's legs a few feet from the house next to Lester's legs kicking and struggling a few feet above the ground off screen. the shape is strangling the dog in midair. Finally the dog's legs stop moving and dangle lifelessly. Laurie and Tommy are sitting on the couch watching the Horrorthon on TV. Laurie holds out her hand and Tommy takes it and together they walk into the kitchen. Annie walks through the passageway to the laundry room wearing a nylon robe and carrying her clothes to be washed. The wind blows the robe open as the door creaks open and Annie walks into the dark laundry room. In the light from the main house Annie sees the light switch. Almost immediately the wind blows the door shut. Annie stands motionless for a moment then begins looking for the light switch and turns toward the slightly open door. Behind the door we see the outline of the shape standing there. The wind blows the door open a little wider and she glances outside the door. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. She steps back inside and crosses to the washing machine opens the top and dumps her clothes inside. Suddenly a big gust of wind comes through the opened window above her and the door slams shut. Annie hurries to the door and tries to open it but she is unsuccessful and tries to pull the door open. Meanwhile Lindsey Wallace 8 years old with a pretty face watches the Horror Marathon at top volume on TV and let us the phone ring away. Annie turns and glances at the window above the washing machine where we see the shape looking in but then the shape is gone. She quickly crosses to the washing machine climbs up on top of it and starts out the window but halfway through she gets stuck. Lindsey finally gets up and walks to the phone her eyes pivoted on the TV. Lindsey pulls on Annie's legs and she slides from the window onto the dryer. As Annie and Lindsey walk back into the house the phone rings and from the house Annie hears the phone ring. Lindsey races across the room and picks it up. then sets down the receiver and walks out of the kitchen. Annie gives Lindsey a dirty look and picks it up. Suddenly behind Annie the shape walks through the hallway between the living room and the kitchen. Annie then walks into the living room."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Annie listens to the growling of the dog and turns to Lindsey in the living room. We see the shape's legs a few feet from the house next to Lester's legs kicking and struggling a few feet above the ground off screen. the shape is strangling the dog in midair. Finally the dog's legs stop moving and dangle lifelessly. Laurie and Tommy are sitting on the couch watching the Horrorthon on TV. Laurie holds out her hand and Tommy takes it and together they walk into the kitchen. Annie walks through the passageway to the laundry room wearing a nylon robe and carrying her clothes to be washed. Lindsey pulls on Annie's legs and she slides from the window onto the dryer. As Annie and Lindsey walk back into the house the phone rings and from the house Annie hears the phone ring. Lindsey races across the room and picks it up. then sets down the receiver and walks out of the kitchen. Annie gives Lindsey a dirty look and picks it up. Suddenly behind Annie the shape walks through the hallway between the living room and the kitchen. Annie then walks into the living room."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Annie listens to the growling of the dog and turns to Lindsey in the living room. We see the shape's legs a few feet from the house next to Lester's legs kicking and struggling a few feet above the ground off screen. the shape is strangling the dog in midair. Annie gives Lindsey a dirty look and picks it up. Suddenly behind Annie the shape walks through the hallway between the living room and the kitchen. Annie then walks into the living room."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Jonah hums to the chirping of the parrot and spins toward Calvin in the attic. We notice the tree's branches several inches from the shed, near Oliver's branches, flailing and flipping a couple of inches below the roof; off screen, the tree is tickling the parrot in mid-air. Eventually, the parrot's branches stop twitching and sway gently. Susan and Ethan are lying on the carpet enjoying the Comedy Fest on the projector. Susan extends her arm, and Ethan grasps it, and together they shuffle into the basement. Jonah strolls through the tunnel to the garage, wearing a silk scarf and dragging his shoes to be polished. The breeze flaps the scarf wide as the gate screeches ajar, and Jonah stumbles into the dim garage. In the glow from the guesthouse, Jonah notices the candle holder. Almost at once, the breeze swings the gate closed. Jonah stands rooted for an instant, then starts searching for the candle holder and swivels toward the slightly ajar gate. Behind the gate, we spot the silhouette of the tree hovering there. The breeze pushes the gate open a tad further, and he peeks outside the gate. He steps forward inside and ambles to the toolbox, opens the lid, and tosses his shoes inside. Abruptly, a large breeze gusts through the cracked skylight above him, and the gate crashes shut. Jonah rushes to the gate and attempts to swing it open, but he is thwarted and tries to pull the gate open. Meanwhile, Calvin Baker, 10 years old with a mischievous grin, enjoys the Comedy Carnival at full blast on the projector and ignores the alarm chiming away. Jonah pivots and peers at the skylight above the toolbox, where we observe the silhouette peering in, but then the silhouette vanishes. He swiftly hops to the toolbox, climbs up on top of it, and attempts to exit through the skylight, but midway through he becomes wedged. Calvin eventually rises and strolls to the alarm, his gaze glued on the projector. Calvin tugs on Jonah's branches, and he slips from the skylight onto the blender. As Jonah and Calvin stroll back into the shed, the alarm buzzes, and from the shed, Jonah hears the alarm buzz. Calvin dashes across the space and presses it, then places down the bell and saunters out of the basement. Jonah shoots Calvin an annoyed glance and picks it up. Instantly, behind Jonah, the silhouette creeps through the corridor between the attic and the basement. Jonah then strolls into the attic."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Annie hears the dog growling and sees Lindsey in the living room as an unseen figure strangles the dog outside. Laurie and Tommy watch TV in the living room before moving to the kitchen. Annie, in a nylon robe, heads to the laundry room with her clothes. The wind blows the door open and shut, and in the dim light, Annie searches for the light switch. The shape's outline appears behind the door as Annie dumps her clothes in the washer, and a gust slams the door closed. Trapped, Annie struggles to open it. Inside, Lindsey watches TV loudly, ignoring the ringing phone. Annie notices the shape at the window, but it vanishes. She climbs up to escape through the window, but gets stuck until Lindsey helps her down. As they return inside, the phone rings. Lindsey answers, sets it down, and leaves. Annie picks it up, unaware the shape is moving between the kitchen and living room."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Annie then walks into the living room Suddenly behind Annie the shape walks through the hallway between the living room and the kitchen  Annie gives Lindsey a dirty look and picks it up  then sets down the receiver and walks out of the kitchen  Lindsey races across the room and picks it up  As Annie and Lindsey walk back into the house the phone rings and from the house Annie hears the phone ring  Lindsey pulls on Annie's legs and she slides from the window onto the dryer  Lindsey finally gets up and walks to the phone her eyes pivoted on the TV  She quickly crosses to the washing machine climbs up on top of it and starts out the window but halfway through she gets stuck  Annie turns and glances at the window above the washing machine where we see the shape looking in but then the shape is gone  Meanwhile Lindsey Wallace 8 years old with a pretty face watches the Horror Marathon at top volume on TV and lets the phone ring away  Annie hurries to the door and tries to open it but she is unsuccessful and tries to pull the door open  Suddenly a big gust of wind comes through the opened window above her and the door slams shut  She steps back inside and crosses to the washing machine opens the top and dumps her clothes inside  The wind blows the door open a little wider and she glances outside the door  Behind the door we see the outline of the shape standing there  Annie stands motionless for a moment then begins looking for the light switch and turns toward the slightly open door  Almost immediately the wind blows the door shut  In the light from the main house Annie sees the light switch  The wind blows the robe open as the door creaks open and Annie walks into the dark laundry room  Annie walks through the passageway to the laundry room wearing a nylon robe and carrying her clothes to be washed  Laurie holds out her hand and Tommy takes it and together they walk into the kitchen  Laurie and Tommy are sitting on the couch watching the Horrorthon on TV  Finally the dog's legs stop moving and dangle lifelessly  the shape is strangling the dog in midair  We see the shape's legs a few feet from the house next to Lester's legs kicking and struggling a few feet above the ground off screen  Annie listens to the growling of the dog and turns to Lindsey in the living room "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "We see the shape's legs a few feet from the house next to Lester's legs kicking and struggling a few feet above the ground off screen Annie listens to the growling of the dog and turns to Lindsey in the living room Finally the dog's legs stop moving and dangle lifelessly the shape is strangling the dog in midair Laurie holds out her hand and Tommy takes it and together they walk into the kitchen Laurie and Tommy are sitting on the couch watching the Horrorthon on TV The wind blows the robe open as the door creaks open and Annie walks into the dark laundry room Annie walks through the passageway to the laundry room wearing a nylon robe and carrying her clothes to be washed Almost immediately the wind blows the door shut In the light from the main house Annie sees the light switch Behind the door we see the outline of the shape standing there Annie stands motionless for a moment then begins looking for the light switch and turns toward the slightly open door She steps back inside and crosses to the washing machine opens the top and dumps her clothes inside The wind blows the door open a little wider and she glances outside the door Annie hurries to the door and tries to open it but she is unsuccessful and tries to pull the door open Suddenly a big gust of wind comes through the opened window above her and the door slams shut Annie turns and glances at the window above the washing machine where we see the shape looking in but then the shape is gone Meanwhile Lindsey Wallace 8 years old with a pretty face watches the Horror Marathon at top volume on TV and let us the phone ring away Lindsey finally gets up and walks to the phone her eyes pivoted on the TV She quickly crosses to the washing machine climbs up on top of it and starts out the window but halfway through she gets stuck As Annie and Lindsey walk back into the house the phone rings and from the house Annie hears the phone ring Lindsey pulls on Annie's legs and she slides from the window onto the dryer then sets down the receiver and walks out of the kitchen Lindsey races across the room and picks it up Suddenly behind Annie the shape walks through the hallway between the living room and the kitchen Annie gives Lindsey a dirty look and picks it up Annie then walks into the living room"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Suddenly a big gust of wind comes through the opened window above her and the door slams shut  Annie hurries to the door and tries to open it but she is unsuccessful and tries to pull the door open  Meanwhile Lindsey Wallace 8 years old with a pretty face watches the Horror Marathon at top volume on TV and lets the phone ring away  Annie turns and glances at the window above the washing machine where we see the shape looking in but then the shape is gone  She quickly crosses to the washing machine climbs up on top of it and starts out the window but halfway through she gets stuck  Lindsey finally gets up and walks to the phone her eyes pivoted on the TV  Lindsey pulls on Annie's legs and she slides from the window onto the dryer  As Annie and Lindsey walk back into the house the phone rings and from the house Annie hears the phone ring  Lindsey races across the room and picks it up  then sets down the receiver and walks out of the kitchen  Annie gives Lindsey a dirty look and picks it up  Suddenly behind Annie the shape walks through the hallway between the living room and the kitchen  Annie then walks into the living room Annie listens to the growling of the dog and turns to Lindsey in the living room  We see the shape's legs a few feet from the house next to Lester's legs kicking and struggling a few feet above the ground off screen  the shape is strangling the dog in midair  Finally the dog's legs stop moving and dangle lifelessly  Laurie and Tommy are sitting on the couch watching the Horrorthon on TV  Laurie holds out her hand and Tommy takes it and together they walk into the kitchen  Annie walks through the passageway to the laundry room wearing a nylon robe and carrying her clothes to be washed  The wind blows the robe open as the door creaks open and Annie walks into the dark laundry room  In the light from the main house Annie sees the light switch  Almost immediately the wind blows the door shut  Annie stands motionless for a moment then begins looking for the light switch and turns toward the slightly open door  Behind the door we see the outline of the shape standing there  The wind blows the door open a little wider and she glances outside the door  She steps back inside and crosses to the washing machine opens the top and dumps her clothes inside "
        }
      ]
    }
  ]
}