{
  "ground_truth": "She puts two hands lightly on his waist to move him out of the way, and he gulps at the contact, since no one else ever touches him, but covers his self-consciousness. She barks a mirthless though hearty laugh. If we could read Melvin, which we can't, we'd see him unsettled by the date talk. The two waitresses signal their protests as Melvin walks back into the restaurant proper, hanging near their table, and his discomfort builds in this limbo. The Woman starts to protest. There is in Carol's attitude toward Melvin some ingredient of self-satisfaction—that she is the only one in the place who can handle him. She starts to clear the table. Some crazy street-freak has slipped under her perfect guard and momentarily devastated her, and Melvin senses that he's gone way too far. A beat and then Melvin nods, hardly breathing, backing down. She walks away, and Melvin watches her, biting his lower lip. She is underneath a YOUNGER, cuter MAN on the living room sofa, each time startling herself with her own noise and trying to reign it in. The Young Man stops and looks at her, and pulling herself together, she goes off down the hallway. She takes off her headphones when she sees Carol, then hears the cough. Carol now goes into her son's room, which is a monument to horrible, sleepless nights, with two drugstore de-humidifying filters, a nebulizer (breathing contraption), a waste basket, a nightstand filled with medicine, a blood pressure kit, stacks of seven-year-old toys, and a small TV wedged into the tiny space. Carol feels his head, and then he coughs, trying to suppress it. She brings up a waste basket as he throws up and she comforts him. He apologizes. As she re-enters the living room, he is taking a cigarette from a pack, palms the cigarette, and resumes making out. His hand squeezes her breast, then he stops and looks at his hand. She looks down and sees a bit of throw-up he picked up while feeling her and then notices him looking at her with extreme distaste. She barks a laugh to cover her embarrassment but speaks the truth. Seeing the Hustlers, he leads the way back toward the studio, chatting away unaware that Vincent is disrobing as he follows him and eyeing the expensive apartment. He turns and sees the naked model as Vincent moves back to retrieve his clothes. Vincent is striking blatantly sexual poses to the increasingly uneasy Simon. Vincent has instinctively put Simon on the defensive, and Vincent's slack-jawed expression changes as he feels an intellectual tingle to be having this conversation. There's a joy in him at this moment—a bit of purity. Carol and LESLIE, another waitress, are waiting for their order at the cappuccino bar.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She places two hands gently on his waist to shift him out of the path, and he swallows at the touch, since no one else ever touches him, but masks his self-awareness. She barks a humorless yet boisterous laugh. If we could interpret Melvin, which we can't, we'd observe him unsettled by the date chatter. The two waitresses gesticulate their objections as Melvin strolls back into the restaurant proper, lingering near their table, and his unease grows in this limbo. The Woman begins to object. There is in Carol's demeanor toward Melvin some element of self-contentment—that she is the only one in the place who can manage him. She begins to clear the table. Some insane street-weirdo has slipped under her flawless defense and momentarily devastated her, and Melvin perceives that he's gone way too far. A beat and then Melvin agrees, barely breathing, retreating. She walks away, and Melvin observes her, biting his lower lip. She is beneath a YOUNGER, cuter MAN on the living room couch, each time surprising herself with her own sound and trying to reign it in. The Young Man pauses and looks at her, and pulling herself together, she goes off down the corridor. She removes her headphones when she sees Carol, then hears the cough. Carol now enters her son's room, which is a testament to terrible, sleepless nights, with two drugstore de-humidifying filters, a nebulizer (breathing device), a waste container, a nightstand filled with medicine, a blood pressure kit, stacks of seven-year-old toys, and a small TV wedged into the tiny area. Carol feels his head, and then he coughs, trying to stifle it. She brings up a waste container as he vomits and she soothes him. He apologizes. As she re-enters the living room, he is taking a cigarette from a pack, palms the cigarette, and resumes making out. His hand squeezes her breast, then he stops and looks at his hand. She looks down and sees a bit of vomit he picked up while feeling her and then notices him looking at her with extreme disgust. She barks a laugh to cover her embarrassment but speaks the truth. Seeing the Hustlers, he leads the way back toward the studio, chatting away unaware that Vincent is undressing as he follows him and eyeing the costly apartment. He turns and sees the nude model as Vincent moves back to retrieve his clothing. Vincent is striking blatantly sexual stances to the increasingly uneasy Simon. Vincent has instinctively put Simon on the defensive, and Vincent's slack-jawed expression changes as he feels an intellectual thrill to be having this conversation. There's a delight in him at this moment—a bit of purity. Carol and LESLIE, another waitress, are waiting for their order at the cappuccino bar."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Two hands are placed lightly on his waist by her to move him out of the way, and the contact makes him gulp, since he is never touched by anyone else, but his self-consciousness is covered by him. A mirthless though hearty laugh is barked by her. If Melvin could be read by us, which he can't, him being unsettled by the date talk would be seen. Their protests are signaled by the two waitresses as Melvin walks back into the restaurant proper, hanging near their table, and this discomfort builds in him in this limbo. The Woman starts to protest. In Carol's attitude toward Melvin, we see some ingredient of self-satisfaction—that she is the only one in the place who can handle him. The table is started to be cleared by her. Some crazy street-freak has slipped under her perfect guard and momentarily devastated her, and that he's gone way too far is sensed by Melvin. A beat and then hardly breathing, Melvin nods, backing down. Away she walks, and his lower lip is bitten by Melvin as he watches her. A YOUNGER, cuter MAN is underneath her on the living room sofa, each time startling herself with her own noise and trying to reign it in. The Young Man stops and looks at her, and after pulling herself together, off she goes down the hallway. Her headphones are taken off when Carol is seen by her, then the cough is heard. Carol now goes into her son's room, which is a monument to horrible, sleepless nights, with two drugstore de-humidifying filters, a nebulizer (breathing contraption), a waste basket, a nightstand filled with medicine, a blood pressure kit, stacks of seven-year-old toys, and a small TV wedged into the tiny space. His head is felt by Carol, and then a cough is suppressed by him. A waste basket is brought up by her as he throws up and comfort is given to him by her. An apology is given by him. As the living room is re-entered by her, a cigarette is taken from a pack by him, the cigarette is palmed, and making out is resumed. Her breast is squeezed by his hand, then his hand is stopped and looked at by him. She looks down and sees a bit of throw-up he picked up while feeling her and then notices him looking at her with extreme distaste. A laugh is barked by her to cover her embarrassment but the truth is spoken by her. The Hustlers are seen by him, and the way back toward the studio is led by him, chatting away, unaware that Vincent is disrobing as he follows him and eyeing the expensive apartment. He turns and sees the naked model as Vincent moves back to retrieve his clothes. Striking blatantly sexual poses, Vincent makes Simon increasingly uneasy. Instinctively, Simon is put on the defensive by Vincent, and Vincent's slack-jawed expression changes as an intellectual tingle is felt by him to be having this conversation. A joy exists in him at this moment—a bit of purity. Carol and LESLIE, another waitress, wait for their order at the cappuccino bar."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "She places both hands on his waist to move him aside, causing him to gulp at the contact, masking his self-consciousness. She laughs, devoid of humor. If we could read Melvin, he'd seem unsettled by the date conversation. The waitresses protest as Melvin lingers near their table, increasing his discomfort. Carol, self-satisfied, thinks she's the only one who can handle him and begins clearing the table. A street-freak breaches her defenses, momentarily overwhelming her, and Melvin realizes he's overstepped. Melvin nods, barely breathing, retreating as she walks away. He watches her, biting his lip. She is on the living room sofa with a younger man, shocked by her own noise before composing herself. The Young Man stops; she regains composure and leaves. Removing her headphones, she sees Carol and hears a cough. Carol enters her son's cluttered room, filled with dehumidifiers, a nebulizer, medicine, toys, and a TV. Feeling his forehead, she brings a wastebasket as he vomits, comforting him as he apologizes. Returning to the living room, a cigarette palmed, the man resumes making out. He stops, noticing throw-up on his hand, and she laughs to mask her embarrassment. Observing the Hustlers, he leads the way back to the studio, chatting as Vincent disrobes behind him, eyeing the apartment. Surprised, he sees Vincent's bold poses, making Simon uneasy. Despite this, there's an intellectual thrill and a sense of joy in Vincent. Carol and Leslie, another waitress, wait for their order at the cappuccino bar."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "She lightly places her hands on his waist to move him, making him gulp as no one touches him, but he hides his self-consciousness. She laughs heartily. If we could read Melvin, we'd see him unsettled by the date talk. Two waitresses protest as Melvin re-enters the restaurant, feeling awkward. The Woman begins to protest. Carol feels self-satisfied handling Melvin. She clears the table. A street-freak briefly devastates her, and Melvin realizes he's overstepped. Melvin nods, barely breathing, and backs down. She walks away, with Melvin watching, biting his lip. She is on the sofa with a YOUNGER man, startled by her noise. The Young Man stops, and she leaves. She removes her headphones, sees Carol, then hears the cough. Carol goes to her son's room, filled with medical supplies and toys. She feels his head; he coughs, then vomits, and she comforts him. He apologizes. Back in the living room, he takes a cigarette, palms it, and resumes making out, then stops, seeing throw-up on his hand. She laughs to cover embarrassment. Seeing the Hustlers, he leads back to the studio, chatting, unaware Vincent disrobes, eyeing the luxury apartment. He sees Vincent naked, trying on sexual poses, making Simon uneasy. Vincent instinctively puts Simon on the defensive and feels intellectual excitement. There's purity in Vincent's joy. Carol and LESLIE, another waitress, wait for their cappuccino order."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "She gently places both hands on his waist, intending to move him aside, and he gulps at the unexpected contact, feeling somewhat flustered, as he is unaccustomed to personal touch. Despite his discomfort, he makes an effort to hide his self-consciousness. She then lets out a laugh that is hearty in volume, yet lacking genuine amusement. If we were able to delve into Melvin's thoughts, which we are not, we would see him feeling quite unsettled by the talk of a date. As Melvin re-enters the main area of the bustling restaurant, the two waitresses express their discontent through visible signals, while Melvin awkwardly lingers near their table, caught in a state of increasing discomfort. The Woman begins to voice her objections. In Carol's demeanor towards Melvin, there exists an air of self-satisfaction—she is quite aware that she is the sole person in the establishment who has the ability to manage him effectively. She begins the task of clearing the table. Meanwhile, some erratic street character unexpectedly bypasses her normally impeccable defenses, causing a momentary upheaval, and Melvin perceives that he has crossed a line. After a pause, Melvin gives a slight nod, his breath nearly halted as he retreats. As she walks away, Melvin observes her closely, nervously biting his lower lip. \n\nElsewhere, she finds herself underneath a YOUNGER, more attractive MAN on the living room sofa, repeatedly startling herself with her own noises and attempting to suppress them. The Young Man pauses and gazes at her, prompting her to compose herself before she heads off down the hallway. Upon spotting Carol, she removes her headphones, then catches the sound of a cough. Carol enters her son's room, which is practically a shrine to countless, torturous sleepless nights. It is packed with two drugstore de-humidifying filters, a nebulizer for breathing assistance, a wastebasket, a nightstand overflowing with medicine, a kit for checking blood pressure, piles of toys dating back seven years, and a small television crammed into the cramped space. Carol checks her child's forehead, and he coughs again, clearly trying hard to suppress it. She quickly retrieves a wastebasket as he vomits, comforting him throughout. He apologizes in his weakened voice. As she returns to the living room, he is in the act of taking a cigarette from its pack, discretely tucking it in his palm, and continues their previous intimate interaction. His hand, inappropriately, squeezes her breast before he stops and looks at his own hand in confusion. She glances down and notices some remnants of vomit that got transferred while he touched her, and then catches him staring at her with a look of pronounced distaste. She lets out a laugh to cover her embarrassment, yet it is a laugh filled with unvarnished truth. Observing the Hustlers, he guides the way back towards the studio, maintaining a lively conversation, unaware that Vincent is in the process of disrobing as he follows, all while taking in the sights of the lavish apartment. He turns around to see the nude model, just as Vincent moves back to retrieve his garments. Vincent strikes overtly sexual poses, making Simon more and more uneasy. Vincent has, by instinct, placed Simon on the defensive, while his initially slack-jawed expression shifts as he experiences an intellectual stimulation from the ongoing exchange. At this moment, a pure joy radiates from within him. Meanwhile, Carol and LESLIE, another waitress, stand waiting for their order at the cappuccino bar, engaged in idle conversation as they await their drinks."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "She gently places both of her hands on his waist, intending to shift him aside, and he gulps at the unexpected physical contact, feeling somewhat flustered since he is not accustomed to such personal touch. Despite experiencing this discomfort, he makes a considerable effort to conceal his self-consciousness. She then lets out a laugh that is hearty in volume, yet noticeably lacking in genuine amusement. If one were able to delve into Melvin's thoughts, which we unfortunately cannot, we would see him feeling quite unsettled by the casual talk of a date. As Melvin makes his way back into the main area of the bustling restaurant, the two waitresses express their discontent through visible signals, while Melvin awkwardly lingers near their table, caught in a state of increasing discomfort. The Woman begins to voice her objections clearly. In Carol's demeanor towards Melvin, there exists an air of self-satisfaction—she is acutely aware that she is the only person in the establishment who has the ability to manage him effectively. She begins the laborious task of clearing the table. Meanwhile, some erratic street character unexpectedly bypasses her normally impeccable defenses, causing a momentary upheaval, and Melvin perceives, quite keenly, that he has crossed a line. After a pause, Melvin gives a slight nod, his breath nearly halted as he retreats. As she walks away, Melvin observes her very closely, nervously biting his lower lip.\n\nIn another part of the scene, she finds herself positioned underneath a YOUNGER and notably more attractive MAN on the living room sofa, repeatedly startling herself with her own noises and striving to suppress them. The Young Man pauses in his actions and gazes at her, prompting her to compose herself before she heads off down the hallway. Upon spotting Carol's approach, she removes her headphones, then catches the sound of a cough. Carol enters her son's room, which has practically become a shrine to countless and torturous sleepless nights. It is densely packed with two drugstore de-humidifying filters, a nebulizer for breathing assistance, a wastebasket, a nightstand overflowing with various medicines, a kit for checking blood pressure, piles of toys dating back seven years, and a small television that is crammed into the cramped space. Carol checks her child's forehead, and he coughs again, clearly trying hard to suppress it. She quickly retrieves a wastebasket as he vomits, all the while comforting him. He apologizes in his weakened voice. As she returns to the living room, he is in the act of taking a cigarette from its pack, discreetly tucking it in his palm, and continues their previous intimate interaction. His hand, rather inappropriately, squeezes her breast before he stops and looks at his own hand in confusion. She glances down and notices some remnants of vomit that got transferred while he touched her, and then catches him staring at her with a look of pronounced distaste. She lets out a laugh to cover her embarrassment, yet it is a laugh imbued with unvarnished truth. Observing the Hustlers, he guides the way back towards the studio, maintaining a lively conversation, unaware that Vincent is in the process of disrobing as he follows, all while taking in the sights of the lavish apartment. He turns around to see the nude model, just as Vincent moves back to retrieve his garments. Vincent strikes overtly sexual poses, making Simon more and more uneasy. Vincent has, by instinct, placed Simon on the defensive, while his initially slack-jawed expression shifts as he experiences an intellectual stimulation from the ongoing exchange. At this very moment, a pure and uncontainable joy radiates from within him. Meanwhile, Carol and LESLIE, another waitress, stand patiently waiting for their order at the cappuccino bar, engaged in idle but pleasant conversation as they await their eagerly anticipated drinks."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "She carefully places both hands on his waist with a gentle touch to subtly guide him out of her path, causing him to gulp at the unexpected contact as it is a rare occurrence for him to be touched by someone else. Despite this, he makes an effort to conceal his self-conscious reaction. She then lets out a laughter that, while hearty, lacks genuine mirth. If one could peer into Melvin's thoughts, although it is impossible, one would find him feeling unsettled by the discussion of a date. As Melvin reenters the main area of the restaurant, the two waitresses express their disapproval through silent signals as he lingers near their table, intensifying his sense of discomfort in this awkward situation. Just as the Woman begins to voice her objection, Carol's demeanor toward Melvin suggests a level of self-satisfaction stemming from being the only person there who can manage him effectively. She proceeds to tidy up the table, harboring an awareness that a bizarre, unpredictable street-freak has momentarily breached her facade, leaving her briefly rattled, and Melvin perceives that he has overstepped. After a brief pause, Melvin acknowledges this with a nod, scarcely breathing as he retreats. As she strides away, Melvin observes her, biting his lower lip in contemplation. Meanwhile, in a different scene, she finds herself beneath a YOUNGER, more attractive MAN on the living room sofa, repeatedly surprising herself with her own vocal reactions and attempting to restrain them. The Young Man pauses, glancing at her, and as she regains her composure, she makes her way down the hallway. Upon noticing Carol, she removes her headphones just in time to hear a cough. Carol then enters her son's room, which is filled with signs of relentless, sleepless nights, including two drugstore de-humidifying filters, a nebulizer for breathing, a waste basket, a nightstand cluttered with medicine, a blood pressure kit, piles of seven-year-old toys, and a small TV crammed into the limited space. Carol gently checks her son's forehead, and he attempts to suppress a cough. She quickly retrieves a waste basket to catch his vomit and offers him comfort. He apologizes for his condition. As Carol returns to the living room, she observes him taking a cigarette from a pack, and in a smooth motion, he conceals the cigarette before resuming his embrace with her. His hand squeezes her breast, then he abruptly stops, staring at his hand. She follows his gaze downward and notices a small amount of vomit he inadvertently picked up while touching her, then sees him looking at her with a clear expression of distaste. She releases a laugh in an attempt to mask her embarrassment, all while speaking candidly. Shifting to another location, upon seeing the Hustlers, he confidently takes the lead back toward the studio, engrossed in conversation and oblivious to the fact that Vincent is undressing while trailing behind him, all the while appraising the lavish apartment. Turning around, he catches sight of the nude model as Vincent moves to retrieve his clothes. Vincent deliberately strikes overtly sexual poses, unnerving Simon who becomes visibly uneasy. Vincent's actions instinctively put Simon on the defensive, yet Vincent's initial slack-jawed expression shifts as he experiences an intellectual thrill from their exchange. In this moment, Vincent feels a sense of joy, a glimmer of pure emotion. Meanwhile, at the cappuccino bar, Carol and LESLIE, a fellow waitress, await their order."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "She lightly places her hands on his waist to move him aside, causing him to gulp at the unexpected contact but he manages to conceal his self-consciousness. She laughs heartily, though without mirth, as Melvin is visibly unsettled by their date conversation. As Melvin returns to the restaurant and lingers awkwardly near their table, two waitresses signal their disapproval, which adds to his discomfort. Carol begins to clear the table, embodying a self-satisfied confidence in handling Melvin, unlike others. Sensing he went too far, Melvin acknowledges this with a nod, stepping back as she leaves while he watches, biting his lip.\n\nMeanwhile, she is on the sofa with a younger man, surprised by her own sounds and trying to restrain them. The man pauses and she regains composure, leaving down the hallway. When she encounters Carol, she removes her headphones and hears a cough. Carol visits her son's room, a testament to challenging nights, filled with medical paraphernalia and toys. She checks his forehead, comforts him as he coughs and vomits, and he apologizes. Returning to the living room, the man resumes smoking and making out, but stops after inadvertently smearing throw-up he touched while feeling her. She sees his distaste and laughs to mask her embarrassment, but admits the truth.\n\nAs they head back to the studio, chatting obliviously, Vincent disrobes and surveys the upscale apartment, striking bold poses to Simon's growing discomfort. Despite this, Vincent experiences a pure joy and intellectual thrill from their conversation. Elsewhere, Carol and Leslie, another waitress, await their order at the cappuccino bar."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She puts two hands lightly on his waist to move him out of the way, and he gulps at the contact, since no one else ever touches him, displaying the isolation he feels living in a bustling city where personal connections often remain elusive, but covers his self-consciousness. She barks a mirthless though hearty laugh, reminiscent of those who use humor to protect themselves from vulnerability. If we could read Melvin, which we can't, we'd see him unsettled by the date talk, a topic that surfaces his anxieties about intimacy rooted in past rejections. The two waitresses signal their protests as Melvin walks back into the restaurant proper, a quaint diner known for its homemade pies, hanging near their table, and his discomfort builds in this limbo. The Woman starts to protest. There is in Carol's attitude toward Melvin some ingredient of self-satisfaction—that she is the only one in the place who can handle him, a fact that gives her a unique sense of pride and control. She starts to clear the table. Some crazy street-freak has slipped under her perfect guard and momentarily devastated her, a reminder that chaos lurks even in seemingly orderly lives, and Melvin senses that he's gone way too far. A beat and then Melvin nods, hardly breathing, backing down. She walks away, and Melvin watches her, biting his lower lip, a habit from childhood when he felt overwhelmed. She is underneath a YOUNGER, cuter MAN on the living room sofa, each time startling herself with her own noise and trying to reign it in, realizing the thin walls could betray her privacy to neighbors. The Young Man stops and looks at her, and pulling herself together, she goes off down the hallway. She takes off her headphones when she sees Carol, a nod to the common practice of using music as an escape, then hears the cough. Carol now goes into her son's room, which is a monument to horrible, sleepless nights, in their small apartment where comfort is hard-won, with two drugstore de-humidifying filters, a nebulizer (breathing contraption), a waste basket, a nightstand filled with medicine, a blood pressure kit, stacks of seven-year-old toys, and a small TV wedged into the tiny space. Carol feels his head, and then he coughs, trying to suppress it. She brings up a waste basket as he throws up and she comforts him, her maternal instinct a powerful force amid the chaos. He apologizes. As she re-enters the living room, he is taking a cigarette from a pack, a habit he picked up despite his frequent health warnings, palms the cigarette, and resumes making out. His hand squeezes her breast, then he stops and looks at his hand. She looks down and sees a bit of throw-up he picked up while feeling her and then notices him looking at her with extreme distaste. She barks a laugh to cover her embarrassment but speaks the truth. Seeing the Hustlers, street performers known for their elaborate stunts, he leads the way back toward the studio, a place brimming with creative energy, chatting away unaware that Vincent is disrobing as he follows him and eyeing the expensive apartment, its lavish décor a stark contrast to his modest lifestyle. He turns and sees the naked model as Vincent moves back to retrieve his clothes. Vincent is striking blatantly sexual poses to the increasingly uneasy Simon. Vincent has instinctively put Simon on the defensive, creating an unexpected power dynamic, and Vincent's slack-jawed expression changes as he feels an intellectual tingle to be having this conversation. There's a joy in him at this moment—a bit of purity. Carol and LESLIE, another waitress known for her quick wit and warm smile, are waiting for their order at the cappuccino bar, a popular spot for quick caffeine fixes among the bustling morning crowd."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "She puts two hands lightly on his waist to move him out of the way and he gulps at the contact since no one else ever touches him but covers his selfconsciousness. She barks a mirthless though hearty laugh. If we could read Melvin which we cannot we would see him unsettled by the date talk. The two waitresses signal their protests as Melvin walks back into the restaurant proper hanging near their table and his discomfort builds in this limbo. The Woman starts to protest. There is in Carol's attitude toward Melvin some ingredient of selfsatisfaction—that she is the only one in the place who can handle him. She starts to clear the table. Some crazy streetfreak has slipped under her perfect guard and momentarily devastated her and Melvin senses that he is gone way too far. A beat and then Melvin nods hardly breathing backing down. She walks away and Melvin watches her biting his lower lip. She is underneath a YOUNGER cuter MAN on the living room sofa each time startling herself with her own noise and trying to reign it in. The Young Man stops and looks at her and pulling herself together. she goes off down the hallway. She takes off her headphones when she sees Carol then hears the cough. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Carol now goes into her son's room which is a monument to horrible sleepless nights with two drugstore dehumidifying filters a nebulizer breathing contraption a waste basket a nightstand filled with medicine a blood pressure kit stacks of sevenyearold toys and a small TV wedged into the tiny space. Carol feels his head and then he coughs trying to suppress it. She brings up a waste basket as he throws up and she comforts him. He apologizes. As she reenters the living room he is taking a cigarette from a pack palms the cigarette and resumes making out. His hand squeezes her breast then he stops and looks at his hand. She looks down and sees a bit of throwup he picked up while feeling her and then notices him looking at her with extreme distaste. She barks a laugh to cover her embarrassment but speaks the truth. Seeing the Hustlers he leads the way back toward the studio chatting away unaware that. Vincent is disrobing as he follows him and eyeing the expensive apartment. He turns and sees the naked model as Vincent moves back to retrieve his clothes. Vincent is striking blatantly sexual poses to the increasingly uneasy Simon. Vincent has instinctively put Simon on the defensive and Vincent's slackjawed expression changes as he feels an intellectual tingle to be having this conversation. There is a joy in him at this moment—a bit of purity. Carol and LESLIE another waitress are waiting for their order at the cappuccino bar."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "She puts two hands lightly on his waist to move him out of the way and he gulps at the contact since no one else ever touches him but covers his selfconsciousness. She barks a mirthless though hearty laugh. If we could read Melvin which we cannot we would see him unsettled by the date talk. The two waitresses signal their protests as Melvin walks back into the restaurant proper hanging near their table and his discomfort builds in this limbo. The Woman starts to protest. There is in Carol's attitude toward Melvin some ingredient of selfsatisfaction—that she is the only one in the place who can handle him. She starts to clear the table. Some crazy streetfreak has slipped under her perfect guard and momentarily devastated her and Melvin senses that he is gone way too far. A beat and then Melvin nods hardly breathing backing down. She walks away and Melvin watches her biting his lower lip. She is underneath a YOUNGER cuter MAN on the living room sofa each time startling herself with her own noise and trying to reign it in. The Young Man stops and looks at her and pulling herself together. she goes off down the hallway. She takes off her headphones when she sees Carol then hears the cough. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. Carol now goes into her son's room which is a monument to horrible sleepless nights with two drugstore dehumidifying filters a nebulizer breathing contraption a waste basket a nightstand filled with medicine a blood pressure kit stacks of sevenyearold toys and a small TV wedged into the tiny space. Carol feels his head and then he coughs trying to suppress it. She brings up a waste basket as he throws up and she comforts him. He apologizes. As she reenters the living room he is taking a cigarette from a pack palms the cigarette and resumes making out. His hand squeezes her breast then he stops and looks at his hand. She looks down and sees a bit of throwup he picked up while feeling her and then notices him looking at her with extreme distaste. She barks a laugh to cover her embarrassment but speaks the truth. Seeing the Hustlers he leads the way back toward the studio chatting away unaware that. Vincent is disrobing as he follows him and eyeing the expensive apartment. He turns and sees the naked model as Vincent moves back to retrieve his clothes. Vincent is striking blatantly sexual poses to the increasingly uneasy Simon. Vincent has instinctively put Simon on the defensive and Vincent's slackjawed expression changes as he feels an intellectual tingle to be having this conversation. There is a joy in him at this moment—a bit of purity. Carol and LESLIE another waitress are waiting for their order at the cappuccino bar."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "She puts two hands lightly on his waist to move him out of the way and he gulps at the contact since no one else ever touches him but covers his selfconsciousness. She barks a mirthless though hearty laugh. If we could read Melvin which we cannot we would see him unsettled by the date talk. The two waitresses signal their protests as Melvin walks back into the restaurant proper hanging near their table and his discomfort builds in this limbo. The Woman starts to protest. There is in Carol's attitude toward Melvin some ingredient of selfsatisfaction—that she is the only one in the place who can handle him. She starts to clear the table. She barks a laugh to cover her embarrassment but speaks the truth. Seeing the Hustlers he leads the way back toward the studio chatting away unaware that. Vincent is disrobing as he follows him and eyeing the expensive apartment. He turns and sees the naked model as Vincent moves back to retrieve his clothes. Vincent is striking blatantly sexual poses to the increasingly uneasy Simon. Vincent has instinctively put Simon on the defensive and Vincent's slackjawed expression changes as he feels an intellectual tingle to be having this conversation. There is a joy in him at this moment—a bit of purity. Carol and LESLIE another waitress are waiting for their order at the cappuccino bar."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "She puts two hands lightly on his waist to move him out of the way and he gulps at the contact since no one else ever touches him but covers his selfconsciousness. She barks a mirthless though hearty laugh. If we could read Melvin which we cannot we would see him unsettled by the date talk. Vincent has instinctively put Simon on the defensive and Vincent's slackjawed expression changes as he feels an intellectual tingle to be having this conversation. There is a joy in him at this moment—a bit of purity. Carol and LESLIE another waitress are waiting for their order at the cappuccino bar."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "She places two feet firmly on the gate to lift it out of the path, and it whistles at the breeze, since nobody ever sees it, but hides its uniqueness. He chirps a cheerful yet silent giggle. If we could interpret Marvin, which we can't, we'd find him soothed by the weather chat. The two janitors wave their agreements as Marvin skips back into the garden shed, hovering near their swing, and his excitement swells in this haven. The Bird begins to agree. There is in Lucy's demeanor toward Marvin an element of curiosity—that she is the only one in the group who can puzzle him. She begins to tidy the room. Some sneaky alley-cat has tiptoed past her sturdy gate and momentarily puzzled her, and Marvin senses that he's ventured way too close. A pause, and then Marvin shrugs, barely blinking, backing away. He dances around, and Marvin observes him, chewing his top hat. He is above a YOUNGER, smarter OWL on the bedroom rug, each time shocking himself with his own silence and trying to amplify it. The Young Owl turns and stares at him, and gathering himself together, he wanders off down the staircase. He removes his glasses when he spots Lucy, then hears the sneeze. Lucy now enters her neighbor's den, which is a tribute to peaceful, dreamy nights, with two grocery-store humidifying fans, an air purifier (breathing contraption), a trash bin, a bookshelf filled with novels, a heart rate monitor, stacks of fifteen-year-old books, and a tiny radio squeezed into the narrow corner. Lucy pats its back, and then it sneezes, trying to stifle it. She picks up a trash bin as it sneezes again and she soothes it. It apologizes. As she exits the den, it is lighting a candle from a box, hides the candle, and resumes singing. Its paw pats her shoulder, then it pauses and examines its paw. He peers down and discovers a splash of rain he caught while patting her and then notices it staring at her with utter surprise. He chirps a giggle to hide his delight but tells the lie. Noticing the Artists, it leads the path back toward the library, humming away oblivious to Leonard arranging as he follows it and admiring the rustic cabin. He spins and notices the dressed statue as Leonard strides back to claim his jacket. Leonard is crafting awkwardly elegant gestures to the increasingly relaxed Max. Leonard has naturally put Max on the offensive, and Leonard’s wide-eyed gaze shifts as he experiences a physical shiver to be having this dialogue. There’s a calm in her at this point—a touch of clarity. Lucy and OLIVER, another janitor, are lingering for their delivery at the espresso stand."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A woman lightly pushes him by the waist, causing him unease since he's unaccustomed to touch, but he hides his discomfort. She laughs mirthlessly, and if we could read Melvin's mind, his discomfort with date talk would be clear. Two waitresses express disapproval as Melvin loiters near their table, and Carol feels a sense of self-satisfaction as she's the only one who can manage him. After a tense exchange, Melvin backs down. Carol, meanwhile, experiences a personal moment under a younger man but pulls herself together. She visits her son in a room cluttered with medical equipment, comforts him after he vomits, and later returns to find the young man resuming their previous intimacy, oblivious to the incident. Vincent, at the studio, is seen posing provocatively, catching Simon off-guard, but Simon finds an intellectual thrill in their interaction. Back at the cappuccino bar, Carol and another waitress, Leslie, wait for their order."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Carol and LESLIE another waitress are waiting for their order at the cappuccino bar There is a joy in him at this moment—a bit of purity Vincent has instinctively put Simon on the defensive and Vincent's slackjawed expression changes as he feels an intellectual tingle to be having this conversation Vincent is striking blatantly sexual poses to the increasingly uneasy Simon He turns and sees the naked model as Vincent moves back to retrieve his clothes Vincent is disrobing as he follows him and eyeing the expensive apartment Seeing the Hustlers he leads the way back toward the studio chatting away unaware that She barks a laugh to cover her embarrassment but speaks the truth She looks down and sees a bit of throwup he picked up while feeling her and then notices him looking at her with extreme distaste His hand squeezes her breast then he stops and looks at his hand As she reenters the living room he is taking a cigarette from a pack palms the cigarette and resumes making out He apologizes She brings up a waste basket as he throws up and she comforts him Carol feels his head and then he coughs trying to suppress it Carol now goes into her son's room which is a monument to horrible sleepless nights with two drugstore dehumidifying filters a nebulizer breathing contraption a waste basket a nightstand filled with medicine a blood pressure kit stacks of sevenyearold toys and a small TV wedged into the tiny space She takes off her headphones when she sees Carol then hears the cough she goes off down the hallway The Young Man stops and looks at her and pulling herself together She is underneath a YOUNGER cuter MAN on the living room sofa each time startling herself with her own noise and trying to reign it in She walks away and Melvin watches her biting his lower lip A beat and then Melvin nods hardly breathing backing down Some crazy streetfreak has slipped under her perfect guard and momentarily devastated her and Melvin senses that he is gone way too far She starts to clear the table There is in Carol's attitude toward Melvin some ingredient of selfsatisfaction—that she is the only one in the place who can handle him The Woman starts to protest The two waitresses signal their protests as Melvin walks back into the restaurant proper hanging near their table and his discomfort builds in this limbo If we could read Melvin which we cannot we would see him unsettled by the date talk She barks a mirthless though hearty laugh She puts two hands lightly on his waist to move him out of the way and he gulps at the contact since no one else ever touches him but covers his selfconsciousness"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "She barks a mirthless though hearty laugh She puts two hands lightly on his waist to move him out of the way and he gulps at the contact since no one else ever touches him but covers his selfconsciousness The two waitresses signal their protests as Melvin walks back into the restaurant proper hanging near their table and his discomfort builds in this limbo If we could read Melvin which we cannot we would see him unsettled by the date talk There is in Carol's attitude toward Melvin some ingredient of selfsatisfaction—that she is the only one in the place who can handle him The Woman starts to protest Some crazy streetfreak has slipped under her perfect guard and momentarily devastated her and Melvin senses that he is gone way too far She starts to clear the table She walks away and Melvin watches her biting his lower lip A beat and then Melvin nods hardly breathing backing down The Young Man stops and looks at her and pulling herself together She is underneath a YOUNGER cuter MAN on the living room sofa each time startling herself with her own noise and trying to reign it in She takes off her headphones when she sees Carol then hears the cough she goes off down the hallway Carol feels his head and then he coughs trying to suppress it Carol now goes into her son's room which is a monument to horrible sleepless nights with two drugstore dehumidifying filters a nebulizer breathing contraption a waste basket a nightstand filled with medicine a blood pressure kit stacks of sevenyearold toys and a small TV wedged into the tiny space He apologizes She brings up a waste basket as he throws up and she comforts him His hand squeezes her breast then he stops and looks at his hand As she reenters the living room he is taking a cigarette from a pack palms the cigarette and resumes making out She barks a laugh to cover her embarrassment but speaks the truth She looks down and sees a bit of throwup he picked up while feeling her and then notices him looking at her with extreme distaste Vincent is disrobing as he follows him and eyeing the expensive apartment Seeing the Hustlers he leads the way back toward the studio chatting away unaware that Vincent is striking blatantly sexual poses to the increasingly uneasy Simon He turns and sees the naked model as Vincent moves back to retrieve his clothes There is a joy in him at this moment—a bit of purity Vincent has instinctively put Simon on the defensive and Vincent's slackjawed expression changes as he feels an intellectual tingle to be having this conversation Carol and LESLIE another waitress are waiting for their order at the cappuccino bar"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Carol feels his head and then he coughs trying to suppress it She brings up a waste basket as he throws up and she comforts him He apologizes As she reenters the living room he is taking a cigarette from a pack palms the cigarette and resumes making out His hand squeezes her breast then he stops and looks at his hand She looks down and sees a bit of throwup he picked up while feeling her and then notices him looking at her with extreme distaste She barks a laugh to cover her embarrassment but speaks the truth Seeing the Hustlers he leads the way back toward the studio chatting away unaware that Vincent is disrobing as he follows him and eyeing the expensive apartment He turns and sees the naked model as Vincent moves back to retrieve his clothes Vincent is striking blatantly sexual poses to the increasingly uneasy Simon Vincent has instinctively put Simon on the defensive and Vincent's slackjawed expression changes as he feels an intellectual tingle to be having this conversation There is a joy in him at this moment—a bit of purity Carol and LESLIE another waitress are waiting for their order at the cappuccino bar She puts two hands lightly on his waist to move him out of the way and he gulps at the contact since no one else ever touches him but covers his selfconsciousness She barks a mirthless though hearty laugh If we could read Melvin which we cannot we would see him unsettled by the date talk The two waitresses signal their protests as Melvin walks back into the restaurant proper hanging near their table and his discomfort builds in this limbo The Woman starts to protest There is in Carol's attitude toward Melvin some ingredient of selfsatisfaction—that she is the only one in the place who can handle him She starts to clear the table Some crazy streetfreak has slipped under her perfect guard and momentarily devastated her and Melvin senses that he is gone way too far A beat and then Melvin nods hardly breathing backing down She walks away and Melvin watches her biting his lower lip She is underneath a YOUNGER cuter MAN on the living room sofa each time startling herself with her own noise and trying to reign it in The Young Man stops and looks at her and pulling herself together she goes off down the hallway She takes off her headphones when she sees Carol then hears the cough Carol now goes into her son's room which is a monument to horrible sleepless nights with two drugstore dehumidifying filters a nebulizer breathing contraption a waste basket a nightstand filled with medicine a blood pressure kit stacks of sevenyearold toys and a small TV wedged into the tiny space"
        }
      ]
    }
  ]
}