{
  "ground_truth": "The camera pulls up from the Bailey home and travels up through the sky until it is above the falling snow and moving slowly toward a firmament full of stars. As the camera stops, heavenly voices are heard, and as each voice is heard, one of the stars twinkles brightly. A small star flies in from the left of the screen, stops, and twinkles as Clarence speaks. The stars fade out from the screen, and a light, indistinguishable blur is seen, which slowly begins to take form. We see a group of young boys on top of a snow-covered hill preparing to slide down on large shovels. One of them makes the slide and shoots out onto the ice of a frozen river at the bottom of the hill, where George Bailey is at the bottom of the slide. As each boy comes down, the others applaud, and there is a series of shots as four or five boys make the slide down the hill and out onto the ice. On top of the hill, Harry makes his slide very fast, passing the marks made by the other boys, and his shovel takes him onto the thin ice at the bend of the river. The ice breaks, and Harry disappears into the water. George jumps into the water and grabs Harry, and as he starts to pull him out, he yells. The other boys lie flat on the ice, forming a human chain, and when George reaches the edge with Harry in his arms, they pull them both to safety. Five or six boys are coming toward the camera, arm in arm, whistling, and their attention is drawn to an elaborate horsedrawn carriage proceeding down the other side of the street, in which we catch a glimpse of an elderly man riding. The boys continue until they reach Gower's drugstore, which is old-fashioned and dignified, with jars of colored water in the windows and little else. As the kids stop, George comes in and crosses to an old-fashioned cigar lighter on the counter, shuts his eyes and makes a wish, clicks the lighter, and the flame springs up. George crosses over to the soda fountain, where Mary Hatch, a small girl, is seated, watching him, and goes on to get his apron from behind the fountain. Mr. Gower, the druggist, peers from a window in the back room and is seen taking a drink from a bottle. Violet Bick enters the drugstore and sits on one of the stools at the fountain. George is behind the soda fountain putting on his apron, and Violet, who is the same height and age as Mary but infinitely older in her approach to people, observes him.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The camera lifts up from the Bailey residence and journeys up through the atmosphere until it is above the descending snow and moving slowly toward a vault full of stars. As the camera halts, celestial voices are detected, and as each voice is perceived, one of the stars glimmers brightly. A small star soars in from the left of the screen, stops, and glimmers as Clarence speaks. The stars vanish from the screen, and a light, indistinct blur is observed, which slowly begins to take shape. We see a cluster of young boys atop a snow-covered incline preparing to glide down on large spades. One of them makes the glide and shoots out onto the ice of a frozen stream at the bottom of the slope, where George Bailey is at the bottom of the glide. As each boy descends, the others cheer, and there is a sequence of shots as four or five boys make the glide down the hill and out onto the ice. On top of the hill, Harry makes his glide very fast, surpassing the marks created by the other boys, and his spade takes him onto the fragile ice at the turn of the river. The ice fractures, and Harry vanishes into the water. George leaps into the water and seizes Harry, and as he begins to pull him out, he shouts. The other boys lie flat on the ice, forming a human chain, and when George reaches the brink with Harry in his arms, they pull them both to safety. Five or six boys are approaching the camera, arm in arm, whistling, and their attention is attracted to an ornate horsedrawn carriage proceeding down the other side of the road, in which we catch a glimpse of an elderly gentleman riding. The boys continue until they reach Gower's pharmacy, which is old-fashioned and dignified, with jars of colored liquid in the windows and little else. As the kids stop, George enters and crosses to an old-fashioned cigar lighter on the counter, shuts his eyes and makes a wish, clicks the lighter, and the flame leaps up. George crosses over to the soda fountain, where Mary Hatch, a small girl, is seated, observing him, and goes on to retrieve his apron from behind the fountain. Mr. Gower, the pharmacist, peers from a window in the back room and is seen taking a drink from a bottle. Violet Bick enters the pharmacy and sits on one of the stools at the fountain. George is behind the soda fountain putting on his apron, and Violet, who is the same height and age as Mary but immeasurably older in her approach to people, watches him."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The Bailey home is pulled up from by the camera, and the sky is traveled up through by it until the falling snow is above and a firmament full of stars is slowly moved toward. As the camera is stopped, heavenly voices hear, and a star is twinkled brightly by each heard voice. Clarence speaks while a small star is flown in from the left of the screen, stopped, and twinkled. The stars fade out from the screen, and an indistinguishable blur of light is seen, which slowly begins to take form. On top of a snow-covered hill, a group of young boys is seen preparing to slide down on large shovels. The slide is made by one of them, who shoots out onto the ice of a frozen river at the bottom of the hill, where George Bailey waits at the bottom of the slide. As each boy is applauded by the others, a series of shots shows four or five boys making the slide down the hill and out onto the ice. Harry makes his slide very fast on top of the hill, passing the marks made by the other boys, and the thin ice at the bend of the river is taken onto by his shovel. The ice is broken, and Harry disappears into the water. The water is jumped into by George, who grabs Harry, and as Harry is pulled out by him, he yells. The other boys lie flat on the ice, forming a human chain, and when the edge is reached by George with Harry in his arms, they pull them both to safety. The camera is approached by five or six boys, arm in arm, whistling, and their attention is drawn to an elaborate horsedrawn carriage proceeding down the other side of the street, in which an elderly man is briefly seen riding. Until Gower's drugstore is reached by them, which is old-fashioned and dignified, with jars of colored water in the windows and little else, the boys continue. As the kids stop, George enters and crosses to an old-fashioned cigar lighter on the counter, his eyes are shut, and a wish is made, and the lighter is clicked until the flame springs up. George crosses over to the soda fountain, where Mary Hatch, a small girl, is seated, watching him, and his apron is fetched from behind the fountain. Mr. Gower, the druggist, peers from a window in the back room and takes a drink from a bottle. Violet Bick enters the drugstore and sits on one of the stools at the fountain. Behind the soda fountain, George is putting on his apron, and Violet, who is the same height and age as Mary but approaches people infinitely older, observes him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The camera moves from the Bailey home through the sky, above the snow, toward a star-filled sky. As it stops, heavenly voices are heard, and each voice makes a star twinkle. A small star flies in, twinkles as Clarence speaks, and then stars fade to reveal a blur that forms into a scene of young boys on a snowy hill ready to slide down on shovels. One boy slides onto a frozen river where George Bailey waits. As each boy slides, others cheer. Harry slides fast past the others' marks and onto thin ice, which breaks, causing him to fall in. George jumps in, grabs Harry, and shouts. The other boys form a human chain to pull them to safety. The boys then walk arm in arm, drawn to a horsedrawn carriage with an elderly man inside. They stop at Gower's drugstore, traditional with jars of colored water in its windows. Inside, George makes a wish at a cigar lighter. He heads to the soda fountain, observed by Mary Hatch, a young girl. Mr. Gower, the druggist, is seen drinking in the back room. Violet Bick enters and sits at the fountain, watching George as he puts on his apron. Violet is the same age and height as Mary but more mature in demeanor."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The camera moves from the Bailey home up through the sky, passing the snow and stars. Heavenly voices are heard, and each voice makes a star twinkle. A small star appears, twinkles, and Clarence speaks. The stars vanish, revealing a blurred scene that forms into boys on a snow-covered hill sliding on shovels. George Bailey is at the bottom, where boys applaud each other. Harry slides fast, breaks through the thin ice, and falls into the river. George rescues Harry, and the others form a human chain to pull them to safety. The boys walk arm in arm, noticing a horse-drawn carriage with an elderly man. They reach Gower's drugstore with colored jars in the windows. George enters, makes a wish at a cigar lighter, and goes to the soda fountain, watched by Mary Hatch, a small girl. Mr. Gower, the druggist, peers from a window, drinking from a bottle. Violet Bick joins, sitting at the fountain, observing George from a mature perspective."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The camera gracefully pulls up from the cozy and inviting Bailey home, embarking on a journey through the vast sky until it rises above the gently falling snow. It continues to ascend, moving slowly and steadily toward a celestial firmament filled with countless shimmering stars. As the camera ceases its movement, heavenly voices begin to resonate through the air, and with each distinct voice, one of the stars in the firmament twinkles brightly, illuminating the vast expanse of the universe. Suddenly, a small, luminous star enters the scene from the left side of the screen, halts in its path, and twinkles brightly as Clarence's voice is heard speaking. Gradually, the stars fade away from the screen, transitioning into a light, indistinct blur that slowly begins to materialize and take shape. \n\nWe are introduced to a group of young boys perched atop a snow-covered hill, eagerly preparing to embark on an exhilarating slide down using large shovels as makeshift sleds. One of the boys takes the lead, making the thrilling slide down the hill and shooting out onto the frozen surface of a river at the hill's base, where George Bailey is positioned at the end of the slide. As each boy journeys down the hill, the others cheer and applaud enthusiastically, and we are presented with a sequence of shots capturing four or five boys making their exhilarating descent down the slope and out onto the ice. At the hill's summit, Harry embarks on his slide with great speed, surpassing the marks made by the other boys. His shovel carries him onto a patch of thin ice located at a bend in the river. The fragile ice gives way, and Harry vanishes into the chilly water below. Demonstrating quick thinking and bravery, George quickly plunges into the water, grabs hold of Harry, and as he begins to pull him out, he shouts urgently for help. The other boys, displaying unity and teamwork, lie flat on the ice, forming a human chain, and when George reaches the edge with Harry safely in his arms, they pull both boys to safety triumphantly.\n\nA group of five or six boys approaches the camera, walking arm in arm, whistling cheerfully, when their attention is caught by an elaborate, dignified horsedrawn carriage moving down the opposite side of the street. Inside the carriage, a glimpse of an elderly man riding can be seen, adding an element of intrigue and curiosity to the scene. The boys continue on their merry way until they arrive at Gower's drugstore, an establishment with an old-fashioned and dignified air, displaying jars of vibrantly colored water in its windows and little else to distract from its classic charm. As the group of kids comes to a stop, George enters the store, making his way over to an old-fashioned cigar lighter that sits on the counter. He closes his eyes, makes a wish, and with a click, the lighter springs to life with a small flame. George then moves over to the soda fountain, where Mary Hatch, a petite girl with a keen gaze, is seated, watching him intently. He proceeds to retrieve his apron from behind the fountain. Meanwhile, Mr. Gower, the druggist, peers through a window in the back room, caught in the act of taking a drink from a bottle. Violet Bick makes her entrance into the drugstore, taking a seat on one of the stools at the fountain. As George stands behind the soda fountain, donning his apron, Violet, who shares Mary's height and age yet possesses an air of worldly maturity in her interactions with people, observes him keenly."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The camera, with a graceful and fluid motion, pulls away and upward from the warm and inviting Bailey home, setting out on a captivating journey through the vast and boundless sky. It continues its ascent until it is high above the gently falling snowflakes that blanket the world below. This ascent is slow, measured, and deliberate, as it moves ever upward toward a celestial tapestry of endless night, filled to the brim with countless shimmering stars that twinkle in the cosmic expanse. As the camera finally comes to a halt and ceases its steady movement, heavenly and ethereal voices begin to resonate melodically through the air. Each distinct voice corresponds with the twinkling of one particular star in this magnificent firmament, each one brightly illuminating the wide expanse of the universe with its own unique glow. Abruptly and unexpectedly, a small, luminous star makes its entrance onto the scene from the left side of the screen. This star halts in its path and twinkles with added brightness just as Clarence's voice is heard speaking. Gradually, the multitude of stars recedes and fades from the screen, transitioning seamlessly into a light, indistinct blur that slowly starts to materialize and take on solid shape.\n\nAt this moment, we are introduced to a group of young boys who are perched eagerly atop a snow-covered hill. They are filled with excitement, preparing to embark on a thrilling, exhilarating slide down the slope, using large shovels as makeshift sleds in place of traditional ones. One adventurous boy takes the lead, making the exhilarating slide down the snowy hill and shooting out onto the frozen surface of a river located at the hill's base, where George Bailey is situated, ready and waiting at the end of the slide. As each boy makes his journey sliding down the hill, their companions cheer and applaud with enthusiasm, and we are treated to a delightful sequence of shots that capture four or five boys making their exciting descent down the snowy slope and onto the ice below. At the summit of the hill, Harry embarks on his slide with remarkable speed, surpassing the marks etched into the snow by the other boys before him. His shovel carries him out onto a treacherous patch of thin ice situated at a bend in the river. The fragile ice gives way under his weight, and Harry disappears into the frigid waters below. Demonstrating quick thinking, courage, and bravery, George instantly plunges into the icy water, grabbing hold of Harry. As he begins to pull him out from the watery depths, he shouts urgently, calling for assistance. The other boys, displaying an admirable sense of unity, cooperation, and teamwork, lie flat on the ice, forming a human chain. When George finally reaches the safety of the edge with Harry securely in his arms, they triumphantly pull both boys to safety.\n\nA group of five or six lively boys approaches the camera, walking jovially arm in arm, and whistling cheerfully. Their attention is soon captured by an elaborate and dignified horse-drawn carriage making its way down the opposite side of the street. Inside the carriage, an intriguing glimpse of an elderly man riding is visible, adding an air of mystery and curiosity to the unfolding scene. The boys continue on their merry and carefree way until they arrive at Gower's drugstore, an establishment that exudes an old-fashioned, dignified air. The storefront proudly displays jars filled with vibrantly colored water in its windows, with little else to distract from its classic charm. As the group of excited kids comes to a halt, George enters the store, making his way over to an old-fashioned cigar lighter that sits prominently on the counter. He closes his eyes, making a heartfelt wish, and with a decisive click, the lighter springs to life with a small, flickering flame. George then moves over to the soda fountain, where Mary Hatch, a petite girl with an intensely keen gaze, is seated, watching him intently from her perch. He proceeds to retrieve his apron from behind the counter of the fountain. Meanwhile, Mr. Gower, the druggist, watches George through a window in the back room, caught in the act of taking a drink from a bottle. Violet Bick makes her entrance into the drugstore, taking a seat on one of the stools at the fountain. As George stands behind the soda fountain, donning his apron, Violet, who shares Mary's height and age yet possesses an air of worldly maturity in her interactions with people, observes him with keen interest."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The camera gradually ascends from the Bailey home, its lens shifting upward through the sky, soaring above the gently falling snow until it reaches a celestial expanse filled with glistening stars. As the camera comes to a halt in this heavenly realm, ethereal voices begin to resonate, with each voice causing one of the stars to shimmer brightly in response. A diminutive star suddenly enters the frame from the left, pausing to twinkle as Clarence’s voice becomes audible. As his words echo, the stars softly vanish from the screen, transitioning to a vague and indistinct blur, which slowly starts to crystallize into a clearer image. We then witness a group of young boys gathered atop a snow-laden hill, eagerly readying themselves to slide down using large shovels. One of the boys takes the plunge, swiftly gliding down the slope and shooting out onto the frozen surface of the river at the hill’s base, where George Bailey awaits at the slide’s end. As each boy joyously descends, the others break into applause, creating a lively atmosphere, and a series of shots capture four or five boys as they gleefully slide down the hill and glide onto the ice. Meanwhile, at the hill’s crest, Harry embarks on his slide with remarkable speed, surpassing the marks left by his peers, but his shovel propels him onto a patch of thin ice at the river’s bend. The fragile ice gives way, and Harry is abruptly submerged in the frigid water. Reacting swiftly, George leaps into the water and seizes Harry, calling out as he begins the struggle to pull him from the icy depths. The other boys spread themselves flat on the ice to form a human chain, and as George reaches the riverbank with Harry cradled in his arms, they unite their efforts to tug both boys to safety. Now, with arms linked, five or six boys jovially advance toward the camera, whistling a carefree tune until their attention diverts to an ornate horsedrawn carriage making its way down the opposite side of the street, where they catch a fleeting glimpse of an elderly man riding within. The boys continue until they arrive at Gower's drugstore, an establishment that exudes an old-fashioned dignity, with its windows showcasing jars of vivid colored water and little else. As the group halts, George enters and strides over to an antique cigar lighter positioned on the counter. With deliberate intent, he shuts his eyes, makes a silent wish, and activates the lighter, causing a small flame to flicker to life. George then approaches the soda fountain, where Mary Hatch, a small girl, sits observing him intently, and proceeds to retrieve his apron from its position behind the counter. In the back room, Mr. Gower, the druggist, peers out from a window, briefly visible as he takes a drink from a bottle. Simultaneously, Violet Bick steps into the drugstore and perches herself on one of the stools at the fountain. Behind the counter, George dons his apron, while Violet—same in stature and age as Mary but far more mature in her interactions—casts an observant gaze upon him."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The camera ascends from the Bailey home, moving through the sky past the snow to a star-filled firmament. As it halts, heavenly voices echo, causing the stars to twinkle brightly, and a small star flies in and twinkles as Clarence speaks. The stars fade, revealing a blur that morphs into a group of young boys on a snow-covered hill, preparing to slide down on shovels. One by one, they slide onto the frozen river below, where George Bailey stands, met with applause from the others. Harry slides past previous marks, breaking through the thin ice at the river's bend. George jumps in to rescue him, and the other boys form a human chain to pull them both to safety. The boys, arm in arm, whistle as they walk down the street, noticing an elderly man in an elaborate horse-drawn carriage. They continue to Gower's old-fashioned and dignified drugstore, where George enters, makes a wish on a cigar lighter, and proceeds to the soda fountain. There, Mary Hatch observes him as he fetches his apron, while Mr. Gower, the druggist, sips from a bottle in the back room. Violet Bick, appearing older in demeanor despite her age, joins the scene, taking a seat at the fountain and watching George."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The camera pulls up from the Bailey home, a quaint residence located in the fictional town of Bedford Falls, and travels up through the sky until it is above the falling snow, characteristic of the region's cold winters, and moving slowly toward a firmament full of stars that seem to shimmer with the magic of the universe. As the camera stops, heavenly voices, symbolic of the angelic presences in the story, are heard, and as each voice is heard, one of the stars twinkles brightly. A small star, representing the arrival of a guardian angel, flies in from the left of the screen, stops, and twinkles as Clarence, a whimsical guardian angel aspiring to earn his wings, speaks. The stars fade out from the screen, and a light, indistinguishable blur is seen, which slowly begins to take form. We see a group of young boys on top of a snow-covered hill in Bedford Falls, known for its child-friendly outdoor spaces, preparing to slide down on large shovels, an activity common in the early 20th century due to limited access to sleds. One of them makes the slide and shoots out onto the ice of a frozen river, the town's popular local landmark for winter activities, at the bottom of the hill, where George Bailey is at the bottom of the slide. As each boy comes down, the others applaud, and there is a series of shots as four or five boys make the slide down the hill and out onto the ice. On top of the hill, Harry makes his slide very fast, passing the marks made by the other boys, and his shovel takes him onto the thin ice at the bend of the river. The ice breaks, and Harry disappears into the water, which is perilously cold and dangerous. George jumps into the water, demonstrating his lifelong courage and selflessness, and grabs Harry, and as he starts to pull him out, he yells. The other boys lie flat on the ice, forming a human chain, a common emergency tactic for ice rescues, and when George reaches the edge with Harry in his arms, they pull them both to safety. Five or six boys are coming toward the camera, arm in arm, whistling tunes popular at the time, and their attention is drawn to an elaborate horse-drawn carriage, a rare sight highlighting the era's transition to motor vehicles, proceeding down the other side of the street, in which we catch a glimpse of an elderly man riding, who is known to be a prominent local figure. The boys continue until they reach Gower's drugstore, which is old-fashioned and dignified, with jars of colored water in the windows that were once used to indicate the type of services offered inside, and little else. As the kids stop, George comes in and crosses to an old-fashioned cigar lighter on the counter, shuts his eyes and makes a wish, clicks the lighter, and the flame springs up. George crosses over to the soda fountain, a social hub for the youth of Bedford Falls, where Mary Hatch, a small girl with a budding affection for George, is seated, watching him, and goes on to get his apron from behind the fountain. Mr. Gower, the druggist, a respected yet troubled figure in the community, peers from a window in the back room and is seen taking a drink from a bottle, hinting at his personal struggles. Violet Bick enters the drugstore and sits on one of the stools at the fountain. George is behind the soda fountain putting on his apron, and Violet, who is the same height and age as Mary but infinitely older in her approach to people, observes him with a worldly curiosity."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "George crosses over to the soda fountain where Mary Hatch a small girl is seated watching him and goes on to get his apron from behind the fountain The camera pulls up from the Bailey home and travels up through the sky until it is above the falling snow and moving slowly toward a firmament full of stars A small star flies in from the left of the screen stops and twinkles as Clarence speaks George is behind the soda fountain putting on his apron and Violet who is the same height and age as Mary but infinitely older in her approach to people observes him As the camera stops heavenly voices are heard and as each voice is heard one of the stars twinkles brightly The stars fade out from the screen and a light indistinguishable blur is seen which slowly begins to take form Five or six boys are coming toward the camera arm in arm whistling and their attention is drawn to an elaborate horsedrawn carriage proceeding down the other side of the street in which we catch a glimpse of an elderly man riding As the camera stops heavenly voices are heard and as each voice is heard one of the stars twinkles brightly A small star flies in from the left of the screen stops and twinkles as Clarence speaks The stars fade out from the screen and a light indistinguishable blur is seen which slowly begins to take form We see a group of young boys on top of a snowcovered hill preparing to slide down on large shovels One of them makes the slide and shoots out onto the ice of a frozen river at the bottom of the hill where George Bailey is at the bottom of the slide As each boy comes down the others applaud and there is a series of shots as four or five boys make the slide down the hill and out onto the ice On top of the hill Harry makes his slide very fast passing the marks made by the other boys and his shovel takes him onto the thin ice at the bend of the river The ice breaks and Harry disappears into the water George jumps into the water and grabs Harry and as he starts to pull him out he yells Mr Gower the druggist peers from a window in the back room and is seen taking a drink from a bottle The other boys lie flat on the ice forming a human chain and when George reaches the edge with Harry in his arms they pull them both to safety Five or six boys are coming toward the camera arm in arm whistling and their attention is drawn to an elaborate horsedrawn carriage proceeding down the other side of the street in which we catch a glimpse of an elderly man riding The ice breaks and Harry disappears into the water The boys continue until they reach Gower's drugstore which is oldfashioned and dignified with jars of colored water in the windows and little else As the kids stop George comes in and crosses to an oldfashioned cigar lighter on the counter shuts his eyes and makes a wish clicks the lighter and the flame springs up George crosses over to the soda fountain where Mary Hatch a small girl is seated watching him and goes on to get his apron from behind the fountain Mr Gower the druggist peers from a window in the back room and is seen taking a drink from a bottle Violet Bick enters the drugstore and sits on one of the stools at the fountain The camera pulls up from the Bailey home and travels up through the sky until it is above the falling snow and moving slowly toward a firmament full of stars George is behind the soda fountain putting on his apron and Violet who is the same height and age as Mary but infinitely older in her approach to people observes him"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The camera pulls up from the Bailey home and travels up through the sky until it is above the falling snow and moving slowly toward a firmament full of stars. As the camera stops heavenly voices are heard and as each voice is heard one of the stars twinkles brightly. A small star flies in from the left of the screen stops and twinkles as Clarence speaks. The stars fade out from the screen and a light indistinguishable blur is seen which slowly begins to take form. We see a group of young boys on top of a snowcovered hill preparing to slide down on large shovels. One of them makes the slide and shoots out onto the ice of a frozen river at the bottom of the hill where George Bailey is at the bottom of the slide. As each boy comes down the others applaud and there is a series of shots as four or five boys make the slide down the hill and out onto the ice. On top of the hill Harry makes his slide very fast passing the marks made by the other boys and his shovel takes him onto the thin ice at the bend of the river. The ice breaks and Harry disappears into the water. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. George jumps into the water and grabs Harry and as he starts to pull him out he yells. The other boys lie flat on the ice forming a human chain and when George reaches the edge with Harry in his arms they pull them both to safety. Five or six boys are coming toward the camera arm in arm whistling and their attention is drawn to an elaborate horsedrawn carriage proceeding down the other side of the street in which we catch a glimpse of an elderly man riding. The boys continue until they reach Gower's drugstore which is oldfashioned and dignified with jars of colored water in the windows and little else. As the kids stop George comes in and crosses to an oldfashioned cigar lighter on the counter shuts his eyes and makes a wish clicks the lighter and the flame springs up. George crosses over to the soda fountain where Mary Hatch a small girl is seated watching him and goes on to get his apron from behind the fountain. Mr Gower the druggist peers from a window in the back room and is seen taking a drink from a bottle. Violet Bick enters the drugstore and sits on one of the stools at the fountain. George is behind the soda fountain putting on his apron and Violet who is the same height and age as Mary but infinitely older in her approach to people observes him."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The camera pulls up from the Bailey home and travels up through the sky until it is above the falling snow and moving slowly toward a firmament full of stars. As the camera stops heavenly voices are heard and as each voice is heard one of the stars twinkles brightly. A small star flies in from the left of the screen stops and twinkles as Clarence speaks. The stars fade out from the screen and a light indistinguishable blur is seen which slowly begins to take form. We see a group of young boys on top of a snowcovered hill preparing to slide down on large shovels. One of them makes the slide and shoots out onto the ice of a frozen river at the bottom of the hill where George Bailey is at the bottom of the slide. As each boy comes down the others applaud and there is a series of shots as four or five boys make the slide down the hill and out onto the ice. On top of the hill Harry makes his slide very fast passing the marks made by the other boys and his shovel takes him onto the thin ice at the bend of the river. The ice breaks and Harry disappears into the water. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. George jumps into the water and grabs Harry and as he starts to pull him out he yells. The other boys lie flat on the ice forming a human chain and when George reaches the edge with Harry in his arms they pull them both to safety. Five or six boys are coming toward the camera arm in arm whistling and their attention is drawn to an elaborate horsedrawn carriage proceeding down the other side of the street in which we catch a glimpse of an elderly man riding. The boys continue until they reach Gower's drugstore which is oldfashioned and dignified with jars of colored water in the windows and little else. As the kids stop George comes in and crosses to an oldfashioned cigar lighter on the counter shuts his eyes and makes a wish clicks the lighter and the flame springs up. George crosses over to the soda fountain where Mary Hatch a small girl is seated watching him and goes on to get his apron from behind the fountain. Mr Gower the druggist peers from a window in the back room and is seen taking a drink from a bottle. Violet Bick enters the drugstore and sits on one of the stools at the fountain. George is behind the soda fountain putting on his apron and Violet who is the same height and age as Mary but infinitely older in her approach to people observes him."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The camera pulls up from the Bailey home and travels up through the sky until it is above the falling snow and moving slowly toward a firmament full of stars. As the camera stops heavenly voices are heard and as each voice is heard one of the stars twinkles brightly. A small star flies in from the left of the screen stops and twinkles as Clarence speaks. The stars fade out from the screen and a light indistinguishable blur is seen which slowly begins to take form. We see a group of young boys on top of a snowcovered hill preparing to slide down on large shovels. George crosses over to the soda fountain where Mary Hatch a small girl is seated watching him and goes on to get his apron from behind the fountain. Mr Gower the druggist peers from a window in the back room and is seen taking a drink from a bottle. Violet Bick enters the drugstore and sits on one of the stools at the fountain. George is behind the soda fountain putting on his apron and Violet who is the same height and age as Mary but infinitely older in her approach to people observes him."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The camera pulls up from the Bailey home and travels up through the sky until it is above the falling snow and moving slowly toward a firmament full of stars. As the camera stops heavenly voices are heard and as each voice is heard one of the stars twinkles brightly. Violet Bick enters the drugstore and sits on one of the stools at the fountain. George is behind the soda fountain putting on his apron and Violet who is the same height and age as Mary but infinitely older in her approach to people observes him."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The camera pulls up from the Smith home and travels up through the sky until it is above the falling snow and moving slowly toward a firmament full of stars. As the camera stops, heavenly voices are heard, and as each voice is heard, one of the stars twinkles brightly. A small star flies in from the left of the screen, stops, and twinkles as Oliver speaks. The stars fade out from the screen, and a light, indistinguishable blur is seen, which slowly begins to take form. We see a group of young penguins on top of a snow-covered hill preparing to slide down on large shovels. One of them makes the slide and shoots out onto the ice of a frozen river at the bottom of the hill, where Sally Thompson is at the bottom of the slide. As each penguin comes down, the others applaud, and there is a series of shots as four or five penguins make the slide down the hill and out onto the ice. On top of the hill, Alex makes his slide very fast, passing the marks made by the other penguins, and his shovel takes him onto the thin ice at the bend of the river. The ice breaks, and Alex disappears into the water. Sally jumps into the water and grabs Alex, and as she starts to pull him out, she yells. The other penguins lie flat on the ice, forming a human chain, and when Sally reaches the edge with Alex in her arms, they pull them both to safety. Five or six penguins are coming toward the camera, arm in arm, whistling, and their attention is drawn to an elaborate horsedrawn carriage proceeding down the other side of the street, in which we catch a glimpse of an elderly giraffe riding. The penguins continue until they reach Harper's drugstore, which is old-fashioned and dignified, with jars of colored water in the windows and little else. As the penguins stop, Sally comes in and crosses to an old-fashioned cigar lighter on the counter, shuts her eyes and makes a wish, clicks the lighter, and the flame springs up. Sally crosses over to the soda fountain, where Emily Jones, a small cat, is seated, watching her, and goes on to get her apron from behind the fountain. Ms. Harper, the druggist, peers from a window in the back room and is seen taking a drink from a bottle. Lucy Grey enters the drugstore and sits on one of the stools at the fountain. Sally is behind the soda fountain putting on her apron, and Lucy, who is the same height and age as Emily but infinitely older in her approach to people, observes her."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The camera pulls up from the Bailey estate and travels up through the atmosphere until it is above the drifting leaves and moving slowly toward a galaxy full of comets. As the camera stops, celestial voices are heard, and as each voice is heard, one of the comets flares brightly. A tiny comet flies in from the left of the screen, stops, and flares as Clarence speaks. The comets fade out from the screen, and a light, indistinguishable mist is seen, which slowly begins to take form. We see a group of young boys on top of a sand-covered dune preparing to slide down on large planks. One of them makes the slide and shoots out onto the grass of a sunlit meadow at the bottom of the dune, where George Bailey is at the bottom of the slide. As each boy comes down, the others applaud, and there is a series of shots as four or five boys make the slide down the dune and out onto the grass. On top of the dune, Harry makes his slide very fast, passing the marks made by the other boys, and his plank takes him onto the loose sand at the bend of the meadow. The sand gives way, and Harry disappears into the ground. George jumps into the ground and grabs Harry, and as he starts to pull him out, he yells. The other boys lie flat on the grass, forming a human chain, and when George reaches the edge with Harry in his arms, they pull them both to safety. Five or six boys are coming toward the camera, arm in arm, whistling, and their attention is drawn to an elaborate bicycle procession proceeding down the other side of the path, in which we catch a glimpse of an elderly man riding. The boys continue until they reach Gower's bakery, which is old-fashioned and dignified, with baskets of colored fruit in the windows and little else. As the kids stop, George comes in and crosses to an old-fashioned candlestick holder on the counter, shuts his eyes and makes a wish, clicks the holder, and the candle springs up. George crosses over to the candy counter, where Mary Hatch, a small girl, is seated, watching him, and goes on to get his hat from behind the counter. Mr. Gower, the baker, peers from a window in the back room and is seen taking a drink from a mug. Violet Bick enters the bakery and sits on one of the stools at the counter. George is behind the candy counter putting on his hat, and Violet, who is the same height and age as Mary but infinitely older in her approach to people, observes him."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The camera drifts over the Bailey home and ascends through the sky until it is above the drifting snow and meandering slowly toward a canopy full of stars. As the camera pauses, celestial voices are noticed, and as each voice is heard, one of the stars flickers softly. A small star glides in from the left of the screen, pauses, and flickers as Clarence speaks. The stars dissolve from the screen, and a light, indistinct blur is witnessed, which gradually begins to shape. We observe a group of young boys on top of a snow-covered hill preparing to tumble down on large shovels. One of them attempts the descent and glides out onto the ice of a frozen river at the bottom of the hill, where George Bailey is waiting at the bottom of the slide. As each boy tumbles down, the others cheer, and there is a series of clips as four or five boys attempt the descent down the hill and out onto the ice. On top of the hill, Harry attempts his descent very quickly, surpassing the lines made by the other boys, and his shovel takes him onto the delicate ice at the curve of the river. The ice shatters, and Harry vanishes into the water. George plunges into the water and seizes Harry, and as he starts to hoist him out, he shouts. The other boys stretch out on the ice, forming a human chain, and when George nears the edge with Harry in his arms, they tug them both to safety. Five or six boys are advancing toward the camera, arm in arm, humming, and their focus is attracted to an elaborate horsedrawn carriage traveling down the opposite side of the street, in which we catch a glimpse of an elderly man seated. The boys continue until they approach Gower's drugstore, which is quaint and dignified, with jars of colored water in the windows and little else. As the kids halt, George steps in and moves to an old-fashioned cigar lighter on the counter, closes his eyes and makes a wish, taps the lighter, and the flame ignites. George moves over to the soda fountain, where Mary Hatch, a small girl, is perched, observing him, and proceeds to retrieve his apron from behind the fountain. Mr. Gower, the druggist, peers through a window in the back room and is seen sipping from a bottle. Violet Bick enters the drugstore and perches on one of the stools at the fountain. George is behind the soda fountain adjusting his apron, and Violet, who is the same height and age as Mary but remarkably older in her demeanor, studies him."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The squirrel yanks away from the Turner window and sails off through the ocean until it is below the floating feathers and drifting slowly toward a tapestry full of clouds. As the squirrel halts, earthly bells are heard, and as each bell is heard, one of the clouds glows faintly. A large cloud hops in from the right of the map, halts, and glows as Roger whispers. The clouds fade out from the map, and a shadowy, distinguishable mist is noticed, which quickly begins to dissolve. We observe a band of elderly girls beneath a sand-laden dune preparing to fly up on small envelopes. One of them makes the fly and floats up into the clay of a boiled pond at the top of the dune, where Sylvia Turner is at the top of the fly. As each girl floats up, the others cheer, and there is a series of shots as four or five girls make the fly up the dune and into the clay. Beneath the dune, Lucy makes her fly very slowly, missing the marks left by the other girls, and her envelope takes her into the thick clay at the curve of the pond. The clay solidifies, and Lucy reappears from the air. Sylvia leaps from the air and loses Lucy, and as she begins to push her in, she whispers. The other girls stand upright in the clay, forming a floral chain, and when Sylvia reaches the edge without Lucy in her pockets, they push them both into danger. Five or six girls are departing from the squirrel, hand in hand, singing, and their gaze is diverted to a minimal oxen-pulled wagon retreating up the same side of the road, in which we lose a look of a young woman swimming. The girls depart before they pass Walter's park, which is new-age and unsophisticated, with boxes of black sand in the ceilings and much more. Before the folks leave, Sylvia steps out and wanders to a new-age stamp extinguisher under the table, opens her mouth and earns a curse, chimes the extinguisher, and the smoke falls down. Sylvia wanders away from the juice lake, where Frank Drew, a tall woman, is standing, ignoring her, and goes off to lose her backpack from in front of the lake. Mr. Walter, the banker, hides behind a wall in the front yard and is lost leaving a sip from a cup. Violet Talon exits the park and stands on one of the benches by the lake. Sylvia is in front of the juice lake removing her backpack, and Violet, who is the same weight and time as Frank but slightly younger in her avoidance of animals, neglects her."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The drone zooms away from the Smith residence and drifts through the ocean until it is above the rolling waves and floating steadily toward a blanket full of clouds. As the drone pauses, mystical whispers are perceived, and as each whisper is perceived, one of the clouds flashes brightly. A tiny cloud glides in from the right of the screen, stops, and flashes as Terrence sings. The clouds dissolve off the screen, and a shadowy, indistinct fog is seen, which gradually starts to materialize. We observe a gathering of young squirrels atop a grassy hill poised to hop down on large acorns. One of them makes the hop and glides out onto the grass of a lush meadow at the base of the hill, where Sam Smith is at the base of the hop. As each squirrel glides down, the others cheer, and there is a series of shots as four or five squirrels make the hop down the hill and out onto the grass. Atop the hill, Timmy makes his hop very swiftly, surpassing the dents made by the other squirrels, and his acorn takes him onto the soft mud at the curve of the meadow. The mud yields, and Timmy vanishes into the puddle. Sam leaps into the puddle and grips Timmy, and as he starts to tug him out, he exclaims. The other squirrels lie flat on the grass, forming a furry chain, and when Sam arrives at the edge with Timmy in his grasp, they tug them both to safety. Five or six squirrels are scampering toward the drone, paw in paw, chirping, and their focus is drawn to a grand horsedrawn sleigh proceeding up the other side of the street, in which we catch a glimpse of an ancient woman reclining. The squirrels continue until they arrive at Stewart's bakery, which is vintage and stately, with jars of pickled fruit in the windows and little else. As the critters pause, Sam enters and strolls to an antique candle on the counter, closes his eyes and makes a wish, strikes the match, and the wick ignites. Sam strolls over to the pastry counter, where Anne Marsh, a tiny squirrel, is perched, observing him, and continues to get his vest from behind the counter. Mr. Stewart, the baker, squints from a window in the storeroom and is seen pouring a cup of tea from a flask. Olivia Finch enters the bakery and perches on one of the stools at the counter. Sam is behind the pastry counter putting on his vest, and Olivia, who is the same size and age as Anne but vastly older in her manner toward others, regards him."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The camera swoops down from the Bailey home and glides through the ocean until it is beneath the swimming fish and floating slowly toward a canopy full of lanterns. As the camera halts, celestial melodies are sighted, and as each melody is sighted, one of the lanterns flickers dimly. A small lantern drifts in from the right of the view, halts, and flickers as Clarence sings. The lanterns vanish from the view, and a shadowy, indistinguishable shape is detected, which quickly starts to shift shape. We see a group of young cats on top of a grass-covered mound preparing to leap down on large plates. One of them makes the leap and glides out onto the grass of a green meadow at the base of the mound, where George Bailey is at the bottom of the leap. As each cat comes down, the others cheer, and there is a series of glimpses as four or five cats make the leap down the mound and out onto the grass. On top of the mound, Harry makes his leap very slow, bypassing the spots made by the other cats, and his plate slides him onto the soft grass at the edge of the meadow. The grass gives way, and Harry vanishes into the soil. George dives into the soil and catches Harry, and as he begins to push him out, he laughs. The other cats stretch flat on the grass, forming a feline chain, and when George reaches the border with Harry in his paws, they pull them both to stability. Five or six cats are approaching the camera, paw in paw, humming, and their focus is drawn to an ornate bicycle pedaling down the opposite side of the pathway, in which we glimpse an elderly cat riding. The cats proceed until they arrive at Gower's bakery, which is antique and refined, with jars of colored candy in the windows and little else. As the kittens stop, George enters and traverses to an antique candle lighter on the shelf, closes his eyes and makes a wish, snaps the lighter, and the wick ignites. George navigates over to the candy counter, where Mary Hatch, a small kitten, is perched, watching him, and goes on to fetch his apron from beneath the counter. Mr. Gower, the baker, peers from a curtain in the front room and is seen sipping from a glass. Violet Bick enters the bakery and perches on one of the chairs at the counter. George is behind the candy counter donning his apron, and Violet, who is the same height and age as Mary but vastly mature in her demeanor, examines him."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The giraffe tiptoes up from the Watson yurt and bounces up through the clouds until it is beneath the drifting petals and twirling gradually toward a constellation full of planets. As the giraffe halts, celestial drums are detected, and as each drum is detected, one of the planets flickers vividly. A tiny comet darts in from the right of the stage, pauses, and flickers as Roscoe whispers. The planets vanish from sight, and a shadowy, indistinct shape is perceived, which gently starts to assume structure. We notice a pack of small puppies atop a blossom-laden dune preparing to tumble down on massive spoons. One of them executes the tumble and darts out onto the chocolate of a melted pond at the base of the dune, where Jerry Watson is at the base of the tumble. As each puppy descends, the others cheer, and there is a sequence of frames as four or five puppies execute the tumble down the dune and out onto the chocolate. Atop the dune, Barry executes his tumble extremely swiftly, surpassing the etchings made by the other puppies, and his spoon carries him onto the thin chocolate at the curve of the pond. The chocolate splits, and Barry vanishes into the syrup. Jerry leaps into the syrup and snatches Barry, and as he commences to tug him out, he bellows. The other puppies lie stretched on the chocolate, forming an animal chain, and when Jerry nears the brim with Barry in his paws, they hoist them both to safety. Five or six puppies are ambling toward the giraffe, limb in limb, humming, and their focus is diverted to an ornate boattowed buggy gliding up the opposite edge of the avenue, in which we glimpse a wrinkled lady soaring. The puppies proceed until they arrive at Milton’s candy store, which is quaint and stately, with jars of striped marbles in the panes and almost nothing else. As the young ones halt, Jerry enters and glides to a quaint candle snuffer on the desk, closes his ears and utters a hope, flicks the snuffer, and the spark leaps up. Jerry glides over to the ice cream station, where Lucy Finch, a tiny rabbit, is positioned, observing him, and proceeds to retrieve his cap from beneath the station. Mr. Milton, the candymaker, squints from a portal in the front chamber and is perceived sipping from a flask. Violet Bloom strides into the candy store and perches on one of the stools at the station. Jerry is behind the ice cream station donning his cap, and Violet, who is the same stature and cycle as Lucy but vastly wiser in her demeanor to creatures, studies him."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The camera moves from the Bailey home to a star-filled sky, where heavenly voices are heard as stars twinkle. Clarence's voice comes from a small star that flies in, then fades out to a scene of young boys on a snowy hill. They slide down on shovels onto a frozen river, with George Bailey at the bottom. Harry slides too far onto thin ice, falls in, and George jumps in to save him. The boys form a human chain and pull them to safety. They head to Gower's drugstore, an old-fashioned place with colored jars in the windows. George makes a wish at a cigar lighter, then goes to the soda fountain where Mary Hatch watches him. Mr. Gower the druggist is seen drinking, and Violet Bick joins at the fountain, displaying a more mature demeanor compared to Mary."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "George is behind the soda fountain putting on his apron and Violet who is the same height and age as Mary but infinitely older in her approach to people observes him Violet Bick enters the drugstore and sits on one of the stools at the fountain Mr Gower the druggist peers from a window in the back room and is seen taking a drink from a bottle George crosses over to the soda fountain where Mary Hatch a small girl is seated watching him and goes on to get his apron from behind the fountain As the kids stop George comes in and crosses to an oldfashioned cigar lighter on the counter shuts his eyes and makes a wish clicks the lighter and the flame springs up The boys continue until they reach Gower's drugstore which is oldfashioned and dignified with jars of colored water in the windows and little else Five or six boys are coming toward the camera arm in arm whistling and their attention is drawn to an elaborate horsedrawn carriage proceeding down the other side of the street in which we catch a glimpse of an elderly man riding The other boys lie flat on the ice forming a human chain and when George reaches the edge with Harry in his arms they pull them both to safety George jumps into the water and grabs Harry and as he starts to pull him out he yells The ice breaks and Harry disappears into the water On top of the hill Harry makes his slide very fast passing the marks made by the other boys and his shovel takes him onto the thin ice at the bend of the river As each boy comes down the others applaud and there is a series of shots as four or five boys make the slide down the hill and out onto the ice One of them makes the slide and shoots out onto the ice of a frozen river at the bottom of the hill where George Bailey is at the bottom of the slide We see a group of young boys on top of a snowcovered hill preparing to slide down on large shovels The stars fade out from the screen and a light indistinguishable blur is seen which slowly begins to take form A small star flies in from the left of the screen stops and twinkles as Clarence speaks As the camera stops heavenly voices are heard and as each voice is heard one of the stars twinkles brightly The camera pulls up from the Bailey home and travels up through the sky until it is above the falling snow and moving slowly toward a firmament full of stars"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The ice breaks and Harry disappears into the water Five or six boys are coming toward the camera arm in arm whistling and their attention is drawn to an elaborate horsedrawn carriage proceeding down the other side of the street in which we catch a glimpse of an elderly man riding George crosses over to the soda fountain where Mary Hatch a small girl is seated watching him and goes on to get his apron from behind the fountain The camera pulls up from the Bailey home and travels up through the sky until it is above the falling snow and moving slowly toward a firmament full of stars The stars fade out from the screen and a light indistinguishable blur is seen which slowly begins to take form Mr Gower the druggist peers from a window in the back room and is seen taking a drink from a bottle The boys continue until they reach Gower's drugstore which is oldfashioned and dignified with jars of colored water in the windows and little else One of them makes the slide and shoots out onto the ice of a frozen river at the bottom of the hill where George Bailey is at the bottom of the slide As the kids stop George comes in and crosses to an oldfashioned cigar lighter on the counter shuts his eyes and makes a wish clicks the lighter and the flame springs up As the camera stops heavenly voices are heard and as each voice is heard one of the stars twinkles brightly On top of the hill Harry makes his slide very fast passing the marks made by the other boys and his shovel takes him onto the thin ice at the bend of the river A small star flies in from the left of the screen stops and twinkles as Clarence speaks As each boy comes down the others applaud and there is a series of shots as four or five boys make the slide down the hill and out onto the ice Violet Bick enters the drugstore and sits on one of the stools at the fountain George jumps into the water and grabs Harry and as he starts to pull him out he yells We see a group of young boys on top of a snowcovered hill preparing to slide down on large shovels The other boys lie flat on the ice forming a human chain and when George reaches the edge with Harry in his arms they pull them both to safety George is behind the soda fountain putting on his apron and Violet who is the same height and age as Mary but infinitely older in her approach to people observes him"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "George jumps into the water and grabs Harry and as he starts to pull him out he yells The other boys lie flat on the ice forming a human chain and when George reaches the edge with Harry in his arms they pull them both to safety Five or six boys are coming toward the camera arm in arm whistling and their attention is drawn to an elaborate horsedrawn carriage proceeding down the other side of the street in which we catch a glimpse of an elderly man riding The boys continue until they reach Gower's drugstore which is oldfashioned and dignified with jars of colored water in the windows and little else As the kids stop George comes in and crosses to an oldfashioned cigar lighter on the counter shuts his eyes and makes a wish clicks the lighter and the flame springs up George crosses over to the soda fountain where Mary Hatch a small girl is seated watching him and goes on to get his apron from behind the fountain Mr Gower the druggist peers from a window in the back room and is seen taking a drink from a bottle Violet Bick enters the drugstore and sits on one of the stools at the fountain George is behind the soda fountain putting on his apron and Violet who is the same height and age as Mary but infinitely older in her approach to people observes him The camera pulls up from the Bailey home and travels up through the sky until it is above the falling snow and moving slowly toward a firmament full of stars As the camera stops heavenly voices are heard and as each voice is heard one of the stars twinkles brightly A small star flies in from the left of the screen stops and twinkles as Clarence speaks The stars fade out from the screen and a light indistinguishable blur is seen which slowly begins to take form We see a group of young boys on top of a snowcovered hill preparing to slide down on large shovels One of them makes the slide and shoots out onto the ice of a frozen river at the bottom of the hill where George Bailey is at the bottom of the slide As each boy comes down the others applaud and there is a series of shots as four or five boys make the slide down the hill and out onto the ice On top of the hill Harry makes his slide very fast passing the marks made by the other boys and his shovel takes him onto the thin ice at the bend of the river The ice breaks and Harry disappears into the water"
        }
      ]
    }
  ]
}