{
  "ground_truth": "He waves as he exits through the door. A flaming plane crashes into the sea. George, behind the counter, is trying to quiet a crowd of people all clamoring for more ration points. George shouts. George, in the uniform of an air raid warden, is patrolling his beat. A man beside a lighted window pulls down the shade as George blows his whistle. George is helping load his old car with scrap paper. A wheelbarrow full of junk is being dumped onto a pile. It is a raw, gusty day, and his overcoat and muffler flap in the breeze. George is walking along the sidewalk reading a newspaper. Draped around one arm is a large Christmas wreath. Under his other arm are several more copies of the paper. George comes to where Ernie, the taxi driver, is standing on the sidewalk. The front page of the paper, the Bedford Falls Sentinel, has a subhead telling of a plan for a giant jubilee and parade, to be followed by a banquet, in honor of Commander Harry Bailey, U.S.N., on his way home from Washington after receiving the Congressional Medal of Honor. There's a large picture of President Truman pinning the coveted medal on Harry's bosom, in the midst of dignitaries, and a picture of the transport which Harry saved. Practically the whole front page is devoted to the story. Gower comes running across the street from his drugstore and joins them. Uncle Billy is walking along the street, humming happily to himself. The outer door opens and George enters. The offices are unchanged, still small-time and old-fashioned. Cousin Tilly and Cousin Eustace are talking on the phone. The same office force, albeit a few years older: Cousin Tilly and Cousin Eustace. Seated on a chair is a middle-aged man with a briefcase. Cousin Eustace has turned away from George and caught a glimpse of the man waiting in the chair. This is Carter, the bank examiner, come for his annual audit of the books of the Building and Loan. George gives the phone to Eustace, puts down his wreath, and goes over to Carter. They shake hands. Uncle Billy is filling out a deposit slip at one of the desks. He grabs the paper from Potter's hand. Uncle Billy folds Potter's paper over the envelope containing his money, and flings his final taunt at the old man. In a cold rage, Potter grabs his paper and wheels off toward his office. Uncle Billy smiles triumphantly and goes toward the deposit window with his deposit slip. Uncle Billy hands the bank book over. The teller opens it, starts to punch it with rubber stamps. Uncle Billy searches through every pocket he has. The teller, knowing the old man's vagaries, points to one of the numerous strings tied around his fingers.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He signals as he departs through the portal. A blazing aircraft plummets into the ocean. George, behind the kiosk, is attempting to soothe a throng of individuals all clamoring for additional ration vouchers. George yells. George, in the attire of an air raid guardian, is patrolling his route. A gentleman beside an illuminated pane pulls down the shade as George blows his whistle. George is assisting with loading his aged vehicle with scrap documents. A handcart full of debris is being dumped onto a heap. It is a raw, blustery day, and his topcoat and muffler flutter in the breeze. George is strolling along the pavement perusing a newspaper. Draped around one arm is a large Christmas garland. Under his other arm are several more editions of the paper. George arrives to where Ernie, the cab driver, is standing on the pavement. The front page of the paper, the Bedford Falls Sentinel, has a subhead reporting a scheme for a colossal celebration and procession, to be followed by a feast, in honor of Commander Harry Bailey, U.S.N., on his way home from Washington after receiving the Congressional Medal of Honor. There's a large image of President Truman affixing the coveted award on Harry's chest, amidst dignitaries, and a picture of the transport which Harry rescued. Practically the whole front page is dedicated to the article. Gower comes sprinting across the road from his pharmacy and joins them. Uncle Billy is strolling along the road, humming contentedly to himself. The outer portal opens and George enters. The offices are unchanged, still small-time and old-fashioned. Cousin Tilly and Cousin Eustace are conversing on the phone. The same office personnel, albeit a few years elder: Cousin Tilly and Cousin Eustace. Seated on a chair is a middle-aged gentleman with a briefcase. Cousin Eustace has turned away from George and caught a glimpse of the gentleman waiting in the chair. This is Carter, the bank examiner, come for his annual audit of the books of the Building and Loan. George gives the phone to Eustace, puts down his garland, and goes over to Carter. They shake hands. Uncle Billy is filling out a deposit slip at one of the desks. He seizes the paper from Potter's hand. Uncle Billy folds Potter's paper over the envelope containing his funds, and flings his final taunt at the old gentleman. In a cold fury, Potter seizes his paper and wheels off toward his office. Uncle Billy grins victoriously and goes toward the deposit window with his deposit slip. Uncle Billy hands the bank book over. The teller opens it, starts to punch it with rubber stamps. Uncle Billy searches through every pocket he has. The teller, knowing the old gentleman's peculiarities, points to one of the numerous strings tied around his fingers."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He is waved at as he exits through the door. The sea is crashed into by a flaming plane. George, behind the counter, tries to quiet a crowd of people all clamoring for more ration points. A shout is given by George. George, in the uniform of an air raid warden, patrols his beat. As George blows his whistle, the shade is pulled down by a man beside a lighted window. Scrap paper is being loaded into his old car by George. Someone dumps a wheelbarrow full of junk onto a pile. It is a raw, gusty day, and the breeze flaps his overcoat and muffler. The sidewalk is walked along by George as he reads a newspaper. Draped around one arm is a large Christmas wreath. Under his other arm, he carries several more copies of the paper. George comes to where Ernie, the taxi driver, stands on the sidewalk. The front page of the paper, the Bedford Falls Sentinel, tells of a plan for a giant jubilee and parade, to be followed by a banquet, in honor of Commander Harry Bailey, U.S.N., on his way home from Washington after receiving the Congressional Medal of Honor. President Truman is shown pinning the coveted medal on Harry's bosom, in the midst of dignitaries, and there is a picture of the transport which Harry saved. The story is devoted to practically the whole front page. Gower runs across the street from his drugstore and joins them. Uncle Billy walks along the street, humming happily to himself. The outer door opens and George enters. The unchanged offices, still small-time and old-fashioned, are observed. Cousin Tilly and Cousin Eustace talk on the phone. The same office force, albeit a few years older: Cousin Tilly and Cousin Eustace. A middle-aged man with a briefcase is seated on a chair. Cousin Eustace turns away from George and catches a glimpse of the man waiting in the chair. This man is Carter, the bank examiner, who has come for his annual audit of the books of the Building and Loan. The phone is given to Eustace by George, who puts down his wreath and goes over to Carter. They shake hands. A deposit slip is filled out by Uncle Billy at one of the desks. The paper is grabbed from Potter's hand by him. Uncle Billy folds Potter's paper over the envelope containing his money and flings his final taunt at the old man. Potter grabs his paper in a cold rage and wheels off toward his office. A triumphant smile spreads across Uncle Billy's face, and he goes toward the deposit window with his deposit slip. The bank book is handed over by Uncle Billy. It is opened by the teller, who starts to punch it with rubber stamps. Every pocket he has is searched by Uncle Billy. Knowing the old man's vagaries, the teller points to one of the numerous strings tied around his fingers."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He waves as he exits the door. A flaming plane crashes into the sea. Behind the counter, George tries to calm a crowd clamoring for more ration points. George, dressed as an air raid warden, patrols. A man beside a lit window lowers the shade as George blows his whistle. George helps load scrap paper into his old car. A wheelbarrow of junk is dumped onto a pile. On this raw, gusty day, his overcoat and muffler flaps in the breeze. George walks the sidewalk reading a newspaper, draped with a Christmas wreath and holding more paper copies. He meets Ernie, the taxi driver, on the sidewalk. The Bedford Falls Sentinel's front page features a subhead about a jubilee and parade, followed by a banquet, in honor of Commander Harry Bailey, U.S.N., returning home from Washington after receiving the Congressional Medal of Honor. Pictures show President Truman pinning the medal on Harry and the transport Harry saved. Gower joins them from his drugstore. Uncle Billy walks along, humming. George enters unchanged offices, small-time and old-fashioned. Cousins Tilly and Eustace, older, are on the phone. A middle-aged man with a briefcase is seated—Carter, the bank examiner, for his yearly audit. George hands the phone to Eustace, sets down his wreath, and greets Carter. Uncle Billy fills out a deposit slip at a desk, grabs Potter's paper, and folds it over his money envelope, taunting Potter. In a cold rage, Potter takes his paper and leaves. Uncle Billy, smiling triumphantly, goes to the deposit window, hands over his book. The teller starts stamping it as Uncle Billy searches his pockets. The teller, aware of the old man's habits, points to one of the strings on his fingers."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He waves as he exits. A flaming plane crashes into the sea. George, behind the counter, tries to quiet a crowd clamoring for ration points. In his air raid warden uniform, he patrols his beat. A man pulls down a shade as George blows his whistle. George helps load a car with scrap paper. Junk in a wheelbarrow is dumped onto a pile. On a raw, gusty day, his overcoat flaps in the breeze. George walks on the sidewalk, reading a newspaper, with a Christmas wreath on one arm and more papers under the other. He meets taxi driver Ernie. The Bedford Falls Sentinel features a jubilee for Commander Harry Bailey, with President Truman pinning a medal on Harry. Gower joins from his drugstore. Uncle Billy walks happily, humming. George enters unchanged offices. Cousins Tilly and Eustace talk on the phone. The same office team, older now. Carter, a bank examiner, waits. George gives Eustace the phone and greets Carter. Uncle Billy fills a deposit slip, grabs Potter's paper, wraps it around his envelope, taunts Potter, then goes to the deposit window. The teller starts to stamp the bank book. Uncle Billy checks his pockets, and the teller points to strings on his fingers."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He gives a friendly wave as he makes his way through the door and heads outside. Meanwhile, a blazing plane spectacularly crashes into the sea with a fiery explosion. Inside, George, who is stationed behind the bustling counter, is diligently trying to manage a crowd of people who are all enthusiastically clamoring for more precious ration points. George, feeling the pressure, raises his voice and shouts to be heard above the noise. Dressed in the official uniform of an air raid warden, George is dutifully patrolling his beat. He comes across a man standing beside a brightly lit window, who quickly pulls down the shade as George assertively blows his whistle. Later, George is seen lending a hand with loading his old, trusty car with an assortment of scrap paper. Nearby, a wheelbarrow loaded with assorted junk is being tipped over, adding its contents to an already sizeable pile. On this particular day, it is raw and gusty, with the wind tugging at his overcoat and muffler, making them flap uncontrollably in the brisk breeze.\n\nGeorge proceeds along the sidewalk, engrossed in reading a newspaper. Draped around one of his arms is a large, festive Christmas wreath. Under his other arm, he’s carrying several additional copies of the newspaper. He makes his way over to a spot on the sidewalk where Ernie, the local taxi driver, is standing. The front page of the newspaper, known as the Bedford Falls Sentinel, prominently features a subhead detailing an elaborate plan for a grand jubilee and parade, which is to be followed by a grand banquet. This celebration is in honor of Commander Harry Bailey, U.S.N., who is currently on his way home from Washington after being awarded the esteemed Congressional Medal of Honor. A large photograph is displayed, showing President Truman pinning the highly coveted medal onto Harry's chest amidst a gathering of dignitaries, alongside another picture of the transport that Harry heroically saved. Almost the entire front page is dedicated to this impressive story. Gower comes sprinting across the street from his drugstore and joins them with excitement. Uncle Billy is wandering along the street, humming a happy tune to himself as he goes.\n\nThe outer door swings open and George steps inside. The offices remain unchanged, still retaining their small-town, old-fashioned charm. Cousin Tilly and Cousin Eustace are actively engaged in conversation on the phone. The same familiar office staff, although a few years older now: Cousin Tilly and Cousin Eustace. Sitting on a chair nearby is a middle-aged man carrying a briefcase. Cousin Eustace, after turning away from George, catches a quick glimpse of the man patiently waiting in the chair. This individual is Carter, the diligent bank examiner, who has arrived for his annual audit of the Building and Loan's books. George hands the phone over to Eustace, carefully puts his wreath down, and approaches Carter with a friendly handshake. Meanwhile, Uncle Billy is busily filling out a deposit slip at one of the desks. He boldly snatches the paper from Potter’s hand, folds it over the envelope containing his money, and throws one last taunt at the old man. In a cold, seething rage, Potter aggressively grabs his paper back and furiously wheels off toward his office. Uncle Billy grins with triumph and heads toward the deposit window, proudly holding his deposit slip. He hands over the bank book to the teller, who begins processing it by punching it with rubber stamps. Uncle Billy searches through every single pocket he has. The teller, familiar with the old man's peculiar habits, calmly points out one of the numerous strings tied around Uncle Billy’s fingers."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As he navigates across the room with a friendly wave, he proceeds to make his way through the door and heads outside into the open air. Meanwhile, an intense and blazing airplane dramatically crashes into the sea, creating a fiery explosion that lights up the sky. Within the bustling interior, George is stationed diligently behind the counter, industriously trying to manage the lively crowd of people who are eagerly clamoring for their precious ration points. Feeling the mounting pressure, George raises his voice, shouting in a determined effort to be heard above the clamor and noise. Clad in the official uniform of an air raid warden, George is dutifully patrolling his designated beat. He encounters a man standing beside a brightly illuminated window, who swiftly pulls down the shade as George assertively blows his whistle in warning. Later on, George is observed lending a hand with the task of loading his old, trusty car with an assortment of scrap paper. Nearby, a wheelbarrow laden with assorted junk is upended, its contents adding to a sizable and growing pile. On this particular day, the weather is raw and gusty, with the wind persistently tugging at George's overcoat and muffler, making them flap uncontrollably in the brisk, chilly breeze.\n\nContinuing his journey along the sidewalk, George is engrossed in reading a newspaper. Draped around one of his arms is a large, festive Christmas wreath, adding a touch of seasonal cheer to his appearance. Under his other arm, he’s carrying several additional copies of the newspaper. He steadily makes his way over to a particular spot on the sidewalk where Ernie, the friendly local taxi driver, is standing. The front page of the newspaper, known as the Bedford Falls Sentinel, prominently showcases a subhead detailing an elaborate plan for a grand jubilee and parade, which is to be followed by a splendid banquet. This grand celebration is in honor of Commander Harry Bailey, U.S.N., who is currently journeying home from Washington after being awarded the esteemed Congressional Medal of Honor. A large photograph is prominently displayed, capturing the moment as President Truman pins the highly coveted medal onto Harry's chest amidst a gathering of dignitaries. Beside this image is another picture depicting the transport that Harry heroically saved. Almost the entire front page is dedicated to this impressive and noteworthy story. Gower comes sprinting across the street from his drugstore and joins them with a palpable sense of excitement. Meanwhile, Uncle Billy is seen wandering along the street, contentedly humming a happy tune to himself as he goes.\n\nThe outer door swings open, and George steps inside. The offices remain unchanged, still exuding their small-town, old-fashioned charm. Cousin Tilly and Cousin Eustace are actively engaged in animated conversation on the phone. The same familiar office staff is present, albeit a few years older now: Cousin Tilly and Cousin Eustace. Sitting on a chair nearby is a middle-aged man carrying a well-worn briefcase. After turning away from George, Cousin Eustace catches a quick glimpse of the man patiently waiting in the chair. This individual is Carter, the diligent bank examiner, who has arrived for his annual audit of the Building and Loan's books. George hands the phone over to Eustace, carefully places his Christmas wreath down, and approaches Carter with a friendly and welcoming handshake. Meanwhile, Uncle Billy is busily occupied with filling out a deposit slip at one of the desks. He boldly snatches the paper from Potter’s grasp, folds it over the envelope containing his money, and throws one last taunt at the old man. In a cold, seething rage, Potter aggressively grabs his paper back and furiously wheels off toward his office in frustration. Uncle Billy, grinning with triumph, heads toward the deposit window, proudly holding his deposit slip aloft. He hands over the bank book to the teller, who begins processing it by punching it with a series of rubber stamps. Uncle Billy searches through every single one of his pockets. The teller, familiar with the old man's peculiar habits, calmly points out one of the numerous strings tied around Uncle Billy’s fingers."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As he approaches the door, he raises his hand to wave before stepping out. In the distance, a plane engulfed in flames plummets dramatically into the sea, creating a chaotic scene. Meanwhile, George stands behind the counter, surrounded by a crowd of people clamoring loudly for more ration points. Attempting to impose silence, George raises his voice, shouting above the din. Later, George is seen patrolling his designated area, adorned in the uniform of an air raid warden. As he moves with purpose, a man standing beside a brightly lit window notices George's presence and hastily pulls down the shade. This prompts George to blow his whistle, a sharp sound piercing the air. Shifting scenes, George lends a hand in loading his old car with bundles of scrap paper. Nearby, a wheelbarrow overflowing with miscellaneous junk is being upended onto an already large pile. The day is raw and gusty, causing George's overcoat and muffler to flutter vigorously in the breeze as he makes his way along the sidewalk. Engrossed in reading a newspaper, he navigates the path with a large Christmas wreath draped over one arm while clutching several more copies of the newspaper under the other arm. As George reaches a spot where Ernie, the taxi driver, is stationed on the sidewalk, he becomes aware of the front page of the Bedford Falls Sentinel. It captures his attention with a prominent subheading about a planned grand jubilee and parade, concluding with a banquet in honor of Commander Harry Bailey, U.S.N., who is returning home from Washington after being awarded the Congressional Medal of Honor. The newspaper features a large photograph of President Truman ceremoniously pinning the prestigious medal on Harry’s chest amid a gathering of dignitaries, along with an image of the transport Harry heroically saved. Nearly the entire front page is dedicated to this remarkable story. At that moment, Gower rushes across the street from his drugstore to join them, his presence adding to the scene. Meanwhile, Uncle Billy strolls down the street, humming a cheerful tune to himself. The outer door swings open, and George enters. Inside, he finds the offices unchanged, still exuding a quaint, small-time charm. Cousin Tilly and Cousin Eustace are engaged in conversation on the phone, their voices part of the familiar office backdrop. Despite a few more years etched on their faces, the office staff remains the same: Cousin Tilly and Cousin Eustace. Sitting on a chair is a middle-aged man with a briefcase, who catches Eustace’s eye as she glances away from George. This man is Carter, the bank examiner, there for his annual audit of the Building and Loan’s books. George, acknowledging the task at hand, hands the phone to Eustace, sets down the wreath, and approaches Carter. They exchange a firm handshake, a gesture of mutual recognition. In another part of the scene, Uncle Billy is busy filling out a deposit slip at one of the desks. He seizes the newspaper from Potter's hand with a sudden motion. With a sense of finality, Uncle Billy wraps Potter's newspaper around the envelope containing his money and flings a parting taunt at the old man. In a fit of cold anger, Potter snatches his paper back and wheels away toward his office, leaving Uncle Billy to smile with satisfaction. Subsequently, Uncle Billy makes his way to the deposit window, clutching his deposit slip. He hands over the bank book to the teller, who opens it and begins the routine of punching it with rubber stamps. As Uncle Billy waits, he diligently searches through every pocket, a familiar ritual. The teller, accustomed to Uncle Billy’s peculiar habits, gestures toward one of the numerous strings tied around his fingers, offering a silent cue to the forgetful man."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "George exits with a wave as a flaming plane crashes into the sea. Behind the counter, he attempts to calm a crowd of people demanding more ration points, shouting to make himself heard. Dressed as an air raid warden, George patrols the streets, blowing his whistle when a man beside a lighted window pulls down the shade. On a raw, windy day, he helps load his old car with scrap paper, his overcoat and muffler flapping in the breeze, and later dumps a wheelbarrow full of junk onto a pile. Walking along the sidewalk, George reads the Bedford Falls Sentinel, which announces a giant jubilee and parade to honor Commander Harry Bailey, featuring a picture of President Truman pinning the Congressional Medal of Honor on Harry. He carries a Christmas wreath and more newspapers, greeting Ernie, the taxi driver, as Gower runs over from his drugstore. Meanwhile, Uncle Billy hums happily, walking down the street.\n\nAs George enters unchanged, small-time office, he encounters his cousins, Tilly and Eustace, talking on the phone. A middle-aged man, Carter the bank examiner, waits with a briefcase for his annual audit. George hands the phone to Eustace, places down his wreath, and greets Carter with a handshake. Uncle Billy, filling out a deposit slip, grabs a newspaper from Potter and tauntingly folds it over his money envelope. In anger, Potter snatches back his paper and retreats to his office. Triumphant, Uncle Billy proceeds to the deposit window, where the teller begins stamping his bank book. As Uncle Billy searches his pockets for something, the teller points to the strings tied around his fingers, familiar with Billy's forgetfulness."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He waves as he exits through the door, stepping into the cool, crisp air of Bedford Falls, a small town set in the snow-dusted hills of upstate New York. A flaming plane crashes into the sea, reminiscent of the many training accidents during the intense flight drills of World War II. George, behind the counter at Martini's Bar, is trying to quiet a group of anxious patrons, all clamoring for more ration points essential during these post-war shortages. George shouts commands, his voice carrying the authority developed during his time serving as an air raid warden. George, in the uniform of an air raid warden responsible for ensuring blackout regulations, is patrolling his beat. A man beside a lighted window quickly pulls down the shade as George blows his whistle, a familiar signal used to enforce wartime blackout rules to protect against enemy aircraft. George is helping load his old jalopy with scrap paper, a common material collected for recycling into wartime products. A wheelbarrow full of junk, composed of metal scraps destined for reuse in manufacturing vital goods, is being dumped onto a pile. It is a raw, gusty day typical of early winter, and his overcoat and muffler, both well-worn from the harsh winters, flap in the breeze. George is walking along the sidewalk reading a newspaper filled with reports of the day. Draped around one arm is a large Christmas wreath, a sign of the festive spirit despite the austerity of the times. Under his other arm are several more copies of the paper, likely intended for distribution among friends. George comes to where Ernie, the taxi driver who knows every corner of Bedford Falls, is standing on the sidewalk. The front page of the paper, the Bedford Falls Sentinel, has a subhead telling of a plan for a giant jubilee and parade, to be followed by a banquet, in honor of Commander Harry Bailey, U.S.N., George's brother who is renowned for his heroic actions, on his way home from Washington after receiving the Congressional Medal of Honor. There's a large picture of President Truman pinning the coveted medal on Harry's bosom, in the midst of dignitaries, and a picture of the transport which Harry saved from imminent disaster. Practically the whole front page is devoted to the story, reflecting the town’s pride in their local hero. Gower, the well-respected local pharmacist, comes running across the street from his drugstore and joins them. Uncle Billy is walking along the street, humming happily to himself, his erratic nature well-known among the townspeople. The outer door opens and George enters his family’s business. The offices are unchanged, still small-time and old-fashioned, a testament to the town's tradition and simple way of life. Cousin Tilly and Cousin Eustace are talking on the phone, their familiar voices echoing through the room. The same office force, albeit a few years older: Cousin Tilly and Cousin Eustace, whose familial loyalty keeps the business afloat. Seated on a chair is a middle-aged man with a briefcase. Cousin Eustace has turned away from George and caught a glimpse of the man waiting in the chair. This is Carter, the bank examiner, responsible for ensuring the financial integrity of institutions like the Building and Loan, come for his annual audit of the books. George gives the phone to Eustace, puts down his wreath, and goes over to Carter. They shake hands in a greeting that signifies another routine check-up. Uncle Billy is filling out a deposit slip at one of the desks, a task that often takes him some time due to his forgetful nature. He grabs the paper from Potter's hand, his long-time adversary and the wealthiest man in town. Uncle Billy folds Potter's paper over the envelope containing his money, and flings his final taunt at the old man, a small personal victory. In a cold rage, Potter grabs his paper and wheels off toward his office, always seeking control over the town and its people. Uncle Billy smiles triumphantly and goes toward the deposit window with his deposit slip. Uncle Billy hands the bank book over. The teller opens it, starts to punch it with rubber stamps, a routine step in recording transactions. Uncle Billy searches through every pocket he has, a common occurrence given his absent-mindedness. The teller, knowing the old man's vagaries, points to one of the numerous strings tied around his fingers, a system Uncle Billy uses to remember important tasks."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "A wheelbarrow full of junk is being dumped onto a pile He waves as he exits through the door A flaming plane crashes into the sea George behind the counter is trying to quiet a crowd of people all clamoring for more ration points Uncle Billy hands the bank book over The outer door opens and George enters George shouts George gives the phone to Eustace puts down his wreath and goes over to Carter George in the uniform of an air raid warden is patrolling his beat A man beside a lighted window pulls down the shade as George blows his whistle George is helping load his old car with scrap paper Uncle Billy folds Potter's paper over the envelope containing his money and flings his final taunt at the old man A wheelbarrow full of junk is being dumped onto a pile George in the uniform of an air raid warden is patrolling his beat It is a raw gusty day and his overcoat and muffler flap in the breeze Uncle Billy searches through every pocket he has George is walking along the sidewalk reading a newspaper Draped around one arm is a large Christmas wreath Under his other arm are several more copies of the paper George comes to where Ernie the taxi driver is standing on the sidewalk A flaming plane crashes into the sea George behind the counter is trying to quiet The front page of the paper Uncle Billy is walking along the street humming happily to himself Uncle Billy is filling out a deposit slip at one of the desks the Bedford Falls Sentinel has a subhead telling of a plan for a giant jubilee and parade to be followed by a banquet in honor of Commander Harry Bailey USN on his way home from Washington after receiving the Congressional Medal of Honor The front page of the paper There is a large picture of President Truman pinning the coveted medal on Harry's bosom in the midst of dignitaries and a picture of the transport which Harry saved He waves as he exits through the door Practically the whole front page is devoted to the story Gower comes running across the street from his drugstore and joins them Uncle Billy is walking along the street humming happily to himself The outer door opens and George enters The offices are unchanged still smalltime and oldfashioned Cousin Tilly and Cousin Eustace are talking on the phone The teller opens it starts to punch it with rubber stamps The same office force albeit a few years older Cousin Tilly and Cousin Eustace Seated on a chair is a middleaged man with a briefcase George is helping load his old car with scrap paper Practically the whole front page is devoted to the story Cousin Eustace has turned away from George and caught a glimpse of the man waiting in the chair This is Carter the bank examiner come for his annual audit of the books of the Building and Loan George gives the phone to Eustace puts down his wreath and goes over to Carter They shake hands Uncle Billy is filling out a deposit slip at one of the desks He grabs the paper from Potter's hand Uncle Billy folds Potter's paper over the envelope containing his money and flings his final taunt at the old man the Bedford Falls Sentinel has a subhead telling of a plan for a giant jubilee and parade to be followed by a banquet in honor of Commander Harry Bailey USN on his way home from Washington after receiving the Congressional Medal of Honor The teller knowing the old man's vagaries points to one of the numerous strings tied around his fingers In a cold rage There is a large picture of President Truman pinning the coveted medal on Harry's bosom in the midst of dignitaries and a picture of the transport which Harry saved Potter grabs his paper and wheels off toward his office This is Carter Uncle Billy smiles triumphantly and goes toward the deposit window with his deposit slip Uncle Billy hands the bank book over The teller opens it starts to punch it with rubber stamps Uncle Billy searches through every pocket he has The teller knowing the old man's vagaries points to one of the numerous strings tied around his fingers A man beside a lighted window pulls down the shade as George blows his whistle"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He waves as he exits through the door. A flaming plane crashes into the sea. George behind the counter is trying to quiet. a crowd of people all clamoring for more ration points. George shouts. George in the uniform of an air raid warden is patrolling his beat. A man beside a lighted window pulls down the shade as George blows his whistle. George is helping load his old car with scrap paper. A wheelbarrow full of junk is being dumped onto a pile. It is a raw gusty day and his overcoat and muffler flap in the breeze. George is walking along the sidewalk reading a newspaper. Draped around one arm is a large Christmas wreath. Under his other arm are several more copies of the paper. George comes to where Ernie the taxi driver is standing on the sidewalk. The front page of the paper. the Bedford Falls Sentinel has a subhead telling of a plan for a giant jubilee and parade to be followed by a banquet in honor of Commander Harry Bailey USN on his way home from Washington after receiving the Congressional Medal of Honor. There is a large picture of President Truman pinning the coveted medal on Harry's bosom in the midst of dignitaries and a picture of the transport which Harry saved. Practically the whole front page is devoted to the story. Gower comes running across the street from his drugstore and joins them. Uncle Billy is walking along the street humming happily to himself. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. The outer door opens and George enters. The offices are unchanged still smalltime and oldfashioned. Cousin Tilly and Cousin Eustace are talking on the phone. The same office force albeit a few years older. Cousin Tilly and Cousin Eustace. Seated on a chair is a middleaged man with a briefcase. Cousin Eustace has turned away from George and caught a glimpse of the man waiting in the chair. This is Carter. the bank examiner come for his annual audit of the books of the Building and Loan. George gives the phone to Eustace puts down his wreath and goes over to Carter. They shake hands. Uncle Billy is filling out a deposit slip at one of the desks. He grabs the paper from Potter's hand. Uncle Billy folds Potter's paper over the envelope containing his money and flings his final taunt at the old man. In a cold rage. Potter grabs his paper and wheels off toward his office. Uncle Billy smiles triumphantly and goes toward the deposit window with his deposit slip. Uncle Billy hands the bank book over. The teller opens it starts to punch it with rubber stamps. Uncle Billy searches through every pocket he has. The teller knowing the old man's vagaries points to one of the numerous strings tied around his fingers."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He waves as he exits through the door. A flaming plane crashes into the sea. George behind the counter is trying to quiet. a crowd of people all clamoring for more ration points. George shouts. George in the uniform of an air raid warden is patrolling his beat. A man beside a lighted window pulls down the shade as George blows his whistle. George is helping load his old car with scrap paper. A wheelbarrow full of junk is being dumped onto a pile. It is a raw gusty day and his overcoat and muffler flap in the breeze. George is walking along the sidewalk reading a newspaper. Draped around one arm is a large Christmas wreath. Under his other arm are several more copies of the paper. George comes to where Ernie the taxi driver is standing on the sidewalk. The front page of the paper. the Bedford Falls Sentinel has a subhead telling of a plan for a giant jubilee and parade to be followed by a banquet in honor of Commander Harry Bailey USN on his way home from Washington after receiving the Congressional Medal of Honor. There is a large picture of President Truman pinning the coveted medal on Harry's bosom in the midst of dignitaries and a picture of the transport which Harry saved. Practically the whole front page is devoted to the story. Gower comes running across the street from his drugstore and joins them. Uncle Billy is walking along the street humming happily to himself. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. The outer door opens and George enters. The offices are unchanged still smalltime and oldfashioned. Cousin Tilly and Cousin Eustace are talking on the phone. The same office force albeit a few years older. Cousin Tilly and Cousin Eustace. Seated on a chair is a middleaged man with a briefcase. Cousin Eustace has turned away from George and caught a glimpse of the man waiting in the chair. This is Carter. the bank examiner come for his annual audit of the books of the Building and Loan. George gives the phone to Eustace puts down his wreath and goes over to Carter. They shake hands. Uncle Billy is filling out a deposit slip at one of the desks. He grabs the paper from Potter's hand. Uncle Billy folds Potter's paper over the envelope containing his money and flings his final taunt at the old man. In a cold rage. Potter grabs his paper and wheels off toward his office. Uncle Billy smiles triumphantly and goes toward the deposit window with his deposit slip. Uncle Billy hands the bank book over. The teller opens it starts to punch it with rubber stamps. Uncle Billy searches through every pocket he has. The teller knowing the old man's vagaries points to one of the numerous strings tied around his fingers."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He waves as he exits through the door. A flaming plane crashes into the sea. George behind the counter is trying to quiet. a crowd of people all clamoring for more ration points. George shouts. George in the uniform of an air raid warden is patrolling his beat. A man beside a lighted window pulls down the shade as George blows his whistle. George is helping load his old car with scrap paper. A wheelbarrow full of junk is being dumped onto a pile. It is a raw gusty day and his overcoat and muffler flap in the breeze. They shake hands. Uncle Billy is filling out a deposit slip at one of the desks. He grabs the paper from Potter's hand. Uncle Billy folds Potter's paper over the envelope containing his money and flings his final taunt at the old man. In a cold rage. Potter grabs his paper and wheels off toward his office. Uncle Billy smiles triumphantly and goes toward the deposit window with his deposit slip. Uncle Billy hands the bank book over. The teller opens it starts to punch it with rubber stamps. Uncle Billy searches through every pocket he has. The teller knowing the old man's vagaries points to one of the numerous strings tied around his fingers."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He waves as he exits through the door. A flaming plane crashes into the sea. George behind the counter is trying to quiet. a crowd of people all clamoring for more ration points. Uncle Billy smiles triumphantly and goes toward the deposit window with his deposit slip. Uncle Billy hands the bank book over. The teller opens it starts to punch it with rubber stamps. Uncle Billy searches through every pocket he has. The teller knowing the old man's vagaries points to one of the numerous strings tied around his fingers."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The cat waves as it exits through the door. A flaming plane crashes into the sea. The dog, behind the counter, is trying to quiet a crowd of people all clamoring for more ration points. The dog shouts. The dog, in the uniform of an air raid warden, is patrolling its beat. A rabbit beside a lighted window pulls down the shade as the dog blows its whistle. The dog is helping load its old car with scrap paper. A wheelbarrow full of junk is being dumped onto a pile. It is a raw, gusty day, and its overcoat and muffler flap in the breeze. The dog is walking along the sidewalk reading a newspaper. Draped around one arm is a large Christmas wreath. Under its other arm are several more copies of the paper. The dog comes to where the rabbit, the taxi driver, is standing on the sidewalk. The front page of the paper, the Bedford Falls Sentinel, has a subhead telling of a plan for a giant jubilee and parade, to be followed by a banquet, in honor of Commander Harry Bailey, U.S.N., on his way home from Washington after receiving the Congressional Medal of Honor. There's a large picture of President Truman pinning the coveted medal on Harry's bosom, in the midst of dignitaries, and a picture of the transport which Harry saved. Practically the whole front page is devoted to the story. The bear comes running across the street from its drugstore and joins them. The owl is walking along the street, humming happily to itself. The outer door opens and the dog enters. The offices are unchanged, still small-time and old-fashioned. The cat and the squirrel are talking on the phone. The same office force, albeit a few years older: the cat and the squirrel. Seated on a chair is a middle-aged raccoon with a briefcase. The squirrel has turned away from the dog and caught a glimpse of the raccoon waiting in the chair. This is the horse, the bank examiner, come for its annual audit of the books of the Building and Loan. The dog gives the phone to the squirrel, puts down its wreath, and goes over to the horse. They shake hands. The owl is filling out a deposit slip at one of the desks. It grabs the paper from the sheep's hand. The owl folds the sheep's paper over the envelope containing its money, and flings its final taunt at the old sheep. In a cold rage, the sheep grabs its paper and wheels off toward its office. The owl smiles triumphantly and goes toward the deposit window with its deposit slip. The owl hands the bank book over. The teller opens it, starts to punch it with rubber stamps. The owl searches through every pocket it has. The teller, knowing the old owl's vagaries, points to one of the numerous strings tied around its fingers."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He waves as he exits through the gate. A flaming zeppelin crashes into the river. George, behind the bar, is trying to quiet a crowd of people all clamoring for more train tickets. George shouts. George, in the uniform of a mail carrier, is patrolling his beat. A man beside a lit billboard pulls down the curtain as George blows his harmonica. George is helping load his old motorcycle with recycling bins. A cart full of gadgets is being dumped onto a mound. It is a raw, gusty day, and his raincoat and scarf flap in the breeze. George is walking along the boardwalk reading a magazine. Draped around one arm is a large Easter basket. Under his other arm are several more copies of the magazine. George comes to where Ernie, the bus driver, is standing on the boardwalk. The front page of the magazine, the Bedford Falls Gazette, has a subhead telling of a plan for a giant carnival and parade, to be followed by a banquet, in honor of Commander Harry Bailey, U.S.N., on his way home from Chicago after receiving the Congressional Medal of Honor. There's a large picture of President Roosevelt pinning the coveted medal on Harry's chest, in the midst of dignitaries, and a picture of the submarine which Harry saved. Practically the whole front page is devoted to the story. Gower comes running across the park from his café and joins them. Uncle Billy is walking along the trail, humming happily to himself. The outer gate opens and George enters. The offices are unchanged, still small-time and old-fashioned. Cousin Tilly and Cousin Eustace are talking on the radio. The same office force, albeit a few years older: Cousin Tilly and Cousin Eustace. Seated on a stool is a middle-aged man with a backpack. Cousin Eustace has turned away from George and caught a glimpse of the man waiting on the stool. This is Carter, the insurance auditor, come for his annual inspection of the files of the Building and Loan. George gives the radio to Eustace, puts down his basket, and goes over to Carter. They shake hands. Uncle Billy is filling out a withdrawal slip at one of the tables. He grabs the manuscript from Potter's hand. Uncle Billy folds Potter's manuscript over the envelope containing his stamps, and flings his final taunt at the old man. In a cold rage, Potter grabs his manuscript and wheels off toward his cubicle. Uncle Billy smiles triumphantly and goes toward the cashier window with his withdrawal slip. Uncle Billy hands the ledger over. The teller opens it, starts to punch it with inkwell stamps. Uncle Billy searches through every pocket he has. The teller, knowing the old man's peculiarities, points to one of the numerous ribbons tied around his fingers."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He salutes as he enters through the door. A flaming plane skims across the sea. George, behind the counter, is attempting to entertain a crowd of people all chanting for more ration points. George whispers. George, in the uniform of an air raid warden, is hopping on his beat. A man beside a lighted window lifts up the shade as George honks his whistle. George is observing someone load his old car with scrap paper. A wheelbarrow full of junk is being lifted onto a pile. It is a raw, gusty day, and his overcoat and muffler float in the breeze. George is skipping along the sidewalk singing a song. Draped around one arm is a large Christmas wreath. Under his other arm are several more copies of the paper. George skips to where Ernie, the taxi driver, is dancing on the sidewalk. The front page of the paper, the Bedford Falls Sentinel, has a subhead describing a plan for a giant jubilee and parade, to be followed by a banquet, in honor of Commander Harry Bailey, U.S.N., on his way home from Washington after signing the Congressional Medal of Honor. There's a large picture of President Truman handing the coveted medal to Harry's bosom, in the midst of dignitaries, and a picture of the transport which Harry steered. Practically the whole front page is dedicated to the story. Gower skips across the street from his drugstore and joins them. Uncle Billy is dancing along the street, whistling happily to himself. The outer door closes and George exits. The offices are changed, still vibrant and new. Cousin Tilly and Cousin Eustace are singing on the phone. The same office force, albeit a few years younger: Cousin Tilly and Cousin Eustace. Seated on a chair is a middle-aged man with a suitcase. Cousin Eustace has turned toward George and received a glimpse of the man waiting in the chair. This is Carter, the bank examiner, come for his annual survey of the books of the Building and Loan. George throws the phone to Eustace, drops his wreath, and sprints over to Carter. They hug. Uncle Billy is scribbling a deposit slip at one of the desks. He drops the paper from Potter's hand. Uncle Billy crumples Potter's paper over the envelope containing his money and tosses his final taunt at the old man. In a cold rage, Potter drops his paper and stomps off toward his office. Uncle Billy grins triumphantly and dances toward the deposit window with his deposit slip. Uncle Billy tosses the bank book over. The teller closes it, stops to punch it with rubber stamps. Uncle Billy examines every pocket he has. The teller, knowing the old man's quirks, gestures to one of the numerous strings tied around his fingers."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The guitar waves as it exits through the window. A glowing ladder crashes into the desert. Linda, behind the bookshelf, is trying to quiet a parade of bicycles all clamoring for more starlight coupons. Linda shouts. Linda, in the uniform of a beach lifeguard, is patrolling her beat. A cat beside a glowing river pulls down the curtain as Linda blows her horn. Linda is helping load her old train with scrap marbles. A backpack full of feathers is being dumped onto a hill. It is a raw, gusty evening, and her trench coat and scarf flap in the breeze. Linda is walking along the pathway reading a magazine. Draped around one leg is a large birthday cake. Under her other leg are several more copies of the magazine. Linda comes to where Stella, the firefighter, is standing on the pathway. The front page of the magazine, the Maple Town Gazette, has a subhead telling of a blueprint for a giant fireworks display and festival, to be followed by a luncheon, in honor of Ranger Sally Potter, U.S.F., on her way home from Lisbon after receiving the Trekking Medal of Courage. There's a large picture of Manager Gates pinning the coveted medal on Sally's shoulder, in the midst of tourists, and a picture of the bicycle which Sally saved. Practically the whole front page is devoted to the tale. Dr. Reed comes running across the avenue from his bakery and joins them. Aunt Sophie is walking along the sidewalk, humming happily to herself. The inner window opens and Linda enters. The studios are unchanged, still modest and old-fashioned. Cousin Minnie and Cousin Horace are dancing on the ladder. The same band, albeit a few years older: Cousin Minnie and Cousin Horace. Seated on a sofa is a middle-aged owl with a textbook. Cousin Horace has turned away from Linda and caught a glimpse of the owl waiting on the sofa. This is Taylor, the music instructor, come for her annual review of the records of the Library and Archives. Linda gives the ladder to Horace, puts down her cake, and goes over to Taylor. They shake feet. Aunt Sophie is filling out a ticket stub at one of the tables. She grabs the magazine from King's foot. Aunt Sophie folds King's magazine over the satchel containing her apples, and flings her final taunt at the old bear. In a cold rage, King grabs her magazine and wheels off toward her studio. Aunt Sophie smiles triumphantly and goes toward the ticket counter with her ticket stub. Aunt Sophie hands the booklet over. The painter opens it, starts to punch it with wooden stamps. Aunt Sophie searches through every pocket she has. The painter, knowing the old bear's habits, points to one of the numerous ribbons tied around her paws."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "She nods as she strolls through the door. A floating zeppelin explodes into the forest. Amanda, beside the register, is attempting to entertain a group of children all pleading for extra candy. Amanda whispers. Amanda, in the suit of a park ranger, is exploring her territory. A woman beside an open window shuts the curtain as Amanda honks her horn. Amanda is watching fix her new bicycle with old tires. A cart full of stones is being tossed onto a stack. It is a bright, breezy day, and her scarf and hat flutter in the wind. Amanda is skipping along the pathway reciting a poem. Draped around one shoulder is a large picnic basket. Under her other arm are several more volumes of the book. Amanda arrives at where Charlie, the bus driver, is resting on the pavement. The front cover of the book, the Bedford Falls Bulletin, has a headline announcing a plan for a massive festival and march, to be followed by a gathering, in celebration of Admiral Harry Bailey, R.N., on his return home from London after obtaining the Victoria Cross. There's a huge illustration of Prime Minister Churchill awarding the esteemed cross on Harry's chest, among dignitaries, and an illustration of the battleship which Harry rescued. Virtually the entire cover is dedicated to the article. Benson comes jogging across the avenue from his café and joins them. Aunt Sally is dancing along the avenue, singing contentedly to herself. The inner door swings and Amanda appears. The rooms are unchanged, still modest and quaint. Uncle Bob and Aunt Ethel are laughing on the phone. The same room group, albeit a few years older: Uncle Bob and Aunt Ethel. Seated on a couch is a young woman with a backpack. Aunt Ethel has turned away from Amanda and spotted the woman waiting in the sofa. This is Maria, the library inspector, come for her yearly review of the records of the Reading Room. Amanda hands the phone to Ethel, places down her basket, and approaches Maria. They exchange greetings. Aunt Sally is jotting down a note at one of the tables. She snatches the envelope from Johnson's grasp. Aunt Sally wraps Johnson's envelope around the package containing her books, and throws her final jibe at the young woman. In a silent fury, Johnson seizes her envelope and storms off toward her cabin. Aunt Sally winks victoriously and heads toward the counter with her note. Aunt Sally offers the account book over. The cashier opens it, begins to mark it with ink stamps. Aunt Sally searches through every drawer she has. The cashier, aware of the young woman's quirks, points to one of the numerous ribbons tied around her wrists."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He claps as he slips through the gate. A colossal kite plummets into the forest. George, behind the grill, is attempting to soothe a cluster of birds all chirping for more birdseed. George whispers. George, in the garb of a forest ranger, is surveying his trail. A man beside a glowing bonfire pulls up the ladder as George rings his bell. George is assisting in filling his ancient wagon with broken pottery. A shopping cart full of trinkets is being poured onto a heap. It is a chilly, breezy morning, and his scarf and beanie flutter in the wind. George is skipping along the path reading a novel. Draped around one arm is a giant beach umbrella. Under his other arm are several more copies of the novel. George arrives at where Ernie, the dog walker, is dancing on the path. The cover of the novel, the Bedford Falls Gazette, has an insert detailing a plan for a grand festival and dance, to be followed by a feast, in honor of Lieutenant Harry Bailey, U.S.N., on his way home from New York after earning the Congressional Medal of Honor. There's a large painting of President Truman attaching the prized medal to Harry's chest, amidst celebrities, and a painting of the boat which Harry rescued. Practically the entire cover is dedicated to the tale. Gower comes galloping across the meadow from his bookstore and joins them. Uncle Billy is strolling along the trail, whistling merrily to himself. The inner gate opens and George steps in. The rooms are unchanged, still quaint and antique. Cousin Tilly and Cousin Eustace are chatting on the radio. The same office group, albeit a few years grayer: Cousin Tilly and Cousin Eustace. Seated on a stool is a middle-aged woman with a suitcase. Cousin Eustace has turned away from George and caught a glimpse of the woman waiting on the stool. This is Carter, the garden inspector, come for her annual check of the plants of the Nursery and Landscape. George gives the radio to Eustace, sets down his umbrella, and strolls over to Carter. They exchange nods. Uncle Billy is completing a postcard at one of the tables. He snatches the novel from Potter's grasp. Uncle Billy rolls Potter's novel over the box containing his grapes, and tosses his final jest at the old woman. In a quiet fury, Potter snatches her novel and dashes off toward her room. Uncle Billy grins victoriously and saunters toward the serving window with his postcard. Uncle Billy hands the garden book over. The server unlocks it, begins to decorate it with ink stamps. Uncle Billy searches through every bag he has. The server, aware of the old man's peculiarities, points to one of the numerous ribbons tied around his fingers."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The cat dances as it slides through the curtain. A sizzling balloon drifts into the desert. Martha, inside the gazebo, is attempting to calm a herd of cows all mooing for extra grain vouchers. Martha whispers. Martha, in the outfit of a forest ranger, is hiking her trail. A child beside a dimmed candle lifts up the curtain as Martha rings her bell. Martha is assisting carry her rusty wagon with used blankets. A backpack full of feathers is being tossed onto a heap. It is a damp, breezy night, and her poncho and scarf ripple in the wind. Martha is skipping along the trail perusing a magazine. Draped around one shoulder is a large autumn garland. Under her other shoulder are several more copies of the magazine. Martha arrives to where Sam, the bus driver, is sitting on the bench. The cover of the magazine, the Springfield Gazette, has a headline telling of a scheme for a massive carnival and march, to be followed by a feast, in honor of General Tommy White, U.S.A., on his route home from Chicago after receiving the Presidential Medal of Valor. There's a large photograph of Queen Elizabeth bestowing the esteemed award on Tommy's shoulder, amidst celebrities, and a photograph of the vessel which Tommy rescued. Virtually the entire cover is dedicated to the tale. Bert comes skipping across the avenue from his café and joins them. Aunt Maria is skipping along the avenue, singing joyfully to herself. The inner curtain swings and Martha steps in. The chambers are unchanged, still quaint and outdated. Cousin Sally and Cousin Edgar are chatting on the device. The same chamber personnel, albeit a tad older: Cousin Sally and Cousin Edgar. Resting on a sofa is a young child with a lunchbox. Cousin Edgar has turned away from Martha and spotted the child waiting on the sofa. This is Riley, the tax auditor, come for her yearly review of the scrolls of the Library and Archives. Martha hands the device to Edgar, puts down her garland, and strolls over to Riley. They nod heads. Aunt Maria is scribbling down a grocery list at one of the counters. She snatches the magazine from Stanley's grip. Aunt Maria tucks Stanley's magazine over the envelope holding her cookies, and flings her last tease at the elder lady. In a cold fury, Stanley grabs her magazine and dashes off toward her corner. Aunt Maria giggles victoriously and heads toward the checkout counter with her grocery list. Aunt Maria hands the ledger over. The cashier opens it, commences to stamp it with ink pads. Aunt Maria rummages through every purse she has. The cashier, knowing the elder lady's quirks, gestures to one of the several ribbons tied around her toes."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "George, an air raid warden, is patrolling the area during a chaotic period as a plane crashes into the sea. He manages a crowd demanding ration points and helps with war efforts by loading scrap paper. On a windy day, he carries a Christmas wreath and newspapers. The front page highlights a parade for Commander Harry Bailey, George's brother, who is returning after receiving the Congressional Medal of Honor. George meets with Gower and Uncle Billy, who is humming happily. At the unchanged Building and Loan office, George interacts with Carter, the bank examiner. Meanwhile, Uncle Billy misplaces his deposit slip, forgetting it with Potter, leading to a tense encounter. The teller reminds Billy of his habits by pointing at strings tied to his fingers."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The teller knowing the old man's vagaries points to one of the numerous strings tied around his fingers Uncle Billy searches through every pocket he has The teller opens it starts to punch it with rubber stamps Uncle Billy hands the bank book over Uncle Billy smiles triumphantly and goes toward the deposit window with his deposit slip Potter grabs his paper and wheels off toward his office In a cold rage Uncle Billy folds Potter's paper over the envelope containing his money and flings his final taunt at the old man He grabs the paper from Potter's hand Uncle Billy is filling out a deposit slip at one of the desks They shake hands George gives the phone to Eustace puts down his wreath and goes over to Carter the bank examiner come for his annual audit of the books of the Building and Loan This is Carter Cousin Eustace has turned away from George and caught a glimpse of the man waiting in the chair Seated on a chair is a middleaged man with a briefcase Cousin Tilly and Cousin Eustace The same office force albeit a few years older Cousin Tilly and Cousin Eustace are talking on the phone The offices are unchanged still smalltime and oldfashioned The outer door opens and George enters Uncle Billy is walking along the street humming happily to himself Gower comes running across the street from his drugstore and joins them Practically the whole front page is devoted to the story There is a large picture of President Truman pinning the coveted medal on Harry's bosom in the midst of dignitaries and a picture of the transport which Harry saved the Bedford Falls Sentinel has a subhead telling of a plan for a giant jubilee and parade to be followed by a banquet in honor of Commander Harry Bailey USN on his way home from Washington after receiving the Congressional Medal of Honor The front page of the paper George comes to where Ernie the taxi driver is standing on the sidewalk Under his other arm are several more copies of the paper Draped around one arm is a large Christmas wreath George is walking along the sidewalk reading a newspaper It is a raw gusty day and his overcoat and muffler flap in the breeze A wheelbarrow full of junk is being dumped onto a pile George is helping load his old car with scrap paper A man beside a lighted window pulls down the shade as George blows his whistle George in the uniform of an air raid warden is patrolling his beat George shouts a crowd of people all clamoring for more ration points George behind the counter is trying to quiet A flaming plane crashes into the sea He waves as he exits through the door"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "It is a raw gusty day and his overcoat and muffler flap in the breeze a crowd of people all clamoring for more ration points George is walking along the sidewalk reading a newspaper Uncle Billy smiles triumphantly and goes toward the deposit window with his deposit slip Seated on a chair is a middleaged man with a briefcase Cousin Tilly and Cousin Eustace They shake hands Draped around one arm is a large Christmas wreath George shouts He grabs the paper from Potter's hand The offices are unchanged still smalltime and oldfashioned the bank examiner come for his annual audit of the books of the Building and Loan The same office force albeit a few years older Gower comes running across the street from his drugstore and joins them Under his other arm are several more copies of the paper In a cold rage Potter grabs his paper and wheels off toward his office Cousin Eustace has turned away from George and caught a glimpse of the man waiting in the chair George comes to where Ernie the taxi driver is standing on the sidewalk Cousin Tilly and Cousin Eustace are talking on the phone The outer door opens and George enters Uncle Billy is filling out a deposit slip at one of the desks Uncle Billy hands the bank book over George gives the phone to Eustace puts down his wreath and goes over to Carter Uncle Billy is walking along the street humming happily to himself There is a large picture of President Truman pinning the coveted medal on Harry's bosom in the midst of dignitaries and a picture of the transport which Harry saved Uncle Billy searches through every pocket he has Uncle Billy folds Potter's paper over the envelope containing his money and flings his final taunt at the old man George behind the counter is trying to quiet He waves as he exits through the door The teller opens it starts to punch it with rubber stamps This is Carter George in the uniform of an air raid warden is patrolling his beat A man beside a lighted window pulls down the shade as George blows his whistle A wheelbarrow full of junk is being dumped onto a pile The front page of the paper the Bedford Falls Sentinel has a subhead telling of a plan for a giant jubilee and parade to be followed by a banquet in honor of Commander Harry Bailey USN on his way home from Washington after receiving the Congressional Medal of Honor Practically the whole front page is devoted to the story A flaming plane crashes into the sea George is helping load his old car with scrap paper The teller knowing the old man's vagaries points to one of the numerous strings tied around his fingers"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The offices are unchanged still smalltime and oldfashioned Cousin Tilly and Cousin Eustace are talking on the phone The same office force albeit a few years older Cousin Tilly and Cousin Eustace Seated on a chair is a middleaged man with a briefcase Cousin Eustace has turned away from George and caught a glimpse of the man waiting in the chair This is Carter the bank examiner come for his annual audit of the books of the Building and Loan George gives the phone to Eustace puts down his wreath and goes over to Carter They shake hands Uncle Billy is filling out a deposit slip at one of the desks He grabs the paper from Potter's hand Uncle Billy folds Potter's paper over the envelope containing his money and flings his final taunt at the old man In a cold rage Potter grabs his paper and wheels off toward his office Uncle Billy smiles triumphantly and goes toward the deposit window with his deposit slip Uncle Billy hands the bank book over The teller opens it starts to punch it with rubber stamps Uncle Billy searches through every pocket he has The teller knowing the old man's vagaries points to one of the numerous strings tied around his fingers He waves as he exits through the door A flaming plane crashes into the sea George behind the counter is trying to quiet a crowd of people all clamoring for more ration points George shouts George in the uniform of an air raid warden is patrolling his beat A man beside a lighted window pulls down the shade as George blows his whistle George is helping load his old car with scrap paper A wheelbarrow full of junk is being dumped onto a pile It is a raw gusty day and his overcoat and muffler flap in the breeze George is walking along the sidewalk reading a newspaper Draped around one arm is a large Christmas wreath Under his other arm are several more copies of the paper George comes to where Ernie the taxi driver is standing on the sidewalk The front page of the paper the Bedford Falls Sentinel has a subhead telling of a plan for a giant jubilee and parade to be followed by a banquet in honor of Commander Harry Bailey USN on his way home from Washington after receiving the Congressional Medal of Honor There is a large picture of President Truman pinning the coveted medal on Harry's bosom in the midst of dignitaries and a picture of the transport which Harry saved Practically the whole front page is devoted to the story Gower comes running across the street from his drugstore and joins them Uncle Billy is walking along the street humming happily to himself The outer door opens and George enters"
        }
      ]
    }
  ]
}