{
  "ground_truth": "He turns his back to Zuzu, pretending to be tinkering with the flower, sticks the fallen petals in his watch pocket, rearranges the flower, and then turns back to Zuzu. George puts the flower in a glass of water on the table beside her bed. They whisper. Mary comes in and picks up the phone. George enters shot and stands listening to her, then snatches the phone from Mary. She puts a restraining hand on his arm, but he shakes it off. She cannot know that George's tirade against Mrs. Welch is really a tirade against the world, against life itself, against God. Mary succeeds in wresting the phone from George's hand and speaks quickly into the phone. But the telephone is suddenly alive with a powerful male voice calling. Mary once more tries to take the phone from him. But before he can think of an insult to top Welch's, we hear a click on the phone. He yells at Tommy, noisily playing with his vacuum cleaner, and Janie is still practicing at the piano, monotonously. The room has suddenly become ominously quiet, the only sound being George's labored breathing. George goes over to a corner of the room where his workshop is set up—a drawing table, several models of modern buildings, bridges, etc. Savagely, he kicks over the models, picks up some books, and hurls them into the corner. Mary and the children watch, horrified. George looks around and sees them staring at him as if he were some unknown wild animal. Mary and the children stare at him, stunned by his furious outburst. There is silence in the room until Janie breaks into sobs. The sight of Mary and the children suffering is too much for George, so he looks around him, then quickly goes out the front door of the house. Mary goes to the phone and picks it up. Potter is seated at his desk, his goon beside him, signing some papers. George is seated in a chair before the desk, without a hat or coat, covered lightly with snow. George turns and starts out of the office as Potter picks up the phone and dials. George is out of the door by now. The camera moves closer to Potter. George comes out of the bank into the falling snow, crosses the street, tugs at the door of his old car, finally steps over the door, and drives off. The place is an Italian restaurant with a bar, the bottles sparkle, and there are Christmas greens and holly decorating the place. It has a warm, welcoming spirit, like Martini himself, who is welcoming new arrivals. There is an air of festivity and friendliness, more like a party than a public drinking place.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He rotates his back to Zuzu, feigning to be fiddling with the blossom, inserts the dropped petals in his timepiece pocket, rearranges the blossom, and then rotates back to Zuzu. George puts the blossom in a glass of liquid on the table beside her bed. They murmur. Mary arrives in and picks up the telephone. George enters frame and stands hearing to her, then grabs the telephone from Mary. She places a restraining hand on his limb, but he shrugs it off. She cannot know that George's diatribe against Mrs. Welch is truly a diatribe against the universe, against existence itself, against God. Mary succeeds in wresting the telephone from George's hand and speaks swiftly into the telephone. But the telephone is unexpectedly alive with a powerful masculine voice calling. Mary once more attempts to take the telephone from him. But before he can conceive of an affront to surpass Welch's, we hear a click on the telephone. He shouts at Tommy, loudly playing with his vacuum, and Janie is still practicing at the piano, monotonously. The room has unexpectedly become ominously silent, the only sound being George's labored breathing. George moves over to a corner of the room where his workshop is set up—a drafting table, several models of contemporary structures, bridges, etc. Fiercely, he kicks over the models, picks up some tomes, and hurls them into the corner. Mary and the offspring watch, horrified. George glances around and observes them staring at him as if he were some unknown wild creature. Mary and the offspring stare at him, stunned by his furious outburst. There is silence in the room until Janie breaks into weeping. The sight of Mary and the offspring suffering is too much for George, so he glances around him, then swiftly goes out the front entrance of the dwelling. Mary goes to the telephone and picks it up. Potter is seated at his desk, his thug beside him, signing some documents. George is seated in a chair before the desk, without a hat or coat, covered lightly with snow. George rotates and starts out of the office as Potter picks up the telephone and dials. George is out of the entrance by now. The camera shifts closer to Potter. George emerges out of the bank into the falling snow, crosses the street, tugs at the entrance of his ancient automobile, finally steps over the entrance, and drives off. The place is an Italian eatery with a tavern, the bottles sparkle, and there are Christmas greens and holly adorning the place. It has a warm, hospitable spirit, like Martini himself, who is welcoming new visitors. There is an air of celebration and amiability, more like a gathering than a public drinking place."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "His back is turned to Zuzu by him, while the flower is pretended to be tinkered with, the fallen petals are stuck in his watch pocket, the flower is rearranged, and then Zuzu is turned back to by him. The flower was placed by George in a glass of water on the table beside her bed. Whispers are exchanged by them. The phone is picked up by Mary when she comes in. George enters the shot, stands listening to her, then the phone is snatched from Mary by him. A restraining hand is placed on his arm by her, but it is shaken off by him. She cannot know that George's tirade against Mrs. Welch is really a tirade against the world, against life itself, against God. The phone is wrested from George's hand by Mary, and she speaks quickly into it. But a powerful male voice calls, suddenly bringing the telephone to life. Mary once more attempts to take the phone from him. But before an insult to top Welch's can be thought of by him, a click is heard on the phone. Tommy is yelled at by him for noisily playing with his vacuum cleaner, and Janie is still practicing at the piano, monotonously. The room has suddenly become ominously quiet, with George's labored breathing being the only sound. George goes over to a corner of the room where a workshop has been set up by him—a drawing table, several models of modern buildings, bridges, etc. The models are savagely kicked over by him, some books are picked up and hurled into the corner. Watching are Mary and the children, horrified. George looks around and sees them staring at him as if some unknown wild animal were watching them. Mary and the children are stunned by his furious outburst and stare at him. Silence fills the room until sobs are broken into by Janie. The sight of Mary and the children suffering is too much for George, so he looks around him, then the front door of the house is quickly exited by him. The phone is gone to by Mary and picked up. Potter is seated at his desk, with a goon beside him, signing some papers. George is seated in a chair before the desk, without a hat or coat, lightly covered with snow. George starts out of the office and turns as the phone is picked up and dialed by Potter. The door is exited by George by now. The camera moves closer to Potter. George comes out of the bank into the falling snow, crosses the street, tugs at the door of his old car, finally steps over the door, and then it is driven off by him. The place, an Italian restaurant with a bar, has bottles sparkling, and Christmas greens and holly decorating it. A warm, welcoming spirit is exuded by it, like Martini himself, who welcomes new arrivals. An air of festivity and friendliness is present, more like a party than a public drinking place."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He turns his back to Zuzu, pretends to tinker with the flower, places fallen petals in his watch pocket, rearranges the flower, and turns back to Zuzu. George puts the flower in a glass of water by her bed. They whisper. Mary enters and picks up the phone. George stands listening, then grabs the phone from Mary, who tries to restrain him, but he shakes her off. She cannot know George's tirade against Mrs. Welch is really against the world, life, and God. Mary wrests the phone from George and speaks quickly. Suddenly, a powerful male voice is heard on the line. Mary tries again to take the phone. But before George thinks of a worse insult, the call ends. He yells at Tommy, noisily playing with his vacuum, and Janie practicing the piano monotonously. The room becomes ominously quiet, only George's heavy breathing audible. George moves to his workshop—a drawing table, models of modern buildings, bridges, etc. He savagely kicks over models, throws books into the corner. Mary and the children watch, horrified, stunned by his outburst. Silence reigns until Janie sobs. Seeing their suffering overwhelms George, and he leaves the house quickly. Mary picks up the phone. Potter, signing papers, is at his desk with his goon. George sits before the desk, hatless and coatless, lightly covered with snow. He starts to leave as Potter dials the phone. George exits into the falling snow, crosses the street, struggles with his car door, steps over it, and drives off. The setting is an Italian restaurant with a bar, sparkling bottles, Christmas greens, and holly. With a welcoming spirit, Martini greets new arrivals. It feels more like a festive party than a bar."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He turns his back to Zuzu, pretends to tinker with the flower, places the petals in his watch pocket, rearranges it, and returns to Zuzu. George places the flower in water on the table by her bed. They whisper. Mary enters and picks up the phone. George listens, then grabs the phone from Mary, shaking off her restraining hand. He rants against Mrs. Welch, expressing anger at the world, life, and God. Mary takes the phone back and speaks quickly. A powerful male voice suddenly comes on. Mary attempts to take the phone again, but we hear a click. He yells at Tommy playing with a vacuum and Janie at the piano. The room becomes quiet, except for George's breathing. George goes to his workshop, kicks models, hurls books, and Mary and the children watch, horrified. They stare at him, stunned by his rage, until Janie sobs. Seeing their distress, George leaves through the front door. Mary picks up the phone. Potter sits at his desk, a goon beside him. George, without a hat or coat, covered in snow, sits before Potter, then leaves. He exits the bank, crosses the street, enters his old car, and drives off. In an Italian restaurant with a bar, sparkling bottles, Christmas greens, and holly, Martini welcomes new arrivals. It feels festive, friendly, more like a party than a public place."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He slowly turns his back to Zuzu, pretending to occupy himself with the delicate flower. With a careful hand, he places the fallen petals into his watch pocket, rearranges the flower with meticulous care, and then turns back to face Zuzu once more. George gently places the flower into a glass of refreshing water on the table situated right beside her bed. They engage in a hushed conversation, their whispers barely audible. Mary enters the room and immediately picks up the phone. George moves into the frame and stands attentively, listening to her, before abruptly snatching the phone away from Mary. She gently places a restraining hand on his arm, attempting to calm him, but he shakes it off with determination. She cannot possibly understand that George's fiery tirade directed at Mrs. Welch is a manifestation of his deep frustration with the world around him, with the very essence of life itself, and even with God. Mary manages to wrest the phone from George’s firm grip and, with urgency, speaks swiftly into the receiver. Suddenly, the telephone bursts to life with a commanding male voice. Mary once again makes an attempt to take the phone from him, but before he can conjure up an insult greater than Welch's, we hear the definitive click of the phone. In his mounting frustration, he yells at Tommy, who is noisily engrossed in playing with his vacuum cleaner, while Janie continues her monotonous piano practice. The room, once bustling with noise, has become ominously silent, broken only by George's heavy, labored breathing. George storms over to a corner of the room where his workshop is carefully set up—a drawing table, various detailed models of modern buildings, bridges, and more. With savagery in his movements, he kicks over the models, grabs some books, and hurls them forcefully into the corner. Mary and the children are left watching, horrified by the scene. George glances around, noticing them staring at him as though he has transformed into some wild, unknown creature. Mary and the children gaze at him, utterly stunned by his furious outburst. The oppressive silence in the room remains unbroken until Janie begins to sob softly. The sight of Mary and the children's pain becomes unbearable for George, prompting him to glance around once more before quickly exiting through the front door of the house. Mary moves toward the phone, picking it up with a tremor in her hand. Meanwhile, Potter is seated at his desk, a goon positioned beside him, diligently signing some papers. George sits in a chair facing the desk, without his hat or coat, lightly dusted with snow. George turns abruptly and starts to leave the office as Potter picks up the phone and begins dialing numbers. By this point, George has already stepped out the door. The camera moves steadily closer to Potter. George emerges from the bank into the gently falling snow, makes his way across the street, struggles to tug open the door of his aging car, and finally steps over the door, driving off into the wintry landscape. The setting shifts to an Italian restaurant featuring a lively bar area, where the bottles gleam under the light. Christmas greens and holly adorn the establishment, infusing it with a festive and inviting spirit, much like Martini, who is busy warmly welcoming new arrivals. There’s an air of festivity and friendliness that permeates the atmosphere, making it feel more like a joyful party than a public drinking venue."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He turns his back to Zuzu slowly, deliberately, as if to feign distraction by occupying himself with the delicate, intricate flower in front of him. With a careful and gentle hand, he proceeds to place the fallen petals into his watch pocket with a sense of reverence. He then meticulously rearranges the flower, handling it with the utmost care, before turning back once more to face Zuzu. George, with tenderness and care, places the flower into a glass filled with refreshing, clear water that rests on the table situated right beside her bed. They begin to engage in a conversation, conducted in hushed tones, their whispers barely reaching the air. Mary makes her entrance into the room and immediately reaches to pick up the telephone. George moves into the frame, standing attentively beside her, listening intently, before suddenly snatching the phone away from Mary's grasp. She gently places a restraining hand on his arm in an attempt to calm him, but he shakes it off with a determined resolve. She simply cannot grasp that George's fiery tirade directed at Mrs. Welch is a manifestation of his deep-seated frustration—not just with her, but with the world at large, with life itself, and even with the divine. Mary manages to wrest the phone away from George’s firm grip and urgently, with swift purpose, speaks into the receiver. Out of nowhere, the telephone bursts to life with a commanding male voice. Mary once again tries to take control of the phone from him, but before he can craft an insult to surpass those directed at Welch, the definitive click of the phone is unmistakably heard. Overcome with mounting frustration, he yells at Tommy, who is energetically engrossed in playing with his vacuum cleaner. Meanwhile, Janie persists in her monotonous, repetitive piano practice. The room that was once bustling with various noises now falls ominously silent, disturbed only by George's heavy, strained breathing. George storms over to a corner of the room where his carefully set-up workshop resides—a drawing table accompanied by various detailed models of modern buildings, bridges, and the like. With savage movements, he kicks over the models, grabbing some books and hurling them forcefully into the corner. Mary and the children are left standing, watching in horror, stunned by the scene unfolding before them. George glances around, seeing them stare at him as if he has been transformed into some kind of wild, unknown creature. Mary and the children continue to gaze at him, completely shocked by his furious outburst. The oppressive silence remains unbroken until Janie begins to sob softly. The sight of Mary and the children's pain becomes too much for George to bear, compelling him to look around once more before hastily exiting through the front door of the house. Mary moves toward the phone, picking it up with a trembling hand. Meanwhile, in another setting, Potter sits at his desk, a goon seated beside him, diligently signing some papers. George sits in a chair facing the desk, missing his hat and coat, lightly dusted with delicate snow. George turns abruptly and starts to make his exit from the office just as Potter picks up the phone, beginning to dial numbers. By this time, George has already stepped out through the door. The camera moves closer with deliberate intent toward Potter. George emerges from the bank into the gently falling snow, makes his way across the street, struggling to tug open the door of his aging, worn car, and finally steps over the door, driving off into the wintry, barren landscape. The setting transitions to an Italian restaurant, featuring a vibrant bar area where the bottles gleam invitingly under the light. Christmas greens and holly adorn the establishment, infusing it with a festive, inviting spirit, much like Martini, who is busy warmly welcoming new arrivals. There’s an air of festivity and friendliness permeating the atmosphere, transforming it into a joyful party rather than just a public drinking venue."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He carefully pivots away from Zuzu, feigning interest in the flower as he pretends to adjust it, his fingers deftly collecting the fallen petals, which he discreetly tucks into the pocket of his watch. With a delicate touch, he rearranges the flower to look as natural as before, then turns back to face Zuzu. Gently, George places the flower into a glass of water resting on the table beside her bed, the quiet gesture laden with unspoken tenderness. In hushed tones, they share whispers, their voices barely audible. Just then, Mary enters the room, strides over to pick up the telephone, and George enters the frame, positioning himself beside her, keenly listening to her conversation. Suddenly, with a surge of emotion, he snatches the phone from Mary, who instinctively reaches out, placing a gentle yet firm hand on his arm in an attempt to calm him, but he brusquely shakes it off, as if casting aside a minor impediment. Unbeknownst to Mary, George's heated outburst toward Mrs. Welch is actually a vehement venting of his frustrations with the world, life, and even God. Mary manages to regain possession of the phone, quickly speaking into the receiver, but the line comes alive with a robust male voice, drowning out her words. She makes another attempt to retrieve the phone from him, but George, consumed by his feelings of resentment, is caught off guard when he hears an abrupt click on the line. Overwhelmed, he turns his attention to Tommy, who is noisily playing with his vacuum cleaner, and Janie, who is persistently practicing on the piano, her repetitive notes filling the air. Suddenly, the room falls into an eerie silence, the only discernible sound being George's heavy, labored breathing. Driven by a mounting rage, George heads to the corner of the room where his workshop is arranged, complete with a drawing table and numerous models of modern buildings and bridges. In a fit of raw emotion, he violently kicks over the models, the meticulously crafted structures tumbling to the ground, and with the same ferocity, he grabs books and hurls them into the corner with reckless abandon. Mary and the children, paralyzed by shock, watch in horror as George unleashes his fury. They gaze at him, their faces a mixture of fear and disbelief, as if witnessing a familiar figure transformed into an untamed beast. Surrounded by stunned silence, the air grows heavier until Janie's sobbing breaks through the stillness. The poignant sight of Mary and the children, visibly distressed by his actions, becomes unbearable for George, and he pauses to survey the scene before him, his heart heavy with regret. With urgency, he turns and swiftly exits through the front door of the house. Meanwhile, Mary returns to the phone, picking it up to resume the conversation. In another scene, Potter sits at his desk, signing papers with his goon at his side, when George, devoid of his hat and coat, sits solemnly before him, dusted with a light layer of snow. As Potter reaches for the phone to dial, George rises from his seat, turns, and makes his way out of the office. By this time, George has stepped outside, and as the focus shifts to Potter, George emerges from the bank into the snowy landscape, crossing the street with determination. He tugs at the door of his old car before finally stepping over it, settling in before driving away. The scene shifts to an Italian restaurant, where the bar gleams with sparkling bottles, and Christmas greens and holly embellish the space, infusing it with a warm, inviting spirit. Martini himself embodies this welcoming atmosphere, greeting new arrivals with a genuine warmth that permeates the establishment, making it feel more akin to a lively party than a mere public drinking place."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "George discreetly pockets fallen petals, adjusts the flower, and places it in a glass of water by Zuzu's bed, whispering with her. As Mary enters and answers the phone, George listens before aggressively taking it from her. Mary restrains him but fails to stop his outburst, which is more against life itself than the intended Mrs. Welch. After Mary retrieves the phone and briefly speaks, the call is interrupted by a powerful male voice, prompting further tension. George, frustrated by the noisy household and his own turmoil, violently disrupts his workshop, throwing models and books, leaving Mary and the children in shock and horror. Overwhelmed by their distress, George quickly exits the house. Meanwhile, Mary picks up the phone again. George, snow-covered, is next seen leaving a meeting with Potter, exiting the office as Potter makes a call. Crossing the street and struggling with his car door, George eventually drives off into the snowy evening. He arrives at an Italian restaurant, vibrant with Christmas decorations and a welcoming, festive atmosphere, where Martini greets new arrivals like guests at a party."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He turns his back to Zuzu, his young daughter who cherishes her garden of flowers, pretending to be tinkering with the flower, sticks the fallen petals in his watch pocket, rearranges the flower, and then turns back to Zuzu. George puts the flower in a glass of water on the table beside her bed, a small room adorned with Zuzu's art supplies and drawings. They whisper softly, sharing a moment of comfort. Mary comes in, wearing a worried expression that has become all too familiar, and picks up the phone. George enters shot and stands listening to her, then snatches the phone from Mary. She puts a restraining hand on his arm, but he shakes it off, his mind still consumed by the troubles of the day. She cannot know that George's tirade against Mrs. Welch, Zuzu's school teacher who had been giving him trouble over a school project, is really a tirade against the world, against life itself, against God. Mary succeeds in wresting the phone from George's hand and speaks quickly into the phone, trying to calm the situation. But the telephone is suddenly alive with a powerful male voice calling, likely that of Mr. Welch himself. Mary once more tries to take the phone from him. But before he can think of an insult to top Welch's, we hear a click on the phone, the call suddenly ended. He yells at Tommy, their little boy noisily playing with his vacuum cleaner, and Janie, their musically inclined daughter, is still practicing at the piano, monotonously. The room has suddenly become ominously quiet, the only sound being George's labored breathing, heavy with frustration. George goes over to a corner of the room where his workshop is set up—a drawing table, several models of modern buildings, bridges, etc., representing his unfulfilled dreams of being an architect. Savagely, he kicks over the models, picks up some books, and hurls them into the corner. Mary and the children watch, horrified by his rare display of anger. George looks around and sees them staring at him as if he were some unknown wild animal. Mary and the children stare at him, stunned by his furious outburst. There is silence in the room until Janie breaks into sobs, her tiny frame shaking with each breath. The sight of Mary and the children suffering is too much for George, so he looks around him, then quickly goes out the front door of the house, stepping into the cold, snow-covered street. Mary goes to the phone and picks it up, her thoughts racing on how to mend the situation. Potter, the wealthy and unscrupulous businessman who is George's antagonist, is seated at his desk, his goon beside him, signing some papers that likely involve the bank George is trying to save. George is seated in a chair before the desk, without a hat or coat, covered lightly with snow, a stark contrast to the warmth inside. George turns and starts out of the office as Potter picks up the phone and dials, beginning another manipulation. George is out of the door by now. The camera moves closer to Potter, highlighting his sinister intentions. George comes out of the bank into the falling snow, crosses the street, tugs at the door of his old car, finally steps over the door, and drives off, the car sputtering to life. The place is an Italian restaurant with a bar, the bottles sparkle, and there are Christmas greens and holly decorating the place, reminiscent of the holiday season. It has a warm, welcoming spirit, like Martini himself, a friendly man who immigrated years ago and became a beloved local figure, who is welcoming new arrivals. There is an air of festivity and friendliness, more like a party than a public drinking place, a harbor of warmth in George's troubled world."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "George goes over to a corner of the room where his workshop is set up—a drawing table several models of modern buildings bridges etc He turns his back to Zuzu pretending to be tinkering with the flower sticks the fallen petals in his watch pocket rearranges the flower and then turns back to Zuzu There is an air of festivity and friendliness more like a party than a public drinking place George puts the flower in a glass of water on the table beside her bed They whisper Mary comes in and picks up the phone George enters shot and stands listening to her then snatches the phone from Mary Mary succeeds in wresting the phone from George's hand and speaks quickly into the phone She puts a restraining hand on his arm but he shakes it off She cannot know that George's tirade against Mrs Welch is really a tirade against the world against life itself against God George puts the flower in a glass of water on the table beside her bed Mary succeeds in wresting the phone from George's hand and speaks quickly into the phone But the telephone is suddenly alive with a powerful male voice calling Mary once more tries to take the phone from him George enters shot and stands listening to her then snatches the phone from Mary But before he can think of an insult to top Welch's we hear a click on the phone Mary goes to the phone and picks it up He yells at Tommy noisily playing with his vacuum cleaner and Janie is still practicing at the piano monotonously He turns his back to Zuzu pretending to be tinkering with the flower sticks the fallen petals in his watch pocket rearranges the flower and then turns back to Zuzu Mary and the children stare at him stunned by his furious outburst George is seated in a chair before the desk without a hat or coat covered lightly with snow The room has suddenly become ominously quiet the only sound being George's labored breathing George goes over to a corner of the room where his workshop is set up—a drawing table several models of modern buildings bridges etc Savagely he kicks over the models picks up some books and hurls them into the corner Mary and the children watch horrified George looks around and sees them staring at him as if he were some unknown wild animal Mary and the children stare at him stunned by his furious outburst There is silence in the room until Janie breaks into sobs The sight of Mary and the children suffering is too much for George so he looks around him then quickly goes out the front door of the house Mary comes in and picks up the phone George looks around and sees them staring at him as if he were some unknown wild animal Mary goes to the phone and picks it up Potter is seated at his desk his goon beside him signing some papers George is seated in a chair before the desk without a hat or coat covered lightly with snow George turns and starts out of the office as Potter picks up the phone and dials George is out of the door by now The camera moves closer to Potter George comes out of the bank into the falling snow crosses the street tugs at the door of his old car finally steps over the door and drives off The place is an Italian restaurant with a bar They whisper the bottles sparkle and there are Christmas greens and holly decorating the place But the telephone is suddenly alive with a powerful male voice calling the bottles sparkle and there are Christmas greens and holly decorating the place It has a warm welcoming spirit like Martini himself who is welcoming new arrivals George comes out of the bank into the falling snow crosses the street tugs at the door of his old car finally steps over the door and drives off It has a warm welcoming spirit like Martini himself who is welcoming new arrivals There is an air of festivity and friendliness more like a party than a public drinking place"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He turns his back to Zuzu pretending to be tinkering with the flower sticks the fallen petals in his watch pocket rearranges the flower and then turns back to Zuzu. George puts the flower in a glass of water on the table beside her bed. They whisper. Mary comes in and picks up the phone. George enters shot and stands listening to her then snatches the phone from Mary. She puts a restraining hand on his arm but he shakes it off. She cannot know that George's tirade against Mrs Welch is really a tirade against the world against life itself against God. Mary succeeds in wresting the phone from George's hand and speaks quickly into the phone. But the telephone is suddenly alive with a powerful male voice calling. Mary once more tries to take the phone from him. But before he can think of an insult to top Welch's we hear a click on the phone. He yells at Tommy noisily playing with his vacuum cleaner and Janie is still practicing at the piano monotonously. The room has suddenly become ominously quiet the only sound being George's labored breathing. George goes over to a corner of the room where his workshop is set up—a drawing table several models of modern buildings bridges etc. Savagely. he kicks over the models picks up some books and hurls them into the corner. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Mary and the children watch horrified. George looks around and sees them staring at him as if he were some unknown wild animal. Mary and the children stare at him stunned by his furious outburst. There is silence in the room until Janie breaks into sobs. The sight of Mary and the children suffering is too much for George so he looks around him then quickly goes out the front door of the house. Mary goes to the phone and picks it up. Potter is seated at his desk his goon beside him signing some papers. George is seated in a chair before the desk without a hat or coat covered lightly with snow. George turns and starts out of the office as Potter picks up the phone and dials. George is out of the door by now. The camera moves closer to Potter. George comes out of the bank into the falling snow crosses the street tugs at the door of his old car finally steps over the door and drives off. The place is an Italian restaurant with a bar. the bottles sparkle and there are Christmas greens and holly decorating the place. It has a warm welcoming spirit like Martini himself who is welcoming new arrivals. There is an air of festivity and friendliness more like a party than a public drinking place."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He turns his back to Zuzu pretending to be tinkering with the flower sticks the fallen petals in his watch pocket rearranges the flower and then turns back to Zuzu. George puts the flower in a glass of water on the table beside her bed. They whisper. Mary comes in and picks up the phone. George enters shot and stands listening to her then snatches the phone from Mary. She puts a restraining hand on his arm but he shakes it off. She cannot know that George's tirade against Mrs Welch is really a tirade against the world against life itself against God. Mary succeeds in wresting the phone from George's hand and speaks quickly into the phone. But the telephone is suddenly alive with a powerful male voice calling. Mary once more tries to take the phone from him. But before he can think of an insult to top Welch's we hear a click on the phone. He yells at Tommy noisily playing with his vacuum cleaner and Janie is still practicing at the piano monotonously. The room has suddenly become ominously quiet the only sound being George's labored breathing. George goes over to a corner of the room where his workshop is set up—a drawing table several models of modern buildings bridges etc. Savagely. he kicks over the models picks up some books and hurls them into the corner. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Mary and the children watch horrified. George looks around and sees them staring at him as if he were some unknown wild animal. Mary and the children stare at him stunned by his furious outburst. There is silence in the room until Janie breaks into sobs. The sight of Mary and the children suffering is too much for George so he looks around him then quickly goes out the front door of the house. Mary goes to the phone and picks it up. Potter is seated at his desk his goon beside him signing some papers. George is seated in a chair before the desk without a hat or coat covered lightly with snow. George turns and starts out of the office as Potter picks up the phone and dials. George is out of the door by now. The camera moves closer to Potter. George comes out of the bank into the falling snow crosses the street tugs at the door of his old car finally steps over the door and drives off. The place is an Italian restaurant with a bar. the bottles sparkle and there are Christmas greens and holly decorating the place. It has a warm welcoming spirit like Martini himself who is welcoming new arrivals. There is an air of festivity and friendliness more like a party than a public drinking place."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He turns his back to Zuzu pretending to be tinkering with the flower sticks the fallen petals in his watch pocket rearranges the flower and then turns back to Zuzu. George puts the flower in a glass of water on the table beside her bed. They whisper. Mary comes in and picks up the phone. George enters shot and stands listening to her then snatches the phone from Mary. She puts a restraining hand on his arm but he shakes it off. She cannot know that George's tirade against Mrs Welch is really a tirade against the world against life itself against God. Mary succeeds in wresting the phone from George's hand and speaks quickly into the phone. George turns and starts out of the office as Potter picks up the phone and dials. George is out of the door by now. The camera moves closer to Potter. George comes out of the bank into the falling snow crosses the street tugs at the door of his old car finally steps over the door and drives off. The place is an Italian restaurant with a bar. the bottles sparkle and there are Christmas greens and holly decorating the place. It has a warm welcoming spirit like Martini himself who is welcoming new arrivals. There is an air of festivity and friendliness more like a party than a public drinking place."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He turns his back to Zuzu pretending to be tinkering with the flower sticks the fallen petals in his watch pocket rearranges the flower and then turns back to Zuzu. George puts the flower in a glass of water on the table beside her bed. They whisper. Mary comes in and picks up the phone. the bottles sparkle and there are Christmas greens and holly decorating the place. It has a warm welcoming spirit like Martini himself who is welcoming new arrivals. There is an air of festivity and friendliness more like a party than a public drinking place."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The rabbit turns his back to Zuzu, pretending to be tinkering with the flower, sticks the fallen petals in his watch pocket, rearranges the flower, and then turns back to Zuzu. The owl puts the flower in a glass of water on the table beside her bed. They whisper. The crow comes in and picks up the phone. The owl enters shot and stands listening to her, then snatches the phone from the crow. The crow puts a restraining hand on his arm, but he shakes it off. The crow cannot know that the owl's tirade against Mrs. Welch is really a tirade against the world, against life itself, against God. The crow succeeds in wresting the phone from the owl's hand and speaks quickly into the phone. But the telephone is suddenly alive with a powerful male voice calling. The crow once more tries to take the phone from him. But before he can think of an insult to top Welch's, we hear a click on the phone. The owl yells at the turtle, noisily playing with his vacuum cleaner, and the parrot is still practicing at the piano, monotonously. The room has suddenly become ominously quiet, the only sound being the owl's labored breathing. The owl goes over to a corner of the room where his workshop is set up—a drawing table, several models of modern buildings, bridges, etc. Savagely, he kicks over the models, picks up some books, and hurls them into the corner. The crow and the children watch, horrified. The owl looks around and sees them staring at him as if he were some unknown wild animal. The crow and the children stare at him, stunned by his furious outburst. There is silence in the room until the parrot breaks into sobs. The sight of the crow and the children suffering is too much for the owl, so he looks around him, then quickly goes out the front door of the house. The crow goes to the phone and picks it up. The fox is seated at his desk, his goon beside him, signing some papers. The owl is seated in a chair before the desk, without a hat or coat, covered lightly with snow. The owl turns and starts out of the office as the fox picks up the phone and dials. The owl is out of the door by now. The camera moves closer to the fox. The owl comes out of the bank into the falling snow, crosses the street, tugs at the door of his old car, finally steps over the door, and drives off. The place is an Italian restaurant with a bar, the bottles sparkle, and there are Christmas greens and holly decorating the place. It has a warm, welcoming spirit, like the rooster himself, who is welcoming new arrivals. There is an air of festivity and friendliness, more like a party than a public drinking place."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He turns his back to Zuzu, pretending to be tinkering with the bicycle, sticks the fallen screws in his coat pocket, rearranges the bicycle, and then turns back to Zuzu. George puts the bicycle in a pot on the table beside her couch. They whisper. Mary comes in and picks up the remote. George enters shot and stands listening to her, then snatches the remote from Mary. She puts a restraining hand on his arm, but he shakes it off. She cannot know that George's tirade against Mrs. Welch is really a tirade against the universe, against destiny itself, against fate. Mary succeeds in wresting the remote from George's hand and speaks quickly into the remote. But the radio is suddenly alive with a powerful male voice calling. Mary once more tries to take the remote from him. But before he can think of an insult to top Welch's, we hear a click on the remote. He yells at Tommy, noisily playing with his roller skates, and Janie is still practicing at the harp, monotonously. The room has suddenly become ominously quiet, the only sound being George's labored breathing. George goes over to a corner of the room where his studio is set up—a sewing machine, several models of modern sculptures, paintings, etc. Savagely, he kicks over the models, picks up some newspapers, and hurls them into the corner. Mary and the children watch, horrified. George looks around and sees them staring at him as if he were some unknown wild creature. Mary and the children stare at him, stunned by his furious outburst. There is silence in the room until Janie breaks into sobs. The sight of Mary and the children suffering is too much for George, so he looks around him, then quickly goes out the back door of the apartment. Mary goes to the remote and picks it up. Potter is seated at his counter, his guard beside him, signing some letters. George is seated in a stool before the counter, without a scarf or gloves, covered lightly with sand. George turns and starts out of the stall as Potter picks up the remote and dials. George is out of the stall by now. The camera moves closer to Potter. George comes out of the library into the falling sand, crosses the aisle, tugs at the door of his old bicycle, finally steps over the door, and rides off. The place is a French bakery with a café, the pastries sparkle, and there are sunflowers and daisies decorating the place. It has a warm, welcoming spirit, like Martini himself, who is welcoming new arrivals. There is an air of festivity and friendliness, more like a celebration than a public dining place."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He leans away from Zuzu, pretending to be adjusting with the flower, tucks the fallen petals in his watch pocket, modifies the flower, and then turns back to Zuzu. George places the flower in a vase of water on the table beside her bed. They murmur. Mary comes in and waves at the phone. George moves into view and stands observing her, then lifts the phone from Mary. She places a restraining hand on his arm, but he brushes it off. She cannot know that George's rant against Mrs. Welch is really a rant against the world, against life itself, against God. Mary succeeds in snatching the phone from George's hand and speaks quickly into the phone. But the telephone is suddenly filled with a powerful male voice shouting. Mary once more tries to grip the phone from him. But before he can devise an insult to surpass Welch's, we hear a disconnect on the phone. He shouts at Tommy, busily toying with his vacuum cleaner, and Janie is still practicing at the piano, endlessly. The room has suddenly become eerily quiet, the only sound being George's labored breathing. George moves over to a corner of the room where his workshop is set up—a drawing table, several models of modern buildings, bridges, etc. Fiercely, he knocks over the models, grabs some books, and tosses them into the corner. Mary and the children watch, aghast. George glances around and sees them staring at him as if he were some unknown wild animal. Mary and the children eye him, stunned by his furious outburst. There is silence in the room until Janie bursts into sobs. The sight of Mary and the children suffering is too much for George, so he glances around him, then quickly exits out the front door of the house. Mary goes to the phone and grabs it. Potter is stationed at his desk, his goon beside him, examining some papers. George is seated in a chair before the desk, without a hat or coat, covered lightly with snow. George rotates and proceeds out of the office as Potter grabs the phone and taps. George is out of the door by now. The camera zooms closer to Potter. George emerges from the bank into the falling snow, crosses the street, pulls at the door of his old car, finally climbs over the door, and drives off. The place is an Italian restaurant with a bar, the bottles shine, and there are Christmas greens and holly embellishing the place. It has a warm, inviting spirit, like Martini himself, who is appreciating new arrivals. There is an air of celebration and camaraderie, more like a gathering than a public drinking place."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The bookshelf turns its back to the giraffe, pretending to be tinkering with the refrigerator, sticks the fallen spoons in its shoe pocket, rearranges the refrigerator, and then turns back to the giraffe. The elephant puts the refrigerator in a glass of milk on the plate beside its pillow. They whisper. The kangaroo comes in and picks up the drumstick. The elephant enters shot and stands listening to it, then snatches the drumstick from the kangaroo. It puts a restraining shoe on its elbow, but it shakes it off. It cannot know that the elephant's tirade against the mirror is really a tirade against the box, against the chair itself, against the cloud. The kangaroo succeeds in wresting the drumstick from the elephant’s shoe and speaks quickly into the drumstick. But the saxophone is suddenly alive with a powerful snow globe voice calling. The kangaroo once more tries to take the drumstick from it. But before it can think of an insult to top the mirror's, we hear a click on the drumstick. It yells at the lamp, noisily playing with its hairbrush, and the watermelon is still practicing at the blender, monotonously. The window has suddenly become ominously quiet, the only sound being the elephant's labored breathing. The elephant goes over to a corner of the window where its playground is set up—a painting easel, several models of old mountains, rivers, etc. Savagely, it kicks over the models, picks up some keys, and hurls them into the corner. The kangaroo and the apples watch, horrified. The elephant looks around and sees them staring at it as if it were some unknown wild banana. The kangaroo and the apples stare at it, stunned by its furious outburst. There is silence in the window until the watermelon breaks into sobs. The sight of the kangaroo and the apples suffering is too much for the elephant, so it looks around it, then quickly goes out the back door of the umbrella. The kangaroo goes to the drumstick and picks it up. The penguin is seated at its bench, its raccoon beside it, signing some sneakers. The elephant is seated in a pillow before the bench, without a glove or scarf, covered lightly with marbles. The elephant turns and starts out of the workshop as the penguin picks up the drumstick and dials. The elephant is out of the umbrella by now. The telescope moves closer to the penguin. The elephant comes out of the library into the falling marbles, crosses the carpet, tugs at the handle of its young scooter, finally steps over the handle, and drives off. The pillow is a Spanish zoo with a shelf, the maps sparkle, and there are Halloween gourds and ivy decorating the pillow. It has a warm, welcoming spirit, like Pinecone itself, who is welcoming new departures. There is an air of festivity and friendliness, more like a puzzle than a private swimming pillow."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "She spins around from Rufus, feigning to be constructing with the vase, slips the fallen leaves into her coat pocket, adjusts the vase, and then spins back to Rufus. Elena places the vase in a bowl of sand on the shelf beside his chair. They shout. Lisa rushes in and grabs the remote. Elena jumps into view and sits observing her, then grabs the remote from Lisa. He places a cautious hand on her shoulder, but she pulls it away. He cannot know that Elena's outburst against Mr. Wallace is really an outburst against the ocean, against the moon itself, against fate. Lisa manages to retrieve the remote from Elena's grip and yells softly into the remote. But the radio is suddenly resonating with a melodic female voice singing. Lisa once more struggles to hold the remote from her. But before she can think of a song to surpass Wallace's, we hear a buzz on the radio. She whispers to Bobby, silently chatting with his vacuum cleaner, and Jenny is still reading at the desk, quietly. The space has suddenly grown eerily noisy, the only sound being Elena's calm breathing. Elena stomps over to a side of the space where her studio is organized—a drawing board, several sculptures of ancient statues, monuments, etc. Calmly, she pushes over the sculptures, grabs some canvases, and sets them down into the side. Lisa and the siblings observe, amused. Elena glances around and sees them gawking at her as if she were some known gentle creature. Lisa and the siblings gaze at her, impressed by her cheerful display. There is clamoring in the space until Jenny launches into laughter. The sight of Lisa and the siblings laughing is too much for Elena, so she glances beside her, then slowly walks in through the back door of the room. Lisa walks to the remote and grabs it. Shelby is standing at his couch, his assistant behind him, reviewing some magazines. Elena is lying in a sofa beside the couch, wearing a scarf and gloves, covered heavily with rain. Elena glances and strides into the lobby as Shelby grabs the remote and tunes. Elena is inside the window by then. The camera zooms away from Shelby. Elena rushes into the beach under the rising rain, crosses the alley, pulls at the hood of her small boat, finally jumps under the hood, and sails off. The setting is a French café with a stage, the glasses shimmer, and there are holiday lights and ivy adorning the space. It has a cool, soothing atmosphere, like Pablo himself, who is soothing old visitors. There is an air of calm and gentleness, more like a lounge than a private dining room."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He turns his back to Zuzu, pretending to be fiddling with the blanket, slips the fallen feathers in his shoe pocket, repositions the blanket, and then pivots back to Zuzu. George places the blanket in a bowl of tea on the table beside her chair. They murmur. Mary comes in and grabs the remote control. George enters the frame and stands eavesdropping on her, then snatches the remote from Mary. She places a guiding hand on his shoulder, but he shrugs it off. She cannot know that George's diatribe against Mrs. Welch is really a diatribe against the universe, against existence itself, against fate. Mary manages to pry the remote from George's grip and speaks urgently into the remote. But the TV is suddenly alive with a powerful male announcer calling. Mary once more attempts to take the remote from him. But before he can concoct an insult to surpass Welch's, we hear a click on the remote. He hollers at Tommy, noisily playing with his toy drum, and Janie is still practicing at the flute, repetitively. The room has suddenly become eerily silent, the only sound being George's ragged breathing. George goes over to a corner of the room where his studio is set up—a sewing table, several designs of modern dresses, jackets, etc. Brutally, he knocks over the designs, grabs some magazines, and flings them into the corner. Mary and the children watch, aghast. George looks around and sees them gaping at him as if he were some unknown wild animal. Mary and the children stare at him, shocked by his furious outburst. There is silence in the room until Janie breaks into tears. The sight of Mary and the children distressed is too much for George, so he glances around him, then swiftly exits through the back door of the house. Mary goes to the remote and picks it up. Potter is seated at his workbench, his assistant beside him, signing some sketches. George is seated in a chair before the bench, without a scarf or gloves, covered lightly with dust. George turns and starts out of the studio as Potter picks up the remote and changes channels. George is out of the door by now. The camera moves closer to Potter. George emerges from the post office into the swirling dust, crosses the alley, tugs at the door of his old bicycle, finally steps over the handlebars, and pedals off. The place is a French cinema with a lobby, the projectors sparkle, and there are movie posters and ribbons decorating the place. It has a cozy, inviting spirit, like Martini himself, who is welcoming the new visitors. There is an air of celebration and camaraderie, more like a festival than a public viewing space."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "He rotates his view away from Ziggy, pretending to be adjusting with the bicycle, stuffs the loose screws in his wallet slot, repositions the bicycle, and then swivels back to Ziggy. Larry places the bicycle in a cup of juice on the chair beside his couch. They mumble. Lucy enters and grabs the remote. Larry appears in frame and stands eavesdropping on her, then grabs the remote from Lucy. She places a cautionary foot on his knee, but he shrugs it off. She cannot suspect that Larry's rant against Mr. Wilson is indeed a rant against the universe, against fate itself, against destiny. Lucy manages to pry the remote from Larry's fingers and speaks rapidly into the remote. But the remote is abruptly alive with a booming female voice shouting. Lucy once again attempts to seize the remote from him. But before he can dream of a retort to surpass Wilson's, we perceive a beep on the remote. He shouts at Timmy, loudly playing with his skateboard, and Jenny is still rehearsing on the guitar, repetitively. The house has suddenly turned eerily silent, the sole sound being Larry's heavy breathing. Larry moves to a niche of the house where his studio is arranged—a drafting board, several replicas of futuristic sculptures, towers, etc. Violently, he stomps on the replicas, grabs a few magazines, and flings them into the niche. Lucy and the kids watch, aghast. Larry glances around and notices them gawking at him as if he were an unfamiliar feral beast. Lucy and the kids gaze at him, shocked by his stormy episode. There is hush in the house until Jenny bursts into tears. The image of Lucy and the kids distressed is overwhelming for Larry, so he surveys around him, then swiftly exits through the back gate of the yard. Lucy approaches the remote and lifts it. Jones is positioned at his counter, his sidekick near him, endorsing some letters. Larry is positioned in a stool before the counter, without a scarf or gloves, covered softly with ash. Larry turns and proceeds out of the studio as Jones grabs the remote and dials. Larry is beyond the gateway by now. The footage zooms in on Jones. Larry exits the arcade into the drifting ash, traverses the avenue, yanks at the latch of his antique van, finally leaps over the latch, and zooms off. The locale is a Greek café with a lounge, the glasses shimmer, and there are winter branches and ivy embellishing the locale. It possesses a cozy, inviting essence, like Sangria himself, who is greeting fresh guests. There is an aura of celebration and camaraderie, more akin to a gala than a communal drinking venue."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "George, after a tense exchange with Mary and a tirade against Mrs. Welch, unleashes his anger on his surroundings, knocking over models and books in his workshop. His family, horrified by his outburst, looks on in silence until Janie begins to sob, prompting George to leave the house. Outside, seated in front of Potter's desk, George is lost in thought, covered in snow, before exiting into the falling snow. He struggles with his car door, eventually driving off to an Italian restaurant filled with a festive atmosphere. Martini, the owner, welcomes new arrivals, creating a warm, party-like ambiance in the bar."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "There is an air of festivity and friendliness more like a party than a public drinking place It has a warm welcoming spirit like Martini himself who is welcoming new arrivals the bottles sparkle and there are Christmas greens and holly decorating the place The place is an Italian restaurant with a bar George comes out of the bank into the falling snow crosses the street tugs at the door of his old car finally steps over the door and drives off The camera moves closer to Potter George is out of the door by now George turns and starts out of the office as Potter picks up the phone and dials George is seated in a chair before the desk without a hat or coat covered lightly with snow Potter is seated at his desk his goon beside him signing some papers Mary goes to the phone and picks it up The sight of Mary and the children suffering is too much for George so he looks around him then quickly goes out the front door of the house There is silence in the room until Janie breaks into sobs Mary and the children stare at him stunned by his furious outburst George looks around and sees them staring at him as if he were some unknown wild animal Mary and the children watch horrified he kicks over the models picks up some books and hurls them into the corner Savagely George goes over to a corner of the room where his workshop is set up—a drawing table several models of modern buildings bridges etc The room has suddenly become ominously quiet the only sound being George's labored breathing He yells at Tommy noisily playing with his vacuum cleaner and Janie is still practicing at the piano monotonously But before he can think of an insult to top Welch's we hear a click on the phone Mary once more tries to take the phone from him But the telephone is suddenly alive with a powerful male voice calling Mary succeeds in wresting the phone from George's hand and speaks quickly into the phone She cannot know that George's tirade against Mrs Welch is really a tirade against the world against life itself against God She puts a restraining hand on his arm but he shakes it off George enters shot and stands listening to her then snatches the phone from Mary Mary comes in and picks up the phone They whisper George puts the flower in a glass of water on the table beside her bed He turns his back to Zuzu pretending to be tinkering with the flower sticks the fallen petals in his watch pocket rearranges the flower and then turns back to Zuzu"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The camera moves closer to Potter She puts a restraining hand on his arm but he shakes it off But before he can think of an insult to top Welch's we hear a click on the phone he kicks over the models picks up some books and hurls them into the corner George is out of the door by now He yells at Tommy noisily playing with his vacuum cleaner and Janie is still practicing at the piano monotonously Potter is seated at his desk his goon beside him signing some papers She cannot know that George's tirade against Mrs Welch is really a tirade against the world against life itself against God There is silence in the room until Janie breaks into sobs The room has suddenly become ominously quiet the only sound being George's labored breathing Mary and the children watch horrified Mary once more tries to take the phone from him The place is an Italian restaurant with a bar Savagely George turns and starts out of the office as Potter picks up the phone and dials The sight of Mary and the children suffering is too much for George so he looks around him then quickly goes out the front door of the house It has a warm welcoming spirit like Martini himself who is welcoming new arrivals George puts the flower in a glass of water on the table beside her bed George goes over to a corner of the room where his workshop is set up—a drawing table several models of modern buildings bridges etc Mary and the children stare at him stunned by his furious outburst They whisper George looks around and sees them staring at him as if he were some unknown wild animal Mary goes to the phone and picks it up Mary comes in and picks up the phone the bottles sparkle and there are Christmas greens and holly decorating the place George enters shot and stands listening to her then snatches the phone from Mary George comes out of the bank into the falling snow crosses the street tugs at the door of his old car finally steps over the door and drives off There is an air of festivity and friendliness more like a party than a public drinking place But the telephone is suddenly alive with a powerful male voice calling George is seated in a chair before the desk without a hat or coat covered lightly with snow He turns his back to Zuzu pretending to be tinkering with the flower sticks the fallen petals in his watch pocket rearranges the flower and then turns back to Zuzu Mary succeeds in wresting the phone from George's hand and speaks quickly into the phone"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Mary and the children watch horrified George looks around and sees them staring at him as if he were some unknown wild animal Mary and the children stare at him stunned by his furious outburst There is silence in the room until Janie breaks into sobs The sight of Mary and the children suffering is too much for George so he looks around him then quickly goes out the front door of the house Mary goes to the phone and picks it up Potter is seated at his desk his goon beside him signing some papers George is seated in a chair before the desk without a hat or coat covered lightly with snow George turns and starts out of the office as Potter picks up the phone and dials George is out of the door by now The camera moves closer to Potter George comes out of the bank into the falling snow crosses the street tugs at the door of his old car finally steps over the door and drives off The place is an Italian restaurant with a bar the bottles sparkle and there are Christmas greens and holly decorating the place It has a warm welcoming spirit like Martini himself who is welcoming new arrivals There is an air of festivity and friendliness more like a party than a public drinking place He turns his back to Zuzu pretending to be tinkering with the flower sticks the fallen petals in his watch pocket rearranges the flower and then turns back to Zuzu George puts the flower in a glass of water on the table beside her bed They whisper Mary comes in and picks up the phone George enters shot and stands listening to her then snatches the phone from Mary She puts a restraining hand on his arm but he shakes it off She cannot know that George's tirade against Mrs Welch is really a tirade against the world against life itself against God Mary succeeds in wresting the phone from George's hand and speaks quickly into the phone But the telephone is suddenly alive with a powerful male voice calling Mary once more tries to take the phone from him But before he can think of an insult to top Welch's we hear a click on the phone He yells at Tommy noisily playing with his vacuum cleaner and Janie is still practicing at the piano monotonously The room has suddenly become ominously quiet the only sound being George's labored breathing George goes over to a corner of the room where his workshop is set up—a drawing table several models of modern buildings bridges etc Savagely he kicks over the models picks up some books and hurls them into the corner"
        }
      ]
    }
  ]
}