{
  "ground_truth": "The wind carries something in a circle, sometimes violently or soaring skyward, before letting it float to the ground. Jane and Ricky sit on the bed watching his wide-screen TV. Jane watches Ricky and then takes his hand. He scans her eyes, curious about her reaction, and she kisses him softly. Lester sits at the table in sloppy clothes, eating voraciously and drinking beer, while Carolyn watches him with contempt. Jane stares at her parents, apprehensive. Jane obeys, surprised by his voice's power. Lester gets a plate of asparagus, serves himself, and then hurls it against the wall, frightening Carolyn and Jane, but continues eating as if nothing happened. Jane stares at her plate. She sits on her bed, hears a knock, rolls her eyes, and lets Carolyn in. Carolyn stares at Jane, starts crying, slaps her hard, and leaves embarrassed. Jane looks in the mirror, rubs her cheek, crosses to the window, and looks out. Across from Ricky's room, Ricky stands at the window with his digicam, videotaping her. Behind Ricky, he videotapes Jane, who waves, then starts to take off her shirt until she is in her bra. She clumsily takes off her bra as we zoom in, and on the TV behind him, we see Jane in her window. She stands exposed, trying to look defiant but is vulnerable. Suddenly, the Colonel enters, incensed. Ricky turns around, realizes the situation, and tries to dodge his father, but the Colonel punches Ricky, knocking him to the floor. Jane watches from her window, pulling the drapes. Ricky's lip bleeds, but he maintains his gaze at his father during the beating, and the Colonel continues to hit him in the window across from her.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The breeze transports something in a loop, occasionally fiercely or ascending upward, before allowing it to drift to the soil. Jane and Ricky perch on the mattress observing his large-display TV. Jane observes Ricky and then grasps his hand. He scans her eyes, intrigued about her response, and she kisses him gently. Lester perches at the table in untidy garments, consuming ravenously and sipping ale, while Carolyn observes him with disdain. Jane gazes at her parents, uneasy. Jane complies, astonished by his voice's strength. Lester obtains a dish of asparagus, serves himself, and then flings it against the barrier, alarming Carolyn and Jane, but persists in eating as if nothing occurred. Jane gazes at her dish. She perches on her mattress, hears a knock, rolls her eyes, and allows Carolyn in. Carolyn gazes at Jane, begins weeping, slaps her firmly, and exits ashamed. Jane looks in the mirror, rubs her cheek, crosses to the window, and looks out. Opposite Ricky's room, Ricky stands at the window with his camcorder, recording her. Behind Ricky, he records Jane, who waves, then begins to remove her blouse until she is in her bra. She awkwardly removes her bra as we zoom in, and on the TV behind him, we see Jane in her window. She stands exposed, attempting to appear defiant but is susceptible. Abruptly, the Colonel enters, enraged. Ricky turns around, realizes the circumstance, and tries to evade his father, but the Colonel strikes Ricky, knocking him to the floor. Jane observes from her window, drawing the curtains. Ricky's lip bleeds, but he sustains his stare at his father during the thrashing, and the Colonel continues to hit him in the window opposite her."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Something is carried by the wind in a circle, sometimes violently or soaring skyward, before it is let float to the ground. The bed is sat on by Jane and Ricky, who watch his wide-screen TV. Ricky is watched by Jane before his hand is taken by her. Her eyes are scanned by him, curious about her reaction, and he is kissed softly by her. The table is occupied by Lester in sloppy clothes as he eats voraciously and drinks beer, while he is watched by Carolyn with contempt. Her parents are stared at by Jane, apprehensive. She is surprised by the power of his voice and obeys. A plate of asparagus is taken by Lester, served to himself, and then it is hurled by him against the wall, frightening Carolyn and Jane, but he continues eating as if nothing happened. Her plate is stared at by Jane. Her bed is sat on by her, a knock is heard, her eyes are rolled, and Carolyn is let in. Jane is stared at by Carolyn, who starts crying, slaps her hard, and leaves embarrassed. The mirror is looked into by Jane, her cheek is rubbed, she crosses to the window, and looks out. Across from Ricky's room, Jane is videotaped by Ricky at the window with his digicam. Behind Ricky, Jane is videotaped by him, who waves, then starts to take off her shirt until she is in her bra. Her bra is clumsily taken off, and as we zoom in, Jane is seen in her window on the TV behind Ricky. She stands exposed, trying to look defiant but is vulnerable. Suddenly, the Colonel enters, incensed. Ricky turns around, realizes the situation, and his father is tried to be dodged by him, but Ricky is punched by the Colonel, and he is knocked to the floor. Jane watches from her window, pulling the drapes. Ricky's lip bleeds, but his gaze is maintained at his father during the beating, and Ricky is continued to be hit by the Colonel in the window across from her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The wind tosses something in a circle, either violently or lofting skyward, before dropping it to the ground. Jane and Ricky sit on the bed, watching his wide-screen TV. Jane observes Ricky, takes his hand, and kisses him softly. Lester sits at the table in sloppy clothes, eating voraciously and drinking beer, while Carolyn watches contemptuously. Jane observes her parents, apprehensive, and is surprised by her father's commanding voice. Lester serves himself asparagus, then hurls it against the wall, frightening Carolyn and Jane, but continues eating unaffected. Jane looks at her plate. Sitting on her bed, she hears a knock, rolls her eyes, and lets Carolyn in. Carolyn stares at Jane, starts crying, slaps her hard, and leaves embarrassed. Jane rubs her cheek, crosses to the window, and looks out. Across from Ricky's room, Ricky films her with his digicam. Jane waves, starts undressing until she's in her bra, and then awkwardly removes it. The TV behind Ricky captures Jane at her window, trying to appear defiant but vulnerable. Suddenly, the Colonel enters, incensed. Ricky turns, sees his father, and tries to dodge him, but the Colonel punches Ricky, knocking him down. Jane pulls the drapes as Ricky's lip bleeds, but he keeps his gaze on his father, who continues to hit him in the window opposite."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The wind carries something in circles, sometimes violently or skyward, before gently landing. Jane and Ricky sit on the bed watching TV. Jane watches Ricky, takes his hand, he scans her eyes, and she kisses him softly. Lester eats and drinks sloppily while Carolyn looks on disdainfully. Jane watches her parents, feeling uneasy, and obeys when Lester violently throws asparagus, frightening Carolyn and Jane. Later, Jane hears a knock, rolls her eyes, lets Carolyn in. Carolyn cries, slaps Jane, then leaves embarrassed. Jane, rubbing her cheek, looks out the window to see Ricky videotaping her. Waving, Jane removes her shirt and bra, trying to appear defiant yet vulnerable. The Colonel enters, incensed, and punches Ricky, knocking him down. Jane watches from her window, pulling the drapes, as Ricky maintains his gaze at his father, who continues hitting him in view of Jane."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The wind possesses an unseen power, carrying an object in a circular dance; at times, it moves with violent force, while at others, it soars gracefully skyward, before finally allowing the item to drift gently down to the earth. Meanwhile, Jane and Ricky are positioned comfortably on the bed, taking in the images flickering across his large, widescreen television. Jane's gaze shifts from the screen to Ricky, observing him thoughtfully, before she reaches out to take his hand in hers. As he scans her eyes with curiosity, eager to read her reaction, she leans in and kisses him softly. In another part of the house, Lester is seated at the table, dressed in messy, unkempt clothing, consuming his meal with a voracious appetite and washing it down with beer. Carolyn watches him intently, her face set with contempt. Jane, witnessing her parents' interaction, feels a wave of apprehension. Obeying an unspoken command, she is taken aback by the sheer power of the voice. Lester grabs a plate filled with asparagus, serves himself generously, and in a sudden outburst, throws it against the wall, startling both Carolyn and Jane. Nevertheless, he continues to eat as if the episode had never occurred. Jane's eyes remain fixed on her untouched plate. Later, she sits on her bed, hearing an unexpected knock at her door. She rolls her eyes in response before allowing Carolyn to enter. Carolyn's eyes meet Jane's, and moments later, she begins to cry, overwhelmed with emotion, before slapping Jane hard across the face and departing in embarrassment. Jane directs her gaze to the mirror, gently rubbing her smarting cheek. She moves towards the window, looking out across to the room where Ricky stands at his window, digital camera in hand, capturing her on video. Behind Ricky, the scene unfolds as he records Jane, who waves at him before slowly starting to remove her shirt, revealing her bra. Awkwardly, she removes the bra as we zoom in for a closer view, shown simultaneously on the television behind him, capturing her presence at her window. She stands exposed, attempting to exude defiance but betraying a sense of vulnerability. Abruptly, the Colonel bursts into the room, filled with rage. Ricky turns to face him, realizing the gravity of the situation, and attempts to evade his father’s anger, but the Colonel strikes Ricky, knocking him down to the floor. From her window, Jane watches the altercation, hastily pulling the drapes closed. Ricky’s lip bleeds, yet his gaze remains defiantly locked on his father during the beating, as the Colonel continues to assault him in full view of the window directly across from where Jane stands."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The wind, with its invisible yet undeniable power, possesses the remarkable ability to carry an object through the air in a mesmerizing, circular dance. Sometimes, it propels the object forward with a violent and relentless force, while at other times, it gently guides it to soar gracefully skyward before finally allowing it to drift softly back down to the earth below. At the same time, Jane and Ricky find themselves comfortably positioned on the bed, their attention captivated by the images flickering across the expansive screen of his large, widescreen television. Jane shifts her gaze away from the moving pictures, directing her eyes thoughtfully towards Ricky. She observes him with a contemplative expression before reaching out with tenderness to take his hand gently in hers. As Ricky notices this gesture, he scans her eyes with curiosity, eager and anticipatory to read her reaction. Jane then leans in closer, pressing her lips softly against his in a gentle kiss.\n\nIn another part of the house, Lester sits at the dining table, clad in messy, unkempt clothing that mirrors his disheveled appearance. He consumes his meal with a voracious appetite, barely pausing as he washes it down with swigs of beer. Carolyn stands nearby, watching him with intense focus; her facial expression is set in steely contempt. Jane, witnessing her parents' tense interaction, feels a wave of apprehension wash over her, as though she is obeying an unspoken command. She is taken aback by the sheer authoritative power of the voice, as if compelled against her will. In the heat of the moment, Lester grabs a plate heaped with asparagus and serves himself generously, but in an unexpected outburst, he hurls it against the wall, startling both Carolyn and Jane. Despite the disturbance, he resumes eating as if the chaotic episode had never occurred, unfazed and undeterred. Jane’s eyes remain focused on her untouched plate, reflecting her internal conflict.\n\nLater, as she sits on her bed, she hears an unexpected knock at her door, prompting her to roll her eyes in exasperation before granting Carolyn entry. Carolyn’s eyes meet Jane’s, and moments later, overwhelmed by emotions, she begins to cry. Overcome with anguish, she slaps Jane hard across the face before hurriedly departing, overcome with embarrassment at her own actions. Jane, feeling the sting of the slap, directs her gaze to the mirror, gently rubbing her smarting cheek. She then moves towards the window, where she looks out and across to the room opposite, where Ricky stands at his window. Ricky raises a digital camera in his hand, capturing her image on video. Behind Ricky, the scene unfolds as he records Jane, who acknowledges his presence by waving at him. Slowly and with some hesitation, she begins to remove her shirt, revealing the bra underneath. Awkwardly, she removes the bra as the camera zooms in for a closer view, broadcasting her presence in the window, now displayed on the television behind him. She stands exposed, attempting to exude defiance, even as a sense of vulnerability seeps through her demeanor.\n\nSuddenly, the Colonel bursts into the room, his rage palpable and intense. Ricky turns to face the sudden intrusion, realizing the gravity and seriousness of the situation. He attempts to evade his father’s intense anger, but the Colonel’s fury is uncontainable, and he strikes Ricky, knocking him down to the floor with force. From her window, Jane watches the altercation unfold, hastily pulling the drapes closed to shield herself from the scene. Ricky’s lip bleeds, yet his gaze remains defiantly locked onto his father, even as he continues to endure the assault. The Colonel continues to unleash his anger, striking Ricky repeatedly, all in full view of the window directly across from where Jane stands, observing the distressing events unfolding before her very eyes."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The wind picks up an object and sends it swirling in a circle, at times with ferocity, at others, lifting it high into the air, before it drifts gently back down to the earth. Inside, Jane and Ricky are perched on the bed, their gaze fixed on the large screen of the television. Jane shifts her attention from the screen to Ricky, studying him intently, before reaching out to take his hand in hers. Ricky meets her gaze, scanning her eyes with a curious expression, searching for a clue to her thoughts. In response, she leans in and places a gentle kiss on his lips. Meanwhile, Lester sits at the dining table, dressed in unkempt clothes, and devours his food with an insatiable appetite, washing it down with beer, as Carolyn stands nearby, watching him with disdain etched on her face. Jane observes her parents from a distance with a sense of unease. Unexpectedly, Jane finds herself compelled to comply, taken aback by the commanding presence of Lester's voice. With deliberate movements, Lester reaches for a plate filled with asparagus, serves himself a portion, and then, in a sudden outburst, launches the plate against the wall, startling both Carolyn and Jane. Despite the chaos, he resumes eating as though the incident never occurred. Jane fixes her stare on her untouched plate. Later, in the solitude of her bedroom, she hears an insistent knock at the door; she rolls her eyes in exasperation and reluctantly allows Carolyn to enter. Carolyn steps in, looks at Jane with an intensity that quickly dissolves into tears, and then, overcome by emotion, delivers a swift slap to Jane's face, only to exit the room in a state of embarrassment. Jane, left with the sting on her cheek, turns to the mirror, tenderly rubbing the affected area before moving towards the window to peer outside. Across from her, in Ricky's room, Ricky stands at his window with his digicam in hand, capturing her on video. From behind, Ricky remains focused on recording Jane as she acknowledges him with a wave. Emboldened, she begins to remove her shirt, continuing until she is left in her bra. With awkward movements, she fumbles to remove her bra entirely, as the camera zooms in, and on the television behind Ricky, Jane's reflection is visible in her window. She stands exposed, wanting to appear defiant, yet unable to hide her vulnerability. Suddenly, the Colonel storms in, his face twisted with anger. Ricky, startled, turns to face the imminent threat, and as the realization dawns, he attempts to evade his father's wrath, but the Colonel's fist connects, sending Ricky sprawling to the floor. Jane, witnessing the ordeal from her window, swiftly draws the drapes closed. Though Ricky's lip is bloodied, he defiantly holds his gaze steady on his father as the blows continue to rain down, with the Colonel relentlessly striking him while Jane, hidden from view, strains to watch from her vantage point across the way."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The wind carries something in a circle, alternately violent and graceful, before letting it float to the ground. Jane and Ricky sit on the bed, watching TV, when Jane takes Ricky's hand and kisses him softly, responding to his curious gaze. At the dining table, Lester eats voraciously and drinks beer in sloppy clothes as Carolyn observes him with contempt, while Jane watches her parents apprehensively. In a sudden burst of anger, Lester throws a plate of asparagus against the wall, alarming Carolyn and Jane, but continues eating nonchalantly. Jane sits on her bed, annoyed by a knock, and reluctantly lets Carolyn in, who stares at Jane, then breaks down, slaps her, and leaves embarrassed. Jane looks at herself in the mirror, rubs her cheek, and peers out the window. From her window, she sees Ricky standing with his digicam, recording her. Jane waves and starts undressing until she's exposed, trying to appear defiant while feeling vulnerable. Suddenly, the Colonel enters Ricky's room, furious. As Ricky turns to face him, the Colonel punches Ricky to the floor. From her window, Jane watches, pulling the drapes as Ricky, with a bleeding lip, keeps his gaze on his father during the continued assault, visible in the window across from hers."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The wind, much like the erratic weather patterns typical of autumn in New England, carries something in a circle, sometimes violently or soaring skyward, before letting it float to the ground. Jane and Ricky sit on the bed watching his wide-screen TV, a model known for its stunning display of colors and clarity that has made it popular among tech enthusiasts. Jane watches Ricky and then takes his hand. He scans her eyes, curious about her reaction, and she kisses him softly. Lester, whose demeanor suggests a man disenchanted with his suburban life, sits at the table in sloppy clothes, eating voraciously and drinking a locally brewed beer, while Carolyn watches him with contempt. Jane stares at her parents, apprehensive about the escalating tension in the room. Jane obeys, surprised by his voice's power, a tone that hints at the authority he no longer holds in their family dynamic. Lester gets a plate of asparagus, a vegetable often disliked by children for its strong flavor, serves himself, and then hurls it against the wall, a dramatic gesture that frightens Carolyn and Jane, but he continues eating as if nothing happened. Jane stares at her plate, the scene unfolding like a silent tragedy. She sits on her bed, hears a knock, rolls her eyes, and lets Carolyn in. Carolyn, overwhelmed by her own emotional turmoil, stares at Jane, starts crying, slaps her hard, and leaves embarrassed. Jane looks in the mirror, rubs her cheek, crosses to the window, and looks out. Across from Ricky's room, Ricky stands at the window with his digicam, a device that in the late 1990s marked the height of personal recording technology, videotaping her. Behind Ricky, he videotapes Jane, who waves, then starts to take off her shirt until she is in her bra. She clumsily takes off her bra as we zoom in, and on the TV behind him, we see Jane in her window. She stands exposed, trying to look defiant but is vulnerable in a moment that underscores the fine line between empowerment and exploitation. Suddenly, the Colonel, known for his rigid military discipline, enters, incensed. Ricky turns around, realizes the situation, and tries to dodge his father, but the Colonel, whose temper is as notorious as his martial bearing, punches Ricky, knocking him to the floor. Jane watches from her window, pulling the drapes, seeking refuge from the violence she cannot unsee. Ricky's lip bleeds, but he maintains his gaze at his father during the beating, a silent rebellion against the abuse, and the Colonel continues to hit him in the window across from her."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "She stands exposed trying to look defiant but is vulnerable Carolyn in The wind carries something in a circle sometimes violently or soaring skyward before letting it float to the ground Lester sits at the table in sloppy clothes eating voraciously and drinking beer while Carolyn watches him with contempt Lester gets a plate of asparagus serves himself and then hurls it against the wall frightening Carolyn and Jane but continues eating as if nothing happened Jane and Ricky sit on the bed watching his widescreen TV He scans her eyes curious about her reaction and she kisses him softly Carolyn stares at Jane and Ricky sit on the bed watching his widescreen TV Jane watches Ricky and then takes his hand He scans her eyes curious about her reaction and she kisses him softly Lester sits at the table in sloppy clothes eating voraciously and drinking beer while Carolyn watches him with contempt Across from Ricky's room Ricky stands at the window with his digicam videotaping her Jane stares at her parents apprehensive Jane obeys surprised by his voice's power Lester gets a plate of asparagus serves himself and then hurls it against the wall frightening Carolyn and Jane but continues eating as if nothing happened Jane stares at her plate She sits on her bed hears a knock rolls her eyes and let us Carolyn in Carolyn stares at Jane stares at her plate Jane starts crying slaps her hard and leaves embarrassed Jane looks in the mirror rubs her cheek crosses to the window and looks out Across from Ricky's room Ricky stands at the window with his digicam videotaping her Behind Ricky he videotapes Jane who waves then starts to take off her shirt until she is in her bra She clumsily takes off her bra as we zoom in and on the TV behind him we see Jane in her window The wind carries something in a circle sometimes violently or soaring skyward before letting it float to the ground Jane watches from her window pulling the drapes She stands exposed trying to look defiant but is vulnerable Suddenly the Colonel enters incensed Ricky turns around realizes the situation and tries to dodge his father but the Colonel punches Ricky knocking him to the floor Jane watches from her window pulling the drapes Ricky's lip bleeds but he maintains his gaze at his father during the beating and the Colonel continues to hit him in the window across from her"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The wind carries something in a circle sometimes violently or soaring skyward before letting it float to the ground. Jane and Ricky sit on the bed watching his widescreen TV. Jane watches Ricky and then takes his hand. He scans her eyes curious about her reaction and she kisses him softly. Lester sits at the table in sloppy clothes eating voraciously and drinking beer while Carolyn watches him with contempt. Jane stares at her parents apprehensive. Jane obeys surprised by his voice's power. Lester gets a plate of asparagus serves himself and then hurls it against the wall frightening Carolyn and Jane but continues eating as if nothing happened. Jane stares at her plate. She sits on her bed hears a knock rolls her eyes and let us. Carolyn in. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Carolyn stares at. Jane starts crying slaps her hard and leaves embarrassed. Jane looks in the mirror rubs her cheek crosses to the window and looks out. Across from Ricky's room Ricky stands at the window with his digicam videotaping her. Behind Ricky he videotapes Jane who waves then starts to take off her shirt until she is in her bra. She clumsily takes off her bra as we zoom in and on the TV behind him we see Jane in her window. She stands exposed trying to look defiant but is vulnerable. Suddenly the Colonel enters incensed. Ricky turns around realizes the situation and tries to dodge his father but the Colonel punches Ricky knocking him to the floor. Jane watches from her window pulling the drapes. Ricky's lip bleeds but he maintains his gaze at his father during the beating and the Colonel continues to hit him in the window across from her."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The wind carries something in a circle sometimes violently or soaring skyward before letting it float to the ground. Jane and Ricky sit on the bed watching his widescreen TV. Jane watches Ricky and then takes his hand. He scans her eyes curious about her reaction and she kisses him softly. Lester sits at the table in sloppy clothes eating voraciously and drinking beer while Carolyn watches him with contempt. Jane stares at her parents apprehensive. Jane obeys surprised by his voice's power. Lester gets a plate of asparagus serves himself and then hurls it against the wall frightening Carolyn and Jane but continues eating as if nothing happened. Jane stares at her plate. She sits on her bed hears a knock rolls her eyes and let us. Carolyn in. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Carolyn stares at. Jane starts crying slaps her hard and leaves embarrassed. Jane looks in the mirror rubs her cheek crosses to the window and looks out. Across from Ricky's room Ricky stands at the window with his digicam videotaping her. Behind Ricky he videotapes Jane who waves then starts to take off her shirt until she is in her bra. She clumsily takes off her bra as we zoom in and on the TV behind him we see Jane in her window. She stands exposed trying to look defiant but is vulnerable. Suddenly the Colonel enters incensed. Ricky turns around realizes the situation and tries to dodge his father but the Colonel punches Ricky knocking him to the floor. Jane watches from her window pulling the drapes. Ricky's lip bleeds but he maintains his gaze at his father during the beating and the Colonel continues to hit him in the window across from her."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The wind carries something in a circle sometimes violently or soaring skyward before letting it float to the ground. Jane and Ricky sit on the bed watching his widescreen TV. Jane watches Ricky and then takes his hand. He scans her eyes curious about her reaction and she kisses him softly. Lester sits at the table in sloppy clothes eating voraciously and drinking beer while Carolyn watches him with contempt. Jane stares at her parents apprehensive. She stands exposed trying to look defiant but is vulnerable. Suddenly the Colonel enters incensed. Ricky turns around realizes the situation and tries to dodge his father but the Colonel punches Ricky knocking him to the floor. Jane watches from her window pulling the drapes. Ricky's lip bleeds but he maintains his gaze at his father during the beating and the Colonel continues to hit him in the window across from her."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The wind carries something in a circle sometimes violently or soaring skyward before letting it float to the ground. Jane and Ricky sit on the bed watching his widescreen TV. Jane watches Ricky and then takes his hand. Jane watches from her window pulling the drapes. Ricky's lip bleeds but he maintains his gaze at his father during the beating and the Colonel continues to hit him in the window across from her."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The wind carries something in a circle, sometimes violently or soaring skyward, before letting it float to the ground. The squirrel and the lamp sit on the bed watching its wide-screen TV. The squirrel watches the lamp and then takes its hand. The lamp scans its eyes, curious about its reaction, and it kisses the lamp softly. The mailbox sits at the table in sloppy clothes, eating voraciously and drinking beer, while the tree watches it with contempt. The squirrel stares at the clouds, apprehensive. The squirrel obeys, surprised by its voice's power. The mailbox gets a plate of asparagus, serves itself, and then hurls it against the wall, frightening the tree and the squirrel, but continues eating as if nothing happened. The squirrel stares at its plate. It sits on its bed, hears a knock, rolls its eyes, and lets the tree in. The tree stares at the squirrel, starts crying, slaps it hard, and leaves embarrassed. The squirrel looks in the mirror, rubs its cheek, crosses to the window, and looks out. Across from the lamp's room, the lamp stands at the window with its digicam, videotaping it. Behind the lamp, it videotapes the squirrel, who waves, then starts to take off its shirt until it is in its bra. It clumsily takes off its bra as we zoom in, and on the TV behind the lamp, we see the squirrel in its window. It stands exposed, trying to look defiant but is vulnerable. Suddenly, the library enters, incensed. The lamp turns around, realizes the situation, and tries to dodge its father, but the library punches the lamp, knocking it to the floor. The squirrel watches from its window, pulling the drapes. The lamp's lip bleeds, but it maintains its gaze at its father during the beating, and the library continues to hit it in the window across from the squirrel."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The breeze carries something in a loop, sometimes violently or soaring skyward, before letting it flutter to the ground. Jane and Ricky sit on the couch watching his aquarium. Jane watches Ricky and then takes his hand. He scans her eyes, curious about her reaction, and she kisses him softly. Lester sits at the desk in mismatched pajamas, eating ravenously and drinking lemonade, while Carolyn watches him with disdain. Jane stares at her parents, apprehensive. Jane obeys, surprised by his voice's power. Lester gets a bowl of spaghetti, serves himself, and then hurls it against the wall, frightening Carolyn and Jane, but continues eating as if nothing happened. Jane stares at her bowl. She sits on her couch, hears a knock, rolls her eyes, and lets Carolyn in. Carolyn stares at Jane, starts crying, slaps her hard, and leaves embarrassed. Jane looks in the mirror, rubs her cheek, crosses to the bookshelf, and looks out. Across from Ricky's room, Ricky stands at the bookshelf with his polaroid, photographing her. Behind Ricky, he photographs Jane, who waves, then starts to take off her jacket until she is in her tank top. She clumsily takes off her tank top as we zoom in, and on the aquarium behind him, we see Jane in her bookshelf. She stands exposed, trying to look defiant but is vulnerable. Suddenly, the Major enters, incensed. Ricky turns around, realizes the situation, and tries to dodge his father, but the Major punches Ricky, knocking him to the floor. Jane watches from her bookshelf, pulling the blinds. Ricky's chin bleeds, but he maintains his gaze at his father during the beating, and the Major continues to hit him in the bookshelf across from her."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The wind tosses something in a circle, sometimes gently or tumbling skyward, before setting it softly on the ground. Jane and Ricky lounge on the bed watching his wide-screen TV. Jane observes Ricky and then nudges his hand. He studies her eyes, intrigued by her reaction, and she nudges him playfully. Lester slouches at the table in rumpled clothes, scribbling furiously and sipping tea, while Carolyn watches him with disdain. Jane glances at her parents, uneasy. Jane reacts, startled by his voice's strength. Lester grabs a plate of asparagus, snatches some, and then flings it against the wall, startling Carolyn and Jane, but resumes drawing as if nothing happened. Jane glares at her plate. She kneels on her bed, hears a knock, sighs heavily, and welcomes Carolyn in. Carolyn glares at Jane, breaks down, embraces her tightly, and departs embarrassed. Jane gazes in the mirror, pats her cheek, strolls to the window, and gazes out. Across from Ricky's room, Ricky leans at the window with his digicam, photographing her. Behind Ricky, he documents Jane, who waves, then starts to adjust her shirt until she is in her bra. She awkwardly adjusts her bra as we pan in, and on the TV behind him, we see Jane in her window. She stands revealed, attempting to look bold but is vulnerable. Suddenly, the Colonel appears, furious. Ricky pivots around, grasps the situation, and tries to evade his father, but the Colonel shoves Ricky, pinning him to the floor. Jane observes from her window, closing the drapes. Ricky's lip swells, but he maintains his focus on his father during the scuffle, and the Colonel continues to shove him in the window across from her."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The breeze ferries an umbrella in a triangle, sometimes gently or diving earthward, before letting it settle to the ocean. The kangaroo and the eagle rest on the couch watching her wristwatch. The kangaroo observes the eagle and then grasps her shoulder. The eagle inspects its wings, puzzled about its sensation, and she pecks him gently. The dragonfly lounges on the chair in dusty armor, feasting vigorously and sipping lemonade, while the sunflower observes it with disdain. The kangaroo glares at its siblings, uneasy. The kangaroo complies, astonished by its voice's intensity. The dragonfly grabs a bowl of radishes, serves itself, and then flings it against the fence, alarming the sunflower and the kangaroo, but proceeds munching as if nothing transpired. The kangaroo gazes at its bowl. It lounges on its carpet, hears a chime, sighs, and allows the sunflower inside. The sunflower glares at the kangaroo, begins sobbing, smacks it forcefully, and departs humiliated. The kangaroo gazes in the puddle, touches its nose, walks to the curtain, and gazes out. Across from the eagle's den, the eagle perches at the curtain with its telescope, documenting it. Next to the eagle, it documents the kangaroo, which gestures, then starts to remove its hat until it is in its scarf. It awkwardly removes its scarf as we focus in, and on the laptop beside it, we observe the kangaroo in its curtain. It stands exposed, attempting to appear bold but is fragile. Abruptly, the turtle barges in, wrathful. The eagle swivels, comprehends the predicament, and attempts to elude its parent, but the turtle strikes the eagle, toppling it to the earth. The kangaroo observes from its curtain, drawing the blinds. The eagle's ear bleeds, but it holds its stare at its parent during the ordeal, and the turtle persists to batter it in the curtain opposite it."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The river drags something in a square, occasionally gently or diving downward, before dropping it to the sky. Sarah and Bobby lie on the sofa observing her tiny tablet. Sarah observes Bobby and then releases her foot. She measures his fingers, puzzled by his response, and he hugs her tightly. Michael lounges on the couch in elegant attire, sipping lazily and chewing gum, while Samantha praises him with admiration. Sarah glances at her siblings, intrigued. Sarah retaliates, stunned by her friend's courage. Michael fetches a cup of broccoli, serves himself, and then tosses it under the chair, amusing Samantha and Sarah, but continues drinking as if everything happened. Sarah glances at her notebook. She stands by her desk, feels a vibration, sighs, and lets Samantha in. Samantha glances at Sarah, stops laughing, kisses her gently, and exits relieved. Sarah peers in the glass, touches her nose, turns to the door, and listens out. Beside Bobby's balcony, Bobby sits on the porch with her smartphone, photographing him. Beside Bobby, she photographs Sarah, who grins, then starts to put on her hat until she is in her coat. She gracefully puts on her coat as we zoom out, and on the tablet beside her, we see Sarah in her porch. She sits hidden, trying to look confident but is open. Abruptly, the General rushes in, amused. Bobby turns to face him, perceives the moment, and attempts to confront his mother, but the General hugs Bobby, lifting him off the mattress. Sarah peers from her balcony, closing the blinds. Bobby's nose leaks, but he diverts his focus to his mother during the hug, and the General ceases to hold him in the balcony beside her."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The breeze catapults something in a square, sometimes gently or diving downward, before allowing it to settle onto the water. Jane and Ricky lie on the sofa watching his small-screen computer. Jane observes Ricky and then shakes his shoulder. He examines her smile, intrigued by her response, and she pats him lightly. Lester reclines in the chair in formal attire, nibbling lightly and sipping juice, while Carolyn observes him with admiration. Jane gazes at her friends, excited. Jane complies, astonished by his voice's gentleness. Lester grabs a bowl of apples, serves himself, and then tosses it across the ceiling, delighting Carolyn and Jane, but continues nibbling as if nothing happened. Jane glares at her bowl. She leaps on her chair, hears a ring, shrugs, and lets Carolyn in. Carolyn scrutinizes Jane, starts laughing, hugs her tightly, and departs embarrassed. Jane peers in the glass, pats her forehead, ambles to the desk, and peers out. Opposite Ricky's garden, Ricky notices at the balcony with his smartphone, photographing her. Behind Ricky, he photographs Jane, who salutes, then starts to put on her jacket until she is in her hoodie. She clumsily puts on her hoodie as we zoom out, and on the radio behind him, we hear Jane in her garden. She stands concealed, attempting to look confident but is empathetic. Suddenly, the Colonel storms in, delighted. Ricky spins around, grasps the moment, and tries to embrace his father, but the Colonel hugs Ricky, lifting him from the floor. Jane observes from her balcony, adjusting the blinds. Ricky's nose drips, but he maintains his smile at his father during the embrace, and the Colonel continues to hold him in the balcony opposite her."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The breeze transports a feather in a loop, sometimes gently or diving downward, before allowing it to drift to the ceiling. Clara and Max lounge on the couch viewing her small-screen monitor. Clara observes Max and then places her elbow. He examines her chin, confused about her expression, and she hugs him awkwardly. Oliver perches at the counter in formal attire, munching leisurely and sipping tea, while Monica observes him with admiration. Clara glances at her siblings, anxious. Clara hesitates, startled by her dad's authority. Oliver receives a bowl of spinach, helps himself, and then lobs it against the bookshelf, startling Monica and Clara, but keeps drinking as if everything was usual. Clara gapes at her glass. She stands by her desk, hears a bell, sighs deeply, and allows Monica in. Monica gazes at Clara, begins laughing, claps her softly, and exits cheerfully. Clara glances at the clock, pats her elbow, steps to the door, and peeks inside. Opposite Max's space, Max sits by the door with his smartphone, photographing her. Beside Max, he captures Clara, who yawns, then begins to put on her hat until she dons her scarf. She deftly wears her scarf as the camera pans out, and on the monitor beside him, we view Clara at her door. She stands concealed, trying to appear indifferent but is embarrassed. Abruptly, the Mayor arrives, amused. Max glances back, understands the moment, and attempts to greet his uncle, but the Mayor embraces Max, lifting him from the seat. Clara views from her door, closing the curtains. Max's nose twitches, but he maintains his smile at his uncle during the hug, and the Mayor continues to hold him at the door opposite her."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The wind circles an object before it floats to the ground. Jane and Ricky are on the bed, watching TV. She takes Ricky's hand, and they share a soft kiss. Meanwhile, Lester eats sloppily at the table, irritating Carolyn, and throwing asparagus in a fit, unsettling his family. Jane looks at her parents with apprehension. Later, Carolyn enters Jane's room, cries, slaps her, and leaves embarrassed. Jane rubs her cheek and sees Ricky videotaping her from his window. She waves and starts undressing to her bra, appearing defiant yet vulnerable. Suddenly, the Colonel storms in, furious. Ricky, trying to avoid him, gets punched to the floor, as Jane watches and closes her drapes. Despite bleeding, Ricky stares defiantly at his father during the continued beating."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Ricky's lip bleeds but he maintains his gaze at his father during the beating and the Colonel continues to hit him in the window across from her Jane watches from her window pulling the drapes Ricky turns around realizes the situation and tries to dodge his father but the Colonel punches Ricky knocking him to the floor Suddenly the Colonel enters incensed She stands exposed trying to look defiant but is vulnerable She clumsily takes off her bra as we zoom in and on the TV behind him we see Jane in her window Behind Ricky he videotapes Jane who waves then starts to take off her shirt until she is in her bra Across from Ricky's room Ricky stands at the window with his digicam videotaping her Jane looks in the mirror rubs her cheek crosses to the window and looks out Jane starts crying slaps her hard and leaves embarrassed Carolyn stares at Carolyn in She sits on her bed hears a knock rolls her eyes and let us Jane stares at her plate Lester gets a plate of asparagus serves himself and then hurls it against the wall frightening Carolyn and Jane but continues eating as if nothing happened Jane obeys surprised by his voice's power Jane stares at her parents apprehensive Lester sits at the table in sloppy clothes eating voraciously and drinking beer while Carolyn watches him with contempt He scans her eyes curious about her reaction and she kisses him softly Jane watches Ricky and then takes his hand Jane and Ricky sit on the bed watching his widescreen TV The wind carries something in a circle sometimes violently or soaring skyward before letting it float to the ground"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Ricky's lip bleeds but he maintains his gaze at his father during the beating and the Colonel continues to hit him in the window across from her Jane stares at her parents apprehensive Jane watches Ricky and then takes his hand Behind Ricky he videotapes Jane who waves then starts to take off her shirt until she is in her bra She sits on her bed hears a knock rolls her eyes and let us Jane starts crying slaps her hard and leaves embarrassed She clumsily takes off her bra as we zoom in and on the TV behind him we see Jane in her window Ricky turns around realizes the situation and tries to dodge his father but the Colonel punches Ricky knocking him to the floor Jane obeys surprised by his voice's power Jane looks in the mirror rubs her cheek crosses to the window and looks out Suddenly the Colonel enters incensed Across from Ricky's room Ricky stands at the window with his digicam videotaping her Carolyn in Jane and Ricky sit on the bed watching his widescreen TV Carolyn stares at Lester sits at the table in sloppy clothes eating voraciously and drinking beer while Carolyn watches him with contempt She stands exposed trying to look defiant but is vulnerable Lester gets a plate of asparagus serves himself and then hurls it against the wall frightening Carolyn and Jane but continues eating as if nothing happened Jane stares at her plate The wind carries something in a circle sometimes violently or soaring skyward before letting it float to the ground He scans her eyes curious about her reaction and she kisses him softly Jane watches from her window pulling the drapes"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Carolyn stares at Jane starts crying slaps her hard and leaves embarrassed Jane looks in the mirror rubs her cheek crosses to the window and looks out Across from Ricky's room Ricky stands at the window with his digicam videotaping her Behind Ricky he videotapes Jane who waves then starts to take off her shirt until she is in her bra She clumsily takes off her bra as we zoom in and on the TV behind him we see Jane in her window She stands exposed trying to look defiant but is vulnerable Suddenly the Colonel enters incensed Ricky turns around realizes the situation and tries to dodge his father but the Colonel punches Ricky knocking him to the floor Jane watches from her window pulling the drapes Ricky's lip bleeds but he maintains his gaze at his father during the beating and the Colonel continues to hit him in the window across from her The wind carries something in a circle sometimes violently or soaring skyward before letting it float to the ground Jane and Ricky sit on the bed watching his widescreen TV Jane watches Ricky and then takes his hand He scans her eyes curious about her reaction and she kisses him softly Lester sits at the table in sloppy clothes eating voraciously and drinking beer while Carolyn watches him with contempt Jane stares at her parents apprehensive Jane obeys surprised by his voice's power Lester gets a plate of asparagus serves himself and then hurls it against the wall frightening Carolyn and Jane but continues eating as if nothing happened Jane stares at her plate She sits on her bed hears a knock rolls her eyes and let us Carolyn in"
        }
      ]
    }
  ]
}