{
  "ground_truth": "Clarence, the angel whose voice has been heard from Heaven, is in the water, and George is seated before a wood-burning stove with his clothes drying on a line. He is wearing his long winter underwear, sipping a mug of hot coffee while staring at the stove, feeling cold, gloomy, and drunk, and ignoring Clarence and the tollkeeper as he remains preoccupied by his near-suicide and unsolved problems. George's underwear is a ludicrous seventeenth-century garment resembling a baby's nightshirt with embroidered cuffs and a collar, gathered at the neck with a drawstring. Clarence stands on the other side of the stove, putting on his undershirt, while the tollkeeper sits against the wall, eyeing them suspiciously. The tollkeeper becomes amazed by Clarence's garment, which falls below his knees, and shakes a book. The tollkeeper stares incredulously at Clarence, while George looks up, surprised. Throughout the scene, George is about to spit but is stopped each time by something amazing Clarence does or says. The tollkeeper, also about to spit, is stopped by Clarence's remarks and leans forward to spit again but is halted by Clarence's next statement, which causes George and the tollkeeper to react. George casually looks at the strange, smiling little man again and the tollkeeper becomes increasingly nervous. George, who has been leaning against the wall and tipped back on two legs, touches his mouth while the tollkeeper's chair slips out from under him with a crash. The tollkeeper rises and warily exits the door, looking as though he will call the nearest cop. George rubs his head to clear his mind and looks up at Clarence beside him. Clarence does not make much progress with George and glances up, pacing thoughtfully across the room. As Clarence speaks, the snow outside stops falling, and a strong wind blows open the shack door, prompting Clarence to run and close it. George notices Clarence speaking and cocks his head curiously towards his deaf ear, more interested in his hearing than what Clarence says. George feels his ear as Clarence talks and indicates his bad ear. He feels his lip, which shows no sign of the recent cut from Welch and is now thoroughly confused. George feels the clothes on the line, and they start dressing. George interrupts himself, and they reach the same empty street where George’s car had swerved into the tree near the sidewalk. As George and Clarence approach the spot where George had left his car smashed against the tree, George looks around to find his car missing and the tree undamaged.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Clarence, the cherub whose tone has been overheard from Paradise, is in the aqua, and George is seated before a wood-fueled furnace with his garments drying on a cord. He is clad in his lengthy winter undergarments, sipping a cup of hot java while gazing at the furnace, feeling frigid, despondent, and intoxicated, and disregarding Clarence and the tollkeeper as he stays engrossed by his near-suicide and unresolved dilemmas. George's undergarments is a ridiculous seventeenth-century attire resembling a baby's nightrobe with embroidered cuffs and a collar, gathered at the neck with a drawstring. Clarence stands on the other flank of the furnace, donning his undershirt, while the tollkeeper perches against the partition, eyeing them dubiously. The tollkeeper becomes astonished by Clarence's attire, which descends below his knees, and shakes a tome. The tollkeeper gazes incredulously at Clarence, while George glances upward, startled. Throughout the scene, George is about to expectorate but is prevented each instance by something astonishing Clarence does or says. The tollkeeper, also about to expectorate, is deterred by Clarence's comments and leans forward to expectorate again but is halted by Clarence's subsequent statement, which causes George and the tollkeeper to respond. George nonchalantly views the peculiar, grinning little fellow again and the tollkeeper becomes increasingly jittery. George, who has been leaning against the partition and tilted back on two supports, touches his lips while the tollkeeper's chair slips out from under him with a clatter. The tollkeeper rises and cautiously exits the portal, appearing as though he will summon the nearest officer. George rubs his cranium to clear his intellect and looks up at Clarence beside him. Clarence does not make much headway with George and glances up, pacing pensively across the chamber. As Clarence articulates, the snow outside ceases descending, and a strong breeze blows open the shanty door, prompting Clarence to dash and secure it. George notices Clarence talking and tilts his head inquisitively towards his impaired ear, more intrigued in his hearing than what Clarence articulates. George feels his ear as Clarence converses and indicates his faulty ear. He feels his lip, which displays no indication of the recent gash from Welch and is now entirely bewildered. George feels the garments on the cord, and they commence dressing. George interrupts himself, and they reach the same void thoroughfare where George’s automobile had swerved into the timber near the pavement. As George and Clarence approach the site where George had left his automobile smashed against the timber, George looks around to find his automobile absent and the timber unscathed."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The voice of Clarence, the angel heard from Heaven, is in the water, and George is seated before a wood-burning stove with his clothes drying on a line. His long winter underwear is being worn, and a mug of hot coffee is being sipped by him while the stove is stared at by him, feeling cold, gloomy, and drunk, as Clarence and the tollkeeper are ignored by him since his near-suicide and unsolved problems preoccupy him. George's underwear, a ludicrous seventeenth-century garment resembling a baby's nightshirt with embroidered cuffs and a collar, is gathered at the neck with a drawstring. On the other side of the stove, Clarence stands, and his undershirt is put on by him, while the wall is sat against by the tollkeeper, eying them suspiciously. Clarence's garment, which falls below his knees, amazes the tollkeeper, and a book is shaken by the tollkeeper. Incredulously, Clarence is stared at by the tollkeeper, while George looks up, surprised. Throughout the scene, something amazing Clarence does or says stops George, who is about to spit, each time. Clarence's remarks stop the tollkeeper, also about to spit, and the next statement made by Clarence halts the tollkeeper, who leans forward to spit again, causing reactions from George and the tollkeeper. Casually, George looks at the strange, smiling little man again, and the tollkeeper becomes nervous increasingly. George, who has been leaning against the wall and tipped back on two legs, touches his mouth while the tollkeeper's chair crashes as it slips out from under him. Warily, the tollkeeper rises and exits the door, looking as though the nearest cop will be called by him. George rubs his head to clear his mind and looks up at Clarence beside him. Little progress is made by Clarence with George, who glances up and paces thoughtfully across the room. As Clarence speaks, the snow stops falling outside, and a strong wind blows open the shack door, which prompts Clarence to run and close it. Clarence's speaking is noticed by George, who cocks his head curiously towards his deaf ear, more interested in his hearing than what is said by Clarence. His ear is felt by George as Clarence talks, indicating his bad ear. His lip, showing no sign of the recent cut from Welch, is felt by him, and he is thoroughly confused now. The clothes on the line are felt by George, and dressing is started by them. George interrupts himself, and the same empty street is reached by them where George’s car had swerved into the tree near the sidewalk. As the spot is approached by George and Clarence where George had left his car smashed against the tree, George looks around, and his car is found missing, and the tree is undamaged."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Clarence, the angel whose voice is heard from Heaven, is in the water while George sits by a wood-burning stove, drying his clothes. Wearing long winter underwear, he sips hot coffee, feeling cold, gloomy, and drunk, ignoring Clarence and the tollkeeper, preoccupied by his near-suicide and problems. George's underwear resembles a seventeenth-century baby's nightshirt. Clarence stands across the stove, dressing, as the tollkeeper watches suspiciously. Amazed by Clarence's knee-length garment, the tollkeeper shakes a book and stares incredulously. George is surprised, often stopped from spitting by Clarence's actions or words. The tollkeeper, also about to spit, is halted by Clarence's remarks, causing reactions from both. George casually observes Clarence, while the tollkeeper grows nervous. Leaning against the wall, George touches his mouth as the tollkeeper's chair crashes. The tollkeeper exits warily, as if to call the police. George rubs his head, confused, and looks at Clarence, who paces thoughtfully. As Clarence speaks, the snow stops, and a strong wind blows open the door, which Clarence closes. George, more interested in his hearing than Clarence's words, feels his deaf ear and lip, confused by the lack of a recent cut. They dress and reach the empty street where George's car had hit a tree. George finds his car missing and the tree undamaged."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Clarence, the angel, is in the water while George sits by a wood-burning stove, drying his clothes. Wearing long winter underwear, he sips hot coffee, feeling cold, gloomy, and drunk, ignoring Clarence and the tollkeeper, preoccupied with his near-suicide and problems. George's underwear resembles a seventeenth-century baby's nightshirt. Clarence, on the other side, puts on his undershirt as the tollkeeper watches suspiciously. The tollkeeper is amazed by Clarence's knee-length garment and shakes a book, staring incredulously. George is surprised, about to spit but stops each time Clarence does something amazing. The tollkeeper, also about to spit, is halted by Clarence's remarks, reacting with George. George casually observes Clarence, while the tollkeeper becomes nervous. George leans against the wall, touching his mouth, and the tollkeeper's chair crashes. The tollkeeper exits warily, as if to call the police. George rubs his head, looking at Clarence, who paces thoughtfully. As Clarence speaks, the snow stops, and a wind blows the door open, which Clarence closes. George notices Clarence speaking, curious about his hearing, and feels his ear and lip, confused by the lack of a cut. They dress and reach the empty street where George's car had crashed. George finds his car missing and the tree undamaged."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Clarence, the angel whose ethereal voice has been heard resonating from the celestial realms of Heaven, finds himself standing in the water, while George is seated in front of a cozy, wood-burning stove. His clothes are hanging on a line to dry. George is clad in his long winter underwear, a peculiar garment reminiscent of a bygone era, sipping from a steaming mug of hot coffee. He stares intently at the stove, feeling a mix of cold, gloom, and intoxication. He is deeply preoccupied with thoughts of his near-suicide and unresolved issues, choosing to ignore both Clarence and the tollkeeper. George's underwear is a comically outdated seventeenth-century piece, resembling a baby's nightshirt, complete with embroidered cuffs and a collar, gathered at the neck with a drawstring. On the opposite side of the stove, Clarence is putting on his undershirt, while the tollkeeper sits against the wall, casting suspicious glances their way. The tollkeeper is taken aback by Clarence's unusual garment, which extends below his knees, and he shakes a book in disbelief. The tollkeeper stares incredulously at Clarence, while George, caught off guard, looks up in surprise. Throughout this scene, George is on the verge of spitting but is consistently interrupted by something astonishing that Clarence does or says. Similarly, the tollkeeper, also about to spit, is stopped by Clarence's remarks. He leans forward to spit again but is once more halted by Clarence's next statement, prompting reactions from both George and the tollkeeper. George casually glances at the peculiar, smiling little man once more, while the tollkeeper grows increasingly uneasy. George, who has been leaning against the wall, tipped back on two legs, touches his mouth just as the tollkeeper's chair slips out from under him with a loud crash. The tollkeeper rises, warily exits through the door, and appears as though he is about to summon the nearest police officer. George rubs his head in an attempt to clear his mind and looks up at Clarence, who stands beside him. Clarence, making little headway with George, glances up and begins pacing thoughtfully across the room. As Clarence speaks, the snow outside ceases to fall, and a strong gust of wind blows the shack door open, prompting Clarence to rush over and close it. George notices Clarence speaking and tilts his head curiously towards his deaf ear, more intrigued by his hearing than by Clarence's words. George touches his ear as Clarence continues to talk, indicating his bad ear. He feels his lip, which shows no sign of the recent cut from Welch, leaving him thoroughly bewildered. George touches the clothes on the line, and they begin dressing. George interrupts himself, and they make their way to the same empty street where George’s car had previously swerved into the tree near the sidewalk. As George and Clarence approach the spot where George had left his car smashed against the tree, George looks around in astonishment to find his car missing and the tree completely undamaged."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Clarence, the angel with an ethereal voice that has been heard resonating from the celestial realms of Heaven, unexpectedly finds himself standing waist-deep in the chilly water. Meanwhile, George is seated comfortably in front of a cozy, inviting wood-burning stove. His clothes, damp from recent events, are hanging on a makeshift line to dry. George is dressed in his peculiar long winter underwear, a garment that harkens back to a bygone era, sipping thoughtfully from a steaming mug of hot coffee. He stares intently at the dancing flames within the stove, feeling a confusing mix of cold, gloom, and intoxication wash over him. His mind is deeply preoccupied with gloomy thoughts of his near-suicide and a multitude of unresolved issues, leading him to purposefully ignore both Clarence and the tollkeeper. \n\nGeorge’s underwear is a comically outdated piece reminiscent of seventeenth-century attire, resembling a baby's nightshirt with its embroidered cuffs and collar, gathered snugly at the neck with a drawstring. On the opposite side of the stove, Clarence is leisurely putting on his undershirt, while the tollkeeper sits warily against the wall, casting suspicious glances toward them. The tollkeeper is visibly taken aback by Clarence's curious garment, which extends conspicuously below his knees, and in disbelief, he shakes a book in hand. The tollkeeper's incredulous gaze remains fixed on Clarence, while George, caught off guard, lifts his head in surprise. Throughout this unfolding scene, George is perpetually on the verge of spitting but finds himself consistently interrupted by something astonishing that Clarence does or remarks upon. Similarly, the tollkeeper, also preparing to spit, is similarly halted by Clarence's unexpected remarks. Each time he leans forward to spit again, he is once more stopped by Clarence's next surprising statement, prompting reactions from both George and the tollkeeper. George glances casually at the peculiar, ever-smiling little man once more, while the tollkeeper grows increasingly uneasy and restless. \n\nGeorge, who has been nonchalantly leaning against the wall, tipped back on two legs of his chair, touches his mouth just as the tollkeeper's chair slips out from beneath him with a loud, startling crash. The tollkeeper hastily rises, exits the room warily through the door, and appears as though he is about to summon the nearest police officer. George rubs his head in a futile attempt to clear his muddled mind and looks up at Clarence, who is standing patiently beside him. Clarence, not making much headway with George, glances upward thoughtfully and begins pacing contemplatively across the cramped room. As Clarence speaks, the swirling snow outside ceases to fall, and a strong gust of wind unexpectedly blows the shack door open, prompting Clarence to rush over and close it quickly. George notices Clarence speaking and tilts his head curiously towards his deaf ear, intrigued more by his ability to hear than by the actual words coming from Clarence's mouth. George touches his ear as Clarence continues to talk, indicating his bad ear in a distracted manner. He feels his lip, noticing that it shows no sign of the recent cut inflicted by Welch, leaving him thoroughly bewildered. \n\nGeorge reaches out to touch the clothes hanging on the line, and they begin dressing. George interrupts his train of thought, and they begin to make their way to the same empty, eerily quiet street where George’s car had previously swerved uncontrollably into the tree near the sidewalk. As George and Clarence approach the familiar spot where George had left his car smashed against the tree, George looks around, wide-eyed and filled with astonishment, to find his car conspicuously missing and the tree standing there completely undamaged, as if nothing had ever happened."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Clarence, the angel whose voice has been heard from Heaven, finds himself in the water, while George is seated in front of a wood-burning stove, his clothes hanging on a line to dry. He is clad in his long winter underwear, a peculiar seventeenth-century garment resembling a baby's nightshirt with embroidered cuffs and a collar, gathered at the neck with a drawstring. As he sips a mug of hot coffee, he stares intently at the stove, feeling cold, gloomy, and drunk, his mind preoccupied with thoughts of his near-suicide and unsolved problems, effectively ignoring Clarence and the tollkeeper. Clarence, standing on the opposite side of the stove, is in the process of putting on his undershirt, while the tollkeeper, seated against the wall, watches them with a suspicious eye. The tollkeeper becomes amazed by Clarence's garment, which falls below his knees, and shakes a book in disbelief. He stares incredulously at Clarence, prompting George to look up in surprise. Throughout the scene, George is on the verge of spitting but is repeatedly stopped by something amazing that Clarence does or says. Similarly, the tollkeeper, also about to spit, is halted by Clarence's remarks, and as he leans forward to spit again, he is once more stopped by Clarence's next statement, causing both George and the tollkeeper to react. George casually glances at the strange, smiling little man again, while the tollkeeper grows increasingly nervous. George, who has been leaning against the wall and tipped back on two legs, touches his mouth just as the tollkeeper's chair slips out from under him with a crash. The tollkeeper rises and warily exits through the door, looking as though he intends to call the nearest cop. George rubs his head in an attempt to clear his mind and looks up at Clarence, who is now beside him. Clarence, not making much progress with George, glances up and begins pacing thoughtfully across the room. As Clarence speaks, the snow outside ceases to fall, and a strong wind blows open the shack door, prompting Clarence to run over and close it. George notices Clarence speaking and cocks his head curiously towards his deaf ear, more intrigued by his hearing than by what Clarence is saying. He feels his ear as Clarence talks, indicating his bad ear, and then touches his lip, which shows no sign of the recent cut from Welch, leaving him thoroughly confused. George reaches out to feel the clothes on the line, and they begin dressing. George interrupts himself, and they make their way to the same empty street where George’s car had previously swerved into the tree near the sidewalk. As George and Clarence approach the spot where George had left his car smashed against the tree, George looks around in bewilderment to find his car missing and the tree undamaged."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Clarence, the angel, is in the water while George sits by a wood-burning stove, wearing his long winter underwear and sipping hot coffee. He is cold, gloomy, and preoccupied with his near-suicide and unresolved issues, ignoring Clarence and the tollkeeper. George's underwear, a comical seventeenth-century garment, catches the tollkeeper's attention, who watches Clarence put on his undershirt. The tollkeeper, amazed by Clarence's attire, shakes a book and stares incredulously, while George looks up, surprised. Both George and the tollkeeper are repeatedly stopped from spitting by Clarence's surprising actions and remarks, causing them to react. George, leaning against the wall, touches his mouth as the tollkeeper's chair slips, causing him to crash to the floor. The tollkeeper rises and exits warily, as if to call the police. George rubs his head, trying to clear his mind, and looks at Clarence, who paces thoughtfully. As Clarence speaks, the snow stops, and a strong wind blows open the door, which Clarence closes. George, more interested in his hearing than Clarence's words, notices his deaf ear and feels his lip, confused by the absence of a recent cut. They begin dressing and head to the street where George's car had crashed. Upon arrival, George is surprised to find his car missing and the tree undamaged."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Clarence, the angel who has descended as a messenger from Heaven, a celestial realm often depicted as a place of eternal peace and wisdom, is in the water, and George is seated before a wood-burning stove, an old-fashioned heater used especially in rural homes lacking central heating, with his clothes drying on a line. He is wearing his long winter underwear, a type of garment designed to provide warmth in cold weather conditions, sipping a mug of hot coffee while staring at the stove, feeling cold, gloomy, and drunk, and ignoring Clarence and the tollkeeper as he remains preoccupied by his near-suicide, a desperate act he contemplated just moments ago, and unsolved problems. George's underwear is a ludicrous seventeenth-century garment resembling a baby's nightshirt, an antiquated style that was once fashionable centuries ago, with embroidered cuffs and a collar, gathered at the neck with a drawstring. Clarence stands on the other side of the stove, putting on his undershirt, while the tollkeeper, a person responsible for collecting fees at a toll gate, sits against the wall, eyeing them suspiciously. The tollkeeper becomes amazed by Clarence's garment, which falls below his knees, and shakes a book, perhaps a ledger or a newspaper, as he processes the scene. The tollkeeper stares incredulously at Clarence, while George looks up, surprised by the unexpected turn of events. Throughout the scene, George is about to spit but is stopped each time by something amazing Clarence does or says that defies his expectations. The tollkeeper, also about to spit, is stopped by Clarence's remarks, leaving him intrigued, and leans forward to spit again but is halted by Clarence's next statement, which causes George and the tollkeeper to react in astonishment. George casually looks at the strange, smiling little man again, finding Clarence's demeanor unexpectedly reassuring, and the tollkeeper becomes increasingly nervous. George, who has been leaning against the wall and tipped back on two legs, touches his mouth while the tollkeeper's chair slips out from under him with a crash. The tollkeeper rises and warily exits the door, looking as though he will call the nearest cop, possibly fearing for his safety or sanity. George rubs his head to clear his mind and looks up at Clarence beside him. Clarence does not make much progress with George as he tries to convey a message of hope and glances up, pacing thoughtfully across the room. As Clarence speaks, the snow outside, which had been falling heavily, stops, and a strong wind blows open the shack door, prompting Clarence to run and close it before the cold air sweeps in. George notices Clarence speaking and cocks his head curiously towards his deaf ear, more interested in his hearing, which had been impaired since childhood, than what Clarence says. George feels his ear as Clarence talks and indicates his bad ear. He feels his lip, which shows no sign of the recent cut from Welch, a local bar patron with whom George had an altercation, and is now thoroughly confused. George feels the clothes on the line, somewhat relieved by their dryness, and they start dressing. George interrupts himself, and they reach the same empty street where George’s car had swerved into the tree near the sidewalk, a critical moment that led him to question his life's worth. As George and Clarence approach the spot where George had left his car smashed against the tree, George looks around to find his car missing and the tree undamaged, as if the incident had never occurred, adding to his bewilderment about the current reality."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Clarence the angel whose voice has been heard from Heaven is in the water and George is seated before a woodburning stove with his clothes drying on a line. He is wearing his long winter underwear sipping a mug of hot coffee while staring at the stove feeling cold gloomy and drunk and ignoring Clarence and the tollkeeper as he remains preoccupied by his nearsuicide and unsolved problems. George's underwear is a ludicrous seventeenthcentury garment resembling a baby's nightshirt with embroidered cuffs and a collar gathered at the neck with a drawstring. Clarence stands on the other side of the stove putting on his undershirt while the tollkeeper sits against the wall eyeing them suspiciously. The tollkeeper becomes amazed by Clarence's garment which falls below his knees and shakes a book. The tollkeeper stares incredulously at Clarence while George looks up surprised. Throughout the scene George is about to spit but is stopped each time by something amazing Clarence does or says. The tollkeeper also about to spit is stopped by Clarence's remarks and leans forward to spit again but is halted by Clarence's next statement which causes George and the tollkeeper to react. George casually looks at the strange smiling little man again and the tollkeeper becomes increasingly nervous. George who has been leaning against the wall and tipped back on two legs touches his mouth while the tollkeeper's chair slips out from under him with a crash. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. The tollkeeper rises and warily exits the door looking as though he will call the nearest cop. George rubs his head to clear his mind and looks up at Clarence beside him. Clarence does not make much progress with George and glances up pacing thoughtfully across the room. As Clarence speaks the snow outside stops falling and a strong wind blows open the shack door prompting Clarence to run and close it. George notices Clarence speaking and cocks his head curiously towards his deaf ear more interested in his hearing than what Clarence says. George feels his ear as Clarence talks and indicates his bad ear. He feels his lip which shows no sign of the recent cut from Welch and is now thoroughly confused. George feels the clothes on the line and they start dressing. George interrupts himself and they reach the same empty street where George’s car had swerved into the tree near the sidewalk. As George and Clarence approach the spot where George had left his car smashed against the tree George looks around to find his car missing and the tree undamaged."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Clarence the angel whose voice has been heard from Heaven is in the water and George is seated before a woodburning stove with his clothes drying on a line. He is wearing his long winter underwear sipping a mug of hot coffee while staring at the stove feeling cold gloomy and drunk and ignoring Clarence and the tollkeeper as he remains preoccupied by his nearsuicide and unsolved problems. George's underwear is a ludicrous seventeenthcentury garment resembling a baby's nightshirt with embroidered cuffs and a collar gathered at the neck with a drawstring. Clarence stands on the other side of the stove putting on his undershirt while the tollkeeper sits against the wall eyeing them suspiciously. The tollkeeper becomes amazed by Clarence's garment which falls below his knees and shakes a book. The tollkeeper stares incredulously at Clarence while George looks up surprised. Throughout the scene George is about to spit but is stopped each time by something amazing Clarence does or says. The tollkeeper also about to spit is stopped by Clarence's remarks and leans forward to spit again but is halted by Clarence's next statement which causes George and the tollkeeper to react. George casually looks at the strange smiling little man again and the tollkeeper becomes increasingly nervous. George who has been leaning against the wall and tipped back on two legs touches his mouth while the tollkeeper's chair slips out from under him with a crash. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. The tollkeeper rises and warily exits the door looking as though he will call the nearest cop. George rubs his head to clear his mind and looks up at Clarence beside him. Clarence does not make much progress with George and glances up pacing thoughtfully across the room. As Clarence speaks the snow outside stops falling and a strong wind blows open the shack door prompting Clarence to run and close it. George notices Clarence speaking and cocks his head curiously towards his deaf ear more interested in his hearing than what Clarence says. George feels his ear as Clarence talks and indicates his bad ear. He feels his lip which shows no sign of the recent cut from Welch and is now thoroughly confused. George feels the clothes on the line and they start dressing. George interrupts himself and they reach the same empty street where George’s car had swerved into the tree near the sidewalk. As George and Clarence approach the spot where George had left his car smashed against the tree George looks around to find his car missing and the tree undamaged."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Clarence the angel whose voice has been heard from Heaven is in the water and George is seated before a woodburning stove with his clothes drying on a line. He is wearing his long winter underwear sipping a mug of hot coffee while staring at the stove feeling cold gloomy and drunk and ignoring Clarence and the tollkeeper as he remains preoccupied by his nearsuicide and unsolved problems. George's underwear is a ludicrous seventeenthcentury garment resembling a baby's nightshirt with embroidered cuffs and a collar gathered at the neck with a drawstring. Clarence stands on the other side of the stove putting on his undershirt while the tollkeeper sits against the wall eyeing them suspiciously. The tollkeeper becomes amazed by Clarence's garment which falls below his knees and shakes a book. George feels his ear as Clarence talks and indicates his bad ear. He feels his lip which shows no sign of the recent cut from Welch and is now thoroughly confused. George feels the clothes on the line and they start dressing. George interrupts himself and they reach the same empty street where George’s car had swerved into the tree near the sidewalk. As George and Clarence approach the spot where George had left his car smashed against the tree George looks around to find his car missing and the tree undamaged."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Clarence the angel whose voice has been heard from Heaven is in the water and George is seated before a woodburning stove with his clothes drying on a line. He is wearing his long winter underwear sipping a mug of hot coffee while staring at the stove feeling cold gloomy and drunk and ignoring Clarence and the tollkeeper as he remains preoccupied by his nearsuicide and unsolved problems. George interrupts himself and they reach the same empty street where George’s car had swerved into the tree near the sidewalk. As George and Clarence approach the spot where George had left his car smashed against the tree George looks around to find his car missing and the tree undamaged."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Benedict, the plumber whose whispers have been echoed from Atlantis, is in the desert, and Maxwell is perched before a space heater with his shoes drying on a rack. He is wearing his long autumn overalls, chewing a bowl of cold cereal while gazing at the heater, feeling warm, cheerful, and alert, and ignoring Benedict and the lifeguard as he remains preoccupied by his daydream and unresolved mysteries. Maxwell's overalls are a ludicrous twenty-sixth-century outfit resembling a dragon's robe with sequined sleeves and a hood, fastened at the waist with a zipper. Benedict lounges on the other side of the heater, donning his vest, while the lifeguard leans against the fence, observing them warily. The lifeguard becomes mesmerized by Benedict's attire, which stretches above his elbows, and shakes a newspaper. The lifeguard gapes in disbelief at Benedict, while Maxwell glances up, intrigued. Throughout the episode, Maxwell is about to whistle but is interrupted each time by something remarkable Benedict performs or mentions. The lifeguard, also about to whistle, is interrupted by Benedict's comments and inches forward to whistle again but is paused by Benedict's next remark, which prompts Maxwell and the lifeguard to respond. Maxwell casually observes the peculiar, grinning tall woman once more, and the lifeguard becomes increasingly fidgety. Maxwell, who has been leaning against the fence and tilted back on one foot, touches his hair while the lifeguard's bench flips out from beneath him with a thud. The lifeguard rises and cautiously exits through the window, resembling someone who will alert the nearest baker. Maxwell pats his knee to clear his thoughts and glances up at Benedict beside him. Benedict does not make much headway with Maxwell and looks down, skipping joyfully across the field. As Benedict dances, the leaves outside cease swirling, and a gentle breeze pushes open the cabin window, causing Benedict to leap and close it. Maxwell notices Benedict humming and tilts his ear curiously towards his blind eye, more intrigued by his vision than by what Benedict hums. Maxwell touches his cheek as Benedict sings and points at his weak eye. He touches his chin, which bears no trace of the recent bruise from Wyatt and is now completely bewildered. Maxwell fingers the shoes on the rack, and they start undressing. Maxwell stops himself, and they reach the same full highway where Maxwell's bike had veered into the bench near the playground. As Maxwell and Benedict approach the spot where Maxwell had left his bike tangled in the bench, Maxwell glances around to find his bike absent and the bench unbroken."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Clarence, an angel from Heaven, shares a scene with George, who's drying clothes by a stove, wearing old-fashioned underwear, and feeling cold, gloomy, and drunk. Preoccupied with his near-suicide, George ignores Clarence. Meanwhile, the tollkeeper is intrigued by Clarence's unusual attire and behavior. Throughout, George and the tollkeeper are repeatedly stopped from spitting by Clarence's surprising actions and remarks. Eventually, the tollkeeper exits nervously, suggesting he might call the police. George attempts to clear his mind while Clarence paces and speaks, causing George to become curious about his hearing when the snow stops and a strong wind blows the door open. Confused by the absence of a recent injury, George and Clarence dress and reach the spot where George crashed his car. However, his car is missing, and the tree is undamaged."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "As George and Clarence approach the spot where George had left his car smashed against the tree George looks around to find his car missing and the tree undamaged George interrupts himself and they reach the same empty street where George’s car had swerved into the tree near the sidewalk  George feels the clothes on the line and they start dressing  He feels his lip which shows no sign of the recent cut from Welch and is now thoroughly confused  George feels his ear as Clarence talks and indicates his bad ear  George notices Clarence speaking and cocks his head curiously towards his deaf ear more interested in his hearing than what Clarence says  As Clarence speaks the snow outside stops falling and a strong wind blows open the shack door prompting Clarence to run and close it  Clarence does not make much progress with George and glances up pacing thoughtfully across the room  George rubs his head to clear his mind and looks up at Clarence beside him  The tollkeeper rises and warily exits the door looking as though he will call the nearest cop  George who has been leaning against the wall and tipped back on two legs touches his mouth while the tollkeeper's chair slips out from under him with a crash  George casually looks at the strange smiling little man again and the tollkeeper becomes increasingly nervous  The tollkeeper also about to spit is stopped by Clarence's remarks and leans forward to spit again but is halted by Clarence's next statement which causes George and the tollkeeper to react  Throughout the scene George is about to spit but is stopped each time by something amazing Clarence does or says  The tollkeeper stares incredulously at Clarence while George looks up surprised  The tollkeeper becomes amazed by Clarence's garment which falls below his knees and shakes a book  Clarence stands on the other side of the stove putting on his undershirt while the tollkeeper sits against the wall eyeing them suspiciously  George's underwear is a ludicrous seventeenthcentury garment resembling a baby's nightshirt with embroidered cuffs and a collar gathered at the neck with a drawstring  He is wearing his long winter underwear sipping a mug of hot coffee while staring at the stove feeling cold gloomy and drunk and ignoring Clarence and the tollkeeper as he remains preoccupied by his nearsuicide and unsolved problems  Clarence the angel whose voice has been heard from Heaven is in the water and George is seated before a woodburning stove with his clothes drying on a line "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He is wearing his long winter underwear sipping a mug of hot coffee while staring at the stove feeling cold gloomy and drunk and ignoring Clarence and the tollkeeper as he remains preoccupied by his nearsuicide and unsolved problems Clarence the angel whose voice has been heard from Heaven is in the water and George is seated before a woodburning stove with his clothes drying on a line Clarence stands on the other side of the stove putting on his undershirt while the tollkeeper sits against the wall eyeing them suspiciously George's underwear is a ludicrous seventeenthcentury garment resembling a baby's nightshirt with embroidered cuffs and a collar gathered at the neck with a drawstring The tollkeeper stares incredulously at Clarence while George looks up surprised The tollkeeper becomes amazed by Clarence's garment which falls below his knees and shakes a book The tollkeeper also about to spit is stopped by Clarence's remarks and leans forward to spit again but is halted by Clarence's next statement which causes George and the tollkeeper to react Throughout the scene George is about to spit but is stopped each time by something amazing Clarence does or says George who has been leaning against the wall and tipped back on two legs touches his mouth while the tollkeeper's chair slips out from under him with a crash George casually looks at the strange smiling little man again and the tollkeeper becomes increasingly nervous George rubs his head to clear his mind and looks up at Clarence beside him The tollkeeper rises and warily exits the door looking as though he will call the nearest cop As Clarence speaks the snow outside stops falling and a strong wind blows open the shack door prompting Clarence to run and close it Clarence does not make much progress with George and glances up pacing thoughtfully across the room George feels his ear as Clarence talks and indicates his bad ear George notices Clarence speaking and cocks his head curiously towards his deaf ear more interested in his hearing than what Clarence says George feels the clothes on the line and they start dressing He feels his lip which shows no sign of the recent cut from Welch and is now thoroughly confused As George and Clarence approach the spot where George had left his car smashed against the tree George looks around to find his car missing and the tree undamaged George interrupts himself and they reach the same empty street where George’s car had swerved into the tree near the sidewalk"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The tollkeeper rises and warily exits the door looking as though he will call the nearest cop  George rubs his head to clear his mind and looks up at Clarence beside him  Clarence does not make much progress with George and glances up pacing thoughtfully across the room  As Clarence speaks the snow outside stops falling and a strong wind blows open the shack door prompting Clarence to run and close it  George notices Clarence speaking and cocks his head curiously towards his deaf ear more interested in his hearing than what Clarence says  George feels his ear as Clarence talks and indicates his bad ear  He feels his lip which shows no sign of the recent cut from Welch and is now thoroughly confused  George feels the clothes on the line and they start dressing  George interrupts himself and they reach the same empty street where George’s car had swerved into the tree near the sidewalk  As George and Clarence approach the spot where George had left his car smashed against the tree George looks around to find his car missing and the tree undamaged Clarence the angel whose voice has been heard from Heaven is in the water and George is seated before a woodburning stove with his clothes drying on a line  He is wearing his long winter underwear sipping a mug of hot coffee while staring at the stove feeling cold gloomy and drunk and ignoring Clarence and the tollkeeper as he remains preoccupied by his nearsuicide and unsolved problems  George's underwear is a ludicrous seventeenthcentury garment resembling a baby's nightshirt with embroidered cuffs and a collar gathered at the neck with a drawstring  Clarence stands on the other side of the stove putting on his undershirt while the tollkeeper sits against the wall eyeing them suspiciously  The tollkeeper becomes amazed by Clarence's garment which falls below his knees and shakes a book  The tollkeeper stares incredulously at Clarence while George looks up surprised  Throughout the scene George is about to spit but is stopped each time by something amazing Clarence does or says  The tollkeeper also about to spit is stopped by Clarence's remarks and leans forward to spit again but is halted by Clarence's next statement which causes George and the tollkeeper to react  George casually looks at the strange smiling little man again and the tollkeeper becomes increasingly nervous  George who has been leaning against the wall and tipped back on two legs touches his mouth while the tollkeeper's chair slips out from under him with a crash "
        }
      ]
    }
  ]
}