{
  "ground_truth": "George regards the two of them with manly disgust; they are like two kids to him, and a nuisance. He starts over for the candy counter and gives Violet a paper sack containing licorice shoelaces. Violet gives him the money, jumps down off her stool, and exits, while Mary, watching, sticks out her tongue as she passes. George puts some chocolate ice cream in a dish, pulls a magazine from his pocket, shows it to her, and leans down to finish scooping out the ice cream, his deaf ear toward her. Mary, whispering, leans over and speaks softly. She then draws back quickly, looking down, terrified at what she has said as he turns back to the cash register, whistling. He observes the entrance to the prescription room at the end of the fountain as Gower comes to the entrance, bleary-eyed, unshaven, and chewing an old unlit cigar, with a gruff and mean manner. Evidently, he has been drinking. George turns back to the cash register when he notices an open telegram on the shelf. He is about to toss it aside when he starts to read it and then sets it down. A goodness of heart expresses itself in a desire to do something for Gower; he gives the ice cream to Mary without comment and sidles back toward Gower. Gower, drunk, is intent on putting some capsules into a box. George looks curiously at Gower, realizing that he is quite drunk. Gower fumbles and drops some of the capsules to the floor, with capsules spilling on the floor at their feet. Gower waves George aside, takes his old wet cigar, shoves it in his mouth, and sits in an old Morris chair in the background. George picks up the capsule box, not knowing what to do or say, turns a bottle around from which Gower has taken the powder for the capsules, and stands still, horrified. His fingers fumble, and his eyes go, harassed, to the bottle labeled poison. George comes out into the main room, and with an inspiration, he dashes out the door and down the street, followed by Mary's eyes. He stops as Potter's carriage is waiting at the entrance. Suddenly, he runs up the stairs to offices that are ancient and a bit on the rickety side. The office vibrates with an aura of crisis as George enters and proceeds directly toward his father's office. There is a counter with a grill, something like a bank. With him at the door, also listening, are Cousin Tilly Bailey, a waspish-looking woman who is the telephone operator, and Cousin Eustace Bailey, the clerk. As George is about to enter his father's office, Uncle Billy grabs him by the arm.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "George considers the pair of them with masculine revulsion; they are like two children to him, and an annoyance. He begins over for the confectionery counter and hands Violet a parchment bag containing licorice laces. Violet hands him the cash, leaps down off her seat, and departs, while Mary, observing, protrudes her tongue as she passes. George places some chocolate ice cream in a bowl, draws a periodical from his pocket, reveals it to her, and bends down to complete scooping out the ice cream, his deaf ear toward her. Mary, murmuring, leans over and utters softly. She then retracts quickly, glancing down, frightened at what she has uttered as he turns back to the cash register, whistling. He notices the entryway to the prescription room at the terminus of the fountain as Gower approaches the entryway, bleary-eyed, unshaved, and chewing an old unlit cigar, with a coarse and harsh manner. Evidently, he has been imbibing. George turns back to the cash register when he perceives an open telegram on the ledge. He is about to fling it aside when he begins to read it and then places it down. A benevolence of heart articulates itself in a wish to do something for Gower; he hands the ice cream to Mary without remark and sidles back toward Gower. Gower, inebriated, is focused on placing some capsules into a container. George gazes inquisitively at Gower, realizing that he is quite inebriated. Gower fumbles and drops some of the capsules to the ground, with capsules spilling on the ground at their feet. Gower gestures George aside, takes his old damp cigar, shoves it in his mouth, and sits in an old Morris chair in the background. George collects the capsule container, unsure what to do or say, turns a bottle around from which Gower has taken the powder for the capsules, and stands motionless, appalled. His fingers fumble, and his eyes go, tormented, to the bottle labeled poison. George comes out into the main room, and with an inspiration, he bolts out the door and down the street, followed by Mary's gaze. He halts as Potter's carriage is waiting at the entryway. Suddenly, he races up the stairs to offices that are ancient and somewhat on the rickety side. The office vibrates with an aura of crisis as George enters and proceeds directly toward his father's office. There is a counter with a grill, something like a bank. With him at the door, also listening, are Cousin Tilly Bailey, a waspish-appearing woman who is the telephone operator, and Cousin Eustace Bailey, the clerk. As George is about to enter his father's office, Uncle Billy seizes him by the arm."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "George regards the two of them with manly disgust; they are like two kids to him, and a nuisance. The candy counter is approached, and a paper sack containing licorice shoelaces is given by him to Violet. The money is given to him by Violet, she jumps down off her stool, and exits, while Mary, watching, sticks out her tongue as she passes. Some chocolate ice cream is put in a dish by George, a magazine is pulled from his pocket, and it is shown to her. He leans down to finish scooping out the ice cream, his deaf ear toward her. Mary, whispering, leans over and speaks softly. She then draws back quickly, looking down, terrified at what she has said while he turns back to the cash register, whistling. The entrance to the prescription room at the end of the fountain is observed by him as Gower comes to the entrance, bleary-eyed, unshaven, and chewing an old unlit cigar, with a gruff and mean manner. Evidently, drinking has been done by him. The cash register is turned back to by George when an open telegram on the shelf is noticed. It is about to be tossed aside by him when he starts to read it and then sets it down. A goodness of heart expresses itself in a desire to do something for Gower. The ice cream is given to Mary without comment, and he sidles back toward Gower. Gower, drunk, is intent on putting some capsules into a box. Gower is looked at curiously by George, realizing that he is quite drunk. Gower fumbles and drops some of the capsules, with capsules spilling on the floor at their feet. George is waved aside by Gower; his old wet cigar is taken, shoved in his mouth, and an old Morris chair in the background is sat in by him. The capsule box is picked up by George, not knowing what to do or say, he turns a bottle around from which the powder for the capsules has been taken by Gower, and stands still, horrified. His fingers fumble, and his eyes go, harassed, to the bottle labeled poison. George comes out into the main room, and with an inspiration, he dashes out the door and down the street, followed by Mary's eyes. Potter's carriage is seen waiting at the entrance as he stops. Suddenly, the stairs are run up by him, toward offices that are ancient and a bit on the rickety side. The office vibrates with an aura of crisis as George enters and proceeds directly toward his father's office. There is a counter with a grill, something like a bank. With him at the door, also listening, are Cousin Tilly Bailey, a waspish-looking woman who is the telephone operator, and Cousin Eustace Bailey, the clerk. Just as George is about to enter his father's office, Uncle Billy grabs him by the arm."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "George views the two with manly disgust, seeing them as childish nuisances. He heads to the candy counter, hands Violet a paper sack of licorice shoelaces, and she gives him money, jumps off her stool, and leaves. Mary observes, sticking out her tongue at Violet. George scoops chocolate ice cream into a dish, shows Mary a magazine, and leans down, his deaf ear toward her. Mary whispers softly, then withdraws, frightened by her words. George whistles, turning to the cash register, then notices Gower at the prescription room entrance, looking rough and chewing a cigar, seemingly drunk. George spots an open telegram on the shelf, reads it, and feels compelled to help Gower. He gives Mary the ice cream and approaches Gower, who spills capsules on the floor. Gower, drunk, waves George away and sits in a chair. George, picking up the capsules, notices the bottle labeled poison and is horrified. Inspired, he rushes out the door, observed by Mary. He stops at Potter's carriage, then runs upstairs to old, shaky offices vibrating with urgency. Entering, he heads for his father's office, past a counter resembling a bank, joined by Cousin Tilly Bailey, the telephone operator, and Cousin Eustace Bailey, the clerk. Uncle Billy grabs George's arm as he's about to enter his father's office."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "George views them with disgust, seeing them as kids. He heads to the candy counter, gives Violet a paper sack with licorice shoelaces. She pays, leaves, and Mary, observing, sticks her tongue out. George prepares chocolate ice cream, shows Mary a magazine, and leans down, ignoring her. Whispering, Mary reacts fearfully at what she says as George turns away, whistling. He notices the prescription room with Gower, who appears drunk, unshaven, with a cigar. Seeing an open telegram, George reads it, feeling compassion for Gower. He gives Mary ice cream without a word and approaches Gower, who is dropping capsules. Gower dismissively takes his cigar and sits. George, disturbed, examines a bottle labeled poison. He runs out, passing Mary's gaze, halts at Potter's carriage, then dashes up to his father’s old office. The office is tense. At the door, Cousin Tilly and Cousin Eustace listen as Uncle Billy stops George from entering his father's office."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "George, with a sense of manly disdain, regards the two of them as if they were nothing more than two bothersome children; to him, they are quite the nuisance. He makes his way over to the candy counter with purpose and hands Violet a paper sack that contains licorice shoelaces. In return, Violet gives him the money, hops down off her stool with a swift motion, and exits the scene. Meanwhile, Mary, as she observes from her vantage point, sticks out her tongue mischievously as Violet passes by. \n\nGeorge then turns his attention to some chocolate ice cream, placing it carefully into a dish. He retrieves a magazine from his pocket, flipping it open to show Mary, and leans down to finish scooping the ice cream, his deaf ear presented toward her as he does so. Mary, leaning in closer, whispers softly, her voice barely audible. She then quickly draws back, her eyes cast down, a look of terror crossing her face as she realizes what she has just said, while George turns with a nonchalant whistle back to the cash register. He casts a glance toward the entrance to the prescription room, located at the end of the fountain, just as Gower makes his unsteady appearance. Gower, bleary-eyed, unshaven, and chewing on an old unlit cigar with a notably gruff and mean demeanor, is evidently under the influence of alcohol. \n\nGeorge turns again toward the cash register and notices an open telegram lying on the shelf. He is about to dismiss it when he decides to give it a read and then sets it back down. A warmth of heart and a genuine desire to help Gower surfaces within him; he silently hands the ice cream to Mary and subtly sidles back toward Gower. The drunk Gower is engrossed in putting capsules into a box, though his movements are clumsy and unfocused. Observing this, George realizes that Gower is quite inebriated. Gower's fumbling results in him dropping some capsules onto the floor, which scatter at their feet. Gower waves George aside, takes his soggy old cigar, unlit but chewed, and shoves it back into his mouth as he collapses into an old, worn Morris chair in the background. \n\nWith uncertainty hovering over him, George picks up the capsule box, unsure of what action to take or words to say. Turning a bottle around, the very one from which Gower has sourced the powder for the capsules, he becomes still, gripped by horror. His fingers fumble awkwardly, and his eyes, filled with anxiety, fix on the bottle labeled as poison. Emerging back into the main room with sudden inspiration, George dashes out the door and down the street, Mary's eyes following his hurried departure. He halts abruptly as he sees Potter's carriage waiting near the entrance. In a sudden burst of energy, he sprints up the stairs to offices that are ancient in appearance and somewhat rickety. The office seems to vibrate with an aura of urgency as George makes his way directly toward his father's office. There is a counter, adorned with a grill that resembles one that would be found in a bank. As he stands at the door, attentive, Cousin Tilly Bailey, a woman with a waspish look who serves as the telephone operator, and Cousin Eustace Bailey, the diligent clerk, are also listening. Just as George is poised to enter his father's office, Uncle Billy seizes him by the arm."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "George, carrying with him a sense of manly disdain and bearing an air of superiority, looks at the two individuals as if they were nothing more than bothersome young children; to him, they seem nothing less than a true nuisance. With intent, he strides over to the candy counter, his movements deliberate and full of purpose. Once there, he hands Violet a modest paper sack filled with licorice shoelaces. In exchange for this, Violet gives him the money, then gracefully hops down off her stool with a swift, agile motion and exits the scene without hesitation. As this unfolds, Mary, who is observing the entire exchange from her position, sticks out her tongue in a playful and mischievous manner as Violet passes by her. \n\nAfterward, George shifts his attention to some chocolate ice cream, ensuring to place it carefully into a dish. He then reaches into his pocket to retrieve a magazine, flipping it open with a practiced hand to show Mary its contents. As he leans down to finish scooping the ice cream, his deaf ear is turned toward her inadvertently. Mary leans in closer, her voice barely above a whisper, and softly utters something, her words hardly audible. Quickly, she pulls back, a shadow of terror crossing her face as she comprehends what she has just said, while George nonchalantly turns back to the cash register, whistling without a care. He throws a glance toward the entrance to the prescription room, located conveniently at the end of the fountain, just as Gower makes his entrance. Gower appears bleary-eyed, unshaven, and is chewing on an old, unlit cigar with a notably gruff and mean demeanor; it is evident from his swaying and demeanor that he is under the influence of alcohol. \n\nGeorge once again turns his attention toward the cash register and notices an open telegram that is resting on the shelf. Initially about to ignore it, he decides to read it and then gently sets it back down. A warmth of heart blooms within him, and a genuine desire to help Gower rises; silently, he hands the ice cream to Mary and subtly edges back toward Gower. The intoxicated Gower is deeply engrossed in the task of putting capsules into a box, though his actions are clumsy and unfocused. Seeing this, George is quick to realize that Gower is quite inebriated. Gower's unsteady hands cause him to drop several capsules onto the floor, where they scatter at their feet. Gower waves George aside dismissively, taking his soggy, old cigar—unlit but well-chewed—and shoves it back into his mouth as he collapses into an old, worn Morris chair that sits in the background. \n\nWith a sense of uncertainty hanging over him, George gingerly picks up the capsule box, unsure about what action to take or words to say. As he turns a particular bottle around—the very one from which Gower has sourced the powder for the capsules—he becomes utterly still, gripped by a sudden horror. His fingers fumble with awkwardness, and his eyes, filled with anxiety, fix on what is written on the bottle: poison. Feeling a sudden burst of inspiration, George rushes back into the main room, dashes out the door, and runs down the street with urgency, Mary's eyes following his hurried departure. He comes to a sudden stop as he notices Potter's carriage waiting near the entrance. In a newfound burst of energy, he sprints up the stairs to offices that have an ancient, somewhat rickety appearance. The office, resonating with an aura of urgency, seems almost alive as George makes his way directly toward his father's office. A counter, adorned with a grill reminiscent of those found in banks, stands near him. Positioned at the door, attentive and alert, are Cousin Tilly Bailey, a woman with a waspish look who diligently serves as the telephone operator, and Cousin Eustace Bailey, the ever-diligent clerk, both equally attentive to the unfolding drama. Just as George is about to enter his father's office, Uncle Billy seizes him firmly by the arm, halting his progress."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "With a stern expression of manly disgust etched across his face, George casts a disapproving gaze at the two of them, as they seem to him merely like two immature children, a mere nuisance in his otherwise orderly world. He decisively begins his journey toward the candy counter, each step filled with purpose, and extends a paper sack to Violet, which holds within it the sweet enticement of licorice shoelaces. In a swift exchange, Violet hands over the money to George, then eagerly leaps down from her stool with youthful energy and makes her way toward the exit. Meanwhile, Mary, who attentively watches this scene unfold, mischievously sticks out her tongue at Violet as she passes by, a fleeting moment of youthful playful defiance. George, seemingly unfazed by this, scoops some chocolate ice cream into a dish, his hands moving with practiced ease. From his pocket emerges a magazine, which he casually displays to Mary, before bending down to complete the task of filling the ice cream dish, his body angled so his deaf ear faces her. Mary, her voice a mere whisper, leans in close to George as she speaks softly, the words barely escaping her lips. Almost immediately, she recoils, her demeanor shifting to one of alarm, her eyes casting downward, clearly apprehensive about the gravity of her words, as George turns away, his steps leading him back towards the cash register, a melody of whistling filling the space around him. His eyes drift to the entrance of the prescription room located at the far end of the soda fountain, where Gower appears, his appearance disheveled and characterized by bleary eyes, an unshaven face, and an old, unlit cigar clamped between his teeth, projecting an aura of gruffness and irritation. It is apparent to George that Gower has spent some time indulging in drink. George, returning his attention to the cash register, spots an open telegram perched on a shelf. His first instinct is to dismiss it and brush it aside, yet something compels him to read its contents, prompting him to place it back down with a sense of newfound purpose. A compassionate urge swells within him, a noble inclination to assist Gower somehow. He hands the ice cream to Mary without uttering a word and subtly moves back toward Gower. Observing Gower's drunken state, George watches as Gower, in his inebriated clumsiness, attempts to fill a box with capsules but drops several to the floor, the small capsules scattering around their feet. Gower, barely acknowledging the mishap, waves George away dismissively, then takes the soggy end of his cigar, shoves it into his mouth defiantly, and retreats to an old, worn Morris chair in the background, where he slumps into it. George, now holding the capsule box uncertainly, is at a loss for actions or words. He then pivots a bottle from which Gower drew the powder for the capsules and stands frozen, a look of horror consuming his features as his eyes lock onto the label that ominously reads 'poison.' The realization ignites a creative spark within George, compelling him to swiftly exit the main room. With a burst of energy, he dashes out the door and down the street, Mary's eyes following his retreating form with an unbroken gaze. His pace comes to an abrupt halt as he encounters Potter's carriage waiting near the entrance. Seized by urgency, George makes a sudden decision to ascend the stairs leading to the offices, which stand ancient and somewhat precarious in their construction, a testament to times past. Inside, the office resonates with an air of immediate crisis as George strides in without hesitation, his destination clear: his father's office. He approaches a counter shielded by a grill, reminiscent of those found in banks. As George reaches the door, anticipation hangs in the air shared by Cousin Tilly Bailey, a sharp-featured woman fulfilling her duties as the telephone operator, and Cousin Eustace Bailey, present in his role as a clerk, both listening intently. Just as George is on the brink of entering his father's office, Uncle Billy appears and seizes him by the arm, halting his progress in its tracks."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "George views them with manly disgust, considering them childish nuisances. He moves to the candy counter, hands Violet a paper sack of licorice shoelaces, takes her money, and watches as she exits, sticking her tongue out at Mary. He then prepares chocolate ice cream for Mary, shows her a magazine, and listens as she whispers to him before quickly retreating. At the cash register, he notes Gower's gruff entrance, his unkempt appearance, and signs of intoxication. As he turns back, George spots an open telegram, reads it, and feels a surge of compassion for Gower. He silently gives ice cream to Mary and edges toward Gower, who clumsily drops capsules. Observing Gower's drunken state, George picks up the fallen capsule box, inspects the labeled poison bottle, and stands in horror. With sudden inspiration, he rushes out, Mary's eyes following him, halting briefly at Potter's carriage before hurrying up to his father's precarious office, filled with tension. As he reaches the door, Uncle Billy catches his arm, with Cousin Tilly and Cousin Eustace nearby, listening."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "George regards the two of them with manly disgust; they are like two kids to him, and a nuisance. He starts over for the candy counter in the small-town drugstore, a common gathering place for locals, and gives Violet a paper sack containing licorice shoelaces, a popular treat among children during this era. Violet gives him the money, jumps down off her stool, and exits, while Mary, watching, sticks out her tongue as she passes. George puts some chocolate ice cream, a classic flavor choice, in a dish, pulls a magazine from his pocket, the latest issue of a popular periodical, shows it to her, and leans down to finish scooping out the ice cream, his deaf ear, which he lost hearing in after a childhood illness, toward her. Mary, whispering, leans over and speaks softly. She then draws back quickly, looking down, terrified at what she has said as he turns back to the cash register, whistling a catchy tune from a hit radio show. He observes the entrance to the prescription room at the end of the fountain as Gower, the pharmacist who has served the town for decades, comes to the entrance, bleary-eyed, unshaven, and chewing an old unlit cigar, with a gruff and mean manner. Evidently, he has been drinking, a habit he's struggled with since the loss of his son. George turns back to the cash register when he notices an open telegram on the shelf. He is about to toss it aside when he starts to read it, learning of a personal tragedy in Gower's life, and then sets it down. A goodness of heart expresses itself in a desire to do something for Gower; he gives the ice cream to Mary without comment and sidles back toward Gower. Gower, drunk, is intent on putting some capsules into a box, likely for a prescription. George looks curiously at Gower, realizing that he is quite drunk. Gower fumbles and drops some of the capsules to the floor, with capsules spilling on the floor at their feet. Gower waves George aside, takes his old wet cigar, shoves it in his mouth, and sits in an old Morris chair, an heirloom from his grandfather, in the background. George picks up the capsule box, not knowing what to do or say, turns a bottle around from which Gower has taken the powder for the capsules, and stands still, horrified. His fingers fumble, and his eyes go, harassed, to the bottle labeled poison, realizing the potential danger. George comes out into the main room, and with an inspiration, he dashes out the door and down the street, followed by Mary's eyes. He stops as Potter's carriage, a rare sight in the automobile age, is waiting at the entrance. Suddenly, he runs up the stairs to offices that are ancient and a bit on the rickety side, reminiscent of the town's earlier days. The office vibrates with an aura of crisis as George enters and proceeds directly toward his father's office. There is a counter with a grill, something like a bank, indicating a place of business. With him at the door, also listening, are Cousin Tilly Bailey, a waspish-looking woman who is the telephone operator, indispensable in the days before automated exchanges, and Cousin Eustace Bailey, the clerk, who handles clerical duties with meticulous care. As George is about to enter his father's office, Uncle Billy, whose memory is notoriously unreliable, grabs him by the arm."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "George regards the two of them with manly disgust. they are like two kids to him and a nuisance. He starts over for the candy counter and gives Violet a paper sack containing licorice shoelaces. Violet gives him the money jumps down off her stool and exits while Mary watching sticks out her tongue as she passes. George puts some chocolate ice cream in a dish pulls a magazine from his pocket shows it to her and leans down to finish scooping out the ice cream his deaf ear toward her. Mary whispering leans over and speaks softly. She then draws back quickly looking down terrified at what she has said as he turns back to the cash register whistling. He observes the entrance to the prescription room at the end of the fountain. as Gower comes to the entrance blearyeyed unshaven and chewing an old unlit cigar with a gruff and mean manner. Evidently he has been drinking. George turns back to the cash register when he notices an open telegram on the shelf. He is about to toss it aside when he starts to read it and then sets it down. A goodness of heart expresses itself in a desire to do something for Gower. he gives the ice cream to Mary without comment and sidles back toward Gower. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Gower drunk is intent on putting some capsules into a box. George looks curiously at Gower realizing that he is quite drunk. Gower fumbles and drops some of the capsules to the floor with capsules spilling on the floor at their feet. Gower waves George aside takes his old wet cigar shoves it in his mouth and sits in an old Morris chair in the background. George picks up the capsule box not knowing what to do or say turns a bottle around from which Gower has taken the powder for the capsules and stands still horrified. His fingers fumble and his eyes go harassed to the bottle labeled poison. George comes out into the main room and with an inspiration he dashes out the door and down the street followed by Mary's eyes. He stops as Potter's carriage is waiting at the entrance. Suddenly he runs up the stairs to offices that are ancient and a bit on the rickety side. The office vibrates with an aura of crisis as George enters and proceeds directly toward his father's office. There is a counter with a grill something like a bank. With him at the door also listening are Cousin Tilly Bailey a waspishlooking woman who is the telephone operator and Cousin Eustace. Bailey the clerk. As George is about to enter his father's office Uncle Billy grabs him by the arm."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "George regards the two of them with manly disgust. they are like two kids to him and a nuisance. He starts over for the candy counter and gives Violet a paper sack containing licorice shoelaces. Violet gives him the money jumps down off her stool and exits while Mary watching sticks out her tongue as she passes. George puts some chocolate ice cream in a dish pulls a magazine from his pocket shows it to her and leans down to finish scooping out the ice cream his deaf ear toward her. Mary whispering leans over and speaks softly. She then draws back quickly looking down terrified at what she has said as he turns back to the cash register whistling. He observes the entrance to the prescription room at the end of the fountain. as Gower comes to the entrance blearyeyed unshaven and chewing an old unlit cigar with a gruff and mean manner. Evidently he has been drinking. George turns back to the cash register when he notices an open telegram on the shelf. He is about to toss it aside when he starts to read it and then sets it down. A goodness of heart expresses itself in a desire to do something for Gower. he gives the ice cream to Mary without comment and sidles back toward Gower. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. Gower drunk is intent on putting some capsules into a box. George looks curiously at Gower realizing that he is quite drunk. Gower fumbles and drops some of the capsules to the floor with capsules spilling on the floor at their feet. Gower waves George aside takes his old wet cigar shoves it in his mouth and sits in an old Morris chair in the background. George picks up the capsule box not knowing what to do or say turns a bottle around from which Gower has taken the powder for the capsules and stands still horrified. His fingers fumble and his eyes go harassed to the bottle labeled poison. George comes out into the main room and with an inspiration he dashes out the door and down the street followed by Mary's eyes. He stops as Potter's carriage is waiting at the entrance. Suddenly he runs up the stairs to offices that are ancient and a bit on the rickety side. The office vibrates with an aura of crisis as George enters and proceeds directly toward his father's office. There is a counter with a grill something like a bank. With him at the door also listening are Cousin Tilly Bailey a waspishlooking woman who is the telephone operator and Cousin Eustace. Bailey the clerk. As George is about to enter his father's office Uncle Billy grabs him by the arm."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "George regards the two of them with manly disgust. they are like two kids to him and a nuisance. He starts over for the candy counter and gives Violet a paper sack containing licorice shoelaces. Violet gives him the money jumps down off her stool and exits while Mary watching sticks out her tongue as she passes. George puts some chocolate ice cream in a dish pulls a magazine from his pocket shows it to her and leans down to finish scooping out the ice cream his deaf ear toward her. Mary whispering leans over and speaks softly. She then draws back quickly looking down terrified at what she has said as he turns back to the cash register whistling. He stops as Potter's carriage is waiting at the entrance. Suddenly he runs up the stairs to offices that are ancient and a bit on the rickety side. The office vibrates with an aura of crisis as George enters and proceeds directly toward his father's office. There is a counter with a grill something like a bank. With him at the door also listening are Cousin Tilly Bailey a waspishlooking woman who is the telephone operator and Cousin Eustace. Bailey the clerk. As George is about to enter his father's office Uncle Billy grabs him by the arm."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "George regards the two of them with manly disgust. they are like two kids to him and a nuisance. He starts over for the candy counter and gives Violet a paper sack containing licorice shoelaces. With him at the door also listening are Cousin Tilly Bailey a waspishlooking woman who is the telephone operator and Cousin Eustace. Bailey the clerk. As George is about to enter his father's office Uncle Billy grabs him by the arm."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Bob admires the trio with feline fascination; they resemble three owls to him, and an enigma. He heads over to the popcorn stand and hands Daisy a glass jar filled with gummy bears. Daisy hands him the tickets, crawls up into her hammock, and vanishes, while Carla, observing, winks as she departs. Bob places some strawberry sorbet in a cup, retrieves an atlas from his backpack, displays it to her, and crouches down to continue ladling the sorbet, his blind eye facing her. Carla, muttering, stoops forward and utters shyly. She then flinches backward rapidly, gazing upward, astonished by what she has uttered as he swivels back to the jukebox, humming. He inspects the exit to the reading nook at the start of the arcade as Baxter arrives at the exit, misty-eyed, unshorn, and chewing a fresh, unlit cigarette, with a gentle and kind demeanor. Evidently, he has been singing. Bob pivots back to the jukebox when he spots a folded notebook on the bench. He is about to pitch it aside when he begins to scan it and then places it down. A sternness of soul manifests in a longing to assist Baxter; he delivers the sorbet to Carla without ado and shuffles back toward Baxter. Baxter, crooning, is focused on placing some marbles into a crate. Bob observes curiously at Baxter, realizing that he is quite melodic. Baxter fumbles and drops some of the marbles to the ground, with marbles scattering on the ground at their heels. Baxter gestures for Bob to move, takes his fresh dry cigarette, sticks it in his mouth, and reclines in an old rocking chair in the foreground. Bob picks up the marble crate, uncertain about what to do or say, rotates a container around from which Baxter has extracted the sprinkles for the marbles, and remains still, startled. His hands tremble, and his glance shifts, bewildered, to the container labeled nectar. Bob emerges into the central chamber, and with a burst of energy, he sprints out the window and across the avenue, trailed by Carla's glance. He halts as Johnson’s bicycle is resting at the exit. Abruptly, he dashes up the ladder to rooms that are vintage and slightly on the unstable side. The room echoes with a sense of tranquility as Bob enters and strides directly toward his uncle's room. There is a shelf with a mesh, similar to a library. With him at the entryway, also eavesdropping, are Cousin Lola Granger, a stern-looking individual who is the postal worker, and Cousin Hector Granger, the cashier. As Bob is about to step into his uncle's room, Aunt Brenda clutches him by the elbow."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "George finds Violet and Mary, two younger individuals he finds annoying, at the candy counter. He hands Violet a bag of licorice shoelaces, takes her money, and watches her leave as Mary sticks out her tongue. George then serves Mary chocolate ice cream and shows her a magazine. Distracted by a telegram, George spots Gower, who appears disheveled and drunk. Concerned for Gower, George gives the ice cream to Mary and approaches Gower, realizing his drunken state. George witnesses Gower mishandling capsules, dropping them to the floor, and then notices a poison label on a bottle. Horrified, George dashes outside, followed by Mary's gaze. He sees Potter's carriage and heads to his father's office, sensing urgency. As he arrives, he finds Cousin Tilly, the telephone operator, and Cousin Eustace, the clerk, listening at the door. Just as George is about to enter, Uncle Billy stops him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "As George is about to enter his father's office Uncle Billy grabs him by the arm Bailey the clerk With him at the door also listening are Cousin Tilly Bailey a waspishlooking woman who is the telephone operator and Cousin Eustace There is a counter with a grill something like a bank The office vibrates with an aura of crisis as George enters and proceeds directly toward his father's office Suddenly he runs up the stairs to offices that are ancient and a bit on the rickety side He stops as Potter's carriage is waiting at the entrance George comes out into the main room and with an inspiration he dashes out the door and down the street followed by Mary's eyes His fingers fumble and his eyes go harassed to the bottle labeled poison George picks up the capsule box not knowing what to do or say turns a bottle around from which Gower has taken the powder for the capsules and stands still horrified Gower waves George aside takes his old wet cigar shoves it in his mouth and sits in an old Morris chair in the background Gower fumbles and drops some of the capsules to the floor with capsules spilling on the floor at their feet George looks curiously at Gower realizing that he is quite drunk Gower drunk is intent on putting some capsules into a box he gives the ice cream to Mary without comment and sidles back toward Gower A goodness of heart expresses itself in a desire to do something for Gower He is about to toss it aside when he starts to read it and then sets it down George turns back to the cash register when he notices an open telegram on the shelf Evidently he has been drinking as Gower comes to the entrance blearyeyed unshaven and chewing an old unlit cigar with a gruff and mean manner He observes the entrance to the prescription room at the end of the fountain She then draws back quickly looking down terrified at what she has said as he turns back to the cash register whistling Mary whispering leans over and speaks softly George puts some chocolate ice cream in a dish pulls a magazine from his pocket shows it to her and leans down to finish scooping out the ice cream his deaf ear toward her Violet gives him the money jumps down off her stool and exits while Mary watching sticks out her tongue as she passes He starts over for the candy counter and gives Violet a paper sack containing licorice shoelaces they are like two kids to him and a nuisance George regards the two of them with manly disgust"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "they are like two kids to him and a nuisance George regards the two of them with manly disgust Violet gives him the money jumps down off her stool and exits while Mary watching sticks out her tongue as she passes He starts over for the candy counter and gives Violet a paper sack containing licorice shoelaces Mary whispering leans over and speaks softly George puts some chocolate ice cream in a dish pulls a magazine from his pocket shows it to her and leans down to finish scooping out the ice cream his deaf ear toward her He observes the entrance to the prescription room at the end of the fountain She then draws back quickly looking down terrified at what she has said as he turns back to the cash register whistling Evidently he has been drinking as Gower comes to the entrance blearyeyed unshaven and chewing an old unlit cigar with a gruff and mean manner He is about to toss it aside when he starts to read it and then sets it down George turns back to the cash register when he notices an open telegram on the shelf he gives the ice cream to Mary without comment and sidles back toward Gower A goodness of heart expresses itself in a desire to do something for Gower George looks curiously at Gower realizing that he is quite drunk Gower drunk is intent on putting some capsules into a box Gower waves George aside takes his old wet cigar shoves it in his mouth and sits in an old Morris chair in the background Gower fumbles and drops some of the capsules to the floor with capsules spilling on the floor at their feet His fingers fumble and his eyes go harassed to the bottle labeled poison George picks up the capsule box not knowing what to do or say turns a bottle around from which Gower has taken the powder for the capsules and stands still horrified He stops as Potter's carriage is waiting at the entrance George comes out into the main room and with an inspiration he dashes out the door and down the street followed by Mary's eyes The office vibrates with an aura of crisis as George enters and proceeds directly toward his father's office Suddenly he runs up the stairs to offices that are ancient and a bit on the rickety side With him at the door also listening are Cousin Tilly Bailey a waspishlooking woman who is the telephone operator and Cousin Eustace There is a counter with a grill something like a bank As George is about to enter his father's office Uncle Billy grabs him by the arm Bailey the clerk"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Gower drunk is intent on putting some capsules into a box George looks curiously at Gower realizing that he is quite drunk Gower fumbles and drops some of the capsules to the floor with capsules spilling on the floor at their feet Gower waves George aside takes his old wet cigar shoves it in his mouth and sits in an old Morris chair in the background George picks up the capsule box not knowing what to do or say turns a bottle around from which Gower has taken the powder for the capsules and stands still horrified His fingers fumble and his eyes go harassed to the bottle labeled poison George comes out into the main room and with an inspiration he dashes out the door and down the street followed by Mary's eyes He stops as Potter's carriage is waiting at the entrance Suddenly he runs up the stairs to offices that are ancient and a bit on the rickety side The office vibrates with an aura of crisis as George enters and proceeds directly toward his father's office There is a counter with a grill something like a bank With him at the door also listening are Cousin Tilly Bailey a waspishlooking woman who is the telephone operator and Cousin Eustace Bailey the clerk As George is about to enter his father's office Uncle Billy grabs him by the arm George regards the two of them with manly disgust they are like two kids to him and a nuisance He starts over for the candy counter and gives Violet a paper sack containing licorice shoelaces Violet gives him the money jumps down off her stool and exits while Mary watching sticks out her tongue as she passes George puts some chocolate ice cream in a dish pulls a magazine from his pocket shows it to her and leans down to finish scooping out the ice cream his deaf ear toward her Mary whispering leans over and speaks softly She then draws back quickly looking down terrified at what she has said as he turns back to the cash register whistling He observes the entrance to the prescription room at the end of the fountain as Gower comes to the entrance blearyeyed unshaven and chewing an old unlit cigar with a gruff and mean manner Evidently he has been drinking George turns back to the cash register when he notices an open telegram on the shelf He is about to toss it aside when he starts to read it and then sets it down A goodness of heart expresses itself in a desire to do something for Gower he gives the ice cream to Mary without comment and sidles back toward Gower"
        }
      ]
    }
  ]
}