{
  "ground_truth": "The door opens and a woman appears; it is Mrs. Bailey, who has changed amazingly with a harsh and tired face, and her eyes, once kindly and understanding, now show cold suspicion. She gives no sign that she knows him, which is a cruel blow to George. She starts to close the door, but George stops her, and she slams the door shut in George's face. George stands a moment, stunned, then turns and runs out to the sidewalk, until his face fills the screen, his features distorted by the emotional chaos within him. They walk out of scene. Now it is just outside a cemetery, with graves where the houses used to be. The two walk into the cemetery, with George wandering like a lost soul among the tombstones, and Clarence trotting at his heels. George jumps up, grabs Clarence by the coat collar, and shakes him, then lets Clarence go and runs off, while Clarence falls to the ground, rubbing his neck. Mary comes out the door, then turns and locks it; we see George watching her from the sidewalk. Mary is very different, with no buoyancy in her walk, none of Mary's abandon and love of life, wearing glasses, no make-up, lips compressed, elbows close to body. She looks flat, dried up, and extremely self-satisfied and efficient. George watches her as she looks up, surprised, but not recognizing him, continues on. George and Mary are on the sidewalk, and Mary starts to run away from him as he follows desperately. He catches up to her, grabs her by the arms, and keeps a tight grip on her as she struggles to free herself. Mary breaks away from him and dashes into the first door she comes to, the Blue Moon Bar, running in and screaming, while George comes in practically insane. It is crowded, and the place goes into an uproar. Some of the men grab and hold on to him, many of whom were present during the run on the Building and Loan. Mary lets out a final scream, then faints into the arms of a couple of women at the bar. Just as George breaks through the door, Bert arrives in his police car, gets out, and heads for the door to run into George as he comes out. He grabs for George, who punches him, knocking him down, then continues running down the street yelling for Clarence. Bert gets up, takes out his gun, and fires several shots after the fleeing figure. Bert gets into the police car and, with the siren screaming, sets off in pursuit of George, heading to the same part of the bridge where George was standing before Clarence jumped in.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The portal opens and a lady emerges; it is Mrs. Bailey, who has altered astonishingly with a severe and weary visage, and her eyes, once kindly and empathetic, now display frigid distrust. She gives no indication that she recognizes him, which is a merciless strike to George. She begins to shut the portal, but George halts her, and she slams the portal closed in George's visage. George stands a moment, stupefied, then turns and dashes out to the pavement, until his visage fills the screen, his countenance warped by the emotional turmoil within him. They walk out of view. Now it is just outside a graveyard, with burial sites where the dwellings used to be. The duo strolls into the graveyard, with George roaming like a lost spirit among the headstones, and Clarence jogging at his heels. George leaps up, seizes Clarence by the jacket collar, and shakes him, then lets Clarence go and dashes away, while Clarence tumbles to the earth, rubbing his throat. Mary exits the portal, then turns and secures it; we see George observing her from the pavement. Mary is very different, with no buoyancy in her stride, none of Mary's abandon and zest for life, wearing spectacles, no make-up, lips pressed, elbows near to torso. She appears flat, desiccated, and exceedingly self-satisfied and competent. George observes her as she glances up, astonished, but not recognizing him, continues on. George and Mary are on the pavement, and Mary begins to flee from him as he pursues frantically. He catches up to her, grabs her by the limbs, and maintains a tight grip on her as she struggles to liberate herself. Mary breaks away from him and rushes into the first portal she comes to, the Blue Moon Tavern, running in and shrieking, while George enters nearly deranged. It is crowded, and the place erupts into an uproar. Some of the men seize and hold on to him, many of whom were present during the rush on the Building and Loan. Mary lets out a final shriek, then collapses into the arms of a couple of women at the tavern. Just as George bursts through the portal, Bert arrives in his patrol car, gets out, and heads for the portal to collide with George as he exits. He seizes for George, who punches him, knocking him down, then continues racing down the avenue yelling for Clarence. Bert gets up, takes out his firearm, and discharges several shots after the escaping figure. Bert gets into the patrol car and, with the siren wailing, sets off in chase of George, heading to the same part of the overpass where George was standing before Clarence leaped in."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The door is opened, and a woman is seen; it is Mrs. Bailey, who has been changed amazingly with a harsh and tired face, and her eyes, once kindly and understanding, now show cold suspicion. No sign is given by her that she knows him, which cruelly blows George. The door is started to be closed by her, but it is stopped by George, and the door is slammed shut in George's face by her. George is left standing a moment, stunned, then he turns and runs out to the sidewalk until his face is filled on the screen, his features distorted by the emotional chaos within him. The scene is walked out of by them. Now, it is just outside a cemetery, with graves where the houses used to be. The cemetery is walked into by the two, with George wandering like a lost soul among the tombstones, and Clarence trotting at his heels. Clarence is grabbed by George by the coat collar, and he is shaken, then Clarence is let go, and George runs off, while Clarence falls to the ground, rubbing his neck. Mary is seen coming out the door, then she turns and locks it; George is watched by her from the sidewalk. Mary is very different, with no buoyancy in her walk, none of Mary's abandon and love of life, wearing glasses, no make-up, lips compressed, elbows close to body. She is looked at by George as she looks up, surprised, but not recognizing him, and she continues on. George and Mary are on the sidewalk, and Mary starts to be run away from by him as he follows desperately. He catches up to her, grabs her by the arms, and keeps a tight grip on her as she struggles to free herself. He is broken away from by Mary and she dashes into the first door she comes to, the Blue Moon Bar, running in and screaming, while George comes in practically insane. It is crowded, and an uproar is caused in the place. Some of the men grab and hold on to him, many of whom were present during the run on the Building and Loan. A final scream is let out by Mary, then she faints into the arms of a couple of women at the bar. Just as the door is broken through by George, Bert arrives in his police car, gets out, and heads for the door to run into George as he comes out. George is grabbed by him, who punches Bert, knocking him down, then continues running down the street yelling for Clarence. Bert gets up, takes out his gun, and fires several shots after the fleeing figure. The police car is gotten into by Bert, and, with the siren screaming, he sets off in pursuit of George, heading to the same part of the bridge where George was standing before Clarence jumped in."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The door opens, revealing Mrs. Bailey with a harsh, tired look and eyes filled with cold suspicion, a stark change from her once kind demeanor. She doesn't acknowledge George, delivering a cruel blow, and slams the door in his face. Stunned, George runs to the sidewalk, his face distorted by inner turmoil. Outside a cemetery where houses once stood, George wanders like a lost soul among the tombstones, with Clarence at his heels. George grabs Clarence by the collar, shakes him, then releases and runs off, leaving Clarence rubbing his neck. Mary emerges, locking the door behind her, exuding none of her former buoyancy or love of life, looking efficient and self-satisfied. She fails to recognize George, and as he follows her on the sidewalk, she runs. Catching up, George grips her arms tightly as she struggles to break free, eventually escaping into the Blue Moon Bar, screaming. Inside, it's crowded; some men who were at the Building and Loan grab George. Mary screams and faints into the arms of women at the bar. Just as George bursts through the door, Bert arrives in his police car. He intercepts George, who punches him down and continues fleeing, yelling for Clarence. Bert fires several shots at George and pursues him in the police car, heading to the bridge where George had stood before Clarence jumped in."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The door opens to reveal Mrs. Bailey, changed with a harsh, tired face and suspicious eyes. She doesn't recognize George, a cruel blow, and slams the door shut. Stunned, George runs out onto the sidewalk, emotional chaos distorting his features. Outside a cemetery, George, lost among the graves, grabs Clarence, shakes him, then runs off. Clarence falls, rubbing his neck. Mary exits a door, looking changed, efficient, and unrecognizable to George, who watches her, surprised. As Mary runs from him, George catches up, gripping her as she struggles free, fleeing into the Blue Moon Bar. Inside, chaos erupts as George follows, practically insane. Mary screams and faints, while men restrain George. Bert arrives, colliding with George, who punches him and runs, yelling for Clarence. Bert fires his gun at the fleeing George, then pursues him with the police car siren blaring, heading to the bridge where George once stood."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The door swings open with an air of inevitability, revealing a woman who enters the scene; it is Mrs. Bailey. Time has wrought a remarkable transformation upon her, leaving her with a harsh, weary face. Her eyes, which once gleamed with kindness and understanding, now reflect a cold, steely suspicion. To George, it is a shock that she gives no indication of recognition, a bitter and cruel blow that cuts deep. As Mrs. Bailey starts to close the door, George intervenes, only for her to forcefully slam the door shut in his face, leaving George standing momentarily stunned. With his thoughts in turmoil, he abruptly turns and runs out to the sidewalk. The camera captures his face in a close-up, his features contorted by the emotional upheaval swirling inside him. They exit the scene together, transitioning to an area just outside a cemetery, where gravestones have taken the place of former homes. George, appearing lost and aimless, meanders through the cemetery, with Clarence faithfully following him at his heels. In a sudden burst of emotion, George leaps up, seizes Clarence by the coat collar, and shakes him vigorously, only to release him and dash away. Clarence tumbles to the ground, rubbing his neck in discomfort. \n\nMary emerges from a doorway, then turns around to ensure it is securely locked. From a distance, George observes her intently from the sidewalk. Mary is a far cry from her former self, lacking the buoyancy and free-spirited love of life she once had. She now wears glasses, applies no makeup, and her lips are tightly pressed together; her posture is rigid, with elbows held close to her body. She appears drained, dried up, yet exudes an air of self-satisfaction and efficiency. As she looks up, she is momentarily surprised but fails to recognize George and continues on her way. George and Mary find themselves on the sidewalk, and Mary suddenly starts to dash away from him, prompting George to pursue her with desperation. He manages to catch up to her, gripping her arms firmly as she fights to break free. Mary wrenches herself free from his grasp and quickly dashes into the nearest establishment, the Blue Moon Bar, where she bursts in, screaming. George follows, nearly deranged with emotion. The bar is crowded, and his entrance sends the place into a chaotic uproar. Several men in the crowd, who were familiar faces from the run on the Building and Loan, seize him, stabilizing the situation. Mary lets out a final, piercing scream before collapsing, fainting into the supportive arms of a couple of women at the bar. Just as George manages to force his way through the door, Bert arrives on the scene in his police car. Exiting the vehicle, he heads straight for the door and collides with George as he emerges. Bert reaches for George, who responds by punching him, sending Bert sprawling to the ground. Unhindered, George continues his frenzied flight down the street, yelling for Clarence. Quickly recovering, Bert gets back on his feet, draws his gun, and fires several shots at the rapidly retreating figure. Bert then jumps into the police car, siren wailing, and speeds off in relentless pursuit of George, heading towards the same section of the bridge where George once stood before Clarence intervened."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The door swings open with an air of inevitability, revealing a woman entering the scene; it is none other than Mrs. Bailey. Time has wrought a remarkable transformation upon her, leaving her with a harsh, weary face etched by life's relentless passage. Her eyes, which once gleamed with genuine warmth and understanding, now reflect a cold, steely suspicion, a far cry from their former kindness. To George, it is an astonishing shock that she gives no indication of recognition, a bitter and cruel blow that cuts deeply into his heart. As Mrs. Bailey starts to close the door, George attempts to intervene, only for her to forcefully, almost angrily, slam the door shut in his face, leaving George standing momentarily stunned and bewildered. With his thoughts in turmoil and emotions in disarray, he abruptly turns, fleeing out to the sidewalk. The camera captures his face in a revealing close-up, his features contorted by the emotional upheaval swirling inside him. They exit the scene together, transitioning to an area just outside a somber cemetery, where gravestones have taken the place of what were once homes. George, appearing utterly lost and aimless, meanders through the cemetery, with Clarence faithfully following him closely at his heels. In a sudden and intense burst of emotion, George leaps up, seizes Clarence by the coat collar, and shakes him vigorously, only to release him abruptly and dash away once more. Clarence tumbles to the ground, rubbing his neck in discomfort from the unexpected jolt.\n\nMary emerges from a doorway, and then turns around to ensure it is securely locked behind her. From a distance, George observes her intently from the sidewalk, his gaze fixed on her every move. Mary is a far cry from her former self, lacking the buoyancy and free-spirited love of life that once defined her. She now wears glasses, applies no makeup to her once-vibrant face, and her lips are tightly pressed together; her posture is rigid, with elbows held close to her body, as if warding off an unseen chill. She appears drained, dried up, yet exudes an air of self-satisfaction and efficiency, like someone who has made peace with her solitary existence. As she looks up, she is momentarily surprised but fails to recognize George and continues on her way, her mind seemingly elsewhere. George and Mary find themselves on the sidewalk, and Mary suddenly starts to dash away from him, prompting George to pursue her with desperate urgency. He manages to catch up to her, gripping her arms firmly as she fights to break free from his grasp. Mary wrenches herself free from his hold and quickly dashes into the nearest establishment, the Blue Moon Bar, where she bursts in, screaming in panic. George follows, nearly deranged with overpowering emotion. The bar is crowded, and his entrance sends the place into a chaotic uproar. Several men in the crowd, who were familiar faces from the run on the Building and Loan, seize him, stabilizing the precarious situation. Mary lets out a final, piercing scream before collapsing, fainting into the supportive arms of a couple of women at the bar, who rush to her aid. Just as George manages to force his way through the door, Bert arrives on the scene in his police car. Exiting the vehicle with authority, he heads straight for the door and collides with George as he emerges. Bert reaches for George, who responds by punching him, sending Bert sprawling to the ground in a stunned heap. Unhindered, George continues his frenzied flight down the street, yelling desperately for Clarence. Quickly recovering, Bert gets back on his feet, draws his gun, and fires several shots at the rapidly retreating figure. Bert then jumps into the police car, siren wailing loudly, and speeds off in relentless pursuit of George, heading towards the same section of the bridge where George once stood before Clarence's life-changing intervention."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the door swings open, a woman steps into view—it's Mrs. Bailey, who now bears a drastically changed appearance, her face etched with harshness and fatigue, and her eyes, once warm and empathetic, now radiate a chilling suspicion. She stares at George with an expression devoid of recognition, dealing him a cruel emotional blow. Without uttering a word, she begins to close the door, prompting George to intervene, but she forcefully slams it shut in his face. George remains momentarily frozen, his mind reeling from the shock, before he swiftly turns, his footsteps quickening as he bursts onto the sidewalk, his face consumed by emotional turmoil as it fills the screen, his features contorted by the storm within. As they exit the scene, the setting shifts to the vicinity of a cemetery, where tombstones now stand in place of houses. George meanders aimlessly through the graves like a lost soul, with Clarence following closely at his heels. Suddenly, George leaps forward, seizing Clarence by the coat collar and shaking him vigorously before releasing his grip and dashing away, leaving Clarence to collapse to the ground, massaging his neck in discomfort. Meanwhile, Mary emerges from the house, pauses momentarily to secure the lock, and George, standing on the sidewalk, observes her intently. This version of Mary is markedly different, lacking the buoyancy and zest for life she once possessed; now she dons glasses and no makeup, her lips pressed tightly together, her elbows tucked close to her body, projecting an air of flatness, detachment, and sterile efficiency. As George watches, Mary lifts her gaze, momentarily surprised, yet fails to recognize him and continues on her way. With George and Mary both on the sidewalk, Mary abruptly begins to run from him, compelling George to pursue her with a desperate urgency. He manages to catch up, grasping her arms firmly as she wriggles tirelessly in an attempt to break free. In a sudden flurry of movement, Mary escapes his hold and bolts into the first door she encounters, the entrance to the Blue Moon Bar, running inside in a panic and screaming for help, while George follows, nearly beside himself with frenzy. Inside, the bar, bustling with activity, erupts into chaos. Some of the men present, who recall George from the commotion during the Building and Loan run, seize and restrain him. Amidst the commotion, Mary emits a piercing scream before collapsing into the arms of several women gathered at the bar. Just as George bursts through the door, Bert arrives in his police car, exits the vehicle, and hastens towards the door, colliding with George as he makes his exit. Bert reaches for George, but George retaliates with a punch, sending Bert sprawling to the ground before he resumes his desperate flight down the street, calling out frantically for Clarence. In the aftermath, Bert scrambles to his feet, draws his firearm, and discharges several shots at George's retreating figure. Then, Bert re-enters the police car, activates the siren, and embarks on a pursuit of George, speeding towards the same bridge where George had previously stood before Clarence's unexpected plunge into the water."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The door opens to reveal Mrs. Bailey, now harsh and weary, her eyes cold and suspicious, showing no sign of recognition toward George, which painfully shocks him. As she moves to close the door, George prevents it momentarily, but she forcefully shuts it in his face. Stunned, George runs to the sidewalk, his face contorted by emotional turmoil. Transitioning outside a cemetery, George, lost and aimless, wanders among the tombstones with Clarence following closely. In frustration, George grabs and shakes Clarence before letting him go and running off, leaving Clarence on the ground nursing his neck. \n\nMary appears, locking her door. George watches her from a distance, noting her stark change—no longer lively or carefree, she seems efficient and self-satisfied. Mary looks up, surprised but not recognizing him, and continues on. As George approaches, Mary, startled, runs, but George catches her, holding tightly despite her attempts to break free. She finally escapes his grasp and rushes into the Blue Moon Bar, screaming, as George, in a frantic state, follows. The bar erupts in chaos, and several men, familiar from the Building and Loan episode, restrain George. Mary faints into the arms of women at the bar. \n\nAs George struggles free, Bert arrives in his police car and intercepts him. George punches Bert, knocking him down, and continues his desperate escape, calling for Clarence. Bert, recovering, draws his gun and fires at the fleeing George. He then jumps into his car, siren wailing, in pursuit toward the bridge where George previously stood before Clarence intervened."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The door opens and a woman appears; it is Mrs. Bailey, a character who once embodied warmth in this close-knit community in Bedford Falls, who has changed amazingly with a harsh and tired face, and her eyes, once kindly and understanding, now show cold suspicion. She gives no sign that she knows him, which is a cruel blow to George, whose life has suddenly become unrecognizable in this alternate reality. She starts to close the door, but George stops her, and she slams the door shut in George's face with a finality reminiscent of the town's declining fortunes without his influence. George stands a moment, stunned by the eerie transformation of his surroundings, then turns and runs out to the sidewalk, until his face fills the screen, his features distorted by the emotional chaos within him. They walk out of scene. Now it is just outside a cemetery, which has replaced the thriving neighborhood that once symbolized hope and community, with graves where the houses used to be. The two walk into the cemetery, with George wandering like a lost soul among the tombstones, and Clarence, his guardian angel in human form, trotting at his heels. George jumps up, grabs Clarence by the coat collar, and shakes him, then lets Clarence go and runs off, while Clarence falls to the ground, rubbing his neck in frustration and concern for George's fate. Mary comes out the door, then turns and locks it; we see George watching her from the sidewalk, distinguishing her as someone who once brought joy to his life. Mary is very different, with no buoyancy in her walk, none of Mary's abandon and love of life, wearing glasses, no make-up, lips compressed, elbows close to body. She looks flat, dried up, and extremely self-satisfied and efficient, a stark contrast to her previous vivacious self. George watches her as she looks up, surprised, but not recognizing him due to this altered timeline, continues on. George and Mary are on the sidewalk, and Mary starts to run away from him as he follows desperately. He catches up to her, grabs her by the arms, and keeps a tight grip on her as she struggles to free herself. Mary breaks away from him and dashes into the first door she comes to, the Blue Moon Bar, a place now known for its gloom rather than community celebrations, running in and screaming, while George comes in practically insane. It is crowded, and the place goes into an uproar. Some of the men grab and hold onto him, many of whom were present during the run on the Building and Loan, a pivotal moment in the town’s history. Mary lets out a final scream, then faints into the arms of a couple of women at the bar, distressed by the chaotic scene. Just as George breaks through the door, Bert arrives in his police car, a model from the late 1940s, gets out, and heads for the door to run into George as he comes out. He grabs for George, who punches him, knocking him down, then continues running down the street yelling for Clarence, whose purpose is to save him from despair. Bert gets up, takes out his gun, and fires several shots after the fleeing figure. Bert gets into the police car and, with the siren screaming, sets off in pursuit of George, heading to the same part of the bridge where George was standing before Clarence jumped in, a spot marked by crisis and revelations."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The door opens and a woman appears. it is Mrs Bailey who has changed amazingly with a harsh and tired face and her eyes once kindly and understanding now show cold suspicion. She gives no sign that she knows him which is a cruel blow to George. She starts to close the door but George stops her and she slams the door shut in George's face. George stands a moment stunned then turns and runs out to the sidewalk until his face fills the screen his features distorted by the emotional chaos within him. They walk out of scene. Now it is just outside a cemetery with graves where the houses used to be. The two walk into the cemetery with George wandering like a lost soul among the tombstones and Clarence trotting at his heels. George jumps up grabs Clarence by the coat collar and shakes him. then let us. Clarence go and runs off while Clarence falls to the ground rubbing his neck. Mary comes out the door then turns and locks it. we see George watching her from the sidewalk. Mary is very different with no buoyancy in her walk none of Mary's abandon and love of life. wearing glasses no makeup lips compressed elbows close to body. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. She looks flat dried up and extremely selfsatisfied and efficient. George watches her as she looks up surprised but not recognizing him. continues on. George and Mary are on the sidewalk and Mary starts to run away from him as he follows desperately. He catches up to her grabs her by the arms and keeps a tight grip on her as she struggles to free herself. Mary breaks away from him and dashes into the first door. she comes to the Blue Moon Bar running in and screaming while George comes in practically insane. It is crowded and the place goes into an uproar. Some of the men grab and hold on to him many of whom were present during the run on the Building and Loan. Mary let us out a final scream then faints into the arms of a couple of women at the bar. Just as George breaks through the door Bert arrives in his police car gets out and heads for the door to run into George as he comes out. He grabs for George who punches him knocking him down then continues running down the street yelling for Clarence. Bert gets up takes out his gun and fires several shots after the fleeing figure. Bert gets into the police car and with the siren screaming sets off in pursuit of George heading to the same part of the bridge where George was standing before. Clarence jumped in."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The door opens and a woman appears. it is Mrs Bailey who has changed amazingly with a harsh and tired face and her eyes once kindly and understanding now show cold suspicion. She gives no sign that she knows him which is a cruel blow to George. She starts to close the door but George stops her and she slams the door shut in George's face. George stands a moment stunned then turns and runs out to the sidewalk until his face fills the screen his features distorted by the emotional chaos within him. They walk out of scene. Now it is just outside a cemetery with graves where the houses used to be. The two walk into the cemetery with George wandering like a lost soul among the tombstones and Clarence trotting at his heels. George jumps up grabs Clarence by the coat collar and shakes him. then let us. Clarence go and runs off while Clarence falls to the ground rubbing his neck. Mary comes out the door then turns and locks it. we see George watching her from the sidewalk. Mary is very different with no buoyancy in her walk none of Mary's abandon and love of life. wearing glasses no makeup lips compressed elbows close to body. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. She looks flat dried up and extremely selfsatisfied and efficient. George watches her as she looks up surprised but not recognizing him. continues on. George and Mary are on the sidewalk and Mary starts to run away from him as he follows desperately. He catches up to her grabs her by the arms and keeps a tight grip on her as she struggles to free herself. Mary breaks away from him and dashes into the first door. she comes to the Blue Moon Bar running in and screaming while George comes in practically insane. It is crowded and the place goes into an uproar. Some of the men grab and hold on to him many of whom were present during the run on the Building and Loan. Mary let us out a final scream then faints into the arms of a couple of women at the bar. Just as George breaks through the door Bert arrives in his police car gets out and heads for the door to run into George as he comes out. He grabs for George who punches him knocking him down then continues running down the street yelling for Clarence. Bert gets up takes out his gun and fires several shots after the fleeing figure. Bert gets into the police car and with the siren screaming sets off in pursuit of George heading to the same part of the bridge where George was standing before. Clarence jumped in."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The door opens and a woman appears. it is Mrs Bailey who has changed amazingly with a harsh and tired face and her eyes once kindly and understanding now show cold suspicion. She gives no sign that she knows him which is a cruel blow to George. She starts to close the door but George stops her and she slams the door shut in George's face. George stands a moment stunned then turns and runs out to the sidewalk until his face fills the screen his features distorted by the emotional chaos within him. They walk out of scene. Now it is just outside a cemetery with graves where the houses used to be. The two walk into the cemetery with George wandering like a lost soul among the tombstones and Clarence trotting at his heels. Some of the men grab and hold on to him many of whom were present during the run on the Building and Loan. Mary let us out a final scream then faints into the arms of a couple of women at the bar. Just as George breaks through the door Bert arrives in his police car gets out and heads for the door to run into George as he comes out. He grabs for George who punches him knocking him down then continues running down the street yelling for Clarence. Bert gets up takes out his gun and fires several shots after the fleeing figure. Bert gets into the police car and with the siren screaming sets off in pursuit of George heading to the same part of the bridge where George was standing before. Clarence jumped in."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The door opens and a woman appears. it is Mrs Bailey who has changed amazingly with a harsh and tired face and her eyes once kindly and understanding now show cold suspicion. She gives no sign that she knows him which is a cruel blow to George. Bert gets up takes out his gun and fires several shots after the fleeing figure. Bert gets into the police car and with the siren screaming sets off in pursuit of George heading to the same part of the bridge where George was standing before. Clarence jumped in."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The window slides open and a penguin materializes; it is Captain Frost, who has transformed remarkably with a bright and cheerful face, and his flippers, once stern and demanding, now convey warm curiosity. He gives no hint that he recognizes the rabbit, which is a joyous surprise to Leonard. He starts to slam the window, but Leonard halts him, and he tosses the window open in Leonard's direction. Leonard stands a moment, amazed, then spins and tiptoes out to the park bench, until his face covers the camera, his expression illuminated by the internal tranquility within him. They glide out of frame. Now it is just inside a library, with bookshelves where the trees used to be. The pair stride into the library, with Leonard meandering like a joyful spirit among the novels, and Bernard prancing at his side. Leonard crouches down, pulls Bernard by the scarf hem, and hugs him, then releases Bernard and skips off, while Bernard lands on the carpet, patting his hat. Fiona waltzes out the window, then spins and opens it; we see Leonard observing her from the park bench. Fiona is quite similar, with plenty of bounce in her step, abundant with Fiona's carefree and zest for adventure, wearing contacts, plenty of decoration, lips parted, arms flung wide. She appears vibrant, energized, and supremely relaxed and friendly. Leonard observes her as she glances around, astonished, but not identifying him, carries on. Leonard and Fiona are on the park bench, and Fiona starts to dance toward him as he follows eagerly. He meets up with her, clasps her by the shoulders, and maintains a gentle embrace as she attempts to embrace him. Fiona pulls toward him and waltzes through the last window she reaches, the Golden Sun Cafe, strolling out and humming, while Leonard floats out practically mesmerized. It is vacant, and the cafe transitions into serenity. A few of the women release and let go of her, many of whom were absent during the celebration on the Tower and Hill. Fiona lets in a final laugh, then sways into the arms of a pair of gentlemen at the cafe. Just as Leonard glides through the window, Victor arrives in his delivery van, gets out, and tiptoes to the window to float into Leonard as he strolls in. He reaches for Leonard, who hugs him, lifting him up, then proceeds strolling down the path whispering for Bernard. Victor stands up, stashes his whistle, and sounds several tunes after the rushing silhouette. Victor enters the delivery van and, with the radio blasting, sets off in pursuit of Leonard, heading to the opposite side of the riverbank where Leonard was lying before Bernard floated in."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The door opens to reveal Mrs. Bailey, now harsh and tired, with cold suspicion in her eyes. She shows no sign of recognizing George, who is stunned as she slams the door in his face. George, overwhelmed, runs to the sidewalk. He and Clarence find themselves outside a cemetery, where George wanders among the tombstones before confronting Clarence and running off. George then watches Mary, who is now lifeless and efficient, and as he desperately follows her, she tries to flee. He catches her briefly, but she escapes into the Blue Moon Bar, screaming. Inside, the place erupts as George, nearly insane, is seized by men who remember him. Mary faints, and as George breaks through the door, he encounters Bert, the policeman. George punches Bert and runs off, with Bert in pursuit, firing shots as he chases George back to the bridge where Clarence had jumped."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Clarence jumped in Bert gets into the police car and with the siren screaming sets off in pursuit of George heading to the same part of the bridge where George was standing before Bert gets up takes out his gun and fires several shots after the fleeing figure He grabs for George who punches him knocking him down then continues running down the street yelling for Clarence Just as George breaks through the door Bert arrives in his police car gets out and heads for the door to run into George as he comes out Mary let us out a final scream then faints into the arms of a couple of women at the bar Some of the men grab and hold on to him many of whom were present during the run on the Building and Loan It is crowded and the place goes into an uproar she comes to the Blue Moon Bar running in and screaming while George comes in practically insane Mary breaks away from him and dashes into the first door He catches up to her grabs her by the arms and keeps a tight grip on her as she struggles to free herself George and Mary are on the sidewalk and Mary starts to run away from him as he follows desperately continues on George watches her as she looks up surprised but not recognizing him She looks flat dried up and extremely selfsatisfied and efficient wearing glasses no makeup lips compressed elbows close to body Mary is very different with no buoyancy in her walk none of Mary's abandon and love of life we see George watching her from the sidewalk Mary comes out the door then turns and locks it Clarence go and runs off while Clarence falls to the ground rubbing his neck then let us George jumps up grabs Clarence by the coat collar and shakes him The two walk into the cemetery with George wandering like a lost soul among the tombstones and Clarence trotting at his heels Now it is just outside a cemetery with graves where the houses used to be They walk out of scene George stands a moment stunned then turns and runs out to the sidewalk until his face fills the screen his features distorted by the emotional chaos within him She starts to close the door but George stops her and she slams the door shut in George's face She gives no sign that she knows him which is a cruel blow to George it is Mrs Bailey who has changed amazingly with a harsh and tired face and her eyes once kindly and understanding now show cold suspicion The door opens and a woman appears"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "it is Mrs Bailey who has changed amazingly with a harsh and tired face and her eyes once kindly and understanding now show cold suspicion The door opens and a woman appears She starts to close the door but George stops her and she slams the door shut in George's face She gives no sign that she knows him which is a cruel blow to George They walk out of scene George stands a moment stunned then turns and runs out to the sidewalk until his face fills the screen his features distorted by the emotional chaos within him The two walk into the cemetery with George wandering like a lost soul among the tombstones and Clarence trotting at his heels Now it is just outside a cemetery with graves where the houses used to be then let us George jumps up grabs Clarence by the coat collar and shakes him Mary comes out the door then turns and locks it Clarence go and runs off while Clarence falls to the ground rubbing his neck Mary is very different with no buoyancy in her walk none of Mary's abandon and love of life we see George watching her from the sidewalk She looks flat dried up and extremely selfsatisfied and efficient wearing glasses no makeup lips compressed elbows close to body continues on George watches her as she looks up surprised but not recognizing him He catches up to her grabs her by the arms and keeps a tight grip on her as she struggles to free herself George and Mary are on the sidewalk and Mary starts to run away from him as he follows desperately she comes to the Blue Moon Bar running in and screaming while George comes in practically insane Mary breaks away from him and dashes into the first door Some of the men grab and hold on to him many of whom were present during the run on the Building and Loan It is crowded and the place goes into an uproar Just as George breaks through the door Bert arrives in his police car gets out and heads for the door to run into George as he comes out Mary let us out a final scream then faints into the arms of a couple of women at the bar Bert gets up takes out his gun and fires several shots after the fleeing figure He grabs for George who punches him knocking him down then continues running down the street yelling for Clarence Clarence jumped in Bert gets into the police car and with the siren screaming sets off in pursuit of George heading to the same part of the bridge where George was standing before"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She looks flat dried up and extremely selfsatisfied and efficient George watches her as she looks up surprised but not recognizing him continues on George and Mary are on the sidewalk and Mary starts to run away from him as he follows desperately He catches up to her grabs her by the arms and keeps a tight grip on her as she struggles to free herself Mary breaks away from him and dashes into the first door she comes to the Blue Moon Bar running in and screaming while George comes in practically insane It is crowded and the place goes into an uproar Some of the men grab and hold on to him many of whom were present during the run on the Building and Loan Mary let us out a final scream then faints into the arms of a couple of women at the bar Just as George breaks through the door Bert arrives in his police car gets out and heads for the door to run into George as he comes out He grabs for George who punches him knocking him down then continues running down the street yelling for Clarence Bert gets up takes out his gun and fires several shots after the fleeing figure Bert gets into the police car and with the siren screaming sets off in pursuit of George heading to the same part of the bridge where George was standing before Clarence jumped in The door opens and a woman appears it is Mrs Bailey who has changed amazingly with a harsh and tired face and her eyes once kindly and understanding now show cold suspicion She gives no sign that she knows him which is a cruel blow to George She starts to close the door but George stops her and she slams the door shut in George's face George stands a moment stunned then turns and runs out to the sidewalk until his face fills the screen his features distorted by the emotional chaos within him They walk out of scene Now it is just outside a cemetery with graves where the houses used to be The two walk into the cemetery with George wandering like a lost soul among the tombstones and Clarence trotting at his heels George jumps up grabs Clarence by the coat collar and shakes him then let us Clarence go and runs off while Clarence falls to the ground rubbing his neck Mary comes out the door then turns and locks it we see George watching her from the sidewalk Mary is very different with no buoyancy in her walk none of Mary's abandon and love of life wearing glasses no makeup lips compressed elbows close to body"
        }
      ]
    }
  ]
}