{
  "ground_truth": "He is a very good-humored man of about fifty, in shirt-sleeves. During the foregoing, Cousin Tilly has answered the telephone, and now she calls out. Uncle Billy looks at his hand. CLOSEUP UNCLE BILLY'S LEFT HAND reveals pieces of string tied around two of the fingers, obviously to remind him of things he has to do. He opens the door of his father's office and enters. George's father is seated behind his desk, nervously drawing swirls on a pad. He is a gentle man in his forties, an idealist, stubborn only for other people's rights. Nearby, in a throne-like wheelchair, behind which stands the goon who furnishes the motive power, sits Henry F. Potter, his squarish derby hat on his head. He looks tired and worried. The goon pushes his wheelchair closer to the desk. The following dialogue is fast and heated, as though the argument had been in process for some time. George stands irresolute a moment, aware of a crisis in the affairs of the Bailey Building and Loan Association, but more keenly aware of his personal crisis. George cannot listen any longer to such libel about his father. He comes around in front of the desk. He pushes George toward the door. As George passes Potter's wheelchair, he pushes the old man's shoulder. The goon puts out a restraining hand. George proceeds toward the door, with his father's hand on his shoulder. George and his father are at the door. Bailey closes the door on George and turns back to Potter. George stands outside the door with the capsules in his hand. Gower is talking on the telephone. George stands in the doorway. Gower hangs up the phone and turns to George. He grabs George by the shirt and drags him into the back room. Gower starts hitting George about the head with his open hands. Mary is still seated at the soda fountain. Each time she hears George being slapped, she winces. George tries to protect himself as best he can. George falters off, cupping his aching ear with a hand. Gower looks at the large brown bottle which has not been replaced on the shelf. George pulls the little box out of his pocket. Gower savagely rips it away from him, breathing heavily, staring at the boy venomously. He tears open the package, shakes the powder out of one of the capsules, cautiously tastes it, then abruptly throws the whole mess to the table and turns to look at George again. The boy is whimpering, hurt, frightened. Gower steps toward him. But this time Gower sweeps the boy to him in a hug and, sobbing hoarsely, crushes the boy in his embrace. George is crying too. Across the counter stands Joe Hepner, the proprietor of the store, showing a suitcase.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He exists as a very amiable male of approximately fifty, in shirt-sleeves. During the earlier, Cousin Tilly has responded to the telephone, and now she shouts. Uncle Billy observes his hand. CLOSEUP UNCLE BILLY'S LEFT HAND discloses pieces of twine fastened around two of the digits, evidently to remind him of tasks he needs to complete. He opens the entrance of his father's office and steps inside. George's father is positioned behind his desk, nervously sketching spirals on a notepad. He is a gentle male in his forties, an idealist, obstinate only for other individuals' entitlements. Nearby, in a throne-resembling wheelchair, behind which stands the goon who supplies the motive force, sits Henry F. Potter, his angular bowler hat on his cranium. He appears fatigued and anxious. The goon propels his wheelchair nearer to the desk. The ensuing dialogue is rapid and passionate, as though the dispute had been ongoing for some time. George stands uncertain a moment, conscious of a crisis in the affairs of the Bailey Building and Loan Association, but more acutely conscious of his personal crisis. George cannot endure any longer such defamation about his father. He moves around to the front of the desk. He urges George toward the entrance. As George passes Potter's wheelchair, he shoves the elderly man's shoulder. The goon extends a restraining hand. George advances toward the entrance, with his father's hand on his shoulder. George and his father are at the entrance. Bailey shuts the door on George and turns back to Potter. George stands outside the entrance with the capsules in his hand. Gower is speaking on the telephone. George stands in the doorway. Gower replaces the phone and turns to George. He seizes George by the shirt and pulls him into the rear room. Gower begins striking George about the head with his open hands. Mary is still seated at the soda counter. Each time she hears George being slapped, she recoils. George attempts to defend himself as best he can. George stumbles off, cradling his throbbing ear with a hand. Gower gazes at the large brown bottle which has not been returned on the shelf. George extracts the little box out of his pocket. Gower fiercely snatches it away from him, breathing heavily, glaring at the boy malevolently. He rips open the package, empties the powder out of one of the capsules, cautiously tastes it, then abruptly throws the entire mess onto the table and turns to gaze at George again. The boy is whimpering, hurt, terrified. Gower advances toward him. But this time Gower sweeps the boy to him in a hug and, sobbing harshly, crushes the boy in his embrace. George is weeping too. Across the counter stands Joe Hepner, the proprietor of the store, presenting a suitcase."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He is a very good-humored man of about fifty, in shirt-sleeves. During the foregoing, the telephone has been answered by Cousin Tilly, and now she calls out. Uncle Billy looks at his hand. CLOSEUP UNCLE BILLY'S LEFT HAND reveals pieces of string tied around two of the fingers, obviously to remind him of things he has to do. The door of his father's office is opened by him, and he enters. George's father sits behind his desk, nervously drawing swirls on a pad. He is a gentle man in his forties, an idealist, stubborn only for other people's rights. Nearby, in a throne-like wheelchair, behind which the goon who furnishes the motive power stands, Henry F. Potter is seated, his squarish derby hat on his head. He looks tired and worried. His wheelchair is pushed closer to the desk by the goon. The following dialogue is fast and heated, as though the argument had been in process for some time. George stands irresolute a moment, aware of a crisis in the affairs of the Bailey Building and Loan Association, but more keenly aware of his personal crisis. Such libel about his father cannot be listened to any longer by George. He comes around in front of the desk. George is pushed toward the door by him. As Potter's wheelchair is passed by George, the old man's shoulder is pushed by him. A restraining hand is put out by the goon. George proceeds toward the door, with his father's hand on his shoulder. At the door are George and his father. The door is closed on George by Bailey, and he turns back to Potter. Outside the door, George stands with the capsules in his hand. Gower is talking on the telephone. In the doorway stands George. Gower hangs up the phone and turns to George. George is grabbed by the shirt by him and dragged into the back room. George is hit about the head with his open hands by Gower. Mary is still seated at the soda fountain. Each time George is heard being slapped by her, she winces. George tries to protect himself as best he can. Faltering off, George cups his aching ear with a hand. The large brown bottle which has not been replaced on the shelf is looked at by Gower. The little box is pulled out of his pocket by George. It is savagely ripped away from him by Gower, who breathes heavily, staring at the boy venomously. The package is torn open by him, and the powder is shaken out of one of the capsules, cautiously tasted by him, then he abruptly throws the whole mess to the table and turns to look at George again. The boy is whimpering, hurt, frightened. Gower steps toward him. But this time the boy is swept to him in a hug by Gower, and, sobbing hoarsely, he crushes the boy in his embrace. George is crying too. Across the counter stands Joe Hepner, the proprietor of the store, showing a suitcase."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He is a cheerful man around fifty in shirt-sleeves. Meanwhile, Cousin Tilly answers the phone and calls out. Uncle Billy looks at his hand, where strings tied around two fingers remind him of tasks. He enters his father's office, where George's father is nervously drawing on a pad. George's father is gentle, idealistic, and firm about others' rights. Nearby, in a wheelchair, sits Henry F. Potter, with his derby hat on, looking tired. The goon pushes him closer to the desk as a fast, heated argument continues. George, aware of a crisis at Bailey Building and Loan Association, is more focused on his personal crisis and can’t bear further libel about his father. George moves toward the door, with his father's hand guiding him. At the door, Bailey closes it on George and returns to Potter. George stands outside with capsules. Gower, on the phone, finishes and brings George into the back room, hitting him. Mary, at the soda fountain, winces at each slap. George, trying to protect himself, falters off, cupping his ear. Gower sees the large bottle not replaced on the shelf, takes the box from George, and rips it open, tasting the powder inside before throwing it on the table. The frightened George whimpers. Gower steps forward but then embraces the boy, both sobbing. Across the counter, Joe Hepner, the store proprietor, holds a suitcase."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He is a good-humored man, around fifty, in shirt-sleeves. Cousin Tilly answers the phone. Uncle Billy's closeup reveals string-tied fingers for reminders. He enters his father's office, where George's father, an idealist in his forties, nervously draws swirls. Nearby, Henry F. Potter, tired and worried, sits in a wheelchair, wearing a derby hat. The goon pushes Potter closer to the desk for a fast, heated dialogue about the Bailey Building and Loan crisis. George, aware of a personal crisis, pushes Potter's shoulder as he exits with his father, who closes the door behind him. Outside, George holds capsules. Gower, on the phone, then drags George to the back room, hitting him. Mary winces at the soda fountain. Gower sees the big bottle unshelved. George offers a little box, which Gower tears from him, tastes the powder, and throws it away. The boy, hurt and frightened, whimpers. Gower, now remorseful, hugs and cries with George. Joe Hepner, the store proprietor, stands by with a suitcase."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He is a man in his early fifties, characterized by a cheerful and good-humored disposition, who wears just his shirt without a jacket. Meanwhile, Cousin Tilly, having answered the telephone moments earlier, calls out to everyone in the vicinity. Uncle Billy takes a moment to scrutinize his hand. In a CLOSE-UP view of UNCLE BILLY'S LEFT HAND, we can plainly see pieces of string tied intricately around two of his fingers, each string serving as a vital reminder of tasks he must complete. With a decisive motion, he opens the door to his father's office and walks in. George's father is situated behind his desk, nervously doodling swirls on a pad of paper. He is depicted as a gentle man in his forties, holding strong idealistic values, with a tendency to only be stubborn when it concerns the rights of others. Close by, seated majestically in a throne-like wheelchair, is Henry F. Potter, with his goon standing behind, providing the necessary strength to move the wheelchair. Potter, his squarish derby hat perched firmly on his head, appears visibly tired and worried. The goon gives a push to bring the wheelchair closer to the desk. The dialogue that follows is rapid and heated, as if the argument had been ongoing for quite some time. George stands momentarily undecided, acutely aware of the crisis facing the Bailey Building and Loan Association, yet even more intensely aware of his own personal turmoil. Unable to endure any more slander against his father, George steps decisively around to the front of the desk, pushing George toward the door. As George makes his way past Potter's wheelchair, he gives the old man's shoulder a gentle shove. The goon instinctively reaches out a restraining hand. George proceeds to the door with his father's supportive hand resting on his shoulder. Father and son reach the door, and with a firm gesture, Bailey closes it on George, then turns back toward Potter. George finds himself outside the door, holding the capsules in his hand. Gower, meanwhile, is engaged in a conversation on the telephone. George stands in the doorway, observing. Once Gower hangs up the phone, he turns a stern gaze toward George. In a sudden move, he grabs George by the shirt and pulls him into the back room. Gower proceeds to strike George about the head with his open hands. Over at the soda fountain, Mary remains seated, flinching visibly each time she hears the smacks landing on George. Struggling to protect himself as best as he can, George eventually stumbles away, cupping his sore ear with his hand. Gower then directs his attention to the large brown bottle that has yet to be put back on the shelf. George retrieves a small box from his pocket. With a fierce motion, Gower tears it away from him, breathing heavily and staring at the boy with a venomous glare. He tears open the package, empties the powder from one of the capsules, cautiously tastes it, then suddenly tosses the whole mess onto the table, turning once more to face George. The boy is left whimpering, hurt, and terrified. Gower makes a move toward him, but this time, instead of anger, Gower sweeps the boy into a heartfelt embrace, sobbing hoarsely and holding him tightly. George, too, is in tears. Across the counter, Joe Hepner, the store's proprietor, stands with a suitcase in hand."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He is a man appearing to be in his early fifties, distinguished by a notably cheerful and consistently good-humored disposition. He is dressed casually, wearing only his shirt without a jacket, which adds to his approachable aura. Meanwhile, Cousin Tilly, who had picked up the telephone just a few moments earlier, calls out loudly to everyone within earshot. At the same time, Uncle Billy takes a brief pause to carefully scrutinize his hand. In a CLOSE-UP shot of UNCLE BILLY’S LEFT HAND, we can clearly observe several pieces of string intricately tied around two of his fingers. Each of these strings plays a crucial role as a reminder of the important tasks he must remember to complete. With a firm and decisive motion, he opens the door that leads to his father’s office and walks inside.\n\nGeorge’s father is positioned behind his desk, nervously doodling random swirls on a pad of paper. He is portrayed as a gentle and kind-hearted man in his forties, who holds firmly to idealistic values and only becomes stubborn when it concerns the rights and well-being of others. Nearby, seated regally in a throne-like wheelchair, is Henry F. Potter, with his goon standing dutifully behind him, providing the necessary strength to maneuver the wheelchair. Potter, with his squarish derby hat securely perched on his head, looks visibly tired and deeply worried. The goon reaches out to give a push, bringing the wheelchair closer to the desk's edge. The ensuing dialogue is rapid and heated, suggesting that the argument has been ongoing for quite some time. George stands momentarily, caught in indecision, fully aware of the crisis looming over the Bailey Building and Loan Association, yet feeling even more intensely the weight of his own personal turmoil. Unable to withstand any more slanderous comments against his father, George steps decisively around to the front of the desk, pushing George toward the door. As he makes his way past Potter’s wheelchair, he gives the old man’s shoulder a gentle shove. The goon instinctively reaches out with a restraining hand. George continues toward the door, with his father’s supportive hand placed reassuringly on his shoulder. Father and son arrive at the door, and with a firm gesture, Bailey closes it on George, then turns back toward Potter. George finds himself outside the door, holding capsules tightly in his hand. Meanwhile, Gower is engaged in a conversation on the telephone. George stands at the doorway, observing intently. As soon as Gower finishes the call and hangs up the phone, he turns a stern gaze toward George. \n\nIn a sudden and unexpected move, he grabs George by the shirt and pulls him into the adjacent back room. Gower proceeds to strike George around the head with his open hands. Over at the soda fountain area, Mary remains seated, visibly flinching each time she hears the sound of a smack landing on George. Struggling to shield himself as best as he can, George eventually stumbles away, cradling his sore ear with his hand. Gower then shifts his attention to the large brown bottle that has yet to be put back in its place on the shelf. George retrieves a small box from his pocket cautiously. With a fierce motion, Gower snatches it away from him, breathing heavily and staring at the boy with a venomous glare. He tears open the package, empties the powder from one of the capsules, cautiously tastes it, then suddenly tosses the entire mess onto the table in frustration, turning once more to face George. The boy is left whimpering, clearly hurt, and terrified. Gower makes a move toward him, but this time, instead of lashing out in anger, Gower sweeps the boy into a heartfelt embrace, sobbing hoarsely and holding him tightly as if never wanting to let go. George, too, is deeply moved and in tears. Across the counter, Joe Hepner, the store's proprietor, stands observing the scene with a suitcase firmly in his hand."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He is a very good-humored man of about fifty, easily recognizable in his shirt-sleeves, moving with a casual demeanor. During these events, Cousin Tilly, responding promptly to the telephone's ring, picks up and answers the call with focused attention. Interrupting her task, she raises her voice to call out, catching Uncle Billy's attention. Uncle Billy, momentarily distracted, glances down at his left hand, noticing the pieces of string tied around two of his fingers, which serve as reminders of tasks he has yet to complete. Resolutely, he approaches the door of his father's office, giving it a gentle push to open it and steps inside. Within the office, George's father is seated behind his desk, his hand nervously at work, moving a pen to draw swirls on a pad, a habit that hints at his gentle, idealistic nature, one who stands stubbornly for the rights of others. Opposite him, in a throne-like wheelchair, is Henry F. Potter, with a squarish derby hat settled firmly on his head. His expression, marked by fatigue and worry, deepens as the goon standing behind him, responsible for the motion of the wheelchair, pushes him closer to the desk, underlining the urgency of the situation. The dialogue that ensues is fast and heated, with the intensity of an argument that has clearly been underway for some time. Amidst this charged atmosphere, George stands momentarily irresolute, the weight of a crisis affecting the Bailey Building and Loan Association evident, yet overshadowed by the pressing concern of his personal crisis. Unable to bear further slander against his father, George decisively moves forward, stepping around in front of the desk, and with a firm gesture, pushes George toward the door. As George passes by Potter's wheelchair, a swift motion sees him forcefully push the old man's shoulder, an action that prompts the goon to extend a hand to restrain. Undeterred, George continues toward the door, feeling the reassuring presence of his father's hand on his shoulder as they reach it together. His father, now alone with Potter, closes the door resolutely on George, before turning back to face Potter. Outside, George stands with capsules held in his hand, momentarily still. Nearby, Gower, engrossed in a conversation, finishes his call and, upon noticing George in the doorway, promptly hangs up the phone and turns his full attention to the boy. With a sudden, urgent movement, he grabs George by the shirt, dragging him forcefully into the back room. Gower, consumed by a frantic energy, begins hitting George about the head with his open hands, each blow evoking a wince from Mary, who remains seated at the soda fountain, feeling each slap at a distance. As George instinctively raises his hands to shield himself, he falters, retreating with his hand cupped to his aching ear. In a moment of stark realization, Gower's attention turns to the large brown bottle, conspicuously not returned to its rightful place on the shelf. Observing this, George, with trembling hands, pulls a little box from his pocket, only for Gower to savagely snatch it away, his breath heavy, his stare intense and venomous, as he rips open the package. With deliberate caution, Gower shakes the powder from one of the capsules and tastes it, his abrupt displeasure leading him to discard the entire contents onto the table. Turning back to George, who stands whimpering, both hurt and frightened, a change overtakes Gower. Stepping toward the boy, he abandons his earlier forcefulness, sweeping George into a hug, and with hoarse sobs, envelops him in a crushing embrace. George, feeling a mix of relief and heartbreak, is moved to tears as well. Nearby, across the counter, stands Joe Hepner, the store proprietor, displaying a suitcase with methodical calm amidst the emotional whirlwind."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Uncle Billy, a jovial man in his fifties, enters his father's office after Cousin Tilly answers a call. Nervously, George's father, an idealist in his forties, sits at his desk, facing Henry F. Potter, who is seated in a wheelchair beside a goon. Their fast-paced argument indicates an ongoing crisis at the Bailey Building and Loan Association. Observing the tension and the personal stakes involved, George approaches the desk, pushes Potter's shoulder, and moves towards the door with his father guiding him out. Outside, George holds capsules in his hand, while inside, Gower, who is on the phone, turns to George, pulls him into the back room, and starts hitting him. Mary, at the soda fountain, winces with each blow as George tries to protect himself. Gower, realizing his mistake, checks the large brown bottle, takes the little box from George's pocket, and tastes its contents before angrily discarding it. Overcome with remorse, Gower pulls George into a tight hug, both sobbing. Meanwhile, Joe Hepner, the store proprietor, stands nearby with a suitcase."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He is a very good-humored man of about fifty, in shirt-sleeves, reflecting the casual and approachable demeanor typical of small-town settings in mid-20th century America. During the foregoing, Cousin Tilly has answered the telephone, likely a rotary model common in households at the time, and now she calls out. Uncle Billy looks at his hand. CLOSEUP UNCLE BILLY'S LEFT HAND reveals pieces of string tied around two of the fingers, a traditional method used before digital reminders, obviously to remind him of things he has to do. He opens the door of his father's office and enters. George's father is seated behind his desk, nervously drawing swirls on a pad, a habit indicative of deep thought or anxiety. He is a gentle man in his forties, an idealist, stubborn only for other people's rights, embodying the principles that drive community-focused institutions like the Bailey Building and Loan Association. Nearby, in a throne-like wheelchair, behind which stands the goon who furnishes the motive power, sits Henry F. Potter, a character known for his role as the town's affluent and influential yet morally questionable banker, his squarish derby hat on his head. He looks tired and worried, likely due to the ongoing financial crisis that affects the entire community. The goon pushes his wheelchair closer to the desk. The following dialogue is fast and heated, as though the argument had been in process for some time, reflecting the tension between personal ethics and business interests. George stands irresolute a moment, aware of a crisis in the affairs of the Bailey Building and Loan Association, an institution crucial for many townsfolk aspiring to own homes, but more keenly aware of his personal crisis. George cannot listen any longer to such libel about his father. He comes around in front of the desk. He pushes George toward the door. As George passes Potter's wheelchair, he pushes the old man's shoulder, a physical manifestation of his frustration with Potter's antagonistic stance. The goon puts out a restraining hand. George proceeds toward the door, with his father's hand on his shoulder, a gesture of familial support. George and his father are at the door. Bailey closes the door on George and turns back to Potter. George stands outside the door with the capsules in his hand, reminiscent of earlier pharmacy practices where medicines were often prepared manually. Gower is talking on the telephone. George stands in the doorway. Gower hangs up the phone and turns to George. He grabs George by the shirt and drags him into the back room, indicative of the frustration and panic from realizing a grave mistake. Gower starts hitting George about the head with his open hands, a harsh reaction stemming from stress and worry over an incorrect prescription that could have dire consequences. Mary is still seated at the soda fountain, a popular social spot in 1940s drugstores. Each time she hears George being slapped, she winces. George tries to protect himself as best he can. George falters off, cupping his aching ear with a hand. Gower looks at the large brown bottle, reminiscent of apothecary jars used for storing bulk substances, which has not been replaced on the shelf. George pulls the little box out of his pocket. Gower savagely rips it away from him, breathing heavily, staring at the boy venomously. He tears open the package, shakes the powder out of one of the capsules, a critical error avoided only by George's intervention, cautiously tastes it, then abruptly throws the whole mess to the table and turns to look at George again. The boy is whimpering, hurt, frightened by the violent misunderstanding. Gower steps toward him. But this time Gower sweeps the boy to him in a hug and, sobbing hoarsely, crushes the boy in his embrace, a moment of reconciliation and relief. George is crying too. Across the counter stands Joe Hepner, the proprietor of the store, showing a suitcase, likely a customer unaware of the high-stakes drama unfolding behind the scenes."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He is a very goodhumored man of about fifty in shirtsleeves. During the foregoing Cousin Tilly has answered the telephone and now she calls out. Uncle Billy looks at his hand. CLOSEUP. UNCLE BILLY'S LEFT HAND reveals pieces of string tied around two of the fingers obviously to remind him of things he has to do. He opens the door of his father's office and enters. George's father is seated behind his desk nervously drawing swirls on a pad. He is a gentle man in his forties an idealist stubborn only for other people's rights. Nearby in a thronelike wheelchair behind which stands the goon who furnishes the motive power sits Henry F Potter his squarish derby hat on his head. He looks tired and worried. The goon pushes his wheelchair closer to the desk. The following dialogue is fast and heated as though the argument had been in process for some time. George stands irresolute a moment aware of a crisis in the affairs of the Bailey Building and Loan Association but more keenly aware of his personal crisis. George cannot listen any longer to such libel about his father. He comes around in front of the desk. He pushes George toward the door. As George passes Potter's wheelchair he pushes the old man's shoulder. The goon puts out a restraining hand. George proceeds toward the door with his father's hand on his shoulder. George and his father are at the door. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Bailey closes the door on George and turns back to Potter. George stands outside the door with the capsules in his hand. Gower is talking on the telephone. George stands in the doorway. Gower hangs up the phone and turns to George. He grabs George by the shirt and drags him into the back room. Gower starts hitting George about the head with his open hands. Mary is still seated at the soda fountain. Each time she hears George being slapped she winces. George tries to protect himself as best he can. George falters off cupping his aching ear with a hand. Gower looks at the large brown bottle which has not been replaced on the shelf. George pulls the little box out of his pocket. Gower savagely rips it away from him breathing heavily staring at the boy venomously. He tears open the package shakes the powder out of one of the capsules cautiously tastes it then abruptly throws the whole mess to the table and turns to look at George again. The boy is whimpering hurt frightened. Gower steps toward him. But this time Gower sweeps the boy to him in a hug and sobbing hoarsely crushes the boy in his embrace. George is crying too. Across the counter stands Joe Hepner the proprietor of the store showing a suitcase."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He is a very goodhumored man of about fifty in shirtsleeves. During the foregoing Cousin Tilly has answered the telephone and now she calls out. Uncle Billy looks at his hand. CLOSEUP. UNCLE BILLY'S LEFT HAND reveals pieces of string tied around two of the fingers obviously to remind him of things he has to do. He opens the door of his father's office and enters. George's father is seated behind his desk nervously drawing swirls on a pad. He is a gentle man in his forties an idealist stubborn only for other people's rights. Nearby in a thronelike wheelchair behind which stands the goon who furnishes the motive power sits Henry F Potter his squarish derby hat on his head. He looks tired and worried. The goon pushes his wheelchair closer to the desk. The following dialogue is fast and heated as though the argument had been in process for some time. George stands irresolute a moment aware of a crisis in the affairs of the Bailey Building and Loan Association but more keenly aware of his personal crisis. George cannot listen any longer to such libel about his father. He comes around in front of the desk. He pushes George toward the door. As George passes Potter's wheelchair he pushes the old man's shoulder. The goon puts out a restraining hand. George proceeds toward the door with his father's hand on his shoulder. George and his father are at the door. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. Bailey closes the door on George and turns back to Potter. George stands outside the door with the capsules in his hand. Gower is talking on the telephone. George stands in the doorway. Gower hangs up the phone and turns to George. He grabs George by the shirt and drags him into the back room. Gower starts hitting George about the head with his open hands. Mary is still seated at the soda fountain. Each time she hears George being slapped she winces. George tries to protect himself as best he can. George falters off cupping his aching ear with a hand. Gower looks at the large brown bottle which has not been replaced on the shelf. George pulls the little box out of his pocket. Gower savagely rips it away from him breathing heavily staring at the boy venomously. He tears open the package shakes the powder out of one of the capsules cautiously tastes it then abruptly throws the whole mess to the table and turns to look at George again. The boy is whimpering hurt frightened. Gower steps toward him. But this time Gower sweeps the boy to him in a hug and sobbing hoarsely crushes the boy in his embrace. George is crying too. Across the counter stands Joe Hepner the proprietor of the store showing a suitcase."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He is a very goodhumored man of about fifty in shirtsleeves. During the foregoing Cousin Tilly has answered the telephone and now she calls out. Uncle Billy looks at his hand. CLOSEUP. UNCLE BILLY'S LEFT HAND reveals pieces of string tied around two of the fingers obviously to remind him of things he has to do. He opens the door of his father's office and enters. George's father is seated behind his desk nervously drawing swirls on a pad. He is a gentle man in his forties an idealist stubborn only for other people's rights. Nearby in a thronelike wheelchair behind which stands the goon who furnishes the motive power sits Henry F Potter his squarish derby hat on his head. He looks tired and worried. George falters off cupping his aching ear with a hand. Gower looks at the large brown bottle which has not been replaced on the shelf. George pulls the little box out of his pocket. Gower savagely rips it away from him breathing heavily staring at the boy venomously. He tears open the package shakes the powder out of one of the capsules cautiously tastes it then abruptly throws the whole mess to the table and turns to look at George again. The boy is whimpering hurt frightened. Gower steps toward him. But this time Gower sweeps the boy to him in a hug and sobbing hoarsely crushes the boy in his embrace. George is crying too. Across the counter stands Joe Hepner the proprietor of the store showing a suitcase."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He is a very goodhumored man of about fifty in shirtsleeves. During the foregoing Cousin Tilly has answered the telephone and now she calls out. Uncle Billy looks at his hand. CLOSEUP. Gower steps toward him. But this time Gower sweeps the boy to him in a hug and sobbing hoarsely crushes the boy in his embrace. George is crying too. Across the counter stands Joe Hepner the proprietor of the store showing a suitcase."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The cat is a very mischievous feline of about ten, in clown costumes. During the knitting, Cousin Daisy has juggled the telescope, and now she whispers out. Uncle Charlie stares at his paw. CLOSEUP UNCLE CHARLIE'S RIGHT PAW showcases pieces of yarn tied around two of the claws, clearly to remind him of tasks he plans to complete. He closes the gate of his brother's workshop and leaps. Fred's brother is crouched behind his bench, anxiously sketching spirals on a tile. He is a fierce bear in his twenties, a realist, stubborn only for other creatures’ territories. Nearby, in a hammock-like spaceship, above which floats the alien who supplies the magic energy, floats Henry F. Pickle, his triangular helmet on his snout. He appears energized and ecstatic. The alien propels his spaceship closer to the bench. The following recital is slow and whispered, as though the agreement had been in progress for some days. Fred hops uncertainly a second, aware of a celebration in the chaos of the Venus Travel and Exploration Corporation, but more sharply aware of his joyful celebration. Fred cannot dance any longer to such melodies about his brother. He crawls over in back of the bench. He pulls Fred toward the gate. As Fred floats past Pickle's spaceship, he tickles the old alien's ear. The alien retracts a welcoming paw. Fred dances toward the gate, with his brother's paw on his ear. Fred and his brother are at the gate. Venus closes the gate on Fred and spins forward to Pickle. Fred hops inside the gate with the marbles in his claws. Bouncer is swimming under the telescope. Fred hops in the hallway. Bouncer dives off the telescope and spins to Fred. He pats Fred on the jacket and drags him into the attic. Bouncer starts hugging Fred around the leg with his closed paws. Sally is still crouched at the candy store. Each moment she sees Fred being patted, she cheers. Fred attempts to defend himself as best he might. Fred leaps away, massaging his grinning nose with a paw. Bouncer stares at the tiny red pebble which has not been tossed on the ground. Fred pries the enormous hat out of his knapsack. Bouncer slowly stitches it away from him, grinning softly, giggling at the child peacefully. He stitches closed the envelope, swims the sand out of one of the marbles, playfully smells it, then accidentally tosses the whole treasure to the rug and dives to giggle at Fred again. The child is laughing, joyful, cheerful. Bouncer spins away from him. But this time Bouncer tickles the child away from him in a dance and, grinning widely, cradles the child in his paws. Fred is laughing also. Across the cave flies Joe Pigeon, the wanderer of the cave, swinging a drum."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Uncle Billy, a humorous man around fifty, enters his father's office, where George's father is nervously drawing on a notepad. Nearby sits Henry F. Potter, tired and worried in his wheelchair, with an intense argument ongoing. George, experiencing a personal crisis and upset by insults toward his father, pushes Potter’s shoulder as he leaves. Outside, he holds capsules in his hand. Gower, on the phone, suddenly drags George into the back room and hits him, causing Mary at the soda fountain to wince. George tries to protect himself, but Gower, realizing his mistake, hugs George tightly in apology. Both are crying, as Joe Hepner, the store owner, stands nearby with a suitcase."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Across the counter stands Joe Hepner the proprietor of the store showing a suitcase George is crying too But this time Gower sweeps the boy to him in a hug and sobbing hoarsely crushes the boy in his embrace Gower steps toward him The boy is whimpering hurt frightened He tears open the package shakes the powder out of one of the capsules cautiously tastes it then abruptly throws the whole mess to the table and turns to look at George again Gower savagely rips it away from him breathing heavily staring at the boy venomously George pulls the little box out of his pocket Gower looks at the large brown bottle which has not been replaced on the shelf George falters off cupping his aching ear with a hand George tries to protect himself as best he can Each time she hears George being slapped she winces Mary is still seated at the soda fountain Gower starts hitting George about the head with his open hands He grabs George by the shirt and drags him into the back room Gower hangs up the phone and turns to George George stands in the doorway Gower is talking on the telephone George stands outside the door with the capsules in his hand Bailey closes the door on George and turns back to Potter George and his father are at the door George proceeds toward the door with his father's hand on his shoulder The goon puts out a restraining hand As George passes Potter's wheelchair he pushes the old man's shoulder He pushes George toward the door He comes around in front of the desk George cannot listen any longer to such libel about his father George stands irresolute a moment aware of a crisis in the affairs of the Bailey Building and Loan Association but more keenly aware of his personal crisis The following dialogue is fast and heated as though the argument had been in process for some time The goon pushes his wheelchair closer to the desk He looks tired and worried Nearby in a thronelike wheelchair behind which stands the goon who furnishes the motive power sits Henry F Potter his squarish derby hat on his head He is a gentle man in his forties an idealist stubborn only for other people's rights George's father is seated behind his desk nervously drawing swirls on a pad He opens the door of his father's office and enters UNCLE BILLY'S LEFT HAND reveals pieces of string tied around two of the fingers obviously to remind him of things he has to do CLOSEUP Uncle Billy looks at his hand During the foregoing Cousin Tilly has answered the telephone and now she calls out He is a very goodhumored man of about fifty in shirtsleeves"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "During the foregoing Cousin Tilly has answered the telephone and now she calls out He is a very goodhumored man of about fifty in shirtsleeves CLOSEUP Uncle Billy looks at his hand He opens the door of his father's office and enters UNCLE BILLY'S LEFT HAND reveals pieces of string tied around two of the fingers obviously to remind him of things he has to do He is a gentle man in his forties an idealist stubborn only for other people's rights George's father is seated behind his desk nervously drawing swirls on a pad He looks tired and worried Nearby in a thronelike wheelchair behind which stands the goon who furnishes the motive power sits Henry F Potter his squarish derby hat on his head The following dialogue is fast and heated as though the argument had been in process for some time The goon pushes his wheelchair closer to the desk George cannot listen any longer to such libel about his father George stands irresolute a moment aware of a crisis in the affairs of the Bailey Building and Loan Association but more keenly aware of his personal crisis He pushes George toward the door He comes around in front of the desk The goon puts out a restraining hand As George passes Potter's wheelchair he pushes the old man's shoulder George and his father are at the door George proceeds toward the door with his father's hand on his shoulder George stands outside the door with the capsules in his hand Bailey closes the door on George and turns back to Potter George stands in the doorway Gower is talking on the telephone He grabs George by the shirt and drags him into the back room Gower hangs up the phone and turns to George Mary is still seated at the soda fountain Gower starts hitting George about the head with his open hands George tries to protect himself as best he can Each time she hears George being slapped she winces Gower looks at the large brown bottle which has not been replaced on the shelf George falters off cupping his aching ear with a hand Gower savagely rips it away from him breathing heavily staring at the boy venomously George pulls the little box out of his pocket The boy is whimpering hurt frightened He tears open the package shakes the powder out of one of the capsules cautiously tastes it then abruptly throws the whole mess to the table and turns to look at George again But this time Gower sweeps the boy to him in a hug and sobbing hoarsely crushes the boy in his embrace Gower steps toward him Across the counter stands Joe Hepner the proprietor of the store showing a suitcase George is crying too"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Bailey closes the door on George and turns back to Potter George stands outside the door with the capsules in his hand Gower is talking on the telephone George stands in the doorway Gower hangs up the phone and turns to George He grabs George by the shirt and drags him into the back room Gower starts hitting George about the head with his open hands Mary is still seated at the soda fountain Each time she hears George being slapped she winces George tries to protect himself as best he can George falters off cupping his aching ear with a hand Gower looks at the large brown bottle which has not been replaced on the shelf George pulls the little box out of his pocket Gower savagely rips it away from him breathing heavily staring at the boy venomously He tears open the package shakes the powder out of one of the capsules cautiously tastes it then abruptly throws the whole mess to the table and turns to look at George again The boy is whimpering hurt frightened Gower steps toward him But this time Gower sweeps the boy to him in a hug and sobbing hoarsely crushes the boy in his embrace George is crying too Across the counter stands Joe Hepner the proprietor of the store showing a suitcase He is a very goodhumored man of about fifty in shirtsleeves During the foregoing Cousin Tilly has answered the telephone and now she calls out Uncle Billy looks at his hand CLOSEUP UNCLE BILLY'S LEFT HAND reveals pieces of string tied around two of the fingers obviously to remind him of things he has to do He opens the door of his father's office and enters George's father is seated behind his desk nervously drawing swirls on a pad He is a gentle man in his forties an idealist stubborn only for other people's rights Nearby in a thronelike wheelchair behind which stands the goon who furnishes the motive power sits Henry F Potter his squarish derby hat on his head He looks tired and worried The goon pushes his wheelchair closer to the desk The following dialogue is fast and heated as though the argument had been in process for some time George stands irresolute a moment aware of a crisis in the affairs of the Bailey Building and Loan Association but more keenly aware of his personal crisis George cannot listen any longer to such libel about his father He comes around in front of the desk He pushes George toward the door As George passes Potter's wheelchair he pushes the old man's shoulder The goon puts out a restraining hand George proceeds toward the door with his father's hand on his shoulder George and his father are at the door"
        }
      ]
    }
  ]
}