{
  "ground_truth": "Mickey, a young punk who has had one too many, is beside him. He takes the key from Mickey and turns the switch. The floor begins to part in the middle, each half sliding under the bleacher seats. Pandemonium starts. Dancers begin to scream as they try to get off. Some are so engrossed in dancing they continue at top speed. Teachers and elders start to scurry off. George and Mary are dancing. They mistake the screams for cheers. George and Mary are so busy dancing they don't notice the floor opening. As the floor opens, it reveals an attractive, lighted swimming pool. Spotlights concentrate on them. The crowd is watching George and Mary dancing. They move backwards until finally they reach the edge of the floor and fall into the pool below. George and Mary are still trying to dance in the water with the crowd on the edge cheering them; some of the crowd leap into the pool; the principal tries to restore order, finally clasps his hands like a diver, and leaps in himself. The night is warm with a bright moon. George is dressed in a jersey sweater and oversized football pants that keep wanting to come down. Mary is in an old white bathrobe. Each is carrying their wet clothes tied into a bundle that leaves a trail of dripping water. As they near the camera, we hear them singing. The camera moves with them as they proceed down the street. He takes the bundle of clothes from Mary. They stop and look at each other. Mary stops. George, to cover his embarrassment, talks quickly on. In his confusion, George steps on the end of the belt of Mary's bathrobe, which is trailing along behind her. She gathers the robe around her. He picks up the belt and throws it over her arm. George looks after her, then picks up a rock from the street. It is a weather-beaten, old-fashioned two-storied house that once was no doubt resplendent. George hurls the rock at the house. We see a grumpy old man in shirt sleeves in a rocking chair on the porch. He looks up as he hears the breaking glass. As he talks, Mary has been listening intently. She finally stoops down and picks up a rock, weighting it in her hand. The old deserted house. Mary throws her rock, and once more we hear the sound of breaking glass. Mary looks at him provocatively, then turns and shuffles off down the street, singing as she goes. George hurries after her. George joins her in the singing as they proceed down the street. Man on the porch of the house is listening to George and Mary. They have stopped walking and now face one another.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Mickey, a youthful hoodlum who has had one too many, is next to him. He takes the key from Mickey and turns the switch. The flooring begins to separate in the center, each portion sliding beneath the bleacher seats. Chaos starts. Dancers begin to shriek as they attempt to get off. Some are so absorbed in dancing they persist at top speed. Instructors and seniors start to scurry off. George and Mary are dancing. They mistake the shrieks for cheers. George and Mary are so occupied in dancing they don't notice the flooring opening. As the flooring opens, it uncovers an appealing, illuminated swimming pool. Spotlights focus on them. The crowd is observing George and Mary dancing. They move backwards until finally they reach the brink of the flooring and fall into the pool below. George and Mary are still attempting to dance in the water with the crowd on the edge applauding them; some of the crowd leap into the pool; the principal attempts to restore order, finally clasps his hands like a diver, and leaps in himself. The night is temperate with a bright moon. George is dressed in a jersey sweater and oversized football trousers that keep wanting to descend. Mary is in an old white bathrobe. Each is carrying their wet attire tied into a bundle that leaves a path of dripping water. As they approach the camera, we hear them singing. The camera moves with them as they continue down the street. He takes the bundle of attire from Mary. They pause and look at each other. Mary halts. George, to cover his embarrassment, talks quickly on. In his confusion, George steps on the end of the belt of Mary's bathrobe, which is trailing along behind her. She gathers the robe around her. He picks up the belt and throws it over her arm. George looks after her, then picks up a stone from the street. It is a weather-beaten, old-fashioned two-storied residence that once was no doubt splendid. George hurls the stone at the residence. We see a surly old man in shirt sleeves in a rocking chair on the porch. He looks up as he hears the breaking glass. As he talks, Mary has been listening attentively. She finally stoops down and picks up a stone, weighing it in her hand. The old abandoned residence. Mary throws her stone, and once more we hear the sound of breaking glass. Mary looks at him enticingly, then turns and shuffles off down the street, singing as she goes. George hastens after her. George joins her in the singing as they continue down the street. Man on the porch of the residence is listening to George and Mary. They have stopped walking and now face one another."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Mickey, a young punk who has had one too many, is beside him. The key is taken from Mickey and the switch is turned by him. The floor is begun to part in the middle, with each half sliding under the bleacher seats. Pandemonium is started. Screams are begun by the dancers as attempts to get off are made by them. Some are so engrossed in dancing that top speed is continued by them. Scurrying off is started by the teachers and elders. George and Mary are dancing. The screams are mistaken for cheers by them. George and Mary, so busy dancing, don't notice the floor opening. As the floor is opened, an attractive, lighted swimming pool is revealed. Spotlights concentrate on them. George and Mary are watched by the crowd dancing. They are moved backwards until finally the edge of the floor is reached by them and they fall into the pool below. George and Mary are still trying to dance in the water with cheers given by the crowd on the edge; some of the crowd leap into the pool; order is tried to be restored by the principal, who finally clasps his hands like a diver and leaps in himself. A bright moon warms the night. A jersey sweater and oversized football pants that keep wanting to come down are worn by George. Mary is in an old white bathrobe. Their wet clothes tied into a bundle that leaves a trail of dripping water are carried by each. As the camera is neared by them, singing is heard. As they proceed down the street, the camera moves with them. The bundle of clothes is taken from Mary by him. They stop and look at each other. Mary stops. George, to cover his embarrassment, talks quickly on. In his confusion, the end of the belt of Mary's bathrobe, which is trailing along behind her, is stepped on by George. The robe is gathered around her by her. The belt is picked up and thrown over her arm by him. After her, George looks, then a rock from the street is picked up by him. It is a weather-beaten, old-fashioned two-storied house that no doubt was once resplendent. The rock is hurled at the house by George. A grumpy old man in shirt sleeves in a rocking chair on the porch is seen. He looks up as the breaking glass is heard by him. As he talks, Mary has been listening intently. Finally, a rock is stooped down to and picked up, weighting it in her hand. The old deserted house. Her rock is thrown by Mary, and once more the sound of breaking glass is heard. George is looked at provocatively by Mary, then shuffling off down the street is turned and done by her, singing as she goes. After her, George hurries. Her singing is joined in by George as they proceed down the street. George and Mary are listened to by the man on the porch of the house. Walking has been stopped by them and now they face one another."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Mickey, a tipsy young punk, stands beside him. He takes Mickey's key and turns the switch. The floor parts in the middle, sliding under the bleacher seats, causing chaos. Dancers scream while trying to escape, though some remain engrossed. Teachers and elders hurry away. George and Mary, mistaking the screams for cheers, keep dancing, unaware of the opening floor revealing a lighted swimming pool. Spotlights highlight them. The crowd watches as they dance toward the edge and fall into the pool, still dancing. Enthusiastic onlookers cheer and join them; the principal eventually leaps in as well. It's a warm, bright moonlit night. George wears a jersey sweater and oversized football pants that threaten to fall, while Mary dons an old white bathrobe. Each carries dripping wet clothes in bundles. Walking down the street, they sing. George takes Mary’s bundle, talks to cover his embarrassment, and accidentally steps on her robe's trailing belt. Mary gathers it, and George throws the belt over her arm. He then picks up a rock and hurls it at a weathered two-story house, breaking glass. A grumpy old man on the porch notices. Mary, listening, picks up a rock and breaks more glass, then provocatively turns and shuffles away, singing. George hurries, joins her in song, and they walk down the street. The man on the porch listens as they stop and face each other."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Mickey, intoxicated, is by him. He takes Mickey's key and turns the switch. The floor parts, sliding under bleachers, causing chaos. Some dancers scream and flee, while others keep dancing. George and Mary mistake screams for cheers, engrossed in dancing. As the floor reveals a lit swimming pool, spotlights hit them. The crowd watches as they dance to the edge and fall into the pool. They continue dancing in water with cheering spectators, some jumping in, and the principal diving in to restore order. It’s a warm, moonlit night. George wears an oversized sweater and football pants, Mary in an old robe. They carry wet clothes in bundles, dripping water, while singing down the street. George takes Mary’s clothes, speaking to cover embarrassment, and steps on her robe belt. She gathers the robe; he tosses the belt over her arm. Watching her, George picks up a rock and throws it at a dilapidated house, breaking glass. An old man on the porch notices. Mary listens, picks up a rock, and breaks more glass. She looks provocatively at George, then shuffles away singing. George follows, joining her song as they walk. The man on the porch listens as they stop and face each other."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Mickey, a young punk who has unfortunately had a few too many drinks, is standing right next to him. Without hesitation, he takes the key from Mickey's hand and promptly turns the switch. The floor in the center of the room begins to move apart, with each half sliding smoothly underneath the bleacher seats. Pandemonium ensues as dancers start screaming frantically, desperately trying to get off the floor. Several dancers are so engrossed in the rhythm that they continue moving at full speed, oblivious to the chaos around them. Teachers and elders in the crowd start to scurry off in haste. Meanwhile, George and Mary are joyfully engrossed in their dancing, mistaking the frantic screams for cheers of encouragement. Both George and Mary, fully absorbed in their dance, fail to notice the floor slowly opening beneath them. As it opens, it reveals an enticing, beautifully lighted swimming pool beneath. Spotlights focus sharply on them, and the crowd's attention is fixed on George and Mary, who are dancing unaware. They inadvertently move backward until they finally reach the very edge of the floor and, with a splash, fall into the pool below. Even in the water, George and Mary continue their dance, while the crowd gathers at the pool's edge, cheering them on enthusiastically. Some members of the crowd, caught up in the excitement, leap into the pool after them; the principal, attempting to restore some semblance of order, ultimately joins in, clasping his hands like a diver before leaping in himself. The night is pleasantly warm, with a bright, luminous moon hanging overhead. George is dressed in a casual jersey sweater and oversized football pants that keep threatening to slip down. Mary is clad in an old, shabby white bathrobe. Each of them carries a bundle of wet clothes, tied together and leaving a trail of dripping water behind them. As they draw closer to the camera, their singing becomes audible. The camera follows their movement as they proceed leisurely down the street. George takes the bundle of wet clothes from Mary's hands. They pause and gaze at each other momentarily. Mary stops. George, eager to cover his embarrassment, hurriedly continues talking. In his confusion, George accidentally steps on the trailing end of the belt of Mary's bathrobe, which is hanging behind her. She quickly gathers the robe around herself. He picks up the belt and drapes it over her arm with care. George looks after her thoughtfully, then bends down to pick up a rock from the street. Before them is a weather-beaten, old-fashioned, two-storied house that once was undoubtedly resplendent in its prime. George hurls the rock with determination at the house. We catch sight of a grumpy old man in shirt sleeves, sitting in a rocking chair on the porch. He looks up, startled, as he hears the sound of breaking glass. As he speaks, Mary listens intently, her attention fully captured. She finally stoops down, picks up a rock, and feels its weight in her hand. She surveys the old, deserted house. With a flick of her wrist, Mary throws her rock, and once more, the sound of shattering glass is heard. Mary looks at him with a provocative glance, then turns and casually shuffles off down the street, singing as she goes. George quickly hurries after her. He joins her in the singing as they continue along the street. The man on the house's porch listens closely to George and Mary. They come to a stop, facing one another, as their voices unite in song."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Mickey, a young punk with a wild streak who has unfortunately had one too many drinks imbibed, is standing precariously close right next to him. Without a moment's hesitation, he confidently reaches out and takes the key from Mickey's unsteady hand, promptly turning the switch with purpose. Immediately, the floor located in the center of the room begins to separate, with each half sliding smoothly and swiftly underneath the bleacher seats. Chaos erupts as the dancers, startled by the sudden movement, start screaming frantically, desperately attempting to flee from the moving floor. Several dancers, however, are so deeply engrossed in the irresistible rhythm that they continue dancing at full speed, completely oblivious to the chaos and confusion around them. Teachers and elders present in the crowd start to scurry off with urgency, attempting to avoid the opening floor. Meanwhile, George and Mary are delightfully and joyfully engrossed in their dancing, mistakenly interpreting the frantic screams as encouraging cheers. Both George and Mary, completely absorbed in their dance, fail to notice the floor slowly opening beneath their feet. As it opens further, it reveals an alluring, beautifully illuminated swimming pool lying beneath them. Spotlights sharply focus on them, and the crowd's undivided attention is fixed on George and Mary, who continue dancing completely unaware of the unfolding situation. They inadvertently step backward until they eventually reach the very edge of the floor and, with a splash, plunge into the pool below. Even in the water, George and Mary persist in their dance, while the crowd eagerly gathers at the pool's edge, cheering them on with enthusiasm. Some members of the crowd, caught up in the exhilarating excitement of the moment, leap into the pool after them; even the school principal, attempting to bring back a semblance of order, ultimately finds himself joining in, clasping his hands like a seasoned diver before executing his own leap. The night is perfectly warm and inviting, with a bright, luminous moon hanging overhead in the clear sky. George is dressed casually in a jersey sweater and oversized football pants that keep threatening to slip down in the commotion. Mary, on the other hand, is clad in an old, worn-out white bathrobe that has clearly seen better days. Each of them carries a bundle of wet clothes, tied together and leaving a trail of dripping water in their wake. As they draw closer to the camera's focus, their singing becomes audible. The camera follows their leisurely movement as they proceed down the street. George, ever the gentleman, takes the bundle of wet clothes from Mary's hands. They pause, locking gazes and exchanging a silent moment. Mary suddenly comes to a halt. George, eager to cover his embarrassment and regain composure, hurriedly continues speaking. In his flustered state, George accidentally steps on the trailing end of the belt of Mary's bathrobe, which is hanging behind her. She quickly gathers the robe securely around herself. He picks up the belt and drapes it over her arm with care and consideration. George looks after her thoughtfully, then bends down to pick up a rock lying on the street. Before them stands a weather-beaten, old-fashioned, two-storied house that once, undoubtedly, was resplendent in its prime. With determination, George hurls the rock at the house. We catch sight of a grumpy old man in shirt sleeves, seated in a rocking chair on the porch. Startled, he looks up as he hears the sound of breaking glass. As he speaks, Mary listens intently, her attention fully captured by his words. Finally, she stoops down, picks up a rock, and contemplates its weight in her hand. She surveys the old, deserted house, and with a flick of her wrist, Mary throws her rock, resulting once again in the sound of shattering glass. Mary casts a provocative glance at him, then turns and casually shuffles off down the street, singing as she goes. George quickly hurries after her, joining in her singing as they continue down the street together. The man on the house's porch listens closely to George and Mary. They come to a stop, facing each other, as their voices unite harmoniously in song."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Mickey, a young punk who has had one too many drinks, stands beside him, teetering slightly. He reaches over, takes the key from Mickey's grip, and inserts it into the switch with a firm turn. Immediately, the floor begins to part at the center, each half smoothly sliding beneath the bleacher seats. As this unexpected change unfolds, pandemonium erupts. Dancers, who have been lost in the rhythm, suddenly become aware of the chaos and start to scream, frantically attempting to get off the moving floor. Despite the commotion, some dancers are so absorbed in their movements that they continue twirling at full speed, oblivious to the danger. Concerned teachers and elders quickly scurry to safety, retreating from the scene. Amidst the frenzy, George and Mary are dancing energetically, misinterpreting the screams around them as cheers of encouragement. Completely engrossed in their dance, they fail to notice the widening gap in the floor. As the floor parts wider, an attractive, lighted swimming pool is gradually unveiled beneath them. The spotlights focus intently on George and Mary, highlighting their continued obliviousness to the spectacle unfolding beneath their feet. The crowd's attention is fixated on the pair as they unconsciously inch backwards, nearing the brink of the open floor. Finally, they reach the edge and, with a sudden misstep, tumble into the illuminated pool below. Undeterred by the water, George and Mary persist in their attempts to dance, their movements splashing about in the pool, all while the crowd lining the pool's edge cheers them on. Moved by the excitement, some members of the audience gleefully leap into the pool to join the aquatic dance party. Amid this lively scene, the principal desperately tries to reestablish order but eventually succumbs to the fun, clasping his hands together like a diver and springing into the pool himself. The night air is warm, adorned with the glow of a bright moon. George, soaked and exhilarated, is clad in a jersey sweater and oversized football pants that continuously slip down. Mary, sporting an old white bathrobe, carries her sopping wet clothes tied into a bundle, leaving a trail of dripping water behind. As they walk along, nearing the camera, their voices lift in song, harmonizing in the night's tranquility. The camera follows their progress down the street. George, in a gesture of helpfulness, takes Mary's bundle of clothes. They come to a halt, exchanging a meaningful look. Mary pauses, while George, trying to mask his awkwardness, chatters quickly to fill the silence. In his flustered state, he accidentally steps on the trailing end of Mary's bathrobe belt. She promptly gathers the robe around herself with modesty. Reacting quickly, he picks up the belt and gently drapes it over her arm, a small act of chivalry. George gazes after Mary as she begins to walk away, then impulsively picks up a rock from the street. The target is a weathered, old-fashioned two-story house, once grand but now a shadow of its former glory. With a determined throw, George hurls the rock at the house, and the sound of shattering glass echoes through the night. On the porch, a grumpy old man in shirt sleeves, seated in a rocking chair, looks up, startled by the noise. Throughout George's impulsive act, Mary listens intently, her eyes following the flight of the rock. Inspired, she bends down, picks up a rock of her own, and weighs it thoughtfully in her hand. Then, with a swift motion, she launches it at the same house, producing yet another gratifying crash of breaking glass. Mary casts a provocative glance at George, a playful challenge in her eyes, before turning and shuffling down the street, her voice lilting into song once more. George quickly catches up with her, his pace increasing to match hers. Together, they join their voices, singing in unison as they continue their walk down the street. Meanwhile, the man on the porch listens to their duet, the music filling the quiet night. They eventually cease their walking and stand facing one another, sharing a moment of connection in the moonlit silence."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Mickey, a young punk who has had one too many, stands beside him as he takes the key and turns the switch, causing the floor to part in the middle, sliding under the bleacher seats and revealing a lighted swimming pool. Pandemonium breaks out as dancers scream and scatter, though some remain engrossed in their movements. George and Mary, mistaken the screams for cheers, continue dancing, unaware of the opening floor, until they move backward and fall into the pool. Undeterred, they try to dance in the water while the crowd cheers from the edge, with some leaping into the pool, including the principal who attempts to restore order before diving in himself. \n\nOn a warm, moonlit night, George wears a jersey sweater and oversized football pants while Mary is in an old white bathrobe, each carrying their wet clothes in a dripping bundle. As they walk down the street singing, George takes Mary's bundle and, in his flustered state, steps on her bathrobe belt. She gathers the robe, and he throws the belt over her arm. Pausing, George then picks up and hurls a rock at a weather-beaten, old two-storied house, breaking a window and drawing the attention of a grumpy old man on the porch. Inspired, Mary picks up a rock and breaks another window, looking at George provocatively before shuffling off while singing. George hurries to join her, and together they sing as they walk down the street, with the man on the porch listening to their duet as they pause to face each other."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Mickey, a young punk who has had one too many drinks on this unusually lively night, is beside him. He takes the key from Mickey, a habitually reckless figure known for his wild antics at the local youth center, and turns the switch. The floor of the dance hall, designed with an innovative mechanism from a local inventor, begins to part in the middle, each half sliding under the bleacher seats. Pandemonium starts. Dancers at the school dance begin to scream as they try to get off. Some are so engrossed in dancing to the popular swing music they continue at top speed. Teachers and elders at the chaperoned event start to scurry off. George and Mary are dancing, caught up in their own world. They mistake the screams for cheers, influenced by their shared love of the film musicals of the time. George and Mary are so busy dancing they don't notice the floor opening. As the floor opens, it reveals an attractive, lighted swimming pool, a local attraction famous for its underwater lighting installed by the town's electrician. Spotlights, typically used for theatrical productions in the community theater, concentrate on them. The crowd, a mix of classmates and townspeople, is watching George and Mary dancing. They move backwards, caught in the rhythm, until finally they reach the edge of the floor and fall into the pool below. George and Mary are still trying to dance in the water, reminiscent of a comedic scene from a movie, with the crowd on the edge cheering them; some of the crowd leap into the pool, infected by the spirit of spontaneity; the principal, known for his strict discipline but surprising sense of humor, tries to restore order, finally clasps his hands like a diver, and leaps in himself. The night is warm with a bright moon casting its glow over this small-town spectacle. George is dressed in a jersey sweater and oversized football pants, reminiscent of his days as the high school team's star quarterback, that keep wanting to come down. Mary is in an old white bathrobe, a hand-me-down from her grandmother. Each is carrying their wet clothes tied into a bundle that leaves a trail of dripping water. As they near the camera, we hear them singing a duet from a popular radio show. The camera moves with them as they proceed down the street past shuttered storefronts. He takes the bundle of clothes from Mary, showing his considerate nature. They stop and look at each other under the streetlamps. Mary stops. George, to cover his embarrassment, talks quickly on. In his confusion, George steps on the end of the belt of Mary's bathrobe, which is trailing along behind her. She gathers the robe around her with a laugh. He picks up the belt and throws it over her arm. George looks after her, then picks up a rock from the cobblestone street. It is a weather-beaten, old-fashioned two-storied house that once was no doubt resplendent, rumored to have been built by the town's founder. George hurls the rock at the house, a local teenage rite of passage. We see a grumpy old man in shirt sleeves in a rocking chair on the porch, a reclusive figure known for his disdain of youthful antics. He looks up as he hears the breaking glass. As he talks, Mary has been listening intently, intrigued by his tales of youthful adventures. She finally stoops down and picks up a rock, weighting it in her hand thoughtfully. The old deserted house stands silent witness. Mary throws her rock, and once more we hear the sound of breaking glass, echoing in the still night. Mary looks at him provocatively, then turns and shuffles off down the street, singing as she goes, her voice carrying into the night. George hurries after her, not wanting the moment to end. George joins her in the singing, their harmony blending as they proceed down the street. Man on the porch of the house, a fixture of the neighborhood, is listening to George and Mary, a nostalgic smile on his face. They have stopped walking and now face one another, sharing a connection that needs no words."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Some are so engrossed in dancing they continue at top speed Mickey a young punk who has had one too many is beside him He takes the key from Mickey and turns the switch The floor begins to part in the middle each half sliding under the bleacher seats Pandemonium starts Dancers begin to scream as they try to get off Some are so engrossed in dancing they continue at top speed Teachers and elders start to scurry off George and Mary are dancing Mary is in an old white bathrobe They mistake the screams for cheers The camera moves with them as they proceed down the street George joins her in the singing as they proceed down the street George and Mary are so busy dancing they do not notice the floor opening George looks after her then picks up a rock from the street Mickey a young punk who has had one too many is beside him As the floor opens it reveals an attractive lighted swimming pool Spotlights concentrate on them The crowd is watching George and Mary dancing They move backwards until finally they reach the edge of the floor and fall into the pool below some of the crowd leap into the pool the principal tries to restore order finally clasps his hands like a diver and leaps in himself George and Mary are still trying to dance in the water with the crowd on the edge cheering them some of the crowd leap into the pool Teachers and elders start to scurry off the principal tries to restore order finally clasps his hands like a diver and leaps in himself Man on the porch of the house is listening to George and Mary The night is warm with a bright moon George is dressed in a jersey sweater and oversized football pants that keep wanting to come down Mary is in an old white bathrobe Each is carrying their wet clothes tied into a bundle that leaves a trail of dripping water As they near the camera we hear them singing The camera moves with them as they proceed down the street The old deserted house He takes the bundle of clothes from Mary They stop and look at each other Mary stops George to cover his embarrassment talks quickly on The night is warm with a bright moon George and Mary are still trying to dance in the water with the crowd on the edge cheering them In his confusion George steps on the end of the belt of Mary's bathrobe which is trailing along behind her She gathers the robe around her He picks up the belt and throws it over her arm George looks after her then picks up a rock from the street It is a weatherbeaten oldfashioned twostoried house that once was no doubt resplendent George hurls the rock at the house They have stopped walking and now face one another We see a grumpy old man in shirt sleeves in a rocking chair on the porch He looks up as he hears the breaking glass They mistake the screams for cheers He takes the key from Mickey and turns the switch As he talks Mary has been listening intently She finally stoops down and picks up a rock weighting it in her hand We see a grumpy old man in shirt sleeves in a rocking chair on the porch The old deserted house Mary throws her rock and once more we hear the sound of breaking glass Mary looks at him provocatively then turns and shuffles off down the street singing as she goes George hurries after her She gathers the robe around her George hurries after her George joins her in the singing as they proceed down the street The floor begins to part in the middle each half sliding under the bleacher seats Man on the porch of the house is listening to George and Mary George and Mary are dancing As he talks Mary has been listening intently They have stopped walking and now face one another"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Mickey a young punk who has had one too many is beside him. He takes the key from Mickey and turns the switch. The floor begins to part in the middle each half sliding under the bleacher seats. Pandemonium starts. Dancers begin to scream as they try to get off. Some are so engrossed in dancing they continue at top speed. Teachers and elders start to scurry off. George and Mary are dancing. They mistake the screams for cheers. George and Mary are so busy dancing they do not notice the floor opening. As the floor opens it reveals an attractive lighted swimming pool. Spotlights concentrate on them. The crowd is watching George and Mary dancing. They move backwards until finally they reach the edge of the floor and fall into the pool below. George and Mary are still trying to dance in the water with the crowd on the edge cheering them. some of the crowd leap into the pool. the principal tries to restore order finally clasps his hands like a diver and leaps in himself. The night is warm with a bright moon. George is dressed in a jersey sweater and oversized football pants that keep wanting to come down. Mary is in an old white bathrobe. Each is carrying their wet clothes tied into a bundle that leaves a trail of dripping water. As they near the camera we hear them singing. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. The camera moves with them as they proceed down the street. He takes the bundle of clothes from Mary. They stop and look at each other. Mary stops George to cover his embarrassment talks quickly on. In his confusion George steps on the end of the belt of Mary's bathrobe which is trailing along behind her. She gathers the robe around her. He picks up the belt and throws it over her arm. George looks after her then picks up a rock from the street. It is a weatherbeaten oldfashioned twostoried house that once was no doubt resplendent. George hurls the rock at the house. We see a grumpy old man in shirt sleeves in a rocking chair on the porch. He looks up as he hears the breaking glass. As he talks Mary has been listening intently. She finally stoops down and picks up a rock weighting it in her hand. The old deserted house. Mary throws her rock and once more we hear the sound of breaking glass. Mary looks at him provocatively. then turns and shuffles off down the street singing as she goes. George hurries after her. George joins her in the singing as they proceed down the street. Man on the porch of the house is listening to George and Mary. They have stopped walking and now face one another."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Mickey a young punk who has had one too many is beside him. He takes the key from Mickey and turns the switch. The floor begins to part in the middle each half sliding under the bleacher seats. Pandemonium starts. Dancers begin to scream as they try to get off. Some are so engrossed in dancing they continue at top speed. Teachers and elders start to scurry off. George and Mary are dancing. They mistake the screams for cheers. George and Mary are so busy dancing they do not notice the floor opening. As the floor opens it reveals an attractive lighted swimming pool. Spotlights concentrate on them. The crowd is watching George and Mary dancing. They move backwards until finally they reach the edge of the floor and fall into the pool below. George and Mary are still trying to dance in the water with the crowd on the edge cheering them. some of the crowd leap into the pool. the principal tries to restore order finally clasps his hands like a diver and leaps in himself. The night is warm with a bright moon. George is dressed in a jersey sweater and oversized football pants that keep wanting to come down. Mary is in an old white bathrobe. Each is carrying their wet clothes tied into a bundle that leaves a trail of dripping water. As they near the camera we hear them singing. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. The camera moves with them as they proceed down the street. He takes the bundle of clothes from Mary. They stop and look at each other. Mary stops George to cover his embarrassment talks quickly on. In his confusion George steps on the end of the belt of Mary's bathrobe which is trailing along behind her. She gathers the robe around her. He picks up the belt and throws it over her arm. George looks after her then picks up a rock from the street. It is a weatherbeaten oldfashioned twostoried house that once was no doubt resplendent. George hurls the rock at the house. We see a grumpy old man in shirt sleeves in a rocking chair on the porch. He looks up as he hears the breaking glass. As he talks Mary has been listening intently. She finally stoops down and picks up a rock weighting it in her hand. The old deserted house. Mary throws her rock and once more we hear the sound of breaking glass. Mary looks at him provocatively. then turns and shuffles off down the street singing as she goes. George hurries after her. George joins her in the singing as they proceed down the street. Man on the porch of the house is listening to George and Mary. They have stopped walking and now face one another."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Mickey a young punk who has had one too many is beside him. He takes the key from Mickey and turns the switch. The floor begins to part in the middle each half sliding under the bleacher seats. Pandemonium starts. Dancers begin to scream as they try to get off. Some are so engrossed in dancing they continue at top speed. Teachers and elders start to scurry off. George and Mary are dancing. They mistake the screams for cheers. George and Mary are so busy dancing they do not notice the floor opening. As the floor opens it reveals an attractive lighted swimming pool. He looks up as he hears the breaking glass. As he talks Mary has been listening intently. She finally stoops down and picks up a rock weighting it in her hand. The old deserted house. Mary throws her rock and once more we hear the sound of breaking glass. Mary looks at him provocatively. then turns and shuffles off down the street singing as she goes. George hurries after her. George joins her in the singing as they proceed down the street. Man on the porch of the house is listening to George and Mary. They have stopped walking and now face one another."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Mickey a young punk who has had one too many is beside him. He takes the key from Mickey and turns the switch. The floor begins to part in the middle each half sliding under the bleacher seats. Pandemonium starts. Dancers begin to scream as they try to get off. George hurries after her. George joins her in the singing as they proceed down the street. Man on the porch of the house is listening to George and Mary. They have stopped walking and now face one another."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Ralph, a young wizard who has had one too many, is beside him. She takes the key from Ralph and turns the switch. The floor begins to part in the middle, each half sliding under the bleacher seats. Pandemonium starts. Astronauts begin to scream as they try to get off. Some are so engrossed in dancing they continue at top speed. Rabbits and foxes start to scurry off. Emily and Tom are dancing. They mistake the screams for cheers. Emily and Tom are so busy dancing they don't notice the floor opening. As the floor opens, it reveals an attractive, lighted swimming pool. Spotlights concentrate on them. The crowd is watching Emily and Tom dancing. They move backwards until finally they reach the edge of the floor and fall into the pool below. Emily and Tom are still trying to dance in the water with the crowd on the edge cheering them; some of the crowd leap into the pool; the unicorn tries to restore order, finally clasps his hands like a diver, and leaps in himself. The night is warm with a bright moon. Emily is dressed in a jersey sweater and oversized football pants that keep wanting to come down. Tom is in an old white bathrobe. Each is carrying their wet clothes tied into a bundle that leaves a trail of dripping water. As they near the camera, we hear them singing. The camera moves with them as they proceed down the street. She takes the bundle of clothes from Tom. They stop and look at each other. Tom stops. Emily, to cover her embarrassment, talks quickly on. In her confusion, Emily steps on the end of the belt of Tom's bathrobe, which is trailing along behind him. He gathers the robe around him. She picks up the belt and throws it over his arm. Emily looks after him, then picks up a rock from the street. It is a weather-beaten, old-fashioned two-storied house that once was no doubt resplendent. Emily hurls the rock at the house. We see a cheerful young girl in a sundress in a rocking chair on the porch. She looks up as she hears the breaking glass. As she talks, Tom has been listening intently. He finally stoops down and picks up a rock, weighting it in his hand. The old deserted house. Tom throws his rock, and once more we hear the sound of breaking glass. Tom looks at her provocatively, then turns and shuffles off down the street, singing as he goes. Emily hurries after him. Emily joins him in the singing as they proceed down the street. Parrot on the porch of the house is listening to Emily and Tom. They have stopped walking and now face one another."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Mickey, a young punk who has had one too many, is beside him. He takes the screwdriver from Mickey and turns the dial. The curtains begin to part in the middle, each half sliding under the bleacher seats. Pandemonium starts. Dancers begin to scream as they try to get off. Some are so engrossed in dancing they continue at top speed. Teachers and elders start to scurry off. George and Mary are dancing. They mistake the screams for cheers. George and Mary are so busy dancing they don't notice the curtains opening. As the curtains open, it reveals an attractive, lighted tennis court. Spotlights concentrate on them. The crowd is watching George and Mary dancing. They move backwards until finally they reach the edge of the stage and tumble onto the court below. George and Mary are still trying to dance on the clay with the crowd on the edge cheering them; some of the crowd leap onto the court; the principal tries to restore order, finally clasps his hands like a diver, and leaps onto the court himself. The night is warm with a bright moon. George is dressed in a denim jacket and oversized basketball shorts that keep wanting to come down. Mary is in an old green parka. Each is carrying their wet clothes tied into a sack that leaves a trail of dripping water. As they near the camera, we hear them singing. The camera moves with them as they proceed down the avenue. He takes the sack of clothes from Mary. They stop and look at each other. Mary stops. George, to cover his embarrassment, talks quickly on. In his confusion, George steps on the end of the belt of Mary's parka, which is trailing along behind her. She gathers the parka around her. He picks up the belt and throws it over her arm. George looks after her, then picks up a pebble from the avenue. It is a rundown, old-fashioned two-storied barn that once was no doubt resplendent. George hurls the pebble at the barn. We see a grumpy old man in shirt sleeves in a rocking chair on the porch. He looks up as he hears the breaking glass. As he talks, Mary has been listening intently. She finally stoops down and picks up a pebble, weighing it in her hand. The old deserted barn. Mary throws her pebble, and once more we hear the sound of breaking glass. Mary looks at him provocatively, then turns and shuffles off down the avenue, singing as she goes. George hurries after her. George joins her in the singing as they proceed down the avenue. Man on the porch of the barn is listening to George and Mary. They have stopped walking and now face one another."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Mickey, a young punk who has had one too many, is beside him. He borrows the key from Mickey and ignites the switch. The floor starts to elevate in the middle, each half floating above the bleacher seats. Pandemonium halts. Dancers begin to whisper as they attempt to stay. Some are so engrossed in dancing they linger at a slow pace. Teachers and elders begin to hover aside. George and Mary are dancing. They misunderstand the whispers for cheers. George and Mary are so busy dancing they don't notice the floor rising. As the floor rises, it unveils an attractive, vibrant garden. Spotlights divert from them. The crowd is ignoring George and Mary dancing. They amble forward until finally they approach the edge of the floor and bounce into the garden below. George and Mary are still attempting to dance on the grass with the crowd on the edge booing them; some of the crowd stroll into the garden; the principal tries to restore order, finally clasps his hands like a diver, and strolls in himself. The night is cold with a dim moon. George is dressed in a jersey sweater and oversized football pants that keep wanting to fly up. Mary is in an old white bathrobe. Each is holding their dry clothes tied into a bundle that leaves a trail of fluttering leaves. As they near the camera, we hear them humming. The camera turns with them as they pause down the street. He takes the bundle of clothes from Mary. They pause and glance at each other. Mary pauses. George, to cover his embarrassment, whispers quietly on. In his confusion, George jumps on the end of the belt of Mary's bathrobe, which is trailing along behind her. She tosses the robe around her. He picks up the belt and tosses it over her arm. George looks after her, then picks up a paper from the street. It is a renovated, modern two-storied house that once was no doubt resplendent. George flips the paper at the house. We see a cheerful young man in a T-shirt on a bench on the porch. He looks up as he hears the fluttering paper. As he talks, Mary has been listening casually. She finally kneels down and picks up a feather, weighing it in her hand. The old deserted house. Mary tosses her feather, and once more we hear the sound of fluttering leaves. Mary looks at him bashfully, then turns and waltzes off down the street, humming as she goes. George ambles after her. George joins her in the humming as they linger down the street. Man on the porch of the house is overhearing George and Mary. They have stopped standing and now turn away from one another."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Roland, a seasoned sailor who has had one too many, is beside him. He takes the map from Roland and turns the dial. The ceiling begins to part in the middle, each half sliding under the picnic tables. Chaos starts. Bakers begin to scream as they try to get off. Some are so engrossed in baking they continue at top speed. Farmers and tourists start to scurry off. Lucy and Henry are singing. They mistake the screams for applause. Lucy and Henry are so busy singing they don't notice the ceiling opening. As the ceiling opens, it reveals an attractive, lighted tennis court. Lanterns concentrate on them. The orchestra is watching Lucy and Henry singing. They move backwards until finally they reach the edge of the ceiling and tumble onto the court below. Lucy and Henry are still trying to sing in the arena with the orchestra on the edge applauding them; some of the orchestra leap into the court; the janitor tries to restore order, finally clasps his hands like a swimmer, and leaps in himself. The morning is vibrant with a bright sun. Lucy is dressed in a jersey hoodie and oversized basketball shorts that keep wanting to come down. Henry is in an old blue kimono. Each is carrying their dry towels tied into a bundle that leaves a trail of billowing dust. As they near the sculpture, we hear them humming. The sculpture moves with them as they proceed down the avenue. He takes the bundle of towels from Lucy. They stop and gaze at each other. Lucy stops. Henry, to cover his embarrassment, talks rapidly on. In his confusion, Henry steps on the end of the cord of Lucy's kimono, which is trailing along behind her. She gathers the kimono around her. He picks up the cord and drapes it over her shoulder. Henry looks after her, then picks up a leaf from the avenue. It is a weather-beaten, old-fashioned two-storied gazebo that once was no doubt splendid. Henry hurls the leaf at the gazebo. We see a cheerful young boy in overalls in a hammock on the patio. He looks up as he hears the cracking wood. As he talks, Lucy has been listening intently. She finally stoops down and picks up a leaf, weighing it in her hand. The old deserted gazebo. Lucy throws her leaf, and once more we hear the sound of cracking wood. Lucy looks at him playfully, then turns and skips off down the avenue, humming as she goes. Henry rushes after her. Henry joins her in the humming as they proceed down the avenue. Girl on the patio of the gazebo is listening to Henry and Lucy. They have stopped skipping and now face one another."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Bobby, a curious cat who has had one too many, is beside him. He grabs the key from Bobby and flips the switch. The ceiling begins to part in the middle, each half sliding under the bleacher seats. Pandemonium erupts. Drummers begin to wail as they try to get off. Some are so engrossed in drumming they continue at top speed. Bakers and children start to scuttle off. Steve and Alice are drumming. They mistake the wails for applause. Steve and Alice are so busy drumming they don't notice the ceiling opening. As the ceiling opens, it reveals an attractive, lighted soccer field. Spotlights focus on them. The crowd is watching Steve and Alice drumming. They move backwards until finally they reach the edge of the ceiling and tumble into the field below. Steve and Alice are still trying to drum in the grass with the crowd on the edge applauding them; some of the crowd tumble into the field; the security guard tries to restore calm, finally claps his hands like a barker, and tumbles in himself. The evening is cool with a bright comet. Steve is dressed in a plaid shirt and oversized basketball shorts that keep wanting to slip down. Alice is in an old yellow raincoat. Each is carrying their wet clothes tied into a parcel that leaves a trail of dripping water. As they near the camera, we hear them humming. The camera moves with them as they proceed up the hill. He grabs the parcel of clothes from Alice. They pause and look at each other. Alice pauses. Steve, to cover his embarrassment, jabbers quickly on. In his confusion, Steve steps on the end of the hem of Alice’s raincoat, which is trailing along behind her. She gathers the coat around her. He picks up the hem and drapes it over her shoulder. Steve looks after her, then picks up a pebble from the grass. It is a weather-beaten, old-fashioned two-storied barn that once was no doubt grand. Steve tosses the pebble at the barn. We see a grumpy old woman in an apron in a rocking chair on the porch. She looks up as she hears the shattering wood. As she talks, Alice has been listening intently. She finally bends down and picks up a pebble, weighing it in her hand. The old abandoned barn. Alice tosses her pebble, and once more we hear the sound of shattering wood. Alice looks at him provocatively, then turns and tiptoes off down the path, humming as she goes. Steve scurries after her. Steve joins her in the humming as they proceed up the path. Woman on the porch of the barn is listening to Steve and Alice. They have stopped moving and now face one another."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Mickey, a young punk who has had one too many, is beside him. He takes the spoon from Mickey and flips the switch. The ceiling begins to part in the middle, each half sliding under the bookshelf. Chaos starts. Dancers begin to whisper as they try to get out. Some are so preoccupied with singing they continue at full volume. Teachers and elders start to tiptoe out. George and Mary are singing. They mistake the whispers for murmurs of appreciation. George and Mary are so busy singing they don't notice the ceiling opening. As the ceiling opens, it reveals an attractive, lighted garden. Searchlights focus on them. The crowd is watching George and Mary singing. They move sideways until finally they reach the edge of the ceiling and float into the garden below. George and Mary are still trying to sing in the air with the crowd on the edge applauding them; some of the crowd float into the garden; the principal tries to restore order, finally claps his hands like a performer, and floats down himself. The night is warm with a bright moon. George is dressed in a denim jacket and oversized marching band pants that keep wanting to come up. Mary is in an old red poncho. Each is carrying their dry shoes tied into a bundle that leaves a trail of billowing dust. As they near the camera, we hear them humming. The camera floats with them as they proceed down the alley. He takes the bundle of shoes from Mary. They stop and glance at each other. Mary stops. George, to cover his awkwardness, chats quickly on. In his confusion, George steps on the end of the scarf of Mary's poncho, which is trailing behind her. She gathers the poncho around her. He picks up the scarf and drapes it over her shoulder. George looks after her, then picks up a feather from the alley. It is a weather-beaten, old-fashioned two-storied barn that once was no doubt magnificent. George hurls the feather at the barn. We see a grumpy old woman in slippers in a hammock on the porch. She looks up as she hears the fluttering wings. As she comments, Mary has been listening attentively. She finally stoops down and picks up a feather, weighing it in her hand. The old deserted barn. Mary flings her feather, and once more we hear the sound of fluttering wings. Mary looks at him teasingly, then turns and strides off down the alley, humming as she goes. George dashes after her. George joins her in the humming as they proceed down the alley. Woman on the porch of the barn is listening to George and Mary. They have stopped strolling and now glance at one another."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Buster, an old pirate who has had one too many, is beside him. He grabs the umbrella from Buster and activates the button. The ground begins to fragment in the middle, each half tunneling beneath the mountain rocks. Chaos erupts. Singers begin to wail as they attempt to climb out. Some are so enthralled in singing they persist at top volume. Farmers and youths begin to dash off. Oliver and Sarah are singing. They mistake the wails for applause. Oliver and Sarah are so engaged in singing they fail to notice the ground splitting. As the ground divides, it reveals a majestic, illuminated pond. Spotlights focus on them. The audience is observing Oliver and Sarah singing. They glide forwards until eventually they reach the rim of the ground and tumble into the pond below. Oliver and Sarah are still attempting to sing in the water with the audience on the edge applauding them; part of the audience dives into the pond; the judge tries to impose calm, eventually folds his arms like a penguin, and swims in himself. The day is cool with a dim sun. Oliver is clad in a silk vest and oversized hockey trousers that keep yearning to slide down. Sarah is in an old brown trench coat. Each is wielding their drenched books tied into a sack that leaves a trail of trickling ink. As they approach the camera, we hear them humming. The camera tracks with them as they stroll down the avenue. He takes the sack of books from Sarah. They pause and gaze at one another. Sarah pauses. Oliver, to hide his awkwardness, chatters rapidly on. In his bewilderment, Oliver stomps on the end of the rope of Sarah's trench coat, which is dragging along behind her. She gathers the coat around her. He picks up the rope and tosses it over her shoulder. Oliver looks after her, then lifts a pine cone from the avenue. It is a crumbling, old-fashioned four-storied barn that once was certainly grand. Oliver flings the pine cone at the barn. We see a cheerful young woman in a raincoat in a hammock on the verandah. She looks up as she hears the shattering pottery. As she talks, Sarah has been watching closely. She eventually crouches down and grabs a pine cone, weighing it in her hand. The old deserted barn. Sarah pitches her pine cone, and once more we hear the clang of shattering pottery. Sarah looks at him enticingly, then spins and strolls off down the avenue, humming as she goes. Oliver sprints after her. Oliver joins her in the humming as they meander down the avenue. Woman on the verandah of the barn is listening to Oliver and Sarah. They have ceased walking and now gaze at one another."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Mickey, a young punk, takes the key and turns the switch, opening the floor beneath dancers. As pandemonium ensues, George and Mary, mistaking screams for cheers, continue dancing until they fall into a revealed pool. They keep dancing in the water, joined by cheering onlookers and the principal. Later, dressed in wet clothes, George and Mary walk down the street singing. George, embarrassed, steps on Mary's trailing bathrobe belt, which he throws over her arm. He then throws a rock at an old house, breaking a window, prompting Mary to join in. As they walk away singing, a man on the porch watches them."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "They have stopped walking and now face one another Man on the porch of the house is listening to George and Mary George joins her in the singing as they proceed down the street George hurries after her then turns and shuffles off down the street singing as she goes Mary looks at him provocatively Mary throws her rock and once more we hear the sound of breaking glass The old deserted house She finally stoops down and picks up a rock weighting it in her hand As he talks Mary has been listening intently He looks up as he hears the breaking glass We see a grumpy old man in shirt sleeves in a rocking chair on the porch George hurls the rock at the house It is a weatherbeaten oldfashioned twostoried house that once was no doubt resplendent George looks after her then picks up a rock from the street He picks up the belt and throws it over her arm She gathers the robe around her In his confusion George steps on the end of the belt of Mary's bathrobe which is trailing along behind her Mary stops George to cover his embarrassment talks quickly on They stop and look at each other He takes the bundle of clothes from Mary The camera moves with them as they proceed down the street As they near the camera we hear them singing Each is carrying their wet clothes tied into a bundle that leaves a trail of dripping water Mary is in an old white bathrobe George is dressed in a jersey sweater and oversized football pants that keep wanting to come down The night is warm with a bright moon the principal tries to restore order finally clasps his hands like a diver and leaps in himself some of the crowd leap into the pool George and Mary are still trying to dance in the water with the crowd on the edge cheering them They move backwards until finally they reach the edge of the floor and fall into the pool below The crowd is watching George and Mary dancing Spotlights concentrate on them As the floor opens it reveals an attractive lighted swimming pool George and Mary are so busy dancing they do not notice the floor opening They mistake the screams for cheers George and Mary are dancing Teachers and elders start to scurry off Some are so engrossed in dancing they continue at top speed Dancers begin to scream as they try to get off Pandemonium starts The floor begins to part in the middle each half sliding under the bleacher seats He takes the key from Mickey and turns the switch Mickey a young punk who has had one too many is beside him"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "George and Mary are so busy dancing they do not notice the floor opening Pandemonium starts As the floor opens it reveals an attractive lighted swimming pool He looks up as he hears the breaking glass then turns and shuffles off down the street singing as she goes George is dressed in a jersey sweater and oversized football pants that keep wanting to come down George hurls the rock at the house In his confusion George steps on the end of the belt of Mary's bathrobe which is trailing along behind her Dancers begin to scream as they try to get off She finally stoops down and picks up a rock weighting it in her hand He takes the bundle of clothes from Mary Spotlights concentrate on them It is a weatherbeaten oldfashioned twostoried house that once was no doubt resplendent As they near the camera we hear them singing The crowd is watching George and Mary dancing Mary stops George to cover his embarrassment talks quickly on Mary throws her rock and once more we hear the sound of breaking glass Mary looks at him provocatively He picks up the belt and throws it over her arm They move backwards until finally they reach the edge of the floor and fall into the pool below They stop and look at each other Each is carrying their wet clothes tied into a bundle that leaves a trail of dripping water The camera moves with them as they proceed down the street George looks after her then picks up a rock from the street They have stopped walking and now face one another Mickey a young punk who has had one too many is beside him Mary is in an old white bathrobe the principal tries to restore order finally clasps his hands like a diver and leaps in himself Man on the porch of the house is listening to George and Mary The old deserted house We see a grumpy old man in shirt sleeves in a rocking chair on the porch George joins her in the singing as they proceed down the street The floor begins to part in the middle each half sliding under the bleacher seats She gathers the robe around her Some are so engrossed in dancing they continue at top speed As he talks Mary has been listening intently Teachers and elders start to scurry off They mistake the screams for cheers George and Mary are still trying to dance in the water with the crowd on the edge cheering them some of the crowd leap into the pool The night is warm with a bright moon He takes the key from Mickey and turns the switch George and Mary are dancing George hurries after her"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The camera moves with them as they proceed down the street He takes the bundle of clothes from Mary They stop and look at each other Mary stops George to cover his embarrassment talks quickly on In his confusion George steps on the end of the belt of Mary's bathrobe which is trailing along behind her She gathers the robe around her He picks up the belt and throws it over her arm George looks after her then picks up a rock from the street It is a weatherbeaten oldfashioned twostoried house that once was no doubt resplendent George hurls the rock at the house We see a grumpy old man in shirt sleeves in a rocking chair on the porch He looks up as he hears the breaking glass As he talks Mary has been listening intently She finally stoops down and picks up a rock weighting it in her hand The old deserted house Mary throws her rock and once more we hear the sound of breaking glass Mary looks at him provocatively then turns and shuffles off down the street singing as she goes George hurries after her George joins her in the singing as they proceed down the street Man on the porch of the house is listening to George and Mary They have stopped walking and now face one another Mickey a young punk who has had one too many is beside him He takes the key from Mickey and turns the switch The floor begins to part in the middle each half sliding under the bleacher seats Pandemonium starts Dancers begin to scream as they try to get off Some are so engrossed in dancing they continue at top speed Teachers and elders start to scurry off George and Mary are dancing They mistake the screams for cheers George and Mary are so busy dancing they do not notice the floor opening As the floor opens it reveals an attractive lighted swimming pool Spotlights concentrate on them The crowd is watching George and Mary dancing They move backwards until finally they reach the edge of the floor and fall into the pool below George and Mary are still trying to dance in the water with the crowd on the edge cheering them some of the crowd leap into the pool the principal tries to restore order finally clasps his hands like a diver and leaps in himself The night is warm with a bright moon George is dressed in a jersey sweater and oversized football pants that keep wanting to come down Mary is in an old white bathrobe Each is carrying their wet clothes tied into a bundle that leaves a trail of dripping water As they near the camera we hear them singing"
        }
      ]
    }
  ]
}