{
  "ground_truth": "Everett gives her an ingratiating laugh and ostentatiously fans some of his money, while she watches him do so. The big man, who appears as she leaves, stops chewing and slowly raises his napkin to his lips to give them a dainty pat. Big Dan chuckles as he draws up a chair, and Everett rises and digs in his pocket. As the three men start to move off, Big Dan gives Delmar a tilt of the head and a crinkling smile. Meanwhile, Pappy O'Daniel sits smoking a cigar, nursing a glass of whiskey, and soliciting the counsel of his overweight retinue, narrowing his eyes at him, wondering what he's getting at. Pappy whips off his hat and slaps at Junior with it, glaring around the table, as Eckard grunts and starts to rise, only for Pappy to whip him back down with his hat. Eckard, upon settling back, looks around the table and helpfully relays information. The car boosted from the general store has been pulled off the road and parked a few yards into a field littered with bluebonnets and rimmed with moss-dripping oak, where Everett, Delmar, and Big Dan sit on a blanket around a large picnic hamper. Big Dan is just sucking the last piece of chicken off a bone, tossing the bone over his shoulder, belching, and sighing. Delmar is pleased and embarrassed, rising to his feet and tossing down his napkin. He reaches up and with one hand easily rips a stout limb off a tree, casually stripping its twigs. He swings at Delmar, who staggers back with a grunt, as Everett wears a puzzled smile. Though stunned, Delmar is faster to size things up and charges Big Dan, wrapping his arms around him. Big Dan rears back and whacks at his head, while Everett remains puzzled but willing to be instructed. Big Dan walks awkwardly over to Everett with Delmar still attached to him like a hunting dog locked onto a bear, taking a break from whacking at Delmar to deliver a blow to Everett, which catches him on the chin and sends him reeling. Big Dan bear hugs Delmar and tosses him away, whacking Everett into a semi-conscious heap and then pawing through his pockets. He walks over to Delmar, who is on the ground moaning, and kicks him several times, taking Delmar's shoebox and flipping off the top to reveal a bed of straw with the toad resting on it. He pokes around the straw with his finger, finding nothing else inside, as Delmar, moaning, looks blearily up through swollen eyes. Big Dan has the toad in his enormous fist, and Delmar moans through cracked and bloody lips as Big Dan squeezes the frog, crushing it, and tosses it away against a tree.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Everett provides her an sycophantic chuckle and showily waves some of his cash, while she observes him perform so. The large man, who seems as she departs, pauses munching and gradually lifts his serviette to his mouth to offer them a delicate dab. Big Dan guffaws as he pulls up a seat, and Everett stands and rummages in his pouch. As the three males begin to move off, Big Dan gives Delmar a nod and a crinkling grin. Meanwhile, Pappy O'Daniel sits puffing a cigar, nursing a glass of whiskey, and requesting the advice of his obese entourage, narrowing his eyes at him, pondering what he's driving at. Pappy jerks off his cap and slaps at Junior with it, glowering around the table, as Eckard groans and starts to rise, only for Pappy to yank him back down with his cap. Eckard, upon settling back, glances around the table and usefully conveys intelligence. The automobile pilfered from the general shop has been pulled off the road and placed a few yards into a field strewn with bluebonnets and bordered with moss-dripping oak, where Everett, Delmar, and Big Dan sit on a blanket around a large picnic basket. Big Dan is just sucking the final piece of poultry off a bone, tossing the bone over his shoulder, belching, and sighing. Delmar is satisfied and abashed, rising to his feet and throwing down his napkin. He reaches up and with one hand effortlessly tears a sturdy limb off a tree, nonchalantly stripping its branches. He swings at Delmar, who staggers back with a groan, as Everett wears a confused grin. Though shocked, Delmar is quicker to evaluate things and charges Big Dan, wrapping his arms around him. Big Dan rears back and strikes at his head, while Everett remains confused but willing to be guided. Big Dan walks clumsily over to Everett with Delmar still attached to him like a hunting canine locked onto a bear, taking a pause from striking at Delmar to deliver a hit to Everett, which catches him on the jaw and sends him staggering. Big Dan bear hugs Delmar and throws him away, striking Everett into a semi-conscious pile and then rummaging through his pockets. He walks over to Delmar, who is on the ground groaning, and kicks him several times, taking Delmar's shoebox and flipping off the top to reveal a bed of straw with the toad resting on it. He pokes around the straw with his finger, finding nothing else inside, as Delmar, groaning, looks blearily up through swollen eyes. Big Dan has the toad in his gigantic fist, and Delmar moans through cracked and bloody lips as Big Dan compresses the toad, crushing it, and tosses it away against a tree."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Her was given an ingratiating laugh by Everett, and some of his money was ostentatiously fanned by him, while he is watched by her do so. The big man appears as she leaves, and chewing is stopped by him as a napkin is slowly raised to his lips to give them a dainty pat. A chair is drawn up by Big Dan, and a chuckle is given by him, while Everett rises and digs in his pocket. Delmar is given a tilt of the head and a crinkling smile by Big Dan, as the three men start to move off. Meanwhile, a cigar is smoked by Pappy O'Daniel, who nurses a glass of whiskey and solicits the counsel of his overweight retinue, narrowing his eyes at him and wondering what he's getting at. His hat is whipped off by Pappy, and Junior is slapped with it by him, glaring around the table, as Eckard grunts and starts to rise, only for him to be whipped back down by Pappy with his hat. Settling back, Eckard looks around the table and relays information helpfully. The car was boosted from the general store, and it has been pulled off the road and parked a few yards into a field littered with bluebonnets and rimmed with moss-dripping oak, where a blanket is sat on by Everett, Delmar, and Big Dan around a large picnic hamper. The last piece of chicken has just been sucked off a bone by Big Dan, who tosses the bone over his shoulder, belches, and sighs. Delmar, pleased and embarrassed, rises to his feet and tosses down his napkin. A stout limb is easily ripped off a tree by him with one hand, stripping its twigs casually. Delmar is swung at by him, who staggers back with a grunt, as a puzzled smile is worn by Everett. Though stunned, things are faster sized up by Delmar, who charges Big Dan, and around him, his arms are wrapped. The head is whacked at by Big Dan, while Everett, remaining puzzled, is willing to be instructed. With Delmar still attached to him like a hunting dog locked onto a bear, Everett is awkwardly walked over to by Big Dan, taking a break from whacking at Delmar to deliver a blow, which catches Everett on the chin and sends him reeling. A bear hug is given to Delmar by Big Dan, who tosses him away, whacking Everett into a semi-conscious heap and then pawing through his pockets. Over to Delmar, Big Dan walks, who is on the ground moaning, and Delmar is kicked several times by him, taking Delmar's shoebox and flipping off the top to reveal a bed of straw with the toad resting on it. Around the straw is poked by his finger, finding nothing else inside, as Delmar, moaning, blearily looks up through swollen eyes. The toad is held in his enormous fist by Big Dan, and Delmar moans through cracked and bloody lips as the frog is squeezed, crushed by Big Dan, and tossed away against a tree."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Everett gives her a fawning laugh and ostentatiously fans his money. As she departs, a big man stops chewing, raises his napkin, and delicately pats his lips. Big Dan laughs, pulls up a chair, and Everett digs into his pocket. As they move off, Big Dan tilts his head and smiles at Delmar. Meanwhile, Pappy O'Daniel smokes a cigar, sips whiskey, and considers his overweight retinue, narrowing his eyes in thought. He removes his hat, smacks Junior, and snaps it at Eckard, who grunts, then helpfully shares information. The car stolen from the store is hidden in a field with bluebonnets and oak, where Everett, Delmar, and Big Dan sit with a picnic. Big Dan finishes a chicken bone, belches, and sighs. Delmar, embarrassed yet pleased, stands, rips a limb off a tree, and strips its twigs. He swings at Delmar, who grunts and staggers, while Everett smiles puzzledly. Delmar quickly assesses and charges Big Dan, wrapping his arms around him. Big Dan rears back, strikes Delmar, and awkwardly moves toward Everett, who is struck and reeled. Big Dan tosses Delmar away, knocks out Everett, and searches their pockets. He kicks Delmar, taking a shoebox which holds a toad on straw. Delmar, moaning, watches as Big Dan crushes the toad and discards it against a tree."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Everett laughs ingratiatingly, flaunting his money as she watches. A big man appears, stops chewing, and delicately pats his lips with a napkin. Big Dan chuckles, takes a chair, as Everett digs in his pocket. The men move off, Big Dan nodding and smiling at Delmar. Pappy O'Daniel, smoking a cigar and drinking whiskey, seeks advice from his overweight retinue, glaring and slapping Junior with his hat. Eckard rises, only to be seated again by Pappy's hat, then relays information. The car from the general store is parked in a bluebonnet field, where Everett, Delmar, and Big Dan sit picnicking. Big Dan finishes chicken, tossing the bone, belches, and sighs. Embarrassed, Delmar rises, tosses his napkin, rips a tree limb, and swings at Delmar, who dodges, while Everett looks puzzled. Delmar charges Big Dan, who strikes back, Everett remaining puzzled but willing. Big Dan walks to Everett with Delmar attached, then hits Everett, sending him reeling. Big Dan tosses Delmar and hits Everett, pawing through his pockets. He kicks moaning Delmar, takes his shoebox, revealing a toad on straw. Finding nothing, Big Dan crushes the toad and tosses it away."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Everett, with a noticeable flourish, gives her an ingratiating laugh and makes a show of fanning out some of his money, all while she stands by, observing his actions with an air of bemused interest. Nearby, a large man, whose presence becomes apparent as she departs, momentarily halts his chewing and, with deliberate care, gently raises his napkin to his lips to give them a delicate pat. Displaying a jovial demeanor, Big Dan chuckles heartily as he draws up a chair, prompting Everett to rise from his seat and delve into his pocket. As the trio of men begins to move away, Big Dan acknowledges Delmar with a subtle tilt of the head along with a crinkling, friendly smile. Meanwhile, Pappy O'Daniel, seated in a contemplative manner, is leisurely smoking a cigar and nursing a glass of whiskey. He solicits the advice of his corpulent entourage, narrowing his eyes in scrutiny as he tries to decipher what Pappy is hinting at. In a sudden, sharp gesture, Pappy whips off his hat and gives Junior a playful slap with it, his eyes darting around the table. Eckard grunts as he starts to rise from his seat, only for Pappy to assertively push him back down with his hat. Settling back into his chair, Eckard glances around the table, taking stock of the situation, and dutifully conveys pertinent information. In the meantime, the car, which had been opportunistically taken from the general store, has been discreetly pulled off the road and parked a short distance into a field. This field is scattered with colorful bluebonnets and is bordered by majestic oak trees dripping with moss. Here, Everett, Delmar, and Big Dan are comfortably seated on a blanket around a generously stocked picnic hamper. Big Dan, having just polished off the last succulent piece of chicken, nonchalantly tosses the bone over his shoulder, belches with satisfaction, and sighs contentedly. Delmar, feeling both pleased and slightly embarrassed, rises to his feet and tosses down his napkin. With a single motion, he easily reaches up and rips a stout limb from a tree, casually stripping it of its twigs. He swings it at Delmar, who staggers backward with a surprised grunt, as Everett watches on with a puzzled smile. Although initially stunned, Delmar quickly assesses the situation and charges Big Dan, wrapping his arms tightly around him. As Big Dan rears back and strikes at his head, Everett remains confused but open to learning from the unfolding events. In an awkward display, Big Dan maneuvers over to Everett while Delmar remains latched onto him like a determined hunting dog clinging to a bear. Taking a moment's reprieve from striking Delmar, Big Dan lands a powerful blow on Everett, hitting him squarely on the chin and sending him reeling. With formidable strength, Big Dan bear-hugs Delmar, tossing him away effortlessly, then delivers a strike to Everett, leaving him in a semi-conscious heap before rifling through his pockets. He then strides over to Delmar, who is sprawled on the ground moaning, and delivers several swift kicks, confiscating Delmar's shoebox. Flipping off the top, he reveals a bed of straw inside, with a toad resting innocuously upon it. Big Dan investigates the straw with his finger, finding nothing of interest within, as Delmar peers up through swollen, blurry eyes. Holding the toad in his enormous fist, Big Dan seems unimpressed and, amid Delmar's cracked and bloody-lipped moans, he mercilessly squeezes the frog, ultimately crushing it and tossing it unceremoniously against a nearby tree."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Everett, in his signature dramatic style, bestows upon her an ingratiating laugh, making quite the show as he flamboyantly spreads out some of his money. All the while, she stands by, watching his actions with an expression marked by a bemused interest. Not far off, there looms a large man, whose presence suddenly becomes noticeable as she makes her exit. He momentarily pauses his chewing and, with deliberate care, gently raises his napkin to his lips, giving them a delicate and considerate pat. Displaying a jovial and merry demeanor, Big Dan lets out a hearty chuckle as he draws up a chair, which prompts Everett to rise from his own seat and delve into the depths of his pocket. As the trio of men starts to move away, Big Dan acknowledges Delmar with a subtle tilt of his head and accompanies it with a friendly, crinkling smile. Meanwhile, Pappy O'Daniel, seated in a contemplative and thoughtful manner, leisurely enjoys smoking a cigar while also nursing a glass of whiskey. He solicits the advice of his corpulent entourage, narrowing his eyes in deep scrutiny as he earnestly tries to decipher the hints and insinuations in Pappy's words. In a sudden and sharp gesture, Pappy whips off his hat and gives Junior a playful slap with it while his eyes dart around the table, assessing the reactions. Eckard grunts as he begins to rise from his seat, only for Pappy to assertively and decisively push him back down with his hat. Settling back into his chair, Eckard takes a moment to glance around the table, taking stock of the situation and dutifully conveying pertinent information. Meanwhile, the car, which had been opportunistically appropriated from the general store, has been discreetly pulled off the road and parked a short distance into a wide-open field. This field is delightfully scattered with colorful bluebonnets and bordered by majestic oak trees draped in an enchanting curtain of moss. Here, Everett, Delmar, and Big Dan find themselves comfortably seated on a blanket, surrounding a generously stocked picnic hamper. Big Dan, having just polished off the last succulent piece of chicken, nonchalantly tosses the bone over his shoulder, emitting a belch of satisfaction, and lets out a contented sigh. Delmar, feeling both pleased and slightly embarrassed, rises to his feet and tosses down his napkin. With a single fluid motion, he effortlessly reaches up and rips a stout limb from a nearby tree, casually stripping it of its spindly twigs. He swings it at Delmar, who staggers backward with a surprised grunt, while Everett watches on with a puzzled smile etched upon his face. Although initially stunned, Delmar quickly assesses the evolving situation and charges at Big Dan, wrapping his arms tightly around him with determination. As Big Dan rears back and sends a strike toward his head, Everett remains standing, bewildered yet open to learning from the unfolding chaotic events. In an awkward but determined display, Big Dan maneuvers himself over to Everett while Delmar tenaciously clings to him, reminiscent of a determined hunting dog grasping onto a bear. Taking a moment's reprieve from striking Delmar, Big Dan lands a powerful blow on Everett, hitting him squarely on the chin and sending him reeling backward. With formidable strength, Big Dan then bear-hugs Delmar, tossing him away effortlessly, and delivers another strike to Everett, leaving him in a semi-conscious heap before rifling through his pockets. He strides over to where Delmar lies sprawled on the ground, moaning in pain, and delivers several swift and decisive kicks, confiscating Delmar's shoebox in the process. Flipping off the top with a quick flick, he reveals a bed of straw inside, with a toad resting innocuously upon it. Big Dan investigates the straw, probing it with his finger and finding nothing of interest as Delmar peers up through swollen and blurry eyes. Holding the toad in his enormous fist, Big Dan appears unimpressed and, amid Delmar's cracked and bloody-lipped moans, he mercilessly squeezes the frog, ultimately crushing it and tossing it unceremoniously against a nearby tree without a second thought."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Everett, with a deliberate display of charm, directs an ingratiating laugh towards her, ensuring his gestures capture her attention as he ostentatiously fans out some of his money, with her eyes fixed on him. As she exits the scene, the large man who has just appeared momentarily interrupts his chewing to slowly lift a napkin to his lips, carefully giving them a dainty pat. Next, Big Dan lets out a chuckle while pulling up a chair, prompting Everett to rise from his seat and dig into his pocket with a sense of purpose. As the three men begin to depart, Big Dan subtly acknowledges Delmar with a tilt of his head accompanied by a crinkling smile. In another part of the scene, Pappy O'Daniel sits comfortably, puffing away on a cigar while cradling a glass of whiskey, seeking the advice of his overweight retinue with narrowed eyes, scrutinizing his audience as he ponders their potential responses. In a sudden motion, Pappy briskly removes his hat and uses it to slap Junior, his gaze fiery as he scans around the table. Shortly after, Eckard grunts and makes an attempt to rise, only for Pappy to swiftly pull him back down using the same hat. Once back in his seat, Eckard surveys those gathered at the table and dutifully conveys pertinent information, pointing out that the car taken from the general store has now been discreetly parked off the road, nestled a few yards into a field adorned with bluebonnets and encircled by oak trees draped in moss. Here, Everett, Delmar, and Big Dan are comfortably seated on a blanket surrounding a large picnic hamper. Big Dan, having just finished sucking the last morsel of chicken off a bone, nonchalantly tosses the bone over his shoulder, follows it with a hearty belch, and releases a contented sigh. Feeling both pleased and slightly embarrassed, Delmar stands up, discards his napkin, and in a show of casual strength, reaches up with one hand to effortlessly tear a sturdy limb from a tree, stripping it of its twigs with ease. As he swings the limb towards Delmar, who instinctively staggers back with a grunt, Everett remains with a puzzled smile, trying to comprehend the unfolding chaos. Although initially stunned, Delmar quickly assesses the situation and charges at Big Dan, attempting to subdue him by wrapping his arms tightly around him. In response, Big Dan rears back and strikes Delmar's head, while Everett continues to watch with a puzzled but receptive demeanor. With Delmar still clinging to him like a persistent hunting dog on a bear, Big Dan awkwardly maneuvers over to Everett and pauses his assault on Delmar to deliver a powerful blow to Everett’s chin, sending him reeling. Maintaining control, Big Dan encircles Delmar in a bear hug and forcefully tosses him aside, then turns his attention to Everett, hitting him into a semi-conscious heap before proceeding to rummage through his pockets. Moving over to the moaning Delmar, who is sprawled on the ground, Big Dan delivers several kicks, seizing Delmar's shoebox and flicking off its top to uncover a nest of straw with a toad nestled on it. As he probes the straw with his finger, finding nothing else of interest, Delmar, through swollen eyes and moans, watches helplessly as Big Dan takes hold of the toad in his massive fist. Despite Delmar's pained protests through cracked and bloody lips, Big Dan mercilessly squeezes the frog, ultimately crushing it, and then carelessly hurls it away against a tree."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Everett tries to impress with a flashy display of money while a woman observes him. As she departs, a large man momentarily interrupts his meal to delicately dab his lips and then shares a chuckle with Big Dan, who joins the group. Everett stands and digs into his pocket as Big Dan signals Delmar with a friendly nod. Simultaneously, Pappy O'Daniel, smoking a cigar and sipping whiskey, consults his advisors with suspicion. He playfully reprimands Junior by swatting him with his hat, causing an advisor, Eckard, to rise only to be playfully pushed back into his seat, where he shares some information. Meanwhile, Everett, Delmar, and Big Dan park a stolen car nearby and settle on a blanket for a picnic, where Big Dan finishes his meal with a belch. Delmar, feeling both pleased and awkward, stands and tears a branch from a tree, prompting Big Dan to swing at him, causing Delmar to stagger. Delmar quickly retaliates by charging Big Dan, who hits back at him and then at Everett, leaving both dazed. Big Dan, with Delmar clinging to him, delivers a blow to Everett, knocking him down. He then overpowers Delmar, searches Everett’s pockets, kicks the moaning Delmar, and discovers his shoebox containing a toad. With deliberate cruelty, Big Dan crushes the toad, discarding it against a tree, as Delmar watches helplessly through swollen eyes."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Everett gives her an ingratiating laugh and ostentatiously fans some of his money, perhaps a display meant to impress, while she watches him do so. The big man, who appears as she leaves the dimly lit room in a scene reminiscent of a 1930s speakeasy, stops chewing and slowly raises his napkin, an embroidered cloth that hints at a touch of class, to his lips to give them a dainty pat. Big Dan chuckles as he draws up a chair, an antique wooden piece that creaks under his weight, and Everett rises and digs in his pocket. As the three men start to move off, Big Dan gives Delmar a tilt of the head and a crinkling smile, a gesture conveying camaraderie. Meanwhile, Pappy O'Daniel sits smoking a cigar, one imported from Cuba, nursing a glass of whiskey, known for its smoky flavor, and soliciting the counsel of his overweight retinue, narrowing his eyes at him, wondering what he's getting at. Pappy, governor of Mississippi in this narrative rooted in Southern political culture, whips off his hat and slaps at Junior with it, glaring around the table, as Eckard grunts and starts to rise, only for Pappy to whip him back down with his hat, a broad-brimmed Stetson iconic of Southern gentlemen. Eckard, upon settling back, looks around the table and helpfully relays information. The car boosted from the local general store, a classic Ford Model A, has been pulled off the road and parked a few yards into a field littered with Texas bluebonnets and rimmed with moss-dripping oak trees, where Everett, Delmar, and Big Dan sit on a plaid blanket around a large picnic hamper. Big Dan is just sucking the last piece of Southern fried chicken off a bone, tossing the bone over his shoulder, belching, and sighing contentedly. Delmar is pleased and embarrassed, rising to his feet and tossing down his gingham napkin. He reaches up and with one hand easily rips a stout limb off a tree, casually stripping its twigs, showcasing surprising strength. He swings at Delmar, who staggers back with a grunt, as Everett wears a puzzled smile. Though stunned, Delmar is faster to size things up and charges Big Dan, wrapping his arms around him in a bear hug reminiscent of a wrestling move. Big Dan rears back and whacks at his head, while Everett remains puzzled but willing to be instructed, similar to a student in a bizarre lesson. Big Dan walks awkwardly over to Everett with Delmar still attached to him like a hunting dog locked onto a bear, taking a break from whacking at Delmar to deliver a blow to Everett, which catches him on the chin and sends him reeling. Big Dan bear hugs Delmar and tosses him away, whacking Everett into a semi-conscious heap and then pawing through his pockets like a pickpocket at a country fair. He walks over to Delmar, who is on the ground moaning, and kicks him several times, taking Delmar's shoebox and flipping off the top to reveal a bed of straw with the toad resting on it, a creature Delmar perhaps considers a pet or talisman. He pokes around the straw with his finger, finding nothing else inside, as Delmar, moaning, looks blearily up through swollen eyes. Big Dan has the toad in his enormous fist, and Delmar moans through cracked and bloody lips as Big Dan squeezes the frog, crushing it with disturbing ease, and tosses it away against a tree, its lifeless body landing in the shaded undergrowth."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Everett gives her an ingratiating laugh and ostentatiously fans some of his money while she watches him do so. The big man who appears as she leaves stops chewing and slowly raises his napkin to his lips to give them a dainty pat. Big Dan chuckles as he draws up a chair and Everett rises and digs in his pocket. As the three men start to move off Big Dan gives Delmar a tilt of the head and a crinkling smile. Meanwhile Pappy O'Daniel sits smoking a cigar nursing a glass of whiskey and soliciting the counsel of his overweight retinue narrowing his eyes at him wondering what he is getting at. Pappy whips off his hat and slaps at Junior with it glaring around the table as Eckard grunts and starts to rise only for Pappy to whip him back down with his hat. Eckard upon settling back looks around the table and helpfully relays information. The car boosted from the general store has been pulled off the road and parked a few yards into a field littered with bluebonnets and rimmed with mossdripping oak where Everett Delmar and Big Dan sit on a blanket around a large picnic hamper. Big Dan is just sucking the last piece of chicken off a bone tossing the bone over his shoulder belching and sighing. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Delmar is pleased and embarrassed rising to his feet and tossing down his napkin. He reaches up and with one hand easily rips a stout limb off a tree casually stripping its twigs. He swings at Delmar who staggers back with a grunt as Everett wears a puzzled smile. Though stunned Delmar is faster to size things up and charges Big Dan wrapping his arms around him. Big Dan rears back and whacks at his head while Everett remains puzzled but willing to be instructed. Big Dan walks awkwardly over to Everett with Delmar still attached to him like a hunting dog locked onto a bear taking a break from whacking at Delmar to deliver a blow to Everett which catches him on the chin and sends him reeling. Big Dan bear hugs Delmar and tosses him away whacking Everett into a semiconscious heap and then pawing through his pockets. He walks over to Delmar who is on the ground moaning and kicks him several times taking Delmar's shoebox and flipping off the top to reveal a bed of straw with the toad resting on it. He pokes around the straw with his finger finding nothing else inside as Delmar moaning looks blearily up through swollen eyes. Big Dan has the toad in his enormous fist and Delmar moans through cracked and bloody lips as Big Dan squeezes the frog crushing it and tosses it away against a tree."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Everett gives her an ingratiating laugh and ostentatiously fans some of his money while she watches him do so. The big man who appears as she leaves stops chewing and slowly raises his napkin to his lips to give them a dainty pat. Big Dan chuckles as he draws up a chair and Everett rises and digs in his pocket. As the three men start to move off Big Dan gives Delmar a tilt of the head and a crinkling smile. Meanwhile Pappy O'Daniel sits smoking a cigar nursing a glass of whiskey and soliciting the counsel of his overweight retinue narrowing his eyes at him wondering what he is getting at. Pappy whips off his hat and slaps at Junior with it glaring around the table as Eckard grunts and starts to rise only for Pappy to whip him back down with his hat. Eckard upon settling back looks around the table and helpfully relays information. The car boosted from the general store has been pulled off the road and parked a few yards into a field littered with bluebonnets and rimmed with mossdripping oak where Everett Delmar and Big Dan sit on a blanket around a large picnic hamper. Big Dan is just sucking the last piece of chicken off a bone tossing the bone over his shoulder belching and sighing. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Delmar is pleased and embarrassed rising to his feet and tossing down his napkin. He reaches up and with one hand easily rips a stout limb off a tree casually stripping its twigs. He swings at Delmar who staggers back with a grunt as Everett wears a puzzled smile. Though stunned Delmar is faster to size things up and charges Big Dan wrapping his arms around him. Big Dan rears back and whacks at his head while Everett remains puzzled but willing to be instructed. Big Dan walks awkwardly over to Everett with Delmar still attached to him like a hunting dog locked onto a bear taking a break from whacking at Delmar to deliver a blow to Everett which catches him on the chin and sends him reeling. Big Dan bear hugs Delmar and tosses him away whacking Everett into a semiconscious heap and then pawing through his pockets. He walks over to Delmar who is on the ground moaning and kicks him several times taking Delmar's shoebox and flipping off the top to reveal a bed of straw with the toad resting on it. He pokes around the straw with his finger finding nothing else inside as Delmar moaning looks blearily up through swollen eyes. Big Dan has the toad in his enormous fist and Delmar moans through cracked and bloody lips as Big Dan squeezes the frog crushing it and tosses it away against a tree."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Everett gives her an ingratiating laugh and ostentatiously fans some of his money while she watches him do so. The big man who appears as she leaves stops chewing and slowly raises his napkin to his lips to give them a dainty pat. Big Dan chuckles as he draws up a chair and Everett rises and digs in his pocket. As the three men start to move off Big Dan gives Delmar a tilt of the head and a crinkling smile. Meanwhile Pappy O'Daniel sits smoking a cigar nursing a glass of whiskey and soliciting the counsel of his overweight retinue narrowing his eyes at him wondering what he is getting at. Big Dan walks awkwardly over to Everett with Delmar still attached to him like a hunting dog locked onto a bear taking a break from whacking at Delmar to deliver a blow to Everett which catches him on the chin and sends him reeling. Big Dan bear hugs Delmar and tosses him away whacking Everett into a semiconscious heap and then pawing through his pockets. He walks over to Delmar who is on the ground moaning and kicks him several times taking Delmar's shoebox and flipping off the top to reveal a bed of straw with the toad resting on it. He pokes around the straw with his finger finding nothing else inside as Delmar moaning looks blearily up through swollen eyes. Big Dan has the toad in his enormous fist and Delmar moans through cracked and bloody lips as Big Dan squeezes the frog crushing it and tosses it away against a tree."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Everett gives her an ingratiating laugh and ostentatiously fans some of his money while she watches him do so. The big man who appears as she leaves stops chewing and slowly raises his napkin to his lips to give them a dainty pat. He pokes around the straw with his finger finding nothing else inside as Delmar moaning looks blearily up through swollen eyes. Big Dan has the toad in his enormous fist and Delmar moans through cracked and bloody lips as Big Dan squeezes the frog crushing it and tosses it away against a tree."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Molly offers him a bewildered sigh and dramatically waves some of her scarves, while he observes her doing so. The tall woman, who arrives as he departs, halts singing and gently lowers her pillow to her chin to give it a gentle rub. Large Lou giggles as he pulls up a bench, and Molly stands and fumbles in her bag. As the four ladies begin to shuffle away, Large Lou gives Harriet a nod of the shoulder and a wrinkled grin. Meanwhile, Daisy D'Oliver is knitting a sweater, stirring a bowl of soup, and requesting the advice of her scrawny entourage, squinting her eyes at her, curious about her intentions. Daisy removes her scarf and taps Oliver with it, glaring around the room, as Grant huffs and begins to sit, only for Daisy to yank him back up with her scarf. Grant, upon standing up again, glances around the room and cheerfully provides an update. The truck purchased from the candy shop has been driven onto the road and parked several inches into a garden filled with daffodils and surrounded by snow-dusted birch, where Molly, Harriet, and Large Lou lounge on a mat around a small picnic basket. Large Lou is just nibbling the last bit of carrot from a core, tossing the core over his shoulder, burping, and yawning. Harriet is amused and embarrassed, standing to her knees and dropping her handkerchief. She reaches down and with one hand easily pulls a slender thread from a cloth, casually plucking its fibers. She swings at Harriet, who stumbles forward with a cough, as Molly wears a curious frown. Though bewildered, Harriet is quicker to grasp the situation and lunges at Large Lou, clasping her arms around him. Large Lou leans forward and bats at her shoulder, while Molly remains curious but eager to observe. Large Lou stumbles awkwardly over to Molly with Harriet still clinging to him like a koala latched onto a tree, pausing from batting at Harriet to deliver a pinch to Molly, which catches her on the nose and sends her staggering. Large Lou squeezes Harriet and shoves her aside, nudging Molly into a dazed pile and then rifling through her shoes. He ambles over to Harriet, who is on the ground groaning, and nudges her a few times, taking Harriet’s mitten and peeling off the cover to reveal a nest of straw with the cat lying on it. He prods around the straw with his thumb, finding nothing else within, as Harriet, groaning, peers dimly up through bruised cheeks. Large Lou has the cat in his massive hand, and Harriet groans through cracked and bruised lips as Large Lou crushes the kitten, destroying it, and flings it away against a fence."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Everett ingratiates himself with a show of money, while the big man who appears later, Big Dan, watches amusedly. Pappy O'Daniel, consulting his advisors, reacts angrily and forcefully directs his retinue. Meanwhile, Everett, Delmar, and Big Dan picnic near a field. After eating, a conflict arises as Big Dan aggressively targets Delmar, who fights back despite being stunned. Big Dan attacks Everett, leaving him dazed and searches him for valuables. He then turns his attention to Delmar, kicking him and discovering a shoebox with a toad inside. Big Dan cruelly crushes the toad, leaving Delmar injured and devastated."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Big Dan has the toad in his enormous fist and Delmar moans through cracked and bloody lips as Big Dan squeezes the frog crushing it and tosses it away against a tree He pokes around the straw with his finger finding nothing else inside as Delmar moaning looks blearily up through swollen eyes He walks over to Delmar who is on the ground moaning and kicks him several times taking Delmar's shoebox and flipping off the top to reveal a bed of straw with the toad resting on it Big Dan bear hugs Delmar and tosses him away whacking Everett into a semiconscious heap and then pawing through his pockets Big Dan walks awkwardly over to Everett with Delmar still attached to him like a hunting dog locked onto a bear taking a break from whacking at Delmar to deliver a blow to Everett which catches him on the chin and sends him reeling Big Dan rears back and whacks at his head while Everett remains puzzled but willing to be instructed Though stunned Delmar is faster to size things up and charges Big Dan wrapping his arms around him He swings at Delmar who staggers back with a grunt as Everett wears a puzzled smile He reaches up and with one hand easily rips a stout limb off a tree casually stripping its twigs Delmar is pleased and embarrassed rising to his feet and tossing down his napkin Big Dan is just sucking the last piece of chicken off a bone tossing the bone over his shoulder belching and sighing The car boosted from the general store has been pulled off the road and parked a few yards into a field littered with bluebonnets and rimmed with mossdripping oak where Everett Delmar and Big Dan sit on a blanket around a large picnic hamper Eckard upon settling back looks around the table and helpfully relays information Pappy whips off his hat and slaps at Junior with it glaring around the table as Eckard grunts and starts to rise only for Pappy to whip him back down with his hat Meanwhile Pappy O'Daniel sits smoking a cigar nursing a glass of whiskey and soliciting the counsel of his overweight retinue narrowing his eyes at him wondering what he is getting at As the three men start to move off Big Dan gives Delmar a tilt of the head and a crinkling smile Big Dan chuckles as he draws up a chair and Everett rises and digs in his pocket The big man who appears as she leaves stops chewing and slowly raises his napkin to his lips to give them a dainty pat Everett gives her an ingratiating laugh and ostentatiously fans some of his money while she watches him do so"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The big man who appears as she leaves stops chewing and slowly raises his napkin to his lips to give them a dainty pat Everett gives her an ingratiating laugh and ostentatiously fans some of his money while she watches him do so As the three men start to move off Big Dan gives Delmar a tilt of the head and a crinkling smile Big Dan chuckles as he draws up a chair and Everett rises and digs in his pocket Pappy whips off his hat and slaps at Junior with it glaring around the table as Eckard grunts and starts to rise only for Pappy to whip him back down with his hat Meanwhile Pappy O'Daniel sits smoking a cigar nursing a glass of whiskey and soliciting the counsel of his overweight retinue narrowing his eyes at him wondering what he is getting at The car boosted from the general store has been pulled off the road and parked a few yards into a field littered with bluebonnets and rimmed with mossdripping oak where Everett Delmar and Big Dan sit on a blanket around a large picnic hamper Eckard upon settling back looks around the table and helpfully relays information Delmar is pleased and embarrassed rising to his feet and tossing down his napkin Big Dan is just sucking the last piece of chicken off a bone tossing the bone over his shoulder belching and sighing He swings at Delmar who staggers back with a grunt as Everett wears a puzzled smile He reaches up and with one hand easily rips a stout limb off a tree casually stripping its twigs Big Dan rears back and whacks at his head while Everett remains puzzled but willing to be instructed Though stunned Delmar is faster to size things up and charges Big Dan wrapping his arms around him Big Dan bear hugs Delmar and tosses him away whacking Everett into a semiconscious heap and then pawing through his pockets Big Dan walks awkwardly over to Everett with Delmar still attached to him like a hunting dog locked onto a bear taking a break from whacking at Delmar to deliver a blow to Everett which catches him on the chin and sends him reeling He pokes around the straw with his finger finding nothing else inside as Delmar moaning looks blearily up through swollen eyes He walks over to Delmar who is on the ground moaning and kicks him several times taking Delmar's shoebox and flipping off the top to reveal a bed of straw with the toad resting on it Big Dan has the toad in his enormous fist and Delmar moans through cracked and bloody lips as Big Dan squeezes the frog crushing it and tosses it away against a tree"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He reaches up and with one hand easily rips a stout limb off a tree casually stripping its twigs He swings at Delmar who staggers back with a grunt as Everett wears a puzzled smile Though stunned Delmar is faster to size things up and charges Big Dan wrapping his arms around him Big Dan rears back and whacks at his head while Everett remains puzzled but willing to be instructed Big Dan walks awkwardly over to Everett with Delmar still attached to him like a hunting dog locked onto a bear taking a break from whacking at Delmar to deliver a blow to Everett which catches him on the chin and sends him reeling Big Dan bear hugs Delmar and tosses him away whacking Everett into a semiconscious heap and then pawing through his pockets He walks over to Delmar who is on the ground moaning and kicks him several times taking Delmar's shoebox and flipping off the top to reveal a bed of straw with the toad resting on it He pokes around the straw with his finger finding nothing else inside as Delmar moaning looks blearily up through swollen eyes Big Dan has the toad in his enormous fist and Delmar moans through cracked and bloody lips as Big Dan squeezes the frog crushing it and tosses it away against a tree Everett gives her an ingratiating laugh and ostentatiously fans some of his money while she watches him do so The big man who appears as she leaves stops chewing and slowly raises his napkin to his lips to give them a dainty pat Big Dan chuckles as he draws up a chair and Everett rises and digs in his pocket As the three men start to move off Big Dan gives Delmar a tilt of the head and a crinkling smile Meanwhile Pappy O'Daniel sits smoking a cigar nursing a glass of whiskey and soliciting the counsel of his overweight retinue narrowing his eyes at him wondering what he is getting at Pappy whips off his hat and slaps at Junior with it glaring around the table as Eckard grunts and starts to rise only for Pappy to whip him back down with his hat Eckard upon settling back looks around the table and helpfully relays information The car boosted from the general store has been pulled off the road and parked a few yards into a field littered with bluebonnets and rimmed with mossdripping oak where Everett Delmar and Big Dan sit on a blanket around a large picnic hamper Big Dan is just sucking the last piece of chicken off a bone tossing the bone over his shoulder belching and sighing Delmar is pleased and embarrassed rising to his feet and tossing down his napkin"
        }
      ]
    }
  ]
}