{
  "ground_truth": "Szpilman makes a record in a ledger of the tools each worker takes out on the site. A worker puts his head into the store. The Jewish workers start to assemble on the site in haphazard ranks as an SS Captain strides in. The SS Captain, with much jollity and jokes, hops up on the scaffolding and stands, beaming broadly, surveying the workers. A glance occurs between Szpilman and Majorek. The SS Captain beams, but there is no reaction from the workers. He rubs his thumb and forefinger and leers, still receiving no reaction, and his smile vanishes. Snow. Majorek pulls a barrow by a rope attached to its shaft across the site. On the barrow, there are five sacks. Majorek pulls the barrow to where Szpilman waits, and Majorek is instantly awake. Majorek takes the paper but says nothing. He turns over and goes back to sleep, while Szpilman returns to his bunk. Szpilman has unloaded the sacks of potatoes into the corner and is kneeling, about to untie the string on the smallest sack, when a sound alerts him. He looks around and sees an SS Lieutenant entering the stores, sucking on his finger, which is bleeding. Szpilman immediately hurries to a cupboard, finds a First Aid tin, removes a plaster, and gives it to the SS Lieutenant. The lieutenant indicates the sacks with his chin. Szpilman tries to untie the string but is too terrified to manage it. The SS Lieutenant shoves him out of the way, takes a dagger from his belt, and cuts the string. The lieutenant reaches in and withdraws a handful of long yellow beans, glowers at Szpilman, reaches in again, and produces a handful of oatmeal. He throws the oatmeal in Szpilman's face, kicks him viciously, and marches away. Szpilman catches his breath, then quickly reaches into the bottom of the sack and finds a pistol and ammunition, which he hides under his clothes. Freezing cold, the Jewish workers, with their bundles of potatoes and bread, march back toward the ghetto gates escorted by two Polish policemen. Zick-Zack takes a swig of vodka and comes face to face with Szpilman, staring at him directly with glassy eyes. Szpilman is terrified, trying as surreptitiously as possible to cover his hidden package with his hands, and there is a moment of danger. Zick-Zack grabs Szpilman by the collar, finding this hilarious along with his comrade, and they recover from their laughter. The column starts to march, and after a brief silence, a solo voice from the back starts to sing, \"Children of Warsaw will go to fight!\" Szpilman glances back and sees that Majorek is singing. Szpilman smiles, Majorek nods, and Szpilman joins in. Now, so do the others, and they march on, singing lustily. Szpilman lies in a steaming bath, eyes closed, as though in a trance.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Szpilman creates a record in a register of the tools each laborer takes out on the site. A laborer inserts his head into the store. The Jewish laborers begin to gather on the site in random ranks as an SS Commander strides in. The SS Commander, with much cheerfulness and jests, jumps up on the scaffolding and stands, beaming widely, surveying the laborers. A glance happens between Szpilman and Majorek. The SS Commander beams, but there is no response from the laborers. He rubs his thumb and forefinger and leers, still receiving no response, and his smile disappears. Snow. Majorek drags a wheelbarrow by a rope affixed to its shaft across the site. On the wheelbarrow, there are five sacks. Majorek drags the wheelbarrow to where Szpilman waits, and Majorek is instantly alert. Majorek accepts the paper but utters nothing. He turns over and returns to sleep, while Szpilman returns to his bunk. Szpilman has unloaded the sacks of potatoes into the corner and is kneeling, about to untie the string on the smallest sack, when a sound alerts him. He looks around and sees an SS Officer entering the stores, sucking on his finger, which is bleeding. Szpilman immediately rushes to a cabinet, locates a First Aid tin, extracts a plaster, and gives it to the SS Officer. The officer indicates the sacks with his chin. Szpilman attempts to untie the string but is too frightened to manage it. The SS Officer shoves him aside, takes a knife from his belt, and cuts the string. The officer reaches in and withdraws a handful of long yellow beans, glares at Szpilman, reaches in again, and produces a handful of oatmeal. He throws the oatmeal in Szpilman's face, kicks him viciously, and marches away. Szpilman catches his breath, then quickly reaches into the bottom of the sack and finds a pistol and ammunition, which he hides under his garments. Freezing cold, the Jewish laborers, with their bundles of potatoes and bread, march back toward the ghetto gates escorted by two Polish policemen. Zick-Zack takes a swig of vodka and comes face to face with Szpilman, staring at him directly with glassy eyes. Szpilman is frightened, trying as covertly as possible to cover his hidden package with his hands, and there is a moment of peril. Zick-Zack seizes Szpilman by the collar, finding this hilarious along with his comrade, and they recover from their laughter. The column commences to march, and after a brief silence, a solo voice from the back begins to sing, \"Children of Warsaw will go to fight!\" Szpilman glances back and sees that Majorek is singing. Szpilman smiles, Majorek nods, and Szpilman joins in. Now, so do the others, and they march on, singing heartily. Szpilman lies in a steaming bath, eyes closed, as though in a trance."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A record is made by Szpilman in a ledger of the tools taken out by each worker on the site. A worker's head is put into the store. The Jewish workers are started to be assembled on the site in haphazard ranks as an SS Captain strides in. The SS Captain, with much jollity and jokes, is hopped up on the scaffolding by himself and he stands, beaming broadly, surveying the workers. Szpilman and Majorek exchange a glance. The SS Captain is beaming, but the workers give no reaction. His thumb and forefinger are rubbed by him and he leers, still receiving no reaction, and his smile vanishes. Snow. A barrow is pulled by Majorek by a rope attached to its shaft across the site. On the barrow, five sacks are loaded. The barrow is pulled by Majorek to where Szpilman waits, and Majorek becomes instantly awake. The paper is taken by Majorek but nothing is said by him. He turns over and goes back to sleep, while Szpilman returns to his bunk. The sacks of potatoes have been unloaded by Szpilman into the corner, and he is kneeling, about to untie the string on the smallest sack, when he is alerted by a sound. He looks around and an SS Lieutenant, sucking on a bleeding finger, is seen by him entering the stores. A First Aid tin is immediately hurried to by Szpilman in a cupboard, a plaster is found, removed, and given to the SS Lieutenant. The sacks are indicated by the lieutenant with his chin. Szpilman tries to untie the string but too terrified to manage it. Szpilman is shoved out of the way by the SS Lieutenant, who takes a dagger from his belt and cuts the string. A handful of long yellow beans is withdrawn by the lieutenant, who glowers at Szpilman, reaches in again, and produces a handful of oatmeal. The oatmeal is thrown at Szpilman's face, he is kicked viciously, and the SS Lieutenant marches away. Szpilman catches his breath, then quickly reaches into the bottom of the sack and finds a pistol and ammunition, which are hidden under his clothes by him. Freezing cold, the Jewish workers, with their bundles of potatoes and bread, march back toward the ghetto gates escorted by two Polish policemen. A swig of vodka is taken by Zick-Zack, and he comes face to face with Szpilman, staring directly at him with glassy eyes. Szpilman is terrified, trying as surreptitiously as possible to cover his hidden package with his hands, and a moment of danger arises. Szpilman is grabbed by Zick-Zack by the collar, finding this hilarious along with his comrade, and they recover from their laughter. The column is started to be marched, and after a brief silence, a solo voice starts to sing from the back, \"Children of Warsaw will go to fight!\" A glance is given by Szpilman back and Majorek is seen singing. Szpilman smiles, a nod is given by Majorek, and Szpilman joins in. The others join in now too, and they march on, singing lustily. Szpilman lies in a steaming bath, eyes closed, as though in a trance."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Szpilman records the tools each worker takes on site. A worker enters the store. Jewish workers assemble haphazardly as an SS Captain strides in, jokingly climbs the scaffolding, and surveys them. Szpilman and Majorek exchange glances. The Captain rubs his fingers, leers, but gets no reaction, and his smile fades. Snow falls. Majorek pulls a barrow with five sacks to Szpilman, who unloads potatoes and is about to untie a sack when an SS Lieutenant enters, sucking a bleeding finger. Szpilman finds a plaster and gives it to him. The lieutenant indicates the sacks, Szpilman tries to untie one but fails. The lieutenant cuts the string, finds beans and oatmeal, throws the oatmeal at Szpilman, kicks him, and leaves. Szpilman finds a pistol and ammunition in the sack and hides them. Freezing, the Jewish workers, with potatoes and bread, march back to the ghetto escorted by Polish policemen. Zick-Zack drinks vodka, confronts Szpilman, who hides his package. Zick-Zack grabs Szpilman, laughs with his comrade, and they recover. The column marches, and a solo voice sings, \"Children of Warsaw will go to fight!\" Szpilman sees Majorek singing, smiles, and joins in. Others follow, singing lustily. Szpilman lies in a steaming bath, eyes closed, in a trance."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Szpilman records tools each worker takes on site. A worker appears, Jewish workers assemble as an SS Captain arrives, jokingly climbs scaffolding, beaming at workers. Szpilman and Majorek exchange glances. The Captain rubs fingers, leers, but workers don't react. Snow falls. Majorek pulls a barrow with sacks to Szpilman, who takes a paper, Majorek sleeps. Szpilman unloads potatoes, hears a sound, sees an SS Lieutenant sucking a bleeding finger. Szpilman finds a plaster, gives it to the Lieutenant, who cuts a sack string, finds beans and oatmeal, throws it at Szpilman, kicks him, leaves. Szpilman finds a pistol, hides it. Workers march to ghetto gates, escorted by police. Zick-Zack drinks vodka, faces Szpilman, who hides his package. Zick-Zack grabs him, laughs. The column marches, Majorek sings, Szpilman joins, others sing too. Szpilman lies in a bath, eyes closed."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Szpilman meticulously records in a ledger the details of the tools that each worker takes out on the site, ensuring everything is accounted for. A worker briefly pokes his head into the store, checking in. Meanwhile, the Jewish workers begin to gather on the site, forming haphazard ranks as they prepare for the day's labor. An SS Captain, exuding authority, strides confidently into the area. With a demeanor full of jollity and light-hearted jokes, he energetically hops up onto the scaffolding. Standing there, he beams broadly, surveying the assembled workers with a wide smile. A subtle, meaningful glance is exchanged between Szpilman and Majorek, conveying unspoken understanding. Despite the SS Captain's beaming expression, the workers remain unresponsive, showing no reaction to his presence. He rubs his thumb and forefinger together suggestively and leers at them, but still, there is no response, and his smile fades away. Snow begins to fall gently around them. Majorek, with determination, pulls a barrow by a rope attached to its shaft across the site. On this barrow, there are five heavy sacks. He maneuvers the barrow to where Szpilman is waiting, and Majorek suddenly becomes alert. He takes the paper handed to him but remains silent, then turns over and goes back to sleep, while Szpilman returns to his bunk. Szpilman has already unloaded the sacks of potatoes into a corner and is kneeling down, about to untie the string on the smallest sack, when a sudden sound catches his attention. He looks around and notices an SS Lieutenant entering the stores, sucking on a finger that is bleeding. Szpilman immediately rushes to a cupboard, retrieves a First Aid tin, takes out a plaster, and hands it to the SS Lieutenant. The lieutenant, with a slight nod, indicates the sacks with his chin. Szpilman attempts to untie the string but is too terrified to manage it properly. The SS Lieutenant brusquely shoves him aside, draws a dagger from his belt, and swiftly cuts the string. Reaching into the sack, the lieutenant withdraws a handful of long yellow beans, glaring at Szpilman with suspicion. He reaches in again and pulls out a handful of oatmeal, which he spitefully throws in Szpilman's face before kicking him viciously and marching away. Szpilman, catching his breath, quickly reaches into the bottom of the sack and discovers a pistol and ammunition, which he hurriedly hides under his clothes. In the freezing cold, the Jewish workers, burdened with their bundles of potatoes and bread, march back toward the ghetto gates, escorted by two Polish policemen. Zick-Zack takes a swig of vodka and comes face to face with Szpilman, staring at him directly with glassy, unfocused eyes. Szpilman is filled with terror, trying as discreetly as possible to cover his hidden package with his hands, sensing a moment of imminent danger. Zick-Zack grabs Szpilman by the collar, finding this action hilarious, and shares a laugh with his comrade. After recovering from their laughter, the column begins to march again. Following a brief silence, a solo voice from the back starts to sing, \"Children of Warsaw will go to fight!\" Szpilman glances back and sees that it is Majorek who is singing. Szpilman smiles, Majorek nods in acknowledgment, and Szpilman joins in the song. Soon, the others join in as well, and they march on, singing with gusto. Later, Szpilman lies in a steaming bath, his eyes closed, as though he is in a trance, finding a moment of peace amidst the chaos."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Szpilman, with meticulous care and attention to detail, diligently records in a ledger the specifics of the tools that every worker retrieves from the site, ensuring that each item is precisely and thoroughly accounted for. As he carries out this task with precision, a worker momentarily pokes his head into the store, briefly checking in before disappearing again. Meanwhile, the Jewish laborers begin to assemble on the worksite, gathering together in loose, disorganized ranks as they prepare themselves for the arduous tasks of the day. An SS Captain, exuding an air of authority and command, strides into the area with confident steps. His demeanor is full of cheerful levity and light-hearted jokes as he energetically hops up onto the scaffolding. From this elevated vantage point, he stands, radiating a broad, beaming smile as he surveys the gathered workers. A subtle and meaningful glance is exchanged between Szpilman and Majorek, conveying an unspoken understanding between them. Despite the SS Captain's radiant smile, the workers remain stony-faced and unresponsive, showing no reaction to his presence. He rubs his thumb and forefinger together in a suggestive manner and leers at them, yet still, there is no response from the workers, causing his once-bright smile to fade away. Snow begins to fall softly, gently covering the scene around them. Majorek, determined and resolute, pulls a barrow by a rope that is attached to its shaft across the site. On this barrow are five heavy sacks, which he maneuvers to the spot where Szpilman is waiting. Majorek suddenly becomes alert as he takes the paper handed to him but chooses to remain silent. Afterward, he turns over and goes back to sleep, while Szpilman returns to his bunk. Szpilman has already unloaded the sacks of potatoes into a corner and is kneeling down, poised and ready to untie the string on the smallest sack, when a sudden noise catches his attention. He looks around and notices an SS Lieutenant entering the stores, sucking on a finger that is bleeding. Without hesitation, Szpilman rushes to a nearby cupboard, retrieves a First Aid tin, extracts a plaster, and hands it to the SS Lieutenant. The lieutenant, with a slight nod of acknowledgment, indicates the sacks with a gesture of his chin. Szpilman attempts to untie the string but finds himself too terrified to manage it effectively. The SS Lieutenant brusquely shoves him aside, draws a dagger from his belt, and swiftly cuts the string with ease. With suspicion in his eyes, he reaches into the sack and withdraws a handful of long yellow beans, glaring intensely at Szpilman. He reaches in once more and pulls out a handful of oatmeal, which he spitefully throws into Szpilman's face before kicking him viciously and marching away with authority. Szpilman, struggling to catch his breath, quickly reaches into the bottom of the sack and makes a startling discovery of a pistol and ammunition, which he hurriedly conceals beneath his clothes. In the freezing cold, the Jewish workers, carrying the heavy burden of their bundles of potatoes and bread, make their way back toward the ghetto gates, escorted by two Polish policemen. Zick-Zack takes a swig of vodka and comes face to face with Szpilman, staring directly at him with glassy, unfocused eyes. Szpilman is filled with terror, desperately trying to cover his hidden package with his hands as discreetly as possible, sensing a dangerous moment that could be imminent. Zick-Zack grabs Szpilman by the collar, finding great amusement in this action, and shares a laugh with his comrade. After recovering from their laughter, the column resumes its march. After a period of brief silence, a solo voice emerges from the back, beginning to sing the song, \"Children of Warsaw will go to fight!\" Szpilman glances back and recognizes that it is Majorek who is singing. Szpilman smiles to himself as Majorek nods in acknowledgment, and Szpilman joins in the song. Soon, the others join in as well, and together they all continue marching forward, singing with gusto and spirit. Later, Szpilman finds a moment of peace amidst the chaos as he lies in a steaming bath, his eyes gently closed, as though he is in a trance."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Szpilman meticulously records each tool that the workers take out on the site in a ledger, ensuring every detail is noted. As he does this, a worker briefly pokes his head into the store, perhaps checking in or signaling something. Meanwhile, the Jewish workers begin to gather on the site, forming disorganized ranks as they prepare for the day's labor. Their attention is drawn to an SS Captain who strides in with an air of authority. The Captain, exuding a false sense of camaraderie, climbs onto the scaffolding with a spring in his step, standing tall and surveying the workers with a broad, beaming smile. Szpilman exchanges a quick, meaningful glance with Majorek, a silent communication passing between them. Despite the Captain's jovial demeanor, the workers remain unresponsive, their faces blank and unmoved. The Captain, undeterred, rubs his thumb and forefinger together suggestively, leering at the workers, but still, he receives no reaction, and his smile fades away. Snow begins to fall as Majorek, using a rope attached to the shaft, pulls a barrow across the site, the barrow laden with five sacks. He maneuvers the barrow to where Szpilman stands waiting, and upon arrival, Majorek seems to awaken from a stupor, taking a paper from Szpilman without uttering a word. He then turns over and goes back to sleep, leaving Szpilman to return to his bunk. Szpilman unloads the sacks of potatoes into a corner, kneeling down to untie the string on the smallest sack when a sudden sound catches his attention. He looks up to see an SS Lieutenant entering the stores, sucking on a bleeding finger. Reacting quickly, Szpilman hurries to a cupboard, retrieves a First Aid tin, and hands a plaster to the Lieutenant. The Lieutenant, with a curt gesture of his chin, indicates the sacks. Szpilman, trembling with fear, attempts to untie the string but finds himself too terrified to manage it. The Lieutenant, impatient, shoves Szpilman aside, draws a dagger from his belt, and slices through the string. He reaches into the sack, pulling out a handful of long yellow beans, and glares at Szpilman before reaching in again to produce a handful of oatmeal, which he spitefully throws in Szpilman's face. With a vicious kick, the Lieutenant sends Szpilman reeling and then marches away. Gasping for breath, Szpilman quickly reaches into the bottom of the sack, discovering a pistol and ammunition, which he swiftly conceals under his clothes. As the freezing cold sets in, the Jewish workers, clutching their bundles of potatoes and bread, begin their march back toward the ghetto gates, flanked by two Polish policemen. Zick-Zack, taking a swig of vodka, suddenly finds himself face to face with Szpilman, staring at him with glassy eyes. Szpilman, terrified, tries to discreetly cover his hidden package with his hands, sensing the imminent danger. Zick-Zack, finding amusement in the situation, grabs Szpilman by the collar, laughing uproariously with his comrade before they recover from their mirth. The column resumes its march, and after a brief silence, a solo voice from the back begins to sing, \"Children of Warsaw will go to fight!\" Szpilman turns to see Majorek singing, and a smile spreads across his face. Majorek nods in acknowledgment, and Szpilman joins in the song. Soon, the others join as well, their voices rising in unison as they march on, singing with fervor. Later, Szpilman lies in a steaming bath, his eyes closed, appearing to be in a trance, as if momentarily escaping the harsh reality around him."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Szpilman records the tools each worker takes out on the site as the Jewish workers assemble in haphazard ranks. An SS Captain enters, jovially climbing the scaffolding and surveying the workers, but his attempts to engage them are met with silence. Meanwhile, Majorek pulls a barrow with five sacks across the site to Szpilman, who waits. After unloading the sacks of potatoes, Szpilman is about to untie the smallest sack when an SS Lieutenant enters, sucking on a bleeding finger. Szpilman quickly retrieves a plaster from a First Aid tin and gives it to the lieutenant, who then cuts the sack open with a dagger, revealing beans and oatmeal. The lieutenant throws the oatmeal in Szpilman's face, kicks him, and leaves. Szpilman recovers and finds a pistol and ammunition in the sack, which he hides under his clothes. As the Jewish workers, carrying potatoes and bread, march back to the ghetto escorted by Polish policemen, Zick-Zack confronts Szpilman, who nervously conceals his hidden package. After a tense moment, Zick-Zack laughs and releases him. The column resumes marching, and Majorek begins singing \"Children of Warsaw will go to fight,\" prompting Szpilman and the others to join in. Later, Szpilman relaxes in a steaming bath, eyes closed, as if in a trance."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Szpilman makes a record in a ledger, a book used for accounting and inventory management, of the tools each worker takes out on the site. A worker puts his head into the store, a typically crowded and chaotic place due to wartime scarcity. The Jewish workers, who are forced laborers during World War II, start to assemble on the site in haphazard ranks as an SS Captain, a Nazi officer known for enforcing discipline, strides in. The SS Captain, with much jollity and jokes to maintain an intimidating yet mocking atmosphere, hops up on the scaffolding and stands, beaming broadly, surveying the workers. A glance occurs between Szpilman, a skilled pianist hiding his talents to survive, and Majorek, who is actually part of the Polish underground resistance. The SS Captain beams, but there is no reaction from the workers, who remain silent out of fear and defiance. He rubs his thumb and forefinger, a gesture often associated with signaling a bribe, and leers, still receiving no reaction, and his smile vanishes. Snow, a relentless reminder of the harsh Polish winter, falls around them. Majorek pulls a barrow by a rope attached to its shaft across the site. On the barrow, there are five sacks filled with contraband goods for the black market. Majorek pulls the barrow to where Szpilman, who is always alert for danger, waits, and Majorek is instantly awake, implying the need for constant vigilance. Majorek takes the paper, a note with secret instructions, but says nothing. He turns over and goes back to sleep, while Szpilman returns to his bunk, located in the overcrowded and underheated barracks. Szpilman has unloaded the sacks of potatoes, a rare and valuable food staple in wartime, into the corner and is kneeling, about to untie the string on the smallest sack, when a sound alerts him. He looks around and sees an SS Lieutenant entering the stores, known for their scarcity of goods, sucking on his finger, which is bleeding from an encounter earlier. Szpilman immediately hurries to a cupboard, finds a First Aid tin, a scarce commodity, removes a plaster, and gives it to the SS Lieutenant. The lieutenant indicates the sacks with his chin. Szpilman tries to untie the string but is too terrified to manage it. The SS Lieutenant shoves him out of the way, takes a dagger, a symbol of his power and authority, from his belt, and cuts the string. The lieutenant reaches in and withdraws a handful of long yellow beans, a luxury item in times of rationing, glowers at Szpilman, reaches in again, and produces a handful of oatmeal, another scarce food item. He throws the oatmeal in Szpilman's face, kicks him viciously, and marches away, demonstrating the brutal hierarchy of power. Szpilman catches his breath, then quickly reaches into the bottom of the sack and finds a pistol and ammunition, crucial for self-defense, which he hides under his clothes. Freezing cold, the Jewish workers, with their bundles of potatoes and bread, march back toward the ghetto gates as part of their routine under Nazi occupation, escorted by two Polish policemen who are often complicit but sometimes secretly sympathetic. Zick-Zack, likely a nickname for a corrupt or brutal guard, takes a swig of vodka, a common means to endure the harsh conditions, and comes face to face with Szpilman, staring at him directly with glassy eyes. Szpilman is terrified, trying as surreptitiously as possible to cover his hidden package with his hands, and there is a moment of danger. Zick-Zack grabs Szpilman by the collar, finding this hilarious along with his comrade, and they recover from their laughter, a momentary relief from their grim duties. The column starts to march, and after a brief silence, a solo voice from the back starts to sing, \"Children of Warsaw will go to fight!\" a resistance song symbolizing hope and defiance. Szpilman glances back and sees that Majorek is singing. Szpilman smiles, Majorek nods, and Szpilman joins in. Now, so do the others, and they march on, singing lustily, a rare moment of unity and strength. Szpilman lies in a steaming bath, eyes closed, as though in a trance, enjoying a brief escape from the harsh realities around him."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Szpilman makes a record in a ledger of the tools each worker takes out on the site. A worker puts his head into the store. The Jewish workers start to assemble on the site in haphazard ranks as an SS Captain strides in. The SS Captain with much jollity and jokes hops up on the scaffolding and stands beaming broadly surveying the workers. A glance occurs between Szpilman and Majorek. The SS Captain beams but there is no reaction from the workers. He rubs his thumb and forefinger and leers still receiving no reaction and his smile vanishes. Snow. Majorek pulls a barrow by a rope attached to its shaft across the site. On the barrow there are five sacks. Majorek pulls the barrow to where Szpilman waits and Majorek is instantly awake. Majorek takes the paper but says nothing. He turns over and goes back to sleep while Szpilman returns to his bunk. Szpilman has unloaded the sacks of potatoes into the corner and is kneeling about to untie the string on the smallest sack when a sound alerts him. He looks around and sees an SS Lieutenant entering the stores sucking on his finger which is bleeding. Szpilman immediately hurries to a cupboard finds a First Aid tin removes a plaster and gives it to the SS Lieutenant. The lieutenant indicates the sacks with his chin. Szpilman tries to untie the string but is too terrified to manage it. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. The SS Lieutenant shoves him out of the way takes a dagger from his belt and cuts the string. The lieutenant reaches in and withdraws. a handful of long yellow beans glowers at. Szpilman reaches in again and produces a handful of oatmeal. He throws the oatmeal in. Szpilman's face kicks him viciously and marches away. Szpilman catches his breath then quickly reaches into the bottom of the sack and finds a pistol and ammunition which he hides under his clothes. Freezing cold the Jewish workers with their bundles of potatoes and bread march back toward the ghetto gates escorted by two Polish policemen. ZickZack takes a swig of vodka and comes face to face with Szpilman staring at him directly with glassy eyes. Szpilman is terrified trying as surreptitiously as possible to cover his hidden package with his hands and there is a moment of danger. ZickZack grabs Szpilman by the collar finding this hilarious along with his comrade and they recover from their laughter. The column starts to march and after a brief silence a solo voice from the back starts to sing. Children of Warsaw will go to fight. Szpilman glances back and sees that Majorek is singing. Szpilman smiles. Majorek nods and Szpilman joins in. Now so do the others and they march on singing lustily. Szpilman lies in a steaming bath eyes closed as though in a trance."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Szpilman makes a record in a ledger of the tools each worker takes out on the site. A worker puts his head into the store. The Jewish workers start to assemble on the site in haphazard ranks as an SS Captain strides in. The SS Captain with much jollity and jokes hops up on the scaffolding and stands beaming broadly surveying the workers. A glance occurs between Szpilman and Majorek. The SS Captain beams but there is no reaction from the workers. He rubs his thumb and forefinger and leers still receiving no reaction and his smile vanishes. Snow. Majorek pulls a barrow by a rope attached to its shaft across the site. On the barrow there are five sacks. Majorek pulls the barrow to where Szpilman waits and Majorek is instantly awake. Majorek takes the paper but says nothing. He turns over and goes back to sleep while Szpilman returns to his bunk. Szpilman has unloaded the sacks of potatoes into the corner and is kneeling about to untie the string on the smallest sack when a sound alerts him. He looks around and sees an SS Lieutenant entering the stores sucking on his finger which is bleeding. Szpilman immediately hurries to a cupboard finds a First Aid tin removes a plaster and gives it to the SS Lieutenant. The lieutenant indicates the sacks with his chin. Szpilman tries to untie the string but is too terrified to manage it. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. The SS Lieutenant shoves him out of the way takes a dagger from his belt and cuts the string. The lieutenant reaches in and withdraws. a handful of long yellow beans glowers at. Szpilman reaches in again and produces a handful of oatmeal. He throws the oatmeal in. Szpilman's face kicks him viciously and marches away. Szpilman catches his breath then quickly reaches into the bottom of the sack and finds a pistol and ammunition which he hides under his clothes. Freezing cold the Jewish workers with their bundles of potatoes and bread march back toward the ghetto gates escorted by two Polish policemen. ZickZack takes a swig of vodka and comes face to face with Szpilman staring at him directly with glassy eyes. Szpilman is terrified trying as surreptitiously as possible to cover his hidden package with his hands and there is a moment of danger. ZickZack grabs Szpilman by the collar finding this hilarious along with his comrade and they recover from their laughter. The column starts to march and after a brief silence a solo voice from the back starts to sing. Children of Warsaw will go to fight. Szpilman glances back and sees that Majorek is singing. Szpilman smiles. Majorek nods and Szpilman joins in. Now so do the others and they march on singing lustily. Szpilman lies in a steaming bath eyes closed as though in a trance."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Szpilman makes a record in a ledger of the tools each worker takes out on the site. A worker puts his head into the store. The Jewish workers start to assemble on the site in haphazard ranks as an SS Captain strides in. The SS Captain with much jollity and jokes hops up on the scaffolding and stands beaming broadly surveying the workers. A glance occurs between Szpilman and Majorek. The SS Captain beams but there is no reaction from the workers. He rubs his thumb and forefinger and leers still receiving no reaction and his smile vanishes. Snow. Majorek pulls a barrow by a rope attached to its shaft across the site. Szpilman is terrified trying as surreptitiously as possible to cover his hidden package with his hands and there is a moment of danger. ZickZack grabs Szpilman by the collar finding this hilarious along with his comrade and they recover from their laughter. The column starts to march and after a brief silence a solo voice from the back starts to sing. Children of Warsaw will go to fight. Szpilman glances back and sees that Majorek is singing. Szpilman smiles. Majorek nods and Szpilman joins in. Now so do the others and they march on singing lustily. Szpilman lies in a steaming bath eyes closed as though in a trance."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Szpilman makes a record in a ledger of the tools each worker takes out on the site. A worker puts his head into the store. The Jewish workers start to assemble on the site in haphazard ranks as an SS Captain strides in. The SS Captain with much jollity and jokes hops up on the scaffolding and stands beaming broadly surveying the workers. Szpilman smiles. Majorek nods and Szpilman joins in. Now so do the others and they march on singing lustily. Szpilman lies in a steaming bath eyes closed as though in a trance."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Jenkins inscribes a note in a scroll of the gadgets each sailor borrows on the deck. A sailor pokes his arm into the cabin. The merfolk start to gather on the deck in tidy rows as a Space Pirate stomps in. The Space Pirate, with much merriment and riddles, skips up on the mast and lounges, grinning widely, observing the merfolk. A wink happens between Jenkins and Bartholomew. The Space Pirate grins, but there is no response from the merfolk. He taps his elbow and knuckle and mocks, still getting no response, and his grin disappears. Sand. Bartholomew drags a cart by a chain attached to its handle across the deck. On the cart, there are five barrels. Bartholomew drags the cart to where Jenkins waits, and Bartholomew is instantly alert. Bartholomew grabs the scroll but utters nothing. He flips over and dozes off, while Jenkins returns to his hammock. Jenkins has dumped the barrels of apples into the corner and is kneeling, about to untie the twine on the tiniest barrel, when a noise alerts him. He glances around and spots a Space Pilot entering the cabin, chewing on his wrist, which is bruised. Jenkins swiftly shuffles to a drawer, finds a Healing Kit, extracts a bandage, and hands it to the Space Pilot. The pilot gestures toward the barrels with his eyebrow. Jenkins attempts to untie the twine but is too petrified to achieve it. The Space Pilot nudges him out of the way, draws a saber from his sheath, and slices the twine. The pilot reaches in and pulls out a fistful of long green beans, scowls at Jenkins, reaches in again, and pulls out a fistful of rice. He flings the rice in Jenkins's face, kicks him harshly, and strides away. Jenkins catches his breath, then swiftly reaches into the bottom of the barrel and discovers a compass and maps, which he conceals under his garments. Blisteringly hot, the merfolk, with their bundles of apples and cheese, march back toward the island gates escorted by two Viking warriors. Quack-Quack takes a sip of tea and comes face to face with Jenkins, glaring at him directly with hazy eyes. Jenkins is petrified, trying as discreetly as possible to shield his concealed item with his arms, and there is a moment of peril. Quack-Quack grips Jenkins by the sleeve, finding this amusing along with his partner, and they recover from their chuckles. The line starts to march, and after a short pause, a lone voice from the front starts to sing, \"Residents of Atlantis will go to swim!\" Jenkins glances forward and sees that Bartholomew is singing. Jenkins grins, Bartholomew nods, and Jenkins joins in. Now, so do the rest, and they march on, singing heartily. Jenkins floats in a frosty lake, eyes open, as though in a daze."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Szpilman records tools taken by workers on-site while the Jewish workers gather as an SS Captain jovially surveys them. There is a wary exchange between Szpilman and Majorek, but the workers remain silent. Majorek transports sacks across the site to Szpilman, who prepares to check them when an SS Lieutenant enters, bleeding. Szpilman tends to him with a plaster, but the Lieutenant discovers and scatters oatmeal from a sack, then retaliates against Szpilman. Recovering, Szpilman finds and hides a pistol and ammunition in the sack. The workers, cold and carrying their bundles, march back to the ghetto escorted by Polish police. A tense moment arises when Zick-Zack confronts a frightened Szpilman but ends in laughter. As they march, Majorek begins singing \"Children of Warsaw,\" and Szpilman, along with others, joins in, singing boldly. Later, Szpilman relaxes in a bath, seemingly entranced."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Szpilman lies in a steaming bath eyes closed as though in a trance Now so do the others and they march on singing lustily  Majorek nods and Szpilman joins in  Szpilman smiles  Szpilman glances back and sees that Majorek is singing  Children of Warsaw will go to fight  The column starts to march and after a brief silence a solo voice from the back starts to sing  ZickZack grabs Szpilman by the collar finding this hilarious along with his comrade and they recover from their laughter  Szpilman is terrified trying as surreptitiously as possible to cover his hidden package with his hands and there is a moment of danger  ZickZack takes a swig of vodka and comes face to face with Szpilman staring at him directly with glassy eyes  Freezing cold the Jewish workers with their bundles of potatoes and bread march back toward the ghetto gates escorted by two Polish policemen  Szpilman catches his breath then quickly reaches into the bottom of the sack and finds a pistol and ammunition which he hides under his clothes  Szpilman's face kicks him viciously and marches away  He throws the oatmeal in  Szpilman reaches in again and produces a handful of oatmeal  a handful of long yellow beans glowers at  The lieutenant reaches in and withdraws  The SS Lieutenant shoves him out of the way takes a dagger from his belt and cuts the string  Szpilman tries to untie the string but is too terrified to manage it  The lieutenant indicates the sacks with his chin  Szpilman immediately hurries to a cupboard finds a First Aid tin removes a plaster and gives it to the SS Lieutenant  He looks around and sees an SS Lieutenant entering the stores sucking on his finger which is bleeding  Szpilman has unloaded the sacks of potatoes into the corner and is kneeling about to untie the string on the smallest sack when a sound alerts him  He turns over and goes back to sleep while Szpilman returns to his bunk  Majorek takes the paper but says nothing  Majorek pulls the barrow to where Szpilman waits and Majorek is instantly awake  On the barrow there are five sacks  Majorek pulls a barrow by a rope attached to its shaft across the site  Snow  He rubs his thumb and forefinger and leers still receiving no reaction and his smile vanishes  The SS Captain beams but there is no reaction from the workers  A glance occurs between Szpilman and Majorek  The SS Captain with much jollity and jokes hops up on the scaffolding and stands beaming broadly surveying the workers  The Jewish workers start to assemble on the site in haphazard ranks as an SS Captain strides in  A worker puts his head into the store  Szpilman makes a record in a ledger of the tools each worker takes out on the site "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "A worker puts his head into the store Szpilman makes a record in a ledger of the tools each worker takes out on the site The SS Captain with much jollity and jokes hops up on the scaffolding and stands beaming broadly surveying the workers The Jewish workers start to assemble on the site in haphazard ranks as an SS Captain strides in The SS Captain beams but there is no reaction from the workers A glance occurs between Szpilman and Majorek Snow He rubs his thumb and forefinger and leers still receiving no reaction and his smile vanishes On the barrow there are five sacks Majorek pulls a barrow by a rope attached to its shaft across the site Majorek takes the paper but says nothing Majorek pulls the barrow to where Szpilman waits and Majorek is instantly awake Szpilman has unloaded the sacks of potatoes into the corner and is kneeling about to untie the string on the smallest sack when a sound alerts him He turns over and goes back to sleep while Szpilman returns to his bunk Szpilman immediately hurries to a cupboard finds a First Aid tin removes a plaster and gives it to the SS Lieutenant He looks around and sees an SS Lieutenant entering the stores sucking on his finger which is bleeding Szpilman tries to untie the string but is too terrified to manage it The lieutenant indicates the sacks with his chin The lieutenant reaches in and withdraws The SS Lieutenant shoves him out of the way takes a dagger from his belt and cuts the string Szpilman reaches in again and produces a handful of oatmeal a handful of long yellow beans glowers at Szpilman's face kicks him viciously and marches away He throws the oatmeal in Freezing cold the Jewish workers with their bundles of potatoes and bread march back toward the ghetto gates escorted by two Polish policemen Szpilman catches his breath then quickly reaches into the bottom of the sack and finds a pistol and ammunition which he hides under his clothes Szpilman is terrified trying as surreptitiously as possible to cover his hidden package with his hands and there is a moment of danger ZickZack takes a swig of vodka and comes face to face with Szpilman staring at him directly with glassy eyes The column starts to march and after a brief silence a solo voice from the back starts to sing ZickZack grabs Szpilman by the collar finding this hilarious along with his comrade and they recover from their laughter Szpilman glances back and sees that Majorek is singing Children of Warsaw will go to fight Majorek nods and Szpilman joins in Szpilman smiles Szpilman lies in a steaming bath eyes closed as though in a trance Now so do the others and they march on singing lustily"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The SS Lieutenant shoves him out of the way takes a dagger from his belt and cuts the string  The lieutenant reaches in and withdraws  a handful of long yellow beans glowers at  Szpilman reaches in again and produces a handful of oatmeal  He throws the oatmeal in  Szpilman's face kicks him viciously and marches away  Szpilman catches his breath then quickly reaches into the bottom of the sack and finds a pistol and ammunition which he hides under his clothes  Freezing cold the Jewish workers with their bundles of potatoes and bread march back toward the ghetto gates escorted by two Polish policemen  ZickZack takes a swig of vodka and comes face to face with Szpilman staring at him directly with glassy eyes  Szpilman is terrified trying as surreptitiously as possible to cover his hidden package with his hands and there is a moment of danger  ZickZack grabs Szpilman by the collar finding this hilarious along with his comrade and they recover from their laughter  The column starts to march and after a brief silence a solo voice from the back starts to sing  Children of Warsaw will go to fight  Szpilman glances back and sees that Majorek is singing  Szpilman smiles  Majorek nods and Szpilman joins in  Now so do the others and they march on singing lustily  Szpilman lies in a steaming bath eyes closed as though in a trance Szpilman makes a record in a ledger of the tools each worker takes out on the site  A worker puts his head into the store  The Jewish workers start to assemble on the site in haphazard ranks as an SS Captain strides in  The SS Captain with much jollity and jokes hops up on the scaffolding and stands beaming broadly surveying the workers  A glance occurs between Szpilman and Majorek  The SS Captain beams but there is no reaction from the workers  He rubs his thumb and forefinger and leers still receiving no reaction and his smile vanishes  Snow  Majorek pulls a barrow by a rope attached to its shaft across the site  On the barrow there are five sacks  Majorek pulls the barrow to where Szpilman waits and Majorek is instantly awake  Majorek takes the paper but says nothing  He turns over and goes back to sleep while Szpilman returns to his bunk  Szpilman has unloaded the sacks of potatoes into the corner and is kneeling about to untie the string on the smallest sack when a sound alerts him  He looks around and sees an SS Lieutenant entering the stores sucking on his finger which is bleeding  Szpilman immediately hurries to a cupboard finds a First Aid tin removes a plaster and gives it to the SS Lieutenant  The lieutenant indicates the sacks with his chin  Szpilman tries to untie the string but is too terrified to manage it "
        }
      ]
    }
  ]
}