{
  "ground_truth": "He closes the door in her face, and she stands there, thrown by the abruptness, pausing briefly outside Simon's door before continuing on her way. The doctor is gone, and mother and daughter are arguing. He grunts with pain, hope, and anxiety as he answers. Simon wheels away from Melvin and Simon is in a wheelchair. Melvin pauses as Simon weeps. Simon swings his arm and cast at Melvin—the sudden attack jolts Melvin, but not as much as what follows. Melvin heads for the door but Simon blocks him. Verdell looks at Simon with concern. As Simon works to stop crying, Melvin is weird with discomfort. Simon looks up, his mood changing quickly, and he's rapt, looking apologetically at Simon in stoic ruin. Carol lies in bed on the pullout sofa. She walks to the kitchen, trembling as she drinks a glass of water and exits. Carol crosses to Manhattan, looking like she's on her way to a final exam where she has no idea of the subject. On a hot summer night, she gets off the bus as the rains come. As Carol consults the slip of paper with the address on it, she enters the building and realizes her thin summer dress is clinging to her like an old movie poster of The Deep. She stands in front of Melvin's apartment, twists herself to ease nervousness, and knocks on the door. Finally, Carol hears muffled throat clearing on the other side of the door. As we hear him unlock the door, Carol looks at her breasts and gasps, grasping the fabric and holding it straight out just as Melvin opens the door. His hair is standing on end with static, and he periodically gives it self-conscious pats. She pauses, beginning an extraordinarily long silence. Melvin’s reaction is an intense inner struggle not to scream or cry as he turns halfway from her, answering hoarsely. Carol is amused and surprised as two digital clocks on Melvin's nightstand tell us the time. He gets up, taps one foot on the floor twice and then the other foot twice more. He knocks on Simon's door, which opens quickly, and Simon walks painfully back to a chair. He rises and makes an awkward exit, leaving Simon puzzled and concerned. Carol is seated, working on a letter, trying to express her gratitude, with an enormous sheaf of completed pages sitting next to her.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He shuts the portal in her visage, and she remains there, stunned by the suddenness, halting briefly outside Simon's portal before proceeding on her route. The physician is absent, and mother and daughter are quarreling. He groans with agony, optimism, and unease as he responds. Simon rotates away from Melvin and Simon is in a wheelchair. Melvin halts as Simon sobs. Simon swings his limb and cast at Melvin—the sudden assault startles Melvin, but not as much as what ensues. Melvin heads for the portal but Simon obstructs him. Verdell gazes at Simon with concern. As Simon strives to cease weeping, Melvin is peculiar with discomfort. Simon glances up, his mood shifting swiftly, and he's enthralled, gazing apologetically at Simon in stoic devastation. Carol reclines in bed on the pullout couch. She walks to the kitchen, trembling as she sips a glass of water and exits. Carol crosses to Manhattan, appearing like she's on her route to a final examination where she has no idea of the topic. On a hot summer night, she disembarks the bus as the showers arrive. As Carol consults the slip of paper with the address on it, she enters the edifice and realizes her thin summer attire is adhering to her like an old cinema poster of The Deep. She stands in front of Melvin's apartment, contorts herself to ease nervousness, and raps on the portal. Finally, Carol hears muffled throat clearing on the other side of the portal. As we hear him unlatch the portal, Carol glances at her bosom and gasps, grasping the fabric and holding it straight out just as Melvin opens the portal. His hair is standing on end with static, and he periodically gives it self-conscious pats. She pauses, beginning an extraordinarily long silence. Melvin’s reaction is an intense internal struggle not to scream or sob as he turns halfway from her, answering hoarsely. Carol is amused and startled as two digital timepieces on Melvin's nightstand tell us the hour. He rises, taps one foot on the floor twice and then the other foot twice more. He raps on Simon's portal, which opens quickly, and Simon ambles painfully back to a chair. He rises and makes an awkward exit, leaving Simon perplexed and concerned. Carol is seated, working on a letter, attempting to convey her thankfulness, with an enormous bundle of completed pages sitting next to her."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The door is closed in her face by him, and there she stands, thrown by the abruptness. She pauses briefly outside Simon's door before her way is continued. The doctor has gone, and mother and daughter argue. Pain, hope, and anxiety cause him to grunt as he answers. Simon is wheeled away from Melvin, and he is in a wheelchair. Melvin is paused by Simon as he weeps. Melvin is jolted by the sudden attack when Simon swings his arm and cast at him, but it is not as much as what follows. The door is headed for by Melvin, but Simon blocks him. Simon is looked at with concern by Verdell. As crying is worked to be stopped by Simon, Melvin is made weird with discomfort. Simon looks up, his mood changing quickly, raptly looking at Simon in stoic ruin with an apologetic expression. The pullout sofa is lied on by Carol. She walks to the kitchen, trembling with a glass of water drank and an exit made. Manhattan is crossed to by Carol, looking like she's on her way to a final exam where the subject is unknown to her. The bus is gotten off by her as the rains come on a hot summer night. The slip of paper with the address on it is consulted by Carol as she enters the building and realizes her thin summer dress clings to her like an old movie poster of The Deep. Melvin's apartment is stood in front of by her, twisting herself to ease nervousness, and the door is knocked on by her. Finally, muffled throat clearing is heard by Carol on the other side of the door. The door is unlocked by him, and as Carol looks at her breasts and gasps, she grasps the fabric and holds it straight out just as the door is opened by Melvin. His hair is standing on end with static, and self-conscious pats are periodically given to it by him. An extraordinarily long silence is begun by her as she pauses. An intense inner struggle not to scream or cry is had as he turns halfway from her, answering hoarsely. Amusement and surprise are felt by Carol as two digital clocks on Melvin's nightstand tell us the time. The floor is tapped on twice by him with one foot and then twice more with the other foot as he gets up. Simon's door is knocked on by him, it opens quickly, and Simon painfully walks back to a chair. An awkward exit is made by him, leaving Simon puzzled and concerned. Carol, seated and working on a letter, tries to express her gratitude, with an enormous sheaf of completed pages sitting next to her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He shuts the door in her face, leaving her momentarily stunned outside Simon's door before moving on. The doctor is gone, and mother and daughter argue. He grunts with pain, hope, and anxiety as he responds. Simon, in a wheelchair, wheels away from Melvin. Melvin pauses as Simon weeps and swings his arm and cast at Melvin, startling him. Melvin heads for the door, but Simon blocks him. Verdell looks at Simon with concern. As Simon tries to stop crying, Melvin feels awkward. Simon's mood shifts, and he looks apologetically at Melvin. Carol lies on the pullout sofa, walks to the kitchen, trembles as she drinks water, and leaves. Carol crosses to Manhattan, appearing as if she's heading to an exam she’s unprepared for. On a hot summer night, she gets off the bus as it rains. Consulting a slip of paper with an address, she enters a building, realizing her thin dress clings to her like an old movie poster. She stands at Melvin's apartment, twists nervously, and knocks. Carol hears muffled throat clearing inside. As the door unlocks, she looks at her dress and gasps, holding it out as Melvin opens the door. His hair stands on end with static, and he pats it self-consciously. She pauses, creating a long silence. Melvin struggles not to scream or cry, turning halfway from her and answering hoarsely. Carol is amused and surprised as two digital clocks on Melvin's nightstand show the time. He gets up, taps each foot twice, and knocks on Simon's door, which opens quickly. Simon painfully returns to a chair. Melvin exits awkwardly, leaving Simon puzzled. Carol, seated, works on a letter of gratitude, with a large stack of completed pages beside her."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He shuts the door in her face, leaving her stunned outside Simon's door before moving on. The doctor is gone, and mother and daughter argue. He grunts with pain and anxiety as he responds. Simon, in a wheelchair, wheels away from Melvin. Simon swings his arm and cast at Melvin, startling him. Melvin heads for the door, but Simon blocks him. Verdell looks at Simon with concern. As Simon stops crying, Melvin feels awkward. Simon's mood shifts, and he looks apologetically at Melvin. Carol lies on the pullout sofa, walks to the kitchen, drinks water, and leaves. Carol crosses to Manhattan, appearing unprepared for an exam. On a hot night, she exits the bus as it rains. Carol checks an address and enters a building, her dress clinging like a movie poster. She stands at Melvin's door, twists nervously, and knocks. Carol hears a throat clearing and, as Melvin unlocks the door, she adjusts her dress. Melvin's hair is static, and he pats it self-consciously. She pauses in silence. Melvin struggles not to scream or cry, turning halfway from her and answering hoarsely. Carol is amused and surprised by two clocks on Melvin's nightstand. He gets up, taps his feet, and knocks on Simon's door, which opens quickly. Simon walks painfully to a chair. Melvin exits awkwardly, leaving Simon puzzled. Carol writes a letter of gratitude, with many completed pages beside her."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He abruptly closes the door right in her face, leaving her standing there, momentarily stunned by the suddenness of the action. She pauses briefly outside Simon's door, collecting herself before she continues on her way. Meanwhile, the doctor has already left, and inside, mother and daughter are engaged in a heated argument. He grunts, a sound filled with a mix of pain, hope, and anxiety, as he responds. Simon, who is confined to a wheelchair, wheels himself away from Melvin. Melvin pauses, observing as Simon begins to weep. In a sudden outburst, Simon swings his arm and cast at Melvin—the unexpected attack startles Melvin, but not as much as the events that follow. Melvin makes his way toward the door, but Simon positions himself to block him. Verdell, the dog, looks at Simon with a concerned expression. As Simon struggles to stop his tears, Melvin stands there, feeling awkward and uncomfortable. Simon looks up, his mood shifting rapidly, and he gazes at Melvin with an apologetic expression, his face a picture of stoic ruin. Meanwhile, Carol is lying in bed on the pullout sofa. She gets up and walks to the kitchen, her hands trembling as she drinks a glass of water before exiting. Carol makes her way across Manhattan, appearing as if she's heading to a final exam for which she has no idea of the subject matter. On a hot summer night, she steps off the bus just as the rains begin to fall. As Carol consults the slip of paper with the address written on it, she enters the building and realizes that her thin summer dress is clinging to her body like an old movie poster of The Deep. She stands in front of Melvin's apartment, twisting herself slightly to ease her nervousness, and knocks on the door. Finally, Carol hears a muffled throat clearing from the other side of the door. As the sound of the door unlocking reaches her ears, Carol glances down at her chest and gasps, quickly grasping the fabric of her dress and holding it straight out just as Melvin opens the door. His hair is standing on end with static, and he periodically gives it self-conscious pats. She pauses, initiating an extraordinarily long silence. Melvin’s reaction is an intense internal struggle as he fights not to scream or cry, turning halfway away from her and answering in a hoarse voice. Carol is both amused and surprised as she notices two digital clocks on Melvin's nightstand, which indicate the time. He gets up, tapping one foot on the floor twice and then repeating the action with the other foot. He knocks on Simon's door, which opens quickly, and Simon painfully walks back to a chair. He rises and makes an awkward exit, leaving Simon feeling puzzled and concerned. Carol is seated, diligently working on a letter, trying to express her gratitude, with an enormous sheaf of completed pages sitting next to her."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He shuts the door abruptly, almost slamming it directly in front of her face, leaving her momentarily stunned and bewildered by the sudden and unexpected nature of his action. She takes a brief pause outside Simon's door, gathering her thoughts and composure before she resumes her path forward. Meanwhile, the doctor has already departed, leaving behind the tense atmosphere inside, where a mother and daughter are embroiled in a heated and intense argument. He lets out a grunt, a sound that encapsulates a complex mix of pain, hope, and anxiety, as he responds. Simon, who is confined to his wheelchair, maneuvers himself away from Melvin with determination. Melvin stops in his tracks, observing as Simon, overwhelmed with emotion, begins to weep openly. In a sudden and unexpected outburst of frustration, Simon swings his arm and cast at Melvin—this unforeseen attack takes Melvin by surprise, but not nearly as much as the unfolding events that follow. Melvin proceeds to move toward the door, yet Simon strategically positions himself to block his path. Verdell, the attentive dog, observes Simon with a concerned expression, betraying his sympathy. As Simon struggles to control his tears, Melvin stands awkwardly, feeling a mix of discomfort and unease. Simon then looks up, his mood shifting rapidly, and offers Melvin an apologetic gaze, his face a picture of stoic ruin. In the meantime, Carol is lying in bed on the pullout sofa. She rises and slowly walks to the kitchen, her hands trembling slightly as she drinks a glass of water before making her exit. Carol makes her way across the bustling streets of Manhattan, appearing as though she is heading to a final exam for which she has no notion of the subject matter. On a hot and humid summer night, she steps off the bus just as the rain begins to fall from the skies. As Carol consults the slip of paper with the written address, she enters the building, realizing that her thin summer dress clings to her body like an old movie poster of The Deep. She stands in front of Melvin's apartment, twisting her body slightly to ease her nervousness, and knocks lightly on the door. Finally, Carol hears a muffled clearing of the throat from the other side of the door. As the sound of the door unlocking reaches her ears, she glances down at her chest and gasps, swiftly grasping the fabric of her dress and holding it away from her body just as Melvin pulls open the door. His hair is standing on end with static, and he periodically gives it self-conscious pats. She pauses, initiating an extraordinarily long and pregnant silence. Melvin’s reaction is a fierce internal struggle as he battles not to scream or cry, turning halfway away from her and answering in a hoarse voice. Carol is both amused and surprised by the sight of two digital clocks on Melvin's nightstand, which clearly show the time. He stands up, tapping one foot on the floor twice and then repeating this peculiar action with the other foot. He knocks on Simon's door, which opens swiftly, and Simon painfully makes his way back to a chair. He rises awkwardly and exits, leaving Simon feeling puzzled and concerned. Carol remains seated, diligently crafting a letter, striving to express her heartfelt gratitude, with an enormous sheaf of completed pages stacked neatly next to her."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He closes the door in her face, leaving her standing there, momentarily stunned by the abruptness of the action. She pauses briefly outside Simon's door, collecting her thoughts before she resumes her path. Meanwhile, the doctor has already left, and a heated argument ensues between mother and daughter. He responds with a grunt that is a mix of pain, hope, and anxiety. Simon, who is in a wheelchair, wheels himself away from Melvin, creating a physical distance between them. Melvin halts in his tracks as Simon begins to weep, the emotional display causing Melvin to pause. In a sudden outburst, Simon swings his arm, encased in a cast, at Melvin, the unexpected attack startling Melvin, though it is the subsequent events that truly unsettle him. Melvin makes a move towards the door, intending to leave, but Simon positions himself to block his path. Verdell, observing the scene, looks at Simon with a concerned expression. As Simon struggles to regain his composure and stop crying, Melvin stands awkwardly, feeling a sense of discomfort that he cannot quite shake off. Simon's mood shifts rapidly as he looks up, his expression changing to one of rapt attention, and he gazes at Melvin with an apologetic look, his face a picture of stoic ruin. Meanwhile, Carol lies in bed on the pullout sofa, eventually rising to walk to the kitchen. Her hands tremble slightly as she drinks a glass of water before she exits. Carol makes her way across Manhattan, her demeanor suggesting she is heading to a final exam for which she feels unprepared. On a hot summer night, she steps off the bus just as the rain begins to fall. Consulting a slip of paper with an address on it, she enters a building, realizing that her thin summer dress is now clinging to her body like an old movie poster of The Deep. Standing in front of Melvin's apartment, she twists her body slightly, trying to ease her nervousness, and knocks on the door. After a moment, she hears a muffled throat clearing from the other side. As the sound of the door unlocking reaches her ears, Carol glances down at her chest and gasps, quickly grasping the fabric of her dress and holding it away from her body just as Melvin opens the door. His hair is standing on end with static, and he occasionally pats it down self-consciously. She pauses, initiating an extraordinarily long silence. Melvin's reaction is an intense internal battle as he struggles not to scream or cry, turning halfway away from her and responding in a hoarse voice. Carol is both amused and surprised as she notices two digital clocks on Melvin's nightstand, indicating the time. He rises from his seat, tapping one foot on the floor twice, followed by the other foot twice more, before he knocks on Simon's door. The door opens quickly, and Simon walks back to a chair with visible pain. Melvin then rises and makes an awkward exit, leaving Simon with a puzzled and concerned expression. Meanwhile, Carol is seated, diligently working on a letter, trying to articulate her gratitude, with a large stack of completed pages sitting beside her."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He abruptly closes the door in her face, leaving her momentarily stunned before she continues on her way. Inside, the doctor has left, and a mother and daughter are arguing. Simon, in a wheelchair, grunts with a mix of pain, hope, and anxiety as he responds to Melvin. After Simon wheels away, he suddenly swings his arm and cast at Melvin, startling him. Melvin heads for the door, but Simon blocks him, while Verdell looks on with concern. As Simon struggles to stop crying, Melvin stands awkwardly, discomforted by the situation. Simon's mood shifts quickly, and he looks up apologetically at Melvin, who is left in stoic ruin. Meanwhile, Carol lies in bed on the pullout sofa, then walks to the kitchen, trembling as she drinks a glass of water before leaving. She crosses to Manhattan, appearing anxious as if heading to an exam she is unprepared for. On a hot summer night, she gets off the bus in the rain, checks the address on a slip of paper, and enters a building. Her thin summer dress clings to her like an old movie poster as she stands nervously in front of Melvin's apartment and knocks. Hearing a muffled throat clearing, she adjusts her dress just as Melvin, with static hair, opens the door. An extraordinarily long silence follows as Melvin struggles internally not to scream or cry, turning halfway from her and answering hoarsely. Carol is amused and surprised by the two digital clocks on Melvin's nightstand. Melvin gets up, taps each foot twice on the floor, and knocks on Simon's door, which opens quickly. Simon walks painfully back to a chair, and Melvin makes an awkward exit, leaving Simon puzzled and concerned. Carol, seated and working on a letter, tries to express her gratitude, with a large stack of completed pages beside her."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He closes the door in her face, and she stands there, thrown by the abruptness, pausing briefly outside Simon's door—Simon, a talented but struggling artist known for his evocative portraits—before continuing on her way. The doctor is gone, and mother and daughter, who have a complicated relationship involving years of misunderstandings, are arguing. He grunts with pain, hope flickering as he wrestles with it following a recent surgery, and anxiety as he answers. Simon wheels away from Melvin, and Simon is in a wheelchair due to a car accident that left him partially paralyzed. Melvin pauses as Simon weeps, overwhelmed by emotions. Simon swings his arm and cast—his arm broken during the same accident—at Melvin, the sudden attack jolts Melvin, but not as much as what follows. Melvin heads for the door but Simon, determined not to let him leave yet, blocks him. Verdell, Melvin's beloved dog known for his keen understanding of human emotions, looks at Simon with concern. As Simon works to stop crying, Melvin is weird with discomfort, unused to such raw emotion. Simon looks up, his mood changing quickly, and he's rapt, looking apologetically at Simon in stoic ruin, echoing a recent painting of his depicting tragedy and empathy. Carol lies in bed on the pullout sofa, a temporary arrangement after she left her previous living situation. She walks to the kitchen, trembling as she drinks a glass of water, the cold liquid reflected on the glass' surface in the dim light, and exits. Carol crosses to Manhattan, the bustling heart of New York City, looking like she's on her way to a final exam where she has no idea of the subject, the city's vibrant streets adding to her anxiety. On a hot summer night, she gets off the bus as the rains come, a typical sudden downpour in New York. As Carol consults the slip of paper with the address on it, she enters the building and realizes her thin summer dress is clinging to her like an old movie poster of The Deep, a film known for its iconic underwater scenes. She stands in front of Melvin's apartment, twisting herself to ease nervousness, and knocks on the door. Finally, Carol hears muffled throat clearing on the other side of the door. As we hear him unlock the door, Carol looks at her breasts and gasps, grasping the fabric and holding it straight out just as Melvin opens the door. His hair is standing on end with static, the result of his recent struggle with a faulty electric heater, and he periodically gives it self-conscious pats. She pauses, beginning an extraordinarily long silence. Melvin’s reaction is an intense inner struggle not to scream or cry as he turns halfway from her, answering hoarsely, a reflection of his usual difficulty with expressing emotions. Carol is amused and surprised as two digital clocks on Melvin's nightstand, a testament to his obsession with precision and punctuality, tell us the time. He gets up, taps one foot on the floor twice and then the other foot twice more, part of a compulsive ritual to ensure balance. He knocks on Simon's door, which opens quickly, and Simon walks painfully back to a chair, his injuries still healing. He rises and makes an awkward exit, leaving Simon puzzled and concerned over his behavior. Carol is seated, working on a letter, trying to express her gratitude, with an enormous sheaf of completed pages sitting next to her, her dedication to gratitude stemming from support she received during her toughest times."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He closes the door in her face and she stands there thrown by the abruptness pausing briefly outside Simon's door before continuing on her way. The doctor is gone and mother and daughter are arguing. He grunts with pain hope and anxiety as he answers. Simon wheels away from Melvin and Simon is in a wheelchair. Melvin pauses as Simon weeps. Simon swings his arm and cast at Melvin—the sudden attack jolts Melvin but not as much as what follows. Melvin heads for the door but Simon blocks him. Verdell looks at Simon with concern. As Simon works to stop crying Melvin is weird with discomfort. Simon looks up his mood changing quickly and he is rapt looking apologetically at Simon in stoic ruin. Carol lies in bed on the pullout sofa. She walks to the kitchen trembling as she drinks a glass of water and exits. Carol crosses to Manhattan looking like she is on her way to a final exam where she has no idea of the subject. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On a hot summer night she gets off the bus as the rains come. As Carol consults the slip of paper with the address on it she enters the building and realizes her thin summer dress is clinging to her like an old movie poster of The Deep. She stands in front of Melvin's apartment twists herself to ease nervousness and knocks on the door. Finally Carol hears muffled throat clearing on the other side of the door. As we hear him unlock the door Carol looks at her breasts and gasps grasping the fabric and holding it straight out just as Melvin opens the door. His hair is standing on end with static and he periodically gives it selfconscious pats. She pauses beginning an extraordinarily long silence. Melvin’s reaction is an intense inner struggle not to scream or cry as he turns halfway from her answering hoarsely. Carol is amused and surprised as two digital clocks on Melvin's nightstand. tell us the time. He gets up taps one foot on the floor twice and then the other foot twice more. He knocks on Simon's door which opens quickly and Simon walks painfully back to a chair. He rises and makes an awkward exit leaving Simon puzzled and concerned. Carol is seated working on a letter trying to express her gratitude with an enormous sheaf of completed pages sitting next to her."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He closes the door in her face and she stands there thrown by the abruptness pausing briefly outside Simon's door before continuing on her way. The doctor is gone and mother and daughter are arguing. He grunts with pain hope and anxiety as he answers. Simon wheels away from Melvin and Simon is in a wheelchair. Melvin pauses as Simon weeps. Simon swings his arm and cast at Melvin—the sudden attack jolts Melvin but not as much as what follows. Melvin heads for the door but Simon blocks him. Verdell looks at Simon with concern. As Simon works to stop crying Melvin is weird with discomfort. Simon looks up his mood changing quickly and he is rapt looking apologetically at Simon in stoic ruin. Carol lies in bed on the pullout sofa. She walks to the kitchen trembling as she drinks a glass of water and exits. Carol crosses to Manhattan looking like she is on her way to a final exam where she has no idea of the subject. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a hot summer night she gets off the bus as the rains come. As Carol consults the slip of paper with the address on it she enters the building and realizes her thin summer dress is clinging to her like an old movie poster of The Deep. She stands in front of Melvin's apartment twists herself to ease nervousness and knocks on the door. Finally Carol hears muffled throat clearing on the other side of the door. As we hear him unlock the door Carol looks at her breasts and gasps grasping the fabric and holding it straight out just as Melvin opens the door. His hair is standing on end with static and he periodically gives it selfconscious pats. She pauses beginning an extraordinarily long silence. Melvin’s reaction is an intense inner struggle not to scream or cry as he turns halfway from her answering hoarsely. Carol is amused and surprised as two digital clocks on Melvin's nightstand. tell us the time. He gets up taps one foot on the floor twice and then the other foot twice more. He knocks on Simon's door which opens quickly and Simon walks painfully back to a chair. He rises and makes an awkward exit leaving Simon puzzled and concerned. Carol is seated working on a letter trying to express her gratitude with an enormous sheaf of completed pages sitting next to her."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He closes the door in her face and she stands there thrown by the abruptness pausing briefly outside Simon's door before continuing on her way. The doctor is gone and mother and daughter are arguing. He grunts with pain hope and anxiety as he answers. Simon wheels away from Melvin and Simon is in a wheelchair. Melvin pauses as Simon weeps. Simon swings his arm and cast at Melvin—the sudden attack jolts Melvin but not as much as what follows. Melvin heads for the door but Simon blocks him. Melvin’s reaction is an intense inner struggle not to scream or cry as he turns halfway from her answering hoarsely. Carol is amused and surprised as two digital clocks on Melvin's nightstand. tell us the time. He gets up taps one foot on the floor twice and then the other foot twice more. He knocks on Simon's door which opens quickly and Simon walks painfully back to a chair. He rises and makes an awkward exit leaving Simon puzzled and concerned. Carol is seated working on a letter trying to express her gratitude with an enormous sheaf of completed pages sitting next to her."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He closes the door in her face and she stands there thrown by the abruptness pausing briefly outside Simon's door before continuing on her way. The doctor is gone and mother and daughter are arguing. He grunts with pain hope and anxiety as he answers. He knocks on Simon's door which opens quickly and Simon walks painfully back to a chair. He rises and makes an awkward exit leaving Simon puzzled and concerned. Carol is seated working on a letter trying to express her gratitude with an enormous sheaf of completed pages sitting next to her."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The cat shuts the window in the owl's beak, and the owl perches there, startled by the suddenness, pausing briefly outside Leo's window before fluttering on its way. The blacksmith is vanished, and uncle and niece are debating. The frog hiccups with pleasure, despair, and excitement as it replies. Leo rolls away from Carlos and Leo is on a skateboard. Carlos halts as Leo sobs. Leo flings his leg and shoe at Carlos—the sudden blitz startles Carlos, but not as much as what ensues. Carlos strides for the window but Leo obstructs him. The hedgehog glances at Leo with worry. As Leo attempts to cease sobbing, Carlos is odd with unease. Leo glances up, his spirits shifting abruptly, and he's captivated, gazing remorsefully at Leo in resolute disarray. Rose rests in a hammock on the patio. She strolls to the balcony, quivering as she sips a cup of coffee and departs. Rose sails to Brooklyn, appearing like she's on her way to a math quiz where she has no clue of the topic. On a warm autumn afternoon, she leaps off the boat as the snows arrive. As Rose references the ticket with the number on it, she enters the tower and realizes her wool coat is sticking to her like an ancient cinema poster of Titanic. She stands in front of Carlos's cupboard, spins herself to ease jitters, and raps on the window. At last, Rose hears muffled sneezing on the other side of the window. As we hear him unlatch the window, Rose glances at her shoes and gasps, clutching the material and holding it straight out just as Carlos opens the window. His hat is standing on end with dust, and he occasionally gives it awkward pats. She hesitates, beginning an unimaginably lengthy pause. Carlos’s reaction is an intense internal battle not to shout or laugh as he pivots halfway from her, replying softly. Rose is entertained and astonished as two digital photos on Carlos's shelf show us the time. He stands up, taps one paw on the mat twice and then the other paw twice more. He raps on Leo's window, which opens swiftly, and Leo hobbles slowly back to a bench. He stands and makes an unsteady exit, leaving Leo baffled and worried. Rose is perched, crafting a story, attempting to convey her appreciation, with a gigantic pile of finished pages stacking beside her."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Melvin abruptly shuts the door, leaving Carol momentarily stunned outside Simon's apartment. Inside, mother and daughter argue as Simon, in a wheelchair, grapples with pain, hope, and anxiety. An emotional exchange follows between Simon and Melvin, ending in a sudden attack from Simon, which leaves Melvin uncomfortable. Verdell watches with concern as Simon weeps, then looks apologetically at Melvin. Carol, anxious and introspective, arrives at Melvin's place, soaked from rain, and nervously knocks on his door. As Melvin opens the door, struggling to mask his emotions, Carol is amused by his disheveled appearance. Inside, Melvin performs a peculiar routine before knocking on Simon's door, leaving him confused. Meanwhile, Carol attempts to write a letter expressing her gratitude, surrounded by numerous completed pages."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Carol is seated working on a letter trying to express her gratitude with an enormous sheaf of completed pages sitting next to her He rises and makes an awkward exit leaving Simon puzzled and concerned  He knocks on Simon's door which opens quickly and Simon walks painfully back to a chair  He gets up taps one foot on the floor twice and then the other foot twice more  tell us the time  Carol is amused and surprised as two digital clocks on Melvin's nightstand  Melvin’s reaction is an intense inner struggle not to scream or cry as he turns halfway from her answering hoarsely  She pauses beginning an extraordinarily long silence  His hair is standing on end with static and he periodically gives it selfconscious pats  As we hear him unlock the door Carol looks at her breasts and gasps grasping the fabric and holding it straight out just as Melvin opens the door  Finally Carol hears muffled throat clearing on the other side of the door  She stands in front of Melvin's apartment twists herself to ease nervousness and knocks on the door  As Carol consults the slip of paper with the address on it she enters the building and realizes her thin summer dress is clinging to her like an old movie poster of The Deep  On a hot summer night she gets off the bus as the rains come  Carol crosses to Manhattan looking like she's on her way to a final exam where she has no idea of the subject  She walks to the kitchen trembling as she drinks a glass of water and exits  Carol lies in bed on the pullout sofa  Simon looks up his mood changing quickly and he's rapt looking apologetically at Simon in stoic ruin  As Simon works to stop crying Melvin is weird with discomfort  Verdell looks at Simon with concern  Melvin heads for the door but Simon blocks him  Simon swings his arm and cast at Melvin—the sudden attack jolts Melvin but not as much as what follows  Melvin pauses as Simon weeps  Simon wheels away from Melvin and Simon is in a wheelchair  He grunts with pain hope and anxiety as he answers  The doctor is gone and mother and daughter are arguing  He closes the door in her face and she stands there thrown by the abruptness pausing briefly outside Simon's door before continuing on her way "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The doctor is gone and mother and daughter are arguing He closes the door in her face and she stands there thrown by the abruptness pausing briefly outside Simon's door before continuing on her way Simon wheels away from Melvin and Simon is in a wheelchair He grunts with pain hope and anxiety as he answers Simon swings his arm and cast at Melvin—the sudden attack jolts Melvin but not as much as what follows Melvin pauses as Simon weeps Verdell looks at Simon with concern Melvin heads for the door but Simon blocks him Simon looks up his mood changing quickly and he is rapt looking apologetically at Simon in stoic ruin As Simon works to stop crying Melvin is weird with discomfort She walks to the kitchen trembling as she drinks a glass of water and exits Carol lies in bed on the pullout sofa On a hot summer night she gets off the bus as the rains come Carol crosses to Manhattan looking like she is on her way to a final exam where she has no idea of the subject She stands in front of Melvin's apartment twists herself to ease nervousness and knocks on the door As Carol consults the slip of paper with the address on it she enters the building and realizes her thin summer dress is clinging to her like an old movie poster of The Deep As we hear him unlock the door Carol looks at her breasts and gasps grasping the fabric and holding it straight out just as Melvin opens the door Finally Carol hears muffled throat clearing on the other side of the door She pauses beginning an extraordinarily long silence His hair is standing on end with static and he periodically gives it selfconscious pats Carol is amused and surprised as two digital clocks on Melvin's nightstand Melvin’s reaction is an intense inner struggle not to scream or cry as he turns halfway from her answering hoarsely He gets up taps one foot on the floor twice and then the other foot twice more tell us the time He rises and makes an awkward exit leaving Simon puzzled and concerned He knocks on Simon's door which opens quickly and Simon walks painfully back to a chair Carol is seated working on a letter trying to express her gratitude with an enormous sheaf of completed pages sitting next to her"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "As Carol consults the slip of paper with the address on it she enters the building and realizes her thin summer dress is clinging to her like an old movie poster of The Deep  She stands in front of Melvin's apartment twists herself to ease nervousness and knocks on the door  Finally Carol hears muffled throat clearing on the other side of the door  As we hear him unlock the door Carol looks at her breasts and gasps grasping the fabric and holding it straight out just as Melvin opens the door  His hair is standing on end with static and he periodically gives it selfconscious pats  She pauses beginning an extraordinarily long silence  Melvin’s reaction is an intense inner struggle not to scream or cry as he turns halfway from her answering hoarsely  Carol is amused and surprised as two digital clocks on Melvin's nightstand  tell us the time  He gets up taps one foot on the floor twice and then the other foot twice more  He knocks on Simon's door which opens quickly and Simon walks painfully back to a chair  He rises and makes an awkward exit leaving Simon puzzled and concerned  Carol is seated working on a letter trying to express her gratitude with an enormous sheaf of completed pages sitting next to her He closes the door in her face and she stands there thrown by the abruptness pausing briefly outside Simon's door before continuing on her way  The doctor is gone and mother and daughter are arguing  He grunts with pain hope and anxiety as he answers  Simon wheels away from Melvin and Simon is in a wheelchair  Melvin pauses as Simon weeps  Simon swings his arm and cast at Melvin—the sudden attack jolts Melvin but not as much as what follows  Melvin heads for the door but Simon blocks him  Verdell looks at Simon with concern  As Simon works to stop crying Melvin is weird with discomfort  Simon looks up his mood changing quickly and he's rapt looking apologetically at Simon in stoic ruin  Carol lies in bed on the pullout sofa  She walks to the kitchen trembling as she drinks a glass of water and exits  Carol crosses to Manhattan looking like she's on her way to a final exam where she has no idea of the subject  On a hot summer night she gets off the bus as the rains come "
        }
      ]
    }
  ]
}