{
  "ground_truth": "Gebczynski comes up behind him, and he closes the cupboard. Gebczynski makes for the front door, stops, hands over a scrap of paper, shakes Szpilman's hand, and goes quickly. Alone, Szpilman stands, lost for a moment, then takes off his shoe and stuffs the scrap of paper into it. While he does so, his eyes light on the divan bed, and he goes to it, slips off his other shoe, and lies down, testing the divan's springiness with his whole body, then smiles beatifically. He shuts his eyes and is instantly asleep. Szpilman is still fast asleep, but voices wake him, and he opens his eyes. He's not certain where he is for a moment but hears the voices again, coming from the adjoining flat. Intrigued, he rises, goes closer to the wall, puts his ear against it, and listens. Szpilman is enjoying himself, then the sound of a piano being played with great feeling but a lot of wrong notes comes. The piano continues for a moment but suddenly stops, and a door slams. She hands him the parcel, and he goes into the small kitchen and unpacks the contents while Janina gazes out of the window. She turns to look again out of the window at the building burning, corpses lie scattered on the pavement, Germans stand about chatting and laughing, and a handful of Jewish fighters are lined up and shot. Blazing sun. The ghetto buildings are now burned-out shells, the street empty, autumn leaves falling and gusting in the wind. Szpilman gazes out. Snow. Ice on the windows and the sound of the key in the door. Szpilman turns as the door opens, and Gebczynski enters, distraught, whispered, at speed. Gebczynski takes out a cigarette and lights it. While he does so, he goes, and Szpilman listens to his footsteps clattering down the stairs. He sees the cigarette stub, takes it, lights it, coughs, and smokes awkwardly. Szpilman hears a car engine and the screech of brakes and tenses. German voices shout and their heavy footsteps on the stairs. He goes to the window, opens it, and gets a chair, places it sideways in front of the window to make a step, working out how best to throw himself out. He leans against the wall near the door and waits. Slamming of doors, German shouts, a scream, and Szpilman steels himself, ready to jump. Again footsteps on the stairs, but this time descending, and a door slams. He cautiously goes to the window and looks out. In the street below, he sees SS men escorting two prisoners and shoving them into a car, which then speeds off. The street is empty. Snow. Howling wind. Szpilman lies on the divan, cold, unshaven, hair filthy and long. He manages to rise.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Gebczynski approaches from behind him, and he shuts the cabinet. Gebczynski heads for the front entrance, pauses, hands over a fragment of paper, shakes Szpilman's hand, and departs swiftly. Alone, Szpilman stands, bewildered for a moment, then removes his shoe and stuffs the fragment of paper into it. While he does so, his eyes fall on the couch bed, and he moves to it, removes his other shoe, and reclines, testing the couch's elasticity with his entire body, then smiles blissfully. He closes his eyes and is instantly asleep. Szpilman is still fast asleep, but voices awaken him, and he opens his eyes. He's not sure where he is for a moment but hears the voices again, coming from the neighboring apartment. Curious, he rises, goes closer to the wall, presses his ear against it, and listens. Szpilman is enjoying himself, then the sound of a piano being played with great emotion but a lot of incorrect notes comes. The piano continues for a moment but suddenly halts, and a door bangs. She hands him the package, and he goes into the small galley and unpacks the items while Janina watches out of the window. She turns to look again out of the window at the building burning, corpses lie scattered on the sidewalk, Germans stand about chatting and laughing, and a handful of Jewish fighters are lined up and shot. Blazing sun. The ghetto buildings are now burned-out shells, the street empty, autumn leaves descending and swirling in the wind. Szpilman watches out. Snow. Ice on the windows and the sound of the key in the entrance. Szpilman turns as the entrance opens, and Gebczynski enters, distressed, whispered, rapidly. Gebczynski takes out a cigarette and ignites it. While he does so, he leaves, and Szpilman listens to his footsteps clattering down the stairs. He sees the cigarette butt, takes it, ignites it, coughs, and smokes awkwardly. Szpilman hears a car engine and the screech of brakes and tenses. German voices yell and their heavy footsteps on the stairs. He goes to the window, opens it, and gets a chair, places it sideways in front of the window to make a step, figuring out how best to throw himself out. He leans against the wall near the entrance and waits. Banging of doors, German shouts, a scream, and Szpilman steels himself, ready to leap. Again footsteps on the stairs, but this time descending, and an entrance slams. He cautiously goes to the window and looks out. In the street below, he sees SS men escorting two captives and pushing them into a car, which then speeds off. The street is vacant. Snow. Howling wind. Szpilman lies on the couch, cold, unshaven, hair dirty and long. He manages to rise."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Gebczynski is approached by him from behind, and the cupboard is closed by him. The front door is made for by Gebczynski, who stops, hands over a scrap of paper, shakes Szpilman's hand, and goes quickly. Alone, Szpilman stands, lost for a moment, then his shoe is taken off by him, and the scrap of paper is stuffed into it. While doing so, the divan bed is noticed by his eyes, and he goes to it, slips off his other shoe, and lies down, testing the divan's springiness with his whole body, then a beatific smile appears on his face. His eyes are shut by him, and he is instantly asleep. Szpilman is still fast asleep, but the voices wake him, and his eyes are opened by him. He's not certain where he is for a moment but hears the voices again, coming from the adjoining flat. Intrigued, he rises, goes closer to the wall, puts his ear against it, and listens. Szpilman is enjoying himself, then he hears the sound of a piano being played with great feeling but with a lot of wrong notes. The piano continues for a moment but suddenly stops, and a door is slammed. The parcel is handed to him by her, and he goes into the small kitchen and unpacks the contents while Janina gazes out of the window. She turns to look again out of the window at the burning building, corpses lie scattered on the pavement, Germans stand about chatting and laughing, and they line up a handful of Jewish fighters and shoot them. Blazing sun. The ghetto buildings are now burned-out shells, the street empty, with autumn leaves falling and gusting in the wind. Szpilman gazes out. Snow. Ice is on the windows, and the sound of the key is heard by him in the door. Szpilman turns as the door opens, and Gebczynski enters, distraught, whispers, at speed. A cigarette is taken out by Gebczynski and lit. While doing so, he goes, and Szpilman listens to his footsteps clattering down the stairs. The cigarette stub is seen by him, taken, lit, and awkwardly smoked, causing a cough. Szpilman hears a car engine and the screech of brakes, tensing him. German voices shout, and their heavy footsteps are heard by him on the stairs. He goes to the window, opens it, and a chair is gotten by him, placed sideways in front of the window to make a step, working out how best to throw himself out. He leans against the wall near the door and waits. Slamming of doors, German shouts, a scream, and Szpilman steels himself, ready to jump. Again footsteps are heard on the stairs by him, but this time descending, and a door slams. He cautiously goes to the window and looks out. In the street below, SS men are seen by him escorting two prisoners and shoving them into a car, which then speeds off. The street is empty. Snow. Howling wind. The divan is lain on by Szpilman, cold, unshaven, hair filthy and long. He manages to rise."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Gebczynski approaches as he shuts the cupboard. Heading to the door, Gebczynski pauses, hands Szpilman a scrap of paper, shakes his hand, and quickly leaves. Szpilman, alone, stands briefly lost, then hides the paper in his shoe. Spotting the divan bed, he removes his other shoe, lies down, tests the mattress, smiles, and instantly falls asleep. Still asleep, Szpilman is awakened by voices. Disoriented, he listens and hears them from the neighboring flat. Curious, he presses his ear to the wall. As he enjoys eavesdropping, a piano plays passionately but poorly, then abruptly stops with a door slam. A woman gives him a parcel. In the small kitchen, he unpacks it while Janina gazes out at a burning building, corpses on the pavement, Germans laughing, and Jewish fighters being executed. The sun blazes. Ghetto buildings are charred shells, streets empty, autumn leaves swirling. Szpilman stares out. Snow falls, ice covers windows. A key turns in the door—Gebczynski enters, frantic, whispering. Lighting a cigarette, he exits. Szpilman hears his footsteps fade. He finds the stub, lights it, coughs, and smokes. A car engine roars, brakes screech, German voices shout, and boots pound the stairs. Szpilman opens a window, uses a chair as a step, planning to jump. He waits near the door, tense. Shouts, slamming doors, and a scream follow. Footsteps descend, and a door slams. He peeks out—SS men shove two prisoners into a car and drive away. The street is empty. Snow swirls. Szpilman lies on the divan—cold, dirty, hair long—then manages to get up."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Gebczynski approaches, Szpilman shuts the cupboard. Gebczynski heads to the door, stops, hands him a paper, shakes hands, and leaves quickly. Alone, Szpilman hides the paper in his shoe, notices the divan, removes his other shoe, lies down, tests it, smiles, and instantly falls asleep. Voices wake him; confused, he listens through the wall. A piano plays passionately but off-key, then stops with a door slam. She gives him a parcel; he unpacks it in the kitchen as Janina watches a burning building, corpses, Germans laughing, Jewish fighters shot. The ghetto is ruined, leaves blow. Szpilman watches. Snow. Ice. Gebczynski returns in distress, lights a cigarette, leaves. Szpilman smokes the stub, coughs. A car screeches. German voices and footsteps approach. He sets a chair at the window, ready to jump. Shouts, a scream—he braces. Steps descend, a door slams. He peeks out: SS men shove two prisoners into a car. The street empties. Snow. Wind. Szpilman, filthy and cold, lies on the divan, then rises."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Gebczynski quietly approaches from behind, and Szpilman, sensing his presence, promptly closes the cupboard. Gebczynski makes his way toward the front door but pauses momentarily. He hands over a small scrap of paper, shakes Szpilman's hand firmly, and then departs quickly. Left alone, Szpilman stands there, momentarily lost in thought. He then removes one of his shoes and carefully stuffs the scrap of paper inside it for safekeeping. As he does this, his eyes wander to the divan bed. He approaches it, slips off his other shoe, and lies down, testing the divan's springiness with his entire body. A serene smile spreads across his face as he shuts his eyes and falls instantly into a deep sleep. \n\nSzpilman remains in a deep slumber until the sound of voices stirs him awake. He opens his eyes, momentarily disoriented, unsure of his surroundings. The voices, however, continue to drift in from the adjoining flat, piquing his curiosity. Intrigued, he rises from the divan, moves closer to the wall, and presses his ear against it to listen more intently. Szpilman finds himself enjoying the eavesdropping experience, but then the sound of a piano being played with great emotion, albeit with many wrong notes, reaches his ears. The piano music continues for a brief moment before abruptly stopping, followed by the slamming of a door.\n\nShe hands him a parcel, and he retreats into the small kitchen to unpack its contents while Janina stands by the window, gazing out. She turns her attention back to the window, observing the building engulfed in flames. Corpses lie scattered on the pavement below, while German soldiers stand around, chatting and laughing. A small group of Jewish fighters is lined up and executed. The blazing sun beats down mercilessly. The ghetto buildings have been reduced to burned-out shells, the street is eerily empty, and autumn leaves fall, swirling in the gusting wind. Szpilman gazes out at the scene. Snow begins to fall, ice forms on the windows, and the sound of a key turning in the door reaches his ears. Szpilman turns as the door opens, and Gebczynski enters, appearing distraught and whispering urgently. Gebczynski takes out a cigarette, lights it, and then departs, his footsteps echoing as he clatters down the stairs. Szpilman notices the cigarette stub, picks it up, lights it, and awkwardly smokes, coughing as he does so.\n\nSuddenly, Szpilman hears the roar of a car engine and the screeching of brakes, causing him to tense up. German voices shout, and he hears their heavy footsteps ascending the stairs. He moves to the window, opens it, and retrieves a chair, placing it sideways in front of the window to use as a step, contemplating how best to throw himself out. He leans against the wall near the door, waiting tensely. The slamming of doors, German shouts, and a scream fill the air, and Szpilman steels himself, ready to jump. Once more, footsteps echo on the stairs, but this time they are descending, followed by the slamming of a door. Cautiously, he approaches the window and peers out. In the street below, he observes SS men escorting two prisoners, roughly shoving them into a car, which then speeds away. The street is now empty. Snow falls, and the wind howls. Szpilman lies on the divan, feeling cold, unshaven, his hair filthy and long. With effort, he manages to rise."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Gebczynski approaches quietly and unassumingly from behind, and Szpilman, sensing his presence as if guided by intuition, promptly closes the cupboard door without delay. Gebczynski makes his way toward the front door but pauses for a moment as if caught in thought. He then hands over a small scrap of paper, shakes Szpilman's hand with a firm grip, and subsequently departs quickly, leaving Szpilman standing alone. Left to his own devices, Szpilman stands there in the silent room, momentarily lost in thought. After a brief pause, he removes one of his shoes and carefully stuffs the scrap of paper inside it for safekeeping. As he performs this task, his eyes wander to the divan bed in the room. He approaches it, slips off his other shoe with deliberate care, and lies down, testing the divan's springiness with his entire body. A serene smile gently spreads across his face, and he shuts his eyes, falling almost instantly into a deep, restful sleep.\n\nSzpilman remains in a profound slumber until the sound of voices stirs him from his tranquil rest. He opens his eyes, momentarily caught in a state of disorientation, unsure of his surroundings. The voices, however, continue to drift in from the adjoining flat, capturing his interest and piquing his curiosity. Intrigued by the commotion, he rises from the divan, moves closer to the wall, and presses his ear against it, listening more intently. Szpilman finds himself captivated by the eavesdropping experience, but then the sound of a piano being played with great emotion, albeit with many wrong notes, reaches his ears. The imperfect piano music continues for a brief moment before abruptly stopping, followed by the sharp, echoing slamming of a door.\n\nShe hands him a parcel, and he retreats into the small, cramped kitchen to unpack its contents, while Janina stands by the window, gazing out into the world beyond. She turns her attention back toward the window, observing the building engulfed in ferocious flames. Corpses lie scattered across the pavement below, while German soldiers stand around, chatting, and laughing as if in another world. A small group of Jewish fighters is lined up mercilessly and executed. The blazing sun beats down on the scene with merciless intensity. The ghetto buildings have been reduced to nothing but burned-out shells, the street is eerily empty, and autumn leaves fall, swirling in the gusting wind. Szpilman gazes out at this haunting scene. Snow begins to fall gently, ice forms on the windows, and the distinct sound of a key turning in the door reaches his ears. Szpilman turns as the door opens, and Gebczynski enters, appearing distraught and whispering urgently, underlining the gravity of the moment. Gebczynski takes out a cigarette, lights it, and then departs, his footsteps echoing as he clatters loudly down the stairs. Szpilman notices the cigarette stub left behind, picks it up, lights it, and awkwardly tries to smoke, coughing as he does so.\n\nSuddenly, Szpilman hears the roar of a car engine and the screeching of brakes, causing him to tense up with apprehension. German voices shout commands, and he hears their heavy footsteps ascending the stairs with purpose. He moves swiftly to the window, opens it, and retrieves a chair, placing it sideways in front of the window to use as a step, contemplating the best way to throw himself out if it becomes necessary. He leans tensely against the wall near the door, waiting anxiously for what might come next. The slamming of doors, German shouts, and a single scream fill the air, and Szpilman steels himself, ready to jump if it comes to that. Once more, footsteps echo on the stairs, but this time they are descending, followed by the definitive slamming of a door. Cautiously, he approaches the window and peers out. In the street below, he observes SS men escorting two prisoners, roughly shoving them into a waiting car, which then speeds away with urgency. The street is now deserted. Snow falls steadily, and the wind howls through the empty streets. Szpilman lies back down on the divan, feeling cold, unshaven, his hair filthy and long. With effort, he manages to summon enough strength to rise."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Gebczynski quietly approaches from behind, prompting him to gently close the cupboard door. With a determined stride, Gebczynski heads toward the front door but pauses momentarily to hand over a small scrap of paper. He then extends his hand for a firm handshake with Szpilman before quickly departing. Left alone, Szpilman stands still, momentarily lost in thought, before deciding to remove one of his shoes. He carefully folds the scrap of paper and tucks it securely inside the shoe. As he does this, his gaze drifts to the divan bed, drawing him toward it. He slips off his other shoe and lies down on the divan, feeling the springiness beneath him with his entire body, which brings a serene smile to his face. He closes his eyes and immediately drifts into a deep sleep. While Szpilman remains in a deep slumber, the sound of voices gradually rouses him, prompting him to open his eyes. Momentarily disoriented, he listens intently to the voices emanating from the adjoining flat. Curiosity piqued, he rises from the divan, moves closer to the wall, and presses his ear against it to better hear the conversation. As he listens, he finds himself enjoying the experience, until the sound of a piano being played with great emotion but many wrong notes fills the air. The music continues briefly before abruptly stopping, followed by the sound of a door slamming. A woman hands him a parcel, and he carries it into the small kitchen, where he begins to unpack its contents. Meanwhile, Janina stands by the window, gazing out. She turns her attention back to the window, observing the building engulfed in flames, with corpses scattered on the pavement below. German soldiers stand around, chatting and laughing, while a small group of Jewish fighters is lined up and executed. The blazing sun casts its harsh light on the scene. The ghetto buildings are now charred shells, the street deserted, with autumn leaves swirling in the gusty wind. Szpilman looks out at the desolate scene. Snow begins to fall, and ice forms on the windows. The sound of a key turning in the door catches his attention, and he turns to see Gebczynski enter, appearing distraught and whispering rapidly. Gebczynski takes out a cigarette, lights it, and as he does so, he leaves, his footsteps echoing as they clatter down the stairs. Szpilman notices the cigarette stub, picks it up, lights it, and takes a drag, coughing as he awkwardly smokes. Suddenly, the sound of a car engine and screeching brakes makes him tense. German voices shout, and their heavy footsteps echo on the stairs. Szpilman moves to the window, opens it, and retrieves a chair, positioning it sideways in front of the window to use as a step, contemplating how best to throw himself out. He leans against the wall near the door, waiting tensely. The slamming of doors, German shouts, and a scream fill the air, and Szpilman steels himself, ready to jump. Footsteps on the stairs are heard again, but this time they are descending, followed by the sound of a door slamming. Cautiously, he approaches the window and peers out. In the street below, he observes SS men escorting two prisoners, roughly shoving them into a car, which then speeds away. The street is left empty. Snow falls, and the wind howls. Szpilman lies on the divan, feeling cold, unshaven, with his hair filthy and long. Despite his condition, he manages to rise."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Gebczynski approaches Szpilman, closes the cupboard, and heads for the front door. He pauses to hand Szpilman a scrap of paper, shakes his hand, and quickly departs. Alone, Szpilman briefly stands in contemplation, then hides the paper in his shoe. Noticing the divan bed, he removes his other shoe, lies down to test its comfort, and smiles contentedly before falling asleep. Later, voices from the adjoining flat wake him, and he listens with curiosity. Enjoying the moment, he hears a piano played with emotion but many mistakes, which abruptly stops as a door slams. \n\nJanina hands Szpilman a parcel, which he unpacks in the kitchen while she observes the burning building outside. She watches as corpses lie scattered, Germans chat and laugh, and Jewish fighters are executed. The ghetto is now a desolate scene of burned-out buildings and empty streets, with autumn leaves blowing in the wind. Szpilman gazes out at the changing seasons, from blazing sun to snow and ice. \n\nGebczynski returns, distraught and hurried, lights a cigarette, and leaves quickly, his footsteps echoing down the stairs. Szpilman picks up the cigarette stub, lights it, and smokes awkwardly. Hearing a car engine and German voices, he tenses, preparing to escape through the window. He positions a chair as a step and waits, ready to jump as German shouts and screams fill the air. When the footsteps descend and a door slams, he cautiously checks the window. Below, SS men escort two prisoners into a car, which speeds away, leaving the street empty. In the cold, windy aftermath, Szpilman lies on the divan, unshaven and disheveled, and manages to rise."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Gebczynski, a fellow survivor in Warsaw during the brutal Nazi occupation of Poland in World War II, comes up behind him, and he closes the cupboard. Gebczynski makes for the front door, stops to hand over a scrap of paper, perhaps a note or vital information for Szpilman's survival, shakes Szpilman's hand, and goes quickly, as the city is full of danger and urgency. Alone, Szpilman, a talented pianist and composer who once performed on Polish Radio before the war, stands, lost for a moment, then takes off his shoe and stuffs the scrap of paper into it, a common practice for hiding important items from the Germans. While he does so, his eyes light on the divan bed, possibly one of the few comforts left in his dim apartment, and he goes to it, slips off his other shoe, and lies down, testing the divan's springiness with his whole body, then smiles beatifically. He shuts his eyes and is instantly asleep, his exhaustion overwhelming after days of hiding and surviving. \n\nSzpilman is still fast asleep, but voices wake him, and he opens his eyes. He's not certain where he is for a moment and feels the disorientation common in war, but hears the voices again, coming from the adjoining flat, a reminder of the thin walls in Warsaw's densely packed buildings. Intrigued, he rises, goes closer to the wall, puts his ear against it, and listens. Szpilman is enjoying himself, then the sound of a piano being played with great feeling but a lot of wrong notes comes, possibly echoing his own longing for music amidst the chaos. The piano continues for a moment but suddenly stops, and a door slams, indicating a sudden interruption common in these tense times. She hands him the parcel, perhaps containing food or a scarce necessity, and he goes into the small kitchen, a cramped space typical in urban apartments at the time, and unpacks the contents while Janina, possibly a friend or fellow survivor, gazes out of the window. She turns to look again out of the window at the building burning, corpses lie scattered on the pavement, a harrowing sight during the Warsaw Ghetto Uprising in 1943, as Germans stand about chatting and laughing, a chilling demonstration of cruelty, and a handful of Jewish fighters are lined up and shot, a stark reminder of the ongoing resistance and its bloody repression.\n\nBlazing sun illuminates the grim scene. The ghetto buildings are now burned-out shells, the street empty, autumn leaves falling and gusting in the wind, reflecting the passage of time. Szpilman gazes out. Snow blankets the scene now, a potent symbol of the harsh winter gripping the city, ice on the windows and the sound of the key in the door. Szpilman turns as the door opens, and Gebczynski enters, distraught, whispered, at speed, suggesting urgency and possible new threats or news from the outside. Gebczynski takes out a cigarette and lights it, a rare luxury or solace during these difficult times. While he does so, he goes, and Szpilman listens to his footsteps clattering down the stairs, the sound of survival in a silent city. He sees the cigarette stub, takes it, lights it, coughs, and smokes awkwardly, a small comfort in his isolation. \n\nSzpilman hears a car engine and the screech of brakes, a frequent prelude to raids or arrests, and tenses. German voices shout and their heavy footsteps on the stairs, a sound that brings fear and panic. He goes to the window, opens it, and gets a chair, places it sideways in front of the window to make a step, working out how best to throw himself out to avoid capture. He leans against the wall near the door and waits, ready for the worst. Slamming of doors, German shouts, a scream, and Szpilman steels himself, ready to jump. Again footsteps on the stairs, but this time descending, and a door slams, a signal that danger has passed for now. He cautiously goes to the window and looks out. In the street below, he sees SS men escorting two prisoners and shoving them into a car, which then speeds off, a common occurrence in the city under siege. The street is empty, silent once more. Snow continues to fall, caught in the howling wind. Szpilman lies on the divan, cold, unshaven, hair filthy and long, visibly bearing the marks of prolonged hiding and hardship. He manages to rise, his survival instincts pushing him forward in a world torn apart by war."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Gebczynski comes up behind him and he closes the cupboard. Gebczynski makes for the front door stops hands over a scrap of paper shakes Szpilman's hand and goes quickly. Alone. Szpilman stands lost for a moment then takes off his shoe and stuffs the scrap of paper into it. While he does so his eyes light on the divan bed and he goes to it slips off his other shoe and lies down testing the divan's springiness with his whole body then smiles beatifically. He shuts his eyes and is instantly asleep. Szpilman is still fast asleep but voices wake him and he opens his eyes. He is not certain where he is for a moment but hears the voices again coming from the adjoining flat. Intrigued he rises goes closer to the wall puts his ear against it and listens. Szpilman is enjoying himself. then the sound of a piano being played with great feeling but a lot of wrong notes comes. The piano continues for a moment but suddenly stops and a door slams. She hands him the parcel and he goes into the small kitchen and unpacks the contents while Janina gazes out of the window. She turns to look again out of the window at the building. burning corpses lie scattered on the pavement. Germans stand about chatting and laughing and a handful of Jewish fighters are lined up and shot. Blazing sun. The ghetto buildings are now burnedout shells. the street empty. autumn leaves falling and gusting in the wind. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Szpilman gazes out. Snow Ice on the windows and the sound of the key in the door. Szpilman turns as the door opens and Gebczynski enters distraught whispered at speed. Gebczynski takes out a cigarette and lights it. While he does so he goes and Szpilman listens to his footsteps clattering down the stairs. He sees the cigarette stub takes it lights it coughs and smokes awkwardly. Szpilman hears a car engine and the screech of brakes and tenses. German voices shout and their heavy footsteps on the stairs. He goes to the window opens it and gets a chair places it sideways in front of the window to make a step working out how best to throw himself out. He leans against the wall near the door and waits. Slamming of doors. German shouts a scream and Szpilman steels himself ready to jump. Again. footsteps on the stairs but this time descending and a door slams. He cautiously goes to the window and looks out. In the street below he sees SS men escorting two prisoners and shoving them into a car which then speeds off. The street is empty. Snow Howling wind. Szpilman lies on the divan. cold unshaven hair filthy and long. He manages to rise."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Gebczynski comes up behind him and he closes the cupboard. Gebczynski makes for the front door stops hands over a scrap of paper shakes Szpilman's hand and goes quickly. Alone. Szpilman stands lost for a moment then takes off his shoe and stuffs the scrap of paper into it. While he does so his eyes light on the divan bed and he goes to it slips off his other shoe and lies down testing the divan's springiness with his whole body then smiles beatifically. He shuts his eyes and is instantly asleep. Szpilman is still fast asleep but voices wake him and he opens his eyes. He is not certain where he is for a moment but hears the voices again coming from the adjoining flat. Intrigued he rises goes closer to the wall puts his ear against it and listens. Szpilman is enjoying himself. then the sound of a piano being played with great feeling but a lot of wrong notes comes. The piano continues for a moment but suddenly stops and a door slams. She hands him the parcel and he goes into the small kitchen and unpacks the contents while Janina gazes out of the window. She turns to look again out of the window at the building. burning corpses lie scattered on the pavement. Germans stand about chatting and laughing and a handful of Jewish fighters are lined up and shot. Blazing sun. The ghetto buildings are now burnedout shells. the street empty. autumn leaves falling and gusting in the wind. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. Szpilman gazes out. Snow Ice on the windows and the sound of the key in the door. Szpilman turns as the door opens and Gebczynski enters distraught whispered at speed. Gebczynski takes out a cigarette and lights it. While he does so he goes and Szpilman listens to his footsteps clattering down the stairs. He sees the cigarette stub takes it lights it coughs and smokes awkwardly. Szpilman hears a car engine and the screech of brakes and tenses. German voices shout and their heavy footsteps on the stairs. He goes to the window opens it and gets a chair places it sideways in front of the window to make a step working out how best to throw himself out. He leans against the wall near the door and waits. Slamming of doors. German shouts a scream and Szpilman steels himself ready to jump. Again. footsteps on the stairs but this time descending and a door slams. He cautiously goes to the window and looks out. In the street below he sees SS men escorting two prisoners and shoving them into a car which then speeds off. The street is empty. Snow Howling wind. Szpilman lies on the divan. cold unshaven hair filthy and long. He manages to rise."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Gebczynski comes up behind him and he closes the cupboard. Gebczynski makes for the front door stops hands over a scrap of paper shakes Szpilman's hand and goes quickly. Alone. Szpilman stands lost for a moment then takes off his shoe and stuffs the scrap of paper into it. While he does so his eyes light on the divan bed and he goes to it slips off his other shoe and lies down testing the divan's springiness with his whole body then smiles beatifically. He shuts his eyes and is instantly asleep. Szpilman is still fast asleep but voices wake him and he opens his eyes. He is not certain where he is for a moment but hears the voices again coming from the adjoining flat. Intrigued he rises goes closer to the wall puts his ear against it and listens. Szpilman is enjoying himself. Slamming of doors. German shouts a scream and Szpilman steels himself ready to jump. Again. footsteps on the stairs but this time descending and a door slams. He cautiously goes to the window and looks out. In the street below he sees SS men escorting two prisoners and shoving them into a car which then speeds off. The street is empty. Snow Howling wind. Szpilman lies on the divan. cold unshaven hair filthy and long. He manages to rise."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Gebczynski comes up behind him and he closes the cupboard. Gebczynski makes for the front door stops hands over a scrap of paper shakes Szpilman's hand and goes quickly. Alone. Szpilman stands lost for a moment then takes off his shoe and stuffs the scrap of paper into it. The street is empty. Snow Howling wind. Szpilman lies on the divan. cold unshaven hair filthy and long. He manages to rise."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Fritz scuttles up beside her, and she snaps the suitcase shut. Fritz darts toward the garage door, pauses, passes a fragment of cloth, pats Lucia on the shoulder, and rushes away. Alone, Lucia wanders, confused briefly, then slips off her hat and tucks the fragment of cloth into it. As she does so, her gaze settles on the hammocks, and she ambles over to it, slides off her other hat, and reclines, testing the hammock's sturdiness with her entire weight, then grins blissfully. She closes her eyes and is immediately dozing. Lucia remains deeply asleep, but noises rouse her, and she blinks open her eyes. She's unsure of her surroundings for a second but catches the noises again, emanating from the neighboring house. Curious, she stretches, creeps closer to the wall, presses her ear against it, and eavesdrops. Lucia revels in the moment, then the echo of a violin being strummed with deep emotion yet many wrong strings surfaces. The violin resounds briefly but abruptly halts, and a window slams. He hands her the backpack, and she strolls into the tiny attic and empties the contents while Marta stares out of the skylight. She pivots to peer once more out of the skylight at the structure blazing, dolls lie scattered on the grass, guards stand around murmuring and giggling, and a few scattered rebels are lined up and silenced. Scorching sun. The village huts are now charred remnants, the ground bare, autumn feathers drifting and whirling in the breeze. Lucia gazes afar. Snowflakes. Frost on the panes and the creak of the latch. Lucia spins as the latch swings open, and Fritz stumbles in, frantic, mumbled, rapidly. Fritz pulls out a matchbox and flicks it on. As he does so, he departs, and Lucia listens to his footfalls echoing down the ladder. She spots the matchstick stub, picks it up, ignites it, sputters, and inhales uneasily. Lucia detects a bicycle bell and the crunch of tires and freezes. Guard voices holler and their heavy treads on the ladder. She approaches the skylight, unlatches it, and drags a crate, positions it sideways in front of the skylight as a perch, figuring out how best to hurl herself down. She leans against the wall near the entrance and bides her time. Bang of entrances, guard yells, a shriek, and Lucia girds herself, prepared to leap. Once more footfalls on the ladder, but descending this time, and a gate slams. She gingerly approaches the skylight and peers out. In the garden below, she spots officers escorting two rabbits and bundling them into a truck, which then zooms away. The garden is deserted. Snow. Whistling breeze. Lucia lounges on the hammock, chilled, unkempt, hair grimy and wild. She struggles to stand."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Gebczynski approaches Szpilman, hands him a paper, and leaves. Szpilman hides the paper in his shoe and tests the divan bed, eventually falling asleep. Awakened by voices from the adjoining flat, Szpilman listens through the wall, enjoying a piano being played poorly. Meanwhile, Janina observes a burning building, corpses on the pavement, and Germans laughing as Jewish fighters are executed. The ghetto is now a collection of burned-out shells, with autumn leaves and snow covering the scene. Gebczynski returns, distraught, lights a cigarette, and then departs hurriedly. Szpilman takes the cigarette stub, smokes awkwardly, and hears German voices and footsteps. Preparing to jump out of the window, he is interrupted by descending footsteps and observes SS men escorting prisoners into a car. The street empties, leaving Szpilman cold and weary on the divan."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He manages to rise cold unshaven hair filthy and long  Szpilman lies on the divan  Snow Howling wind  The street is empty  In the street below he sees SS men escorting two prisoners and shoving them into a car which then speeds off  He cautiously goes to the window and looks out  Again footsteps on the stairs but this time descending and a door slams  German shouts a scream and Szpilman steels himself ready to jump  Slamming of doors  He leans against the wall near the door and waits  He goes to the window opens it and gets a chair places it sideways in front of the window to make a step working out how best to throw himself out  German voices shout and their heavy footsteps on the stairs  Szpilman hears a car engine and the screech of brakes and tenses  He sees the cigarette stub takes it lights it coughs and smokes awkwardly  While he does so he goes and Szpilman listens to his footsteps clattering down the stairs  Gebczynski takes out a cigarette and lights it  Szpilman turns as the door opens and Gebczynski enters distraught whispered at speed  Snow Ice on the windows and the sound of the key in the door  Szpilman gazes out  autumn leaves falling and gusting in the wind  the street empty  The ghetto buildings are now burnedout shells  Blazing sun  Germans stand about chatting and laughing and a handful of Jewish fighters are lined up and shot  burning corpses lie scattered on the pavement  She turns to look again out of the window at the building  She hands him the parcel and he goes into the small kitchen and unpacks the contents while Janina gazes out of the window  The piano continues for a moment but suddenly stops and a door slams  then the sound of a piano being played with great feeling but a lot of wrong notes comes  Szpilman is enjoying himself  Intrigued he rises goes closer to the wall puts his ear against it and listens  He's not certain where he is for a moment but hears the voices again coming from the adjoining flat  Szpilman is still fast asleep but voices wake him and he opens his eyes  He shuts his eyes and is instantly asleep  While he does so his eyes light on the divan bed and he goes to it slips off his other shoe and lies down testing the divan's springiness with his whole body then smiles beatifically  Szpilman stands lost for a moment then takes off his shoe and stuffs the scrap of paper into it  Alone  Gebczynski makes for the front door stops hands over a scrap of paper shakes Szpilman's hand and goes quickly  Gebczynski comes up behind him and he closes the cupboard "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Gebczynski makes for the front door stops hands over a scrap of paper shakes Szpilman's hand and goes quickly Gebczynski comes up behind him and he closes the cupboard Szpilman stands lost for a moment then takes off his shoe and stuffs the scrap of paper into it Alone He shuts his eyes and is instantly asleep While he does so his eyes light on the divan bed and he goes to it slips off his other shoe and lies down testing the divan's springiness with his whole body then smiles beatifically He is not certain where he is for a moment but hears the voices again coming from the adjoining flat Szpilman is still fast asleep but voices wake him and he opens his eyes Szpilman is enjoying himself Intrigued he rises goes closer to the wall puts his ear against it and listens The piano continues for a moment but suddenly stops and a door slams then the sound of a piano being played with great feeling but a lot of wrong notes comes She turns to look again out of the window at the building She hands him the parcel and he goes into the small kitchen and unpacks the contents while Janina gazes out of the window Germans stand about chatting and laughing and a handful of Jewish fighters are lined up and shot burning corpses lie scattered on the pavement The ghetto buildings are now burnedout shells Blazing sun autumn leaves falling and gusting in the wind the street empty Snow Ice on the windows and the sound of the key in the door Szpilman gazes out Gebczynski takes out a cigarette and lights it Szpilman turns as the door opens and Gebczynski enters distraught whispered at speed He sees the cigarette stub takes it lights it coughs and smokes awkwardly While he does so he goes and Szpilman listens to his footsteps clattering down the stairs German voices shout and their heavy footsteps on the stairs Szpilman hears a car engine and the screech of brakes and tenses He leans against the wall near the door and waits He goes to the window opens it and gets a chair places it sideways in front of the window to make a step working out how best to throw himself out German shouts a scream and Szpilman steels himself ready to jump Slamming of doors He cautiously goes to the window and looks out Again footsteps on the stairs but this time descending and a door slams The street is empty In the street below he sees SS men escorting two prisoners and shoving them into a car which then speeds off Szpilman lies on the divan Snow Howling wind He manages to rise cold unshaven hair filthy and long"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Szpilman gazes out  Snow Ice on the windows and the sound of the key in the door  Szpilman turns as the door opens and Gebczynski enters distraught whispered at speed  Gebczynski takes out a cigarette and lights it  While he does so he goes and Szpilman listens to his footsteps clattering down the stairs  He sees the cigarette stub takes it lights it coughs and smokes awkwardly  Szpilman hears a car engine and the screech of brakes and tenses  German voices shout and their heavy footsteps on the stairs  He goes to the window opens it and gets a chair places it sideways in front of the window to make a step working out how best to throw himself out  He leans against the wall near the door and waits  Slamming of doors  German shouts a scream and Szpilman steels himself ready to jump  Again footsteps on the stairs but this time descending and a door slams  He cautiously goes to the window and looks out  In the street below he sees SS men escorting two prisoners and shoving them into a car which then speeds off  The street is empty  Snow Howling wind  Szpilman lies on the divan  cold unshaven hair filthy and long  He manages to rise Gebczynski comes up behind him and he closes the cupboard  Gebczynski makes for the front door stops hands over a scrap of paper shakes Szpilman's hand and goes quickly  Alone  Szpilman stands lost for a moment then takes off his shoe and stuffs the scrap of paper into it  While he does so his eyes light on the divan bed and he goes to it slips off his other shoe and lies down testing the divan's springiness with his whole body then smiles beatifically  He shuts his eyes and is instantly asleep  Szpilman is still fast asleep but voices wake him and he opens his eyes  He's not certain where he is for a moment but hears the voices again coming from the adjoining flat  Intrigued he rises goes closer to the wall puts his ear against it and listens  Szpilman is enjoying himself  then the sound of a piano being played with great feeling but a lot of wrong notes comes  The piano continues for a moment but suddenly stops and a door slams  She hands him the parcel and he goes into the small kitchen and unpacks the contents while Janina gazes out of the window  She turns to look again out of the window at the building  burning corpses lie scattered on the pavement  Germans stand about chatting and laughing and a handful of Jewish fighters are lined up and shot  Blazing sun  The ghetto buildings are now burnedout shells  the street empty  autumn leaves falling and gusting in the wind "
        }
      ]
    }
  ]
}