{
  "ground_truth": "Szpilman is in a messy room and goes into the kitchen, where he takes a small, flat greaseproof paper parcel from a bread tin and unwraps it. As he continues attempting to cut the bread, there's a loud hammering on the front door, causing him to stiffen. The hammering persists as Szpilman stumbles into the room, looking around in confusion. Female voices are heard indistinctly from the other side of the door, prompting Szpilman into action. He hurriedly puts on a crumpled jacket, grabs his tattered coat and scarf, collects some of his belongings, and stuffs them into a paper bag. When the hammering stops, Szpilman cautiously approaches the door, listens, and then opens it quietly to slip out. He exits the flat, descends the stairs, and stops abruptly upon encountering Kitty, a young and fierce woman, blocking his way. Hesitating as she shouts louder, Szpilman musters all his strength to dash past her, clattering down the stairs to the ground-floor landing. Another woman attempts to stop him, but he pushes past her and exits the house into heavy snow. Szpilman stumbles into the street, runs, and darts down a side street, entering a narrow passage. He stops, nearly collapsing, but maintains control, leaning against a wall. Removing a shoe, he retrieves a scrap of paper from Gebczynski and reads it before dragging himself through the snow and slush to a villa. He rings the doorbell, which is answered by Dorota, who is pregnant. They stare at each other momentarily before Szpilman follows Dorota into the living room and sits down slowly. An awkward silence ensues as he gazes at her while she looks away. After a brief silence, Michal Dzikiewicz enters the room, sees Szpilman, and shakes his hand. Dizzy, Szpilman leans on the table for support as he and Dorota watch him. Later, Szpilman is asleep on the sofa, awakened by the sound of a cello. He opens his eyes, listens, swings his legs off the sofa, stands, and quietly opens a door to see another room. He sees Dorota, partially turned away, playing Bach on the cello, and listens intently. Hearing a padlock being unlocked, followed by a key turning in a Yale lock, the door opens for Michal and Szpilman to enter a flat with a large, sparsely furnished room containing an upright piano and a bed.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Szpilman is in a disorderly chamber and goes into the kitchen, where he takes a small, flat greaseproof paper bundle from a bread box and unwraps it. As he continues attempting to slice the bread, there's a loud pounding on the front door, causing him to stiffen. The pounding persists as Szpilman stumbles into the chamber, glancing around in bewilderment. Female voices are heard indistinctly from the other side of the door, prompting Szpilman into action. He hurriedly puts on a rumpled jacket, grabs his ragged coat and scarf, gathers some of his possessions, and stuffs them into a paper sack. When the pounding ceases, Szpilman cautiously approaches the door, listens, and then opens it quietly to slip out. He exits the flat, descends the stairs, and stops abruptly upon encountering Kitty, a young and fierce woman, blocking his way. Hesitating as she shouts louder, Szpilman musters all his strength to sprint past her, clattering down the stairs to the ground-floor landing. Another woman attempts to stop him, but he pushes past her and exits the house into heavy snow. Szpilman stumbles into the street, runs, and darts down a side alley, entering a narrow passage. He stops, nearly collapsing, but maintains control, leaning against a wall. Removing a shoe, he retrieves a scrap of paper from Gebczynski and reads it before dragging himself through the snow and slush to a villa. He rings the doorbell, which is answered by Dorota, who is pregnant. They stare at each other momentarily before Szpilman follows Dorota into the sitting room and sits down slowly. An awkward silence ensues as he gazes at her while she looks away. After a brief silence, Michal Dzikiewicz enters the chamber, sees Szpilman, and shakes his hand. Dizzy, Szpilman leans on the table for support as he and Dorota watch him. Later, Szpilman is asleep on the couch, awakened by the sound of a cello. He opens his eyes, listens, swings his legs off the couch, stands, and quietly opens a door to see another chamber. He sees Dorota, partially turned away, playing Bach on the cello, and listens intently. Hearing a padlock being unlocked, followed by a key turning in a Yale lock, the door opens for Michal and Szpilman to enter a flat with a large, sparsely furnished chamber containing an upright piano and a bed."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Szpilman is in a messy room and goes into the kitchen, where a small, flat greaseproof paper parcel is taken from a bread tin by him and unwrapped. As he continues attempting to cut the bread, a loud hammering is heard on the front door, causing him to stiffen. Szpilman stumbles into the room as the hammering persists, looking around in confusion. He is prompted into action by female voices heard indistinctly from the other side of the door. A crumpled jacket is hurriedly put on by him, and he grabs his tattered coat and scarf, collects some of his belongings, and stuffs them into a paper bag. When the hammering stops, the door is approached cautiously by Szpilman, who listens and then opens it quietly to slip out. The flat is exited by him, the stairs are descended, and he stops abruptly upon encountering Kitty, a young and fierce woman, blocking his way. As she shouts louder, he hesitates but musters all his strength. He dashes past her, clattering down the stairs to the ground-floor landing. He is nearly stopped by another woman, but Szpilman pushes past her and exits the house into heavy snow. Stumbling into the street, he runs and darts down a side street, entering a narrow passage. Szpilman stops, nearly collapsing, but control is maintained by him, leaning against a wall. A shoe is removed by him, and a scrap of paper from Gebczynski is retrieved and read before he drags himself through the snow and slush to a villa. The doorbell is rung by him, and Dorota, who is pregnant, answers it. Each other is stared at momentarily by them before Dorota is followed into the living room by Szpilman, who sits down slowly. An awkward silence ensues as he gazes at her while she looks away. Michal Dzikiewicz enters the room after a brief silence, sees Szpilman, and shakes his hand. Dizzy, the table is leaned on for support by Szpilman as Dorota and Michal watch him. Later, Szpilman is asleep on the sofa and is awakened by the sound of a cello. His eyes are opened by him, and he listens, swings his legs off the sofa, stands, and quietly opens a door to see another room. Dorota, partially turned away, is seen playing Bach on the cello by him, and he listens intently. A padlock is heard being unlocked, followed by a key turning in a Yale lock, allowing Michal and Szpilman to open a door and enter a flat with a large, sparsely furnished room containing an upright piano and a bed."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Szpilman is in a messy room and retrieves a small, flat greaseproof paper parcel from a bread tin in the kitchen. While trying to cut the bread, loud hammering on the front door startles him. Confused, he hears indistinct female voices. Acting quickly, he puts on a jacket, grabs his coat and scarf, packs belongings into a paper bag, and cautiously slips out when the hammering stops. Descending the stairs, he encounters Kitty, a fierce young woman. As she shouts, Szpilman dashes past her, clattering down to the landing. Another woman tries to stop him, but he pushes past and exits into heavy snow. Szpilman runs into a side street, entering a narrow passage. Nearly collapsing, he recovers, leans against a wall, retrieves a scrap of paper from his shoe, and heads to a villa. He rings the doorbell, and Dorota, pregnant, answers. After a brief stare, Szpilman follows her into the living room and sits, leading to an awkward silence. Michal Dzikiewicz enters, sees Szpilman, shakes his hand, and Szpilman supports himself on the table. Later, Szpilman, awakened by cello music, opens his eyes and quietly watches Dorota play Bach. Hearing a padlock and key, the door opens for Michal and Szpilman to enter a flat with a sparsely furnished room containing a piano and a bed."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Szpilman is in a messy room and enters the kitchen to unwrap a small, flat parcel from a bread tin. While cutting the bread, loud hammering on the front door startles him, and he hurriedly puts on a jacket, grabs belongings, and fills a paper bag. When the hammering ceases, he cautiously opens the door and slips out. On the stairs, he encounters Kitty, a fierce young woman, but dashes past her to the landing. Another woman tries to stop him, but he pushes through and exits into the heavy snow. Szpilman runs down a side street, collapses against a wall, reads a scrap of paper from Gebczynski, and heads to a villa. He rings the doorbell, answered by pregnant Dorota. They share a moment before Szpilman follows her into a living room. Michal Dzikiewicz enters, shakes Szpilman's hand, who, dizzy, leans on the table. Later, Szpilman awakens to cello music, stands, and sees Dorota playing Bach. Michal then opens a flat door to a large, sparsely furnished room with a piano and bed for Szpilman."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Szpilman finds himself standing in a room that is utterly cluttered and in disarray. He makes his way into the adjoining kitchen, where he reaches into a bread tin to retrieve a small, flat parcel wrapped in greaseproof paper. Carefully, he unwraps this parcel. As he diligently attempts to cut slices from the bread, an unexpected and loud hammering sound suddenly reverberates from the front door, causing him to stiffen with tension. The persistent hammering continues as Szpilman stumbles back into the room, his eyes darting around in a state of confusion. From beyond the door, the indistinct sound of female voices rises, prompting Szpilman to spring into action. He quickly throws on a crumpled jacket, grabs his tattered coat and scarf, and hurriedly gathers a few of his scattered belongings, stuffing them into a paper bag. When the hammering finally ceases, Szpilman cautiously inches toward the door. He listens intently before quietly opening it to slip out. Leaving the flat, he descends the stairs but abruptly halts, confronted by Kitty, a young woman with a fierce demeanor who blocks his path. As she shouts louder, Szpilman hesitates but then musters all his remaining strength to dash past her, the sound of his steps clattering down the stairs to the ground-floor landing. Another woman tries to stop him, but he forcefully pushes past her and exits the house into the heavy snowfall. Szpilman stumbles out into the street, running frantically before darting down a side street and entering a narrow passageway. He stops there, nearly collapsing, yet manages to maintain control, leaning heavily against the wall. Removing one shoe, he retrieves a scrap of paper from Gebczynski and carefully reads it. Resolute, he drags himself through the snow and slush, eventually reaching a villa. He rings the doorbell, which is promptly answered by Dorota, who is noticeably pregnant. They stand there, staring at each other for a moment before Szpilman follows Dorota into the living room, where he sits down slowly. An awkward silence envelops them as they both avoid eye contact—Szpilman gazing at her while she looks away. Breaking the silence, Michal Dzikiewicz enters the room. He notices Szpilman and extends his hand for a handshake. Dizzy and unsteady, Szpilman leans on the table for support while Dorota and Michal watch him closely. Later, Szpilman finds himself asleep on the sofa, only to be awakened by the melancholic sound of a cello being played. He opens his eyes, listens intently, swings his legs off the sofa, and stands quietly. Gently opening a door, he peers into another room. There, he sees Dorota, partially turned away, deeply engrossed in playing a piece by Bach on the cello. He listens intently, captivated by the music. Soon after, the sound of a padlock being unlocked is followed by the turn of a key in a Yale lock, enabling the door to open for Michal and Szpilman to enter a flat. This flat features a large, sparsely furnished room containing an upright piano and a bed."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Szpilman finds himself standing amidst a room that is utterly cluttered and in complete disarray. His gaze sweeps over the chaotic scene before he tentatively makes his way toward the adjoining kitchen area. In this kitchen, he reaches with a careful hand into a bread tin to retrieve a small, flat parcel that has been snugly wrapped in greaseproof paper. With deliberate precision, he begins to carefully unwrap this parcel. As he diligently works to cut slices from the bread, an unexpected and loud hammering sound suddenly reverberates from the direction of the front door, causing him to stiffen with tension and unease. The persistent, relentless hammering continues, prompting Szpilman to stumble back into the room. His eyes dart around, filled with confusion and uncertainty. From beyond the door, the indistinct sound of female voices rises, prompting Szpilman to spring into action with urgency. He quickly throws on a crumpled jacket, grabs his tattered coat and scarf, and hurriedly gathers a few of his scattered belongings, stuffing them into a paper bag. When the hammering finally ceases, Szpilman cautiously inches toward the door. He listens intently, straining his ears to catch any sound, before quietly opening it to slip out unnoticed. Leaving the confines of the flat, he descends the stairs but abruptly halts, suddenly confronted by Kitty, a young woman with a fierce demeanor who blocks his path. As she shouts louder, Szpilman hesitates momentarily but then musters all of his remaining strength to dash past her, the sound of his hurried steps clattering noisily down the stairs to the ground-floor landing. Another woman attempts to stop him, but he forcefully pushes past her and exits out into the heavy, relentless snowfall. Szpilman stumbles out into the street, running frantically before quickly darting down a narrow side street and entering a narrow passageway. He stops there, nearly collapsing in exhaustion, yet somehow manages to maintain control, leaning heavily against the cold wall for support. Removing one shoe, he retrieves a scrap of paper from Gebczynski and carefully reads its contents. Resolute and determined, he drags himself through the snow and slush, eventually reaching a villa. He rings the doorbell, which is promptly answered by Dorota, who is noticeably pregnant. They stand there for a moment, staring at each other, before Szpilman follows Dorota into the living room, where he slowly sits down. An awkward silence envelops them as they both avoid direct eye contact—Szpilman gazing at her while she looks away. Breaking the uncomfortable silence, Michal Dzikiewicz enters the room. He notices Szpilman and extends his hand in a gesture of friendship for a handshake. Dizzy and unsteady, Szpilman leans heavily on the table for support while both Dorota and Michal watch him closely. Later, Szpilman finds himself asleep on the sofa, only to be awakened by the melancholic sound of a cello being played. He opens his eyes, listens intently to the music, then swings his legs off the sofa, and stands quietly. Gently opening a door, he peers into another room. There, he sees Dorota, partially turned away, deeply engrossed in playing a piece by Bach on the cello. He listens intently, captivated by the haunting music. Soon after, the sound of a padlock being unlocked is followed by the turn of a key in a Yale lock, enabling the door to open for Michal and Szpilman to enter a flat. This flat features a large, sparsely furnished room containing an upright piano and a bed."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Szpilman stands amidst the disarray of a cluttered room, feeling the weight of the chaos around him. He moves towards the kitchen, navigating through the mess, and his eyes focus on a bread tin resting on the countertop. Carefully, he reaches out, lifting the lid with a sense of anticipation, and retrieves a small, flat parcel wrapped in greaseproof paper. His fingers work to peel back the folds of the wrapping, revealing a small piece of bread. As he steadies himself, intending to slice the bread with precision, a sudden, loud hammering reverberates from the front door, sending a jolt through his body and causing him to freeze in place. The persistent knocking draws his attention away from the task at hand, and with a flustered demeanor, Szpilman stumbles out of the kitchen and back into the room, his gaze darting around in bewilderment. The sound of indistinct female voices filters through the walls, further complicating his thoughts and spurring him into frantic movement. He hastily grabs a crumpled jacket from a nearby chair, throws it on with hurried motions, and secures his tattered coat around his shoulders. His hands fumble to wrap a scarf around his neck, and he sweeps up several of his belongings, swiftly shoving them into a paper bag with little regard for order. The hammering having ceased, Szpilman approaches the door with caution, pressing his ear against it to discern any lingering presence. Satisfied that the situation has calmed, he cautiously eases the door open, slipping through the narrow gap into the hallway beyond. Once outside the flat, he descends the stairs with quick but careful steps, his path abruptly blocked by Kitty, a young woman with a fierce disposition. Her loud shouts momentarily cause him to pause, but summoning his resolve, Szpilman surges forward, maneuvering past her, his footsteps echoing with urgency as he clatters down the stairs to the ground-floor landing. There, another woman attempts to impede his progress, yet he pushes through, determinedly exiting the house into the enveloping, cold embrace of heavy snowfall. Szpilman tumbles into the street, the biting air sharp against his skin, and propels himself forward, darting down a side street and vanishing into the confines of a narrow passage. He halts, breathless, teetering on the edge of collapse, yet manages to keep his composure by leaning heavily against the supportive structure of a wall. In a moment of recollection, he frees a shoe from his foot and extracts a scrap of paper bearing Gebczynski's name, scanning the text with tired eyes before mustering the energy to trudge through the snow and slush towards a villa. Upon reaching the entrance, he extends a weary hand to press the doorbell, waiting as the door swings open to reveal Dorota, visibly pregnant. An unspoken recognition passes between them, their eyes locking in a shared understanding, and he follows her into the living room, where he gradually lowers himself into a seat. The silence is palpable as he observes Dorota, who avoids his gaze, fostering an atmosphere heavy with unspoken words. The silence is broken when Michal Dzikiewicz enters, his eyes meeting Szpilman's with a mix of surprise and welcome, and they exchange a handshake. Overwhelmed with dizziness, Szpilman leans against the table for support, under the watchful eyes of Dorota and Michal. Time passes, and Szpilman finds himself lying on the sofa, the fatigue of his journey giving way to a light sleep. The sound of a cello playing gently rouses him; he opens his eyes, listens with interest, and swings his legs over the edge of the sofa. Standing, he quietly approaches a door and peeks into another room, where he sees Dorota, slightly turned away, absorbed in playing Bach on the cello. He listens intently until the sound of a padlock being unlocked captures his attention, followed by the distinct noise of a key twisting in a Yale lock. The door opens, allowing Michal and Szpilman to step inside a flat characterized by a large, sparsely furnished room, dominated by the presence of an upright piano and a bed."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Szpilman finds himself in a messy room and moves to the kitchen to retrieve a small parcel from a bread tin. As he attempts to cut the bread, loud hammering on the door halts him. Disturbed by indistinct female voices, he quickly dons a crumpled jacket, grabs his coat and scarf, gathers some belongings into a paper bag, and cautiously slips out once the hammering ceases. He exits the flat and descends the stairs, only to be confronted by Kitty, a fierce young woman. Despite her protests, he rushes past her and another woman, escaping into the snowy street. After staggering down a side street and entering a narrow passage, he pauses to lean against a wall, retrieves and reads a note from his shoe, and proceeds to a villa. There, he rings the doorbell, and pregnant Dorota answers. They share a moment of silence before she leads him into the living room. Michal Dzikiewicz enters, shakes Szpilman's hand, and Szpilman, dizzy, leans for support as Dorota watches. Later, Szpilman wakes up on the sofa to the sound of a cello, listens as Dorota plays Bach, and quietly observes. The narrative shifts as Michal and Szpilman enter a sparsely furnished flat containing an upright piano and a bed after unlocking the door."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Szpilman is in a messy room in the heart of Warsaw during the tumultuous 1940s and goes into the kitchen, where he takes a small, flat greaseproof paper parcel from a bread tin and unwraps it, revealing a meager portion of bread considered a luxury due to wartime rationing. As he continues attempting to cut the bread, there's a loud hammering on the front door, a sound familiar in times of political unrest, causing him to stiffen. The hammering persists as Szpilman stumbles into the room, looking around in confusion, overcome by the tensions of living under occupation. Female voices, perhaps that of neighbors wary of outsiders, are heard indistinctly from the other side of the door, prompting Szpilman into action. He hurriedly puts on a crumpled jacket, appropriate for the chilly Eastern European weather, grabs his tattered coat and scarf, collects some of his belongings, and stuffs them into a paper bag often used during resource-scarce times. When the hammering stops, Szpilman cautiously approaches the door, listens, and then opens it quietly to slip out. He exits the flat, descends the stairs of the dilapidated tenement building, and stops abruptly upon encountering Kitty, a young and fierce woman known for her involvement in resistance activities, blocking his way. Hesitating as she shouts louder, Szpilman musters all his strength to dash past her, clattering down the stairs to the ground-floor landing. Another woman, likely an accomplice in surveillance, attempts to stop him, but he pushes past her and exits the house into heavy snow characteristic of Warsaw winters. Szpilman stumbles into the street, runs, and darts down a side street, entering a narrow passage often used by those in hiding. He stops, nearly collapsing, but maintains control, leaning against a wall of a building marked by the scars of war. Removing a shoe, he retrieves a scrap of paper from Gebczynski, a member of the underground network, and reads it before dragging himself through the snow and slush to a villa distinguished by its pre-war architecture. He rings the doorbell, which is answered by Dorota, who is pregnant, an intimate detail suggesting hope amid despair. They stare at each other momentarily before Szpilman follows Dorota into the living room and sits down slowly. An awkward silence ensues as he gazes at her while she looks away. After a brief silence, Michal Dzikiewicz enters the room, sees Szpilman, and shakes his hand, symbolizing solidarity. Dizzy, Szpilman leans on the table for support as he and Dorota watch him. Later, Szpilman is asleep on the sofa, awakened by the sound of a cello, an instrument synonymous with emotional expression in classical music. He opens his eyes, listens, swings his legs off the sofa, stands, and quietly opens a door to see another room. He sees Dorota, partially turned away, playing Bach on the cello, a composer whose work embodies resilience, and listens intently. Hearing a padlock being unlocked, followed by a key turning in a Yale lock, a trusted brand known for security, the door opens for Michal and Szpilman to enter a flat with a large, sparsely furnished room containing an upright piano and a bed, a scene reminiscent of a musician's modest sanctuary."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Later Szpilman is asleep on the sofa awakened by the sound of a cello He stops nearly collapsing but maintains control leaning against a wall Szpilman is in a messy room and goes into the kitchen where he takes a small flat greaseproof paper parcel from a bread tin and unwraps it He hurriedly puts on a crumpled jacket grabs his tattered coat and scarf collects some of his belongings and stuffs them into a paper bag Hesitating as she shouts louder Szpilman musters all his strength to dash past her clattering down the stairs to the groundfloor landing As he continues attempting to cut the bread there is a loud hammering on the front door causing him to stiffen Female voices are heard indistinctly from the other side of the door prompting Szpilman into action Removing a shoe he retrieves a scrap of paper from Gebczynski and reads it before dragging himself through the snow and slush to a villa As he continues attempting to cut the bread there is a loud hammering on the front door causing him to stiffen The hammering persists as Szpilman stumbles into the room looking around in confusion Female voices are heard indistinctly from the other side of the door prompting Szpilman into action He hurriedly puts on a crumpled jacket grabs his tattered coat and scarf collects some of his belongings and stuffs them into a paper bag An awkward silence ensues as he gazes at her while she looks away When the hammering stops Szpilman cautiously approaches the door listens and then opens it quietly to slip out He exits the flat descends the stairs and stops abruptly upon encountering Kitty a young and fierce woman blocking his way Hesitating as she shouts louder Szpilman musters all his strength to dash past her clattering down the stairs to the groundfloor landing Another woman attempts to stop him but he pushes past her and exits the house into heavy snow Szpilman stumbles into the street runs and darts down a side street entering a narrow passage He stops nearly collapsing but maintains control leaning against a wall Removing a shoe he retrieves a scrap of paper from Gebczynski and reads it before dragging himself through the snow and slush to a villa Another woman attempts to stop him but he pushes past her and exits the house into heavy snow He rings the doorbell which is answered by Dorota who is pregnant They stare at each other momentarily before Szpilman follows Dorota into the living room and sits down slowly An awkward silence ensues as he gazes at her while she looks away After a brief silence Michal Dzikiewicz enters the room sees Szpilman and shakes his hand Dizzy Szpilman leans on the table for support as he and Dorota watch him Szpilman is in a messy room and goes into the kitchen where he takes a small flat greaseproof paper parcel from a bread tin and unwraps it Hearing a padlock being unlocked followed by a key turning in a Yale lock Later Szpilman is asleep on the sofa awakened by the sound of a cello He opens his eyes listens swings his legs off the sofa stands and quietly opens a door to see another room He sees Dorota partially turned away playing Bach on the cello and listens intently Hearing a padlock being unlocked followed by a key turning in a Yale lock the door opens for Michal and Szpilman to enter a flat with a large sparsely furnished room containing an upright piano and a bed"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Szpilman is in a messy room and goes into the kitchen where he takes a small flat greaseproof paper parcel from a bread tin and unwraps it. As he continues attempting to cut the bread there is a loud hammering on the front door causing him to stiffen. The hammering persists as Szpilman stumbles into the room looking around in confusion. Female voices are heard indistinctly from the other side of the door prompting Szpilman into action. He hurriedly puts on a crumpled jacket grabs his tattered coat and scarf collects some of his belongings and stuffs them into a paper bag. When the hammering stops Szpilman cautiously approaches the door listens and then opens it quietly to slip out. He exits the flat descends the stairs and stops abruptly upon encountering Kitty a young and fierce woman blocking his way. Hesitating as she shouts louder Szpilman musters all his strength to dash past her clattering down the stairs to the groundfloor landing. Another woman attempts to stop him but he pushes past her and exits the house into heavy snow. Szpilman stumbles into the street runs and darts down a side street entering a narrow passage. He stops nearly collapsing but maintains control leaning against a wall. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Removing a shoe he retrieves a scrap of paper from Gebczynski and reads it before dragging himself through the snow and slush to a villa. He rings the doorbell which is answered by Dorota who is pregnant. They stare at each other momentarily before Szpilman follows Dorota into the living room and sits down slowly. An awkward silence ensues as he gazes at her while she looks away. After a brief silence Michal Dzikiewicz enters the room sees Szpilman and shakes his hand. Dizzy Szpilman leans on the table for support as he and Dorota watch him. Later Szpilman is asleep on the sofa awakened by the sound of a cello. He opens his eyes listens swings his legs off the sofa stands and quietly opens a door to see another room. He sees Dorota partially turned away playing Bach on the cello and listens intently. Hearing a padlock being unlocked followed by a key turning in a Yale lock. the door opens for Michal and Szpilman to enter a flat with a large sparsely furnished room containing an upright piano and a bed."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Szpilman is in a messy room and goes into the kitchen where he takes a small flat greaseproof paper parcel from a bread tin and unwraps it. As he continues attempting to cut the bread there is a loud hammering on the front door causing him to stiffen. The hammering persists as Szpilman stumbles into the room looking around in confusion. Female voices are heard indistinctly from the other side of the door prompting Szpilman into action. He hurriedly puts on a crumpled jacket grabs his tattered coat and scarf collects some of his belongings and stuffs them into a paper bag. When the hammering stops Szpilman cautiously approaches the door listens and then opens it quietly to slip out. He exits the flat descends the stairs and stops abruptly upon encountering Kitty a young and fierce woman blocking his way. Hesitating as she shouts louder Szpilman musters all his strength to dash past her clattering down the stairs to the groundfloor landing. Another woman attempts to stop him but he pushes past her and exits the house into heavy snow. Szpilman stumbles into the street runs and darts down a side street entering a narrow passage. He stops nearly collapsing but maintains control leaning against a wall. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Removing a shoe he retrieves a scrap of paper from Gebczynski and reads it before dragging himself through the snow and slush to a villa. He rings the doorbell which is answered by Dorota who is pregnant. They stare at each other momentarily before Szpilman follows Dorota into the living room and sits down slowly. An awkward silence ensues as he gazes at her while she looks away. After a brief silence Michal Dzikiewicz enters the room sees Szpilman and shakes his hand. Dizzy Szpilman leans on the table for support as he and Dorota watch him. Later Szpilman is asleep on the sofa awakened by the sound of a cello. He opens his eyes listens swings his legs off the sofa stands and quietly opens a door to see another room. He sees Dorota partially turned away playing Bach on the cello and listens intently. Hearing a padlock being unlocked followed by a key turning in a Yale lock. the door opens for Michal and Szpilman to enter a flat with a large sparsely furnished room containing an upright piano and a bed."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Szpilman is in a messy room and goes into the kitchen where he takes a small flat greaseproof paper parcel from a bread tin and unwraps it. As he continues attempting to cut the bread there is a loud hammering on the front door causing him to stiffen. The hammering persists as Szpilman stumbles into the room looking around in confusion. Female voices are heard indistinctly from the other side of the door prompting Szpilman into action. He hurriedly puts on a crumpled jacket grabs his tattered coat and scarf collects some of his belongings and stuffs them into a paper bag. When the hammering stops Szpilman cautiously approaches the door listens and then opens it quietly to slip out. Later Szpilman is asleep on the sofa awakened by the sound of a cello. He opens his eyes listens swings his legs off the sofa stands and quietly opens a door to see another room. He sees Dorota partially turned away playing Bach on the cello and listens intently. Hearing a padlock being unlocked followed by a key turning in a Yale lock. the door opens for Michal and Szpilman to enter a flat with a large sparsely furnished room containing an upright piano and a bed."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Szpilman is in a messy room and goes into the kitchen where he takes a small flat greaseproof paper parcel from a bread tin and unwraps it. As he continues attempting to cut the bread there is a loud hammering on the front door causing him to stiffen. The hammering persists as Szpilman stumbles into the room looking around in confusion. Hearing a padlock being unlocked followed by a key turning in a Yale lock. the door opens for Michal and Szpilman to enter a flat with a large sparsely furnished room containing an upright piano and a bed."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dragon is in a messy room and goes into the kitchen, where it takes a small, flat greaseproof paper parcel from a bread tin and unwraps it. As it continues attempting to cut the bread, there's a loud hammering on the front door, causing the dragon to stiffen. The hammering persists as the dragon stumbles into the room, looking around in confusion. Female voices are heard indistinctly from the other side of the door, prompting the dragon into action. It hurriedly puts on a crumpled jacket, grabs its tattered coat and scarf, collects some of its belongings, and stuffs them into a paper bag. When the hammering stops, the dragon cautiously approaches the door, listens, and then opens it quietly to slip out. It exits the flat, descends the stairs, and stops abruptly upon encountering a rabbit, a young and fierce woman, blocking its way. Hesitating as she shouts louder, the dragon musters all its strength to dash past her, clattering down the stairs to the ground-floor landing. Another woman attempts to stop it, but the dragon pushes past her and exits the house into heavy snow. The dragon stumbles into the street, runs, and darts down a side street, entering a narrow passage. It stops, nearly collapsing, but maintains control, leaning against a wall. Removing a shoe, it retrieves a scrap of paper from a dolphin and reads it before dragging itself through the snow and slush to a villa. It rings the doorbell, which is answered by a squirrel, who is pregnant. They stare at each other momentarily before the dragon follows the squirrel into the living room and sits down slowly. An awkward silence ensues as it gazes at her while she looks away. After a brief silence, a penguin enters the room, sees the dragon, and shakes its hand. Dizzy, the dragon leans on the table for support as it and the squirrel watch it. Later, the dragon is asleep on the sofa, awakened by the sound of a cello. It opens its eyes, listens, swings its legs off the sofa, stands, and quietly opens a door to see another room. It sees the squirrel, partially turned away, playing Bach on the cello, and listens intently. Hearing a padlock being unlocked, followed by a key turning in a Yale lock, the door opens for the penguin and the dragon to enter a flat with a large, sparsely furnished room containing an upright piano and a bed."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Szpilman is in a cluttered garage and goes into the laundry room, where he takes a small, flat aluminum foil parcel from a cereal box and unwraps it. As he continues attempting to cut the cheese, there's a loud pounding on the basement door, causing him to stiffen. The pounding persists as Szpilman stumbles into the garage, looking around in confusion. Female voices are heard indistinctly from the other side of the door, prompting Szpilman into action. He hurriedly puts on a wrinkled sweater, grabs his worn-out raincoat and muffler, collects some of his belongings, and stuffs them into a cloth bag. When the pounding stops, Szpilman cautiously approaches the door, listens, and then opens it quietly to slip out. He exits the garage, descends the fire escape, and stops abruptly upon encountering Kitty, a young and fierce woman, blocking his way. Hesitating as she shouts louder, Szpilman musters all his strength to dash past her, clattering down the fire escape to the alleyway. Another woman attempts to stop him, but he pushes past her and exits the yard into heavy fog. Szpilman stumbles into the avenue, runs, and darts down a side lane, entering a narrow alleyway. He stops, nearly collapsing, but maintains control, leaning against a fence. Removing a boot, he retrieves a scrap of parchment from Gebczynski and reads it before dragging himself through the fog and puddles to a bungalow. He rings the buzzer, which is answered by Dorota, who is carrying a cat. They stare at each other momentarily before Szpilman follows Dorota into the den and sits down slowly. An awkward silence ensues as he gazes at her while she looks away. After a brief silence, Michal Dzikiewicz enters the room, sees Szpilman, and shakes his hand. Dizzy, Szpilman leans on the chair for support as he and Dorota watch him. Later, Szpilman is asleep on the recliner, awakened by the sound of a violin. He opens his eyes, listens, swings his legs off the recliner, stands, and quietly opens a window to see another room. He sees Dorota, partially turned away, playing Vivaldi on the violin, and listens intently. Hearing a latch being unlocked, followed by a key turning in a deadbolt, the door opens for Michal and Szpilman to enter a loft with a large, sparsely furnished room containing a grand piano and a sofa."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Szpilman is in a messy room and wanders into the kitchen, where he retrieves a small, flat greaseproof paper parcel from a bread tin and inspects it. As he continues attempting to smell the bread, there's a loud whistling at the front door, causing him to freeze. The whistling persists as Szpilman staggers into the room, searching around in confusion. Female voices are heard indistinctly from the other side of the door, prompting Szpilman into action. He hurriedly throws on a crumpled jacket, yanks his tattered coat and scarf, gathers some of his belongings, and crams them into a paper bag. When the whistling stops, Szpilman cautiously tiptoes to the door, listens, and then nudges it quietly to slip out. He exits the flat, ascends the stairs, and halts abruptly upon encountering Kitty, a young and fierce woman, blocking his way. Hesitating as she shouts louder, Szpilman musters all his strength to slide past her, thrumming down the stairs to the ground-floor landing. Another woman attempts to halt him, but he maneuvers past her and exits the house into heavy snow. Szpilman trips into the street, scurries, and weaves down a side street, entering a narrow passage. He pauses, nearly faltering, but maintains control, resting against a wall. Removing a shoe, he extracts a scrap of paper from Gebczynski and peruses it before dragging himself through the snow and slush to a villa. He taps the doorbell, which is answered by Dorota, who is pregnant. They glance at each other momentarily before Szpilman trails Dorota into the living room and rests down slowly. An awkward silence follows as he gazes at her while she averts her eyes. After a brief silence, Michal Dzikiewicz enters the room, sees Szpilman, and pats his hand. Dizzy, Szpilman leans on the table for stability as he and Dorota watch him. Later, Szpilman is asleep on the sofa, stirred by the sound of a cello. He opens his eyes, listens, swings his legs off the sofa, stands, and quietly pushes a door to see another room. He sees Dorota, partially turned away, playing Bach on the cello, and listens intently. Hearing a padlock being fastened, followed by a key turning in a Yale lock, the door opens for Michal and Szpilman to step into a flat with a large, sparsely furnished room containing an upright piano and a bed."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Giraffe is in a cluttered warehouse and goes into the garage, where it takes a small, flat aluminum foil pouch from a cookie jar and unwraps it. As it continues attempting to slice the cheese, there's a loud drumming on the patio door, causing it to freeze. The drumming persists as Giraffe trips into the hallway, looking around in confusion. Male voices are heard indistinctly from the other side of the window, prompting Giraffe into action. It hurriedly puts on a wrinkled vest, grabs its frayed umbrella and hat, collects some of its trinkets, and stuffs them into a cloth bag. When the drumming stops, Giraffe cautiously approaches the window, listens, and then opens it quietly to slip out. It exits the barn, descends the ladder, and stops abruptly upon encountering Penguin, a young and fierce cat, blocking its path. Hesitating as it meows louder, Giraffe musters all its courage to dash past it, clattering down the ladder to the ground-floor platform. Another cat attempts to block it, but Giraffe pushes past it and exits the barn into heavy rain. Giraffe stumbles into the alley, sprints, and darts down a narrow alleyway, entering a tight corridor. It stops, nearly collapsing, but maintains composure, leaning against a fence. Removing a mitten, it retrieves a note from Penguin and reads it before dragging itself through the rain and puddles to a mansion. It rings the bell, which is answered by Swan, who is carrying a puppy. They stare at each other momentarily before Giraffe follows Swan into the lounge and sits down slowly. An awkward silence ensues as it gazes at Swan while she looks away. After a brief silence, Shark Fin enters the lounge, sees Giraffe, and shakes its wing. Woozy, Giraffe leans on the chair for support as it and Swan observe. Later, Giraffe is asleep on the hammock, awakened by the sound of a harmonica. It opens its eyes, listens, swings its tail off the hammock, stands, and quietly opens a window to see another corridor. It sees Swan, partially turned away, playing Mozart on the harmonica, and listens intently. Hearing a gate being unlatched, followed by a chain rattling in a cupboard, the window opens for Shark Fin and Giraffe to enter a cottage with a large, sparsely adorned corridor containing a violin and a sofa."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Fluffwig is in a tidy barn and wanders into the pantry, where he discovers a small, round parchment parcel from a cookie jar and peels it open. As he continues attempting to slice the cheese, there's a loud whistling at the back window, causing him to freeze. The whistling persists as Fluffwig tumbles into the hallway, glancing around in bewilderment. Male voices are heard indistinctly from the side of the window, prompting Fluffwig into motion. He quickly throws on a pristine jacket, snatches his patched hat and gloves, gathers some of his trinkets, and tucks them into a cloth sack. When the whistling stops, Fluffwig tentatively advances toward the window, listens, and then opens it quietly to sneak out. He exits the cottage, ascends the ladder, and stops abruptly upon encountering Rusty, an old and timid man, blocking his path. Pausing as he shouts louder, Fluffwig summons all his courage to tiptoe past him, clambering up the ladder to the rooftop. Another man attempts to halt him, but he sidesteps him and exits the barn into torrential rain. Fluffwig slips into the alley, strolls, and swerves down an alleyway, entering a wide corridor. He halts, nearly stumbling, but maintains balance, leaning against a post. Removing a hat, he retrieves a map from Zindel and examines it before hauling himself through the rain and mud to a chalet. He taps the knocker, which is answered by Elara, who is elderly. They gaze at each other momentarily before Fluffwig follows Elara into the study and perches down slowly. An awkward quiet follows as he examines her while she looks away. After a brief pause, Nigel Braintree steps into the room, notices Fluffwig, and nods his head. Wobbly, Fluffwig leans on the bookshelf for balance as he and Elara watch him. Later, Fluffwig is resting on the chair, roused by the sound of a violin. He opens his eyes, listens, swings his feet off the chair, stands, and quietly opens a window to see another space. He sees Elara, partially turned away, playing Vivaldi on the violin, and listens thoughtfully. Hearing a latch being unlocked, followed by a key twisting in a bolt lock, the window opens for Nigel and Fluffwig to enter a loft with a large, sparsely decorated space containing an acoustic guitar and a hammock."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Szpilman is in a cluttered garage and strolls into the pantry, where he grabs a small, round wax paper package from a biscuit tin and unwraps it. As he continues attempting to carve the cheese, there's a loud drumming on the front gate, causing him to freeze. The drumming persists as Szpilman stumbles into the garage, scanning about in bewilderment. Female voices are heard indistinctly from the other side of the gate, prompting Szpilman into motion. He hastily puts on a wrinkled hoodie, grabs his torn poncho and mittens, gathers some of his possessions, and crams them into a plastic bag. When the drumming stops, Szpilman cautiously approaches the gate, listens, and then opens it quietly to sneak out. He exits the building, traverses the hallway, and halts abruptly upon encountering Kitty, a young and intense woman, blocking his path. Hesitating as she yells louder, Szpilman gathers all his courage to sprint past her, clattering down the hallway to the ground-floor landing. Another woman tries to halt him, but he brushes past her and exits the building into a thick fog. Szpilman stumbles into the alley, dashes, and zigzags down a backstreet, entering a narrow corridor. He stops, nearly toppling, but regains composure, leaning against a fence. Removing a sock, he retrieves a crumpled napkin from Gebczynski and reads it before dragging himself through the fog and puddles to a cottage. He knocks on the window, which is answered by Dorota, who is expectant. They lock eyes momentarily before Szpilman follows Dorota into the dining room and perches down slowly. An awkward silence ensues as he peers at her while she averts her gaze. After a brief pause, Michal Dzikiewicz enters the space, notices Szpilman, and nods at him. Woozy, Szpilman leans on the chair for balance as he and Dorota observe him. Later, Szpilman is dozing on the armchair, awakened by the sound of a violin. He opens his eyes, listens, swings his legs off the armchair, stands, and quietly opens a window to see another balcony. He sees Dorota, partially turned away, playing Mozart on the violin, and listens with focus. Hearing a latch being unlatched, followed by a handle turning in a brass lock, the balcony opens for Michal and Szpilman to enter a loft with a large, sparsely decorated space containing an upright harp and a cot."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Milo lounges in a cluttered office and wanders into the garage, where he pulls a tiny, round velvet pouch from a cookie jar and peels it open. As he continues trying to slice the cake, there's a loud drumming on the back gate, causing him to freeze. The drumming continues as Milo plods into the hall, glancing around in bewilderment. Male whispers drift faintly from the far side of the gate, urging Milo into motion. He hastily throws on a wrinkled sweater, snatches his ragged hat and gloves, gathers several of his knick-knacks, and crams them into a cloth sack. When the drumming ceases, Milo gingerly approaches the gate, listens, and then eases it open to slip through. He leaves the building, clambers up the hill, and halts abruptly upon confronting Max, a young and fierce boy, blocking his path. Pausing as he yells louder, Milo gathers all his energy to rush around him, tumbling up the hill to the rooftop terrace. Another man tries to halt him, but he sidesteps him and escapes the yard into dense fog. Milo trips onto the pathway, jogs, and veers into an alleyway, squeezing through a narrow corridor. He pauses, nearly collapsing, but retains balance, propping against a fence. Removing a glove, he extracts a bookmark from Larkspur and scans it before trudging himself through the fog and mud to a greenhouse. He presses a doorbell, which is answered by Iris, who is carrying twins. They gaze at each other momentarily before Milo trails Iris into the dining room and perches slowly. An uneasy silence follows as he observes her while she glances away. After a brief pause, Jasper Snow enters the area, spots Milo, and clasps his hand. Faint, Milo leans on the counter for stability as he and Iris gaze at him. Later, Milo is dozing on the recliner, jolted awake by the notes of a violin. He opens his eyes, listens, swings his feet off the recliner, stands, and quietly pushes open a curtain to view another space. He observes Iris, partially averted, performing Mozart on the violin, and listens closely. Hearing a latch being unlatched, followed by a key twisting in a lock, the door opens for Jasper and Milo to step into an attic with a vast, sparsely decorated chamber containing a grand harp and a chair."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Szpilman is in a messy room and goes to the kitchen to unwrap a small parcel from a bread tin. Hearing a loud hammering on the door, he stiffens. Female voices prompt him to quickly get dressed, gather belongings into a paper bag, and cautiously slip out. He runs into Kitty, a young woman blocking his way, but dashes past her and exits into the snowy street. He retrieves a scrap of paper from his shoe and heads to a villa, where Dorota, who is pregnant, answers the door. They share an awkward silence before Michal Dzikiewicz enters and shakes Szpilman’s hand. Later, Szpilman wakes on a sofa to the sound of Dorota playing Bach on the cello. Michal and Szpilman enter a flat with a large room containing a piano and a bed."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "the door opens for Michal and Szpilman to enter a flat with a large sparsely furnished room containing an upright piano and a bed Hearing a padlock being unlocked followed by a key turning in a Yale lock He sees Dorota partially turned away playing Bach on the cello and listens intently He opens his eyes listens swings his legs off the sofa stands and quietly opens a door to see another room Later Szpilman is asleep on the sofa awakened by the sound of a cello Dizzy Szpilman leans on the table for support as he and Dorota watch him After a brief silence Michal Dzikiewicz enters the room sees Szpilman and shakes his hand An awkward silence ensues as he gazes at her while she looks away They stare at each other momentarily before Szpilman follows Dorota into the living room and sits down slowly He rings the doorbell which is answered by Dorota who is pregnant Removing a shoe he retrieves a scrap of paper from Gebczynski and reads it before dragging himself through the snow and slush to a villa He stops nearly collapsing but maintains control leaning against a wall Szpilman stumbles into the street runs and darts down a side street entering a narrow passage Another woman attempts to stop him but he pushes past her and exits the house into heavy snow Hesitating as she shouts louder Szpilman musters all his strength to dash past her clattering down the stairs to the groundfloor landing He exits the flat descends the stairs and stops abruptly upon encountering Kitty a young and fierce woman blocking his way When the hammering stops Szpilman cautiously approaches the door listens and then opens it quietly to slip out He hurriedly puts on a crumpled jacket grabs his tattered coat and scarf collects some of his belongings and stuffs them into a paper bag Female voices are heard indistinctly from the other side of the door prompting Szpilman into action The hammering persists as Szpilman stumbles into the room looking around in confusion As he continues attempting to cut the bread there is a loud hammering on the front door causing him to stiffen Szpilman is in a messy room and goes into the kitchen where he takes a small flat greaseproof paper parcel from a bread tin and unwraps it"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "the door opens for Michal and Szpilman to enter a flat with a large sparsely furnished room containing an upright piano and a bed When the hammering stops Szpilman cautiously approaches the door listens and then opens it quietly to slip out The hammering persists as Szpilman stumbles into the room looking around in confusion After a brief silence Michal Dzikiewicz enters the room sees Szpilman and shakes his hand Szpilman stumbles into the street runs and darts down a side street entering a narrow passage He rings the doorbell which is answered by Dorota who is pregnant Dizzy Szpilman leans on the table for support as he and Dorota watch him He sees Dorota partially turned away playing Bach on the cello and listens intently He exits the flat descends the stairs and stops abruptly upon encountering Kitty a young and fierce woman blocking his way They stare at each other momentarily before Szpilman follows Dorota into the living room and sits down slowly He opens his eyes listens swings his legs off the sofa stands and quietly opens a door to see another room An awkward silence ensues as he gazes at her while she looks away He stops nearly collapsing but maintains control leaning against a wall As he continues attempting to cut the bread there is a loud hammering on the front door causing him to stiffen Removing a shoe he retrieves a scrap of paper from Gebczynski and reads it before dragging himself through the snow and slush to a villa He hurriedly puts on a crumpled jacket grabs his tattered coat and scarf collects some of his belongings and stuffs them into a paper bag Later Szpilman is asleep on the sofa awakened by the sound of a cello Hesitating as she shouts louder Szpilman musters all his strength to dash past her clattering down the stairs to the groundfloor landing Another woman attempts to stop him but he pushes past her and exits the house into heavy snow Szpilman is in a messy room and goes into the kitchen where he takes a small flat greaseproof paper parcel from a bread tin and unwraps it Female voices are heard indistinctly from the other side of the door prompting Szpilman into action Hearing a padlock being unlocked followed by a key turning in a Yale lock"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Removing a shoe he retrieves a scrap of paper from Gebczynski and reads it before dragging himself through the snow and slush to a villa He rings the doorbell which is answered by Dorota who is pregnant They stare at each other momentarily before Szpilman follows Dorota into the living room and sits down slowly An awkward silence ensues as he gazes at her while she looks away After a brief silence Michal Dzikiewicz enters the room sees Szpilman and shakes his hand Dizzy Szpilman leans on the table for support as he and Dorota watch him Later Szpilman is asleep on the sofa awakened by the sound of a cello He opens his eyes listens swings his legs off the sofa stands and quietly opens a door to see another room He sees Dorota partially turned away playing Bach on the cello and listens intently Hearing a padlock being unlocked followed by a key turning in a Yale lock the door opens for Michal and Szpilman to enter a flat with a large sparsely furnished room containing an upright piano and a bed Szpilman is in a messy room and goes into the kitchen where he takes a small flat greaseproof paper parcel from a bread tin and unwraps it As he continues attempting to cut the bread there is a loud hammering on the front door causing him to stiffen The hammering persists as Szpilman stumbles into the room looking around in confusion Female voices are heard indistinctly from the other side of the door prompting Szpilman into action He hurriedly puts on a crumpled jacket grabs his tattered coat and scarf collects some of his belongings and stuffs them into a paper bag When the hammering stops Szpilman cautiously approaches the door listens and then opens it quietly to slip out He exits the flat descends the stairs and stops abruptly upon encountering Kitty a young and fierce woman blocking his way Hesitating as she shouts louder Szpilman musters all his strength to dash past her clattering down the stairs to the groundfloor landing Another woman attempts to stop him but he pushes past her and exits the house into heavy snow Szpilman stumbles into the street runs and darts down a side street entering a narrow passage He stops nearly collapsing but maintains control leaning against a wall"
        }
      ]
    }
  ]
}