{
  "ground_truth": "He smiles and runs to catch up with his family. He looks back, but Dorota is lost to sight and the procession continues on its way. Two rooms on the third floor: a living room and a kitchen. The Szpilmans are unpacking their belongings in silence. Father pauses for a moment to take stock. They all go to the window and look out. Their POV - the street. Further along, men are building a wall across the street. Slush underfoot. Great activity. People selling shoes, clothes, carpets, curtains, food. A woman offers cakes under a barbed-wire cover. Noise, bustle, restless wing and froing. Among the traders, Henryk, slightly shabbier now, and at his feet a basket with books. He holds a couple of volumes in his hands, trying to interest passers-by. Szpilman, also a little shabbier, wends his way through the setters and buyers, the beggars, the passers-by, and reaches Henryk. Henryk drops the two volumes into the basket, takes a handle one side of the basket, Szpilman the other. They set off. As they walk, carrying the basket between them, passing beggars and children asking for food. Suddenly, a WOMAN appears in front of them, barring their way. She's brightly rouged with thickly painted eyebrows, dressed in an old green velvet curtain with an unsteady mauve ostrich feather rising from her straw hat. She wanders on. Szpilman and Henryk, too, continue on their way. And as they go. Meanwhile, a street band begins to play a waltz. Jewish policemen and German soldiers are clearing a space, shoving Jews out of the way, including Szpilman, Henryk and the nervous man. Other soldiers are clearing a space. Two GERMAN SOLDIERS pull out of the crowd a tall woman and a short man and haul them into the cleared space. The couple dance to the street band's waltz. At intervals, German soldiers select even more unlikely couples: a fat woman with a painfully thin man, a young boy with an elderly woman, two men, and two cripples. The German soldiers are, to various degrees, amused. One of them is almost hysterical with laughter. The couples dance as fast as they can. A soldier kicks one of the cripples who can't go on any more. Then a whistle blows, a policeman stops the traffic, the barrier swings open and people swarm across in both directions. Szpilman and Henryk enter and stop. Seated at the table with Mother and Father is a uniformed young man, YITZCHAK HELLER, unusual appearance, a man with red hair and a Hitler moustache. Heller remains seated, just nods at the brothers. Awkward silence. He runs dry. Benek points to the customer, who makes an imploring gesture to Szpilman. Szpilman stops playing.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He grins and dashes to capture up with his kin. He glances back, but Dorota is gone to view and the parade proceeds on its route. Two chambers on the third level: a lounge room and a cookery. The Szpilmans are unboxing their possessions in quiet. Father halts for a moment to assess. They all go to the casement and gaze out. Their viewpoint - the avenue. Further along, men are constructing a barrier across the avenue. Slush underfoot. Great commotion. People vending footwear, garments, rugs, draperies, nourishment. A lady presents pastries under a barbed-wire shelter. Clamor, hustle, incessant coming and going. Among the merchants, Henryk, slightly scruffier now, and at his feet a container with tomes. He grips a couple of volumes in his hands, trying to engage passers-by. Szpilman, also a little scruffier, meanders his path through the traders and purchasers, the mendicants, the passers-by, and reaches Henryk. Henryk drops the two volumes into the container, takes a handle one side of the container, Szpilman the other. They set off. As they stroll, lugging the container between them, passing mendicants and youngsters asking for nourishment. Suddenly, a WOMAN manifests in front of them, blocking their path. She's brightly blushed with densely painted eyebrows, dressed in an old green velvet drapery with an unsteady mauve ostrich plume ascending from her straw bonnet. She roams on. Szpilman and Henryk, too, proceed on their route. And as they go. Meanwhile, a street ensemble commences to perform a waltz. Jewish constables and German troops are clearing an area, shoving Jews out of the route, including Szpilman, Henryk, and the anxious man. Other troops are clearing an area. Two GERMAN SOLDIERS extract from the crowd a tall lady and a short man and haul them into the cleared area. The duo dance to the street ensemble's waltz. At intervals, German troops select even more improbable pairs: a corpulent lady with a painfully slender man, a young lad with an elderly lady, two men, and two infirm. The German troops are, to various extents, entertained. One of them is nearly hysterical with mirth. The pairs dance as swiftly as they can. A trooper kicks one of the infirm who can't continue any longer. Then a whistle sounds, a constable halts the traffic, the barricade swings open and people surge across in both directions. Szpilman and Henryk enter and halt. Seated at the table with Mother and Father is a uniformed young man, YITZCHAK HELLER, unusual appearance, a man with crimson hair and a Hitler moustache. Heller remains seated, merely nods at the siblings. Uncomfortable silence. He runs dry. Benek points to the patron, who makes a pleading gesture to Szpilman. Szpilman ceases playing."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He is smiled at and run after by his family. He is looked back at by him, but Dorota has been lost to sight by him and the procession is continued on its way by it. Two rooms on the third floor are present: a living room and a kitchen. The belongings of the Szpilmans are being unpacked by them in silence. A moment is paused by Father to take stock. The window is approached by all of them and looked out by them. From their point of view - the street. Further along, a wall is being built by men across the street. Slush is present underfoot. Great activity can be seen. Shoes, clothes, carpets, curtains, and food are being sold by people. Cakes are offered by a woman under a barbed-wire cover. Noise, bustle, restless wing and froing are present. Among the traders is Henryk, now slightly shabbier, and at his feet, a basket with books is seen. A couple of volumes are held by him in his hands, trying to interest passers-by. Szpilman, also a little shabbier, is wending his way through the setters and buyers, the beggars, the passers-by, and reaches Henryk. The two volumes are dropped by Henryk into the basket, and he takes a handle on one side of the basket, while Szpilman takes the other. They set off. As the basket is carried by them between them, passing beggars and children asking for food, suddenly, a WOMAN appears in front of them, with their way barred by her. She's brightly rouged with thickly painted eyebrows, dressed in an old green velvet curtain with an unsteady mauve ostrich feather rising from her straw hat. She is wandered on by her. Szpilman and Henryk, too, continue on their way. And as they go. Meanwhile, a waltz is begun to be played by a street band. A space is being cleared by Jewish policemen and German soldiers, Jews are shoved out of the way by them, including Szpilman, Henryk and the nervous man. A space is also being cleared by other soldiers. Two GERMAN SOLDIERS pull a tall woman and a short man out of the crowd and haul them into the cleared space. The couple is made to dance by them to the street band's waltz. At intervals, even more unlikely couples are selected by German soldiers: a fat woman with a painfully thin man, a young boy with an elderly woman, two men, and two cripples. Various degrees of amusement are shown by the German soldiers. One of them is almost hysterical with laughter. The couples are made to dance as fast as they can. One of the cripples is kicked by a soldier who can't go on any more. Then a whistle is blown, the traffic is stopped by a policeman, the barrier is swung open and people swarm across in both directions. Szpilman and Henryk enter and stop. Seated at the table with Mother and Father is a uniformed young man, YITZCHAK HELLER, unusual appearance, a man with red hair and a Hitler moustache. He remains seated, just nods at the brothers. Awkward silence is experienced. He is run dry. Benek points to the customer, who makes an imploring gesture to Szpilman. The playing is stopped by Szpilman."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He smiles and runs to rejoin his family. Looking back, Dorota is gone, and the procession moves on. Two rooms on the third floor: a living room and kitchen. The Szpilmans unpack in silence. Father pauses, then they all look out the window. Their POV: the street, where men are building a wall. Slush underfoot. Activity everywhere—people selling shoes, clothes, carpets, curtains, food. A woman offers cakes under barbed wire. Noise, bustle, constant motion. Among the traders is Henryk, now slightly shabbier, with a basket of books. Holding a couple, he tries to attract buyers. Szpilman, also more worn, walks through the crowd of traders, beggars, and buyers to reach Henryk. Henryk drops the books, grabs one basket handle; Szpilman takes the other. They carry it together past beggars and children asking for food. Suddenly, a WOMAN appears, blocking them. She’s brightly rouged, in a green velvet curtain dress and a mauve ostrich feathered straw hat. She drifts off, and they continue. A street band starts a waltz. Jewish policemen and German soldiers clear a space, pushing Jews aside, including Szpilman, Henryk, and a nervous man. Two GERMAN SOLDIERS drag a tall woman and short man into the cleared area to dance. Other odd couples follow: a fat woman and thin man, a boy and elderly woman, two men, two cripples. Soldiers laugh, some hysterically. The couples dance quickly; one soldier kicks a cripple who collapses. A whistle blows, a policeman halts traffic, the barrier opens, and people swarm through. Szpilman and Henryk enter and stop. At a table with their parents sits a young uniformed man, YITZCHAK HELLER—red hair, Hitler moustache. He nods at the brothers in silence. The scene turns awkward. Benek points to a customer, who gestures imploringly to Szpilman. Szpilman stops playing."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He smiles, runs to catch his family, and loses sight of Dorota as the procession continues. On the third floor, the Szpilmans silently unpack in their living room and kitchen. Father pauses, and they all look out the window at the street. Men build a wall, and there's slush underfoot. People sell shoes, clothes, and food. A woman offers cakes under barbed wire. Amidst the bustle, Henryk, shabbier now, tries to sell books. Szpilman, also shabbier, joins him, and they carry a basket together, passing beggars and children. A brightly rouged woman in a green velvet curtain blocks their way but wanders on. A street band plays a waltz as Jewish policemen and German soldiers clear space, shoving Jews, including Szpilman and Henryk. Soldiers pull a tall woman and short man to dance. They select odd couples: a fat woman with a thin man, a boy with an elderly woman, two men, and two cripples. Soldiers are amused, one hysterically laughing. Couples dance fast; a soldier kicks a cripple who can't continue. A whistle blows, traffic stops, and people swarm across. Szpilman and Henryk enter and stop. At the table with Mother and Father is YITZCHAK HELLER, a red-haired man with a Hitler moustache. Heller nods at the brothers, and an awkward silence follows. Benek points to a customer, who gestures to Szpilman, and Szpilman stops playing."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "With a bright smile on his face, he eagerly runs to catch up with his family, his steps quickening with excitement. As he glances back over his shoulder, Dorota has already disappeared from view, and the procession continues steadily on its path. On the third floor of the building, there are two rooms: a cozy living room and a functional kitchen. The Szpilman family is quietly unpacking their belongings, each member absorbed in their own thoughts. Father pauses momentarily, taking a deep breath as he surveys the scene. Together, they all move to the window and gaze out at the street below. From their point of view, they see men further down the road, busily constructing a wall that stretches across the street. The ground is covered in slush, and there is a flurry of activity all around. People are energetically selling shoes, clothes, carpets, curtains, and food. A woman is offering cakes, protected under a cover of barbed wire. The air is filled with noise and bustle, a restless ebb and flow of people. Among the traders is Henryk, looking slightly more worn than before, with a basket of books at his feet. He holds a couple of volumes in his hands, attempting to capture the interest of passers-by. Szpilman, also appearing a bit more disheveled, weaves his way through the crowd of sellers, buyers, beggars, and passers-by until he reaches Henryk. Henryk places the two volumes back into the basket, and together they each take a handle, lifting the basket between them. As they walk, they pass by beggars and children who are pleading for food. Suddenly, a WOMAN appears directly in their path, blocking their way. She is extravagantly made up, with bright rouge on her cheeks and thickly painted eyebrows, dressed in an old green velvet curtain, with an unsteady mauve ostrich feather adorning her straw hat. She continues on her way, and Szpilman and Henryk, too, proceed on theirs. As they move along, a street band begins to play a lively waltz. Jewish policemen and German soldiers are busy clearing a space, roughly pushing Jews aside, including Szpilman, Henryk, and a nervous man. Other soldiers are also clearing the area. Two GERMAN SOLDIERS pull a tall woman and a short man from the crowd, dragging them into the cleared space. The couple begins to dance to the street band's waltz. At intervals, German soldiers select even more unlikely pairs: a large woman with a painfully thin man, a young boy with an elderly woman, two men, and two individuals with disabilities. The German soldiers find varying degrees of amusement in this spectacle, with one soldier nearly hysterical with laughter. The couples dance as quickly as they can manage. A soldier cruelly kicks one of the disabled individuals who can no longer continue. Then, a whistle blows, a policeman halts the traffic, the barrier swings open, and people swarm across in both directions. Szpilman and Henryk enter and come to a stop. Seated at the table with Mother and Father is a young man in uniform, YITZCHAK HELLER, who has an unusual appearance, with striking red hair and a Hitler-style moustache. Heller remains seated, merely nodding at the brothers. An awkward silence fills the room. He runs dry. Benek gestures towards the customer, who makes an imploring gesture to Szpilman. Szpilman ceases playing."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a bright and cheerful smile illuminating his face, he eagerly accelerates his pace to catch up with his family, his footsteps quickening with palpable excitement. As he casts a glance back over his shoulder, he notices that Dorota has already vanished from sight, and the steady procession continues on its determined path. On the third floor of the building, there are two distinct rooms: a warm and inviting living room and a practical, well-equipped kitchen. The Szpilman family is gingerly unpacking their belongings, each member deep in their own thoughts and reflections. Father halts momentarily, taking a deep and thoughtful breath as he surveys the surroundings. Together, they all congregate at the window, peering out onto the bustling street below. From their vantage point, they observe men further down the road, energetically constructing a wall that stretches across the street. The ground outside is blanketed in slush, and there is a vibrant flurry of activity all around. People are energetically engaged in selling an array of items such as shoes, clothes, carpets, curtains, and food. A woman is enticingly offering cakes, safely sheltered under a cover of barbed wire. The air is dense with the noise and commotion of the bustling street, a restless ebb and flow of people going about their business. Among the traders is Henryk, appearing slightly more worn and weary than before, a basket of books resting on the ground at his feet. He holds a couple of volumes in his hands, keenly attempting to capture the interest and attention of passers-by. Szpilman, also looking a bit more disheveled and unkempt, weaves his way through the crowded throng of sellers, buyers, beggars, and passers-by until he eventually reaches Henryk. Henryk carefully places the two volumes back into the basket, and together they each take a handle, lifting the heavy basket between them. As they walk, they pass by beggars and children who are desperately pleading for food and sustenance. Suddenly, a WOMAN appears directly in their path, obstructing their way. She is extravagantly adorned, with bright rouge accentuating her cheeks and thickly painted eyebrows, draped in an old green velvet curtain, and an unsteady mauve ostrich feather adorning her straw hat. She continues on her eccentric way, and Szpilman and Henryk proceed on theirs. As they make their way along, a lively street band strikes up a spirited waltz. Jewish policemen and German soldiers are actively clearing a space, roughly pushing Jews aside, including Szpilman, Henryk, and a visibly nervous man. Other soldiers are also engaged in clearing the area. Two GERMAN SOLDIERS forcefully pull a tall woman and a short man from the crowd, dragging them into the cleared space. The couple begins to dance, moving to the lively tunes of the street band's waltz. At intervals, German soldiers select even more unlikely pairs: a large woman paired with a painfully thin man, a young boy with an elderly woman, two men together, and two individuals with visible disabilities. The German soldiers find varying degrees of amusement and entertainment in this spectacle, with one soldier nearly hysterical with laughter. The couples dance as quickly as they can manage, their movements dictated by the lively rhythm. A soldier cruelly kicks one of the disabled individuals who can no longer continue. Then, a whistle sharply blows, a policeman brings the traffic to a halt, the barrier swings open, and the crowd swarms across in both directions. Szpilman and Henryk enter and come to a stop. Seated at the table with Mother and Father is a young man in uniform, YITZCHAK HELLER, who has a striking and unusual appearance, with vivid red hair and a Hitler-style moustache. Heller remains seated, merely nodding a brief acknowledgment at the brothers. An awkward and tense silence fills the room. He runs dry. Benek gestures towards the customer, who makes an imploring gesture to Szpilman. Szpilman ceases playing."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He smiles broadly, feeling a surge of joy, and breaks into a run to catch up with his family, his feet moving swiftly beneath him. As he runs, he glances back over his shoulder, searching for Dorota, but she has already disappeared from view, and the procession continues its steady march forward. The scene shifts to two rooms on the third floor, a living room and a kitchen, where the Szpilmans are quietly unpacking their belongings, each item carefully removed from boxes and placed in its new spot. Father pauses in his task, taking a moment to assess their progress and the new environment. Together, they all move towards the window, their footsteps echoing softly in the room, and gaze out at the street below. From their point of view, they see men further along constructing a wall across the street, their movements deliberate and focused. The ground is covered in slush, making each step treacherous, and the street is alive with activity. People are bustling about, selling shoes, clothes, carpets, curtains, and food, each vendor calling out to potential buyers. A woman stands under a barbed-wire cover, offering cakes to passers-by. The air is filled with noise and the constant movement of people coming and going. Among the traders is Henryk, looking slightly more worn than before, with a basket of books at his feet. He holds a couple of volumes in his hands, attempting to catch the interest of those walking by. Szpilman, also appearing a bit more disheveled, navigates through the crowd of sellers, buyers, beggars, and passers-by until he reaches Henryk. Henryk, seeing Szpilman, drops the two volumes back into the basket and takes hold of one handle, while Szpilman grips the other. Together, they lift the basket and begin to walk, weaving through the crowd, past beggars and children who plead for food. Suddenly, a woman appears before them, blocking their path. She is strikingly made-up, with bright rouge on her cheeks and thickly painted eyebrows, dressed in an old green velvet curtain, and an unsteady mauve ostrich feather adorning her straw hat. She drifts away, and Szpilman and Henryk continue on their way, the basket swinging slightly between them. As they proceed, a street band starts playing a waltz, the music filling the air. Jewish policemen and German soldiers begin to clear a space, roughly pushing Jews aside, including Szpilman, Henryk, and a nervous man nearby. Other soldiers are also clearing the area. Two German soldiers pull a tall woman and a short man from the crowd, dragging them into the cleared space. The couple begins to dance to the waltz played by the street band. At intervals, German soldiers select more unlikely pairs: a fat woman with a painfully thin man, a young boy with an elderly woman, two men, and two cripples. The soldiers watch, some with mild amusement, while one is nearly hysterical with laughter. The couples dance as quickly as they can manage, but when one of the cripples can no longer continue, a soldier kicks him. Then, a whistle blows, signaling a change. A policeman halts the traffic, a barrier swings open, and people rush across in both directions. Szpilman and Henryk enter the scene and come to a stop. Seated at a table with Mother and Father is a young man in uniform, Yitzchak Heller, whose unusual appearance is marked by red hair and a Hitler moustache. Heller remains seated, acknowledging the brothers with just a nod. An awkward silence envelops the group. The silence is broken when Benek points to a customer, who gestures imploringly towards Szpilman. In response, Szpilman ceases playing, the music abruptly coming to a halt."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He smiles and runs to catch up with his family, glancing back to find Dorota lost from view as the procession continues. In their new third-floor apartment, the Szpilmans silently unpack their belongings. Father pauses to take stock, and they all gather at the window to observe the bustling street below, where men are constructing a wall. Amidst the slush and activity, people sell various goods, including a woman offering cakes under barbed wire. Among the traders is Henryk, slightly shabbier, with a basket of books at his feet, trying to engage passers-by. Szpilman, also looking a bit worn, navigates through the crowd to reach Henryk. Together, they lift the basket and set off, passing beggars and children asking for food. Suddenly, a brightly rouged woman in a makeshift outfit blocks their path momentarily before wandering on, allowing Szpilman and Henryk to continue. Meanwhile, a street band plays a waltz as Jewish policemen and German soldiers clear a space, shoving people aside, including Szpilman and Henryk. Soldiers pull a tall woman and a short man from the crowd to dance, followed by other unlikely pairs, much to the soldiers' amusement. A soldier kicks a cripple who can't continue. A whistle blows, traffic stops, and the barrier opens, allowing people to swarm across. Szpilman and Henryk enter and stop at a table where their parents sit with Yitzchak Heller, a young man with red hair and a Hitler moustache. Heller nods at the brothers, creating an awkward silence. Benek gestures to a customer, prompting Szpilman to stop playing."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He smiles and runs to catch up with his family, who are moving through the crowded streets of Warsaw during the early 1940s. He looks back, but Dorota, a friend from the neighborhood often seen helping at the local soup kitchen, is lost to sight and the procession continues on its way. Two rooms on the third floor: a living room and a kitchen in a tenement building known for housing Jewish families during the German occupation. The Szpilmans, a family of musicians led by Władysław Szpilman, a talented pianist, are unpacking their belongings in silence. Father pauses for a moment to take stock, reflecting on the difficulty of moving into the Warsaw Ghetto. They all go to the window and look out. Their POV - the street below that is slowly being transformed into the enclosed ghetto. Further along, men are building a wall across the street, part of the Nazis' plan to segregate the Jewish population. Slush underfoot from a winter that seems interminable. Great activity. People selling shoes, clothes, carpets, curtains, food in an impromptu marketplace that feeds the ghetto's economy. A woman offers cakes under a barbed-wire cover, a makeshift stand that highlights the scarcity of food. Noise, bustle, restless wing and froing. Among the traders, Henryk Szpilman, slightly shabbier now after losing his job as a lawyer, stands with a basket at his feet containing books. He holds a couple of volumes in his hands, trying to interest passers-by with literature now considered contraband. Szpilman, also a little shabbier, wends his way through the setters and buyers, the beggars, the passers-by, and reaches Henryk. Henryk drops the two volumes into the basket, takes a handle one side of the basket, Szpilman the other. They set off to continue their small business in the hopes of trading for food. As they walk, carrying the basket between them, passing beggars and children asking for food, a common sight due to widespread hunger. Suddenly, a WOMAN appears in front of them, barring their way. She's brightly rouged with thickly painted eyebrows, dressed in an old green velvet curtain, a remnant of better times, with an unsteady mauve ostrich feather rising from her straw hat. She wanders on, illustrating the despair and makeshift fashion of the ghetto. Szpilman and Henryk, too, continue on their way. And as they go, trying to maintain hope. Meanwhile, a street band begins to play a waltz, a rare moment of music amidst oppression. Jewish policemen and German soldiers are clearing a space, shoving Jews out of the way, including Szpilman, Henryk, and the nervous man who glances anxiously at the soldiers. Other soldiers are clearing a space. Two GERMAN SOLDIERS pull out of the crowd a tall woman and a short man and haul them into the cleared space, forcing them to partake in a cruel display. The couple dance to the street band's waltz, the music contrasting with the dehumanizing spectacle. At intervals, German soldiers select even more unlikely couples: a fat woman with a painfully thin man, a young boy with an elderly woman, two men, and two cripples. The German soldiers are, to various degrees, amused by their own cruelty. One of them is almost hysterical with laughter as he watches. The couples dance as fast as they can, pressured by the soldiers’ prodding. A soldier kicks one of the cripples who can't go on any more, a harsh reminder of the soldiers' lack of mercy. Then a whistle blows, a policeman stops the traffic, the barrier swings open and people swarm across in both directions, signifying the end of the forced entertainment. Szpilman and Henryk enter and stop, their journey momentarily interrupted. Seated at the table with Mother and Father is a uniformed young man, YITZCHAK HELLER, a Jewish policeman known for collaborating with the Germans in hopes of gaining their favor, unusual appearance, a man with red hair and a Hitler moustache, his look a controversial choice. Heller remains seated, just nods at the brothers, his presence causing an awkward silence. He runs dry, a testament to the tension in the room. Benek, a nearby trader trying to sell his wares, points to the customer, who makes an imploring gesture to Szpilman, hoping for a brief moment of music to lift spirits. Szpilman stops playing, aware of the heavy atmosphere hanging over them all."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He smiles and runs to catch up with his family. He looks back but Dorota is lost to sight and the procession continues on its way. Two rooms on the third floor a living room and a kitchen. The Szpilmans are unpacking their belongings in silence. Father pauses for a moment to take stock. They all go to the window and look out. Their POV  the street. Further along men are building a wall across the street. Slush underfoot. Great activity. People selling shoes clothes carpets curtains food. A woman offers cakes under a barbedwire cover. Noise bustle restless wing and froing. Among the traders. Henryk slightly shabbier now and at his feet a basket with books. He holds a couple of volumes in his hands trying to interest passersby. Szpilman also a little shabbier wends his way through the setters and buyers the beggars the passersby and reaches Henryk. Henryk drops the two volumes into the basket takes a handle one side of the basket Szpilman the other. They set off. As they walk carrying the basket between them passing beggars and children asking for food. Suddenly a WOMAN appears in front of them barring their way. She is brightly rouged with thickly painted eyebrows dressed in an old green velvet curtain with an unsteady mauve ostrich feather rising from her straw hat. She wanders on. Szpilman and Henryk too continue on their way. And as they go. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Meanwhile a street band begins to play a waltz. Jewish policemen and German soldiers are clearing a space shoving Jews out of the way including Szpilman Henryk and the nervous man. Other soldiers are clearing a space. Two GERMAN SOLDIERS pull out of the crowd a tall woman and a short man and haul them into the cleared space. The couple dance to the street band's waltz. At intervals German soldiers select even more unlikely couples. a fat woman with a painfully thin man. a young boy with an elderly woman. two men and two cripples. The German soldiers are to various degrees amused. One of them is almost hysterical with laughter. The couples dance as fast as they can. A soldier kicks one of the cripples who cannot go on any more. Then a whistle blows. a policeman stops the traffic. the barrier swings open and people swarm across in both directions. Szpilman and Henryk enter and stop. Seated at the table with Mother and Father is a uniformed young man. YITZCHAK HELLER unusual appearance. a man with red hair and a Hitler moustache. Heller remains seated just nods at the brothers. Awkward silence. He runs dry. Benek points to the customer who makes an imploring gesture to Szpilman. Szpilman stops playing."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He smiles and runs to catch up with his family. He looks back but Dorota is lost to sight and the procession continues on its way. Two rooms on the third floor a living room and a kitchen. The Szpilmans are unpacking their belongings in silence. Father pauses for a moment to take stock. They all go to the window and look out. Their POV  the street. Further along men are building a wall across the street. Slush underfoot. Great activity. People selling shoes clothes carpets curtains food. A woman offers cakes under a barbedwire cover. Noise bustle restless wing and froing. Among the traders. Henryk slightly shabbier now and at his feet a basket with books. He holds a couple of volumes in his hands trying to interest passersby. Szpilman also a little shabbier wends his way through the setters and buyers the beggars the passersby and reaches Henryk. Henryk drops the two volumes into the basket takes a handle one side of the basket Szpilman the other. They set off. As they walk carrying the basket between them passing beggars and children asking for food. Suddenly a WOMAN appears in front of them barring their way. She is brightly rouged with thickly painted eyebrows dressed in an old green velvet curtain with an unsteady mauve ostrich feather rising from her straw hat. She wanders on. Szpilman and Henryk too continue on their way. And as they go. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Meanwhile a street band begins to play a waltz. Jewish policemen and German soldiers are clearing a space shoving Jews out of the way including Szpilman Henryk and the nervous man. Other soldiers are clearing a space. Two GERMAN SOLDIERS pull out of the crowd a tall woman and a short man and haul them into the cleared space. The couple dance to the street band's waltz. At intervals German soldiers select even more unlikely couples. a fat woman with a painfully thin man. a young boy with an elderly woman. two men and two cripples. The German soldiers are to various degrees amused. One of them is almost hysterical with laughter. The couples dance as fast as they can. A soldier kicks one of the cripples who cannot go on any more. Then a whistle blows. a policeman stops the traffic. the barrier swings open and people swarm across in both directions. Szpilman and Henryk enter and stop. Seated at the table with Mother and Father is a uniformed young man. YITZCHAK HELLER unusual appearance. a man with red hair and a Hitler moustache. Heller remains seated just nods at the brothers. Awkward silence. He runs dry. Benek points to the customer who makes an imploring gesture to Szpilman. Szpilman stops playing."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He smiles and runs to catch up with his family. He looks back but Dorota is lost to sight and the procession continues on its way. Two rooms on the third floor a living room and a kitchen. The Szpilmans are unpacking their belongings in silence. Father pauses for a moment to take stock. They all go to the window and look out. Their POV  the street. Further along men are building a wall across the street. Slush underfoot. Great activity. People selling shoes clothes carpets curtains food. A woman offers cakes under a barbedwire cover. Noise bustle restless wing and froing. Then a whistle blows. a policeman stops the traffic. the barrier swings open and people swarm across in both directions. Szpilman and Henryk enter and stop. Seated at the table with Mother and Father is a uniformed young man. YITZCHAK HELLER unusual appearance. a man with red hair and a Hitler moustache. Heller remains seated just nods at the brothers. Awkward silence. He runs dry. Benek points to the customer who makes an imploring gesture to Szpilman. Szpilman stops playing."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He smiles and runs to catch up with his family. He looks back but Dorota is lost to sight and the procession continues on its way. Two rooms on the third floor a living room and a kitchen. The Szpilmans are unpacking their belongings in silence. Father pauses for a moment to take stock. Heller remains seated just nods at the brothers. Awkward silence. He runs dry. Benek points to the customer who makes an imploring gesture to Szpilman. Szpilman stops playing."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The cat chuckles and glides to align with its herd. It glances back, but Gertrude vanishes beyond reach and the parade drifts along its path. Two caves on the fifth floor: a library and a pantry. The Martians are stowing their treasures in murmurs. Captain hesitates for a while to survey the scene. They all march to the portal and peer out. Their GLANCE - the ocean. Beyond, robots are erecting a fence across the water. Mist beneath. Huge commotion. Creatures vending hats, bags, paintings, drapes, toys. An alien presents pies beneath a glass dome. Clatter, chaos, ceaseless weave and wander. Among the merchants, Leopold, slightly scruffier now, and near him a crate with shoes. He clutches a pair of sneakers in his paws, attempting to captivate strollers-by. Martian, also slightly more rugged, threads his path through the explorers and collectors, the wanderers, the drifters, and locates Leopold. Leopold tosses the pair of sneakers into the crate, grips a side of the crate, Martian the other. They embark. As they drift, balancing the crate between them, meeting wanderers and pups pleading for snacks. Abruptly, a PENGUIN emerges before them, blocking their route. It's vividly inked with boldly drawn whiskers, clad in a tattered purple silk blanket with a wobbly teal peacock quill protruding from its felt cap. It waddles forth. Martian and Leopold, too, proceed on their path. And as they journey. Meanwhile, a harbor band strikes up a tango. Alien marshals and Martian guards are making room, jostling Elves aside, inclusive of Martian, Leopold and the jittery elf. Alternate guards are creating a void. Two MARTIAN GUARDS extract from the swarm a lanky elf and a petite gnome and hurl them into the cleared section. The duo twirls to the harbor ensemble's tango. Here and there, Martian guards pick even more peculiar duets: a rotund elf with a frail gnome, a tiny goblin with an ancient elf, two elves, and two sprites. The Martian guards are, to various extents, entertained. One of them is nearly in fits of mirth. The pairs whirl as briskly as possible. A guard nudges one of the sprites who struggles to carry on. Then a trumpet blasts, a marshal halts the swarm, the barricade swings aside and creatures flood over in both courses. Martian and Leopold enter and pause. Resting at the slab with Matron and Captain is a dressed-up young creature, ZADOK HARTMAN, remarkable demeanor, an elf with azure fur and a pirate beard. Hartman stays seated, merely bows at the pair. Uncomfortable hush. It runs dry. Rolf gestures to the patron, who makes a beseeching move to Martian. Martian halts strumming."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "He smiles and rushes to join his family, losing sight of Dorota as the procession moves on. The Szpilmans unpack in silence in their two-room apartment. From their window, they see men building a wall, with bustling activity below: people selling goods, including a woman offering cakes under barbed-wire. Among the traders is Henryk, with books in a basket. Szpilman joins him, and they carry the basket through the crowd. A brightly dressed woman momentarily blocks their path. A street band plays as Jewish policemen and German soldiers make room for forced dancing, selecting unlikely pairs from the crowd, to the soldiers’ amusement. Eventually, Szpilman and Henryk arrive at home, where they find Yitzchak Heller, a uniformed man with red hair and a Hitler moustache, seated in awkward silence with Mother and Father."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Szpilman stops playing Benek points to the customer who makes an imploring gesture to Szpilman  He runs dry  Awkward silence  Heller remains seated just nods at the brothers  a man with red hair and a Hitler moustache  YITZCHAK HELLER unusual appearance  Seated at the table with Mother and Father is a uniformed young man  Szpilman and Henryk enter and stop  the barrier swings open and people swarm across in both directions  a policeman stops the traffic  Then a whistle blows  A soldier kicks one of the cripples who can't go on any more  The couples dance as fast as they can  One of them is almost hysterical with laughter  The German soldiers are to various degrees amused  two men and two cripples  a young boy with an elderly woman  a fat woman with a painfully thin man  At intervals German soldiers select even more unlikely couples  The couple dance to the street band's waltz  Two GERMAN SOLDIERS pull out of the crowd a tall woman and a short man and haul them into the cleared space  Other soldiers are clearing a space  Jewish policemen and German soldiers are clearing a space shoving Jews out of the way including Szpilman Henryk and the nervous man  Meanwhile a street band begins to play a waltz  And as they go  Szpilman and Henryk too continue on their way  She wanders on  She's brightly rouged with thickly painted eyebrows dressed in an old green velvet curtain with an unsteady mauve ostrich feather rising from her straw hat  Suddenly a WOMAN appears in front of them barring their way  As they walk carrying the basket between them passing beggars and children asking for food  They set off  Henryk drops the two volumes into the basket takes a handle one side of the basket Szpilman the other  Szpilman also a little shabbier wends his way through the setters and buyers the beggars the passersby and reaches Henryk  He holds a couple of volumes in his hands trying to interest passersby  Henryk slightly shabbier now and at his feet a basket with books  Among the traders  Noise bustle restless wing and froing  A woman offers cakes under a barbedwire cover  People selling shoes clothes carpets curtains food  Great activity  Slush underfoot  Further along men are building a wall across the street  Their POV  the street  They all go to the window and look out  Father pauses for a moment to take stock  The Szpilmans are unpacking their belongings in silence  Two rooms on the third floor a living room and a kitchen  He looks back but Dorota is lost to sight and the procession continues on its way  He smiles and runs to catch up with his family "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He looks back but Dorota is lost to sight and the procession continues on its way He smiles and runs to catch up with his family The Szpilmans are unpacking their belongings in silence Two rooms on the third floor a living room and a kitchen They all go to the window and look out Father pauses for a moment to take stock Further along men are building a wall across the street Their POV  the street Great activity Slush underfoot A woman offers cakes under a barbedwire cover People selling shoes clothes carpets curtains food Among the traders Noise bustle restless wing and froing He holds a couple of volumes in his hands trying to interest passersby Henryk slightly shabbier now and at his feet a basket with books Henryk drops the two volumes into the basket takes a handle one side of the basket Szpilman the other Szpilman also a little shabbier wends his way through the setters and buyers the beggars the passersby and reaches Henryk As they walk carrying the basket between them passing beggars and children asking for food They set off She is brightly rouged with thickly painted eyebrows dressed in an old green velvet curtain with an unsteady mauve ostrich feather rising from her straw hat Suddenly a WOMAN appears in front of them barring their way Szpilman and Henryk too continue on their way She wanders on Meanwhile a street band begins to play a waltz And as they go Other soldiers are clearing a space Jewish policemen and German soldiers are clearing a space shoving Jews out of the way including Szpilman Henryk and the nervous man The couple dance to the street band's waltz Two GERMAN SOLDIERS pull out of the crowd a tall woman and a short man and haul them into the cleared space a fat woman with a painfully thin man At intervals German soldiers select even more unlikely couples two men and two cripples a young boy with an elderly woman One of them is almost hysterical with laughter The German soldiers are to various degrees amused A soldier kicks one of the cripples who cannot go on any more The couples dance as fast as they can a policeman stops the traffic Then a whistle blows Szpilman and Henryk enter and stop the barrier swings open and people swarm across in both directions YITZCHAK HELLER unusual appearance Seated at the table with Mother and Father is a uniformed young man Heller remains seated just nods at the brothers a man with red hair and a Hitler moustache He runs dry Awkward silence Szpilman stops playing Benek points to the customer who makes an imploring gesture to Szpilman"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Meanwhile a street band begins to play a waltz  Jewish policemen and German soldiers are clearing a space shoving Jews out of the way including Szpilman Henryk and the nervous man  Other soldiers are clearing a space  Two GERMAN SOLDIERS pull out of the crowd a tall woman and a short man and haul them into the cleared space  The couple dance to the street band's waltz  At intervals German soldiers select even more unlikely couples  a fat woman with a painfully thin man  a young boy with an elderly woman  two men and two cripples  The German soldiers are to various degrees amused  One of them is almost hysterical with laughter  The couples dance as fast as they can  A soldier kicks one of the cripples who can't go on any more  Then a whistle blows  a policeman stops the traffic  the barrier swings open and people swarm across in both directions  Szpilman and Henryk enter and stop  Seated at the table with Mother and Father is a uniformed young man  YITZCHAK HELLER unusual appearance  a man with red hair and a Hitler moustache  Heller remains seated just nods at the brothers  Awkward silence  He runs dry  Benek points to the customer who makes an imploring gesture to Szpilman  Szpilman stops playing He smiles and runs to catch up with his family  He looks back but Dorota is lost to sight and the procession continues on its way  Two rooms on the third floor a living room and a kitchen  The Szpilmans are unpacking their belongings in silence  Father pauses for a moment to take stock  They all go to the window and look out  Their POV  the street  Further along men are building a wall across the street  Slush underfoot  Great activity  People selling shoes clothes carpets curtains food  A woman offers cakes under a barbedwire cover  Noise bustle restless wing and froing  Among the traders  Henryk slightly shabbier now and at his feet a basket with books  He holds a couple of volumes in his hands trying to interest passersby  Szpilman also a little shabbier wends his way through the setters and buyers the beggars the passersby and reaches Henryk  Henryk drops the two volumes into the basket takes a handle one side of the basket Szpilman the other  They set off  As they walk carrying the basket between them passing beggars and children asking for food  Suddenly a WOMAN appears in front of them barring their way  She's brightly rouged with thickly painted eyebrows dressed in an old green velvet curtain with an unsteady mauve ostrich feather rising from her straw hat  She wanders on  Szpilman and Henryk too continue on their way  And as they go "
        }
      ]
    }
  ]
}