{
  "ground_truth": "The friend watches the customer intently as he drops the coins one by one onto the marble. He drops them, puts his ear close, and listens. Two or three coins he discards, but he smiles when others make a pure tone and keeps them. Szpilman exchanges looks with a pretty whore, who makes eyes at him. Satisfied, the customer beams, nods his thanks to Szpilman, who resumes his piano playing. Szpilman is walking. He passes emaciated children and beggars and steps over the corpses lying on the sidewalk. The wall runs the length of the street, dividing it in half and narrowing it, with buildings on one side and the wall on the other. Szpilman walks along. A piercing whistle comes from the Aryan side, causing Szpilman to stop. Two women appear from a doorway, approach the wall, and look up. Two or three packages come flying over from the Aryan side, which the women grab and then disappear. Szpilman walks on and sees a child appear through a hole at ground level. The child wriggles through, then turns, pulls a package after him, and runs. As Szpilman walks on, he hears a noise and looks back to see a second child trying to wriggle through the same hole but is stuck. Angry German voices come from the Aryan side. Szpilman goes to him, pulls him with all his might, but the boy is jammed in the hole. From the other side of the wall, the sound of an angry German voice and of a boot stamping violently on the boy is heard, and the boy screams in agony. Szpilman continues to try to pull the boy through. The sound of the German voice swearing and the dull, crunching noise made by the boot smashing into the boy continues, and with every thud, the boy screams in terrible pain. Szpilman struggles to help the boy whose screams are becoming weaker yet increasingly desperate. Szpilman pulls his arms and finally manages to get him through. The boy lies moaning, his head lolls, and his jaw sags; he is dead. Szpilman stands quickly and hurries away. Szpilman approaches the house through a shabby yard, hearing the noise of a mimeograph machine. A huge, cheerful man with a perpetual cigarette in his mouth laughs and coughs, starts looking through papers. His room is piled from floor to ceiling with old papers and stuff, dark, shabby, and run-down. One of his sons, Symche, is operating the mimeograph machine while the other, Dolek, is sorting the sheets as they come off the roller. Mrs. Zyskind, holding a toddler, is cooking at a small stove. A distinctive knock on the door makes Szpilman tense, but Jehuda beams and gestures to one of his boys, saying \"Symche.\" The boy opens the door to admit a short, neat man, Majorek.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The companion observes the client closely as he lets the coins fall one by one onto the marble. He lets them fall, puts his ear near, and listens. Two or three coins he discards, but he smiles when others make a pure tone and keeps them. Szpilman exchanges glances with a pretty escort, who flirts at him. Contented, the client beams, nods his gratitude to Szpilman, who resumes his piano playing. Szpilman is walking. He passes gaunt children and mendicants and steps over the bodies lying on the walkway. The wall runs the length of the street, dividing it in half and narrowing it, with constructions on one side and the wall on the other. Szpilman walks along. A shrill whistle comes from the Aryan side, causing Szpilman to stop. Two women emerge from a doorway, approach the wall, and look up. Two or three parcels come flying over from the Aryan side, which the women seize and then vanish. Szpilman walks on and sees a youngster appear through a hole at ground level. The youngster squirms through, then turns, pulls a parcel after him, and runs. As Szpilman walks on, he hears a noise and looks back to see a second youngster trying to squirm through the same hole but is stuck. Angry German voices come from the Aryan side. Szpilman goes to him, pulls him with all his strength, but the boy is jammed in the hole. From the other side of the wall, the sound of an angry German voice and of a boot stamping violently on the boy is heard, and the boy screams in agony. Szpilman continues to try to pull the boy through. The sound of the German voice cursing and the dull, crunching noise made by the boot smashing into the boy continues, and with every thud, the boy screams in terrible suffering. Szpilman struggles to help the boy whose screams are becoming weaker yet increasingly desperate. Szpilman pulls his arms and finally manages to get him through. The boy lies moaning, his head lolls, and his jaw sags; he is lifeless. Szpilman stands quickly and hurries away. Szpilman approaches the residence through a shabby yard, hearing the noise of a duplicating machine. A large, cheerful man with a perpetual cigarette in his mouth laughs and coughs, starts looking through papers. His room is piled from floor to ceiling with old papers and stuff, dark, shabby, and run-down. One of his sons, Symche, is operating the duplicating machine while the other, Dolek, is sorting the sheets as they come off the roller. Mrs. Zyskind, holding a toddler, is cooking at a small stove. A unique knock on the door makes Szpilman tense, but Jehuda beams and gestures to one of his boys, saying \"Symche.\" The boy opens the door to admit a short, neat man, Majorek."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The customer is watched intently by the friend as the coins are dropped one by one onto the marble by him. They are put by him, his ear is placed close, and they are listened to. Two or three coins are discarded by him, but a smile is given when a pure tone is made by others and kept. Looks are exchanged between a pretty whore and Szpilman, who is made eyes at by her. Satisfied, Szpilman is nodded to by the beaming customer, and the piano playing is resumed by Szpilman. Szpilman walks. Emaciated children and beggars are passed by him, and corpses lying on the sidewalk are stepped over. The street is run the length of by the wall, divided by it in half and narrowed, with buildings on one side and the wall on the other. Along the street, Szpilman walks. From the Aryan side, a piercing whistle is heard, causing Szpilman to stop. Two women are seen by him appearing from a doorway, approaching the wall, and looking up. Packages are sent flying over from the Aryan side, which are grabbed by the women, and then they disappear. Szpilman continues walking and sees a child appearing through a hole at ground level. The child wriggles through, then a package is pulled after him, and he runs. As Szpilman walks on, a noise is heard by him, and he looks back to see a second child trying to wriggle through the same hole but getting stuck. From the Aryan side, angry German voices are heard. The child is approached by Szpilman, who pulls him with all his might, but the boy is jammed in the hole. From the other side of the wall, an angry German voice and the sound of a boot stamping violently on the boy are heard, and the boy screams in agony. The boy is continued to be pulled through by Szpilman. The German voice swears, and a dull, crunching noise is made by the boot smashing into the boy, and with every thud, the boy screams in terrible pain. The boy's increasingly desperate and weaker screams are struggled against by Szpilman, who tries to help. Finally, the arms are pulled by Szpilman, and the boy is managed to be got through. Moaning, the boy lies, his head lolls, and his jaw sags; death has claimed him. Szpilman stands quickly and hurries away. Approaching the house, Szpilman goes through a shabby yard, hearing the noise made by a mimeograph machine. A huge, cheerful man with a perpetual cigarette in his mouth laughs and coughs, starting to look through papers. From floor to ceiling, old papers and stuff pile his room, which is dark, shabby, and run-down. The mimeograph machine is operated by one of his sons, Symche, while the sheets are sorted by the other, Dolek, as they come off the roller. Mrs. Zyskind, holding a toddler, cooks at a small stove. A distinctive knock on the door tenses Szpilman, but a beam is given by Jehuda, who gestures to one of his boys, saying \"Symche.\" The door is opened by the boy to admit a short, neat man, Majorek."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The friend watches the customer closely as he drops coins onto the marble, listening intently. He discards a few but smiles at those with a pure tone, keeping them. Szpilman exchanges glances with a pretty whore. The satisfied customer nods to Szpilman, who resumes playing the piano. As Szpilman walks, he passes emaciated children, beggars, and corpses on the sidewalk. A wall divides the street, narrowing it. A whistle from the Aryan side makes Szpilman stop. Two women approach the wall, catching packages thrown over. A child wriggles through a hole, pulls a package, and runs. Szpilman sees another child stuck in the hole, with angry German voices nearby. He tries to pull the boy through as a German boot stomps on him, causing screams of agony. Szpilman finally frees the boy, who is dead. Szpilman quickly leaves. He approaches a house, hearing a mimeograph machine. A cheerful man, Jehuda, with a cigarette, laughs and coughs, searching through papers. His room is cluttered with papers. His sons, Symche and Dolek, operate the mimeograph and sort sheets. Mrs. Zyskind cooks at a small stove. A distinctive knock makes Szpilman tense, but Jehuda gestures to Symche, who opens the door for Majorek."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The friend watches the customer closely as he drops coins onto the marble, listening for a pure tone. He discards a few but smiles at others, nodding thanks to Szpilman, who resumes playing piano. Szpilman walks past emaciated children, beggars, and corpses. A wall divides the street. A whistle from the Aryan side stops him. Two women collect packages thrown over the wall. A child wriggles through a hole, pulls a package, and runs. Another child gets stuck, and Szpilman tries to help. German voices and a boot's thud are heard as the boy screams. Szpilman pulls him through, but the boy dies. Szpilman hurries away. He approaches a house, hearing a mimeograph machine. A cheerful man, Jehuda, with a cigarette, laughs and sorts papers. His sons, Symche and Dolek, operate the machine. Mrs. Zyskind cooks. A knock tenses Szpilman, but Jehuda gestures to Symche, who admits Majorek."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The friend observes the customer with great attention and focus as he carefully drops the coins, one by one, onto the smooth, cool surface of the marble. Each coin is dropped with precision, and the customer leans in closely, putting his ear near the marble to listen intently. He discards two or three coins that do not meet his expectations, but a smile spreads across his face when others produce a pure, resonant tone, and he decides to keep those. Szpilman exchanges a meaningful glance with an attractive woman of the night, who flirts with him through her expressive eyes. Feeling satisfied with his selection, the customer beams with pleasure and nods his thanks to Szpilman, who then resumes his piano playing with renewed focus. \n\nSzpilman is now walking through the streets. He passes by children who are painfully thin and beggars who plead for help, stepping over the lifeless bodies that lie on the sidewalk. A wall runs the entire length of the street, effectively dividing it in half and making it narrower, with buildings on one side and the imposing wall on the other. Szpilman continues his walk. Suddenly, a sharp, piercing whistle emanates from the Aryan side, causing Szpilman to halt in his tracks. Two women emerge from a doorway, approach the wall, and gaze upward. Two or three packages are thrown over from the Aryan side, which the women quickly grab before disappearing from view. Szpilman continues on his way and notices a child appearing through a small hole at ground level. The child wriggles through the opening, then turns back to pull a package after him, and swiftly runs away. As Szpilman continues walking, he hears a noise and turns to see a second child attempting to squeeze through the same hole but is stuck. Angry German voices can be heard from the Aryan side. Szpilman rushes to the child, pulling with all his strength, but the boy remains jammed in the hole. From the other side of the wall, the sound of an angry German voice and the violent stamping of a boot on the boy is heard, causing the boy to scream in agony. Szpilman continues his efforts to pull the boy through. The sound of the German voice swearing and the dull, crunching noise of the boot smashing into the boy continues, and with each thud, the boy's screams become more filled with terrible pain. Szpilman struggles desperately to help the boy, whose screams are growing weaker yet increasingly desperate. Szpilman pulls on his arms with all his might and finally manages to get him through. The boy lies moaning, his head lolls to the side, and his jaw sags; he is dead. Szpilman quickly stands up and hurries away from the scene.\n\nSzpilman approaches a house through a shabby, unkempt yard, hearing the rhythmic noise of a mimeograph machine at work. A large, cheerful man with a cigarette perpetually hanging from his mouth laughs and coughs as he begins to sift through a pile of papers. His room is cluttered, with old papers and various items stacked from floor to ceiling, giving it a dark, shabby, and run-down appearance. One of his sons, Symche, is diligently operating the mimeograph machine while the other son, Dolek, is busy sorting the sheets as they come off the roller. Mrs. Zyskind, holding a small toddler in her arms, is cooking at a modest stove. A distinctive knock on the door makes Szpilman tense, but Jehuda beams with a smile and gestures to one of his boys, saying \"Symche.\" The boy opens the door to admit a short, neat man named Majorek."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The attentive friend watches the customer with immense focus and concentration, observing every movement with great care as he meticulously drops each coin, one by one, onto the cool, polished surface of the smooth marble table. Each coin is let go with deliberate precision, and the customer leans in closely, positioning his ear near the marble to listen with intense concentration. He discards two or three coins that fail to meet his expectations, but a joyful smile spreads across his face when others emit a pure, resonant tone, signifying their quality and prompting him to keep them. Szpilman exchanges a significant glance with a beautiful woman of the night, who engages in playful flirtation with him through her expressive eyes. Feeling thoroughly satisfied with his selection, the customer beams with pleasure and offers a nod of gratitude to Szpilman, who then resumes his piano playing with renewed focus and determination.\n\nSzpilman is now making his way through the bustling streets. As he walks, he passes by children who are painfully thin and beggars who plead desperately for assistance, stepping over the lifeless bodies that tragically lie on the sidewalk. A towering wall runs the entire length of the street, effectively dividing it in half, making it narrower, with buildings on one side and the imposing wall on the other. Szpilman continues his walk down this divided street. Suddenly, a sharp and piercing whistle rings out from the Aryan side, causing Szpilman to abruptly halt in his tracks. Two women then emerge from a nearby doorway, approach the wall, and gaze upward expectantly. Two or three packages are thrown over from the Aryan side, which the women quickly grab before vanishing from view. Szpilman continues on his way and notices a child appearing through a small hole at ground level. The child wriggles through the narrow opening, then turns back to pull a package after him, and swiftly runs away with it. As Szpilman continues walking, he hears a noise and turns to see another child attempting to squeeze through the same hole but becomes stuck. Angry German voices project from the Aryan side. Szpilman rushes to the child, pulling with all his strength, but the boy remains jammed in the tight opening. From the other side of the wall, the sound of an angry German voice and the violent stamping of a boot on the trapped boy is heard, causing the boy to scream out in sheer agony. Szpilman continues his frantic efforts to pull the boy through. The sound of the German voice swearing and the dull, crunching noise of the boot smashing into the boy continue, and with each thud, the boy's screams become more filled with terrible pain. Szpilman struggles desperately to help the boy, whose screams are growing weaker yet increasingly desperate. Szpilman pulls on the boy's arms with all his might and finally, with a great effort, manages to get him through. The boy lies moaning, his head lolls to the side, and his jaw sags; heartbreakingly, he is dead. Szpilman quickly stands up and hurries away from the tragic scene.\n\nSzpilman approaches a house through a shabby, unkempt yard, enveloped by the rhythmic noise of a mimeograph machine at work. A large, cheerful man, with a cigarette perpetually hanging from his mouth, laughs and coughs as he begins to sift through a pile of miscellaneous papers. His room is cluttered, with old papers and various items stacked from floor to ceiling, giving it a dark, shabby, and run-down appearance. One of his sons, Symche, is diligently operating the mimeograph machine while the other son, Dolek, is busy sorting the freshly printed sheets as they come off the roller. Mrs. Zyskind, holding a small toddler lovingly in her arms, is busy cooking at a modest stove. A distinctive knock on the door makes Szpilman tense momentarily, but Jehuda beams with a welcoming smile and gestures toward one of his boys, saying, \"Symche.\" The boy responds promptly, opening the door to admit a short, neat man named Majorek."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The friend focuses his gaze intently on the customer, observing each deliberate movement as the customer carefully drops the coins one by one onto the smooth surface of the marble. With each coin that falls, the customer leans in closer, bringing his ear near to the marble to listen attentively to the sound it makes. As he listens, he discards two or three coins that fail to produce the desired sound, setting them aside with a slight frown. However, when certain coins emit a pure, resonant tone, a smile spreads across his face, and he decides to keep them. Meanwhile, Szpilman exchanges a glance with a pretty whore, who flirts with him by making eyes. Once satisfied with his selection, the customer beams with pleasure and nods his thanks to Szpilman, who acknowledges the gesture and resumes playing the piano. Szpilman then finds himself walking along the street, passing by emaciated children and beggars, carefully stepping over the lifeless bodies that lie on the sidewalk. The wall stretches the entire length of the street, effectively dividing it in half and creating a narrow passage with buildings on one side and the wall on the other. As Szpilman continues his walk, a sudden, piercing whistle from the Aryan side catches his attention, causing him to stop in his tracks. Two women emerge from a nearby doorway, approach the wall, and gaze upward expectantly. In quick succession, two or three packages are thrown over from the Aryan side, which the women swiftly grab before disappearing from view. Szpilman resumes his walk and soon notices a child appearing through a small hole at ground level. The child wriggles through the opening, then turns back to pull a package after him before running off. As Szpilman continues on his way, he hears a noise that prompts him to look back, only to see a second child attempting to squeeze through the same hole but becoming stuck. The sound of angry German voices emanates from the Aryan side, and Szpilman rushes to the child's aid, pulling with all his strength, but the boy remains jammed in the hole. From the other side of the wall, the harsh sound of an angry German voice is accompanied by the violent stamping of a boot on the boy, causing him to scream in agony. Despite the terrifying situation, Szpilman persists in his efforts to pull the boy through. The German voice continues to swear, and the dull, crunching noise of the boot smashing into the boy is relentless, with each thud eliciting a scream of terrible pain from the child. Szpilman struggles desperately to help the boy, whose screams grow weaker yet more desperate with each passing moment. Finally, with a determined pull, Szpilman manages to free the boy, but the child lies moaning, his head lolling and his jaw sagging, lifeless. Realizing the boy is dead, Szpilman quickly stands and hurries away from the scene. He approaches a house through a shabby yard, his ears picking up the rhythmic noise of a mimeograph machine at work. Inside, a huge, cheerful man with a perpetual cigarette in his mouth laughs and coughs as he begins to sift through a pile of papers. The room is cluttered from floor to ceiling with old papers and various items, giving it a dark, shabby, and run-down appearance. One of his sons, Symche, is busy operating the mimeograph machine, while the other son, Dolek, diligently sorts the sheets as they come off the roller. Mrs. Zyskind, holding a toddler in her arms, is occupied with cooking at a small stove. A distinctive knock on the door causes Szpilman to tense up, but Jehuda, the cheerful man, beams and gestures to one of his boys, saying \"Symche.\" The boy promptly opens the door to admit a short, neat man named Majorek."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The friend observes the customer closely as he evaluates the coins by their sound, discarding a few but keeping those with a pure tone. Szpilman exchanges glances with a flirtatious woman before the satisfied customer thanks him, allowing Szpilman to resume playing the piano. As Szpilman walks through the street, he navigates past emaciated children, beggars, and corpses, with a wall dividing the street. A whistle from the Aryan side halts him, and he watches as two women collect packages thrown over the wall before disappearing. Continuing on, Szpilman sees a child emerge from a hole, pulling a package through, and run off. He then notices a second child stuck in the hole, struggling as angry German voices and violent sounds come from the other side. Szpilman desperately tries to free the boy, who is being brutally attacked, and finally succeeds, only to find the child dead. Distressed, Szpilman quickly leaves the scene. He arrives at a house, hearing a mimeograph machine, and is greeted by a cheerful man, Jehuda, amidst a cluttered room. Jehuda's sons, Symche and Dolek, are busy with the mimeograph, while Mrs. Zyskind cooks nearby. A distinctive knock makes Szpilman tense, but Jehuda reassures him, and Symche opens the door for Majorek, a short, neat man."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The friend watches the customer intently as he drops the coins one by one onto the marble countertop in the dimly lit café known for its clandestine meetings. He drops them, puts his ear close, and listens, a technique used by some to detect counterfeit currency. Two or three coins he discards, but he smiles when others make a pure tone and keeps them. Szpilman exchanges looks with a pretty whore, who, like many in the area struggling to survive under dire conditions, makes eyes at him. Satisfied, the customer beams, nods his thanks to Szpilman, a pianist renowned before the war for his performances on Polish radio, who resumes his piano playing. \n\nSzpilman is walking through the streets of Warsaw's Jewish Ghetto, a place forcibly established by Nazi Germany during World War II to isolate Jewish residents. He passes emaciated children and beggars, victims of the severe rationing imposed by the occupying forces, and steps over the corpses lying on the sidewalk, a tragic and all-too-common sight. The wall runs the length of the street, dividing it in half and narrowing it, with buildings on one side and the wall on the other, a physical and symbolic barrier between the ghetto and the rest of the city. Szpilman walks along. \n\nA piercing whistle comes from the Aryan side, where non-Jewish residents live with relatively more freedom, causing Szpilman to stop. Two women appear from a doorway, approach the wall, and look up. Two or three packages, likely containing scarce goods like food or medicine, come flying over from the Aryan side, which the women grab and then disappear into the shadows. Szpilman walks on and sees a child appear through a hole at ground level, often used by smugglers risking their lives to bring essentials into the ghetto. The child wriggles through, then turns, pulls a package after him, and runs. As Szpilman walks on, he hears a noise and looks back to see a second child trying to wriggle through the same hole but is stuck. Angry German voices, representing the oppressive presence of Nazi soldiers patrolling the streets, come from the Aryan side. Szpilman goes to him, pulls him with all his might, but the boy is jammed in the hole. From the other side of the wall, the sound of an angry German voice and of a boot stamping violently on the boy is heard, and the boy screams in agony. Szpilman continues to try to pull the boy through. The sound of the German voice swearing and the dull, crunching noise made by the boot smashing into the boy continues, and with every thud, the boy screams in terrible pain. Szpilman struggles to help the boy whose screams are becoming weaker yet increasingly desperate. Szpilman pulls his arms and finally manages to get him through. The boy lies moaning, his head lolls, and his jaw sags; he is dead. Szpilman stands quickly and hurries away, his heart heavy with the tragedy of war.\n\nSzpilman approaches the house through a shabby yard, hearing the rhythmic noise of a mimeograph machine, a vital tool used to produce underground newspapers and resistance materials. A huge, cheerful man, Jehuda Zyskind, known for his boisterous laugh and a perpetual cigarette in his mouth, laughs and coughs, starts looking through papers. His room is piled from floor to ceiling with old papers and stuff, serving as a hub for clandestine activities, dark, shabby, and run-down under years of hardship. One of his sons, Symche, is operating the mimeograph machine while the other, Dolek, is sorting the sheets as they come off the roller, both helping in their small but significant way. Mrs. Zyskind, holding a toddler, is cooking at a small stove, a scene of warmth amidst the chaos. A distinctive knock on the door makes Szpilman tense, but Jehuda beams and gestures to one of his boys, saying \"Symche.\" The boy opens the door to admit a short, neat man, Majorek, a courier known for his reliability and discretion in these dangerous times."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The friend watches the customer intently as he drops the coins one by one onto the marble. He drops them puts his ear close and listens. Two or three coins he discards but he smiles when others make a pure tone and keeps them. Szpilman exchanges looks with a pretty whore who makes eyes at him. Satisfied the customer beams nods his thanks to Szpilman who resumes his piano playing. Szpilman is walking. He passes emaciated children and beggars and steps over the corpses lying on the sidewalk. The wall runs the length of the street dividing it in half and narrowing it with buildings on one side and the wall on the other. Szpilman walks along. A piercing whistle comes from the Aryan side causing Szpilman to stop. Two women appear from a doorway approach the wall and look up. Two or three packages come flying over from the Aryan side which the women grab and then disappear. Szpilman walks on and sees a child appear through a hole at ground level. The child wriggles through then turns pulls a package after him and runs. As Szpilman walks on he hears a noise and looks back to see a second child trying to wriggle through the same hole but is stuck. Angry German voices come from the Aryan side. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Szpilman goes to him pulls him with all his might but the boy is jammed in the hole. From the other side of the wall the sound of an angry German voice and of a boot stamping violently on the boy is heard and the boy screams in agony. Szpilman continues to try to pull the boy through. The sound of the German voice swearing and the dull crunching noise made by the boot smashing into the boy continues and with every thud the boy screams in terrible pain. Szpilman struggles to help the boy whose screams are becoming weaker yet increasingly desperate. Szpilman pulls his arms and finally manages to get him through. The boy lies moaning his head lolls and his jaw sags. he is dead. Szpilman stands quickly and hurries away. Szpilman approaches the house through a shabby yard hearing the noise of a mimeograph machine. A huge cheerful man with a perpetual cigarette in his mouth laughs and coughs starts looking through papers. His room is piled from floor to ceiling with old papers and stuff dark shabby and rundown. One of his sons Symche is operating the mimeograph machine while the other Dolek is sorting the sheets as they come off the roller. Mrs Zyskind holding a toddler is cooking at a small stove. A distinctive knock on the door makes Szpilman tense but Jehuda beams and gestures to one of his boys saying Symche. The boy opens the door to admit a short neat man. Majorek."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The friend watches the customer intently as he drops the coins one by one onto the marble. He drops them puts his ear close and listens. Two or three coins he discards but he smiles when others make a pure tone and keeps them. Szpilman exchanges looks with a pretty whore who makes eyes at him. Satisfied the customer beams nods his thanks to Szpilman who resumes his piano playing. Szpilman is walking. He passes emaciated children and beggars and steps over the corpses lying on the sidewalk. The wall runs the length of the street dividing it in half and narrowing it with buildings on one side and the wall on the other. Szpilman walks along. A piercing whistle comes from the Aryan side causing Szpilman to stop. Two women appear from a doorway approach the wall and look up. Two or three packages come flying over from the Aryan side which the women grab and then disappear. Szpilman walks on and sees a child appear through a hole at ground level. The child wriggles through then turns pulls a package after him and runs. As Szpilman walks on he hears a noise and looks back to see a second child trying to wriggle through the same hole but is stuck. Angry German voices come from the Aryan side. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. Szpilman goes to him pulls him with all his might but the boy is jammed in the hole. From the other side of the wall the sound of an angry German voice and of a boot stamping violently on the boy is heard and the boy screams in agony. Szpilman continues to try to pull the boy through. The sound of the German voice swearing and the dull crunching noise made by the boot smashing into the boy continues and with every thud the boy screams in terrible pain. Szpilman struggles to help the boy whose screams are becoming weaker yet increasingly desperate. Szpilman pulls his arms and finally manages to get him through. The boy lies moaning his head lolls and his jaw sags. he is dead. Szpilman stands quickly and hurries away. Szpilman approaches the house through a shabby yard hearing the noise of a mimeograph machine. A huge cheerful man with a perpetual cigarette in his mouth laughs and coughs starts looking through papers. His room is piled from floor to ceiling with old papers and stuff dark shabby and rundown. One of his sons Symche is operating the mimeograph machine while the other Dolek is sorting the sheets as they come off the roller. Mrs Zyskind holding a toddler is cooking at a small stove. A distinctive knock on the door makes Szpilman tense but Jehuda beams and gestures to one of his boys saying Symche. The boy opens the door to admit a short neat man. Majorek."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The friend watches the customer intently as he drops the coins one by one onto the marble. He drops them puts his ear close and listens. Two or three coins he discards but he smiles when others make a pure tone and keeps them. Szpilman exchanges looks with a pretty whore who makes eyes at him. Satisfied the customer beams nods his thanks to Szpilman who resumes his piano playing. Szpilman is walking. He passes emaciated children and beggars and steps over the corpses lying on the sidewalk. The wall runs the length of the street dividing it in half and narrowing it with buildings on one side and the wall on the other. Szpilman stands quickly and hurries away. Szpilman approaches the house through a shabby yard hearing the noise of a mimeograph machine. A huge cheerful man with a perpetual cigarette in his mouth laughs and coughs starts looking through papers. His room is piled from floor to ceiling with old papers and stuff dark shabby and rundown. One of his sons Symche is operating the mimeograph machine while the other Dolek is sorting the sheets as they come off the roller. Mrs Zyskind holding a toddler is cooking at a small stove. A distinctive knock on the door makes Szpilman tense but Jehuda beams and gestures to one of his boys saying Symche. The boy opens the door to admit a short neat man. Majorek."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The friend watches the customer intently as he drops the coins one by one onto the marble. He drops them puts his ear close and listens. Two or three coins he discards but he smiles when others make a pure tone and keeps them. Mrs Zyskind holding a toddler is cooking at a small stove. A distinctive knock on the door makes Szpilman tense but Jehuda beams and gestures to one of his boys saying Symche. The boy opens the door to admit a short neat man. Majorek."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The gardener observes the artist closely as she tosses the marbles one by one onto the countertop. She tosses them, leans her nose close, and sniffs. Several marbles she rejects, but she chuckles when others release a fragrant aroma and collects them. The detective exchanges glances with a clever painter, who flutters eyelashes at the detective. Pleased, the artist grins, winks thanks to the detective, who resumes her violin solo. The detective is jogging. She passes abandoned statues and tourists and skips over the plants scattered on the veranda. The fence stretches the width of the park, slicing it in two and narrowing it, with sculptures on one side and the fence on the other. The detective jogs along. A shrill siren comes from the Venice side, causing the detective to pause. Two men appear from an archway, approach the fence, and peer upward. Two or three balloons come floating over from the Venice side, which the men snatch and then retreat. The detective jogs onward and notices a dog emerge through a gap at knee height. The dog squirms through, then twists, tugs a backpack after it, and dashes off. As the detective jogs on, she hears a rustle and looks back to see a second dog attempting to squeeze through the same gap but is trapped. Annoyed Spanish voices come from the Venice side. The detective rushes to it, tugs it with all her effort, but the dog is lodged in the gap. From the other side of the fence, the sound of an annoyed Spanish voice and of a stick poking fiercely at the dog is heard, and the dog yelps in distress. The detective continues to try to tug the dog through. The sound of the Spanish voice exclaiming and the dull, thumping sound made by the stick pounding into the dog continues, and with every hit, the dog yelps in intense agony. The detective struggles to assist the dog whose yelps are fading yet increasingly frantic. The detective tugs its paws and finally succeeds in pulling it through. The dog lies whimpering, its eyes close, and its tongue lolls; it is unconscious. The detective stands abruptly and bolts away. The detective approaches the mansion through a tidy courtyard, hearing the sound of a typewriter. A petite, jovial woman with a constant lollipop in her mouth giggles and sneezes, begins flipping through notebooks. Her study is crammed from wall to wall with dusty books and gadgets, dim, cluttered, and neglected. One of her daughters, Nora, is operating the typewriter while the other, Elia, is arranging the pages as they emerge from the feeder. Mrs. Thompson, cradling a kitten, is stirring at a small fireplace. A peculiar rap on the window makes the detective tense, but Sophia grins and motions to one of her girls, saying \"Nora.\" The girl unlocks the window to let in a tall, elegant gentleman, Gregory."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The friend observes the customer as he drops coins onto the marble, listening for a pure tone. Szpilman exchanges glances with a woman but returns to piano playing once the customer nods in satisfaction. As Szpilman walks past emaciated children and beggars, he encounters a wall dividing the street. A whistle from the Aryan side stops him, followed by packages thrown over the wall, grabbed by women. A child wriggles through a hole, pulling a package, while another gets stuck. Szpilman tries to free him amidst angry German voices and violent stamping. Despite his efforts, the boy dies, and Szpilman hurries away. He reaches a house with a mimeograph machine, run by a cheerful man with sons, Symche, and Dolek, and his wife, Mrs. Zyskind, cooks nearby. When a distinctive knock makes Szpilman tense, Jehuda reassures him as Symche opens the door for Majorek."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Majorek The boy opens the door to admit a short neat man  A distinctive knock on the door makes Szpilman tense but Jehuda beams and gestures to one of his boys saying Symche  Mrs Zyskind holding a toddler is cooking at a small stove  One of his sons Symche is operating the mimeograph machine while the other Dolek is sorting the sheets as they come off the roller  His room is piled from floor to ceiling with old papers and stuff dark shabby and rundown  A huge cheerful man with a perpetual cigarette in his mouth laughs and coughs starts looking through papers  Szpilman approaches the house through a shabby yard hearing the noise of a mimeograph machine  Szpilman stands quickly and hurries away  he is dead  The boy lies moaning his head lolls and his jaw sags  Szpilman pulls his arms and finally manages to get him through  Szpilman struggles to help the boy whose screams are becoming weaker yet increasingly desperate  The sound of the German voice swearing and the dull crunching noise made by the boot smashing into the boy continues and with every thud the boy screams in terrible pain  Szpilman continues to try to pull the boy through  From the other side of the wall the sound of an angry German voice and of a boot stamping violently on the boy is heard and the boy screams in agony  Szpilman goes to him pulls him with all his might but the boy is jammed in the hole  Angry German voices come from the Aryan side  As Szpilman walks on he hears a noise and looks back to see a second child trying to wriggle through the same hole but is stuck  The child wriggles through then turns pulls a package after him and runs  Szpilman walks on and sees a child appear through a hole at ground level  Two or three packages come flying over from the Aryan side which the women grab and then disappear  Two women appear from a doorway approach the wall and look up  A piercing whistle comes from the Aryan side causing Szpilman to stop  Szpilman walks along  The wall runs the length of the street dividing it in half and narrowing it with buildings on one side and the wall on the other  He passes emaciated children and beggars and steps over the corpses lying on the sidewalk  Szpilman is walking  Satisfied the customer beams nods his thanks to Szpilman who resumes his piano playing  Szpilman exchanges looks with a pretty whore who makes eyes at him  Two or three coins he discards but he smiles when others make a pure tone and keeps them  He drops them puts his ear close and listens  The friend watches the customer intently as he drops the coins one by one onto the marble "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He drops them puts his ear close and listens The friend watches the customer intently as he drops the coins one by one onto the marble Szpilman exchanges looks with a pretty whore who makes eyes at him Two or three coins he discards but he smiles when others make a pure tone and keeps them Szpilman is walking Satisfied the customer beams nods his thanks to Szpilman who resumes his piano playing The wall runs the length of the street dividing it in half and narrowing it with buildings on one side and the wall on the other He passes emaciated children and beggars and steps over the corpses lying on the sidewalk A piercing whistle comes from the Aryan side causing Szpilman to stop Szpilman walks along Two or three packages come flying over from the Aryan side which the women grab and then disappear Two women appear from a doorway approach the wall and look up The child wriggles through then turns pulls a package after him and runs Szpilman walks on and sees a child appear through a hole at ground level Angry German voices come from the Aryan side As Szpilman walks on he hears a noise and looks back to see a second child trying to wriggle through the same hole but is stuck From the other side of the wall the sound of an angry German voice and of a boot stamping violently on the boy is heard and the boy screams in agony Szpilman goes to him pulls him with all his might but the boy is jammed in the hole The sound of the German voice swearing and the dull crunching noise made by the boot smashing into the boy continues and with every thud the boy screams in terrible pain Szpilman continues to try to pull the boy through Szpilman pulls his arms and finally manages to get him through Szpilman struggles to help the boy whose screams are becoming weaker yet increasingly desperate he is dead The boy lies moaning his head lolls and his jaw sags Szpilman approaches the house through a shabby yard hearing the noise of a mimeograph machine Szpilman stands quickly and hurries away His room is piled from floor to ceiling with old papers and stuff dark shabby and rundown A huge cheerful man with a perpetual cigarette in his mouth laughs and coughs starts looking through papers Mrs Zyskind holding a toddler is cooking at a small stove One of his sons Symche is operating the mimeograph machine while the other Dolek is sorting the sheets as they come off the roller The boy opens the door to admit a short neat man A distinctive knock on the door makes Szpilman tense but Jehuda beams and gestures to one of his boys saying Symche Majorek"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "From the other side of the wall the sound of an angry German voice and of a boot stamping violently on the boy is heard and the boy screams in agony  Szpilman continues to try to pull the boy through  The sound of the German voice swearing and the dull crunching noise made by the boot smashing into the boy continues and with every thud the boy screams in terrible pain  Szpilman struggles to help the boy whose screams are becoming weaker yet increasingly desperate  Szpilman pulls his arms and finally manages to get him through  The boy lies moaning his head lolls and his jaw sags  he is dead  Szpilman stands quickly and hurries away  Szpilman approaches the house through a shabby yard hearing the noise of a mimeograph machine  A huge cheerful man with a perpetual cigarette in his mouth laughs and coughs starts looking through papers  His room is piled from floor to ceiling with old papers and stuff dark shabby and rundown  One of his sons Symche is operating the mimeograph machine while the other Dolek is sorting the sheets as they come off the roller  Mrs Zyskind holding a toddler is cooking at a small stove  A distinctive knock on the door makes Szpilman tense but Jehuda beams and gestures to one of his boys saying Symche  The boy opens the door to admit a short neat man  Majorek The friend watches the customer intently as he drops the coins one by one onto the marble  He drops them puts his ear close and listens  Two or three coins he discards but he smiles when others make a pure tone and keeps them  Szpilman exchanges looks with a pretty whore who makes eyes at him  Satisfied the customer beams nods his thanks to Szpilman who resumes his piano playing  Szpilman is walking  He passes emaciated children and beggars and steps over the corpses lying on the sidewalk  The wall runs the length of the street dividing it in half and narrowing it with buildings on one side and the wall on the other  Szpilman walks along  A piercing whistle comes from the Aryan side causing Szpilman to stop  Two women appear from a doorway approach the wall and look up  Two or three packages come flying over from the Aryan side which the women grab and then disappear  Szpilman walks on and sees a child appear through a hole at ground level  The child wriggles through then turns pulls a package after him and runs  As Szpilman walks on he hears a noise and looks back to see a second child trying to wriggle through the same hole but is stuck  Angry German voices come from the Aryan side  Szpilman goes to him pulls him with all his might but the boy is jammed in the hole "
        }
      ]
    }
  ]
}