{
  "ground_truth": "He stops, seeing Szpilman, and Szpilman shrugs. Jehuda loves this too, but his laugh makes him cough appallingly. The family sits around the small table as Mother comes with a saucepan of soup and starts to serve. He laughs, and the others look at him. The family rushes to the windows as a Gestapo vehicle enters the street and screeches to a halt. Helmeted, jackbooted SS men, led by an NCO, pour out of the vehicle. The Szpilmans gather at their open window to watch, and Regina turns off the lights before joining them; they are all terrified. From the POV of the Szpilman apartment, they see the building opposite. The SS men are pouring into the building opposite, and the sound of jackboots on stairs is heard. Lights go on floor by floor. In an apartment directly opposite, a businessman, his wife, three young people, and an old man in a wheelchair sit at their dining table. The SS men burst in, machine pistols at the ready. The family is frozen with horror and remains seated as the NCO scans their faces. The family rises to their feet fast, except for the old man in the wheelchair. The NCO bears down on him, and the old man in the wheelchair grips the arms of the chair, trying desperately to stand, but he can't. Without warning, the SS men seize the chair with the old man in it, carry him out onto the balcony. Mother screams, Father shrinks back, Halina comforts him, and Regina comforts Mother. From Szpilman's and Henryk's POV, they see the apartment opposite where the SS men throw the old man in his wheelchair over the balcony. He seems to hang in the air for a second, then drops out of the chair and out of sight, followed by a terrible thud as his body hits the pavement and a clatter as the wheelchair follows him. Mother is sobbing, and the others are still horrified. Then, there's the sound of shots, slamming doors, screams, and shouts. From their POV, from a second window, they see the building opposite and the street where the SS men are herding a couple of dozen prisoners from the building opposite. People are watching from the windows but trying not to be seen. The headlights of the SS vehicle are switched on, and the SS men are forcing their prisoners to stand in the beam. The prisoners start to run, and the SS men open fire with a machine gun mounted on the vehicle. People in the building opposite begin to scream. The prisoners are being shot down, lifted into the air by the bullets, turning somersaults, and falling dead. One man escapes by running back in the opposite direction, out of the beam of light, and is lost to sight for a moment. The escaping man, a silhouette out of the light, runs with all his strength, putting distance between himself and the SS.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He pauses, observing Szpilman, and Szpilman shrugs. Jehuda adores this too, but his chuckle causes him to cough dreadfully. The family gathers around the little table as Mother arrives with a pot of broth and begins to serve. He chuckles, and the others glance at him. The family dashes to the windows as a Gestapo automobile enters the road and screeches to a stop. Helmeted, jackbooted SS soldiers, led by an NCO, spill out of the automobile. The Szpilmans collect at their open window to observe, and Regina switches off the lights before joining them; they are all frightened. From the POV of the Szpilman apartment, they observe the structure opposite. The SS soldiers are streaming into the structure opposite, and the noise of jackboots on stairs is heard. Lights illuminate level by level. In an apartment directly opposite, a businessman, his spouse, three young individuals, and an elderly man in a wheelchair sit at their dining table. The SS soldiers burst in, submachine pistols at the ready. The family is immobilized with terror and remains seated as the NCO scans their faces. The family rises to their feet swiftly, except for the elderly man in the wheelchair. The NCO moves toward him, and the elderly man in the wheelchair grips the arms of the chair, attempting desperately to stand, but he can't. Without forewarning, the SS soldiers seize the chair with the elderly man in it, carry him out onto the balcony. Mother shrieks, Father recoils, Halina reassures him, and Regina reassures Mother. From Szpilman's and Henryk's POV, they observe the apartment opposite where the SS soldiers hurl the elderly man in his wheelchair over the balcony. He seems to suspend in the air for a moment, then plummets out of the chair and out of sight, followed by a dreadful thud as his body impacts the sidewalk and a clatter as the wheelchair follows him. Mother is weeping, and the others are still shocked. Then, there's the noise of gunshots, slamming doors, shrieks, and yells. From their POV, from a second window, they observe the structure opposite and the road where the SS soldiers are herding a couple of dozen captives from the structure opposite. People are observing from the windows but attempting not to be seen. The headlights of the SS automobile are turned on, and the SS soldiers are compelling their captives to stand in the beam. The captives start to flee, and the SS soldiers open fire with a submachine gun mounted on the automobile. People in the structure opposite begin to shriek. The captives are being shot down, lifted into the air by the projectiles, turning somersaults, and collapsing lifeless. One man escapes by fleeing back in the opposite direction, out of the beam of light, and is lost to sight for an instant. The fleeing man, a silhouette out of the light, runs with all his might, putting distance between himself and the SS."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He stops, seeing Szpilman, and Szpilman shrugs. This too is loved by Jehuda, but appalling coughs are caused by his laugh. The small table is sat around by the family as a saucepan of soup is brought by Mother, who starts to serve. He laughs, and he is looked at by the others. The windows are rushed to by the family as the street is entered by a Gestapo vehicle, which screeches to a halt. Helmeted, jackbooted SS men are led by an NCO out of the vehicle. At their open window, the Szpilmans gather to watch, and the lights are turned off by Regina before joining them; terror grips them all. From the Szpilman apartment's POV, the building opposite is seen by them. The building opposite is entered by the SS men, and jackboots on stairs are heard. Floor by floor, lights go on. In an apartment directly opposite, a businessman, his wife, three young people, and an old man in a wheelchair are sitting at their dining table. Into the room burst the SS men, pistols ready for action. The family is frozen with horror, and they remain seated as their faces are scanned by the NCO. To their feet, the family rises quickly, except for the old man in the wheelchair. On him, the NCO bears down, and the arms of the chair are gripped by the old man in the wheelchair as he tries desperately to stand, but he can't. Without warning, the chair with the old man in it is seized by the SS men, who carry him out onto the balcony. A scream is let out by Mother, Father shrinks back, Halina is comforting him, and comfort is given to Mother by Regina. From Szpilman's and Henryk's POV, the apartment opposite is seen where the balcony is used by the SS men to throw the old man in his wheelchair over. For a second, he seems to hang in the air, then he drops out of the chair and out of sight, followed by a terrible thud as the pavement is hit by his body and a clatter as the wheelchair follows him. Mother sobs, and horror still grips the others. Then, shots, slamming doors, screams, and shouts are heard. From their POV, from a second window, they see the building opposite and the street where a couple of dozen prisoners are herded by the SS men from the building opposite. From the windows, people watch but try not to be seen. The headlights of the SS vehicle are switched on by someone, and in the beam, the prisoners are forced to stand by the SS men. A run is started by the prisoners, and a machine gun mounted on the vehicle is used by the SS men to open fire. Screams begin in the building opposite. Down are shot the prisoners, lifted into the air by bullets, somersaulting, and falling dead. A man escapes by running back in the opposite direction, out of the beam of light, and is lost to sight for a moment. With all his strength, the escaping man runs as a silhouette out of the light, putting distance between himself and the SS."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He stops, seeing Szpilman, who shrugs. Jehuda loves this too, but his laugh triggers a severe cough. The family gathers around the small table as Mother serves soup. They rush to the windows as a Gestapo vehicle screeches to a halt. Helmeted SS men, led by an NCO, exit the vehicle. The Szpilmans watch from their window, terrified, as Regina turns off the lights. The SS men enter the building opposite, and jackboots echo on the stairs. Lights illuminate floor by floor. In an apartment opposite, a businessman, his wife, three young people, and an old man in a wheelchair sit at their dining table. The SS men burst in, machine pistols ready. The family, horrified, remains seated as the NCO scans their faces. They quickly stand, except for the old man. The NCO approaches him, and the old man struggles to stand but can't. Suddenly, the SS men carry him in his wheelchair to the balcony. Mother screams, Father recoils, Halina comforts him, and Regina comforts Mother. From Szpilman's and Henryk's view, they see the SS men throw the old man over the balcony. He hangs in the air momentarily, then falls, followed by a thud and the clatter of the wheelchair. Mother sobs, and the others are horrified. Shots, slamming doors, screams, and shouts follow. From another window, they see the SS herding prisoners from the building opposite. People watch from windows, trying not to be seen. The SS vehicle's headlights illuminate the prisoners, who start to run as the SS open fire with a machine gun. Screams erupt as prisoners are shot, lifted by bullets, and fall dead. One man escapes, running out of the light and disappearing momentarily, silhouetted as he distances himself from the SS."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Szpilman stops and shrugs at Jehuda, whose laugh turns into a severe cough. The family sits at a small table as Mother serves soup. They rush to the windows as a Gestapo vehicle arrives, and SS men, led by an NCO, exit. The Szpilmans watch from their window, terrified, as Regina turns off the lights. The SS men enter the building opposite, and lights turn on floor by floor. A businessman, his wife, three young people, and an old man in a wheelchair sit at their dining table. The SS burst in, and the family freezes in horror. They stand quickly, except the old man, who struggles to rise. The SS carry him in his wheelchair to the balcony and throw him over. He falls, followed by a thud and the wheelchair's clatter. Mother sobs, and the others are horrified. Shots, slamming doors, screams, and shouts follow. The SS herd prisoners into the street, forcing them into the vehicle's headlights. As prisoners run, the SS open fire, shooting them down. One man escapes, running out of the light and away from the SS."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He comes to a halt, noticing Szpilman, and Szpilman responds with a nonchalant shrug. Jehuda, who also finds this amusing, begins to laugh, but his laughter quickly turns into a dreadful coughing fit. The family is gathered around the small, modest table as Mother arrives with a saucepan filled with steaming soup and begins to serve it to everyone. Jehuda continues to laugh, drawing the attention of the others, who look at him with concern. Suddenly, the family rushes to the windows in alarm as a Gestapo vehicle enters the street with a screeching halt. Helmeted and wearing jackboots, the SS men, led by a stern-looking NCO, pour out of the vehicle with urgency. The Szpilman family gathers at their open window to watch the scene unfold, and Regina quickly turns off the lights before joining them; they are all gripped by a palpable sense of terror. From the vantage point of the Szpilman apartment, they have a clear view of the building directly opposite. The SS men are seen pouring into the building across the street, and the ominous sound of jackboots stomping on the stairs echoes through the air. Lights begin to flicker on, floor by floor, as the SS men make their way up. In an apartment directly across from them, a businessman, his wife, three young people, and an elderly man in a wheelchair are seated at their dining table. The SS men burst into the room, their machine pistols at the ready, and the family is paralyzed with horror, remaining seated as the NCO scrutinizes their faces. The family quickly rises to their feet, all except for the old man in the wheelchair. The NCO advances toward him, and the elderly man grips the arms of his chair, desperately trying to stand, but he is unable to do so. Without any warning, the SS men seize the wheelchair with the old man still in it and carry him out onto the balcony. Mother lets out a scream, Father recoils in fear, Halina tries to comfort him, and Regina attempts to console Mother. From the perspective of Szpilman and Henryk, they witness the horrifying scene in the apartment opposite, where the SS men throw the old man in his wheelchair over the balcony. For a brief moment, he seems to hang suspended in the air before plummeting out of the chair and disappearing from view, followed by a sickening thud as his body hits the pavement and a clatter as the wheelchair follows. Mother is sobbing uncontrollably, and the others remain frozen in horror. Then, the air is filled with the sound of gunshots, slamming doors, screams, and shouts. From their vantage point, through a second window, they see the building opposite and the street below, where the SS men are herding a couple of dozen prisoners from the building. People are watching from their windows, trying to remain unseen. The headlights of the SS vehicle are switched on, casting a harsh beam of light, and the SS men force their prisoners to stand within it. As the prisoners begin to run, the SS men open fire with a machine gun mounted on the vehicle. Screams erupt from the building opposite as the prisoners are shot down, their bodies lifted into the air by the bullets, turning somersaults, and falling lifeless to the ground. One man manages to escape by running back in the opposite direction, out of the beam of light, and disappears from sight for a moment. The escaping man, now a silhouette against the darkness, runs with all his strength, putting as much distance as possible between himself and the SS."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He comes to a stop, having noticed Szpilman, and Szpilman, in turn, replies with a calm and nonchalant shrug of his shoulders. Jehuda, who finds the scene equally amusing, begins to chuckle heartily, but his laughter abruptly transforms into a dreadful coughing fit, which seems to grip his entire body. The family is gathered closely around the small, modest table as Mother enters the room carrying a steaming saucepan filled with hot soup. She proceeds to serve spoonfuls to everyone, ensuring each family member receives a portion. Jehuda continues to laugh, drawing the attention of the others present, who gaze at him with evident concern. Suddenly, a wave of panic washes over the family as they rush to the windows, alarmed by the screeching halt of a Gestapo vehicle entering the street below. Helmeted and wearing imposing jackboots, the SS men, led by a stern-looking non-commissioned officer, urgently pour out of the vehicle. The Szpilman family gathers at their open window, compelled to witness the unfolding scene, while Regina, acting quickly, turns off the lights before joining them; they are all engulfed by a palpable sense of terror that grips the room. From the vantage point of the Szpilman apartment, they have a clear and unobstructed view of the building directly opposite. The SS men are seen flooding into the building across the street, and the ominous sound of jackboots stomping on the stairs echoes through the air, amplifying the tension. Lights begin to flicker on, floor by floor, as the SS men make their way upward. Within an apartment directly across from them, a businessman, his wife, three young individuals, and an elderly man in a wheelchair are seated at their dining table. The SS men burst into the room with aggressive energy, wielding their machine pistols ready for action, and the family is frozen in sheer horror, remaining seated as the stern-faced NCO scrutinizes each of their faces. The family swiftly rises to stand, all except for the frail old man confined to his wheelchair. The NCO advances toward him menacingly, and the elderly man grips the arms of his chair in a desperate attempt to stand, but it's clear he is unable to do so. Without any warning or hesitation, the SS men seize the wheelchair with the old man still seated in it and carry him out onto the balcony. Mother lets out a piercing scream, Father recoils in terror, Halina does her best to comfort him, and Regina attempts to console a distraught Mother. From where Szpilman and Henryk are positioned, they witness the horrifying events in the apartment opposite, as the SS men coldly throw the old man, still in his wheelchair, over the balcony railing. For a brief, agonizing moment, the elderly man seems to hang suspended in the air before plummeting out of his chair and disappearing from view, followed by a sickening thud as his body meets the pavement, and a clatter as the wheelchair follows suit. Mother is racked with uncontrollable sobbing, and the others remain frozen in a state of shock and horror. Then, the air is suddenly filled with the deafening sound of gunshots, slamming doors, screams, and frantic shouts. From their vantage point, through a second window, they see the building opposite as well as the street below, where the SS men are herding a group of approximately two dozen prisoners out from the building. Onlookers, trying their best to remain unseen, watch from their windows. The headlights of the SS vehicle are switched on, casting a harsh and unflinching beam of light, and the SS men forcefully direct their prisoners to stand within it. As the prisoners begin to run in an attempt to escape, the SS men open fire with a machine gun mounted on the vehicle. Screams echo from the building opposite as the prisoners are shot, their bodies lifted into the air by the bullets, somersaulting, and collapsing lifelessly to the ground. Remarkably, one man manages to flee by sprinting back in the opposite direction, away from the beam of light, and disappears momentarily from sight. The escaping man, now a dark silhouette against the night, runs with all the energy he can muster, putting as much distance as possible between himself and the relentless SS."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He halts abruptly, his gaze landing on Szpilman, who responds with a nonchalant shrug. Jehuda, who shares in the amusement, lets out a laugh that quickly turns into a harsh, uncontrollable cough. The family gathers closely around the small table, their attention shifting as Mother approaches, carefully balancing a saucepan filled with soup. She begins to ladle the soup into bowls, her movements deliberate and nurturing. Jehuda's laughter draws the attention of the others, who momentarily pause to look at him. Suddenly, the atmosphere shifts as the family collectively rushes to the windows, their curiosity piqued by the sound of a Gestapo vehicle entering the street with a screeching halt. Helmeted, jackbooted SS men, led by a stern NCO, swiftly exit the vehicle, their presence imposing and intimidating. The Szpilman family congregates at their open window, peering out with a mix of fear and fascination, while Regina, in a moment of caution, turns off the lights before joining them, her face etched with terror. From their vantage point in the Szpilman apartment, they observe the building opposite, where the SS men are seen pouring inside, their heavy jackboots echoing ominously on the stairs. Lights flicker on, illuminating each floor in succession. Directly across from them, in an apartment, a businessman, his wife, three young people, and an old man in a wheelchair sit tensely at their dining table. The SS men burst into the room, their machine pistols poised and ready, causing the family to freeze in horror, their expressions locked in fear as the NCO scrutinizes their faces. In a sudden, synchronized motion, the family rises to their feet, all except for the old man, who remains seated in his wheelchair. The NCO advances toward him, and the old man desperately grips the arms of his chair, straining to stand but unable to do so. Without warning, the SS men seize the wheelchair, lifting it with the old man still in it, and carry him out onto the balcony. In the Szpilman apartment, Mother lets out a scream, Father recoils in shock, Halina moves to comfort him, and Regina wraps her arms around Mother, offering solace. From Szpilman's and Henryk's perspective, they witness the harrowing scene as the SS men unceremoniously hurl the old man in his wheelchair over the balcony. For a brief, heart-stopping moment, he seems to hang suspended in the air before plummeting out of the chair and disappearing from view, followed by a sickening thud as his body hits the pavement and the clatter of the wheelchair landing after him. Mother is overcome with sobs, while the rest of the family remains paralyzed by horror. The air is suddenly filled with the sound of gunshots, slamming doors, and the chilling cries and shouts of those in distress. From their vantage point, through a second window, they observe the building opposite and the street below, where the SS men are herding a group of prisoners from the building. People watch from their windows, trying to remain unseen, as the headlights of the SS vehicle blaze to life, casting an unforgiving beam of light on the prisoners. Under the harsh illumination, the prisoners are forced to run, and the SS men unleash a barrage of gunfire from a machine gun mounted on the vehicle. The air is filled with screams as the prisoners are struck down, their bodies lifted and twisted by the bullets before falling lifeless to the ground. Amidst the chaos, one man manages to escape, sprinting back in the opposite direction, away from the beam of light, and momentarily disappearing from sight. As a silhouette against the darkness, he runs with every ounce of strength, determined to put as much distance as possible between himself and the SS."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Jehuda's laughter turns into a severe cough as the family gathers around the small table, where Mother serves soup. Their attention shifts abruptly when a Gestapo vehicle screeches to a halt outside, and helmeted SS men, led by an NCO, pour out. The Szpilmans, terrified, gather at the window, with Regina turning off the lights before joining them. From their vantage point, they watch as the SS men enter the building opposite, their jackboots echoing on the stairs as lights illuminate each floor. In the apartment directly across, a businessman, his wife, three young people, and an old man in a wheelchair sit frozen with horror as the SS men burst in. The family rises quickly, except for the old man, who struggles unsuccessfully to stand. The SS men seize his wheelchair, carry him to the balcony, and throw him over. The Szpilmans watch in horror as he falls, followed by the wheelchair, with a terrible thud marking his impact. Mother sobs while the others remain shocked. Gunshots, slamming doors, and screams fill the air as the SS men herd prisoners into the street, forcing them into the vehicle's headlights. As the prisoners attempt to flee, the SS open fire with a mounted machine gun, causing chaos and death. Amidst the turmoil, one man manages to escape, running with all his strength out of the light and away from the SS."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He stops, seeing Szpilman, a renowned Polish pianist who had been a member of the Polish Radio Orchestra, and Szpilman shrugs. Jehuda, who is known for his infectious sense of humor, loves this too, but his laugh makes him cough appallingly due to a longstanding lung condition. The family sits around the small table as Mother comes with a saucepan of soup, a simple meal in these times of rationing and scarcity, and starts to serve. He laughs, and the others look at him. The family rushes to the windows as a Gestapo vehicle, part of the Nazi secret police known for their brutal enforcement of Nazi policies, enters the street and screeches to a halt. Helmeted, jackbooted SS men, an elite corps of the Third Reich, led by an NCO, pour out of the vehicle. The Szpilmans gather at their open window to watch, and Regina, who is particularly cautious, turns off the lights before joining them; they are all terrified. From the POV of the Szpilman apartment, they see the building opposite. The SS men are pouring into the building opposite, and the sound of jackboots on stairs is heard echoing ominously in the quiet night. Lights go on floor by floor, signaling the unfolding terror. In an apartment directly opposite, a businessman, his wife, three young people, and an old man in a wheelchair sit at their dining table, a scene of domestic peace about to be shattered. The SS men burst in, machine pistols at the ready, weapons that are symbols of oppressive power. The family is frozen with horror and remains seated as the NCO scans their faces, searching for any sign of resistance. The family rises to their feet fast, except for the old man in the wheelchair. The NCO bears down on him, and the old man in the wheelchair grips the arms of the chair, trying desperately to stand, but he can't. Without warning, the SS men seize the chair with the old man in it, carry him out onto the balcony in a chilling demonstration of their cruelty. Mother screams, Father shrinks back, Halina comforts him, and Regina comforts Mother. From Szpilman's and Henryk's POV, they see the apartment opposite where the SS men throw the old man in his wheelchair over the balcony, a horrifying act of inhumanity. He seems to hang in the air for a second, then drops out of the chair and out of sight, followed by a terrible thud as his body hits the pavement and a clatter as the wheelchair follows him. Mother is sobbing, and the others are still horrified. Then, there's the sound of shots, slamming doors, screams, and shouts, all hallmarks of the violent SS raids. From their POV, from a second window, they see the building opposite and the street where the SS men are herding a couple of dozen prisoners from the building opposite, a scene common in the Jewish ghettos of occupied Poland. People are watching from the windows but trying not to be seen to avoid attracting attention. The headlights of the SS vehicle are switched on, and the SS men are forcing their prisoners to stand in the beam, a tactic used to disorient and intimidate. The prisoners start to run, and the SS men open fire with a machine gun mounted on the vehicle, adding to the chaos and terror. People in the building opposite begin to scream, their cries piercing the night. The prisoners are being shot down, lifted into the air by the bullets, turning somersaults, and falling dead, a grisly spectacle of human tragedy. One man escapes by running back in the opposite direction, out of the beam of light, and is lost to sight for a moment. The escaping man, a silhouette out of the light, runs with all his strength, putting distance between himself and the SS, a fleeting glimmer of hope amidst despair."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He stops seeing Szpilman and Szpilman shrugs. Jehuda loves this too but his laugh makes him cough appallingly. The family sits around the small table as Mother comes with a saucepan of soup and starts to serve. He laughs and the others look at him. The family rushes to the windows as a Gestapo vehicle enters the street and screeches to a halt. Helmeted jackbooted SS men led by an NCO pour out of the vehicle. The Szpilmans gather at their open window to watch and Regina turns off the lights before joining them. they are all terrified. From the POV of the Szpilman apartment they see the building opposite. The SS men are pouring into the building opposite and the sound of jackboots on stairs is heard. Lights go on floor by floor. In an apartment directly opposite a businessman his wife three young people and an old man in a wheelchair sit at their dining table. The SS men burst in machine pistols at the ready. The family is frozen with horror and remains seated as the NCO scans their faces. The family rises to their feet fast except for the old man in the wheelchair. The NCO bears down on him and the old man in the wheelchair grips the arms of the chair trying desperately to stand but he cannot. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Without warning the SS men seize the chair with the old man in it carry him out onto the balcony. Mother screams. Father shrinks back. Halina comforts him and Regina comforts Mother. From Szpilman's and Henryk's POV they see the apartment opposite where the SS men throw the old man in his wheelchair over the balcony. He seems to hang in the air for a second then drops out of the chair and out of sight followed by a terrible thud as his body hits the pavement and a clatter as the wheelchair follows him. Mother is sobbing and the others are still horrified. Then there is the sound of shots slamming doors screams and shouts. From their POV from a second window they see the building opposite and the street where the SS men are herding a couple of dozen prisoners from the building opposite. People are watching from the windows but trying not to be seen. The headlights of the SS vehicle are switched on and the SS men are forcing their prisoners to stand in the beam. The prisoners start to run and the SS men open fire with a machine gun mounted on the vehicle. People in the building opposite begin to scream. The prisoners are being shot down lifted into the air by the bullets turning somersaults and falling dead. One man escapes by running back in the opposite direction out of the beam of light and is lost to sight for a moment. The escaping man a silhouette out of the light runs with all his strength putting distance between himself and the SS."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He stops seeing Szpilman and Szpilman shrugs. Jehuda loves this too but his laugh makes him cough appallingly. The family sits around the small table as Mother comes with a saucepan of soup and starts to serve. He laughs and the others look at him. The family rushes to the windows as a Gestapo vehicle enters the street and screeches to a halt. Helmeted jackbooted SS men led by an NCO pour out of the vehicle. The Szpilmans gather at their open window to watch and Regina turns off the lights before joining them. they are all terrified. From the POV of the Szpilman apartment they see the building opposite. The SS men are pouring into the building opposite and the sound of jackboots on stairs is heard. Lights go on floor by floor. In an apartment directly opposite a businessman his wife three young people and an old man in a wheelchair sit at their dining table. The SS men burst in machine pistols at the ready. The family is frozen with horror and remains seated as the NCO scans their faces. The family rises to their feet fast except for the old man in the wheelchair. The NCO bears down on him and the old man in the wheelchair grips the arms of the chair trying desperately to stand but he cannot. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Without warning the SS men seize the chair with the old man in it carry him out onto the balcony. Mother screams. Father shrinks back. Halina comforts him and Regina comforts Mother. From Szpilman's and Henryk's POV they see the apartment opposite where the SS men throw the old man in his wheelchair over the balcony. He seems to hang in the air for a second then drops out of the chair and out of sight followed by a terrible thud as his body hits the pavement and a clatter as the wheelchair follows him. Mother is sobbing and the others are still horrified. Then there is the sound of shots slamming doors screams and shouts. From their POV from a second window they see the building opposite and the street where the SS men are herding a couple of dozen prisoners from the building opposite. People are watching from the windows but trying not to be seen. The headlights of the SS vehicle are switched on and the SS men are forcing their prisoners to stand in the beam. The prisoners start to run and the SS men open fire with a machine gun mounted on the vehicle. People in the building opposite begin to scream. The prisoners are being shot down lifted into the air by the bullets turning somersaults and falling dead. One man escapes by running back in the opposite direction out of the beam of light and is lost to sight for a moment. The escaping man a silhouette out of the light runs with all his strength putting distance between himself and the SS."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He stops seeing Szpilman and Szpilman shrugs. Jehuda loves this too but his laugh makes him cough appallingly. The family sits around the small table as Mother comes with a saucepan of soup and starts to serve. He laughs and the others look at him. The family rushes to the windows as a Gestapo vehicle enters the street and screeches to a halt. Helmeted jackbooted SS men led by an NCO pour out of the vehicle. The Szpilmans gather at their open window to watch and Regina turns off the lights before joining them. they are all terrified. From their POV from a second window they see the building opposite and the street where the SS men are herding a couple of dozen prisoners from the building opposite. People are watching from the windows but trying not to be seen. The headlights of the SS vehicle are switched on and the SS men are forcing their prisoners to stand in the beam. The prisoners start to run and the SS men open fire with a machine gun mounted on the vehicle. People in the building opposite begin to scream. The prisoners are being shot down lifted into the air by the bullets turning somersaults and falling dead. One man escapes by running back in the opposite direction out of the beam of light and is lost to sight for a moment. The escaping man a silhouette out of the light runs with all his strength putting distance between himself and the SS."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He stops seeing Szpilman and Szpilman shrugs. Jehuda loves this too but his laugh makes him cough appallingly. The family sits around the small table as Mother comes with a saucepan of soup and starts to serve. He laughs and the others look at him. The prisoners are being shot down lifted into the air by the bullets turning somersaults and falling dead. One man escapes by running back in the opposite direction out of the beam of light and is lost to sight for a moment. The escaping man a silhouette out of the light runs with all his strength putting distance between himself and the SS."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "He pauses, noticing Finkelstein, and Finkelstein shrugs. Mordecai enjoys this as well, but his giggle causes him to sneeze hilariously. The group lounges around the wide bench as Auntie arrives with a pitcher of tea and begins to pour. He giggles, and the others glance at him. The clan dashes to the doorways as a military truck rolls into the lane and grinds to a stop. Armored, boot-wearing law enforcers, led by a sergeant, spill out of the truck. The Finkelsteins cluster at their ajar doorway to observe, and Clara dims the lamps before joining them; they all feel anxious. From the vantage point of the Finkelstein patio, they notice the structure across the lane. The enforcers are storming into the structure across the lane, and the echo of footsteps on metal is perceived. Lamps ignite level by level. In a flat directly across, a merchant, his spouse, three juveniles, and an elderly gentleman in a rocking chair sit at their kitchen counter. The enforcers barge in, rifles at the ready. The group is paralyzed with fright and stays seated as the sergeant inspects their expressions. The group stands up quickly, except for the elderly gentleman in the rocking chair. The sergeant advances towards him, and the elderly gentleman in the rocking chair clutches the handles of the chair, trying nervously to rise, but he can't. Abruptly, the enforcers grab the chair with the elderly gentleman in it, drag him out onto the terrace. Auntie shouts, Uncle retreats, Lina reassures him, and Clara reassures Auntie. From Finkelstein's and Simon's vantage point, they observe the flat across where the enforcers shove the elderly gentleman in his rocking chair over the terrace. He appears to float in the air momentarily, then plunges out of the chair and out of sight, followed by a dreadful crash as his body meets the ground and a clang as the rocking chair follows him. Auntie is wailing, and the others remain aghast. Then, there's the noise of gunfire, banging doors, yells, and cries. From their vantage point, from a second doorway, they witness the structure across and the lane where the enforcers are corralling a couple of dozen captives from the structure across. Observers are peering from the doorways but attempting not to be noticed. The headlights of the military truck flick on, and the enforcers are compelling their captives to stand in the glare. The captives begin to sprint, and the enforcers commence shooting with a rifle mounted on the truck. Individuals in the structure across start to yell. The captives are being gunned down, propelled into the air by the rounds, flipping backward, and collapsing lifeless. One individual escapes by dashing back in the opposite route, out of the glare of light, and vanishes from view for a moment. The fleeing individual, a shadow out of the light, bolts with all his energy, creating distance between himself and the law enforcers."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Szpilman and his family are seated around a small table when a Gestapo vehicle arrives, filling them with fear. Helmeted SS men enter a building across from them, and lights flicker on as they ascend. Inside, a family, including an old man in a wheelchair, sits terrified. The SS burst in, and forcefully drag the old man onto the balcony, throwing him over to his death. The Szpilmans helplessly watch, horrified, as his body falls. Mother sobs uncontrollably. The SS then herd prisoners into the street and force them into the vehicle's headlights. As prisoners attempt to flee, they are gunned down, bodies flung by bullets. Amidst screams and chaos, one man narrowly escapes, vanishing into the darkness."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The escaping man a silhouette out of the light runs with all his strength putting distance between himself and the SS One man escapes by running back in the opposite direction out of the beam of light and is lost to sight for a moment  The prisoners are being shot down lifted into the air by the bullets turning somersaults and falling dead  People in the building opposite begin to scream  The prisoners start to run and the SS men open fire with a machine gun mounted on the vehicle  The headlights of the SS vehicle are switched on and the SS men are forcing their prisoners to stand in the beam  People are watching from the windows but trying not to be seen  From their POV from a second window they see the building opposite and the street where the SS men are herding a couple of dozen prisoners from the building opposite  Then there's the sound of shots slamming doors screams and shouts  Mother is sobbing and the others are still horrified  He seems to hang in the air for a second then drops out of the chair and out of sight followed by a terrible thud as his body hits the pavement and a clatter as the wheelchair follows him  From Szpilman's and Henryk's POV they see the apartment opposite where the SS men throw the old man in his wheelchair over the balcony  Halina comforts him and Regina comforts Mother  Father shrinks back  Mother screams  Without warning the SS men seize the chair with the old man in it carry him out onto the balcony  The NCO bears down on him and the old man in the wheelchair grips the arms of the chair trying desperately to stand but he can't  The family rises to their feet fast except for the old man in the wheelchair  The family is frozen with horror and remains seated as the NCO scans their faces  The SS men burst in machine pistols at the ready  In an apartment directly opposite a businessman his wife three young people and an old man in a wheelchair sit at their dining table  Lights go on floor by floor  The SS men are pouring into the building opposite and the sound of jackboots on stairs is heard  From the POV of the Szpilman apartment they see the building opposite  they are all terrified  The Szpilmans gather at their open window to watch and Regina turns off the lights before joining them  Helmeted jackbooted SS men led by an NCO pour out of the vehicle  The family rushes to the windows as a Gestapo vehicle enters the street and screeches to a halt  He laughs and the others look at him  The family sits around the small table as Mother comes with a saucepan of soup and starts to serve  Jehuda loves this too but his laugh makes him cough appallingly  He stops seeing Szpilman and Szpilman shrugs "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Jehuda loves this too but his laugh makes him cough appallingly He stops seeing Szpilman and Szpilman shrugs He laughs and the others look at him The family sits around the small table as Mother comes with a saucepan of soup and starts to serve Helmeted jackbooted SS men led by an NCO pour out of the vehicle The family rushes to the windows as a Gestapo vehicle enters the street and screeches to a halt they are all terrified The Szpilmans gather at their open window to watch and Regina turns off the lights before joining them The SS men are pouring into the building opposite and the sound of jackboots on stairs is heard From the POV of the Szpilman apartment they see the building opposite In an apartment directly opposite a businessman his wife three young people and an old man in a wheelchair sit at their dining table Lights go on floor by floor The family is frozen with horror and remains seated as the NCO scans their faces The SS men burst in machine pistols at the ready The NCO bears down on him and the old man in the wheelchair grips the arms of the chair trying desperately to stand but he cannot The family rises to their feet fast except for the old man in the wheelchair Mother screams Without warning the SS men seize the chair with the old man in it carry him out onto the balcony Halina comforts him and Regina comforts Mother Father shrinks back He seems to hang in the air for a second then drops out of the chair and out of sight followed by a terrible thud as his body hits the pavement and a clatter as the wheelchair follows him From Szpilman's and Henryk's POV they see the apartment opposite where the SS men throw the old man in his wheelchair over the balcony Then there is the sound of shots slamming doors screams and shouts Mother is sobbing and the others are still horrified People are watching from the windows but trying not to be seen From their POV from a second window they see the building opposite and the street where the SS men are herding a couple of dozen prisoners from the building opposite The prisoners start to run and the SS men open fire with a machine gun mounted on the vehicle The headlights of the SS vehicle are switched on and the SS men are forcing their prisoners to stand in the beam The prisoners are being shot down lifted into the air by the bullets turning somersaults and falling dead People in the building opposite begin to scream The escaping man a silhouette out of the light runs with all his strength putting distance between himself and the SS One man escapes by running back in the opposite direction out of the beam of light and is lost to sight for a moment"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Without warning the SS men seize the chair with the old man in it carry him out onto the balcony  Mother screams  Father shrinks back  Halina comforts him and Regina comforts Mother  From Szpilman's and Henryk's POV they see the apartment opposite where the SS men throw the old man in his wheelchair over the balcony  He seems to hang in the air for a second then drops out of the chair and out of sight followed by a terrible thud as his body hits the pavement and a clatter as the wheelchair follows him  Mother is sobbing and the others are still horrified  Then there's the sound of shots slamming doors screams and shouts  From their POV from a second window they see the building opposite and the street where the SS men are herding a couple of dozen prisoners from the building opposite  People are watching from the windows but trying not to be seen  The headlights of the SS vehicle are switched on and the SS men are forcing their prisoners to stand in the beam  The prisoners start to run and the SS men open fire with a machine gun mounted on the vehicle  People in the building opposite begin to scream  The prisoners are being shot down lifted into the air by the bullets turning somersaults and falling dead  One man escapes by running back in the opposite direction out of the beam of light and is lost to sight for a moment  The escaping man a silhouette out of the light runs with all his strength putting distance between himself and the SS He stops seeing Szpilman and Szpilman shrugs  Jehuda loves this too but his laugh makes him cough appallingly  The family sits around the small table as Mother comes with a saucepan of soup and starts to serve  He laughs and the others look at him  The family rushes to the windows as a Gestapo vehicle enters the street and screeches to a halt  Helmeted jackbooted SS men led by an NCO pour out of the vehicle  The Szpilmans gather at their open window to watch and Regina turns off the lights before joining them  they are all terrified  From the POV of the Szpilman apartment they see the building opposite  The SS men are pouring into the building opposite and the sound of jackboots on stairs is heard  Lights go on floor by floor  In an apartment directly opposite a businessman his wife three young people and an old man in a wheelchair sit at their dining table  The SS men burst in machine pistols at the ready  The family is frozen with horror and remains seated as the NCO scans their faces  The family rises to their feet fast except for the old man in the wheelchair  The NCO bears down on him and the old man in the wheelchair grips the arms of the chair trying desperately to stand but he can't "
        }
      ]
    }
  ]
}