{
  "ground_truth": "He starts to scale a wall, looking as though he's getting away, but there's a floodlight on the SS vehicle that flares into light, swivels, and finds the man. A volley of shots follows, and the man drops from the wall, dead. The SS men get into the vehicle and speed off, driving over the dead bodies. Szpilman and Henryk stare at the scene, silent and shocked, with the only sounds being the weeping of the people opposite and, nearer, Mother crying softly. Szpilman, as if in another world, plays the piano in a cafe full of customers, although the atmosphere is much more subdued than previously, and the mood is sombre. A doorman with a cudgel beats away the beggars from the door as Halina, distraught and out of breath, runs to the cafe entrance, and the doorman lets her in. Szpilman snaps out of his reverie, seeing Halina, in a state of great anxiety, beckoning urgently across the heads of the customers. Szpilman quickly brings the piece to a close, stands, steps off the platform, and threads his way through to Halina, who is shivering and almost unable to speak. Szpilman starts running through crowded streets filled with corpses, sweating and dodging, sidestepping people until a woman, the Feather Woman, bars his way, her brightly rouged cheeks and thickly painted eyebrows beneath an unsteady mauve ostrich feather rising from her straw hat. He tries to dodge past, but she grabs his arm. Szpilman manages to free himself and runs on to a mob of men in front of a building, being herded by Jewish policemen. More and more captive men are brought in by the German Schutzpolizei (Shupos), and the mob constantly swells. Szpilman reaches the back of the crowd and scans the mob, seeing the Jewish policemen using batons and whips to herd the men. Szpilman becomes alert, as he's seen someone he recognises—Heller, with his red hair and Hitler moustache, wielding a baton and driving men into the building. With difficulty, Szpilman pushes his way through the mob and gets nearer to Heller, who glances around and shoves someone aside so Szpilman can approach while he continues to beat and manhandle people. Heller just glares at Szpilman and then moves away, leaving Szpilman standing, jostled by the crowd, uncertain and forlorn. Szpilman, keeping to the shadows of the alleyway, watches the front of the building where there are comings and goings, with German soldiers in evidence, and the mob is smaller now. Szpilman waits and watches as a poor woman passes, carrying a can wrapped in newspaper, followed by a ragged old man dragging himself along. The ragged old man, shivering with cold and showing his purple feet through the holes in his shoes, suddenly lunges forward and tries to grab the can from the poor woman.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He begins to climb a barrier, gazing as though he's escaping, but there's a spotlight on the SS automobile that blazes into brilliance, rotates, and locates the fellow. A barrage of gunfire ensues, and the fellow falls from the barrier, lifeless. The SS men enter the automobile and hasten away, driving over the deceased figures. Szpilman and Henryk gaze at the tableau, mute and stunned, with the only noises being the lamentations of the individuals opposite and, nearer, Mother sobbing gently. Szpilman, as if in another realm, performs the keyboard in a bistro full of patrons, although the ambiance is much more restrained than formerly, and the spirit is melancholy. A porter with a club drives away the vagrants from the entrance as Halina, overwrought and out of breath, dashes to the bistro doorway, and the porter permits her inside. Szpilman emerges from his trance, noticing Halina, in a state of great distress, gesturing urgently across the heads of the patrons. Szpilman swiftly concludes the composition, rises, steps off the dais, and weaves his path through to Halina, who is quivering and almost speechless. Szpilman commences sprinting through congested avenues filled with cadavers, perspiring and evading, sidestepping individuals until a lady, the Feather Woman, obstructs his route, her vividly blushed cheeks and heavily drawn eyebrows beneath an unstable lavender ostrich feather ascending from her straw bonnet. He attempts to sidestep, but she seizes his arm. Szpilman manages to liberate himself and proceeds to a throng of males in front of a structure, being corralled by Jewish constables. More and more captive males are brought in by the German Schutzpolizei (Shupos), and the throng incessantly expands. Szpilman reaches the rear of the assemblage and surveys the throng, observing the Jewish constables using truncheons and lashes to corral the males. Szpilman becomes vigilant, as he's noticed someone he recognizes—Heller, with his auburn hair and Hitler moustache, wielding a truncheon and driving males into the structure. With exertion, Szpilman forces his path through the throng and gets closer to Heller, who glances around and shoves someone aside so Szpilman can approach while he continues to strike and mishandle individuals. Heller merely glowers at Szpilman and then moves along, leaving Szpilman standing, jostled by the multitude, unsure and desolate. Szpilman, staying to the shadows of the passageway, observes the front of the structure where there are comings and goings, with German troopers evident, and the throng is smaller now. Szpilman waits and observes as a destitute lady passes, carrying a container wrapped in periodical, followed by a tattered old man dragging himself along. The tattered old man, quivering with cold and showing his purple feet through the gaps in his footwear, suddenly lunges forward and attempts to seize the container from the destitute lady."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He begins to scale a wall, looking as though he's getting away, but a floodlight on the SS vehicle flares into light, swivels, and finds him. A volley of shots follows, and he is dropped from the wall, dead. The vehicle is gotten into by the SS men, and they speed off, driving over the dead bodies. The scene is stared at by Szpilman and Henryk, silent and shocked, with the only sounds being the weeping of the people opposite and, nearer, Mother crying softly. As if in another world, Szpilman plays the piano in a cafe full of customers, although the atmosphere is much more subdued than previously, and the mood is sombre. A doorman with a cudgel beats away the beggars from the door as Halina, distraught and out of breath, runs to the cafe entrance, and he lets her in. Szpilman snaps out of his reverie, seeing Halina, in a state of great anxiety, beckoning urgently across the heads of the customers. The piece is quickly brought to a close by Szpilman, who stands, steps off the platform, and threads his way through to Halina, who is shivering and almost unable to speak. Through crowded streets filled with corpses, Szpilman starts running, sweating and dodging, sidestepping people until his way is barred by a woman, the Feather Woman, with her brightly rouged cheeks and thickly painted eyebrows beneath an unsteady mauve ostrich feather rising from her straw hat. An attempt is made by him to dodge past, but his arm is grabbed by her. He manages to free himself and runs on to a mob of men in front of a building, being herded by Jewish policemen. The German Schutzpolizei (Shupos) bring in more and more captive men, and the mob is constantly swelled. He reaches the back of the crowd and scans the mob, seeing the Jewish policemen using batons and whips to herd the men. He becomes alert, as someone he recognizes has been seen by him—Heller, with his red hair and Hitler moustache, wielding a baton and driving men into the building. With difficulty, the mob is pushed through by Szpilman, who gets nearer to Heller, and Heller glances around and shoves someone aside so that an approach can be made by Szpilman while Heller continues to beat and manhandle people. A glare is just given to Szpilman by Heller, who then moves away, leaving him standing, jostled by the crowd, uncertain and forlorn. Keeping to the shadows of the alleyway, Szpilman watches the front of the building where comings and goings are seen, with German soldiers in evidence, and the mob is smaller now. Szpilman waits and watches as a poor woman passes, carrying a can wrapped in newspaper, followed by a ragged old man dragging himself along. The poor woman is lunged at by the ragged old man, who shivers with cold and shows his purple feet through the holes in his shoes, and he suddenly tries to grab the can from her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He scales a wall, appearing to escape, but an SS vehicle's floodlight flares, locates him, and a volley of shots leaves him dead. The SS drive over bodies, while Szpilman and Henryk watch, silent and shocked, amid tears and Mother’s soft cries. In a subdued cafe, Szpilman plays piano. A doorman repels beggars with a cudgel as an anxious Halina rushes in. Szpilman ends his performance, hurries to her, finding her shivering and nearly speechless. He runs through crowded streets of corpses, dodging until blocked by the Feather Woman in a straw hat. Escaping her grasp, he finds a mob herded by Jewish policemen. Szpilman recognizes Heller, with red hair and a Hitler mustache, pushing men inside. Szpilman approaches as Heller shoves someone aside, allowing him to pass. Heller simply glares and moves on, leaving Szpilman uncertain. In the alley shadows, Szpilman observes a dwindling crowd, German soldiers, and a poor woman with a can. A tattered old man, shivering, suddenly lunges to grab the can from her."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He scales a wall, seemingly escaping, but a floodlight on the SS vehicle finds him. Shots are fired, and he falls dead. The SS men drive over the bodies, while Szpilman and Henryk watch in silence, hearing people weeping and Mother crying nearby. Szpilman plays piano in a subdued cafe, snapping out of his reverie when Halina rushes in, beckoning urgently. He finishes playing and goes to her, finding her anxious and speechless. Szpilman runs through corpse-filled streets, dodging until the Feather Woman grabs him; he frees himself and continues to a crowd herded by policemen. Spotting familiar Heller wielding a baton, Szpilman approaches, but Heller only glares and moves away. Szpilman watches as soldiers and people move around, noticing a ragged man attempting to steal a can from a poor woman."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He begins to climb the wall, giving the impression that he is attempting to make a quick escape, but then suddenly, the floodlight mounted on the SS vehicle abruptly bursts into illumination. It swivels around, finally zeroing in on the man. A rapid succession of shots rings out, and the man plummets from the wall, lifeless. Afterward, the SS officers promptly board the vehicle and hasten away, recklessly driving over the lifeless bodies on the ground. Szpilman and Henryk are left standing there, gazing at the scene, enveloped in a profound silence and shock, with the sole audible sounds being the cries of the people across from them and, nearer by, Mother quietly weeping. Szpilman, seemingly lost in an alternate reality, sits playing the piano in a café bustling with patrons, though the atmosphere is significantly more subdued than it was before, and the overall mood is somber and mournful. A doorman, clutching a cudgel, roughly wards off the beggars from the entrance as Halina, visibly distressed and struggling for breath, races toward the café entrance, and the doorman allows her entry. Szpilman emerges from his trance-like state, noticing Halina, who, in a state of heightened anxiety, is gesturing frantically across the heads of the gathered customers. Quickly, Szpilman brings the musical piece to an abrupt end, rises from his seat, steps down from the platform, and weaves his way through the crowded café to reach Halina, who is visibly trembling and nearly unable to articulate words. Szpilman takes off, sprinting through the crowded streets, which are scattered with corpses, perspiring and skillfully navigating through the throng until a particular woman, known as the Feather Woman, obstructs his path. Her cheeks are vividly rouged, her eyebrows painted with striking thickness, and she sports an unstable mauve ostrich feather rising flamboyantly from her straw hat. He attempts to maneuver past her, but she seizes his arm firmly. Szpilman manages to extricate himself from her grasp and continues running toward a group of men congregated in front of a building, being ushered along by Jewish policemen. An increasing number of captive men are continuously brought in by the German Schutzpolizei, colloquially known as the Shupos, causing the mob to swell incessantly. Szpilman arrives at the rear of the crowd and scans the assembled mob, observing the Jewish policemen employing batons and whips to herd the men into compliance. Szpilman becomes especially alert when he spots someone familiar—Heller, distinguishable by his vivid red hair and distinct Hitler-style moustache, wielding a baton and forcibly driving men into the building. With considerable effort, Szpilman manages to push his way through the mass of people and draws nearer to Heller, who glances around briefly and pushes someone aside, allowing Szpilman to approach while he continues his relentless beating and manhandling of individuals. Heller merely fixes Szpilman with a cold glare before moving away, leaving Szpilman standing amidst the crowd, jostled and feeling both uncertain and desolate. Szpilman, remaining in the concealment of the alleyway's shadows, observes the activity in front of the building, where there is frequent movement, with German soldiers prominently visible, and the mob has considerably diminished in size now. Szpilman continues to wait and watch as a destitute woman passes by, carrying a can wrapped in newspaper, trailed by a ragged old man who drags himself along. The ragged old man, trembling from the cold and his purple feet visible through the gaping holes in his shoes, suddenly lunges forward, attempting to seize the can from the impoverished woman."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He begins the challenging task of climbing the wall, exuding an air of urgency that suggests he is desperately attempting to make a swift escape. However, in an unexpected turn of events, the floodlight affixed to the SS vehicle suddenly bursts into dazzling illumination. It swings around with purpose, ultimately locking onto the man as its target. A rapid series of gunshots echoes through the air, and the man falls from the wall, lifeless and still. In the aftermath, the SS officers quickly board the vehicle with haste and drive away recklessly, carelessly running over the lifeless bodies that litter the ground. Szpilman and Henryk remain standing there, staring at the harrowing scene before them. They are enveloped in a deep silence, rooted in shock, with the only audible sounds being the heart-wrenching cries of the people nearby and, closer to them, their mother quietly weeping. Szpilman, seemingly transported into an alternate reality, sits at the piano playing in a once-bustling café now filled with patrons, though the atmosphere is noticeably more subdued and laden with a somber, mournful mood. A doorman, gripping a cudgel with authority, harshly wards off the beggars loitering at the entrance as Halina, visibly distressed and struggling to breathe, races toward the café entrance. The doorman allows her entry. Szpilman, emerging from his trance-like state, notices Halina, who, in a state of heightened anxiety, gestures frantically over the heads of the assembled customers. Without delay, Szpilman brings the musical piece to an abrupt end, rises swiftly from his seat, steps down from the platform, and navigates his way through the crowded café to reach Halina, who is visibly trembling and almost unable to speak. Szpilman then takes off, sprinting through the densely crowded streets, which are strewn with motionless bodies, perspiring and skillfully weaving through the throng until a particular woman, known as the Feather Woman, unexpectedly blocks his path. Her cheeks are vividly rouged, her eyebrows painted with striking thickness, and she sports a flamboyantly unstable mauve ostrich feather rising from her straw hat. He attempts to maneuver past her, but she seizes his arm firmly, determined not to let go. Szpilman manages to extricate himself from her grasp and continues running toward a group of men gathered in front of a building, being herded along by Jewish policemen. An ever-growing number of captive men are constantly brought in by the German Schutzpolizei, colloquially referred to as the Shupos, causing the size of the mob to swell without pause. Szpilman arrives at the outer edges of the crowd and surveys the assembled mob, noting how the Jewish policemen employ batons and whips to drive the men into compliance. Szpilman becomes especially attentive when he spots someone he recognizes—Heller, identifiable by his vividly red hair and distinct Hitler-style moustache, wielding a baton and forcibly herding men into the building. With considerable effort, Szpilman manages to push his way through the dense crowd, drawing nearer to Heller, who briefly glances around and pushes someone aside, allowing Szpilman to approach while he continues his relentless beating and manhandling of individuals. Heller merely fixes Szpilman with a cold, detached glare before moving away, leaving Szpilman standing amidst the crowd, feeling jostled, uncertain, and desolate. Szpilman, remaining in the safety of the alleyway's shadows, observes the activity occurring in front of the building, where there is constant, bustling movement, with German soldiers prominently visible, and the mob now significantly diminished in size. Szpilman continues to wait patiently and watch vigilantly as a destitute woman passes by, carrying a can wrapped in crumpled newspaper, trailed by a ragged old man who drags himself along laboriously. The ragged old man, trembling from the biting cold and with his purple feet visible through the gaping holes in his shoes, suddenly lunges forward in a desperate attempt to seize the can from the impoverished woman."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He begins the arduous task of scaling a wall, each movement deliberate and tense, as if he is trying to make a hurried escape. Suddenly, a floodlight attached to the SS vehicle bursts into a bright flare, its beam swinging around purposefully until it zeroes in on the man, illuminating him in stark relief. A rapid volley of gunshots erupts, piercing the air, and in an instant, the man crumples and falls lifelessly from the wall. The SS men, with practiced efficiency, climb into their vehicle and drive away with reckless speed, coldly and carelessly running over the remains of the fallen. In the aftermath, Szpilman and Henryk stand rooted to the spot, their faces ashen, engulfed in a heavy silence as they process the brutal event, while the mournful sounds of weeping people directly across from them mingle with the softer, personal cries of their Mother nearby. Meanwhile, detached from the horrific reality, Szpilman sits at a piano in a café that is bustling with patrons, yet the air is heavy with a sense of detachment; the atmosphere is muted and the collective mood somber. Outside, a doorman stands vigilant, wielding a cudgel to forcibly keep the beggars at bay from the entrance. In a moment of breathless urgency, Halina, her face etched with distress and chest heaving with exertion, dashes to the café door, whereupon the doorman grants her entry. Szpilman abruptly emerges from his mental haze upon seeing Halina's urgent signaling over the heads of seated customers. He finishes the musical piece with a swift, decisive flourish, rises from the piano bench, and steps down from the platform. Swiftly navigating through the throng of patrons, he reaches Halina, who stands trembling and nearly mute from anxiety. Szpilman's heart pounds as he sets off running, weaving through streets crowded with the grim presence of corpses, sweat trickling down his brow as he nimbly avoids colliding with passersby. Suddenly, he is halted by the outstretched arm of a peculiar woman adorned with garish makeup and wearing a straw hat adorned with a wavering mauve ostrich feather. As he attempts to sidestep her, she seizes his arm in a firm grip, but he wriggles free and continues his urgent dash, arriving at a tumultuous gathering of men outside a building. The crowd of men swells continuously as Jewish policemen prod them with batons, while uniformed Shupos usher in more captives. From the periphery of the crowd, Szpilman vigilantly scans the scene until he locks eyes on a familiar figure—Heller, distinguishable by his fiery red hair and Hitler-style moustache, aggressively wielding a baton as he forces men into the building. With determination, Szpilman threads his way through the chaotic mob, drawing closer to Heller, who momentarily pauses in his brutal task to glance around and create a path for Szpilman by violently shoving someone aside. Despite the brief acknowledgment, Heller's expression remains hard, and he retreats into the chaos, leaving Szpilman standing amidst the jostling mass, a picture of desolation and uncertainty. Seeking refuge in the shadows of an adjacent alleyway, Szpilman watches intently as the comings and goings continue at the building's entrance, where German soldiers maintain a dominating presence and the once expansive mob has gradually diminished. Remaining a silent observer, Szpilman's attention is drawn to a destitute woman passing by, clutching a can that's wrapped in newspaper, followed closely by an old man clad in rags who labors to drag his worn-out form along the street. The old man, visibly trembling from the cold and sporting shoes that reveal purple toes through ragged holes, makes a sudden, desperate lunge as he attempts to snatch the can from the woman's grasp."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The SS vehicle's floodlight flares to life and finds a man scaling a wall in an apparent escape, but gunfire follows, and he falls dead. The SS men drive off over the bodies, leaving Szpilman and Henryk silently shocked amid the cries of bystanders, including their mother. Meanwhile, Szpilman plays piano in a subdued cafe, where a doorman beats back beggars. Halina, breathless and anxious, arrives and catches Szpilman's attention. He quickly ends his performance and weaves through the crowd to reach her. They hurry through corpse-laden, crowded streets, Szpilman dodging obstacles until a woman briefly blocks his path before he breaks free. He arrives at a building where a mob is herded by Jewish policemen under the watch of German Schutzpolizei. Spotting Heller with his baton, Szpilman pushes through the crowd, but Heller dismissively moves away after a brief glare. Left in the chaos, Szpilman retreats to the shadows, observing German soldiers and a diminishing mob. He notices a poor woman carrying a can and a shivering old man with tattered shoes who suddenly lunges at her, trying to seize the can."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He starts to scale a wall near an oppressive checkpoint in Nazi-occupied Warsaw, looking as though he's getting away, but there's a powerful floodlight on the SS vehicle, a feared military unit known for its brutal enforcement during World War II, that flares into light, swivels, and finds the man. A volley of shots follows, and the man drops from the wall, dead. The SS men, clad in their distinctive black uniforms that instill fear across Europe, get into the vehicle and speed off, driving over the dead bodies. Szpilman, a renowned Jewish pianist, and his brother Henryk stare at the scene, silent and shocked, with the only sounds being the weeping of the people opposite and, nearer, Mother crying softly. Szpilman, as if in another world, plays the piano in a cafe in the heart of Warsaw full of customers, although the atmosphere is much more subdued than previously, and the mood is sombre due to the war-torn realities outside. A doorman, enforcing a harsh policy against the destitute, with a cudgel beats away the beggars from the door as Halina, his sister, distraught and out of breath after hearing terrifying news, runs to the cafe entrance, and the doorman lets her in. Szpilman snaps out of his reverie, seeing Halina, in a state of great anxiety, beckoning urgently across the heads of the customers. Szpilman quickly brings the piece to a close, stands, steps off the platform, and threads his way through to Halina, who is shivering and almost unable to speak. Szpilman starts running through crowded streets in the Warsaw Ghetto filled with corpses, sweating and dodging, sidestepping people until a woman, the Feather Woman known for her eccentric attire even in such dire times, bars his way, her brightly rouged cheeks and thickly painted eyebrows beneath an unsteady mauve ostrich feather rising from her straw hat. He tries to dodge past, but she grabs his arm. Szpilman manages to free himself and runs on to a mob of men in front of a building, being herded by Jewish policemen, who were forced by the Nazis to police their own people. More and more captive men are brought in by the German Schutzpolizei (Shupos), an auxiliary police force aiding the SS, and the mob constantly swells. Szpilman reaches the back of the crowd and scans the mob, seeing the Jewish policemen using batons and whips to herd the men into the Umschlagplatz, a holding area for deportation. Szpilman becomes alert, as he's seen someone he recognises—Heller, with his red hair and Hitler moustache, wielding a baton and driving men into the building. With difficulty, Szpilman pushes his way through the mob and gets nearer to Heller, who glances around and shoves someone aside so Szpilman can approach while he continues to beat and manhandle people. Heller just glares at Szpilman and then moves away, leaving Szpilman standing, jostled by the crowd, uncertain and forlorn. Szpilman, keeping to the shadows of the alleyway, watches the front of the building, a location infamous for its deportations, where there are comings and goings, with German soldiers in evidence, and the mob is smaller now. Szpilman waits and watches as a poor woman passes, carrying a can wrapped in newspaper, a common sight reflective of the desperate scarcities, followed by a ragged old man dragging himself along. The ragged old man, shivering with cold and showing his purple feet through the holes in his shoes, suddenly lunges forward and tries to grab the can from the poor woman."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Szpilman snaps out of his reverie seeing Halina in a state of great anxiety beckoning urgently across the heads of the customers uncertain and forlorn He starts to scale a wall looking as though he is getting away but there is a floodlight on the SS vehicle that flares into light swivels and finds the man Heller just glares at Szpilman and then moves away leaving Szpilman standing jostled by the crowd Szpilman quickly brings the piece to a close stands steps off the platform and threads his way through to Halina who is shivering and almost unable to speak A volley of shots follows and the man drops from the wall dead The ragged old man shivering with cold and showing his purple feet through the holes in his shoes suddenly lunges forward and tries to grab the can from the poor woman The SS men get into the vehicle and speed off driving over the dead bodies Szpilman manages to free himself and runs on to a mob of men in front of a building being herded by Jewish policemen The SS men get into the vehicle and speed off driving over the dead bodies Szpilman and Henryk stare at the scene silent and shocked with the only sounds being the weeping of the people opposite and nearer Mother crying softly Szpilman as if in another world plays the piano in a cafe full of customers although the atmosphere is much more subdued than previously and the mood is sombre A doorman with a cudgel beats away the beggars from the door as Halina distraught and out of breath runs to the cafe entrance and the doorman let us her in Szpilman snaps out of his reverie seeing Halina in a state of great anxiety beckoning urgently across the heads of the customers Szpilman quickly brings the piece to a close stands steps off the platform and threads his way through to Halina who is shivering and almost unable to speak Szpilman starts running through crowded streets filled with corpses sweating and dodging sidestepping people until a woman the Feather Woman bars his way her brightly rouged cheeks and thickly painted eyebrows beneath an unsteady mauve ostrich feather rising from her straw hat A volley of shots follows and the man drops from the wall dead He tries to dodge past but she grabs his arm Szpilman manages to free himself and runs on to a mob of men in front of a building being herded by Jewish policemen He tries to dodge past but she grabs his arm He starts to scale a wall looking as though he is getting away but there is a floodlight on the SS vehicle that flares into light swivels and finds the man More and more captive men are brought in by the German Schutzpolizei Shupos and the mob constantly swells Szpilman reaches the back of the crowd and scans the mob seeing the Jewish policemen using batons and whips to herd the men Szpilman becomes alert as he is seen someone he recognises—Heller with his red hair and Hitler moustache wielding a baton and driving men into the building With difficulty Szpilman pushes his way through the mob and gets nearer to Heller who glances around and shoves someone aside so Szpilman can approach while he continues to beat and manhandle people Heller just glares at Szpilman and then moves away leaving Szpilman standing jostled by the crowd Szpilman and Henryk stare at the scene silent and shocked with the only sounds being the weeping of the people opposite and nearer uncertain and forlorn Szpilman keeping to the shadows of the alleyway watches the front of the building where there are comings and goings with German soldiers in evidence and the mob is smaller now Szpilman waits and watches as a poor woman passes carrying a can wrapped in newspaper followed by a ragged old man dragging himself along The ragged old man shivering with cold and showing his purple feet through the holes in his shoes suddenly lunges forward and tries to grab the can from the poor woman"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He starts to scale a wall looking as though he is getting away but there is a floodlight on the SS vehicle that flares into light swivels and finds the man. A volley of shots follows and the man drops from the wall dead. The SS men get into the vehicle and speed off driving over the dead bodies. Szpilman and Henryk stare at the scene silent and shocked with the only sounds being the weeping of the people opposite and nearer. Mother crying softly. Szpilman as if in another world plays the piano in a cafe full of customers although the atmosphere is much more subdued than previously and the mood is sombre. A doorman with a cudgel beats away the beggars from the door as Halina distraught and out of breath runs to the cafe entrance and the doorman let us her in. Szpilman snaps out of his reverie seeing Halina in a state of great anxiety beckoning urgently across the heads of the customers. Szpilman quickly brings the piece to a close stands steps off the platform and threads his way through to Halina who is shivering and almost unable to speak. Szpilman starts running through crowded streets filled with corpses sweating and dodging sidestepping people until a woman the Feather Woman bars his way her brightly rouged cheeks and thickly painted eyebrows beneath an unsteady mauve ostrich feather rising from her straw hat. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. He tries to dodge past but she grabs his arm. Szpilman manages to free himself and runs on to a mob of men in front of a building being herded by Jewish policemen. More and more captive men are brought in by the German Schutzpolizei Shupos and the mob constantly swells. Szpilman reaches the back of the crowd and scans the mob seeing the Jewish policemen using batons and whips to herd the men. Szpilman becomes alert as he is seen someone he recognises—Heller with his red hair and Hitler moustache wielding a baton and driving men into the building. With difficulty Szpilman pushes his way through the mob and gets nearer to Heller who glances around and shoves someone aside so Szpilman can approach while he continues to beat and manhandle people. Heller just glares at Szpilman and then moves away leaving Szpilman standing jostled by the crowd. uncertain and forlorn. Szpilman keeping to the shadows of the alleyway watches the front of the building where there are comings and goings with German soldiers in evidence and the mob is smaller now. Szpilman waits and watches as a poor woman passes carrying a can wrapped in newspaper followed by a ragged old man dragging himself along. The ragged old man shivering with cold and showing his purple feet through the holes in his shoes suddenly lunges forward and tries to grab the can from the poor woman."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He starts to scale a wall looking as though he is getting away but there is a floodlight on the SS vehicle that flares into light swivels and finds the man. A volley of shots follows and the man drops from the wall dead. The SS men get into the vehicle and speed off driving over the dead bodies. Szpilman and Henryk stare at the scene silent and shocked with the only sounds being the weeping of the people opposite and nearer. Mother crying softly. Szpilman as if in another world plays the piano in a cafe full of customers although the atmosphere is much more subdued than previously and the mood is sombre. A doorman with a cudgel beats away the beggars from the door as Halina distraught and out of breath runs to the cafe entrance and the doorman let us her in. Szpilman snaps out of his reverie seeing Halina in a state of great anxiety beckoning urgently across the heads of the customers. Szpilman quickly brings the piece to a close stands steps off the platform and threads his way through to Halina who is shivering and almost unable to speak. Szpilman starts running through crowded streets filled with corpses sweating and dodging sidestepping people until a woman the Feather Woman bars his way her brightly rouged cheeks and thickly painted eyebrows beneath an unsteady mauve ostrich feather rising from her straw hat. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. He tries to dodge past but she grabs his arm. Szpilman manages to free himself and runs on to a mob of men in front of a building being herded by Jewish policemen. More and more captive men are brought in by the German Schutzpolizei Shupos and the mob constantly swells. Szpilman reaches the back of the crowd and scans the mob seeing the Jewish policemen using batons and whips to herd the men. Szpilman becomes alert as he is seen someone he recognises—Heller with his red hair and Hitler moustache wielding a baton and driving men into the building. With difficulty Szpilman pushes his way through the mob and gets nearer to Heller who glances around and shoves someone aside so Szpilman can approach while he continues to beat and manhandle people. Heller just glares at Szpilman and then moves away leaving Szpilman standing jostled by the crowd. uncertain and forlorn. Szpilman keeping to the shadows of the alleyway watches the front of the building where there are comings and goings with German soldiers in evidence and the mob is smaller now. Szpilman waits and watches as a poor woman passes carrying a can wrapped in newspaper followed by a ragged old man dragging himself along. The ragged old man shivering with cold and showing his purple feet through the holes in his shoes suddenly lunges forward and tries to grab the can from the poor woman."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He starts to scale a wall looking as though he is getting away but there is a floodlight on the SS vehicle that flares into light swivels and finds the man. A volley of shots follows and the man drops from the wall dead. The SS men get into the vehicle and speed off driving over the dead bodies. Szpilman and Henryk stare at the scene silent and shocked with the only sounds being the weeping of the people opposite and nearer. Mother crying softly. With difficulty Szpilman pushes his way through the mob and gets nearer to Heller who glances around and shoves someone aside so Szpilman can approach while he continues to beat and manhandle people. Heller just glares at Szpilman and then moves away leaving Szpilman standing jostled by the crowd. uncertain and forlorn. Szpilman keeping to the shadows of the alleyway watches the front of the building where there are comings and goings with German soldiers in evidence and the mob is smaller now. Szpilman waits and watches as a poor woman passes carrying a can wrapped in newspaper followed by a ragged old man dragging himself along. The ragged old man shivering with cold and showing his purple feet through the holes in his shoes suddenly lunges forward and tries to grab the can from the poor woman."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He starts to scale a wall looking as though he is getting away but there is a floodlight on the SS vehicle that flares into light swivels and finds the man. A volley of shots follows and the man drops from the wall dead. Szpilman keeping to the shadows of the alleyway watches the front of the building where there are comings and goings with German soldiers in evidence and the mob is smaller now. Szpilman waits and watches as a poor woman passes carrying a can wrapped in newspaper followed by a ragged old man dragging himself along. The ragged old man shivering with cold and showing his purple feet through the holes in his shoes suddenly lunges forward and tries to grab the can from the poor woman."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "She starts to scale a wall, looking as though she's getting away, but there's a floodlight on the SS vehicle that flares into light, swivels, and finds the child. A volley of shots follows, and the child drops from the wall, dead. The birds get into the vehicle and speed off, driving over the dead bodies. The cat and the rabbit stare at the scene, silent and shocked, with the only sounds being the weeping of the people opposite and, nearer, the dog crying softly. The cat, as if in another world, plays the piano in a cafe full of customers, although the atmosphere is much more subdued than previously, and the mood is sombre. A squirrel with a cudgel beats away the beggars from the door as the fox, distraught and out of breath, runs to the cafe entrance, and the squirrel lets her in. The cat snaps out of its reverie, seeing the fox, in a state of great anxiety, beckoning urgently across the heads of the customers. The cat quickly brings the piece to a close, stands, steps off the platform, and threads its way through to the fox, who is shivering and almost unable to speak. The cat starts running through crowded streets filled with corpses, sweating and dodging, sidestepping people until a woman, the Turtle Woman, bars its way, her brightly rouged cheeks and thickly painted eyebrows beneath an unsteady mauve ostrich feather rising from her straw hat. It tries to dodge past, but she grabs its arm. The cat manages to free itself and runs on to a mob of robots in front of a building, being herded by Jewish bumblebees. More and more captive robots are brought in by the German Schutzpolizei (Shupos), and the mob constantly swells. The cat reaches the back of the crowd and scans the mob, seeing the Jewish bumblebees using batons and whips to herd the robots. The cat becomes alert, as it has seen someone it recognizes—Heller, with his red hair and Hitler moustache, wielding a baton and driving robots into the building. With difficulty, the cat pushes its way through the mob and gets nearer to Heller, who glances around and shoves someone aside so the cat can approach while he continues to beat and manhandle people. Heller just glares at the cat and then moves away, leaving the cat standing, jostled by the crowd, uncertain and forlorn. The cat, keeping to the shadows of the alleyway, watches the front of the building where there are comings and goings, with German soldiers in evidence, and the mob is smaller now. The cat waits and watches as a poor penguin passes, carrying a can wrapped in newspaper, followed by a ragged old mouse dragging itself along. The ragged old mouse, shivering with cold and showing its purple feet through the holes in its shoes, suddenly lunges forward and tries to grab the can from the poor penguin."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He starts to scale a fence, looking as though he's getting away, but there's a streetlamp on the SS bicycle that flares into light, swivels, and finds the man. A volley of arrows follows, and the man drops from the fence, dead. The SS men get onto the bicycle and speed off, riding over the fallen leaves. Szpilman and Henryk stare at the scene, silent and shocked, with the only sounds being the murmuring of the people opposite and, nearer, Mother whispering softly. Szpilman, as if in another world, plays the violin in a library full of patrons, although the atmosphere is much more subdued than previously, and the mood is sombre. A bellhop with a squeegee shoos away the pigeons from the door as Halina, distraught and out of breath, runs to the library entrance, and the bellhop lets her in. Szpilman snaps out of his reverie, seeing Halina, in a state of great anxiety, beckoning urgently across the heads of the patrons. Szpilman quickly brings the piece to a close, stands, steps off the dais, and threads his way through to Halina, who is shaking and almost unable to speak. Szpilman starts running through crowded streets filled with mannequins, sweating and dodging, sidestepping people until a woman, the Feather Woman, bars his way, her brightly rouged cheeks and thickly painted eyebrows beneath an unsteady mauve ostrich feather rising from her straw hat. He tries to dodge past, but she grabs his sleeve. Szpilman manages to free himself and runs on to a mob of men in front of a warehouse, being herded by Jewish security guards. More and more captive men are brought in by the German Schutzpolizei (Shupos), and the mob constantly swells. Szpilman reaches the back of the gathering and scans the mob, seeing the Jewish security guards using canes and ropes to herd the men. Szpilman becomes alert, as he's seen someone he recognises—Heller, with his red hair and Hitler moustache, wielding a cane and driving men into the warehouse. With difficulty, Szpilman pushes his way through the mob and gets nearer to Heller, who glances around and shoves someone aside so Szpilman can approach while he continues to prod and jostle people. Heller just glares at Szpilman and then moves away, leaving Szpilman standing, jostled by the throng, uncertain and forlorn. Szpilman, keeping to the shadows of the corridor, watches the front of the warehouse where there are comings and goings, with German officers in evidence, and the mob is smaller now. Szpilman waits and watches as a poor woman passes, carrying a flask wrapped in paper towels, followed by a ragged old man dragging himself along. The ragged old man, shivering with cold and showing his purple toes through the holes in his slippers, suddenly lunges forward and tries to grab the flask from the poor woman."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He begins to crawl under a fence, looking as though he's sneaking in, but there's a spotlight on the SS vehicle that flickers into life, rotates, and spots the man. A barrage of fireworks follows, and the man floats from the fence, sleeping. The SS men jump into the vehicle and glide away, skating over the sleeping bodies. Szpilman and Henryk observe the scene, silent and stunned, with the only sounds being the laughing of the people opposite and, closer, Mother giggling softly. Szpilman, as if in a dream, paints a portrait in a cafe full of customers, although the atmosphere is much more lively than earlier, and the mood is jovial. A doorman with a broom shooes away the birds from the door as Halina, relieved and panting, jogs to the cafe entrance, and the doorman ushers her in. Szpilman snaps out of his trance, seeing Halina, in a state of great confusion, waving excitedly across the heads of the customers. Szpilman quickly finishes the painting, wipes his hands, hops off the platform, and weaves his way through to Halina, who is trembling and almost unable to laugh. Szpilman starts tiptoeing through deserted streets filled with sculptures, smiling and ducking, weaving around people until a woman, the Feather Woman, stands in his path, her brightly blushed cheeks and neatly braided hair beneath an unsteady mauve ostrich feather sitting atop her straw hat. He tries to pirouette past, but she taps his shoulder. Szpilman manages to shrug her off and dances on to a group of men in front of a building, being entertained by Jewish policemen. More and more guests are brought in by the German Schutzpolizei (Shupos), and the group continuously expands. Szpilman reaches the edge of the crowd and surveys the gathering, noticing the Jewish policemen using ribbons and flags to entertain the men. Szpilman becomes attentive, as he's spotted someone he recognises—Heller, with his red hair and Hitler moustache, twirling a ribbon and leading men into the building. With difficulty, Szpilman slides his way through the crowd and gets closer to Heller, who glimpses around and pulls someone aside so Szpilman can approach while he continues to sing and mock people. Heller just sneers at Szpilman and then steps aside, leaving Szpilman standing, bounced by the crowd, puzzled and melancholy. Szpilman, sticking to the edges of the alleyway, watches the front of the building where there are departures and arrivals, with German soldiers in view, and the crowd is smaller now. Szpilman lingers and observes as a wealthy woman strolls, carrying a basket wrapped in fabric, followed by a dapper old man striding along. The dapper old man, shivering with joy and showing his polished shoes through the holes in his soles, suddenly leaps forward and tries to hand the basket to the wealthy woman."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The kettle starts to scale a bookshelf, looking as though it's getting away, but there's a chandelier on the swing set that flares into light, swivels, and finds the spoon. A volley of notes follows, and the spoon drops from the bookshelf, silent. The swing set skates get into the toy box and float off, driving over the silent shadows. The telescope and the keyboard stare at the scene, silent and amused, with the only sounds being the chirping of the cushions opposite and, nearer, the lamp humming softly. The telescope, as if in another world, plays the saxophone in a garage full of dictionaries, although the atmosphere is much more crowded than previously, and the mood is cheerful. A giraffe with a balloon nudges away the tables from the rug as the drum, joyous and out of breath, crawls to the garage entrance, and the giraffe lets it in. The telescope snaps out of its reverie, seeing the drum, in a state of great joy, waving urgently across the heads of the dictionaries. The telescope quickly brings the piece to a close, stands, hops off the platform, and threads its way through to the drum, who is grinning and almost unable to speak. The telescope starts dancing through silent rooftops filled with lanterns, smiling and dodging, sidestepping letters until a coconut, the Feather Coconut, bars its way, its softly shaded cheeks and lightly painted fingernails beneath a steady mauve ostrich feather rising from its wooden hat. It tries to dodge past, but the coconut grabs its ribbon. The telescope manages to free itself and dances on to a flock of chairs in front of a hillside, being framed by cardboard librarians. More and more playful chairs are brought in by the purple ballerinas, and the flock constantly bounces. The telescope reaches the back of the flock and scans the chairs, seeing the cardboard librarians using batons and whistles to frame the chairs. The telescope becomes relaxed, as it's seen something it recognises—a daffodil, with its blue hat and cowboy moustache, wielding a baton and guiding chairs into the hillside. With ease, the telescope wiggles its way through the flock and gets nearer to the daffodil, who glances around and nudges something aside so the telescope can approach while it continues to tilt and entertain chairs. The daffodil just smiles at the telescope and then drifts away, leaving the telescope floating, nudged by the flock, uncertain and content. The telescope, keeping to the glow of the hallway, observes the front of the hillside where there are comings and goings, with garden gnomes in evidence, and the flock is smaller now. The telescope waits and observes as a joyful flower passes, carrying a kite wrapped in a scarf, followed by a radiant old turtle sliding itself along. The radiant old turtle, smiling with warmth and showing its yellow scarf through the pockets in its gloves, suddenly leaps forward and tries to grab the kite from the joyful flower."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The cat begins to glide up a tree, appearing as though it's escaping, but there's a flashlight on the fire engine that bursts into light, spins, and finds the bird. A cascade of fireworks ensues, and the bird tumbles from the tree, lifeless. The firefighters hop into the engine and zoom away, zooming over the lifeless trees. The goldfish and the horse gaze at the sight, quiet and amazed, with the only noises being the singing of the creatures nearby and, closer, a frog croaking gently. The goldfish, as if in an alternate reality, paints a picture in a studio full of artists, although the ambiance is much more subdued than earlier, and the feeling is melancholic. A chef with a spoon waves away the pigeons from the sidewalk as the squirrel, exhausted and breathless, skips to the studio gate, and the chef lets her in. The goldfish jolts out of his daydream, noticing the squirrel, in a state of immense worry, gesturing frantically over the heads of the artists. The goldfish swiftly finishes the painting, rises, hops off the stool, and weaves his way over to the squirrel, who is quaking and nearly unable to whisper. The goldfish begins trotting through bustling alleys filled with puddles, panting and weaving, sidestepping trees until a cat, the Feather Cat, blocks his path, its vividly painted fur and elaborately braided whiskers beneath a wobbly turquoise ostrich feather perched on its straw bonnet. He tries to weave around, but the cat hugs his leg. The goldfish manages to shake free and trots on to a pack of wolves in front of a cabin, being guided by owl soldiers. More and more captured wolves are led in by the elephant watchmen, and the pack constantly grows. The goldfish reaches the back of the pack and scans the wolves, noticing the elephant watchmen using branches and vines to guide the wolves. The goldfish becomes wary, as he's spotted someone familiar—Barker, with his green fur and Merlin beard, waving a branch and nudging wolves into the cabin. With effort, the goldfish nudges his way through the pack and draws closer to Barker, who glances around and elbows someone aside so the goldfish can approach while he continues to nudge and shuffle wolves. Barker just scowls at the goldfish and then drifts away, leaving the goldfish standing, jostled by the pack, unsure and desolate. The goldfish, keeping to the dimness of the forest path, observes the front of the cabin where there are comings and goings, with kangaroo guards evident, and the pack is smaller now. The goldfish waits and observes as an impoverished rabbit hops by, clutching a lotus leaf wrapped in silk, followed by a scruffy old goat dragging itself along. The scruffy old goat, trembling with chill and showing its blue hooves through the gaps in its slippers, suddenly lunges forward and tries to seize the lotus leaf from the impoverished rabbit."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He begins to leap over a hedge, appearing as though he's vanishing, but there's a lantern on the SS boat that blazes into brightness, swings around, and spots the man. A burst of fireworks follows, and the man tumbles from the hedge, lifeless. The SS men climb into the boat and sail away, gliding over the lifeless figures. Szpilman and Henryk gaze at the spectacle, mute and astonished, with the only sounds being the humming of the people across and, nearer, Mother humming softly. Szpilman, as if in another universe, plays the violin in a diner full of patrons, although the ambiance is much more hushed than before, and the tone is solemn. A porter with a broom shoos away the strangers from the entrance as Halina, upset and panting, saunters to the diner threshold, and the porter grants her entry. Szpilman jolts from his daydream, seeing Halina, in a state of great distress, signaling fervently across the heads of the patrons. Szpilman swiftly ends the tune, rises, hops off the stage, and weaves his path through to Halina, who is trembling and nearly speechless. Szpilman starts sprinting through bustling alleyways filled with debris, perspiring and dodging, weaving around people until a woman, the Feather Woman, blocks his route, her brightly blushed cheeks and heavily drawn eyebrows beneath a wobbling cerulean peacock feather perched on her felt cap. He attempts to sidestep around, but she seizes his sleeve. Szpilman manages to extricate himself and dashes toward a throng of women in front of a monument, being ushered by Jewish constables. More and more detained women are brought in by the German Schutzpolizei (Shupos), and the throng continuously grows. Szpilman arrives at the rear of the crowd and surveys the throng, noticing the Jewish constables using ropes and flutes to usher the women. Szpilman becomes vigilant, as he's noticed someone familiar—Heller, with his russet locks and Chaplin moustache, brandishing a rope and directing women into the monument. With effort, Szpilman nudges his way through the throng and approaches Heller, who glances around and nudges someone aside so Szpilman can advance while he continues to poke and usher people. Heller merely scowls at Szpilman and then departs, leaving Szpilman standing, jostled by the throng, unsure and desolate. Szpilman, keeping to the cover of the arcade, observes the facade of the monument where there are entrances and exits, with German officers evident, and the throng is smaller now. Szpilman waits and observes as a destitute woman passes, carrying a bucket wrapped in cardboard, followed by a tattered young boy dragging himself along. The tattered young boy, quivering with chill and revealing his rosy hands through the holes in his mittens, suddenly leaps forward and attempts to snatch the bucket from the destitute woman."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The cat begins to juggle a tree, appearing as though it's escaping, but there's a spotlight on the TT bicycle that bursts into shadow, rotates, and locates the bird. A burst of whistles follows, and the bird tumbles from the tree, unconscious. The TT birds hop onto the bicycle and fly away, pedaling over the forgotten chairs. Kyle and Jason gaze at the display, mute and amazed, with the only sounds being the laughter of the plants nearby and, nearer, Father singing softly. Kyle, as if in a different universe, knits the violin in a garage full of travelers, although the aura is much more vibrant than before, and the spirit is cheerful. A chef with a trumpet kisses away the dancers from the window as Beth, pleased and out of energy, flies to the garage exit, and the chef lets her out. Kyle drifts out of his daydream, noticing Beth, in a state of great joy, gesturing gently across the ears of the travelers. Kyle slowly begins the song to a middle, sits, hops onto the platform, and skips his way through to Beth, who is singing and almost unwilling to laugh. Kyle drifts dancing through empty seas filled with books, jumping and bouncing, sidestepping plants until a dancer, the Elegance Dancer, opens his path, his faintly glowing legs and lightly powdered hands beneath a calm green turkey plume rising from his cotton coat. He attempts to float under, but the dancer holds his leg. Kyle struggles to keep hold and walks on to a line of women in front of a cart, being massaged by Italian scientists. Fewer and fewer free women are taken out by the Chinese Firemen (Linus), and the line barely shrinks. Kyle reaches the edge of the children and paints the line, imagining the Italian scientists using feathers and blankets to massage the women. Kyle remains calm, as he's met someone he forgets—Taylor, with his blonde feet and Roman lips, carrying a feather and guiding women out of the cart. With grace, Kyle rolls his way past the children and gets further from Taylor, who glances down and nudges something closer so Kyle can avoid while he pauses to laugh and hug creatures. Taylor gently winks at Kyle and then floats toward, leaving Kyle floating, poked by the children, ecstatic and amused. Kyle, hiding in the music of the grassland, listens to the back of the cart where there are stoppings and goings, with Spanish sailors in disguise, and the line is larger now. Kyle drifts and listens as a rich man stops, tossing a box wrapped in plastic, followed by a shiny young boy skipping along. The shiny young boy, warm with laughter and showing his gold toes through the windows in his gloves, suddenly retreats backward and attempts to pass the box to the rich man."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "As a floodlight finds a man scaling a wall, shots ring out, and he falls dead. Szpilman and Henryk watch in shock as SS men speed away, driving over corpses. In a somber cafe, Szpilman plays piano before Halina urgently beckons him. He exits the cafe, dodging through streets filled with bodies, and encounters the Feather Woman but escapes her grasp. He reaches a crowd herded by Jewish policemen and German Schutzpolizei. Spotting Heller among them, Szpilman struggles through the mob. Heller, recognizing him, glares and moves away. Unsure and jostled, Szpilman withdraws to the alley, watching a poor woman and a ragged old man, who attempts to steal her can."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The ragged old man shivering with cold and showing his purple feet through the holes in his shoes suddenly lunges forward and tries to grab the can from the poor woman Szpilman waits and watches as a poor woman passes carrying a can wrapped in newspaper followed by a ragged old man dragging himself along Szpilman keeping to the shadows of the alleyway watches the front of the building where there are comings and goings with German soldiers in evidence and the mob is smaller now uncertain and forlorn Heller just glares at Szpilman and then moves away leaving Szpilman standing jostled by the crowd With difficulty Szpilman pushes his way through the mob and gets nearer to Heller who glances around and shoves someone aside so Szpilman can approach while he continues to beat and manhandle people Szpilman becomes alert as he is seen someone he recognises—Heller with his red hair and Hitler moustache wielding a baton and driving men into the building Szpilman reaches the back of the crowd and scans the mob seeing the Jewish policemen using batons and whips to herd the men More and more captive men are brought in by the German Schutzpolizei Shupos and the mob constantly swells Szpilman manages to free himself and runs on to a mob of men in front of a building being herded by Jewish policemen He tries to dodge past but she grabs his arm Szpilman starts running through crowded streets filled with corpses sweating and dodging sidestepping people until a woman the Feather Woman bars his way her brightly rouged cheeks and thickly painted eyebrows beneath an unsteady mauve ostrich feather rising from her straw hat Szpilman quickly brings the piece to a close stands steps off the platform and threads his way through to Halina who is shivering and almost unable to speak Szpilman snaps out of his reverie seeing Halina in a state of great anxiety beckoning urgently across the heads of the customers A doorman with a cudgel beats away the beggars from the door as Halina distraught and out of breath runs to the cafe entrance and the doorman let us her in Szpilman as if in another world plays the piano in a cafe full of customers although the atmosphere is much more subdued than previously and the mood is sombre Mother crying softly Szpilman and Henryk stare at the scene silent and shocked with the only sounds being the weeping of the people opposite and nearer The SS men get into the vehicle and speed off driving over the dead bodies A volley of shots follows and the man drops from the wall dead He starts to scale a wall looking as though he is getting away but there is a floodlight on the SS vehicle that flares into light swivels and finds the man"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Szpilman waits and watches as a poor woman passes carrying a can wrapped in newspaper followed by a ragged old man dragging himself along Szpilman as if in another world plays the piano in a cafe full of customers although the atmosphere is much more subdued than previously and the mood is sombre Szpilman becomes alert as he is seen someone he recognises—Heller with his red hair and Hitler moustache wielding a baton and driving men into the building Mother crying softly Szpilman starts running through crowded streets filled with corpses sweating and dodging sidestepping people until a woman the Feather Woman bars his way her brightly rouged cheeks and thickly painted eyebrows beneath an unsteady mauve ostrich feather rising from her straw hat Szpilman reaches the back of the crowd and scans the mob seeing the Jewish policemen using batons and whips to herd the men With difficulty Szpilman pushes his way through the mob and gets nearer to Heller who glances around and shoves someone aside so Szpilman can approach while he continues to beat and manhandle people Szpilman keeping to the shadows of the alleyway watches the front of the building where there are comings and goings with German soldiers in evidence and the mob is smaller now A doorman with a cudgel beats away the beggars from the door as Halina distraught and out of breath runs to the cafe entrance and the doorman let us her in More and more captive men are brought in by the German Schutzpolizei Shupos and the mob constantly swells uncertain and forlorn He tries to dodge past but she grabs his arm A volley of shots follows and the man drops from the wall dead Szpilman manages to free himself and runs on to a mob of men in front of a building being herded by Jewish policemen The SS men get into the vehicle and speed off driving over the dead bodies Heller just glares at Szpilman and then moves away leaving Szpilman standing jostled by the crowd Szpilman snaps out of his reverie seeing Halina in a state of great anxiety beckoning urgently across the heads of the customers Szpilman quickly brings the piece to a close stands steps off the platform and threads his way through to Halina who is shivering and almost unable to speak He starts to scale a wall looking as though he is getting away but there is a floodlight on the SS vehicle that flares into light swivels and finds the man Szpilman and Henryk stare at the scene silent and shocked with the only sounds being the weeping of the people opposite and nearer The ragged old man shivering with cold and showing his purple feet through the holes in his shoes suddenly lunges forward and tries to grab the can from the poor woman"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Szpilman manages to free himself and runs on to a mob of men in front of a building being herded by Jewish policemen More and more captive men are brought in by the German Schutzpolizei Shupos and the mob constantly swells Szpilman reaches the back of the crowd and scans the mob seeing the Jewish policemen using batons and whips to herd the men Szpilman becomes alert as he is seen someone he recognises—Heller with his red hair and Hitler moustache wielding a baton and driving men into the building With difficulty Szpilman pushes his way through the mob and gets nearer to Heller who glances around and shoves someone aside so Szpilman can approach while he continues to beat and manhandle people Heller just glares at Szpilman and then moves away leaving Szpilman standing jostled by the crowd uncertain and forlorn Szpilman keeping to the shadows of the alleyway watches the front of the building where there are comings and goings with German soldiers in evidence and the mob is smaller now Szpilman waits and watches as a poor woman passes carrying a can wrapped in newspaper followed by a ragged old man dragging himself along The ragged old man shivering with cold and showing his purple feet through the holes in his shoes suddenly lunges forward and tries to grab the can from the poor woman He starts to scale a wall looking as though he is getting away but there is a floodlight on the SS vehicle that flares into light swivels and finds the man A volley of shots follows and the man drops from the wall dead The SS men get into the vehicle and speed off driving over the dead bodies Szpilman and Henryk stare at the scene silent and shocked with the only sounds being the weeping of the people opposite and nearer Mother crying softly Szpilman as if in another world plays the piano in a cafe full of customers although the atmosphere is much more subdued than previously and the mood is sombre A doorman with a cudgel beats away the beggars from the door as Halina distraught and out of breath runs to the cafe entrance and the doorman let us her in Szpilman snaps out of his reverie seeing Halina in a state of great anxiety beckoning urgently across the heads of the customers Szpilman quickly brings the piece to a close stands steps off the platform and threads his way through to Halina who is shivering and almost unable to speak Szpilman starts running through crowded streets filled with corpses sweating and dodging sidestepping people until a woman the Feather Woman bars his way her brightly rouged cheeks and thickly painted eyebrows beneath an unsteady mauve ostrich feather rising from her straw hat He tries to dodge past but she grabs his arm"
        }
      ]
    }
  ]
}