{
  "ground_truth": "Szpilman retreats into the room with his nose bleeding, while the women watch from behind blankets and Mother hurries to him to wipe his nose. It is still quite dark as the Szpilmans and about twenty others stand lined up under lights from German vehicles. An NCO makes a selection, using his pistol to prod people, and when he reaches the Szpilmans, he selects Henryk and Halina. He then turns to shoot a young woman in the head, who falls to the ground bleeding. The partition is pulled aside, and people, including the Szpilmans, are either dressing or packing their belongings. Shots, screams, and a piercing whistle are heard on a hot summer's day. Jews, including Szpilman, Mother, Regina, and Father, clutch their belongings and walk towards wooden gates, where Jewish policemen order them into line. They shuffle through the opened gates, pausing to take in their surroundings. People walk up and down; a young man whispers to a woman who continues crying. Trucks arrive, unloading more Jews who are marched through the gates. Mothers, children, and old people, most holding papers, plead as the sun blazes. Szpilman wanders around, greeting people, while the area becomes crowded, and old people lie exhausted. Women with dehydrated children move group to group; one approaches Szpilman, who shakes his head sadly, and she wanders off. Ehrlich and Grun engage Father in conversation until Mother cries out and Regina and Szpilman call and wave to Henryk and Halina, who struggle through the crowd. Halina falls into Mother’s arms and is comforted by her while Father smiles sadly and Szpilman stares at Halina. The place becomes packed, with people calling names and women wailing. The Szpilmans sit in the same place, Henryk apart, reading a small book. Grun leans towards Halina, who looks at him in disbelief as Szpilman takes Henryk’s book to read the title. The Szpilmans remain seated on the curb.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Szpilman withdraws into the chamber with his nose hemorrhaging, while the women observe from behind covers and Mother rushes to him to dab his nose. It is still quite dim as the Szpilmans and about twenty others stand arrayed under illumination from German automobiles. An NCO makes a selection, using his firearm to prod individuals, and when he reaches the Szpilmans, he chooses Henryk and Halina. He then turns to fire at a young woman in the head, who collapses to the earth bleeding. The partition is drawn aside, and individuals, including the Szpilmans, are either dressing or packing their possessions. Shots, shrieks, and a shrill whistle are heard on a hot summer's day. Jews, including Szpilman, Mother, Regina, and Father, clutch their possessions and walk towards wooden barriers, where Jewish officers order them into line. They shuffle through the open barriers, pausing to absorb their surroundings. Individuals walk up and down; a young man murmurs to a woman who continues sobbing. Trucks arrive, unloading more Jews who are marched through the barriers. Mothers, children, and elderly people, most holding documents, plead as the sun scorches. Szpilman roams around, greeting individuals, while the area becomes crowded, and elderly people lie fatigued. Women with parched children move group to group; one approaches Szpilman, who shakes his head sorrowfully, and she wanders off. Ehrlich and Grun engage Father in discussion until Mother cries out and Regina and Szpilman call and wave to Henryk and Halina, who struggle through the throng. Halina falls into Mother’s arms and is comforted by her while Father smiles sadly and Szpilman gazes at Halina. The place becomes packed, with individuals calling names and women lamenting. The Szpilmans sit in the same spot, Henryk apart, perusing a small book. Grun leans towards Halina, who looks at him in disbelief as Szpilman takes Henryk’s book to read the title. The Szpilmans remain seated on the curb."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Szpilman retreats into the room with his nose bleeding, while the women are watched from behind blankets and his nose is hurriedly wiped by Mother. It is still quite dark as the Szpilmans and about twenty others are standing lined up under lights from German vehicles. A selection is made by an NCO, who uses his pistol to prod people, and when the Szpilmans are reached by him, Henryk and Halina are selected by him. A young woman is then turned to by him and is shot in the head, causing her to fall to the ground bleeding. The partition is pulled aside, and belongings are either dressed or packed by people, including the Szpilmans. Shots, screams, and a piercing whistle echo on a hot summer's day. Belongings are clutched by Jews, including Szpilman, Mother, Regina, and Father, as they walk towards wooden gates, where they are ordered into line by Jewish policemen. Through the opened gates, they shuffle, pausing to take in their surroundings. Up and down, people walk; to a woman who continues crying, a young man whispers. More Jews are unloaded as trucks arrive, and they march through the gates. Pleading is done by mothers, children, and old people, most holding papers, as the sun blazes. Szpilman wanders around, greeting people, while the area becomes crowded, and old people lie exhausted. Dehydrated children are moved with by women from group to group; Szpilman is approached by one, who shakes his head sadly, and she wanders off. Father is engaged in conversation by Ehrlich and Grun until Mother cries out and Henryk and Halina are called and waved to by Regina and Szpilman, who struggle through the crowd. Into Mother’s arms Halina falls and comforts her as Father smiles sadly and at Halina Szpilman stares. The place becomes packed, with names being called and women wailing. In the same place, the Szpilmans sit, with Henryk apart, reading a small book. Towards Halina, Grun leans, who looks at him in disbelief as Henryk’s book is taken by Szpilman to read the title. Seated on the curb, the Szpilmans remain."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Szpilman retreats with a bleeding nose as Mother rushes to help, while women watch. The Szpilmans and others line up under German vehicle lights in the dark. An NCO selectively prods with a pistol, choosing Henryk and Halina, then shoots a young woman, who falls. The partition opens, and people dress or pack. On a hot day, shots, screams, and whistles pierce the air. Jews, including Szpilman and family, clutch belongings and head to wooden gates, where Jewish policemen line them up. They shuffle in, taking in their surroundings. Trucks unload more Jews. Mothers, children, and the elderly, mostly with papers, plead under the blazing sun. Szpilman greets people as the area crowds; exhausted elders lie down. Women with dehydrated children wander; one speaks to Szpilman, who sadly shakes his head before she moves on. Ehrlich and Grun converse with Father until Mother cries out as Regina and Szpilman wave to struggling Henryk and Halina. Halina falls into Mother’s comforting embrace while Szpilman gazes. The crowded place echoes with names called and wails. The Szpilmans sit together, Henryk reading apart. Grun speaks to Halina incredulously, as Szpilman reads Henryk’s book title. They remain on the curb."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Szpilman retreats bleeding while women watch and Mother wipes his nose. In darkness, the Szpilmans and others stand under German vehicle lights. An NCO selects Henryk and Halina, then shoots a young woman. The partition is opened; people dress or pack. Shots and screams echo on a hot day. Jews, including Szpilman and his family, carry belongings to wooden gates, ordered by Jewish policemen into lines. They enter and pause, observing surroundings. Trucks unload more Jews; mothers, children, and elders plead, holding papers. Szpilman greets people in the crowded area, where old people lie exhausted. Dehydrated children move between groups; one mother approaches Szpilman, who shakes his head. Ehrlich and Grun speak to Father until Mother cries, and Regina and Szpilman wave to Henryk and Halina. Halina embraces Mother; Father smiles sadly, and Szpilman stares. The place fills with calls and wailing. The Szpilmans sit together, Henryk reads a book apart. Grun leans towards Halina; Szpilman reads Henryk’s book title. They remain seated on the curb."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Szpilman retreats into the dimly lit room with his nose bleeding, while the concerned women watch from behind the safety of their blankets and Mother hurries over to him with a sense of urgency to gently wipe his nose. Outside, it is still quite dark as the Szpilmans, along with about twenty other individuals, stand anxiously lined up under the harsh lights emanating from the German military vehicles. An authoritative NCO proceeds to make selections, using the intimidating barrel of his pistol to prod and direct people. When he finally reaches the Szpilmans, he coldly selects Henryk and Halina. Without hesitation, he then turns and shoots a young woman in the head, causing her to fall lifelessly to the ground, blood pooling beneath her. \n\nIn a flurry of activity, the partition is pulled aside, and people, including the Szpilmans, are either hurriedly dressing or frantically packing their belongings in preparation for what lies ahead. The atmosphere is filled with the echoes of gunshots, terrified screams, and a piercing whistle that cuts through the air on this oppressively hot summer's day. Jews, including Szpilman, his Mother, Regina, and Father, clutch their precious belongings tightly as they walk towards the imposing wooden gates, where Jewish policemen briskly order them into line. As they shuffle through the newly opened gates, they pause momentarily to take in their bleak surroundings. Numerous individuals walk back and forth in nervous anticipation; a young man quietly whispers to a woman who is already overcome with tears. \n\nTrucks methodically arrive, each unloading more Jews who are marched through the gates with little choice. Mothers, children, and elderly people, most of them holding important papers, plead desperately as the relentless sun blazes down upon them. Szpilman wanders aimlessly around the area, greeting familiar faces, while the crowd swells and older individuals lie on the ground, utterly exhausted. Women with dehydrated children move desperately from group to group, seeking assistance; one woman approaches Szpilman, who shakes his head sadly, unable to help, and she wanders off in despair. Meanwhile, Ehrlich and Grun engage Father in a deep conversation until Mother cries out in distress, prompting Regina and Szpilman to call and wave to Henryk and Halina, who are struggling to make their way through the dense crowd. Halina collapses into Mother’s arms, where she finds comfort as Father offers a sad smile and Szpilman gazes intently at Halina.\n\nThe place becomes increasingly packed, with people anxiously calling out names and women wailing in distress. The Szpilmans find a moment of respite as they sit together in the same spot, with Henryk sitting slightly apart, engrossed in reading a small book. Grun leans towards Halina, who looks at him with disbelief as Szpilman, curious, takes Henryk’s book to read the title. The Szpilmans remain seated on the curb, surrounded by the chaos and uncertainty that envelops them."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Szpilman, with his nose bleeding profusely, retreats into the dimly lit room where concerned women watch from a distance, peering out from the safety of their blankets. Mother, filled with a sense of urgency and care, hurries over to him to gently wipe his nose. Outside, the world remains cloaked in darkness as the Szpilmans, along with about twenty other anxious individuals, nervously stand lined up beneath the harsh, glaring lights that emanate from the imposing German military vehicles. An authoritative NCO, exuding an air of intimidation, proceeds to make selections, using the threatening barrel of his pistol to prod and direct the gathered people. When he finally reaches the Szpilmans, he makes his cold, emotionless selection of Henryk and Halina. With disconcerting decisiveness, he then turns and shoots a young woman in the head, her lifeless body collapsing to the ground with a pool of blood forming beneath her.\n\nIn the ensuing flurry of chaotic activity, the partition is drawn aside with urgency, and people, including the Szpilman family, are seen hurriedly dressing or frantically packing up their belongings in preparation for the uncertain circumstances that lie ahead. The atmosphere is charged with tension, filled with the dreadful echoes of gunshots, terrified screams, and the piercing sound of a whistle that cuts sharply through the stifling, oppressively hot summer's day. Jews, among them Szpilman, his Mother, Regina, and Father, clutch their precious belongings tightly, as if seeking solace, while they walk determinedly towards the imposing wooden gates. Here, Jewish policemen briskly and briskly order them into a line with mechanical efficiency. As they shuffle through the newly opened, imposing gates, they pause momentarily to absorb their bleak, dismal surroundings, filled with uncertainty. Numerous individuals walk back and forth, consumed with nervous anticipation; a young man quietly whispers comforting words to a woman who is already overcome with tears and despair.\n\nTrucks arrive in a methodical, relentless procession, each one unloading more Jews, who are marched unceremoniously through the gates with little choice in the matter. Mothers, children, and elderly people—most of whom are clutching important, life-defining papers—plead desperately under the relentless, punishing sun that blazes mercilessly down upon them. Szpilman wanders aimlessly around the congested area, greeting familiar, weary faces, while the throng swells around him and older individuals lie on the ground, utterly exhausted and defeated. Women with dehydrated children move desperately from group to group, seeking assistance; one woman approaches Szpilman, only for him to shake his head sadly, unable to help, prompting her to wander off in despair. Meanwhile, Ehrlich and Grun engage Father in deep, serious conversation until Mother cries out in distress, signaling Regina and Szpilman to call and wave frantically to Henryk and Halina, who are struggling to make their way through the unbearably dense crowd. Halina collapses into Mother's arms, where she seeks and finds comfort as Father offers a sad, sympathetic smile and Szpilman gazes intently at Halina, his expression thoughtful.\n\nThe place becomes increasingly packed and suffocating, with people anxiously calling out names and women wailing in distress. The Szpilmans manage to find a brief moment of respite as they sit together in one spot, with Henryk sitting slightly apart, deeply engrossed in reading a small book. Grun leans towards Halina, who looks at him with disbelief, as Szpilman, curious and intrigued, takes Henryk’s book to inspect and read the title. The Szpilmans remain seated on the edge of the curb, surrounded by the chaos, uncertainty, and despair that envelope them."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Szpilman moves backwards, entering the room as blood trickles from his nose, while several women observe from a distance, keeping warm under blankets. With urgency, Mother rushes to Szpilman, producing a cloth to gently dab at his nose, trying to stop the bleeding. The atmosphere remains dimly lit as Szpilman, his family, and about twenty other individuals stand aligned, illuminated by the bright, harsh lights of German vehicles parked nearby. A German NCO, in a methodical yet cruel manner, makes choices among the group, using the barrel of his pistol to nudge individuals forward. As he approaches the Szpilman family, he picks Henryk and Halina from their ranks. His attention then shifts abruptly as he raises his firearm with chilling precision, firing at a young woman’s head, her body collapsing as blood flows from the fatal wound. A hanging partition is forcefully drawn aside, revealing people, including the Szpilmans, scrambling to swiftly dress themselves or hastily pack their few belongings. The oppressive air is filled with the sharp crack of gunshots, the anguished screams of people, and the shrill, alarming blasts of a whistle, all under the relentless heat of a summer day. Jews, amongst them Szpilman, Mother, Regina, and Father, clutch their precious items close to their bodies, trudging reluctantly towards the imposing wooden gates. Here, Jewish policemen, faces stern, instruct them to form a line. They shuffle hesitantly through the gates that stand open, pausing momentarily to take in the grim reality of their situation. All around, people move back and forth along a set path; a young man leans closer to a woman, whispering softly as she continues to weep. Further trucks pull up, expelling more Jews who are briskly marched through the gates, adding to the swelling crowd. Mothers, their children clinging to them, and the elderly, many gripping important papers, raise their voices in pleading under the unforgiving sun's glare. Amidst this, Szpilman drifts through the crowd, nodding in acknowledgment to those he knows, as more people fill the already congested area, elderly individuals succumbing to fatigue, lying down, too weary to move. Mothers, their children suffering from dehydration, roam from group to group, seeking aid; one approaches Szpilman, who, with a look of regret and a gentle shake of his head, indicates he is unable to help, prompting her to continue her search elsewhere. Meanwhile, Ehrlich and Grun engage Father in a quiet conversation until Mother's voice rings out, full of emotion, as Regina and Szpilman loudly call out and wave, spotting Henryk and Halina struggling against the crowd's force. At last, Halina reaches Mother, collapsing into her arms, finding solace as Mother comforts her, Father offering a faint but sorrowful smile while Szpilman's gaze remains fixed on Halina. The area grows increasingly congested, with people shouting names, hoping to find loved ones, and the air is filled with the sound of women wailing. The Szpilman family remains seated in their spot on the sidewalk, with Henryk choosing to sit slightly apart, engrossed in a small book. Grun leans toward Halina, who looks at him with disbelief etched on her face, while Szpilman, curious, picks up Henryk's book to examine the title. Throughout, the Szpilmans hold their place on the curb, surrounded by the chaos and desperation engulfing them."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Szpilman retreats into the room with a bleeding nose, as Mother rushes to clean him while the women watch. In the dim light, the Szpilmans and about twenty others stand aligned under German vehicle lights, where an NCO selects Henryk and Halina by prodding them with his pistol and then turns to execute a young woman. Inside, people, including the Szpilmans, hastily dress or pack belongings amid sounds of gunshots, screams, and a whistle on a sweltering day. Jews, among them Szpilman and his family, clutch their belongings as they walk towards wooden gates and are ordered into line by Jewish policemen. As they pass through the gates, the chaotic scene unfolds with people moving around; a young man whispers to a crying woman, and arriving trucks unload more Jews. Mothers, children, and the elderly, mainly holding papers, plead under the scorching sun. Szpilman wanders amidst the growing crowd, exchanging greetings while exhausted elders lie down, and women, desperate for water, move among groups. A woman with a dehydrated child approaches Szpilman, who regretfully shakes his head. Ehrlich and Grun converse with Father until Mother calls out, and Regina and Szpilman wave to Henryk and Halina as they make their way through the throng. Halina reaches Mother’s arms, receiving comfort as Father looks on sadly and Szpilman gazes at her. The area becomes densely packed, filled with people searching for loved ones and women wailing. The Szpilmans sit together on the curb, with Henryk sitting apart, engrossed in a book. Grun speaks to Halina, who reacts with disbelief, while Szpilman checks the title of Henryk’s book, maintaining their position on the curb."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Szpilman retreats into the room with his nose bleeding, while the women, who have witnessed such chaos many times before in the tumultuous Warsaw Ghetto, watch from behind blankets and Mother hurries to him to wipe his nose. It is still quite dark as the Szpilmans and about twenty others stand lined up under harsh lights from German military vehicles, which frequently patrolled the area during this period. An NCO, a non-commissioned officer known for his ruthlessness, makes a selection, using his pistol to prod people, and when he reaches the Szpilmans, he selects Henryk and Halina. He then turns to shoot a young woman in the head, who falls to the ground bleeding, an act of brutality that was tragically common during the deportations. The partition is pulled aside in the dimly lit room, and people, including the Szpilmans, are either dressing or packing their belongings under immense pressure. Shots, screams, and a piercing whistle, the latter often used to signal chaos or control, are heard on a hot summer's day that seems to echo the merciless heat of the situation. Jews, including Szpilman, Mother, Regina, and Father, clutch their belongings and walk towards the imposing wooden gates of the Umschlagplatz, where Jewish policemen, who were often forced into roles by the occupying forces, order them into line. They shuffle through the opened gates, pausing to take in their surroundings with a sense of foreboding. People walk up and down; a young man whispers desperate reassurances to a woman who continues crying. Trucks arrive, unloading more Jews who are marched through the gates, a process used to transport people to concentration camps. Mothers, children, and old people, most holding papers that were supposed to determine their fate, plead as the sun blazes mercilessly down on them. Szpilman, known for his resilience, wanders around, greeting people, while the area becomes crowded, and old people lie exhausted from the heat and tension. Women with dehydrated children seek assistance from group to group; one approaches Szpilman, who shakes his head sadly, unable to offer help, and she wanders off in despair. Ehrlich and Grun, two acquaintances from the ghetto, engage Father in conversation until Mother cries out and Regina and Szpilman call and wave, trying to catch a glimpse of Henryk and Halina, who struggle through the crowd. Halina falls into Mother’s arms and is comforted by her while Father smiles sadly, a fleeting moment of family unity, and Szpilman stares at Halina, feeling the weight of the situation. The place becomes packed, with people calling names desperately and women wailing in distress. The Szpilmans sit in the same place, Henryk apart, absorbed in reading a small book, perhaps seeking solace in its words. Grun leans towards Halina, who looks at him in disbelief, perhaps unable to comprehend the normalcy of conversation amid the chaos, as Szpilman takes Henryk’s book to read the title. The Szpilmans remain seated on the curb, a small island of family solidarity in a sea of turmoil."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "They shuffle through the opened gates pausing to take in their surroundings The place becomes packed with people calling names and women wailing Szpilman retreats into the room with his nose bleeding while the women watch from behind blankets and Mother hurries to him to wipe his nose Halina falls into Mother’s arms and is comforted by her while Father smiles sadly and Szpilman stares at Halina People walk up and down It is still quite dark as the Szpilmans and about twenty others stand lined up under lights from German vehicles The Szpilmans remain seated on the curb An NCO makes a selection using his pistol to prod people and when he reaches the Szpilmans he selects Henryk and Halina Mothers children and old people most holding papers plead as the sun blazes An NCO makes a selection using his pistol to prod people and when he reaches the Szpilmans he selects Henryk and Halina He then turns to shoot a young woman in the head who falls to the ground bleeding The partition is pulled aside and people including the Szpilmans are either dressing or packing their belongings Shots screams and a piercing whistle are heard on a hot summer's day Jews including Szpilman Mother Regina and Father clutch their belongings and walk towards wooden gates where Jewish policemen order them into line They shuffle through the opened gates pausing to take in their surroundings People walk up and down a young man whispers to a woman who continues crying It is still quite dark as the Szpilmans and about twenty others stand lined up under lights from German vehicles Trucks arrive unloading more Jews who are marched through the gates Mothers children and old people most holding papers plead as the sun blazes Trucks arrive unloading more Jews who are marched through the gates Szpilman retreats into the room with his nose bleeding while the women watch from behind blankets and Mother hurries to him to wipe his nose Szpilman wanders around greeting people while the area becomes crowded and old people lie exhausted Women with dehydrated children move group to group one approaches Szpilman who shakes his head sadly and she wanders off Ehrlich and Grun engage Father in conversation until Mother cries out and Regina and Szpilman call and wave to Henryk and Halina who struggle through the crowd Halina falls into Mother’s arms and is comforted by her while Father smiles sadly and Szpilman stares at Halina He then turns to shoot a young woman in the head who falls to the ground bleeding The place becomes packed with people calling names and women wailing The Szpilmans sit in the same place Henryk apart reading a small book Grun leans towards Halina who looks at him in disbelief as Szpilman takes Henryk’s book to read the title The Szpilmans remain seated on the curb"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Szpilman retreats into the room with his nose bleeding while the women watch from behind blankets and Mother hurries to him to wipe his nose. It is still quite dark as the Szpilmans and about twenty others stand lined up under lights from German vehicles. An NCO makes a selection using his pistol to prod people and when he reaches the Szpilmans he selects Henryk and Halina. He then turns to shoot a young woman in the head who falls to the ground bleeding. The partition is pulled aside and people including the Szpilmans are either dressing or packing their belongings. Shots screams and a piercing whistle are heard on a hot summer's day. Jews including Szpilman Mother Regina and Father clutch their belongings and walk towards wooden gates where Jewish policemen order them into line. They shuffle through the opened gates pausing to take in their surroundings. People walk up and down. a young man whispers to a woman who continues crying. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Trucks arrive unloading more Jews who are marched through the gates. Mothers children and old people most holding papers plead as the sun blazes. Szpilman wanders around greeting people while the area becomes crowded and old people lie exhausted. Women with dehydrated children move group to group. one approaches Szpilman who shakes his head sadly and she wanders off. Ehrlich and Grun engage Father in conversation until Mother cries out and Regina and Szpilman call and wave to Henryk and Halina who struggle through the crowd. Halina falls into Mother’s arms and is comforted by her while Father smiles sadly and Szpilman stares at Halina. The place becomes packed with people calling names and women wailing. The Szpilmans sit in the same place Henryk apart reading a small book. Grun leans towards Halina who looks at him in disbelief as Szpilman takes Henryk’s book to read the title. The Szpilmans remain seated on the curb."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Szpilman retreats into the room with his nose bleeding while the women watch from behind blankets and Mother hurries to him to wipe his nose. It is still quite dark as the Szpilmans and about twenty others stand lined up under lights from German vehicles. An NCO makes a selection using his pistol to prod people and when he reaches the Szpilmans he selects Henryk and Halina. He then turns to shoot a young woman in the head who falls to the ground bleeding. The partition is pulled aside and people including the Szpilmans are either dressing or packing their belongings. Shots screams and a piercing whistle are heard on a hot summer's day. Jews including Szpilman Mother Regina and Father clutch their belongings and walk towards wooden gates where Jewish policemen order them into line. They shuffle through the opened gates pausing to take in their surroundings. People walk up and down. a young man whispers to a woman who continues crying. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Trucks arrive unloading more Jews who are marched through the gates. Mothers children and old people most holding papers plead as the sun blazes. Szpilman wanders around greeting people while the area becomes crowded and old people lie exhausted. Women with dehydrated children move group to group. one approaches Szpilman who shakes his head sadly and she wanders off. Ehrlich and Grun engage Father in conversation until Mother cries out and Regina and Szpilman call and wave to Henryk and Halina who struggle through the crowd. Halina falls into Mother’s arms and is comforted by her while Father smiles sadly and Szpilman stares at Halina. The place becomes packed with people calling names and women wailing. The Szpilmans sit in the same place Henryk apart reading a small book. Grun leans towards Halina who looks at him in disbelief as Szpilman takes Henryk’s book to read the title. The Szpilmans remain seated on the curb."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Szpilman retreats into the room with his nose bleeding while the women watch from behind blankets and Mother hurries to him to wipe his nose. It is still quite dark as the Szpilmans and about twenty others stand lined up under lights from German vehicles. An NCO makes a selection using his pistol to prod people and when he reaches the Szpilmans he selects Henryk and Halina. He then turns to shoot a young woman in the head who falls to the ground bleeding. The partition is pulled aside and people including the Szpilmans are either dressing or packing their belongings. Ehrlich and Grun engage Father in conversation until Mother cries out and Regina and Szpilman call and wave to Henryk and Halina who struggle through the crowd. Halina falls into Mother’s arms and is comforted by her while Father smiles sadly and Szpilman stares at Halina. The place becomes packed with people calling names and women wailing. The Szpilmans sit in the same place Henryk apart reading a small book. Grun leans towards Halina who looks at him in disbelief as Szpilman takes Henryk’s book to read the title. The Szpilmans remain seated on the curb."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Szpilman retreats into the room with his nose bleeding while the women watch from behind blankets and Mother hurries to him to wipe his nose. It is still quite dark as the Szpilmans and about twenty others stand lined up under lights from German vehicles. The Szpilmans sit in the same place Henryk apart reading a small book. Grun leans towards Halina who looks at him in disbelief as Szpilman takes Henryk’s book to read the title. The Szpilmans remain seated on the curb."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The squirrel retreats into the room with his nose bleeding, while the elephants watch from behind blankets and the giraffe hurries to him to wipe his nose. It is still quite dark as the squirrels and about twenty others stand lined up under lights from German vehicles. A rabbit makes a selection, using his pistol to prod people, and when he reaches the squirrels, he selects the fox and the penguin. He then turns to shoot a young llama in the head, who falls to the ground bleeding. The partition is pulled aside, and people, including the squirrels, are either dressing or packing their belongings. Shots, screams, and a piercing whistle are heard on a hot summer's day. Frogs, including the squirrel, the giraffe, the rabbit, and the zebra, clutch their belongings and walk towards wooden gates, where cheetah policemen order them into line. They shuffle through the opened gates, pausing to take in their surroundings. People walk up and down; a young owl whispers to a cat who continues crying. Trucks arrive, unloading more frogs who are marched through the gates. Lions, kittens, and old turtles, most holding papers, plead as the sun blazes. The squirrel wanders around, greeting people, while the area becomes crowded, and old turtles lie exhausted. Dolphins with dehydrated crickets move group to group; one approaches the squirrel, who shakes his head sadly, and she wanders off. The dolphin and the kangaroo engage the zebra in conversation until the giraffe cries out and the rabbit and the squirrel call and wave to the fox and the penguin, who struggle through the crowd. The penguin falls into the giraffe’s arms and is comforted by her while the zebra smiles sadly and the squirrel stares at the penguin. The place becomes packed, with people calling names and dolphins wailing. The squirrels sit in the same place, the fox apart, reading a small book. The kangaroo leans towards the penguin, who looks at him in disbelief as the squirrel takes the fox’s book to read the title. The squirrels remain seated on the curb."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Szpilman retreats into the cave with his nose bleeding, while the women watch from behind curtains and Mother hurries to him to wipe his nose. It is still quite dark as the Szpilmans and about twenty others stand lined up under lights from German motorcycles. An NCO makes a selection, using his sword to prod people, and when he reaches the Szpilmans, he selects Henryk and Halina. He then turns to shoot a young woman in the leg, who falls to the ground bleeding. The curtain is pulled aside, and people, including the Szpilmans, are either dressing or packing their knick-knacks. Shots, screams, and a piercing bell are heard on a hot summer's day. Jews, including Szpilman, Mother, Regina, and Father, clutch their knick-knacks and walk towards plastic fences, where Jewish policemen order them into line. They shuffle through the opened fences, pausing to take in their surroundings. People walk up and down; a young man whispers to a woman who continues crying. Wagons arrive, unloading more Jews who are marched through the fences. Mothers, children, and old people, most holding candles, plead as the sun blazes. Szpilman wanders around, greeting people, while the area becomes crowded, and old people lie exhausted. Women with thirsty kittens move group to group; one approaches Szpilman, who shakes his head sadly, and she wanders off. Ehrlich and Grun engage Father in conversation until Mother cries out and Regina and Szpilman call and wave to Henryk and Halina, who struggle through the crowd. Halina falls into Mother’s arms and is comforted by her while Father smiles sadly and Szpilman stares at Halina. The plaza becomes packed, with people calling names and women wailing. The Szpilmans sit in the same place, Henryk apart, reading a small magazine. Grun leans towards Halina, who looks at him in disbelief as Szpilman takes Henryk’s magazine to read the title. The Szpilmans remain seated on the step."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Szpilman tiptoes into the room with his nose tickling, while the women peek from behind blankets and Mother hustles to him to comb his hair. It is still quite dark as the Szpilmans and about twenty others sit stacked under lights from German vehicles. An NCO performs a count, using his pistol to point at people, and when he encounters the Szpilmans, he points to Henryk and Halina. He then turns to applaud a young woman in the head, who stumbles to the ground laughing. The partition is lifted aside, and people, including the Szpilmans, are either dancing or scattering their belongings. Music, laughter, and a gentle breeze are felt on a cool autumn day. Jews, including Szpilman, Mother, Regina, and Father, clutch their belongings and skip towards wooden gates, where Jewish policemen invite them into line. They glide through the opened gates, pausing to admire their surroundings. People run up and down; a young man hums to a woman who keeps smiling. Trucks leave, unloading more Jews who are cheered through the gates. Mothers, children, and old people, most waving papers, cheer as the moon rises. Szpilman hops around, high-fiving people, while the area empties, and old people stand invigorated. Women with exuberant children move group to group; one approaches Szpilman, who nods his head enthusiastically, and she skips off. Ehrlich and Grun entrust Father with secrets until Mother laughs out and Regina and Szpilman sing and dance to Henryk and Halina, who glide through the crowd. Halina jumps into Mother’s arms and is congratulated by her while Father claps happily and Szpilman glances at Halina. The place clears out, with people cheering names and women giggling. The Szpilmans nap in the same place, Henryk apart, reciting a small book. Grun whispers to Halina, who gazes at him in awe as Szpilman grabs Henryk’s book to memorize the title. The Szpilmans stay seated on the curb."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Bartholomew retreats into the aquarium with his elbow swelling, while the giraffes watch from behind curtains and Aunt hurries to him to dry his elbow. It is still quite dim as the Bartholomews and about twenty zebras stand lined up under lights from French bicycles. A conductor makes a selection, using his umbrella to prod penguins, and when he reaches the Bartholomews, he selects Nigel and Felicity. He then turns to shoot a small kangaroo in the tail, who falls to the carpet crying. The curtain is pulled aside, and clocks, including the Bartholomews, are either dressing or packing their teapots. Alarms, whispers, and a howling trumpet are heard on a chilly winter’s evening. Llamas, including Bartholomew, Aunt, Gertrude, and Uncle, clutch their teapots and walk towards marble arches, where Canadian astronauts order them into line. They shuffle through the closed arches, pausing to take in their surroundings. Flamingos walk up and down; a sleepy dolphin whispers to a puppy who continues singing. Bicycles arrive, unloading more llamas who are marched through the arches. Uncles, octopuses, and large canaries, most holding cages, plead as the moon blazes. Bartholomew wanders around, greeting clocks, while the ocean becomes crowded, and large canaries lie starving. Giraffes with tired puppies move planet to planet; one approaches Bartholomew, who shakes his head vigorously, and she wanders off. Einstein and Tesla engage Uncle in conversation until Aunt cries out and Gertrude and Bartholomew call and wave to Nigel and Felicity, who struggle through the jungle. Felicity falls into Aunt’s arms and is comforted by her while Uncle smiles cheerfully and Bartholomew stares at Felicity. The ocean becomes packed, with clocks calling names and giraffes laughing. The Bartholomews sit in the same place, Nigel apart, reading a small magazine. Tesla leans towards Felicity, who looks at him in confusion as Bartholomew takes Nigel’s magazine to read the title. The Bartholomews remain seated on the swing."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Jenkins sneaks into the garden with his arm injured, while the dogs watch from behind bushes and Cousin hurries to him to bandage his arm. It is still quite dark as the Jenkinses and about twenty others stand huddled under lights from police motorcycles. A sergeant makes a selection, using his flashlight to direct people, and when he reaches the Jenkinses, he selects Walter and Emma. He then turns to apprehend a young man by the shoulder, who collapses to the ground sobbing. The curtain is drawn aside, and people, including the Jenkinses, are either laughing or sorting their belongings. Footsteps, laughter, and a shrill trumpet are heard on a hot summer's day. Tourists, including Jenkins, Cousin, Linda, and Uncle, clutch their belongings and stroll towards wooden arches, where ushers guide them into line. They meander through the opened arches, pausing to study their surroundings. People stroll up and down; a young man whispers to a woman who continues laughing. Buses arrive, unloading more tourists who are ushered through the arches. Families, adolescents, and seniors, most holding cameras, chatter as the sun shines. Jenkins ambles around, waving to people, while the area becomes lively, and seniors lounge comfortably. Men with cheerful children move group to group; one approaches Jenkins, who nods encouragingly, and she skips off. Mulder and Scully engage Uncle in conversation until Cousin giggles and Linda and Jenkins call and wave to Walter and Emma, who weave through the crowd. Emma jumps into Cousin’s arms and is tickled by her while Uncle chuckles softly and Jenkins gazes at Emma. The place becomes lively, with people playing games and children laughing. The Jenkinses sit in the same spot, Walter apart, sketching a small picture. Scully leans towards Emma, who looks at him in confusion as Jenkins takes Walter’s picture to read the label. The Jenkinses remain seated on the bench."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Szpilman retreats into the tent with his ear itching, while the women watch from behind curtains and Mother rushes to him to pat his ear. It is still quite foggy as the Szpilmans and about twenty others stand huddled under lanterns from Swedish bicycles. An NCO makes a choice, using his umbrella to nudge people, and when he reaches the Szpilmans, he highlights Henryk and Halina. He then turns to toss a young woman into the pond, who sinks into the ground splashing. The curtain is pulled aside, and people, including the Szpilmans, are either singing or folding their laundry. Bells, laughter, and a distant siren are heard on a brisk autumn's evening. Explorers, including Szpilman, Mother, Regina, and Father, clutch their instruments and stroll towards iron arches, where forest rangers order them into squares. They drift through the opened arches, pausing to admire their surroundings. People jog up and down; a young man murmurs to a woman who continues giggling. Buses arrive, offloading more explorers who are guided through the arches. Farmers, musicians, and old sailors, most holding maps, cheer as the rain drizzles. Szpilman roams around, high-fiving people, while the space becomes noisy, and old sailors lie napping. Women with sleepy infants wander group to group; one approaches Szpilman, who nods vigorously, and she wanders off. Ehrlich and Grun engage Father in a game until Mother gasps and Regina and Szpilman beckon and clap to Henryk and Halina, who maneuver through the crowd. Halina collapses into Mother’s arms and is soothed by her while Father laughs softly and Szpilman gazes at Halina. The space becomes crammed, with people reciting poems and women dancing. The Szpilmans linger in the same spot, Henryk apart, sketching a small drawing. Grun leans towards Halina, who glances at him in wonder as Szpilman takes Henryk’s drawing to see the artwork. The Szpilmans remain perched on the fence."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Griffin strolls into the cave with his hat dripping, while the parrots sing from behind curtains and Aunt dashes to him to polish his boots. It is still quite foggy as the Griffins and about twenty dolphins stand gathered under lanterns from Italian bicycles. A librarian makes a decision, using his umbrella to nudge vegetables, and when he reaches the Griffins, he chooses Herman and Hannah. He then turns to tickle a young turtle in the shell, who rolls to the ground giggling. The curtain is pushed aside, and vegetables, including the Griffins, are either painting or juggling their instruments. Fireworks, giggles, and a loud drum are heard on a cold winter's night. Penguins, including Griffin, Aunt, Rachel, and Uncle, clutch their instruments and slide towards silver doors, where French chefs direct them into a circle. They skip through the closed doors, pausing to admire their reflections. Vegetables float up and down; a young mouse hums to a turtle who continues laughing. Balloons arrive, delivering more penguins who are hop-danced through the doors. Aunts, beetles, and tall owls, most waving kites, whisper as the moon twinkles. Griffin swims around, serenading vegetables, while the area becomes noisy, and tall owls nap humorously. Parrots with sleepy kittens hop dance group to group; one approaches Griffin, who nods brightly, and she hop-dances away. Edwin and Peter bounce Uncle in conversation until Aunt giggles loudly and Rachel and Griffin call and sing to Herman and Hannah, who waltz through the garden. Hannah tumbles into Aunt's arms and is tickled by her while Uncle giggles brightly and Griffin hums at Hannah. The garden becomes silent, with vegetables humming tunes and parrots clapping. The Griffins nap in the boat, Herman afar, painting a large kite. Peter tips towards Hannah, who stares at him in amusement as Griffin grabs Herman’s kite to admire the illustrations. The Griffins remain relaxed on the dock."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Szpilman retreats with a bleeding nose as his family watches, and Mother rushes to help him. In dim light, the Szpilmans and others stand under German vehicle lights. An NCO selects Henryk and Halina with his pistol and shoots a young woman. People dress and pack belongings amid shots, screams, and whistles. Jews, including Szpilman and his family, carry belongings towards gates overseen by Jewish policemen. They pause to absorb their surroundings as trucks unload more Jews. Exhausted people, mothers with children, and pleading elders fill the area. Szpilman greets others, and women search for help. Ehrlich and Grun speak with Father until Mother calls out, and Regina and Szpilman wave to Henryk and Halina. They reunite with embraces as Szpilman observes. The crowded scene is filled with cries and families reuniting, as the Szpilmans settle on the curb, with Henryk reading apart. Grun speaks with Halina while Szpilman examines Henryk's book, and the family waits together."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The Szpilmans remain seated on the curb Grun leans towards Halina who looks at him in disbelief as Szpilman takes Henryk’s book to read the title The Szpilmans sit in the same place Henryk apart reading a small book The place becomes packed with people calling names and women wailing Halina falls into Mother’s arms and is comforted by her while Father smiles sadly and Szpilman stares at Halina Ehrlich and Grun engage Father in conversation until Mother cries out and Regina and Szpilman call and wave to Henryk and Halina who struggle through the crowd one approaches Szpilman who shakes his head sadly and she wanders off Women with dehydrated children move group to group Szpilman wanders around greeting people while the area becomes crowded and old people lie exhausted Mothers children and old people most holding papers plead as the sun blazes Trucks arrive unloading more Jews who are marched through the gates a young man whispers to a woman who continues crying People walk up and down They shuffle through the opened gates pausing to take in their surroundings Jews including Szpilman Mother Regina and Father clutch their belongings and walk towards wooden gates where Jewish policemen order them into line Shots screams and a piercing whistle are heard on a hot summer's day The partition is pulled aside and people including the Szpilmans are either dressing or packing their belongings He then turns to shoot a young woman in the head who falls to the ground bleeding An NCO makes a selection using his pistol to prod people and when he reaches the Szpilmans he selects Henryk and Halina It is still quite dark as the Szpilmans and about twenty others stand lined up under lights from German vehicles Szpilman retreats into the room with his nose bleeding while the women watch from behind blankets and Mother hurries to him to wipe his nose"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Grun leans towards Halina who looks at him in disbelief as Szpilman takes Henryk’s book to read the title Shots screams and a piercing whistle are heard on a hot summer's day one approaches Szpilman who shakes his head sadly and she wanders off The partition is pulled aside and people including the Szpilmans are either dressing or packing their belongings a young man whispers to a woman who continues crying Women with dehydrated children move group to group Ehrlich and Grun engage Father in conversation until Mother cries out and Regina and Szpilman call and wave to Henryk and Halina who struggle through the crowd The Szpilmans sit in the same place Henryk apart reading a small book Jews including Szpilman Mother Regina and Father clutch their belongings and walk towards wooden gates where Jewish policemen order them into line Szpilman wanders around greeting people while the area becomes crowded and old people lie exhausted The place becomes packed with people calling names and women wailing Trucks arrive unloading more Jews who are marched through the gates It is still quite dark as the Szpilmans and about twenty others stand lined up under lights from German vehicles Mothers children and old people most holding papers plead as the sun blazes An NCO makes a selection using his pistol to prod people and when he reaches the Szpilmans he selects Henryk and Halina Halina falls into Mother’s arms and is comforted by her while Father smiles sadly and Szpilman stares at Halina They shuffle through the opened gates pausing to take in their surroundings People walk up and down Szpilman retreats into the room with his nose bleeding while the women watch from behind blankets and Mother hurries to him to wipe his nose He then turns to shoot a young woman in the head who falls to the ground bleeding The Szpilmans remain seated on the curb"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Mothers children and old people most holding papers plead as the sun blazes Szpilman wanders around greeting people while the area becomes crowded and old people lie exhausted Women with dehydrated children move group to group one approaches Szpilman who shakes his head sadly and she wanders off Ehrlich and Grun engage Father in conversation until Mother cries out and Regina and Szpilman call and wave to Henryk and Halina who struggle through the crowd Halina falls into Mother’s arms and is comforted by her while Father smiles sadly and Szpilman stares at Halina The place becomes packed with people calling names and women wailing The Szpilmans sit in the same place Henryk apart reading a small book Grun leans towards Halina who looks at him in disbelief as Szpilman takes Henryk’s book to read the title The Szpilmans remain seated on the curb Szpilman retreats into the room with his nose bleeding while the women watch from behind blankets and Mother hurries to him to wipe his nose It is still quite dark as the Szpilmans and about twenty others stand lined up under lights from German vehicles An NCO makes a selection using his pistol to prod people and when he reaches the Szpilmans he selects Henryk and Halina He then turns to shoot a young woman in the head who falls to the ground bleeding The partition is pulled aside and people including the Szpilmans are either dressing or packing their belongings Shots screams and a piercing whistle are heard on a hot summer's day Jews including Szpilman Mother Regina and Father clutch their belongings and walk towards wooden gates where Jewish policemen order them into line They shuffle through the opened gates pausing to take in their surroundings People walk up and down a young man whispers to a woman who continues crying Trucks arrive unloading more Jews who are marched through the gates"
        }
      ]
    }
  ]
}