{
  "ground_truth": "Their attention is caught by a boy who has a box of sweets on a string around his neck, and he's selling the sweets, pocketing money. Father calls to the Sweet Boy and beckons him over. They search their pockets and handbags, handing over to Father what change they can find, and he, in turn, hands the money to the Sweet Boy, who hands over one caramel and goes on his way. Then, Father carefully takes out his penknife and with great care divides the caramel into six parts and hands a part to each of the family. They all exchange a look, an acknowledgment of each other, almost like a toast, and then they chew, slowly, deliberately. The whistle of a locomotive and the sound of trucks rattling over the rails prompt a sound of great agitation from the Jews in the compound. The locomotive pulling cattle and goods trucks comes into sight, rolling slowly towards the boundary of the Umschlagplatz and coming to a halt, with a cordon of Jewish policemen and SS guards. Among the great throng of people, the Szpilmans trudge towards the train, Szpilman and Halina walking. A Jewish policeman grabs Szpilman by his collar and pulls him back out of the police cordon as the rest of the family reaches the next truck to be filled. A scuffle ensues as Szpilman tries to resist, another Jewish policeman shoves him, and Szpilman stumbles, falling to the ground in front of the closed ranks of the Jewish policemen's backs. He stands, runs at the cordon, seeing between their heads and shoulders Mother, Regina, Henryk, and Halina clambering into the trucks. Father is looking around, bewildered, and when he sees Szpilman, he takes a step towards him but stops, smiling helplessly. Father raises his hand and waves, then turns and goes towards the trucks. Again, Szpilman flings himself at the policemen's shoulders, and Heller turns on him. Szpilman stands for a moment, confused, terrified, then he turns and starts to run. Szpilman drops to walking pace, makes for the gates, where workers are pushing carts piled with the bloated corpses that lay against the wall. Szpilman falls in with them, and they pass through the gates. The doors of the trucks are closed as the train begins to move. Szpilman catches his breath by a building while an SS man and Jewish policeman emerge. The Jewish policeman is servile, crawling to the German, and he points to the train as they laugh and walk away. Szpilman turns and stumbles down the empty street, beginning to weep loud, agonized sobs as he staggers on, lost, empty, and aimless, trying to catch his breath in the aftermath of his tears. He wanders forlornly down the street, passing empty buildings with their doors open and windows smashed.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Their focus is captured by a lad who possesses a container of candies on a cord around his neck, and he's vending the candies, pocketing cash. Father calls to the Candy Boy and gestures him over. They search their pouches and purses, handing over to Father what coins they can locate, and he, in turn, passes the cash to the Candy Boy, who hands over one toffee and goes on his way. Then, Father meticulously takes out his penknife and with great care divides the toffee into six portions and hands a portion to each of the relatives. They all exchange a glance, an acknowledgment of one another, almost like a toast, and then they chew, slowly, intentionally. The whistle of a train and the noise of vehicles rattling over the rails trigger a sound of great distress from the Jews in the enclosure. The train hauling livestock and merchandise vehicles comes into view, rolling slowly towards the boundary of the Umschlagplatz and coming to a stop, with a cordon of Jewish constables and SS sentinels. Among the great multitude of people, the Szpilmans shuffle towards the train, Szpilman and Halina walking. A Jewish constable grabs Szpilman by his collar and pulls him back out of the police cordon as the rest of the kin reaches the next vehicle to be filled. A skirmish ensues as Szpilman tries to oppose, another Jewish constable shoves him, and Szpilman stumbles, falling to the earth in front of the sealed ranks of the Jewish constables' backs. He stands, runs at the cordon, seeing between their heads and shoulders Mother, Regina, Henryk, and Halina climbing into the vehicles. Father is glancing around, confused, and when he sees Szpilman, he takes a step towards him but halts, smiling helplessly. Father raises his hand and waves, then turns and goes towards the vehicles. Again, Szpilman flings himself at the constables' shoulders, and Heller turns on him. Szpilman stands for a moment, perplexed, frightened, then he turns and starts to flee. Szpilman drops to walking pace, heads for the gates, where laborers are pushing carts laden with the swollen cadavers that rest against the barrier. Szpilman joins them, and they pass through the gates. The doors of the vehicles are closed as the train commences to move. Szpilman catches his breath by a structure while an SS man and Jewish constable appear. The Jewish constable is servile, crawling to the German, and he points to the train as they chuckle and walk away. Szpilman turns and stumbles down the vacant street, beginning to sob loudly, agonized cries as he staggers on, lost, empty, and aimless, attempting to catch his breath in the aftermath of his weeping. He wanders desolately down the street, passing deserted structures with their doors open and windows shattered."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A boy with a box of sweets on a string around his neck catches their attention, and the sweets are being sold by him as he pockets the money. The Sweet Boy is called over by Father. Pockets and handbags are searched by them, change is handed over to Father, who in turn gives the money to the Sweet Boy. A caramel is handed over by the Sweet Boy, who goes on his way. Then, a penknife is carefully taken out by Father, and with great care, the caramel is divided into six parts and a part is handed to each member of the family. A look is exchanged by them all, an acknowledgment of each other, almost like a toast, and then the caramel is chewed, slowly, deliberately. A sound of great agitation is prompted from the Jews in the compound by the whistle of a locomotive and the sound of trucks rattling over the rails. The locomotive, pulling cattle and goods trucks, comes into sight, rolling slowly towards the boundary of the Umschlagplatz and halting with a cordon of Jewish policemen and SS guards. The Szpilmans, among the great throng of people, trudge towards the train, with Szpilman and Halina walking. Szpilman is grabbed by a Jewish policeman by his collar and is pulled back out of the police cordon as the next truck is reached by the rest of the family to be filled. A scuffle ensues as Szpilman tries to resist, another Jewish policeman shoves him, and Szpilman stumbles, falling to the ground in front of the closed ranks of the Jewish policemen's backs. He stands, runs at the cordon, seeing between their heads and shoulders Mother, Regina, Henryk, and Halina clambering into the trucks. Szpilman is seen by Father, who takes a step towards him but stops, smiling helplessly. A hand is raised and a wave is given by Father, then he turns and goes towards the trucks. Again, Szpilman flings himself at the policemen's shoulders, and Heller turns on him. Szpilman stands for a moment, confused, terrified, then he turns and starts to run. Walking pace is dropped to by Szpilman, and he makes for the gates, where carts piled with the bloated corpses that lay against the wall are pushed by workers. He falls in with them, and the gates are passed through by them. The doors of the trucks are closed as the train begins to move. Szpilman catches his breath by a building while an SS man and Jewish policeman emerge. The German is crawled to by the Jewish policeman, who is servile, and the train is pointed to by him as laughter is shared and they walk away. Szpilman turns and stumbles down the empty street, beginning to weep loud, agonized sobs as on, lost, empty, and aimless, he staggers, trying to catch his breath in the aftermath of his tears. Forlornly, he wanders down the street, passing empty buildings with their doors open and windows smashed."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A boy with a stringed box of sweets catches their attention, selling candies and pocketing money. Father calls him over, collects change from them, and buys a caramel. He uses a penknife to divide it into six pieces, distributing them among the family. They acknowledge each other and chew slowly. A locomotive's whistle causes a stir among the Jews in the compound as it approaches the Umschlagplatz, stopping with Jewish policemen and SS guards. Amid the crowd, the Szpilmans head toward the train, but a Jewish policeman pulls Szpilman back. During the scuffle, Szpilman sees his family board the trucks. Father, bewildered, sees Szpilman and waves before boarding. Szpilman tries to reach them, but Heller stops him, and he starts running. He joins workers pushing carts with corpses through the gates as the train moves. Catching his breath by a building, Szpilman sees an SS man and servile Jewish policeman laughing at the departing train. Stumbling down the empty street, Szpilman weeps, feeling lost and aimless, passing open doors and smashed windows."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Their attention is drawn to a boy with a box of sweets on a string around his neck, selling them for money. Father calls him over and, after collecting change from the family, buys a caramel, which he divides into six parts. They acknowledge each other like a toast, then chew slowly. A locomotive whistle and trucks rattling over rails cause agitation among the Jews. A train arrives at the Umschlagplatz, guarded by Jewish policemen and SS guards. The Szpilmans move towards it when a Jewish policeman pulls Szpilman back from the cordon as the family reaches a truck. Szpilman struggles and falls, then stands, seeing his family boarding. Father waves helplessly as Szpilman makes another attempt but retreats, terrified, and follows workers with carts piled with corpses through the gates. As the truck doors close, Szpilman catches his breath near a building where a Jewish policeman and SS man laugh and point at the train. Szpilman stumbles down the street, sobbing and lost, passing empty, shattered buildings."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Their attention is irresistibly drawn to a boy who is carrying a box of sweets strung around his neck, and he is earnestly engaged in selling these sweets, diligently pocketing any money he receives. The Father calls out with a commanding tone to the Sweet Boy, signaling for him to come over. The family members begin to rummage through their pockets and handbags, offering to Father whatever loose change they can manage to find, and he, in a gesture of exchange, hands this money over to the Sweet Boy. In return, the Sweet Boy hands over a single caramel and then continues on his way. With great care and meticulous attention, Father takes out his trusty penknife and carefully divides the caramel into six equal parts, distributing a piece to each family member. They exchange knowing glances, a silent acknowledgment of one another, almost resembling a toast in their unity, and then begin to chew slowly and deliberately. Suddenly, the piercing whistle of a locomotive and the clattering sound of trucks rolling over the rails cause a wave of intense agitation to ripple through the Jews assembled in the compound. The locomotive, which is pulling a series of cattle and goods trucks, slowly comes into view, making its way toward the boundary of the Umschlagplatz before coming to a halt, encompassed by a cordon of Jewish policemen and SS guards. Amidst the vast throng of people, the Szpilman family trudges towards the waiting train, Szpilman and Halina walking side by side. Suddenly, a Jewish policeman grabs Szpilman by the collar and yanks him back out of the police cordon, while the rest of his family reaches the next truck to be filled. A scuffle breaks out as Szpilman tries desperately to resist, another Jewish policeman forcefully shoves him, causing Szpilman to stumble and fall to the ground in front of the tightly closed ranks of the Jewish policemen’s backs. He gets up, runs fiercely at the cordon, catching glimpses between their heads and shoulders of Mother, Regina, Henryk, and Halina clambering into the trucks. Father, looking around in bewilderment, catches sight of Szpilman, takes a step towards him but then pauses, a helpless smile on his face. Father raises his hand in a farewell wave, then turns and heads towards the trucks. Once more, Szpilman hurls himself against the policemen's shoulders, and Heller turns on him with aggression. Szpilman stands there momentarily, paralyzed by confusion and terror, then turns and begins to run. His sprint slows to a walking pace as he makes his way towards the gates, where workers are pushing carts laden with the bloated corpses that lie against the wall. Szpilman blends in with them, and together they pass through the gates. As the doors of the trucks are firmly closed, the train starts to move away. Szpilman catches his breath beside a building, where an SS man and a deferential Jewish policeman emerge. The Jewish policeman fawns, almost crawling to the German, and points towards the train as they share a laugh and walk away. Szpilman turns and stumbles down the desolate street, beginning to weep with loud, heart-wrenching sobs, staggering forward, feeling lost, hollow, and aimless, trying to regain his breath in the wake of his tears. He wanders down the forlorn street, passing by abandoned buildings with their doors left ajar and windows shattered."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Their attention is irresistibly lured to a young boy who is diligently carrying a box of sweets, which he has cleverly strung around his neck. The boy is earnestly engaged in selling these delightful confections and is carefully pocketing every bit of money he receives from the transactions. The Father, in a tone that is both commanding and authoritative, calls out loudly to the Sweet Boy, signaling with a gesture for him to approach. The family members immediately begin to rummage frantically through their pockets and handbags, offering Father whatever bits of loose change they are able to find. In an act of exchange, Father hands this gathered money over to the Sweet Boy, who in return graciously hands over a single caramel, before continuing on his way to find more customers. With great care and meticulous attention, Father produces his trusty penknife and proceeds to carefully slice the caramel into six equal portions, distributing a piece to each family member. They exchange knowing glances, which serve as a silent acknowledgment of unity, almost resembling a ceremonious toast, and begin to chew the small morsels slowly and deliberately. Suddenly, the piercing sound of a steam locomotive's whistle and the clattering noise of numerous trucks rolling over the rails cause a powerful and intense wave of agitation to ripple through the Jews who are gathered within the compound. The locomotive, which is methodically hauling a long line of cattle and goods trucks, slowly comes into view, making its way toward the boundary of the Umschlagplatz before coming to a stop, where it is surrounded by a cordon of Jewish policemen and stern SS guards. Amidst the vast throng of people, the Szpilman family trudges forward toward the waiting train, with Szpilman and Halina walking side by side, their expressions resigned yet determined. In a sudden turn of events, a Jewish policeman seizes Szpilman by the collar and yanks him backwards, out of the protective police cordon, while the rest of his family continues toward the next truck that awaits to be filled. A scuffle ensues as Szpilman desperately attempts to resist, but another Jewish policeman forcefully shoves him, causing Szpilman to stumble and fall to the ground in front of the tightly closed ranks of the Jewish policemen’s backs. Rallying himself, he gets up and runs at the cordon with fierce determination, catching glimpses through the small gaps between their heads and shoulders of his Mother, Regina, Henryk, and Halina climbing into the crowded trucks. Father, appearing confused and bewildered, catches sight of Szpilman, takes a tentative step toward him, but then falters, a helpless, forlorn smile on his face. Father raises his hand in a farewell wave, an expression of resignation, and then turns to head towards the trucks. Once again, Szpilman throws himself against the intimidating barricade of the policemen's shoulders, and Heller, one of the policemen, turns on him with unbridled aggression. Szpilman stands there, momentarily frozen by a combination of confusion and sheer terror, before turning to run. His frenzied sprint gradually slows to a weary walk as he makes his way toward the gates, where workers are solemnly pushing carts laden with grotesquely bloated corpses that are lying against the wall. Szpilman seamlessly blends in with them, and together, they manage to pass through the gates. As the doors of the trucks are firmly sealed shut, the train begins to slowly move away, taking with it its grim cargo. Szpilman leans against a nearby building to catch his breath, where he watches as an SS man and a deferential Jewish policeman emerge. The Jewish policeman fawns obsequiously, almost crawling to the German, and points towards the retreating train as they share a laugh and walk away. Overwhelmed by emotion, Szpilman turns and stumbles down the desolate street, beginning to weep with loud, heart-wrenching sobs, staggering forward with a sense of deep loss, emptiness, and aimlessness, trying to regain his breath amidst his tears. He wanders down the forlorn street, passing by buildings that have been abandoned, their doors left ajar and windows shattered, echoing the desolation within his heart."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As their attention shifts to a boy with a box of sweets dangling from a string around his neck, they notice he's selling the sweets and slipping the collected money into his pockets. The father calls out to the Sweet Boy, signaling him to come over. As the boy approaches, they rummage through their pockets and handbags, pooling whatever spare change they can find and handing it to the father. He then exchanges the money with the Sweet Boy, who in return gives him one caramel before continuing on his way. The father then carefully retrieves his penknife from his pocket and, with meticulous precision, slices the caramel into six equal parts, distributing a piece to each family member. They share a collective glance, a silent acknowledgment of their connection, similar to making a toast, before slowly and deliberately chewing their small share of the caramel. Suddenly, the shrill whistle of a locomotive and the clattering noise of trucks passing over railway tracks cause a wave of agitation to ripple through the Jews gathered in the compound. The locomotive, pulling numerous cattle and goods trucks, gradually appears, making its way toward the edge of the Umschlagplatz before coming to a stop, guarded by a line of Jewish policemen and SS guards. Amidst the dense crowd, the Szpilmans begin their march toward the train, with Szpilman and Halina walking side by side. A Jewish policeman unexpectedly seizes Szpilman by the collar, yanking him out of the police line as the rest of his family reaches the truck that is being loaded. As a struggle ensues, Szpilman tries to fight back, but another Jewish policeman shoves him, causing him to stumble and fall to the ground, right in front of the tightly packed line of Jewish policemen. Struggling to his feet, Szpilman dashes towards the cordon once more, catching glimpses between the heads and shoulders of his family—Mother, Regina, Henryk, and Halina—climbing into the trucks. As he spots his father, the older man appears bewildered and hesitantly takes a step in Szpilman's direction but then stops, offering a helpless smile and a wave before turning to join the rest of the family heading towards the trucks. Undeterred, Szpilman hurls himself against the policemen's shoulders yet again, only to be confronted by Heller. For a brief moment, Szpilman stands there, engulfed in confusion and fear before he turns and breaks into a run. As fatigue sets in, Szpilman slows to a walk, making his way towards the gates where workers struggle with carts laden with the bloated bodies that have accumulated against the wall. He seamlessly joins their ranks, and together they pass through the gates. Behind them, the doors of the trucks clang shut as the train starts to move. Finding refuge behind a building, Szpilman gasps for air while observing an SS officer and a Jewish policeman exit the building. The Jewish policeman, in a subservient manner, gestures toward the train as they share a laugh and move on. Szpilman turns away, staggering down the deserted street, his sorrow erupting into loud, heart-wrenching sobs. He continues his aimless journey, burdened by a sense of loss and emptiness, struggling to regain his breath amidst the remnants of his tears. As he wanders down the forlorn street, he passes by empty buildings, their doors ajar, and windows shattered, remnants of a life once familiar now left behind."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Their attention is drawn to a boy selling sweets from a box around his neck. Father calls him over, collects change from the family, pays the boy, and receives one caramel. Father carefully divides the caramel into six parts, distributing to each family member, and they acknowledge each other with meaningful looks before chewing slowly. The sound of a locomotive and trucks over rails stirs agitation among the Jews in the compound. A train, escorted by Jewish policemen and SS guards, approaches the Umschlagplatz. Amidst the crowd, the Szpilmans move toward the train. A Jewish policeman pulls Szpilman back from the cordon as his family boards the next truck. Despite his resistance, Szpilman is shoved to the ground, watching helplessly as his family climbs into the trucks. Father sees Szpilman, acknowledges him with a helpless smile and wave before turning toward the trucks. Szpilman tries again to reach his family but is stopped. Distraught, he turns to run, blending in with workers pushing carts of corpses through the gates as the train departs. Catching his breath by a building, Szpilman observes a servile Jewish policeman and an SS man, laughing as they point to the train and walk away. Overcome with grief, Szpilman stumbles down an empty street, weeping loudly, lost and aimless, as he passes by broken, desolate buildings."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Their attention is caught by a boy, an enterprising young vendor in the bustling streets of Warsaw's Jewish Ghetto during World War II, who has a box of sweets on a string around his neck, and he's selling the sweets, pocketing money. Father calls to the Sweet Boy and beckons him over. They search their pockets and handbags, handing over to Father what change they can find, and he, in turn, hands the money to the Sweet Boy, who hands over one caramel, a rare treat in these times of scarcity, and goes on his way. Then, Father carefully takes out his penknife, an old tool he has kept through years of hardship, and with great care divides the caramel into six parts and hands a part to each of the family. They all exchange a look, an acknowledgment of each other, almost like a toast, and then they chew, slowly, deliberately. \n\nThe whistle of a locomotive, an ominous signal of transportation to the unknown, and the sound of trucks rattling over the rails prompt a sound of great agitation from the Jews in the compound. The locomotive pulling cattle and goods trucks, typically used for deporting Jews to concentration camps, comes into sight, rolling slowly towards the boundary of the Umschlagplatz, a holding area in Warsaw where Jews were gathered before deportation, and coming to a halt, with a cordon of Jewish policemen and SS guards, enforcing Nazi orders under duress. Among the great throng of people, the Szpilmans trudge towards the train, Szpilman and Halina walking. A Jewish policeman grabs Szpilman by his collar and pulls him back out of the police cordon as the rest of the family reaches the next truck to be filled. A scuffle ensues as Szpilman tries to resist, another Jewish policeman shoves him, and Szpilman stumbles, falling to the ground in front of the closed ranks of the Jewish policemen's backs. He stands, runs at the cordon, seeing between their heads and shoulders Mother, Regina, Henryk, and Halina clambering into the trucks. Father is looking around, bewildered, and when he sees Szpilman, he takes a step towards him but stops, smiling helplessly, aware of the grim reality they face. Father raises his hand and waves, then turns and goes towards the trucks. Again, Szpilman flings himself at the policemen's shoulders, and Heller, one of the more harsh enforcers among the Jewish police, turns on him. Szpilman stands for a moment, confused, terrified, then he turns and starts to run.\n\nSzpilman drops to walking pace, makes for the gates, where workers, forced laborers from the Ghetto, are pushing carts piled with the bloated corpses that lay against the wall, remnants of those who had succumbed to starvation and disease. Szpilman falls in with them, and they pass through the gates. The doors of the trucks are closed as the train begins to move, carrying its human cargo to a tragic fate. Szpilman catches his breath by a building, a crumbling shell of what once might have been a family home, while an SS man and Jewish policeman emerge. The Jewish policeman is servile, crawling to the German, an act of desperation and self-preservation, and he points to the train as they laugh and walk away. Szpilman turns and stumbles down the empty street, beginning to weep loud, agonized sobs as he staggers on, lost, empty, and aimless, trying to catch his breath in the aftermath of his tears. He wanders forlornly down the street, passing empty buildings with their doors open and windows smashed, a haunting testament to the destruction that war and hatred have wrought."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Their attention is caught by a boy who has a box of sweets on a string around his neck and he is selling the sweets pocketing money. Father calls to the Sweet Boy and beckons him over. They search their pockets and handbags handing over to Father what change they can find and he in turn hands the money to the Sweet Boy who hands over one caramel and goes on his way. Then Father carefully takes out his penknife and with great care divides the caramel into six parts and hands a part to each of the family. They all exchange a look an acknowledgment of each other almost like a toast and then they chew slowly deliberately. The whistle of a locomotive and the sound of trucks rattling over the rails prompt a sound of great agitation from the Jews in the compound. The locomotive pulling cattle and goods trucks comes into sight rolling slowly towards the boundary of the Umschlagplatz and coming to a halt with a cordon of Jewish policemen and SS guards. Among the great throng of people the Szpilmans trudge towards the train. Szpilman and Halina walking. A Jewish policeman grabs Szpilman by his collar and pulls him back out of the police cordon as the rest of the family reaches the next truck to be filled. A scuffle ensues as Szpilman tries to resist. another Jewish policeman shoves him and Szpilman stumbles falling to the ground in front of the closed ranks of the Jewish policemen's backs. He stands runs at the cordon seeing between their heads and shoulders. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Mother Regina Henryk and Halina clambering into the trucks. Father is looking around bewildered and when he sees Szpilman he takes a step towards him but stops smiling helplessly. Father raises his hand and waves then turns and goes towards the trucks. Again Szpilman flings himself at the policemen's shoulders and Heller turns on him. Szpilman stands for a moment confused terrified. then he turns and starts to run. Szpilman drops to walking pace makes for the gates where workers are pushing carts piled with the bloated corpses that lay against the wall. Szpilman falls in with them and they pass through the gates. The doors of the trucks are closed as the train begins to move. Szpilman catches his breath by a building while an SS man and Jewish policeman emerge. The Jewish policeman is servile crawling to the German and he points to the train as they laugh and walk away. Szpilman turns and stumbles down the empty street beginning to weep loud agonized sobs as he staggers on lost empty and aimless trying to catch his breath in the aftermath of his tears. He wanders forlornly down the street passing empty buildings with their doors open and windows smashed."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Their attention is caught by a boy who has a box of sweets on a string around his neck and he is selling the sweets pocketing money. Father calls to the Sweet Boy and beckons him over. They search their pockets and handbags handing over to Father what change they can find and he in turn hands the money to the Sweet Boy who hands over one caramel and goes on his way. Then Father carefully takes out his penknife and with great care divides the caramel into six parts and hands a part to each of the family. They all exchange a look an acknowledgment of each other almost like a toast and then they chew slowly deliberately. The whistle of a locomotive and the sound of trucks rattling over the rails prompt a sound of great agitation from the Jews in the compound. The locomotive pulling cattle and goods trucks comes into sight rolling slowly towards the boundary of the Umschlagplatz and coming to a halt with a cordon of Jewish policemen and SS guards. Among the great throng of people the Szpilmans trudge towards the train. Szpilman and Halina walking. A Jewish policeman grabs Szpilman by his collar and pulls him back out of the police cordon as the rest of the family reaches the next truck to be filled. A scuffle ensues as Szpilman tries to resist. another Jewish policeman shoves him and Szpilman stumbles falling to the ground in front of the closed ranks of the Jewish policemen's backs. He stands runs at the cordon seeing between their heads and shoulders. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Mother Regina Henryk and Halina clambering into the trucks. Father is looking around bewildered and when he sees Szpilman he takes a step towards him but stops smiling helplessly. Father raises his hand and waves then turns and goes towards the trucks. Again Szpilman flings himself at the policemen's shoulders and Heller turns on him. Szpilman stands for a moment confused terrified. then he turns and starts to run. Szpilman drops to walking pace makes for the gates where workers are pushing carts piled with the bloated corpses that lay against the wall. Szpilman falls in with them and they pass through the gates. The doors of the trucks are closed as the train begins to move. Szpilman catches his breath by a building while an SS man and Jewish policeman emerge. The Jewish policeman is servile crawling to the German and he points to the train as they laugh and walk away. Szpilman turns and stumbles down the empty street beginning to weep loud agonized sobs as he staggers on lost empty and aimless trying to catch his breath in the aftermath of his tears. He wanders forlornly down the street passing empty buildings with their doors open and windows smashed."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Their attention is caught by a boy who has a box of sweets on a string around his neck and he is selling the sweets pocketing money. Father calls to the Sweet Boy and beckons him over. They search their pockets and handbags handing over to Father what change they can find and he in turn hands the money to the Sweet Boy who hands over one caramel and goes on his way. Then Father carefully takes out his penknife and with great care divides the caramel into six parts and hands a part to each of the family. They all exchange a look an acknowledgment of each other almost like a toast and then they chew slowly deliberately. The whistle of a locomotive and the sound of trucks rattling over the rails prompt a sound of great agitation from the Jews in the compound. The locomotive pulling cattle and goods trucks comes into sight rolling slowly towards the boundary of the Umschlagplatz and coming to a halt with a cordon of Jewish policemen and SS guards. Szpilman falls in with them and they pass through the gates. The doors of the trucks are closed as the train begins to move. Szpilman catches his breath by a building while an SS man and Jewish policeman emerge. The Jewish policeman is servile crawling to the German and he points to the train as they laugh and walk away. Szpilman turns and stumbles down the empty street beginning to weep loud agonized sobs as he staggers on lost empty and aimless trying to catch his breath in the aftermath of his tears. He wanders forlornly down the street passing empty buildings with their doors open and windows smashed."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Their attention is caught by a boy who has a box of sweets on a string around his neck and he is selling the sweets pocketing money. Father calls to the Sweet Boy and beckons him over. They search their pockets and handbags handing over to Father what change they can find and he in turn hands the money to the Sweet Boy who hands over one caramel and goes on his way. The Jewish policeman is servile crawling to the German and he points to the train as they laugh and walk away. Szpilman turns and stumbles down the empty street beginning to weep loud agonized sobs as he staggers on lost empty and aimless trying to catch his breath in the aftermath of his tears. He wanders forlornly down the street passing empty buildings with their doors open and windows smashed."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Their curiosity is piqued by a cat who has a basket of flowers on a leash around her tail, and she's trading the flowers, collecting shells. Brother shouts to the Flower Cat and gestures her closer. They rummage through their caps and backpacks, presenting to Brother what buttons they can gather, and she, in turn, gives the shells to the Flower Cat, who hands over one daisy and prances on her way. Then, Brother gingerly extracts his spoon and meticulously splits the daisy into six petals and gives a petal to each member of the band. They all share a glance, an acknowledgment of one another, almost like a salute, and then they nibble, leisurely, thoughtfully. The beep of a foghorn and the echo of bicycles skidding over the pavement provoke a reaction of great excitement from the tourists in the plaza. The foghorn towing bicycles and furniture carts appears, gliding slowly towards the edge of the market square and halting, with a line of forest rangers and postal workers. Among the massive crowd of spectators, the Goldsmiths saunter towards the trolley, Goldsmith and Sylvia sauntering. A forest ranger seizes Goldsmith by his hat and tugs him back out of the ranger line as the rest of the band approaches the next cart to be loaded. A tussle follows as Goldsmith attempts to object, another forest ranger nudges him, and Goldsmith trips, collapsing to the ground in front of the closed ranks of the forest rangers' feet. He rises, dashes at the line, seeing between their arms and torsos Sister, Rachel, Edwin, and Sylvia climbing into the carts. Brother is glancing around, perplexed, and when he spots Goldsmith, he takes a step towards him but halts, grinning sheepishly. Brother lifts his leg and stamps, then turns and drifts towards the carts. Again, Goldsmith lunges at the rangers' torsos, and Miller spins on him. Goldsmith pauses for a moment, bewildered, frightened, then he pivots and begins to jog. Goldsmith drops to a brisk walk, heads for the kiosks, where drivers are maneuvering barrows stacked with the swollen piñatas that leaned against the fence. Goldsmith blends in with them, and they slip through the kiosks. The covers of the carts are secured as the trolley starts to roll. Goldsmith catches his breath by a booth while a postal worker and forest ranger appear. The forest ranger is ingratiating, groveling to the mailman, and he gestures to the trolley as they chuckle and stroll off. Goldsmith pivots and lurches down the barren road, commencing to wail loud, pained cries as he totters onward, adrift, void, and directionless, trying to catch his breath in the wake of his tears. He roams dejectedly down the road, passing vacant shops with their gates ajar and curtains torn."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The family's attention is drawn to a boy selling sweets. Father buys a caramel, divides it into six, and shares it with the family in a moment of unity. A train, surrounded by Jewish policemen and SS guards, arrives, prompting the Szpilmans to move towards it. As Szpilman and Halina walk, a Jewish policeman pulls Szpilman away from his family. In the ensuing struggle, as Szpilman is separated from his family who board the train, Father waves helplessly. Szpilman, confused and terrified, eventually escapes through the gates with workers removing corpses, watching as the train departs. He hides by a building, observing a Jewish policeman defer to an SS man. Overcome with emotion, Szpilman stumbles down an empty street, sobbing in despair, as he passes deserted buildings."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He wanders forlornly down the street passing empty buildings with their doors open and windows smashed Szpilman turns and stumbles down the empty street beginning to weep loud agonized sobs as he staggers on lost empty and aimless trying to catch his breath in the aftermath of his tears The Jewish policeman is servile crawling to the German and he points to the train as they laugh and walk away Szpilman catches his breath by a building while an SS man and Jewish policeman emerge The doors of the trucks are closed as the train begins to move Szpilman falls in with them and they pass through the gates Szpilman drops to walking pace makes for the gates where workers are pushing carts piled with the bloated corpses that lay against the wall then he turns and starts to run Szpilman stands for a moment confused terrified Again Szpilman flings himself at the policemen's shoulders and Heller turns on him Father raises his hand and waves then turns and goes towards the trucks Father is looking around bewildered and when he sees Szpilman he takes a step towards him but stops smiling helplessly Mother Regina Henryk and Halina clambering into the trucks He stands runs at the cordon seeing between their heads and shoulders another Jewish policeman shoves him and Szpilman stumbles falling to the ground in front of the closed ranks of the Jewish policemen's backs A scuffle ensues as Szpilman tries to resist A Jewish policeman grabs Szpilman by his collar and pulls him back out of the police cordon as the rest of the family reaches the next truck to be filled Szpilman and Halina walking Among the great throng of people the Szpilmans trudge towards the train The locomotive pulling cattle and goods trucks comes into sight rolling slowly towards the boundary of the Umschlagplatz and coming to a halt with a cordon of Jewish policemen and SS guards The whistle of a locomotive and the sound of trucks rattling over the rails prompt a sound of great agitation from the Jews in the compound They all exchange a look an acknowledgment of each other almost like a toast and then they chew slowly deliberately Then Father carefully takes out his penknife and with great care divides the caramel into six parts and hands a part to each of the family They search their pockets and handbags handing over to Father what change they can find and he in turn hands the money to the Sweet Boy who hands over one caramel and goes on his way Father calls to the Sweet Boy and beckons him over Their attention is caught by a boy who has a box of sweets on a string around his neck and he is selling the sweets pocketing money"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Father calls to the Sweet Boy and beckons him over Their attention is caught by a boy who has a box of sweets on a string around his neck and he is selling the sweets pocketing money Then Father carefully takes out his penknife and with great care divides the caramel into six parts and hands a part to each of the family They search their pockets and handbags handing over to Father what change they can find and he in turn hands the money to the Sweet Boy who hands over one caramel and goes on his way The whistle of a locomotive and the sound of trucks rattling over the rails prompt a sound of great agitation from the Jews in the compound They all exchange a look an acknowledgment of each other almost like a toast and then they chew slowly deliberately Among the great throng of people the Szpilmans trudge towards the train The locomotive pulling cattle and goods trucks comes into sight rolling slowly towards the boundary of the Umschlagplatz and coming to a halt with a cordon of Jewish policemen and SS guards A Jewish policeman grabs Szpilman by his collar and pulls him back out of the police cordon as the rest of the family reaches the next truck to be filled Szpilman and Halina walking another Jewish policeman shoves him and Szpilman stumbles falling to the ground in front of the closed ranks of the Jewish policemen's backs A scuffle ensues as Szpilman tries to resist Mother Regina Henryk and Halina clambering into the trucks He stands runs at the cordon seeing between their heads and shoulders Father raises his hand and waves then turns and goes towards the trucks Father is looking around bewildered and when he sees Szpilman he takes a step towards him but stops smiling helplessly Szpilman stands for a moment confused terrified Again Szpilman flings himself at the policemen's shoulders and Heller turns on him Szpilman drops to walking pace makes for the gates where workers are pushing carts piled with the bloated corpses that lay against the wall then he turns and starts to run The doors of the trucks are closed as the train begins to move Szpilman falls in with them and they pass through the gates The Jewish policeman is servile crawling to the German and he points to the train as they laugh and walk away Szpilman catches his breath by a building while an SS man and Jewish policeman emerge He wanders forlornly down the street passing empty buildings with their doors open and windows smashed Szpilman turns and stumbles down the empty street beginning to weep loud agonized sobs as he staggers on lost empty and aimless trying to catch his breath in the aftermath of his tears"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Mother Regina Henryk and Halina clambering into the trucks Father is looking around bewildered and when he sees Szpilman he takes a step towards him but stops smiling helplessly Father raises his hand and waves then turns and goes towards the trucks Again Szpilman flings himself at the policemen's shoulders and Heller turns on him Szpilman stands for a moment confused terrified then he turns and starts to run Szpilman drops to walking pace makes for the gates where workers are pushing carts piled with the bloated corpses that lay against the wall Szpilman falls in with them and they pass through the gates The doors of the trucks are closed as the train begins to move Szpilman catches his breath by a building while an SS man and Jewish policeman emerge The Jewish policeman is servile crawling to the German and he points to the train as they laugh and walk away Szpilman turns and stumbles down the empty street beginning to weep loud agonized sobs as he staggers on lost empty and aimless trying to catch his breath in the aftermath of his tears He wanders forlornly down the street passing empty buildings with their doors open and windows smashed Their attention is caught by a boy who has a box of sweets on a string around his neck and he is selling the sweets pocketing money Father calls to the Sweet Boy and beckons him over They search their pockets and handbags handing over to Father what change they can find and he in turn hands the money to the Sweet Boy who hands over one caramel and goes on his way Then Father carefully takes out his penknife and with great care divides the caramel into six parts and hands a part to each of the family They all exchange a look an acknowledgment of each other almost like a toast and then they chew slowly deliberately The whistle of a locomotive and the sound of trucks rattling over the rails prompt a sound of great agitation from the Jews in the compound The locomotive pulling cattle and goods trucks comes into sight rolling slowly towards the boundary of the Umschlagplatz and coming to a halt with a cordon of Jewish policemen and SS guards Among the great throng of people the Szpilmans trudge towards the train Szpilman and Halina walking A Jewish policeman grabs Szpilman by his collar and pulls him back out of the police cordon as the rest of the family reaches the next truck to be filled A scuffle ensues as Szpilman tries to resist another Jewish policeman shoves him and Szpilman stumbles falling to the ground in front of the closed ranks of the Jewish policemen's backs He stands runs at the cordon seeing between their heads and shoulders"
        }
      ]
    }
  ]
}