{
  "ground_truth": "The boy and girl laugh, their laughter putting a pause in there, back and forth. A waitress comes by with a pot of coffee and pours the young woman's coffee. The young man lights up another cigarette, calls to the waitress, then looks to his girl. The waitress comes by, pouring him some more. The young woman scans the restaurant with this new information and sees all the patrons eating, lost in conversations, and the busboys going through the motions, collecting dishes. A smile breaks out on the young woman's face, and with that, Pumpkin and Honey Bunny grab their weapons, stand up, and rob the restaurant. In the front seat are two young fellas, one white, one black, both wearing cheap black suits with thin black ties under long green dusters. Jules is behind the wheel. They close the trunk. Vincent and Jules, their long matching overcoats practically dragging on the ground, walk through the courtyard of what looks like a hacienda-style Hollywood apartment building. We track alongside. They enter the apartment building, walk through the reception area, and wait for the elevator. The elevator arrives, the men step inside, and the elevator doors open; Jules and Vincent exit. Steadicam in front of Jules and Vincent as they make a beeline down the hall. Jules stops Vincent, looks at him a long moment—he's been set up. He starts walking down the hall, Vincent, smiling, walks a little bit behind. They move a little away from the door, facing each other, still whispering, making a gun out of his finger and placing it to his head. Jules just looks at him. Three young guys, obviously in over their heads, sit at a table with hamburgers, french fries, and soda pops laid out. One of them flips the loud bolt on the door, opening it to reveal Jules and Vincent in the hallway. The two men stroll inside. The three young caught-off-guard guys are Marvin, the black young man, who opens the door and will, as the scene progresses, back into the corner, and Brett, a white, preppy-looking sort with a blow-dry haircut. Vincent and Jules take in the place with their hands in their pockets. Jules is the one who does the talking. Jules grabs the burger and takes a bite of it. Vincent moves to the bed, reaches underneath it, and pulls out a black snap briefcase. Vincent looks up at Jules, closing the case. As Brett talks, Jules takes out his gun and shoots Roger, blowing him out of his chair. Vince smiles to himself. He's not crying or whimpering, but he's so full of fear, it's as if his body is imploding. Brett can't say a word.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The lad and lass chuckle, their mirth placing a halt in there, to and fro. A server comes by with a pitcher of java and serves the young woman's java. The young man ignites another cigarette, summons the server, then gazes to his lass. The server comes by, pouring him some additional. The young woman examines the diner with this novel information and notices all the customers dining, engrossed in dialogues, and the busboys proceeding through the actions, gathering plates. A grin emerges on the young woman's visage, and with that, Pumpkin and Honey Bunny seize their arms, rise up, and loot the eatery. In the front seat are two young fellows, one Caucasian, one African-American, both dressed in inexpensive black suits with slim black neckties beneath lengthy green coats. Jules is behind the steering wheel. They shut the compartment. Vincent and Jules, their lengthy matching cloaks nearly dragging on the earth, stroll through the courtyard of what appears like a hacienda-style Hollywood apartment complex. We follow alongside. They enter the apartment complex, stroll through the lobby, and wait for the lift. The lift arrives, the men step inside, and the lift doors open; Jules and Vincent depart. Steadicam in front of Jules and Vincent as they make a direct line down the corridor. Jules halts Vincent, regards him a long while—he's been duped. He begins walking down the corridor, Vincent, grinning, walks a tad behind. They shift a little away from the entrance, facing each other, still murmuring, fashioning a pistol out of his digit and placing it to his cranium. Jules just regards him. Three young lads, evidently in over their heads, sit at a table with burgers, fries, and soft drinks arranged out. One of them flips the noisy bolt on the entrance, opening it to unveil Jules and Vincent in the corridor. The two men saunter inside. The three young taken-aback lads are Marvin, the African-American young man, who opens the entrance and will, as the scene advances, retreat into the corner, and Brett, a white, preppy-appearing type with a blow-dry coiffure. Vincent and Jules take in the locale with their hands in their pockets. Jules is the one who does the speaking. Jules seizes the burger and takes a mouthful of it. Vincent moves to the bed, reaches underneath it, and extracts a black snap briefcase. Vincent gazes up at Jules, closing the case. As Brett speaks, Jules takes out his firearm and shoots Roger, blowing him out of his seat. Vince grins to himself. He's not weeping or whimpering, but he's so full of dread, it's as if his body is collapsing. Brett can't utter a word."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Their laughter is put on pause by the boy and girl, back and forth. A waitress is passed by who has a pot of coffee and the young woman's coffee is poured by her. Another cigarette is lit up by the young man, and the waitress is called to by him, then his girl is looked at. Some more is poured for him by the waitress. With this new information, the restaurant is scanned by the young woman and all the patrons eating, lost in conversations, and the busboys going through the motions, collecting dishes, are seen by her. A smile is broken out on the young woman's face, and with that, weapons are grabbed by Pumpkin and Honey Bunny, they stand up, and the restaurant is robbed by them. In the front seat, two young fellas are sitting, one white, one black, both wearing cheap black suits with thin black ties under long green dusters. The wheel is behind Jules. The trunk is closed by them. Through the courtyard of what looks like a hacienda-style Hollywood apartment building, Vincent and Jules walk, their long matching overcoats practically dragging on the ground. Alongside, we track. The apartment building is entered by them, the reception area is walked through, and the elevator is waited for. The elevator arrives, inside the men step, and Jules and Vincent are revealed by the elevator doors opening as they exit. In front of Jules and Vincent, a Steadicam tracks as a beeline is made down the hall by them. Vincent is stopped by Jules, who looks at him for a long moment—he has been set up. Down the hall, he starts walking, and behind him, Vincent, smiling, walks a little bit. They move a little away from the door, face each other, still whispering, and a gun is made out of his finger and placed to his head by him. Just looking at him is what Jules does. At a table, three young guys, obviously in over their heads, are sitting with hamburgers, french fries, and soda pops laid out. The loud bolt on the door is flipped by one of them, opening it to reveal Vincent and Jules in the hallway. Inside, the two men stroll. The three young caught-off-guard guys are identified as Marvin, the black young man, who opens the door and will, as the scene progresses, back into the corner, and Brett, a white, preppy-looking sort with a blow-dry haircut. The place is taken in by Vincent and Jules, their hands in their pockets. The talking is done by Jules. The burger is grabbed by Jules and a bite of it is taken. To the bed, Vincent moves, underneath it is reached by him, and a black snap briefcase is pulled out. Jules is looked up at by Vincent, who closes the case. As Brett talks, out comes the gun from Jules, and Roger is shot by him, blowing him out of his chair. To himself, Vince smiles. There is no crying or whimpering by Roger, but so full of fear he is, it's as if by his body, he's imploding. Not a word can be said by Brett."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The boy and girl pause their laughter. A waitress pours the young woman coffee while the young man lights a cigarette and signals her for more. The young woman notices other patrons and busboys, smiles, and then Pumpkin and Honey Bunny begin a heist. Two young men in cheap suits, one black and one white, with green dusters, are in a front seat. Jules drives. They exit a trunk, proceed through a hacienda-style Hollywood apartment courtyard, enter the building, and wait for the elevator. Upon exiting, Steadicam follows Jules and Vincent down a hall. Jules pauses, realizing a setup, and continues while Vincent smiles, playing with an imaginary gun. Three young men at a table with fast food hear the door bolt flip open to reveal Jules and Vincent. Marvin opens the door. Brett, a preppy guy, and Marvin are caught off-guard. Vincent and Jules enter with hands in pockets, and Jules speaks. Jules bites a burger while Vincent retrieves a briefcase from under a bed. Jules shoots Roger as Brett stands silent, filled with fear."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The boy and girl pause their laughter as a waitress pours coffee for the young woman. The young man lights a cigarette, calls the waitress, and she refills his cup. Observing patrons and busboys, the young woman smiles. Pumpkin and Honey Bunny then stand and rob the restaurant. Two young men, one white and one black, wear cheap black suits and green dusters. Jules drives as they close a trunk. Vincent and Jules, coats dragging, walk through a hacienda-style apartment courtyard, enter, and wait for an elevator. They step inside, exit, and walk down a hall. Jules stops Vincent, sensing a setup; Vincent follows. Three nervous young guys sit at a table with fast food. Marvin, a black man, opens the door to Jules and Vincent. Inside, Jules talks while Vincent retrieves a black briefcase from under the bed. As Brett speaks, Jules shoots Roger. Vincent smiles, while Brett is paralyzed by fear."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The youthful boy and girl engage in laughter, their infectious mirth momentarily interrupting their back-and-forth banter. A waitress appears at their table, carrying a steaming pot of coffee, and attentively fills the young woman's cup until it's full. Meanwhile, the young man, with a practiced motion, lights up yet another cigarette, calls to the waitress for her attention, and then turns his gaze toward his girl. The attentive waitress returns, obligingly pouring him another cup. The young woman takes in the scene around her, scanning the bustling restaurant with this new piece of information. Her eyes wander over the patrons, engrossed in their meals and deep in conversation, as well as the busboys going through their routine tasks, efficiently collecting dishes. A smile gradually spreads across the young woman's face, but the atmosphere shifts abruptly when Pumpkin and Honey Bunny suddenly spring into action. They retrieve their weapons, rise from their seats, and initiate a robbery of the restaurant.\n\nSeated in the front seat of a vehicle are two youthful individuals, one a Caucasian and the other African American, both clad in inexpensive black suits complemented by thin black ties, all beneath long, green, dust-coated overcoats. Jules is the one behind the wheel. As they close the trunk of the car, Vincent and Jules, their long, matching overcoats nearly skimming the ground, make their way through the courtyard of what resembles a hacienda-style Hollywood apartment building. We follow alongside them as they enter the building, walk through the modest reception area, and wait for the elevator to arrive. When the elevator comes, the two men step inside, and as the elevator doors slide open once more, Jules and Vincent emerge. The Steadicam tracks in front of them as they stride purposefully down the hallway. Jules halts Vincent, regarding him for a lingering moment as if sensing a setup. Jules resumes his walk down the hall with Vincent, who, with a slight smile, trails a bit behind. They shift away from the door slightly, facing one another, still whispering with intensity, and Vincent mimics making a gun with his finger, playfully placing it to his head. Jules merely regards him silently.\n\nInside, three young men, clearly in over their heads, sit at a table surrounded by hamburgers, french fries, and soda pops. One of them flips the loud bolt on the door, revealing Jules and Vincent in the hallway. The duo casually strolls inside, catching the three young men off guard. Among them is Marvin, the young black man who opens the door and, as the scene unfolds, retreats to a corner, and Brett, a white, preppy-looking individual with a coiffed, blow-dry haircut. With their hands comfortably nestled in their pockets, Vincent and Jules take in the scene. Jules takes charge of the conversation. Without ceremony, he grabs a burger and takes a substantial bite. Meanwhile, Vincent moves to the bed, reaching underneath to retrieve a black snap briefcase. He glances up at Jules, securing the case. As Brett continues to speak, Jules nonchalantly draws his gun and fires at Roger, knocking him out of his chair. Vince smiles knowingly to himself. Although he doesn't cry or whimper outwardly, his body is fraught with fear, as if on the verge of implosion. Brett is rendered speechless, caught in a tension-filled silence."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The spirited young boy and girl immerse themselves in joyful laughter, their infectious mirth temporarily interrupting the playful exchange of their lively banter. Just then, a waitress approaches their table, balancing a steaming pot of fresh coffee, and attentively pours the hot beverage into the young woman's cup until it's brimming. Meanwhile, the young man, with the ease of someone who has done it countless times, lights yet another cigarette. He calls out to the waitress, politely capturing her attention, before shifting his gaze affectionately toward his female companion. The ever-attentive waitress promptly returns to their table, obligingly filling his cup with the steaming brew. The young woman then absorbs the bustling scene around her, her eyes scanning the lively restaurant armed with this new tidbit of information. Her gaze flits over the patrons, who are deeply engrossed in their meals and engaged in animated conversation, as well as the busboys who are diligently going about their routine tasks, efficiently collecting the used dishes. Slowly, a smile spreads across her face, casting a glow over the lively environment, but the atmosphere pivots dramatically when Pumpkin and Honey Bunny suddenly leap into action. They retrieve their hidden weapons, rise swiftly from their seats, and initiate a spontaneous robbery of the bustling restaurant.\n\nIn the front seat of a vehicle, two youthful individuals are seated, one being a Caucasian and the other African American, both dressed in inexpensive, classic black suits complemented by thin black ties, all beneath long, green overcoats coated with a layer of dust. It is Jules who occupies the driver's seat, steering the car. As they close the trunk with a definitive thud, Vincent and Jules, their long, coordinating overcoats almost brushing the ground, make their way through the courtyard of a building that resembles a hacienda-style Hollywood apartment complex. We accompany them as they enter the building, walk through the modest reception area, and wait with anticipation for the elevator to arrive. When the elevator finally arrives, the two men step inside, and as the doors slide open once more, Jules and Vincent emerge confidently. The Steadicam follows in front of them as they stride with purpose down the long hallway. Jules halts Vincent, regarding him for a prolonged moment as if perceiving a potential setup. Jules resumes his walk, accompanied by Vincent, who, with a slight smile, trails just a bit behind. They shift slightly away from the door, facing one another, still whispering with intensity, with Vincent humorously mimicking the action of making a gun with his finger, playfully placing it to his head. Jules merely observes him silently, without responding.\n\nInside the apartment, three young men, conspicuously out of their depth, sit at a table surrounded by a smorgasbord of hamburgers, french fries, and soda pops. One of them moves to flip the loud bolt on the door, revealing Jules and Vincent standing ominously in the hallway. The duo nonchalantly strolls inside, catching the three young men off guard. Among them is Marvin, the young black man who opens the door, and as the scene unfolds, he retreats quietly to a corner. Also present is Brett, a white, preppy-looking individual with a meticulously coiffed, blow-dried haircut. With their hands casually nestled in their pockets, Vincent and Jules take in the scene. Jules takes command of the conversation. Without any ceremony, he grabs a burger from the table and takes a substantial bite, as if it were the most natural thing to do. Meanwhile, Vincent moves to the bed, reaching underneath to retrieve a black snap briefcase. He glances upward at Jules, securing the case. As Brett awkwardly continues to speak, Jules, in an unexpected move, casually draws his gun and fires at Roger, knocking him out of his chair. Vince knowingly smiles to himself with an air of understanding. Although Brett doesn't cry or whimper outwardly, his entire body is fraught with fear, as if he is teetering on the edge of implosion. Brett is rendered speechless, caught in a silence laden with tension."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The boy and girl share a moment of mirth, their laughter echoing back and forth, creating a brief pause in their interaction. While they enjoy this light-hearted exchange, a waitress approaches their table carrying a pot of freshly brewed coffee. She gracefully tilts the pot, allowing the rich, steaming liquid to cascade into the young woman's cup. Meanwhile, the young man casually retrieves a cigarette from its pack, bringing it to his lips, and ignites it with a flick of his lighter, exhaling a satisfying puff of smoke. As he calls out to the waitress to catch her attention again, he briefly shifts his gaze to meet his girl's eyes, sharing a silent connection. The waitress returns, her presence signaled by the clinking of the coffee pot, and replenishes his empty cup. The young woman, now equipped with this refreshed perspective, surveys the entire restaurant, observing with keen interest the numerous patrons engrossed in their conversations, and watches as the busboys deftly navigate their tasks, collecting used dishes. A spontaneous smile spreads across her face, signaling a shift in mood, and with newfound determination, Pumpkin and Honey Bunny resolutely grab their concealed weapons. They rise swiftly from their seats, their intentions clear, and proceed to rob the restaurant. Meanwhile, elsewhere, the scene shifts to two young men, one white and one black, seated in the front seat of a car. Clad in inexpensive black suits with thin black ties, they wear long green dusters that sway with their movements. Jules, the black young man, occupies the driver's seat. Together, they close the trunk of their vehicle with a solid thunk. Vincent and Jules, their nearly matching overcoats nearly sweeping the ground, stride purposefully through the courtyard of a hacienda-style Hollywood apartment building. The camera keeps pace with them, tracking their synchronized steps. They enter the entrance of the apartment building, navigating the reception area with familiarity, and pause to wait for the arrival of the elevator. When the elevator doors part, the two men step inside, standing silently until the doors glide open once more, allowing them to exit. With the Steadicam capturing their every move, Jules and Vincent make a straight path down the hallway. Suddenly, Jules halts Vincent with a deliberate gesture, directing an intense, scrutinizing look at him, realizing that they've been set up. Jules then resumes walking down the hall, with Vincent following a few steps behind, a knowing smile playing on his lips. As they approach their destination, they subtly distance themselves from the door, positioning themselves to face each other. While whispering quietly, Vincent playfully crafts a gun shape with his fingers, pressing it humorously to his temple, while Jules remains steadfast and unamused by the antics. Inside the apartment, three young men, visibly out of their depth, are seated at a table laden with hamburgers, french fries, and soda pops. With a sudden, loud click, one of them unlocks the door, revealing Jules and Vincent standing imposingly in the hallway. The two men enter the room in a leisurely manner, their hands resting nonchalantly in their pockets. Marvin, the black young man, who had opened the door, instinctively retreats to a corner as the scene intensifies, while Brett, a white, preppy young man with a meticulously styled blow-dry haircut, remains seated. Jules assumes control of the situation, engaging the group in conversation while Vincent scans the room. Jules casually reaches for a burger, taking a deliberate bite and savoring the taste. Meanwhile, Vincent moves to the bedside, bends down, and retrieves a black snap briefcase from its hiding place beneath the bed. As Vincent secures the briefcase, clicking it shut, he exchanges a meaningful glance with Jules. Unfazed by the tension, Jules draws his gun with unwavering composure and, in a swift, decisive action, fires at Roger, sending him tumbling out of his chair. Watching the scene unfold, Vincent allows himself a smile, reflecting a mix of amusement and satisfaction. Though not outwardly expressing his panic, Brett is paralyzed by fear, standing speechless, his mind racing while Jules and Vincent maintain their commanding presence in the room."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The boy and girl share a laugh, briefly pausing before a waitress refills the young woman's coffee. The young man lights another cigarette and calls to the waitress for more, then exchanges a glance with his companion. Observing the restaurant, the young woman smiles as Pumpkin and Honey Bunny brandish their weapons, stand up, and initiate a robbery. In a car, two young men, one white and one black, dressed in matching black suits and long green dusters, close the trunk. Jules drives as they traverse the courtyard of a hacienda-style Hollywood apartment building. Walking through the reception area, they await and then take the elevator, exiting purposefully down a hallway. Jules momentarily stops Vincent, signaling a setup, and continues while Vincent follows slightly behind, mimicking a gun gesture. They reach a room where three young men sit with fast food. Marvin, who opens the door, and Brett, with a blow-dried haircut, are caught off guard. Jules and Vincent survey the scene, Jules speaks, then takes a bite of a burger as Vincent retrieves a black briefcase from under the bed. Jules then shoots Roger, who falls from his chair, causing Vincent to smile at the intensity of the scene, while Brett, paralyzed by fear, remains speechless."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The boy and girl laugh, their laughter putting a pause in the lively diner atmosphere, a classic American setting bustling with energy. A waitress, dressed in a traditional diner uniform, comes by with a pot of coffee popularized in mid-20th century American diners and pours the young woman's coffee. The young man, a quintessential image from 20th-century Americana, lights up another cigarette, calls to the waitress, then looks to his girl. The waitress comes by, pouring him some more. The young woman scans the restaurant with this new information and sees all the patrons eating, lost in conversations, and the busboys, who work mainly in clearing tables, going through the motions, collecting dishes. A smile breaks out on the young woman's face, and with that, Pumpkin and Honey Bunny, a moniker commonly used in affectionate settings, grab their weapons, stand up, and rob the restaurant, a move reminiscent of classic heist films. In the front seat are two young fellas, one white, one black, both wearing cheap black suits with thin black ties under long green dusters, a style often associated with 1990s fashion. Jules is behind the wheel of an older model car, emblematic of a bygone era in automobile design. They close the trunk, a sound that echoes in the quiet of the courtyard. Vincent and Jules, their long matching overcoats practically dragging on the ground, walk through the courtyard of what looks like a hacienda-style Hollywood apartment building, designed in the Spanish Colonial Revival style prevalent in California during the early 20th century. We track alongside. They enter the apartment building, walk through the reception area, and wait for the elevator, an ancient device with creaky metal doors that has seen better days. The elevator arrives, the men step inside, and the elevator doors open; Jules and Vincent exit. Steadicam in front of Jules and Vincent as they make a beeline down the hall. Jules stops Vincent, looks at him a long moment—he's been set up in an expected twist of dramatic tension. He starts walking down the hall, Vincent, smiling, walks a little bit behind, reminiscent of a scene from classic buddy films. They move a little away from the door, facing each other, still whispering, making a gun out of his finger—a playful yet dark gesture suggesting danger—and placing it to his head. Jules just looks at him. Three young guys, obviously in over their heads, sit at a table with hamburgers, french fries, and soda pops laid out, a typical fast-food meal symbolizing youthful indulgence. One of them flips the loud bolt on the door, opening it to reveal Jules and Vincent in the hallway. The two men stroll inside. The three young caught-off-guard guys are Marvin, the black young man, who opens the door and will, as the scene progresses, back into the corner, and Brett, a white, preppy-looking sort with a blow-dry haircut, a style popularized in the 1980s. Vincent and Jules take in the place with their hands in their pockets, maintaining an air of nonchalance. Jules is the one who does the talking, often taking the lead in such situations. Jules grabs the burger, a symbol of American culture, and takes a bite of it. Vincent moves to the bed, a standard motel-style piece, reaches underneath it, and pulls out a black snap briefcase, a mysterious and often cinematic object. Vincent looks up at Jules, closing the case with a snap. As Brett talks, Jules takes out his gun, a stark reminder of the violence simmering beneath the surface, and shoots Roger, blowing him out of his chair. Vince smiles to himself. He's not crying or whimpering, but he's so full of fear, it's as if his body is imploding, a powerful image of tension and dread. Brett can't say a word, leaving the room in a tense, expectant silence."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The boy and girl laugh their laughter putting a pause in there back and forth. A waitress comes by with a pot of coffee and pours the young woman's coffee. The young man lights up another cigarette calls to the waitress then looks to his girl. The waitress comes by pouring him some more. The young woman scans the restaurant with this new information and sees all the patrons eating lost in conversations and the busboys going through the motions collecting dishes. A smile breaks out on the young woman's face and with that Pumpkin and Honey Bunny grab their weapons stand up and rob the restaurant. In the front seat are two young fellas one white one black both wearing cheap black suits with thin black ties under long green dusters. Jules is behind the wheel. They close the trunk. Vincent and Jules their long matching overcoats practically dragging on the ground walk through the courtyard of what looks like a haciendastyle Hollywood apartment building. We track alongside. They enter the apartment building walk through the reception area and wait for the elevator. The elevator arrives the men step inside and the elevator doors open. Jules and Vincent exit. Steadicam in front of Jules and Vincent as they make a beeline down the hall. Jules stops. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Vincent looks at him a long moment—he is been set up. He starts walking down the hall. Vincent smiling walks a little bit behind. They move a little away from the door facing each other still whispering making a gun out of his finger and placing it to his head. Jules just looks at him. Three young guys obviously in over their heads sit at a table with hamburgers french fries and soda pops laid out. One of them flips the loud bolt on the door opening it to reveal Jules and Vincent in the hallway. The two men stroll inside. The three young caughtoffguard guys are Marvin the black young man who opens the door and will as the scene progresses back into the corner and Brett a white preppylooking sort with a blowdry haircut. Vincent and Jules take in the place with their hands in their pockets. Jules is the one who does the talking. Jules grabs the burger and takes a bite of it. Vincent moves to the bed reaches underneath it and pulls out a black snap briefcase. Vincent looks up at Jules closing the case. As Brett talks Jules takes out his gun and shoots Roger blowing him out of his chair Vince smiles to himself. He is not crying or whimpering but he is so full of fear it is as if his body is imploding. Brett cannot say a word."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The boy and girl laugh their laughter putting a pause in there back and forth. A waitress comes by with a pot of coffee and pours the young woman's coffee. The young man lights up another cigarette calls to the waitress then looks to his girl. The waitress comes by pouring him some more. The young woman scans the restaurant with this new information and sees all the patrons eating lost in conversations and the busboys going through the motions collecting dishes. A smile breaks out on the young woman's face and with that Pumpkin and Honey Bunny grab their weapons stand up and rob the restaurant. In the front seat are two young fellas one white one black both wearing cheap black suits with thin black ties under long green dusters. Jules is behind the wheel. They close the trunk. Vincent and Jules their long matching overcoats practically dragging on the ground walk through the courtyard of what looks like a haciendastyle Hollywood apartment building. We track alongside. They enter the apartment building walk through the reception area and wait for the elevator. The elevator arrives the men step inside and the elevator doors open. Jules and Vincent exit. Steadicam in front of Jules and Vincent as they make a beeline down the hall. Jules stops. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. Vincent looks at him a long moment—he is been set up. He starts walking down the hall. Vincent smiling walks a little bit behind. They move a little away from the door facing each other still whispering making a gun out of his finger and placing it to his head. Jules just looks at him. Three young guys obviously in over their heads sit at a table with hamburgers french fries and soda pops laid out. One of them flips the loud bolt on the door opening it to reveal Jules and Vincent in the hallway. The two men stroll inside. The three young caughtoffguard guys are Marvin the black young man who opens the door and will as the scene progresses back into the corner and Brett a white preppylooking sort with a blowdry haircut. Vincent and Jules take in the place with their hands in their pockets. Jules is the one who does the talking. Jules grabs the burger and takes a bite of it. Vincent moves to the bed reaches underneath it and pulls out a black snap briefcase. Vincent looks up at Jules closing the case. As Brett talks Jules takes out his gun and shoots Roger blowing him out of his chair Vince smiles to himself. He is not crying or whimpering but he is so full of fear it is as if his body is imploding. Brett cannot say a word."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The boy and girl laugh their laughter putting a pause in there back and forth. A waitress comes by with a pot of coffee and pours the young woman's coffee. The young man lights up another cigarette calls to the waitress then looks to his girl. The waitress comes by pouring him some more. The young woman scans the restaurant with this new information and sees all the patrons eating lost in conversations and the busboys going through the motions collecting dishes. A smile breaks out on the young woman's face and with that Pumpkin and Honey Bunny grab their weapons stand up and rob the restaurant. In the front seat are two young fellas one white one black both wearing cheap black suits with thin black ties under long green dusters. Jules is behind the wheel. The three young caughtoffguard guys are Marvin the black young man who opens the door and will as the scene progresses back into the corner and Brett a white preppylooking sort with a blowdry haircut. Vincent and Jules take in the place with their hands in their pockets. Jules is the one who does the talking. Jules grabs the burger and takes a bite of it. Vincent moves to the bed reaches underneath it and pulls out a black snap briefcase. Vincent looks up at Jules closing the case. As Brett talks Jules takes out his gun and shoots Roger blowing him out of his chair Vince smiles to himself. He is not crying or whimpering but he is so full of fear it is as if his body is imploding. Brett cannot say a word."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The boy and girl laugh their laughter putting a pause in there back and forth. A waitress comes by with a pot of coffee and pours the young woman's coffee. The young man lights up another cigarette calls to the waitress then looks to his girl. Vincent looks up at Jules closing the case. As Brett talks Jules takes out his gun and shoots Roger blowing him out of his chair Vince smiles to himself. He is not crying or whimpering but he is so full of fear it is as if his body is imploding. Brett cannot say a word."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The cat and dog chuckle, their giggling inserting a break there, to and fro. A librarian strolls by with a tray of tea and fills the old man's teacup. The old man sparks up another lantern, hollers to the librarian, then stares at his dog. The librarian strolls by, refilling his cup. The old dog scans the park with this new clue and notices all the squirrels playing, trapped in dialogues, and the gardeners moving through the steps, gathering leaves. A grin bursts on the old dog's snout, and with that, Sparkle and Fuzzy Wuzzy snatch their lollipops, rise up, and tickle the park. In the backseat are two elderly cats, one striped, one spotted, both donning shabby red vests with skinny red ribbons under long yellow ponchos. Sam is steering the boat. They shut the trunk. Malcolm and Sam, their short clashing capes barely touching the clouds, leap through the garden of what seems like a Mediterranean-style Vegas hotel complex. We float alongside. They invade the complex, skip through the lobby, and linger for the ski lift. The ski lift arrives, the cats leap inside, and the ski lift doors dissolve; Sam and Malcolm emerge. Hovercam ahead of Sam and Malcolm as they scamper down the corridor. Sam halts Malcolm, stares at him a long minute—he's been tricked. He begins hopping down the corridor, Malcolm, grinning, hops a tad behind. They drift a tad away from the gate, facing each other, still murmuring, making a balloon out of his paw and planting it to his nose. Sam just stares at him. Three ancient owls, evidently out of their minds, perch at a dock with cupcakes, apple pies, and lemonade splattered out. One of them spins the silent latch on the gate, unlocking it to display Sam and Malcolm in the corridor. The two cats strut inside. The three ancient startled owls are Arnie, the purple elder owl, who unlocks the gate and will, as the tale unfolds, slink into the hammock, and Todd, a yellow, dapper-feathered creature with a wind-blown plume. Malcolm and Sam take in the meadow with their wings in their nests. Sam is the one who does the chirping. Sam snatches the pie and nibbles on it. Malcolm drifts to the hammock, reaches beneath it, and extracts a purple velvet satchel. Malcolm gazes up at Sam, securing the bag. As Todd squawks, Sam waves his wand and zaps Harold, launching him out of his nest. Malcolm chuckles to himself. He's not cackling or groaning, but he's so packed with dread, it's as if his soul is erupting. Todd can't chirp a peep."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The boy and girl laugh, pausing their conversation. A waitress serves coffee, and the young man smokes a cigarette. The young woman surveys the restaurant as patrons chat and busboys work. Smiling, Pumpkin and Honey Bunny suddenly brandish weapons and rob the place. Jules and Vincent, in matching overcoats, enter a hacienda-style apartment, ride an elevator, and approach a hallway door. Jules senses a setup and whispers with Vincent. Inside, three nervous young men, including Marvin and Brett, eat at a table. Jules and Vincent enter, with Jules doing the talking. He eats a burger, while Vincent retrieves a black briefcase from under a bed. Jules shoots Roger, causing Brett to freeze in fear. Vincent quietly enjoys the chaos."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Brett cannot say a word He is not crying or whimpering but he is so full of fear it is as if his body is imploding As Brett talks Jules takes out his gun and shoots Roger blowing him out of his chair Vince smiles to himself Vincent looks up at Jules closing the case Vincent moves to the bed reaches underneath it and pulls out a black snap briefcase Jules grabs the burger and takes a bite of it Jules is the one who does the talking Vincent and Jules take in the place with their hands in their pockets The three young caughtoffguard guys are Marvin the black young man who opens the door and will as the scene progresses back into the corner and Brett a white preppylooking sort with a blowdry haircut The two men stroll inside One of them flips the loud bolt on the door opening it to reveal Jules and Vincent in the hallway Three young guys obviously in over their heads sit at a table with hamburgers french fries and soda pops laid out Jules just looks at him They move a little away from the door facing each other still whispering making a gun out of his finger and placing it to his head Vincent smiling walks a little bit behind He starts walking down the hall Vincent looks at him a long moment—he is been set up Jules stops Steadicam in front of Jules and Vincent as they make a beeline down the hall Jules and Vincent exit The elevator arrives the men step inside and the elevator doors open They enter the apartment building walk through the reception area and wait for the elevator We track alongside Vincent and Jules their long matching overcoats practically dragging on the ground walk through the courtyard of what looks like a haciendastyle Hollywood apartment building They close the trunk Jules is behind the wheel In the front seat are two young fellas one white one black both wearing cheap black suits with thin black ties under long green dusters A smile breaks out on the young woman's face and with that Pumpkin and Honey Bunny grab their weapons stand up and rob the restaurant The young woman scans the restaurant with this new information and sees all the patrons eating lost in conversations and the busboys going through the motions collecting dishes The waitress comes by pouring him some more The young man lights up another cigarette calls to the waitress then looks to his girl A waitress comes by with a pot of coffee and pours the young woman's coffee The boy and girl laugh their laughter putting a pause in there back and forth"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "A waitress comes by with a pot of coffee and pours the young woman's coffee The boy and girl laugh their laughter putting a pause in there back and forth The waitress comes by pouring him some more The young man lights up another cigarette calls to the waitress then looks to his girl A smile breaks out on the young woman's face and with that Pumpkin and Honey Bunny grab their weapons stand up and rob the restaurant The young woman scans the restaurant with this new information and sees all the patrons eating lost in conversations and the busboys going through the motions collecting dishes Jules is behind the wheel In the front seat are two young fellas one white one black both wearing cheap black suits with thin black ties under long green dusters Vincent and Jules their long matching overcoats practically dragging on the ground walk through the courtyard of what looks like a haciendastyle Hollywood apartment building They close the trunk They enter the apartment building walk through the reception area and wait for the elevator We track alongside Jules and Vincent exit The elevator arrives the men step inside and the elevator doors open Jules stops Steadicam in front of Jules and Vincent as they make a beeline down the hall He starts walking down the hall Vincent looks at him a long moment—he is been set up They move a little away from the door facing each other still whispering making a gun out of his finger and placing it to his head Vincent smiling walks a little bit behind Three young guys obviously in over their heads sit at a table with hamburgers french fries and soda pops laid out Jules just looks at him The two men stroll inside One of them flips the loud bolt on the door opening it to reveal Jules and Vincent in the hallway Vincent and Jules take in the place with their hands in their pockets The three young caughtoffguard guys are Marvin the black young man who opens the door and will as the scene progresses back into the corner and Brett a white preppylooking sort with a blowdry haircut Jules grabs the burger and takes a bite of it Jules is the one who does the talking Vincent looks up at Jules closing the case Vincent moves to the bed reaches underneath it and pulls out a black snap briefcase He is not crying or whimpering but he is so full of fear it is as if his body is imploding As Brett talks Jules takes out his gun and shoots Roger blowing him out of his chair Vince smiles to himself Brett cannot say a word"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He starts walking down the hall Vincent smiling walks a little bit behind They move a little away from the door facing each other still whispering making a gun out of his finger and placing it to his head Jules just looks at him Three young guys obviously in over their heads sit at a table with hamburgers french fries and soda pops laid out One of them flips the loud bolt on the door opening it to reveal Jules and Vincent in the hallway The two men stroll inside The three young caughtoffguard guys are Marvin the black young man who opens the door and will as the scene progresses back into the corner and Brett a white preppylooking sort with a blowdry haircut Vincent and Jules take in the place with their hands in their pockets Jules is the one who does the talking Jules grabs the burger and takes a bite of it Vincent moves to the bed reaches underneath it and pulls out a black snap briefcase Vincent looks up at Jules closing the case As Brett talks Jules takes out his gun and shoots Roger blowing him out of his chair Vince smiles to himself He is not crying or whimpering but he is so full of fear it is as if his body is imploding Brett cannot say a word The boy and girl laugh their laughter putting a pause in there back and forth A waitress comes by with a pot of coffee and pours the young woman's coffee The young man lights up another cigarette calls to the waitress then looks to his girl The waitress comes by pouring him some more The young woman scans the restaurant with this new information and sees all the patrons eating lost in conversations and the busboys going through the motions collecting dishes A smile breaks out on the young woman's face and with that Pumpkin and Honey Bunny grab their weapons stand up and rob the restaurant In the front seat are two young fellas one white one black both wearing cheap black suits with thin black ties under long green dusters Jules is behind the wheel They close the trunk Vincent and Jules their long matching overcoats practically dragging on the ground walk through the courtyard of what looks like a haciendastyle Hollywood apartment building We track alongside They enter the apartment building walk through the reception area and wait for the elevator The elevator arrives the men step inside and the elevator doors open Jules and Vincent exit Steadicam in front of Jules and Vincent as they make a beeline down the hall Jules stops Vincent looks at him a long moment—he is been set up"
        }
      ]
    }
  ]
}