{
  "ground_truth": "Zed continues his silent sing-song with his finger moving left to right, then it stops. After a beat, the camera moves to the right, zeroing in on Marsellus. Zed stands up, grabs Marsellus' chair, and drags him into Russell's old room. As Marsellus is dragged away, he locks eyes with Butch before disappearing behind the door of Russell's old room. Butch looks at The Gimp, who giggles from underneath the mask as if this were the funniest moment in the history of comedy. Zed's hand inches toward the weapon, while Butch grips the sword tighter. Zed studies Butch, who looks hard at Zed. Butch steps aside, revealing Marsellus standing behind him, holding Maynard's pump-action shotgun. Zed is blasted in the groin and goes down screaming in agony. Marsellus, looking down at his whimpering rapist, ejects the used shotgun shell. Butch lowers the sword and hangs back, then leaves Russell's old room through the red curtains. Fabienne slowly approaches the two-wheel demon as Butch looks at her. Fabienne starts to cry, and Butch turns off the engine and reaches out, taking her hand. Fabienne climbs on, and Butch starts her up. With that, the two lovebirds peel away. Meanwhile, we're in the bathroom of the Hollywood apartment we were in earlier with the Fourth Man, who is pacing around the small room, listening hard to what's being said on the other side of the door, clutching his huge silver .357 Magnum. The Fourth Man freaks out, throws himself against the back wall with the gun outstretched in front of him, a look of fear on his face, ready to blow in half anybody fool enough to stick their head through that door, then listens to them talk. Bursting out the door and blowing them all away while they're fooling around is the way to go. The bathroom door bursts open, and the Fourth Man charges out, silver Magnum raised, firing six booming shots from his hand cannon. Jules rises, moving toward Vincent as Vincent prepares to leave. Jules is behind the wheel, Vincent in the passenger seat, and Marvin in the back. Vincent turns to the backseat with the .45 casually in his grip. Vincent's .45 goes bang, and Marvin is hit in the upper chest, below the throat. He gurgles blood and shakes. Later, Jules is bent over a sink, washing his bloody hands, while Vincent stands behind him. Jules rises and dries his hands, and Vincent takes his place at the sink. Vincent finishes, dries his hands on a white towel, and when he is finished, the towel is stained with red. Three men are standing in Jimmie's kitchen, each with a mug of coffee.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Zed persists his quiet chant with his digit moving left to right, then it halts. After a pause, the lens shifts to the right, focusing in on Marsellus. Zed rises up, seizes Marsellus' seat, and pulls him into Russell's old chamber. As Marsellus is dragged away, he locks eyes with Butch before vanishing behind the door of Russell's old chamber. Butch gazes at The Gimp, who chuckles from beneath the mask as if this were the most amusing instant in the chronicle of humor. Zed's hand inches toward the weapon, while Butch clutches the saber tighter. Zed examines Butch, who stares intently at Zed. Butch steps aside, revealing Marsellus positioned behind him, wielding Maynard's pump-action rifle. Zed is struck in the groin and collapses screaming in torment. Marsellus, gazing down at his whimpering violator, expels the spent shotgun shell. Butch lowers the saber and hangs back, then departs Russell's old chamber through the crimson drapes. Fabienne gradually moves toward the motorcycle fiend as Butch looks at her. Fabienne begins to weep, and Butch deactivates the motor and reaches out, taking her hand. Fabienne climbs on, and Butch starts her up. With that, the two sweethearts race away. Meanwhile, we're in the lavatory of the Hollywood apartment we were in prior with the Fourth Man, who is pacing around the small chamber, listening intently to what's being said on the other side of the door, clutching his large argent .357 Magnum. The Fourth Man panics, throws himself against the rear wall with the firearm outstretched in front of him, a look of terror on his visage, ready to blow in half anybody foolish enough to stick their head through that door, then listens to them converse. Bursting out the door and blowing them all away while they're jesting around is the way to go. The bathroom door bursts open, and the Fourth Man surges out, silver Magnum elevated, discharging six resounding shots from his hand cannon. Jules ascends, moving toward Vincent as Vincent prepares to depart. Jules is behind the wheel, Vincent in the passenger seat, and Marvin in the back. Vincent turns to the backseat with the .45 nonchalantly in his grasp. Vincent's .45 goes bang, and Marvin is struck in the upper torso, below the neck. He gurgles blood and trembles. Later, Jules is bent over a basin, cleansing his bloody hands, while Vincent stands behind him. Jules ascends and dries his hands, and Vincent takes his place at the basin. Vincent completes, dries his hands on a white cloth, and when he is concluded, the cloth is stained with crimson. Three men are standing in Jimmie's kitchen, each with a cup of coffee."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Zed's silent sing-song continues with his finger being moved from left to right, then it is stopped by him. After a beat, the rightward movement is initiated by the camera, zeroing in on Marsellus. Marsellus' chair is grabbed by Zed, who stands up and drags him into Russell's old room. Marsellus locks eyes with Butch before he is dragged behind the door of Russell's old room, disappearing from view. The Gimp is looked at by Butch, who giggles from underneath the mask as if this were the funniest moment in the history of comedy. The weapon is approached by Zed's hand, while the sword is gripped tighter by Butch. Butch is studied by Zed, who is looked at hard by Butch. Butch steps aside, revealing Marsellus, who is standing behind him and holding Maynard's pump-action shotgun. The groin of Zed is blasted, and he goes down screaming in agony. Marsellus looks down at his whimpering rapist and ejects the used shotgun shell. The sword is lowered, and Butch hangs back, then Russell's old room is exited by him through the red curtains. The two-wheel demon is slowly approached by Fabienne as she is looked at by Butch. Tears are started by Fabienne, and the engine is turned off by Butch, who reaches out, taking her hand. Fabienne climbs on, and she is started up by Butch. With that, the two lovebirds peel away. Meanwhile, the bathroom of the Hollywood apartment we were in earlier is occupied by the Fourth Man, who is pacing around the small room, listening hard to what's being said on the other side of the door, clutching his huge silver .357 Magnum. The Fourth Man freaks out, throws himself against the back wall with the gun outstretched in front of him, a look of fear on his face, ready to blow in half anybody fool enough to stick their head through that door, then listens to them talk. Bursting out the door and blowing them all away while they're fooling around is the way to go. The bathroom door bursts open, and the Fourth Man charges out, raising the silver Magnum and firing six booming shots from his hand cannon. Jules rises, moving toward Vincent as Vincent prepares to leave. Jules is behind the wheel, Vincent in the passenger seat, and Marvin in the back. The backseat is turned to by Vincent with the .45 casually in his grip. A bang is made by Vincent's .45, and Marvin is hit in the upper chest, below the throat. Blood is gurgled, and he shakes. Later, a sink is bent over by Jules, who is washing his bloody hands, while Vincent stands behind him. Jules rises, drying his hands, and his place at the sink is taken by Vincent. Vincent finishes, dries his hands on a white towel, and when he is finished, the towel is stained with red. Jimmie's kitchen has three men standing in it, each with a mug of coffee."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Zed continues his silent sing-song, moving his finger left to right, then stops. The camera shifts to Marsellus. Zed stands, grabs Marsellus' chair, and drags him into Russell's old room. As Marsellus is taken away, he locks eyes with Butch before disappearing behind the door. Butch looks at The Gimp, who giggles under the mask. Zed reaches for the weapon, while Butch grips the sword tighter. Zed studies Butch, who reveals Marsellus behind him, holding Maynard's shotgun. Zed is shot in the groin and screams in agony. Marsellus ejects the used shell, and Butch lowers the sword, then exits through the red curtains. Fabienne approaches the motorcycle as Butch looks at her. She starts to cry, and Butch turns off the engine, takes her hand, and she climbs on. They ride away. Meanwhile, in the Hollywood apartment bathroom, the Fourth Man paces, listening to the other side of the door, clutching his silver .357 Magnum. He panics, ready to shoot anyone who enters. The bathroom door bursts open, and he charges out, firing six shots. Jules moves toward Vincent as Vincent prepares to leave. Jules drives, Vincent is in the passenger seat, and Marvin is in the back. Vincent turns with the .45 in his grip, accidentally shooting Marvin in the chest. Marvin gurgles blood and shakes. Later, Jules washes his bloody hands, and Vincent stands behind him. Jules dries his hands, and Vincent takes his place at the sink. Vincent finishes, leaving the towel stained red. Three men stand in Jimmie's kitchen, each holding a mug of coffee."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Zed silently moves his finger left to right, then stops. The camera shifts to Marsellus. Zed stands, grabs Marsellus' chair, and drags him into Russell's old room. As Marsellus is taken away, he locks eyes with Butch before disappearing. Butch looks at The Gimp, who giggles under the mask. Zed reaches for a weapon, while Butch grips the sword. Zed studies Butch, who steps aside, revealing Marsellus with Maynard's shotgun. Zed is shot in the groin and screams. Marsellus ejects the shotgun shell. Butch lowers the sword and exits through the red curtains. Fabienne approaches as Butch looks at her. She cries, and Butch turns off the engine, taking her hand. Fabienne climbs on, and they leave. Meanwhile, in the Hollywood apartment bathroom, the Fourth Man listens, clutching a .357 Magnum. He panics, ready to shoot anyone entering. The door bursts open, and he charges out, firing six shots. Jules moves toward Vincent, who prepares to leave. Jules drives, Vincent is in the passenger seat, and Marvin is in the back. Vincent's .45 accidentally fires, hitting Marvin. Later, Jules washes his bloody hands, and Vincent follows, staining a towel red. Three men stand in Jimmie's kitchen with coffee mugs."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Zed, maintaining his eerie, silent sing-song, moves his finger rhythmically from left to right, creating an unsettling atmosphere. Suddenly, his finger halts. After a brief pause, the camera smoothly shifts its focus to the right, honing in on Marsellus with precision. Zed then rises from his position, firmly grasps Marsellus' chair, and proceeds to drag him into the confines of Russell's old room. As Marsellus is forcibly taken away, he locks eyes with Butch, sharing a moment of silent communication before vanishing behind the door of Russell's old room. Butch then turns his attention to The Gimp, who, from beneath his mask, emits a giggle as if this were the most hilarious moment in the annals of comedy. Meanwhile, Zed's hand slowly inches toward the weapon, while Butch tightens his grip on the sword, preparing for what might come next. Zed scrutinizes Butch intently, while Butch returns the gaze with equal intensity. Butch then steps aside, revealing Marsellus standing resolutely behind him, armed with Maynard's pump-action shotgun. In a swift, decisive action, Zed is shot in the groin and collapses, screaming in excruciating agony. Marsellus, looking down at his whimpering assailant, ejects the spent shotgun shell with a sense of finality. Butch lowers the sword, steps back, and exits Russell's old room through the red curtains. Fabienne approaches the two-wheel demon slowly, her eyes fixed on Butch. As she begins to cry, Butch turns off the engine and reaches out, gently taking her hand in his. Fabienne climbs onto the bike, and Butch starts it up once more. With that, the two lovebirds speed away, leaving the chaos behind. Meanwhile, in the bathroom of the Hollywood apartment we visited earlier, the Fourth Man paces anxiously around the cramped space, straining to hear the conversation on the other side of the door, clutching his massive silver .357 Magnum with a tense grip. The Fourth Man, overwhelmed with fear, throws himself against the back wall, gun outstretched in front of him, his face a mask of terror, ready to shoot anyone foolish enough to enter. He listens intently to the voices outside, contemplating bursting through the door and taking them all by surprise. Suddenly, the bathroom door bursts open, and the Fourth Man charges out, silver Magnum raised high, firing six thunderous shots from his powerful hand cannon. Jules rises, moving purposefully toward Vincent as Vincent prepares to make his exit. Jules takes the wheel, with Vincent seated in the passenger seat and Marvin in the back. Vincent casually turns to the backseat, his .45 in hand. The gun goes off with a bang, and Marvin is struck in the upper chest, just below the throat, causing him to gurgle blood and convulse. Later, Jules is bent over a sink, meticulously washing his bloody hands, while Vincent stands behind him, waiting his turn. Jules finishes, dries his hands, and Vincent steps up to the sink. After Vincent finishes washing, he dries his hands on a white towel, which is left stained with red. The scene shifts to Jimmie's kitchen, where three men stand, each holding a mug of coffee, contemplating the events that have unfolded."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Zed, maintaining his eerie yet oddly melodic and almost hypnotic sing-song, moves his finger in a steady, rhythmic motion from left to right, generating a distinctly unsettling atmosphere that permeates the room. Suddenly, without warning, his finger comes to an abrupt stop. After a brief, tense pause, the camera lens smoothly and seamlessly shifts its focus to the right, honing in with precision on Marsellus. Zed then rises from his seated position, firmly and securely grasping Marsellus' chair, and proceeds to drag him with purpose into the confines of Russell's old room. As Marsellus is forcibly taken away, he locks eyes with Butch, sharing a fleeting but intense moment of silent communication before disappearing behind the imposing door of Russell's old room. Butch then turns his attention to The Gimp, who, from beneath his mask, emits a peculiar giggle as if this were the most hilarious moment in the long history of comedy. Meanwhile, Zed's hand slowly inches closer toward the weapon, while Butch tightens his determined grip on the sword, preparing himself for the unknown of what might come next. Zed scrutinizes Butch with great focus and intensity, while Butch returns the gaze with equal ferocity. Butch then steps aside, revealing Marsellus standing resolutely behind him, armed with Maynard's pump-action shotgun. In one swift and decisive action, Zed is shot squarely in the groin and collapses to the floor, screaming in excruciating agony. Marsellus, looking down at his whimpering assailant, ejects the spent shotgun shell with a resolute sense of finality. Butch lowers the sword, steps back, and makes his exit from Russell’s old room through the inviting red curtains. Fabienne approaches the imposing two-wheel demon slowly, her eyes firmly fixed on Butch. As she begins to cry softly, Butch turns off the engine and reaches out, gently taking her hand in his with a comforting touch. Fabienne climbs onto the bike behind him, and Butch starts it up once more. With that, the two lovebirds speed away, leaving the chaos and turmoil behind them. Meanwhile, in the cramped confines of the bathroom of the Hollywood apartment we visited earlier, the Fourth Man paces anxiously around the small space, straining to hear the muffled conversation on the other side of the door, clutching his massive silver .357 Magnum with a tense, white-knuckled grip. The Fourth Man, overwhelmed with fear and anxiety, throws himself against the back wall, gun outstretched defensively in front of him, his face a mask of sheer terror, fully prepared to shoot anyone foolish enough to enter. He listens intently and nervously to the voices outside, contemplating bursting through the door and taking them all by surprise. Suddenly, in a dramatic turn of events, the bathroom door bursts open, and the Fourth Man charges out, silver Magnum raised high, firing six thunderous shots from his powerful and fearsome hand cannon. Jules rises, moving with deliberate purpose toward Vincent as Vincent prepares to make his timely exit. Jules takes the wheel, with Vincent seated comfortably in the passenger seat and Marvin sitting silently in the back. Vincent casually turns to the backseat, his .45 held casually in hand. The gun goes off with an unexpected bang, and Marvin is tragically struck in the upper chest, just below the throat, causing him to gurgle blood and convulse. Later, Jules is bent over a sink, meticulously and carefully washing his bloody hands, while Vincent stands patiently behind him, waiting his turn. Jules finishes, dries his hands on a clean towel, and Vincent steps up to the sink. After Vincent finishes washing, he dries his hands on the same towel, which now is left stained with red. The scene shifts to Jimmie’s kitchen, where three men stand together, each holding a mug of coffee, contemplating in silence the tumultuous events that have unfolded."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Zed continues his silent sing-song, his finger moving rhythmically from left to right, creating an invisible melody in the air, until it comes to a sudden halt. After a brief pause, the camera shifts its focus to the right, honing in on Marsellus with deliberate precision. Zed rises from his seated position, reaches out to grasp Marsellus' chair firmly, and begins to drag him across the floor, the sound of the chair legs scraping echoing in the room, as they make their way into Russell's old room. As Marsellus is being pulled away, he locks eyes with Butch, sharing a moment of silent communication, before he vanishes behind the door of Russell's old room. Butch then shifts his gaze to The Gimp, who, from beneath his mask, emits a giggle that suggests he finds the situation hilariously amusing, as if witnessing the pinnacle of comedy. Meanwhile, Zed's hand slowly inches toward the weapon, a subtle yet tense movement, while Butch tightens his grip on the sword, readying himself for what might come. Zed scrutinizes Butch with a calculating look, while Butch returns the gaze with an intense stare, both men assessing each other. Butch then steps aside, revealing Marsellus standing behind him, now armed with Maynard's pump-action shotgun. In a swift and decisive action, Zed is shot in the groin, collapsing to the ground, screaming in excruciating pain. Marsellus, standing over his whimpering assailant, ejects the spent shotgun shell with a sense of finality. Butch, lowering the sword, steps back and exits Russell's old room through the red curtains, leaving the scene behind. Outside, Fabienne approaches the motorcycle, the two-wheel demon, with a sense of trepidation, as Butch watches her. Overcome with emotion, Fabienne begins to cry, prompting Butch to turn off the engine and reach out to her, taking her hand in a comforting gesture. Fabienne climbs onto the motorcycle, and Butch starts it up again. With a sense of urgency and newfound freedom, the two lovebirds speed away, leaving the chaos behind. Meanwhile, in the bathroom of the Hollywood apartment from earlier, the Fourth Man paces anxiously in the confined space, straining to hear the conversation on the other side of the door, his huge silver .357 Magnum clutched tightly in his hand. Overcome with fear and adrenaline, the Fourth Man throws himself against the back wall, his gun outstretched in front of him, his face a mask of terror, ready to shoot anyone who dares to enter. He listens intently to the voices outside, contemplating his next move. Deciding that bursting out and taking them by surprise is the best course of action, he suddenly flings the bathroom door open and charges out, his silver Magnum raised, unleashing six deafening shots from his powerful weapon. In the aftermath, Jules rises and moves toward Vincent, who is preparing to leave. Jules takes the driver's seat, with Vincent settling into the passenger seat, and Marvin sitting in the back. Vincent casually turns to face the backseat, his .45 in hand, and in an unexpected moment, the gun discharges, hitting Marvin in the upper chest, just below the throat. Marvin gurgles blood and convulses, the life draining from him. Later, Jules is bent over a sink, meticulously washing the blood from his hands, while Vincent stands behind him, waiting his turn. Jules finishes and dries his hands, allowing Vincent to take his place at the sink. Vincent completes his task, drying his hands on a white towel, which becomes stained with red as he finishes. The scene shifts to Jimmie's kitchen, where three men stand, each holding a mug of coffee, a moment of calm amidst the chaos."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Zed continues his silent sing-song, moving his finger left to right before stopping. The camera shifts to Marsellus as Zed stands, grabs Marsellus' chair, and drags him into Russell's old room, locking eyes with Butch before disappearing behind the door. Butch exchanges a look with The Gimp, who giggles under his mask. As Zed reaches for his weapon, Butch tightens his grip on the sword. Butch steps aside, revealing Marsellus with Maynard's shotgun, who then shoots Zed in the groin. Marsellus ejects the used shell while Butch lowers the sword and exits through the red curtains. Fabienne approaches the motorcycle, and Butch turns off the engine, taking her hand as she climbs on. They ride away together.\n\nMeanwhile, in the Hollywood apartment bathroom, the Fourth Man listens intently, clutching his .357 Magnum. Panicked, he braces against the wall, ready to shoot anyone who enters. He bursts out, firing six shots. Jules moves toward Vincent as they prepare to leave, with Jules driving, Vincent in the passenger seat, and Marvin in the back. Vincent turns with his .45, accidentally shooting Marvin in the chest. Later, Jules washes his bloody hands at a sink, followed by Vincent, who dries his hands on a now-red-stained towel. The scene shifts to three men standing in Jimmie's kitchen, each holding a mug of coffee."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Zed continues his silent sing-song with his finger moving left to right, then it stops, reminiscent of a conductor leading an unseen orchestra. After a beat, the camera moves to the right, zeroing in on Marsellus, a powerful crime boss known for his no-nonsense rule. Zed stands up, grabs Marsellus' chair, and drags him into Russell's old room, a place rumored to have been used for unsavory dealings. As Marsellus is dragged away, he locks eyes with Butch, an aging boxer who once defied Marsellus, before disappearing behind the door of Russell's old room. Butch looks at The Gimp, a masked figure chained and controlled, who giggles from underneath the mask as if this were the funniest moment in the history of comedy. Zed's hand inches toward the weapon, a menacing tool of violence, while Butch grips the sword tighter, a katana that symbolizes his newfound courage. Zed studies Butch, who looks hard at Zed. Butch steps aside, revealing Marsellus standing behind him, holding Maynard's pump-action shotgun, a weapon capable of delivering devastating power. Zed is blasted in the groin and goes down screaming in agony. Marsellus, looking down at his whimpering rapist with righteous fury, ejects the used shotgun shell. Butch lowers the sword and hangs back, then leaves Russell's old room through the red curtains, vibrant and foreboding. Fabienne slowly approaches the two-wheel demon, Butch's motorcycle that symbolizes freedom, as Butch looks at her with love and relief. Fabienne starts to cry, and Butch turns off the engine and reaches out, taking her hand as a gesture of comfort. Fabienne climbs on, and Butch starts her up. With that, the two lovebirds peel away, leaving the chaos behind them. Meanwhile, we're in the bathroom of the Hollywood apartment, an old building known for its seedy past, we were in earlier with the Fourth Man, who is pacing around the small room, listening hard to what's being said on the other side of the door, clutching his huge silver .357 Magnum, a revolver known for its stopping power. The Fourth Man freaks out, throws himself against the back wall with the gun outstretched in front of him, a look of fear on his face, ready to blow in half anybody fool enough to stick their head through that door, then listens to them talk, his nerves on edge. Bursting out the door and blowing them all away while they're fooling around is the way to go, the thought racing through his mind. The bathroom door bursts open, and the Fourth Man charges out, silver Magnum raised, firing six booming shots from his hand cannon, echoing like thunder in the small room. Jules rises, moving toward Vincent as Vincent prepares to leave, both of them partners in crime. Jules is behind the wheel, Vincent in the passenger seat, and Marvin in the back, an unfortunate accomplice caught in the crossfire. Vincent turns to the backseat with the .45 casually in his grip, a sign of carelessness and familiarity with violence. Vincent's .45 goes bang, and Marvin is hit in the upper chest, below the throat, a fatal wound that leaves him gurgling blood and shaking. Later, Jules is bent over a sink, washing his bloody hands, while Vincent stands behind him in a moment reminiscent of a baptism, cleansing themselves of guilt. Jules rises and dries his hands, and Vincent takes his place at the sink, each man grappling with their conscience. Vincent finishes, dries his hands on a white towel, and when he is finished, the towel is stained with red, the color of consequence. Three men are standing in Jimmie's kitchen, a small, cluttered space now a sanctuary, each with a mug of coffee."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Zed continues his silent singsong with his finger moving left to right. then it stops. After a beat the camera moves to the right zeroing in on Marsellus. Zed stands up grabs Marsellus' chair and drags him into Russell's old room. As Marsellus is dragged away he locks eyes with Butch before disappearing behind the door of Russell's old room. Butch looks at The Gimp who giggles from underneath the mask as if this were the funniest moment in the history of comedy. Zed's hand inches toward the weapon while Butch grips the sword. tighter. Zed studies Butch who looks hard at Zed. Butch steps aside revealing Marsellus standing behind him holding Maynard's pumpaction shotgun. Zed is blasted in the groin and goes down screaming in agony. Marsellus looking down at his whimpering rapist ejects the used shotgun she will. Butch lowers the sword and hangs back. then leaves Russell's old room through the red curtains. Fabienne slowly approaches the twowheel demon as Butch looks at her. Fabienne starts to cry and Butch turns off the engine and reaches out taking her hand. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Fabienne climbs on and Butch starts her up. With that the two lovebirds peel away. Meanwhile we are in the bathroom of the Hollywood apartment we were in earlier with the Fourth Man who is pacing around the small room listening hard to what is being said on the other side of the door clutching his huge silver 357 Magnum. The Fourth Man freaks out throws himself against the back wall with the gun outstretched in front of him a look of fear on his face ready to blow in half. anybody fool enough to stick their head through that door then listens to them talk. Bursting out the door and blowing them all away while they are fooling around is the way to go. The bathroom door bursts open and the Fourth Man charges out silver Magnum raised firing six booming shots from his hand cannon. Jules rises moving toward Vincent as Vincent prepares to leave. Jules is behind the wheel. Vincent in the passenger seat and Marvin in the back. Vincent turns to the backseat with the 45 casually in his grip. Vincent's 45 goes bang and Marvin is hit in the upper chest below the throat. He gurgles blood and shakes. Later Jules is bent over a sink washing his bloody hands while Vincent stands behind him. Jules rises and dries his hands and Vincent takes his place at the sink. Vincent finishes dries his hands on a white towel and when he is finished the towel is stained with red. Three men are standing in Jimmie's kitchen each with a mug of coffee."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Zed continues his silent singsong with his finger moving left to right. then it stops. After a beat the camera moves to the right zeroing in on Marsellus. Zed stands up grabs Marsellus' chair and drags him into Russell's old room. As Marsellus is dragged away he locks eyes with Butch before disappearing behind the door of Russell's old room. Butch looks at The Gimp who giggles from underneath the mask as if this were the funniest moment in the history of comedy. Zed's hand inches toward the weapon while Butch grips the sword. tighter. Zed studies Butch who looks hard at Zed. Butch steps aside revealing Marsellus standing behind him holding Maynard's pumpaction shotgun. Zed is blasted in the groin and goes down screaming in agony. Marsellus looking down at his whimpering rapist ejects the used shotgun she will. Butch lowers the sword and hangs back. then leaves Russell's old room through the red curtains. Fabienne slowly approaches the twowheel demon as Butch looks at her. Fabienne starts to cry and Butch turns off the engine and reaches out taking her hand. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. Fabienne climbs on and Butch starts her up. With that the two lovebirds peel away. Meanwhile we are in the bathroom of the Hollywood apartment we were in earlier with the Fourth Man who is pacing around the small room listening hard to what is being said on the other side of the door clutching his huge silver 357 Magnum. The Fourth Man freaks out throws himself against the back wall with the gun outstretched in front of him a look of fear on his face ready to blow in half. anybody fool enough to stick their head through that door then listens to them talk. Bursting out the door and blowing them all away while they are fooling around is the way to go. The bathroom door bursts open and the Fourth Man charges out silver Magnum raised firing six booming shots from his hand cannon. Jules rises moving toward Vincent as Vincent prepares to leave. Jules is behind the wheel. Vincent in the passenger seat and Marvin in the back. Vincent turns to the backseat with the 45 casually in his grip. Vincent's 45 goes bang and Marvin is hit in the upper chest below the throat. He gurgles blood and shakes. Later Jules is bent over a sink washing his bloody hands while Vincent stands behind him. Jules rises and dries his hands and Vincent takes his place at the sink. Vincent finishes dries his hands on a white towel and when he is finished the towel is stained with red. Three men are standing in Jimmie's kitchen each with a mug of coffee."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Zed continues his silent singsong with his finger moving left to right. then it stops. After a beat the camera moves to the right zeroing in on Marsellus. Zed stands up grabs Marsellus' chair and drags him into Russell's old room. As Marsellus is dragged away he locks eyes with Butch before disappearing behind the door of Russell's old room. Butch looks at The Gimp who giggles from underneath the mask as if this were the funniest moment in the history of comedy. Zed's hand inches toward the weapon while Butch grips the sword. tighter. Jules is behind the wheel. Vincent in the passenger seat and Marvin in the back. Vincent turns to the backseat with the 45 casually in his grip. Vincent's 45 goes bang and Marvin is hit in the upper chest below the throat. He gurgles blood and shakes. Later Jules is bent over a sink washing his bloody hands while Vincent stands behind him. Jules rises and dries his hands and Vincent takes his place at the sink. Vincent finishes dries his hands on a white towel and when he is finished the towel is stained with red. Three men are standing in Jimmie's kitchen each with a mug of coffee."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Zed continues his silent singsong with his finger moving left to right. then it stops. After a beat the camera moves to the right zeroing in on Marsellus. Later Jules is bent over a sink washing his bloody hands while Vincent stands behind him. Jules rises and dries his hands and Vincent takes his place at the sink. Vincent finishes dries his hands on a white towel and when he is finished the towel is stained with red. Three men are standing in Jimmie's kitchen each with a mug of coffee."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Jupiter continues his quiet ballet with his toe sliding east to west, then it pauses. After a pause, the microphone slides to the west, honing in on Constantine. Jupiter leaps up, snatches Constantine's stool, and hauls him into Boris' ancient cavern. As Constantine is hauled away, he exchanges glances with Ringo before vanishing behind the entrance of Boris' ancient cavern. Ringo peers at The Jester, who chuckles from beneath the veil as if this were the most amusing incident in the annals of humor. Jupiter’s foot inches toward the shield, while Ringo clenches the lance firmer. Jupiter examines Ringo, who stares intensely at Jupiter. Ringo sidesteps, revealing Constantine standing behind him, clutching Fiona's lever-action rifle. Jupiter is struck in the knee and collapses howling in torment. Constantine, gazing down at his sniveling knave, expels the spent rifle cartridge. Ringo lowers the lance and steps aside, then exits Boris' ancient cavern through the blue drapes. Clementine gingerly approaches the three-wheel monster as Ringo glances at her. Clementine begins to sob, and Ringo shuts off the motor and extends his arm, grasping her palm. Clementine mounts, and Ringo revs it up. With that, the two sweethearts speed off. Meanwhile, we're in the lavatory of the Nashville flat we visited earlier with the Fifth Woman, who is pacing around the cramped chamber, eavesdropping intently on the conversation beyond the entrance, clutching her enormous golden .44 Magnum. The Fifth Woman panics, flings herself against the back partition with the weapon outstretched in front of her, a look of terror on her countenance, ready to sever in half anyone foolish enough to insert their head through that entrance, then listens to them chatter. Charging through the entrance and obliterating them all while they’re jesting is the plan. The lavatory entrance bursts ajar, and the Fifth Woman sprints out, golden Magnum elevated, discharging six thunderous blasts from her arm cannon. Adam ascends, advancing toward Simon as Simon readies to depart. Adam is steering, Simon in the co-driver's seat, and Ralph in the rear. Simon twists to the rear seat with the .38 lightly in his clutches. Simon's .38 goes pop, and Ralph is struck in the lower abdomen, above the stomach. He chokes on blood and trembles. Later, Adam is hunched over a basin, scrubbing his stained palms, while Simon stands nearby. Adam rises and wipes his hands, and Simon occupies the basin. Simon completes, wipes his hands on a black cloth, and when he is done, the cloth is smeared with maroon. Three women are lounging in Harriet's dining area, each with a goblet of tea."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In a tense sequence, Zed interrupts his actions, shifting focus to Marsellus, whom he drags into a room. As they lock eyes, Butch notices The Gimp's amusement. Butch grips a sword tightly as Zed eyes a weapon. Butch then reveals Marsellus behind him, holding a shotgun, who shoots Zed in the groin. Marsellus stands over a writhing Zed, while Butch leaves the room. Outside, Fabienne approaches Butch, and they escape together. Meanwhile, the Fourth Man, in the bathroom, panics and bursts out with a Magnum, firing wildly. In another scene, Jules and Vincent are with Marvin; Vincent accidentally shoots Marvin with his .45. Later, Jules and Vincent wash up, leaving a bloody towel behind as they gather in Jimmie's kitchen with coffee mugs."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Three men are standing in Jimmie's kitchen each with a mug of coffee Vincent finishes dries his hands on a white towel and when he is finished the towel is stained with red  Jules rises and dries his hands and Vincent takes his place at the sink  Later Jules is bent over a sink washing his bloody hands while Vincent stands behind him  He gurgles blood and shakes  Vincent's 45 goes bang and Marvin is hit in the upper chest below the throat  Vincent turns to the backseat with the 45 casually in his grip  Vincent in the passenger seat and Marvin in the back  Jules is behind the wheel  Jules rises moving toward Vincent as Vincent prepares to leave  cannon  The bathroom door bursts open and the Fourth Man charges out silver Magnum raised firing six booming shots from his hand  Bursting out the door and blowing them all away while they're fooling around is the way to go  anybody fool enough to stick their head through that door then listens to them talk  The Fourth Man freaks out throws himself against the back wall with the gun outstretched in front of him a look of fear on his face ready to blow in half  Meanwhile we're in the bathroom of the Hollywood apartment we were in earlier with the Fourth Man who is pacing around the small room listening hard to what's being said on the other side of the door clutching his huge silver 357 Magnum  With that the two lovebirds peel away  Fabienne climbs on and Butch starts her up  Fabienne starts to cry and Butch turns off the engine and reaches out taking her hand  Fabienne slowly approaches the twowheel demon as Butch looks at her  then leaves Russell's old room through the red curtains  Butch lowers the sword and hangs back  Marsellus looking down at his whimpering rapist ejects the used shotgun shell  Zed is blasted in the groin and goes down screaming in agony  Butch steps aside revealing Marsellus standing behind him holding Maynard's pumpaction shotgun  Zed studies Butch who looks hard at Zed  tighter  Zed's hand inches toward the weapon while Butch grips the sword  Butch looks at The Gimp who giggles from underneath the mask as if this were the funniest moment in the history of comedy  As Marsellus is dragged away he locks eyes with Butch before disappearing behind the door of Russell's old room  Zed stands up grabs Marsellus' chair and drags him into Russell's old room  After a beat the camera moves to the right zeroing in on Marsellus  then it stops  Zed continues his silent singsong with his finger moving left to right "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "then it stops Zed continues his silent singsong with his finger moving left to right Zed stands up grabs Marsellus' chair and drags him into Russell's old room After a beat the camera moves to the right zeroing in on Marsellus Butch looks at The Gimp who giggles from underneath the mask as if this were the funniest moment in the history of comedy As Marsellus is dragged away he locks eyes with Butch before disappearing behind the door of Russell's old room tighter Zed's hand inches toward the weapon while Butch grips the sword Butch steps aside revealing Marsellus standing behind him holding Maynard's pumpaction shotgun Zed studies Butch who looks hard at Zed Marsellus looking down at his whimpering rapist ejects the used shotgun she will Zed is blasted in the groin and goes down screaming in agony then leaves Russell's old room through the red curtains Butch lowers the sword and hangs back Fabienne starts to cry and Butch turns off the engine and reaches out taking her hand Fabienne slowly approaches the twowheel demon as Butch looks at her With that the two lovebirds peel away Fabienne climbs on and Butch starts her up The Fourth Man freaks out throws himself against the back wall with the gun outstretched in front of him a look of fear on his face ready to blow in half Meanwhile we are in the bathroom of the Hollywood apartment we were in earlier with the Fourth Man who is pacing around the small room listening hard to what is being said on the other side of the door clutching his huge silver 357 Magnum Bursting out the door and blowing them all away while they are fooling around is the way to go anybody fool enough to stick their head through that door then listens to them talk Jules rises moving toward Vincent as Vincent prepares to leave The bathroom door bursts open and the Fourth Man charges out silver Magnum raised firing six booming shots from his hand cannon Vincent in the passenger seat and Marvin in the back Jules is behind the wheel Vincent's 45 goes bang and Marvin is hit in the upper chest below the throat Vincent turns to the backseat with the 45 casually in his grip Later Jules is bent over a sink washing his bloody hands while Vincent stands behind him He gurgles blood and shakes Vincent finishes dries his hands on a white towel and when he is finished the towel is stained with red Jules rises and dries his hands and Vincent takes his place at the sink Three men are standing in Jimmie's kitchen each with a mug of coffee"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "With that the two lovebirds peel away  Meanwhile we're in the bathroom of the Hollywood apartment we were in earlier with the Fourth Man who is pacing around the small room listening hard to what's being said on the other side of the door clutching his huge silver 357 Magnum  The Fourth Man freaks out throws himself against the back wall with the gun outstretched in front of him a look of fear on his face ready to blow in half  anybody fool enough to stick their head through that door then listens to them talk  Bursting out the door and blowing them all away while they're fooling around is the way to go  The bathroom door bursts open and the Fourth Man charges out silver Magnum raised firing six booming shots from his hand  cannon  Jules rises moving toward Vincent as Vincent prepares to leave  Jules is behind the wheel  Vincent in the passenger seat and Marvin in the back  Vincent turns to the backseat with the 45 casually in his grip  Vincent's 45 goes bang and Marvin is hit in the upper chest below the throat  He gurgles blood and shakes  Later Jules is bent over a sink washing his bloody hands while Vincent stands behind him  Jules rises and dries his hands and Vincent takes his place at the sink  Vincent finishes dries his hands on a white towel and when he is finished the towel is stained with red  Three men are standing in Jimmie's kitchen each with a mug of coffee Zed continues his silent singsong with his finger moving left to right  then it stops  After a beat the camera moves to the right zeroing in on Marsellus  Zed stands up grabs Marsellus' chair and drags him into Russell's old room  As Marsellus is dragged away he locks eyes with Butch before disappearing behind the door of Russell's old room  Butch looks at The Gimp who giggles from underneath the mask as if this were the funniest moment in the history of comedy  Zed's hand inches toward the weapon while Butch grips the sword  tighter  Zed studies Butch who looks hard at Zed  Butch steps aside revealing Marsellus standing behind him holding Maynard's pumpaction shotgun  Zed is blasted in the groin and goes down screaming in agony  Marsellus looking down at his whimpering rapist ejects the used shotgun shell  Butch lowers the sword and hangs back  then leaves Russell's old room through the red curtains  Fabienne slowly approaches the twowheel demon as Butch looks at her  Fabienne starts to cry and Butch turns off the engine and reaches out taking her hand  Fabienne climbs on and Butch starts her up "
        }
      ]
    }
  ]
}