{
  "ground_truth": "Lance continues his frenzied search as Jody calls to him. As he continues searching, flipping and knocking over things, Jody appears in the doorway, and Lance spins toward her. Lance angrily knocks over a pile of items and leaves the shot, heading for the living room. Vincent is bent over Mia, talking softly to her, when Lance reenters the room. Lance bends down by the black case brought in by Jody, opens it, and begins preparing the needle for injection. Vince rips her blouse open as Jody stumbles back into the room, hanging back from the action. Vince points to Mia's right breast, and Lance glances over and nods. As Lance readies the injection, Vincent looks up at Jody, who runs to the desk, opens the top drawer, and, in her enthusiasm, spills the contents (bills, papers, pens) to the floor. The injection is ready. Lance hands Vincent the needle, and Jody hurriedly joins them in the huddle with a big fat red magic marker in her hand. Vincent grabs the marker from Jody and makes a big red dot on Mia's body where her heart is. Then, once you do, push down on the plunger. Vincent lifts the needle up above his head in a stabbing motion, looking down on Mia, who is fading fast. Vincent's eyes narrow, ready to do this, while Lance, on his knees right beside Vincent, does not know what to expect. A red dot is on Mia's body, and the needle is raised, ready to strike. Jody's face is alive with anticipation. The needle is in the air, poised like a rattler ready to strike. The needle leaves frame, thrusting down hard as Vincent brings it down, stabbing Mia in the chest. Mia's head is jolted from the impact, and the syringe plunger is pushed down, pumping the adrenaline out through the needle. Mia's eyes pop wide open, and she lets out a hellish cry of the banshee. She bolts up in a sitting position, needle stuck in her chest screaming. Vincent, Lance, and Jody, who were in sitting positions in front of Mia, jump back, scared to death. Mia's scream runs out, and she slowly starts taking breaths of air. The other three, now scooted halfway across the room, shaken to their bones, look to see if she's alright. Mia, still breathing, not looking up at them, speaks in a relatively normal voice and then turns around. Vincent is out of the car, standing on the walkway, with a big distance between the two. Mia smiles, and the two walk toward each other, holding out their hands to shake, which they do. Mia lets go of Vincent's hand and silently makes the see-no-evil, hear-no-evil, and speak-no-evil sign with her hands.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Lance persists in his frantic quest as Jody calls to him. As he persists searching, flipping and toppling over objects, Jody materializes in the entrance, and Lance swivels toward her. Lance furiously knocks over a stack of items and departs the frame, moving toward the living area. Vincent is hunched over Mia, speaking softly to her, when Lance reenters the space. Lance crouches by the black container brought in by Jody, opens it, and commences preparing the syringe for injection. Vince tears her blouse open as Jody stumbles back into the room, hanging back from the activity. Vince indicates Mia's right breast, and Lance glances over and acknowledges. As Lance prepares the injection, Vincent gazes up at Jody, who runs to the desk, opens the top drawer, and, in her enthusiasm, spills the contents (invoices, documents, pens) to the ground. The injection is prepared. Lance hands Vincent the syringe, and Jody hastily joins them in the huddle with a big fat red magic marker in her hand. Vincent snatches the marker from Jody and creates a large red dot on Mia's body where her heart is. Then, once you do, press down on the plunger. Vincent raises the syringe up above his head in a stabbing motion, gazing down on Mia, who is fading fast. Vincent's eyes narrow, ready to do this, while Lance, on his knees right beside Vincent, does not know what to expect. A red dot is on Mia's body, and the syringe is elevated, ready to strike. Jody's face is alive with anticipation. The syringe is in the air, poised like a rattler ready to strike. The syringe exits the frame, thrusting down forcefully as Vincent brings it down, stabbing Mia in the chest. Mia's head is jolted from the impact, and the syringe plunger is pushed down, pumping the adrenaline out through the syringe. Mia's eyes pop wide open, and she lets out a hellish scream of the banshee. She bolts up in a sitting position, syringe stuck in her chest, screaming. Vincent, Lance, and Jody, who were in sitting positions in front of Mia, jump back, terrified to death. Mia's scream runs out, and she slowly starts taking breaths of air. The other three, now scooted halfway across the space, shaken to their cores, look to see if she's alright. Mia, still breathing, not looking up at them, speaks in a relatively normal voice and then turns around. Vincent is out of the vehicle, standing on the pathway, with a considerable distance between the two. Mia smiles, and the two walk toward each other, holding out their hands to shake, which they do. Mia releases Vincent's hand and silently makes the see-no-evil, hear-no-evil, and speak-no-evil gesture with her hands."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Lance's frenzied search is continued as he is called to by Jody. As the search is continued by him, flipping and knocking over things, the doorway is appeared in by Jody, and she is spun toward by Lance. A pile of items is angrily knocked over by Lance and the shot is left as he heads for the living room. Vincent bends over Mia, talking softly to her, when Lance enters the room again. The black case brought in by Jody is bent down by Lance, opened, and the needle is prepared for injection by him. Her blouse is ripped open by Vince as Jody stumbles back into the room, hanging back from the action. Mia's right breast is pointed to by Vince, and Lance glances over and nods. As the injection is readied by Lance, Jody is looked up at by Vincent, who runs to the desk, opens the top drawer, and spills the contents (bills, papers, pens) to the floor in her enthusiasm. The injection is made ready. The needle is handed to Vincent by Lance, and they are joined hurriedly in the huddle by Jody with a big fat red magic marker in her hand. The marker is grabbed by Vincent from Jody and a big red dot is made on Mia's body where her heart is. Then, the plunger is pushed down once you do. The needle is lifted above his head by Vincent in a stabbing motion, looking down on Mia, who is fading fast. Vincent's eyes narrow, ready to do this, while, on his knees right beside Vincent, Lance does not know what to expect. Mia's body has a red dot on it, and the needle is raised, ready to strike. Jody's face is made alive with anticipation. The needle is poised in the air like a rattler ready to strike. The frame is left by the needle, thrusting down hard as Mia is stabbed in the chest by Vincent. Mia's head is jolted by the impact, and the syringe plunger is pushed down, pumping the adrenaline out through the needle. Mia's eyes pop wide open, and a hellish cry of the banshee is let out by her. In a sitting position, she bolts up, needle stuck in her chest screaming. In sitting positions in front of Mia, Vincent, Lance, and Jody are scared to death and jump back. Mia's scream runs out, and breaths of air are slowly taken by her. Now scooted halfway across the room, shaken to their bones, the other three look to see if she's alright. Mia, still breathing, not looking up at them, speaks in a relatively normal voice and then turns around. The car is out of by Vincent, standing on the walkway, with a big distance between the two. Mia smiles, and each other is walked toward by the two, holding out their hands to shake, which is done by them. Vincent's hand is let go of by Mia and the see-no-evil, hear-no-evil, and speak-no-evil sign is silently made with her hands."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Lance frantically searches as Jody calls him. While knocking over items, Jody appears in the doorway, and Lance angrily exits toward the living room. Vincent, bent over Mia, speaks softly when Lance returns, opens Jody's black case, and prepares an injection. Vince rips Mia's blouse as Jody hesitantly reenters. Vince points to her right breast, and Lance nods. Jody spills a drawer's contents and joins with a red marker. Vincent marks Mia's chest and raises the needle, ready to inject. The needle strikes Mia's chest, and she screams as adrenaline pumps through her. Eyes wide, she sits up with the needle in her chest. Vincent, Lance, and Jody jump back, terrified. Mia breathes slowly and speaks normally, then sees Vincent standing at a distance. She smiles, and they walk toward each other, shaking hands. Mia makes the see-no-evil, hear-no-evil, speak-no-evil gesture."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Lance frantically searches as Jody calls him. He knocks over items and heads to the living room, where Vincent is with Mia. Lance prepares a needle from Jody's black case. Vince exposes Mia's chest as Jody retrieves a marker, spilling drawer contents. Lance hands Vince the needle; Jody gives him a marker for Mia's heart. Vincent lifts the needle, poised to strike. He stabs Mia's chest, injecting adrenaline. Mia bolts up, screaming with the needle in her chest, scaring everyone. Mia then breathes normally and speaks. Later, Vincent and Mia meet, shake hands, and Mia makes the see-no-evil, hear-no-evil, speak-no-evil sign."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Lance persists in his frantic and chaotic search, with Jody calling out to him in the midst of his desperate quest. As he frantically continues his search, flipping over objects and knocking things to the ground in an erratic manner, Jody suddenly appears in the doorway. At that moment, Lance swiftly spins around to face her, his expression one of frustration and anger. In a fit of irritation, Lance forcefully knocks over a precarious pile of items before swiftly exiting the current shot, making his way toward the living room. There, in the living room, Vincent is bent over Mia, engaged in soft, hushed conversation with her. This is when Lance reenters the room, his presence felt once more. \n\nLance crouches down beside the black case that Jody had brought into the room. With determination, he opens the case and begins the meticulous process of preparing the needle for the critical injection. At the same time, Vince tears open Mia's blouse with urgency as Jody stumbles back into the room, choosing to hang back, almost hesitantly, from the unfolding action. Vince gestures towards Mia's right breast, indicating the precise spot, and Lance gives a quick nod of acknowledgment. As Lance focuses on getting the injection ready, Vincent takes a moment to glance up at Jody. In response, Jody dashes to the desk, opens the top drawer with fervor, and in her enthusiasm, causes its contents—including bills, scattered papers, and several pens—to spill and scatter all over the floor. \n\nWith the injection now prepared and ready, Lance hands Vincent the needle. Jody, in her eagerness, quickly joins them in their tense huddle, holding a fat red magic marker in her hand. Vincent seizes the marker from Jody's grasp and proceeds to make a prominent red dot on Mia's body, precisely marking the location where her heart is situated. Then, following instructions, he prepares to push down on the syringe's plunger. Vincent raises the needle high above his head, adopting a decisive stabbing posture, his gaze fixed on Mia, who is rapidly fading. Vincent's eyes narrow with concentration and readiness to proceed, while Lance, kneeling close beside Vincent, is filled with uncertainty, unsure of what the outcome will be. The red ink mark is visible on Mia's body, and the needle is poised, ready to deliver its crucial strike. \n\nJody's face is animated, brimming with anticipation. The needle hangs in the air, poised like a vigilant rattlesnake ready to strike its prey. As Vincent forcefully brings the needle down, it leaves the frame, descending with precision to stab Mia squarely in the chest. The impact causes Mia's head to jerk violently, and the syringe's plunger is depressed, effectively pumping the life-saving adrenaline through its hollow body. In an instant, Mia's eyes fly wide open, and she emits a blood-curdling, banshee-like scream. She bolts upright into a sitting position, the needle still protruding from her chest, screaming at the top of her lungs. \n\nReacting with instinctive fear, Vincent, Lance, and Jody, who had previously been seated in front of Mia, are taken aback and jump back, utterly frightened and startled. Mia's chilling scream eventually fades away, and she begins to take slow, deep breaths, drawing air back into her lungs. The trio, now having scooted halfway across the room, visibly shaken and rattled to their core, cautiously look on to see if Mia is alright. For her part, Mia, still breathing steadily, does not immediately look at them but speaks using a relatively normal voice before finally turning around. Outside, Vincent is seen out of the car, standing on the walkway, with a significant distance now separating the two individuals. Mia offers a warm smile, and the two of them walk toward each other, extending their hands to engage in a handshake, which they amicably do. After letting go of Vincent's hand, Mia silently performs the see-no-evil, hear-no-evil, and speak-no-evil gesture using her hands."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Lance continues with relentless determination, persisting in his frantic and disorganized search. Meanwhile, Jody's voice echoes as she calls out to him amidst his desperate quest. As Lance feverishly carries on with his search, he flips over various objects and inadvertently knocks things to the ground in an erratic manner. Suddenly, Jody appears in the doorway, catching his attention. At that very moment, Lance swiftly spins around to face her, his expression a mix of frustration and anger. In an impulsive fit of irritation, Lance forcefully knocks over a precariously balanced pile of items before he swiftly exits the current shot, making his way toward the living room with great urgency. Once there, in the living room, Vincent is bent over Mia, engaged in a soft and hushed conversation with her. This is when Lance reenters the room, his presence once more making an impact.\n\nLance crouches down beside the black case that Jody had brought into the room. With a sense of determination, he opens the case and begins the meticulous process of preparing the needle for the all-important injection. Simultaneously, Vince tears open Mia’s blouse with urgency as Jody stumbles back into the room. She opts to hang back, almost hesitantly, from the unfolding action. Vince gestures toward Mia's right breast, indicating with precision the exact spot, and Lance gives a quick nod of acknowledgment in return. As Lance focuses intently on getting the injection ready, Vincent takes a brief moment to glance up at Jody. In response, Jody dashes to the desk, fervently opening the top drawer, and, in her enthusiasm, inadvertently causes its contents—including bills, scattered papers, and numerous pens—to spill and scatter across the floor.\n\nWith the injection now meticulously prepared and ready, Lance hands Vincent the needle. Jody, eager to be involved, quickly joins them in their tense huddle, holding a fat red magic marker in her hand. Vincent seizes the marker from Jody's grasp and proceeds to make a prominent red dot on Mia's body, precisely marking the location where her heart is situated. Then, following instructions carefully, he prepares to push down on the syringe's plunger. Vincent raises the needle high above his head, assuming an authoritative stabbing posture, his gaze fixed intently on Mia, who is rapidly fading. Vincent's eyes narrow with concentration and a readiness to proceed, while Lance, kneeling close beside Vincent, is filled with uncertainty and apprehension, unsure of what the outcome will be. The red ink mark is clearly visible on Mia's body, and the needle is poised, ready to deliver its crucial strike.\n\nJody’s face is animated, brimming with anticipation and intensity. The needle hangs in the air, poised like a vigilant rattlesnake ready to strike its prey. As Vincent forcefully brings the needle down, it leaves the frame, descending with precision to stab Mia squarely in the chest. The impact causes Mia's head to jerk violently, and the syringe’s plunger is depressed, effectively pumping the life-saving adrenaline through its hollow body. In an instant, Mia's eyes fly wide open, and she emits a blood-curdling, banshee-like scream. She bolts upright into a sitting position, the needle still protruding from her chest, screaming at the top of her lungs.\n\nReacting with instinctive fear, Vincent, Lance, and Jody, who had previously been seated in front of Mia, are taken aback and jump back, utterly frightened and startled by the sudden turn of events. Mia's chilling scream eventually fades away, and she begins to take slow, deep breaths, drawing air back into her lungs with measured control. The trio, now having scooted halfway across the room, visibly shaken and rattled to their core, cautiously look on to see if Mia is alright. For her part, Mia, still breathing steadily, does not immediately look at them but speaks using a relatively normal voice before finally turning around. Outside, Vincent is seen standing out of the car, positioned on the walkway, with a significant distance now establishing itself between the two individuals. Mia offers a warm, reassuring smile, and the two of them walk toward each other, extending their hands in a friendly gesture to engage in a handshake, which they amicably do. After letting go of Vincent's hand, Mia silently performs the see-no-evil, hear-no-evil, and speak-no-evil gesture using her hands, adding a silent but meaningful conclusion to the series of tense and chaotic events."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Lance is deep in a frenzied search, repeatedly shifting his gaze and frantically moving around, flipping and knocking over anything in his path with a sense of urgency, when he suddenly hears Jody’s voice calling out to him. Despite her calls, he persists with his chaotic search, his movements becoming increasingly frantic as he ransacks the area, creating a mess of overturned objects. Jody's presence becomes noticeable as she appears in the doorway, her silhouette framed by the light from the other room, prompting Lance to abruptly spin toward her, his expression marked by frustration. In a moment of heightened emotion, Lance, unable to contain his anger, violently knocks over a pile of items, sending them crashing to the ground, before swiftly exiting the frame and heading toward the living room. Meanwhile, Vincent is crouched over Mia, speaking to her in soft, soothing tones, desperately trying to bring her back to consciousness. Lance then reenters the room, his focus now shifting as he immediately bends down to the black case that Jody brought in. He methodically opens it, his hands working quickly as he begins to prepare the needle for the crucial injection. Vince, seeing the urgency of the situation, tears open Mia’s blouse to expose her chest, his movements quick and precise, as Jody reenters the room, her initial hesitance showing as she hangs back from the flurry of activity. Vince directs Lance’s attention to Mia’s right breast by pointing, and a quick glance and nod from Lance confirm his understanding. With the injection preparation underway, Vincent briefly looks up at Jody, who, in a burst of energy, dashes to the desk and frantically opens the top drawer. Her enthusiasm leads to an accidental spill, scattering bills, papers, and pens all over the floor. With the injection finally ready, Lance hands the needle over to Vincent, and Jody hurriedly joins the group, clutching a big, fat red magic marker in her grip, her eyes wide with anticipation. Vincent swiftly grabs the marker from Jody and makes a decisive, large red dot on Mia's chest, marking the precise location of her heart. He then raises the needle high above his head in a dramatic, stabbing motion, his gaze fixed intently on Mia, who is fading fast, her life hanging in the balance. Vincent's eyes narrow, mentally preparing himself for what he is about to do, while Lance remains on his knees beside him, filled with uncertainty about what might happen next. The red dot stands out starkly on Mia's body, and the needle is poised in the air, ready to strike like a coiled rattler. In one fluid motion, the needle leaves the frame, thrusting down hard as Vincent brings it down with force, piercing Mia’s chest. The impact jolts Mia's head sharply, and as the syringe plunger is pressed down, adrenaline is pumped through the needle into her body. Instantly, Mia's eyes snap open wide, and she emits a hellish cry reminiscent of a banshee, her body reacting violently as she bolts upright into a sitting position, the needle still embedded in her chest, her scream echoing through the room. The suddenness of her revival causes Vincent, Lance, and Jody, who had been seated in front of her, to recoil in fear, instinctively jumping back in shock and terror. Mia’s scream tapers off, and she starts to draw in deep, ragged breaths, each inhale steadying her further. The trio, now having scooted halfway across the room, watch in amazement and concern as they assess Mia’s condition, visibly shaken to their cores by the ordeal. Despite their fear, they look on intently to see if she’s truly alright. Mia, still regaining her composure and breathing heavily, eventually speaks in a relatively normal voice without lifting her gaze to meet theirs, before she turns around. In a new scene, Vincent is seen standing outside the car on the walkway, maintaining a significant distance between him and the vehicle. Mia, now smiling, approaches Vincent, and the two close the gap between them as they extend their hands and exchange a firm handshake. After shaking his hand, Mia releases it and, in a gesture that speaks volumes without words, makes the see-no-evil, hear-no-evil, and speak-no-evil sign with her hands, encapsulating the surreal experience they've just undergone."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Lance frantically searches the room despite Jody calling to him. Jody appears in the doorway as Lance angrily knocks over a pile of items and heads to the living room. There, Vincent softly talks to Mia until Lance reenters, kneeling by the case Jody brought. He opens it to prepare an injection. As Vince rips open Mia's blouse, Jody returns, staying back initially, but then runs to the desk, spilling its contents while searching for something. With the injection ready, Lance gives Vincent the needle, and Jody joins them with a red marker. Vincent marks Mia's chest, raises the needle, and plunges it down, injecting adrenaline. Mia jolts up, screaming as the needle sticks in her chest, startling Lance, Vincent, and Jody. Mia gradually calms down, breathing more steadily as the others, now at a distance, watch anxiously to see if she's alright. Once stable, Mia speaks normally and turns around. Outside, she and Vincent share a smile, walk toward each other, shake hands, and Mia makes the see-no-evil, hear-no-evil, speak-no-evil sign silently."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Lance, caught in the chaos of his frenzied search through the dimly lit apartment, as if it were a scene from a noir film, continues his desperate quest as Jody calls to him from the hallway. As he continues searching, flipping and knocking over things in his frantic state, Jody appears in the doorway, backlit by the hallway light, and Lance spins toward her, his frustration palpable. Lance angrily knocks over a pile of items from a local flea market, their eclectic nature adding to the disorder, and leaves the shot, heading for the living room with a sense of urgency. Vincent is bent over Mia, a young woman caught in a dangerous whirlwind of events, talking softly to her as if trying to coax her back to consciousness, when Lance reenters the room. Lance bends down by the black case, a vintage medical bag brought in by Jody, opens it, and begins preparing the needle for injection with the calm precision of someone who has done this before. Vince rips her blouse open, exposing the delicate fabric as Jody stumbles back into the room, hanging back from the action as the gravity of the situation settles in. Vince points to Mia's right breast, where her heart beats faintly beneath, and Lance glances over and nods with a grim determination. As Lance readies the adrenaline injection, the drug known for its life-saving properties in emergency situations, Vincent looks up at Jody, who runs to the mid-century desk, opens the top drawer in haste, and, in her enthusiasm, spills the contents—bills, papers, pens—onto the wooden floor. The injection is ready, an adrenaline shot capable of reversing cardiac arrest. Lance hands Vincent the needle, and Jody hurriedly joins them in the huddle with a big fat red magic marker in her hand, a tool that seems out of place in the intensity of the moment. Vincent grabs the marker from Jody and makes a big red dot on Mia's chest, the rudimentary medical guide marking where her heart is. Then, once you do, push down on the plunger comes the unspoken instruction. Vincent lifts the needle up above his head in a stabbing motion, reminiscent of a scene from an intense medical drama, looking down on Mia, who is fading fast, her life slipping away by the second. Vincent's eyes narrow, channeling his inner resolve, ready to do this, while Lance, on his knees right beside Vincent, watches with a mix of apprehension and anticipation, not knowing what to expect. A red dot, stark against Mia's pale skin, is on her body, and the needle is raised, ready to strike with the precision of a surgeon's hand. Jody's face, alive with anticipation, mirrors the tension in the room. The needle is in the air, poised like a rattler ready to strike in the desert light. The needle leaves the frame, thrusting down hard as Vincent brings it down with calculated force, stabbing Mia in the chest with a move akin to a scene from a crime thriller. Mia's head is jolted from the impact, and the syringe plunger is pushed down, releasing the adrenaline through the needle with a rush that defies expectation. Mia's eyes pop wide open, and she lets out a hellish cry of the banshee, a wailing sound as if announcing her return to the living. She bolts up in a sitting position, needle stuck in her chest, screaming with the intensity of life regained. Vincent, Lance, and Jody, who were in sitting positions in front of Mia, jump back, scared to death by the suddenness of her revival. Mia's scream runs out, echoing like a banshee's wail in an old castle, and she slowly starts taking breaths of air, the sound of life in each draw. The other three, now scooted halfway across the room, shaken to their bones by the dramatic turn of events, look to see if she's alright, their eyes wide with a mixture of fear and relief. Mia, still breathing, not looking up at them, speaks in a relatively normal voice, her calmness a stark contrast to the chaos that just unfolded, and then turns around. Vincent is out of the car, standing on the walkway paved with stones, with a big distance between the two, as if the events inside were a distant memory. Mia smiles, her face softening from the tension, and the two walk toward each other, holding out their hands to shake, which they do, sealing their shared experience with a simple gesture. Mia lets go of Vincent's hand and silently makes the see-no-evil, hear-no-evil, and speak-no-evil sign with her hands, a gesture steeped in ancient wisdom, as if to say some things are better left unspoken."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Mia smiles and the two walk toward each other holding out their hands to shake which they do Lance continues his frenzied search as Jody calls to him Lance continues his frenzied search as Jody calls to him As he continues searching flipping and knocking over things Jody appears in the doorway and Lance spins toward her Lance angrily knocks over a pile of items and leaves the shot heading for the living room Vincent is bent over Mia talking softly to her when Lance reenters the room Lance bends down by the black case brought in by Jody opens it and begins preparing the needle for injection Vince rips her blouse open as Jody stumbles back into the room hanging back from the action Mia's eyes pop wide open and she let us out a hellish cry of the banshee Vincent is out of the car standing on the walkway with a big distance between the two Vincent is bent over Mia talking softly to her when Lance reenters the room The needle is in the air poised like a rattler ready to strike Vince points to Mia's right breast and Lance glances over and nods Jody's face is alive with anticipation As Lance readies the injection Vincent looks up at Jody who runs to the desk opens the top drawer and in her enthusiasm spills the contents bills papers pens to the floor Mia's scream runs out and she slowly starts taking breaths of air The injection is ready As Lance readies the injection Vincent looks up at Jody who runs to the desk opens the top drawer and in her enthusiasm spills the contents As he continues searching flipping and knocking over things Jody appears in the doorway and Lance spins toward her Lance hands Vincent the needle and Jody hurriedly joins them in the huddle with a big fat red magic marker in her hand Vincent grabs the marker from Jody and makes a big red dot on Mia's body where her heart is Lance bends down by the black case brought in by Jody opens it and begins preparing the needle for injection Then once you do push down on the plunger Vincent lifts the needle up above his head in a stabbing motion looking down on Mia who is fading fast Vincent's eyes narrow ready to do this while Lance on his knees right beside Vincent's eyes narrow ready to do this while Lance on his knees right beside Vincent does not know what to expect A red dot is on Mia's body and the needle is raised ready to strike Jody's face is alive with anticipation The needle is in the air poised like a rattler ready to strike The needle leaves frame thrusting down hard as Vincent brings it down stabbing Mia in the chest Lance angrily knocks over a pile of items and leaves the shot heading for the living room Mia's head is jolted from the impact and the syringe plunger is pushed down pumping the adrenaline out through the needle Mia's eyes pop wide open and she let us out a hellish cry of the banshee She bolts up in a sitting position needle stuck in her chest screaming Vincent bills papers pens to the floor Mia still breathing not looking up at them speaks in a relatively normal voice and then turns around Lance and Jody who were in sitting positions in front of Mia jump back scared to death Mia's scream runs out and she slowly starts taking breaths of air The other three now scooted halfway across the room shaken to their bones look to see if she is alright Mia still breathing not looking up at them speaks in a relatively normal voice and then turns around Vincent is out of the car standing on the walkway with a big distance between the two Mia smiles and the two walk toward each other holding out their hands to shake which they do Mia let us go of Vincent's hand and silently makes the seenoevil hearnoevil and speaknoevil sign with her hands"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Lance continues his frenzied search as Jody calls to him. As he continues searching flipping and knocking over things Jody appears in the doorway and Lance spins toward her. Lance angrily knocks over a pile of items and leaves the shot heading for the living room. Vincent is bent over Mia talking softly to her when Lance reenters the room. Lance bends down by the black case brought in by Jody opens it and begins preparing the needle for injection. Vince rips her blouse open as Jody stumbles back into the room hanging back from the action. Vince points to Mia's right breast and Lance glances over and nods. As Lance readies the injection Vincent looks up at Jody who runs to the desk opens the top drawer and in her enthusiasm spills the contents. bills papers pens to the floor. The injection is ready. Lance hands Vincent the needle and Jody hurriedly joins them in the huddle with a big fat red magic marker in her hand. Vincent grabs the marker from Jody and makes a big red dot on Mia's body where her heart is. Then once you do push down on the plunger Vincent lifts the needle up above his head in a stabbing motion looking down on Mia who is fading fast. Vincent's eyes narrow ready to do this while Lance on his knees right beside. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Vincent does not know what to expect. A red dot is on Mia's body and the needle is raised ready to strike. Jody's face is alive with anticipation. The needle is in the air poised like a rattler ready to strike. The needle leaves frame thrusting down hard as Vincent brings it down stabbing Mia in the chest. Mia's head is jolted from the impact and the syringe plunger is pushed down pumping the adrenaline out through the needle. Mia's eyes pop wide open and she let us out a hellish cry of the banshee. She bolts up in a sitting position needle stuck in her chest screaming Vincent. Lance and Jody who were in sitting positions in front of Mia jump back scared to death. Mia's scream runs out and she slowly starts taking breaths of air. The other three now scooted halfway across the room shaken to their bones look to see if she is alright. Mia still breathing not looking up at them speaks in a relatively normal voice and then turns around. Vincent is out of the car standing on the walkway with a big distance between the two. Mia smiles and the two walk toward each other holding out their hands to shake which they do. Mia let us go of Vincent's hand and silently makes the seenoevil hearnoevil and speaknoevil sign with her hands."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Lance continues his frenzied search as Jody calls to him. As he continues searching flipping and knocking over things Jody appears in the doorway and Lance spins toward her. Lance angrily knocks over a pile of items and leaves the shot heading for the living room. Vincent is bent over Mia talking softly to her when Lance reenters the room. Lance bends down by the black case brought in by Jody opens it and begins preparing the needle for injection. Vince rips her blouse open as Jody stumbles back into the room hanging back from the action. Vince points to Mia's right breast and Lance glances over and nods. As Lance readies the injection Vincent looks up at Jody who runs to the desk opens the top drawer and in her enthusiasm spills the contents. bills papers pens to the floor. The injection is ready. Lance hands Vincent the needle and Jody hurriedly joins them in the huddle with a big fat red magic marker in her hand. Vincent grabs the marker from Jody and makes a big red dot on Mia's body where her heart is. Then once you do push down on the plunger Vincent lifts the needle up above his head in a stabbing motion looking down on Mia who is fading fast. Vincent's eyes narrow ready to do this while Lance on his knees right beside. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. Vincent does not know what to expect. A red dot is on Mia's body and the needle is raised ready to strike. Jody's face is alive with anticipation. The needle is in the air poised like a rattler ready to strike. The needle leaves frame thrusting down hard as Vincent brings it down stabbing Mia in the chest. Mia's head is jolted from the impact and the syringe plunger is pushed down pumping the adrenaline out through the needle. Mia's eyes pop wide open and she let us out a hellish cry of the banshee. She bolts up in a sitting position needle stuck in her chest screaming Vincent. Lance and Jody who were in sitting positions in front of Mia jump back scared to death. Mia's scream runs out and she slowly starts taking breaths of air. The other three now scooted halfway across the room shaken to their bones look to see if she is alright. Mia still breathing not looking up at them speaks in a relatively normal voice and then turns around. Vincent is out of the car standing on the walkway with a big distance between the two. Mia smiles and the two walk toward each other holding out their hands to shake which they do. Mia let us go of Vincent's hand and silently makes the seenoevil hearnoevil and speaknoevil sign with her hands."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Lance continues his frenzied search as Jody calls to him. As he continues searching flipping and knocking over things Jody appears in the doorway and Lance spins toward her. Lance angrily knocks over a pile of items and leaves the shot heading for the living room. Vincent is bent over Mia talking softly to her when Lance reenters the room. Lance bends down by the black case brought in by Jody opens it and begins preparing the needle for injection. Vince rips her blouse open as Jody stumbles back into the room hanging back from the action. Vince points to Mia's right breast and Lance glances over and nods. She bolts up in a sitting position needle stuck in her chest screaming Vincent. Lance and Jody who were in sitting positions in front of Mia jump back scared to death. Mia's scream runs out and she slowly starts taking breaths of air. The other three now scooted halfway across the room shaken to their bones look to see if she is alright. Mia still breathing not looking up at them speaks in a relatively normal voice and then turns around. Vincent is out of the car standing on the walkway with a big distance between the two. Mia smiles and the two walk toward each other holding out their hands to shake which they do. Mia let us go of Vincent's hand and silently makes the seenoevil hearnoevil and speaknoevil sign with her hands."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Lance continues his frenzied search as Jody calls to him. As he continues searching flipping and knocking over things Jody appears in the doorway and Lance spins toward her. Lance angrily knocks over a pile of items and leaves the shot heading for the living room. Vincent is out of the car standing on the walkway with a big distance between the two. Mia smiles and the two walk toward each other holding out their hands to shake which they do. Mia let us go of Vincent's hand and silently makes the seenoevil hearnoevil and speaknoevil sign with her hands."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Bobby continues his frenzied search as Carla calls to him. As he continues searching, flipping and knocking over things, Carla appears in the doorway, and Bobby spins toward her. Bobby angrily knocks over a pile of items and leaves the shot, heading for the living room. Derek is bent over Sue, talking softly to her, when Bobby reenters the room. Bobby bends down by the black case brought in by Carla, opens it, and begins preparing the needle for injection. Dan rips her blouse open as Carla stumbles back into the room, hanging back from the action. Dan points to Sue's right breast, and Bobby glances over and nods. As Bobby readies the injection, Derek looks up at Carla, who runs to the desk, opens the top drawer, and, in her enthusiasm, spills the contents (bills, papers, pens) to the floor. The injection is ready. Bobby hands Derek the needle, and Carla hurriedly joins them in the huddle with a big fat red magic marker in her hand. Derek grabs the marker from Carla and makes a big red dot on Sue's body where her heart is. Then, once you do, push down on the plunger. Derek lifts the needle up above his head in a stabbing motion, looking down on Sue, who is fading fast. Derek's eyes narrow, ready to do this, while Bobby, on his knees right beside Derek, does not know what to expect. A red dot is on Sue's body, and the needle is raised, ready to strike. Carla's face is alive with anticipation. The needle is in the air, poised like a rattler ready to strike. The needle leaves frame, thrusting down hard as Derek brings it down, stabbing Sue in the chest. Sue's head is jolted from the impact, and the syringe plunger is pushed down, pumping the adrenaline out through the needle. Sue's eyes pop wide open, and she lets out a hellish cry of the banshee. She bolts up in a sitting position, needle stuck in her chest screaming. Derek, Bobby, and Carla, who were in sitting positions in front of Sue, jump back, scared to death. Sue's scream runs out, and she slowly starts taking breaths of air. The other three, now scooted halfway across the room, shaken to their bones, look to see if she's alright. Sue, still breathing, not looking up at them, speaks in a relatively normal voice and then turns around. Derek is out of the car, standing on the walkway, with a big distance between the two. Sue smiles, and the two walk toward each other, holding out their hands to shake, which they do. Sue lets go of Derek's hand and silently makes the see-no-evil, hear-no-evil, and speak-no-evil sign with her hands."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Lance continues his frenzied search as Jody calls to him. As he continues searching, flipping and knocking over things, Jody appears in the entrance, and Lance spins toward her. Lance angrily knocks over a pile of clothes and leaves the shot, heading for the hallway. Vincent is bent over Mia, talking softly to her, when Lance reenters the space. Lance bends down by the silver backpack brought in by Jody, opens it, and begins preparing the thermometer for injection. Vince rips her jacket open as Jody stumbles back into the area, hanging back from the action. Vince points to Mia's left shoulder, and Lance glances over and nods. As Lance readies the injection, Vincent looks up at Jody, who runs to the shelf, opens the middle drawer, and, in her enthusiasm, spills the contents (coins, magazines, keys) to the floor. The injection is ready. Lance hands Vincent the thermometer, and Jody hurriedly joins them in the cluster with a big fat blue paintbrush in her hand. Vincent grabs the paintbrush from Jody and makes a big blue dot on Mia's body where her heart is. Then, once you do, push down on the plunger. Vincent lifts the thermometer up above his head in a stabbing motion, looking down on Mia, who is fading fast. Vincent's eyes narrow, ready to do this, while Lance, on his knees right beside Vincent, does not know what to expect. A blue dot is on Mia's body, and the thermometer is raised, ready to strike. Jody's face is alive with anticipation. The thermometer is in the air, poised like a hawk ready to strike. The thermometer leaves frame, thrusting down hard as Vincent brings it down, stabbing Mia in the ribcage. Mia's head is jolted from the impact, and the syringe plunger is pushed down, pumping the adrenaline out through the thermometer. Mia's eyes pop wide open, and she lets out a hellish cry of the banshee. She bolts up in a sitting position, thermometer stuck in her chest screaming. Vincent, Lance, and Jody, who were in sitting positions in front of Mia, jump back, scared to death. Mia's scream runs out, and she slowly starts taking breaths of air. The other three, now scooted halfway across the area, shaken to their bones, look to see if she's alright. Mia, still breathing, not looking up at them, speaks in a relatively normal voice and then turns around. Vincent is out of the tram, standing on the pathway, with a big distance between the two. Mia smiles, and the two walk toward each other, holding out their hands to shake, which they do. Mia lets go of Vincent's hand and silently makes the see-no-evil, hear-no-evil, and speak-no-evil sign with her hands."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Lance continues his hectic exploration as Jody yells to him. As he keeps exploring, tossing and scattering things, Jody emerges in the doorway, and Lance twirls toward her. Lance furiously scatters a stack of items and exits the shot, striding toward the living room. Vincent is crouched over Mia, whispering softly to her, when Lance reenters the room. Lance kneels down by the black case brought in by Jody, unseals it, and starts arranging the needle for operation. Vince tears her blouse apart as Jody trips back into the room, lingering back from the action. Vince gestures to Mia's right breast, and Lance peers over and agrees. As Lance assembles the injection, Vincent glances up at Jody, who rushes to the desk, lifts the top drawer, and, in her excitement, scatters the contents (bills, papers, pens) to the floor. The injection is arranged. Lance passes Vincent the needle, and Jody quickly joins them in the cluster with a big fat red magic marker in her hand. Vincent snatches the marker from Jody and marks a big red circle on Mia's body where her heart is. Then, once you do, press down on the plunger. Vincent raises the needle up above his head in a thrusting motion, gazing down on Mia, who is fading fast. Vincent's eyes narrow, resolved to do this, while Lance, on his knees right beside Vincent, is uncertain what to predict. A red circle is on Mia's body, and the needle is elevated, ready to descend. Jody's face is electrified with excitement. The needle is in the air, poised like a predator ready to plunge. The needle exits frame, driving down hard as Vincent lowers it, piercing Mia in the chest. Mia's head snaps from the impact, and the syringe plunger is pressed down, discharging the adrenaline out through the needle. Mia's eyes spring wide open, and she lets out an eerie wail of the banshee. She springs up in a sitting position, needle embedded in her chest wailing. Vincent, Lance, and Jody, who were in seated positions in front of Mia, leap back, terrified to death. Mia's wail fades out, and she gradually starts drawing breaths of air. The other three, now edged halfway across the room, rattled to their cores, look to see if she's alright. Mia, still breathing, not glancing up at them, speaks in a relatively normal voice and then rotates around. Vincent is out of the car, standing on the pathway, with a considerable distance between the two. Mia grins, and the two stride toward each other, extending their hands to grasp, which they do. Mia releases Vincent's hand and silently performs the see-no-evil, hear-no-evil, and speak-no-evil gesture with her hands."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Trevor continues his frenzied search as Nancy calls to him. As he continues searching, flipping and knocking over things, Nancy appears in the doorway, and Trevor spins toward it. Trevor angrily knocks over a pile of instruments and leaves the shot, heading for the dining room. Oscar is bent over Clara, talking softly to it, when Trevor reenters the area. Trevor bends down by the brown suitcase brought in by Nancy, opens it, and begins preparing the guitar for performance. Oscar rips its jacket open as Nancy stumbles back into the area, hanging back from the spectacle. Oscar points to Clara's right knee, and Trevor glances over and nods. As Trevor readies the performance, Oscar looks up at Nancy, who runs to the cabinet, opens the top shelf, and, in its enthusiasm, spills the contents (cups, books, utensils) to the ground. The guitar is ready. Trevor hands Oscar the guitar, and Nancy hurriedly joins them in the group with a big fat blue rubber duck in its hand. Oscar grabs the duck from Nancy and makes a big blue dot on Clara's body where its belly is. Then, once you do, strum on the strings. Oscar lifts the guitar up above its head in a swinging motion, looking down on Clara, who is fading fast. Oscar's eyes narrow, ready to do this, while Trevor, on its knees right beside Oscar, does not know what to expect. A blue dot is on Clara's body, and the guitar is raised, ready to swing. Nancy's face is alive with anticipation. The guitar is in the air, poised like a rattler ready to strike. The guitar leaves frame, swinging down hard as Oscar brings it down, swinging at Clara in the chest. Clara's head is jolted from the impact, and the guitar string is strummed, sending the melody out through the instrument. Clara's eyes pop wide open, and it lets out a hellish cry of the banshee. It bolts up in a sitting position, guitar stuck in its chest screaming. Oscar, Trevor, and Nancy, who were in sitting positions in front of Clara, jump back, scared to death. Clara's scream runs out, and it slowly starts taking breaths of air. The other three, now scooted halfway across the area, shaken to their bones, look to see if it's alright. Clara, still breathing, not looking up at them, speaks in a relatively normal voice and then turns around. Oscar is out of the train, standing on the sidewalk, with a big distance between the two. Clara smiles, and the two walk toward each other, holding out their feet to high-five, which they do. Clara lets go of Oscar's foot and silently makes the see-no-evil, hear-no-evil, and speak-no-evil sign with its feet."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Baxter meanders his leisurely tour as Carla shouts to him. As he meanders exploring, twisting and scattering objects, Carla emerges in the hallway, and Baxter whirls toward her. Baxter cheerfully scatters a stack of items and exits the frame, heading for the dining room. Oscar is crouched over Nina, whispering softly to her, when Baxter reenters the room. Baxter crouches next to the brown case brought in by Carla, opens it, and begins arranging the thread for embroidery. Oscar tears her scarf as Carla staggers back into the room, staying away from the activity. Oscar nods to Nina's left shoulder, and Baxter glances over and nods. As Baxter arranges the stitch, Oscar looks up at Carla, who rushes to the cabinet, opens the bottom drawer, and, in her excitement, scatters the contents (coins, pamphlets, brushes) onto the carpet. The stitch is arranged. Baxter hands Oscar the thread, and Carla quickly joins them in the circle with a large blue highlighter in her hand. Oscar grabs the highlighter from Carla and marks a big blue circle on Nina's body where her shoulder is. Then, once you do, pull up on the yarn. Oscar raises the thread high above his arm in a sweeping motion, gazing down at Nina, who is fading fast. Oscar's eyes narrow, ready to do this, while Baxter, on his knees right beside Oscar, does not know what to expect. A blue circle is on Nina's body, and the thread is raised, ready to strike. Carla's face is alive with expectation. The thread is in the air, poised like an ostler ready to strike. The thread exits view, thrusting down gently as Oscar brings it towards the material, stitching Nina in the shoulder. Nina's head jolts from the motion, and the yarn is pulled, forming the embroidery through the fabric. Nina's eyes burst wide open, and she lets out a piercing laugh of delight. She sits up in an upright position, thread attached to her shoulder, laughing. Oscar, Baxter, and Carla, who were in crouched positions in front of Nina, leap back, surprised beyond belief. Nina's laughter trails off, and she slowly starts taking breaths of air. The other three, now shifted halfway across the room, stunned to their cores, look to see if she's alright. Nina, still breathing, not glancing up at them, speaks in a relatively normal voice and then pivots around. Oscar is out of the bicycle, standing on the pathway, with a broad distance between the two. Nina grins, and the two toward each other, extending their hands to clap, which they perform. Nina releases Oscar's hand and silently makes the see-no-evil, hear-no-evil, and speak-no-evil gesture with her hands."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Lance persists in his frantic assembly as Jody sings to him. As he continues assembling, twirling and setting up things, Jody appears at the window, and Lance twirls toward her. Lance angrily sets up a stack of books and leaves the picture, heading for the garage. Vincent is hunched over Mia, whispering loudly to her, when Lance reenters the patio. Lance crouches down by the green crate brought in by Jody, unlocks it, and begins selecting the spoon for stirring. Vince tears her scarf open as Jody dances back into the patio, hanging back from the activity. Vince gestures to Mia's left arm, and Lance peers over and nods. As Lance selects the spoon, Vincent glances up at Jody, who skips to the cabinet, unlocks the bottom drawer, and, in her excitement, scatters the contents (toys, cards, brushes) to the carpet. The spoon is selected. Lance passes Vincent the spoon, and Jody eagerly joins them in the circle with a big fat blue crayon in her hand. Vincent snatches the crayon from Jody and marks a big blue dot on Mia's arm where a vein is. Then, once you do, push down on the lever. Vincent hoists the spoon up above his shoulder in a throwing motion, gazing at Mia, who is slipping away. Vincent's eyes narrow, ready to execute this, while Lance, on his feet right beside Vincent, does not know what to anticipate. A blue dot is on Mia's arm, and the spoon is lifted, prepared to slash. Jody's face is alive with suspense. The spoon is in the air, poised like a hawk ready to dive. The spoon leaves the scene, thrusting down hard as Vincent brings it down, jabbing Mia in the arm. Mia's head jerks from the contact, and the ladle lever is pushed down, releasing the liquid out through the spoon. Mia's eyes burst wide open, and she lets out a screech of the banshee. She shoots up into a standing position, spoon lodged in her arm, shrieking. Vincent, Lance, and Jody, who were in standing positions in front of Mia, leap back, startled to the core. Mia's shriek fades out, and she gradually begins drawing breaths of air. The trio, now slid halfway across the patio, rattled to their cores, glance to see if she's fine. Mia, still breathing, not looking up at them, speaks in a relatively calm voice and then turns around. Vincent is outside the house, standing on the path, with a large expanse between the two. Mia grins, and the two move toward each other, extending their arms to shake, which they do. Mia releases Vincent's arm and silently gestures the see-no-evil, hear-no-evil, and speak-no-evil sign with her hands."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Benny persists in his chaotic investigation as Carla yells at him. While he keeps investigating, tossing and crashing into objects, Carla appears by the window, and Benny twirls toward her. Benny furiously hurls a stack of books and exits the scene, moving toward the kitchen. Oliver is crouched over Nina, whispering gently to her, when Benny reenters the area. Benny kneels beside the blue backpack carried in by Carla, unzips it, and starts adjusting the compass for navigation. Oliver tears her jacket apart as Carla stumbles back into the space, keeping a distance from the commotion. Oliver gestures at Nina's left shoulder, and Benny peeks over and agrees. As Benny completes the setup, Oliver glances at Carla, who dashes to the shelf, pulls out the bottom drawer, and, in her excitement, dumps the contents (coins, notebooks, brushes) onto the ground. The compass is set. Benny passes Oliver the compass, and Carla quickly joins them at the gathering with a large green crayon in her grip. Oliver snatches the crayon from Carla and makes a large green circle on Nina's jacket where her shoulder is. Then, once you do, move the needle down. Oliver raises the compass high above his head in a slicing gesture, staring down at Nina, who is fading quickly. Oliver's eyes narrow, prepared to proceed, while Benny, crouching next to Oliver, is uncertain about what will happen. A green circle is on Nina's jacket, and the compass is elevated, ready to strike. Carla's face is aglow with excitement. The compass hovers in the air, poised like a hawk ready to dive. The compass exits the frame, driving down forcefully as Oliver lowers it, puncturing Nina in the shoulder. Nina's head jerks from the blow, and the compass needle is pressed down, injecting the cortisone through the compass. Nina's eyes snap wide open, and she emits a terrifying wail of agony. She leaps up into an upright stance, compass embedded in her shoulder wailing. Oliver, Benny, and Carla, who were in prone positions before Nina, leap back, frightened out of their wits. Nina's wail fades out, and she gradually begins taking breaths of air. The other three, now shuffled halfway back to the entrance, trembling to their cores, glance to see if she's alright. Nina, still breathing, not looking up at them, talks in a relatively calm voice and then turns away. Oliver is out of the cabin, standing on the pathway, with a substantial distance between the pair. Nina grins, and the two stroll toward each other, extending their arms to clasp, which they do. Nina releases Oliver's hand and quietly performs the see-no-evil, hear-no-evil, and speak-no-evil gesture with her fingers."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Lance frantically searches as Jody calls out. Entering the living room, he finds Vincent speaking softly to an unconscious Mia. Lance prepares a needle from a black case, and as Jody joins, Vincent marks a spot on Mia's chest with a red marker. Vincent raises the needle and stabs it into Mia's chest, injecting adrenaline. Mia jolts upright, screaming, causing Lance, Vincent, and Jody to jump back. As Mia regains her breath and composure, Vincent and Mia stand apart but soon approach each other to shake hands. Mia then makes the see-no-evil, hear-no-evil, speak-no-evil gesture."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Mia let us go of Vincent's hand and silently makes the seenoevil hearnoevil and speaknoevil sign with her hands Mia smiles and the two walk toward each other holding out their hands to shake which they do Vincent is out of the car standing on the walkway with a big distance between the two Mia still breathing not looking up at them speaks in a relatively normal voice and then turns around The other three now scooted halfway across the room shaken to their bones look to see if she is alright Mia's scream runs out and she slowly starts taking breaths of air Lance and Jody who were in sitting positions in front of Mia jump back scared to death She bolts up in a sitting position needle stuck in her chest screaming Vincent Mia's eyes pop wide open and she let us out a hellish cry of the banshee Mia's head is jolted from the impact and the syringe plunger is pushed down pumping the adrenaline out through the needle The needle leaves frame thrusting down hard as Vincent brings it down stabbing Mia in the chest The needle is in the air poised like a rattler ready to strike Jody's face is alive with anticipation A red dot is on Mia's body and the needle is raised ready to strike Vincent does not know what to expect Vincent's eyes narrow ready to do this while Lance on his knees right beside Then once you do push down on the plunger Vincent lifts the needle up above his head in a stabbing motion looking down on Mia who is fading fast Vincent grabs the marker from Jody and makes a big red dot on Mia's body where her heart is Lance hands Vincent the needle and Jody hurriedly joins them in the huddle with a big fat red magic marker in her hand The injection is ready bills papers pens to the floor As Lance readies the injection Vincent looks up at Jody who runs to the desk opens the top drawer and in her enthusiasm spills the contents Vince points to Mia's right breast and Lance glances over and nods Vince rips her blouse open as Jody stumbles back into the room hanging back from the action Lance bends down by the black case brought in by Jody opens it and begins preparing the needle for injection Vincent is bent over Mia talking softly to her when Lance reenters the room Lance angrily knocks over a pile of items and leaves the shot heading for the living room As he continues searching flipping and knocking over things Jody appears in the doorway and Lance spins toward her Lance continues his frenzied search as Jody calls to him"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The needle leaves frame thrusting down hard as Vincent brings it down stabbing Mia in the chest Vincent does not know what to expect Lance hands Vincent the needle and Jody hurriedly joins them in the huddle with a big fat red magic marker in her hand Lance and Jody who were in sitting positions in front of Mia jump back scared to death She bolts up in a sitting position needle stuck in her chest screaming Vincent Vince points to Mia's right breast and Lance glances over and nods Vince rips her blouse open as Jody stumbles back into the room hanging back from the action Then once you do push down on the plunger Vincent lifts the needle up above his head in a stabbing motion looking down on Mia who is fading fast Vincent grabs the marker from Jody and makes a big red dot on Mia's body where her heart is A red dot is on Mia's body and the needle is raised ready to strike The injection is ready The other three now scooted halfway across the room shaken to their bones look to see if she is alright Mia's head is jolted from the impact and the syringe plunger is pushed down pumping the adrenaline out through the needle Mia let us go of Vincent's hand and silently makes the seenoevil hearnoevil and speaknoevil sign with her hands Jody's face is alive with anticipation Vincent is out of the car standing on the walkway with a big distance between the two As he continues searching flipping and knocking over things Jody appears in the doorway and Lance spins toward her Vincent's eyes narrow ready to do this while Lance on his knees right beside Lance angrily knocks over a pile of items and leaves the shot heading for the living room The needle is in the air poised like a rattler ready to strike Mia smiles and the two walk toward each other holding out their hands to shake which they do Lance bends down by the black case brought in by Jody opens it and begins preparing the needle for injection Mia still breathing not looking up at them speaks in a relatively normal voice and then turns around As Lance readies the injection Vincent looks up at Jody who runs to the desk opens the top drawer and in her enthusiasm spills the contents bills papers pens to the floor Mia's scream runs out and she slowly starts taking breaths of air Lance continues his frenzied search as Jody calls to him Vincent is bent over Mia talking softly to her when Lance reenters the room Mia's eyes pop wide open and she let us out a hellish cry of the banshee"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "A red dot is on Mia's body and the needle is raised ready to strike Jody's face is alive with anticipation The needle is in the air poised like a rattler ready to strike The needle leaves frame thrusting down hard as Vincent brings it down stabbing Mia in the chest Mia's head is jolted from the impact and the syringe plunger is pushed down pumping the adrenaline out through the needle Mia's eyes pop wide open and she let us out a hellish cry of the banshee She bolts up in a sitting position needle stuck in her chest screaming Vincent Lance and Jody who were in sitting positions in front of Mia jump back scared to death Mia's scream runs out and she slowly starts taking breaths of air The other three now scooted halfway across the room shaken to their bones look to see if she is alright Mia still breathing not looking up at them speaks in a relatively normal voice and then turns around Vincent is out of the car standing on the walkway with a big distance between the two Mia smiles and the two walk toward each other holding out their hands to shake which they do Mia let us go of Vincent's hand and silently makes the seenoevil hearnoevil and speaknoevil sign with her hands Lance continues his frenzied search as Jody calls to him As he continues searching flipping and knocking over things Jody appears in the doorway and Lance spins toward her Lance angrily knocks over a pile of items and leaves the shot heading for the living room Vincent is bent over Mia talking softly to her when Lance reenters the room Lance bends down by the black case brought in by Jody opens it and begins preparing the needle for injection Vince rips her blouse open as Jody stumbles back into the room hanging back from the action Vince points to Mia's right breast and Lance glances over and nods As Lance readies the injection Vincent looks up at Jody who runs to the desk opens the top drawer and in her enthusiasm spills the contents bills papers pens to the floor The injection is ready Lance hands Vincent the needle and Jody hurriedly joins them in the huddle with a big fat red magic marker in her hand Vincent grabs the marker from Jody and makes a big red dot on Mia's body where her heart is Then once you do push down on the plunger Vincent lifts the needle up above his head in a stabbing motion looking down on Mia who is fading fast Vincent's eyes narrow ready to do this while Lance on his knees right beside Vincent does not know what to expect"
        }
      ]
    }
  ]
}