{
  "ground_truth": "Butch pulls on his tee-shirt, and Esmarelda bounces in her seat with excitement as he looks at her license. We DOLLY around a phone booth as Butch talks inside, then hangs up the phone. Butch holds up a hundred dollar bill, causing Esmarelda's eyes to light up. She goes to take it, but Butch holds it for some time before giving her the bill. Butch flicks the switch back, making the room dark again, and climbs into bed, spooning Fabienne from behind. When Butch and Fabienne speak to each other, they speak in babytalk. Fabienne rolls over, and Butch gets on top of her. They kiss, and Butch's hand goes out of frame and starts massaging her crotch. Fabienne reacts, lies her head back, and Butch continues to massage her crotch. Butch kisses her on the mouth and then his head goes down out of frame to carry out the oral pleasure. Fabienne's face is alone in the frame; she finishes drying her hair and wraps the towel like a turban on her head, handing him a towel as Butch exits the bathroom. We stay on Fabienne as she brushes her teeth while Butch keeps on talking from the other room. Fabienne brushes her teeth, and as we watch her for a moment or two, she remembers something. She walks out of the bathroom to ask Butch a question, only to find him sound asleep in bed. She looks at him for a moment as Butch squints down the front of the bed at her, trying to focus. Fabienne enters the room, laughs, and gives Butch a sweet long kiss. Butch climbs out of bed and starts pulling clothes out of the suitcase that Fabienne brought. Butch is finished dressing as he goes through the suitcase. By now, Butch is frantically rummaging through the suitcase, throwing clothes. Fabienne can hardly speak, as she’s never seen Butch this way. Fabienne is crying and scared. Butch lowers his voice, which only serves to make him more menacing, and he bends down in front of the woman who has sunk to the floor, then rises as Fabienne is still sniffling. Butch goes to the closet, puts on his high school jacket, and rises from the floor. The little Honda races toward its destination as fast as its little engine will take it. He has parked his car a couple of blocks from his apartment to check things out before he goes boppin' through the front door. Butch walks down the alley until he gets to another street, then he discreetly glances out. Everything seems normal, more or less the right number of cars in the street. None of the parked cars appear out of place, basically looking like normal morning activity in front of Butch's home.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Butch tugs on his t-shirt, and Esmarelda jounces in her spot with enthusiasm as he gazes at her permit. We DOLLY around a telephone kiosk as Butch converses inside, then places down the receiver. Butch raises a hundred-dollar note, causing Esmarelda's eyes to illuminate. She proceeds to grasp it, but Butch holds it for a while before handing her the note. Butch flicks the lever back, making the chamber dim again, and climbs into bed, embracing Fabienne from behind. When Butch and Fabienne converse with each other, they speak in babytalk. Fabienne turns over, and Butch gets atop of her. They smooch, and Butch's hand moves out of frame and begins rubbing her crotch. Fabienne responds, reclines her head back, and Butch continues to rub her crotch. Butch kisses her on the lips and then his head descends out of frame to execute the oral indulgence. Fabienne's visage is solitary in the frame; she completes drying her hair and wraps the towel like a turban on her head, handing him a towel as Butch leaves the lavatory. We remain on Fabienne as she polishes her teeth while Butch continues speaking from the other chamber. Fabienne polishes her teeth, and as we observe her for a moment or two, she recalls something. She strides out of the lavatory to query Butch, only to discover him sound asleep in bed. She gazes at him for a moment as Butch squints down the front of the bed at her, attempting to focus. Fabienne enters the chamber, laughs, and gives Butch a tender long kiss. Butch climbs out of bed and starts pulling garments out of the luggage that Fabienne brought. Butch is finished dressing as he searches the luggage. By now, Butch is frantically rummaging through the luggage, tossing garments. Fabienne can scarcely speak, as she’s never witnessed Butch this manner. Fabienne is weeping and frightened. Butch lowers his tone, which only serves to make him more intimidating, and he stoops down in front of the woman who has sunk to the ground, then rises as Fabienne is still sniveling. Butch goes to the wardrobe, puts on his high school coat, and rises from the ground. The little Honda dashes toward its objective as quickly as its little motor will take it. He has parked his automobile a couple of blocks from his flat to inspect things out before he goes boppin' through the front entry. Butch strolls down the alley until he reaches another avenue, then he discreetly peeks out. Everything appears ordinary, more or less the right quantity of automobiles in the avenue. None of the parked automobiles look out of position, basically appearing like usual morning activity in front of Butch's residence."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Butch's tee-shirt is pulled on by him, and Esmarelda's seat is bounced in by her with excitement as her license is looked at by him. A phone booth is dollyed around by us as Butch is talked inside, then the phone is hung up by him. A hundred dollar bill is held up by Butch, causing Esmarelda's eyes to be lit up. She goes to take it, but for some time it is held by Butch before the bill is given to her. The switch is flicked back by Butch, making the room dark again, and bed is climbed into by him, spooning Fabienne from behind. When each other is spoken to by Butch and Fabienne, babytalk is spoken. Fabienne is rolled over, and by Butch she is gotten on top of. They are kissed, and out of frame Butch's hand is gone and her crotch is started to be massaged. Fabienne reacts, her head is lied back, and her crotch is continued to be massaged by Butch. He kisses her on the mouth, and then out of frame his head goes down to carry out the oral pleasure. Fabienne's face is kept alone in the frame; her hair is finished drying and like a turban the towel is wrapped on her head, handing a towel to him as the bathroom is exited by Butch. Fabienne is stayed on by us as her teeth are brushed while continuous talking is done by Butch from the other room. Her teeth are brushed by Fabienne, and as for a moment or two we watch her, something is remembered by her. The bathroom is walked out of by her to ask Butch a question, only to find him found sound asleep in bed. He is looked at by her for a moment as the front of the bed is squinted down at her by Butch, trying to focus. The room is entered by Fabienne, a laugh is given, and by Butch a sweet long kiss is received. Out of bed Butch climbs and clothes are started to be pulled out of the suitcase that was brought by Fabienne. Dressing is finished by Butch as the suitcase is gone through by him. By now, the suitcase is frantically rummaged through by Butch, and clothes are thrown. As she's never seen Butch this way, Fabienne can hardly speak. Crying and scared is Fabienne. Butch lowers his voice, which only serves to make him more menacing, and in front of the woman who has sunk to the floor, he bends down, then rises as Fabienne is still sniffling. To the closet Butch goes, his high school jacket is put on, and from the floor he rises. Toward its destination, the little Honda is raced by it as fast as its little engine will take it. His car is parked by him a couple of blocks from his apartment to check things out before the front door is bopped through by him. Down the alley Butch walks until another street is gotten to by him, then out he discreetly glances. Normal everything seems, more or less the right number of cars are in the street. Out of place none of the parked cars appear, basically looking like normal morning activity in front of Butch's home."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Butch puts on his tee-shirt while Esmarelda eagerly watches him examine her license. We DOLLY around a phone booth where Butch makes a call, then waves a hundred dollar bill, catching Esmarelda's attention. She reaches for it, but he holds it momentarily before handing it over. Butch turns off the light, climbs into bed with Fabienne, and they speak in baby talk. They kiss as Butch massages her off-screen, and Fabienne repositions, enjoying it. Butch then moves down for oral pleasure. Fabienne, alone in the frame, dries her hair, wraps it in a towel, and hands Butch one as he exits the bathroom. She brushes her teeth, remembering something, and finds Butch asleep. She kisses him sweetly, and Butch searches through the suitcase frantically, making Fabienne cry as she’s never seen him like this. Butch calms his voice yet seems more intimidating, then dons his high school jacket. The Honda speeds toward its destination. Butch parks a few blocks from his apartment, cautiously checking the area before approaching. Everything appears normal, with the usual number of cars parked on the street, reflecting typical morning activity near Butch's home."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Butch pulls on his tee shirt as Esmarelda bounces with excitement while he checks her license. We DOLLY around a phone booth as Butch talks and hangs up, showing Esmarelda a hundred-dollar bill. She eagerly reaches for it, but he withholds it before finally handing it over. Butch dims the room and spoons Fabienne, speaking to her in babytalk. They kiss, and Butch massages her crotch, kissing her mouth and continuing the massage, moving out of frame for oral pleasure. Fabienne dries her hair with a towel, brushes her teeth as Butch talks from another room, then recalls something and finds him asleep. She laughs, kisses him, and Butch gets dressed, frantically rummaging through a suitcase while Fabienne, scared and crying, watches. His voice gets menacing as she sinks to the floor. Butch dons his high school jacket, exits, and the little Honda speeds toward its destination. He parks away from his apartment to assess the situation, walking down an alley. Everything seems normal; the parked cars look typical for the morning in front of Butch's home."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Butch pulls on his snug tee-shirt, feeling the fabric stretch across his torso as Esmarelda eagerly bounces in her seat, filled with excitement as he examines her newly acquired license. We DOLLY gracefully around a vintage phone booth while Butch engages in conversation inside, eventually ending the call by hanging up the phone. With a flourish, Butch holds up a crisp hundred-dollar bill, and Esmarelda's eyes light up with delight upon seeing it. She reaches out to take it, but Butch teasingly holds onto the bill, prolonging the moment before finally handing it over. In a swift motion, Butch flicks the light switch back, enveloping the room in darkness once again, then climbs into bed, nestling beside Fabienne and spooning her tenderly from behind. When Butch and Fabienne speak to each other, their voices soften into affectionate babytalk. Fabienne playfully rolls over, prompting Butch to move on top of her, their lips meeting in a tender kiss. Butch's hand ventures out of frame, skillfully massaging her crotch. Fabienne reacts with pleasure, her head falling back as Butch continues to massage her with gentle persistence. He kisses her passionately on the mouth before his head lowers out of frame, indulging her with oral pleasure. Fabienne's face alone fills the frame as she finishes drying her hair, expertly wrapping the towel like a turban on her head, before handing him a towel as Butch emerges from the bathroom. Our focus remains on Fabienne as she meticulously brushes her teeth, while Butch continues talking from the adjoining room. As Fabienne brushes, a thought crosses her mind, and she walks out of the bathroom, intending to ask Butch a question. However, she finds him soundly asleep in bed. She pauses, looking at him tenderly, as Butch squints down the front of the bed, trying to focus on her. Fabienne enters the room, amused, and gives Butch a sweet, lingering kiss. Butch reluctantly climbs out of bed, pulling clothes out of the suitcase Fabienne brought along. He finishes dressing, yet continues rifling through the suitcase in a frantic manner, tossing clothes aside. Fabienne is nearly speechless, as she has never seen Butch in such a state before, and she begins to cry, clearly scared. Butch lowers his voice, which only intensifies his menacing demeanor, bending down in front of Fabienne who has sunk to the floor, before rising again as she sniffles. Butch heads to the closet, retrieving and putting on his high school jacket before rising from the floor. The little Honda speeds toward its destination, its small engine working as hard as it can to reach the intended place. He parks his car a couple of blocks away from his apartment to survey the area before making his way through the front door. Butch walks down the alleyway until he reaches another street, cautiously peering out. Everything appears normal; more or less the usual number of cars are parked on the street. None of the vehicles seem out of place, all indicative of typical morning activity in front of Butch's home."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Butch meticulously pulls on his snug-fitting tee-shirt, feeling the fabric stretch comfortably across his chest and torso, while Esmarelda eagerly bounces up and down in her seat. She is filled with palpable excitement as he examines the cherished, newly acquired license she has just obtained. We DOLLY smoothly and gracefully around an old-fashioned, vintage phone booth as Butch engages in a conversation within, eventually bringing it to a close by gently hanging up the phone receiver. With a dramatic flourish, Butch holds up a crisp, freshly minted hundred-dollar bill, and Esmarelda's eyes light up with joyous delight as she catches sight of it. She reaches out in anticipation to take the bill, but Butch teasingly holds on, prolonging the delightful moment before finally relenting and handing it over to her. In one swift and fluid motion, Butch flicks the light switch off, plunging the room back into darkness once more. He then climbs into bed, nestling himself beside Fabienne and spooning her tenderly and affectionately from behind. When Butch and Fabienne speak to each other, their voices soften into a gentle and affectionate babytalk. Fabienne playfully rolls over, prompting Butch to shift on top of her, allowing their lips to meet in a tender and loving kiss. Butch's hand ventures out of the frame, skillfully massaging her crotch with attentive care. Fabienne responds with a visible expression of pleasure, her head tilting back as Butch continues to massage her with gentle persistence and care. He kisses her passionately on the mouth before lowering his head out of frame, indulging her with oral pleasure. Fabienne's face, serene and content, alone fills the frame as she finishes the task of drying her hair, adeptly wrapping the towel like a neat turban on her head. She then hands Butch a towel as he emerges from the bathroom. Our focus remains on Fabienne as she meticulously and diligently brushes her teeth, while Butch continues talking from the adjoining room. As Fabienne brushes, a contemplative thought crosses her mind, prompting her to walk out of the bathroom with the intention of asking Butch a question. However, she finds him soundly asleep in bed. She pauses for a moment, looking at him tenderly and with affection, as Butch squints down the front of the bed, trying to focus on her presence. Amused, Fabienne enters the room and gives Butch a sweet, lingering kiss. Butch reluctantly climbs out of bed, pulling clothes from the suitcase Fabienne has brought along. He finishes dressing, yet continues rifling through the suitcase in a frantic and hurried manner, tossing clothes aside in his search. Fabienne is nearly speechless, as she has never seen Butch in such an agitated state before, and she begins to cry, clearly scared and distressed. Butch lowers his voice, which only intensifies his menacing demeanor, bending down in front of Fabienne, who has sunk to the floor, before rising again as she sniffles quietly. Butch heads to the closet, retrieving and putting on his old high school jacket before rising from the floor. The little Honda speeds purposefully toward its destination, its small engine working tirelessly and as hard as it can to reach the intended place. He parks his car a couple of blocks away from his apartment, carefully surveying the area before making his way cautiously through the front door. Butch walks down the alleyway until he reaches another street, cautiously and warily peering out. Everything appears normal; more or less, the usual number of cars are parked on the street. None of the vehicles seem out of place, all indicative of typical and routine morning activity in front of Butch's home."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Butch slips his arms through the sleeves of his tee-shirt and pulls it over his head, smoothing it down over his torso. Meanwhile, Esmarelda sits across from him, unable to contain her excitement as she eagerly bounces in her seat, her eyes locked on Butch who is holding her driver's license, examining it with interest. As the scene shifts, we smoothly move around a phone booth, maintaining focus on Butch who is inside, engaged in a conversation. His expression shifts as he listens, and once the conversation concludes, he carefully places the phone back on the hook, ending the call. Emerging from the booth, Butch nonchalantly produces a crisp hundred-dollar bill from his pocket, holding it up with a teasing glint in his eye. Esmarelda, her face lighting up with anticipation, reaches out to take the bill, only for Butch to hold it just out of her grasp for a moment longer, savoring the playful interaction, before finally handing it over to her. In the next moment, Butch flips a switch, plunging the room back into darkness, and then makes his way to the bed, climbing in quietly and nestling himself against Fabienne from behind in a gentle spooning position. As they lie together, their voices soften into playful babytalk, a private language that only they share. Fabienne then rolls over, prompting Butch to shift his weight as he moves on top of her. They share a tender kiss, and his hand discreetly moves out of the frame to begin massaging her crotch, eliciting a soft reaction from Fabienne who leans her head back in response. Butch deepens their kiss before allowing his head to move down out of view, continuing to pleasure her orally. The focus shifts to Fabienne's face alone in the frame; she completes the drying of her hair with a towel, skillfully wrapping it into a makeshift turban atop her head. She hands Butch a towel as he emerges from the bathroom, toweling off as they share the space. While Fabienne stands in front of the mirror, brushing her teeth, Butch's voice carries on from the adjacent room, a constant murmur of speech. As Fabienne continues brushing, a thought suddenly occurs to her, prompting her to leave the bathroom and seek out Butch to ask a question. However, upon entering the bedroom, she discovers Butch has already drifted into a deep sleep, lying peacefully in bed. She pauses, gazing at him affectionately as Butch, sensing her presence, squints groggily in her direction, attempting to focus on her face. Entering the room, Fabienne lets out a gentle laugh, and leans down to give Butch a sweet, lingering kiss. Butch, stirred by her affection, rouses himself from the bed and begins to sift through the suitcase that Fabienne had brought along, methodically pulling out clothes and dressing himself with a sense of purpose. As he continues rummaging, his movements become more urgent, almost frantic, tossing clothes aside in a hurried search, leaving Fabienne speechless, shaken by the intensity she's never witnessed from him before. Her eyes well up with tears, paralyzed by fear and confusion at his demeanor. Butch, recognizing her distress, lowers his voice to speak, yet the softness only serves to heighten the underlying tension, making his presence more imposing. Crouching down in front of her where she has sunk to the floor, he searches for words, but ultimately rises again while Fabienne remains sniffling, caught in her emotions. Butch strides over to the closet, retrieves his old high school jacket, and vigorously pulls it on, straightening himself up from his crouched position. Transitioning to the exterior, we witness the little Honda speeding along, its engine working at full tilt as it races toward its intended destination. Butch has parked the car a couple of blocks away from his apartment, ensuring a cautious approach before boldly striding up to the front door. Navigating down the alley, he reaches another street and momentarily peers out, conducting a discreet survey of the area. The scene appears ordinary, with the usual number of cars lining the street, and nothing seems amiss. Everything suggests the normal hustle of morning life, the routine activity typical outside Butch's home, restoring a semblance of calm after the night's tumultuous events."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Butch finishes dressing and proudly shows Esmarelda her license, which excites her. He speaks briefly on the phone, then teases Esmarelda with a hundred dollar bill before finally handing it to her. After darkening the room, Butch climbs into bed and spoons Fabienne, engaging in intimate conversation and affection. They exchange kisses, and Butch gives her oral pleasure, to which Fabienne responds passionately. Afterward, Fabienne finishes drying her hair in the bathroom, wrapping a towel around her head while Butch talks from another room. Remembering something, she goes to ask him but finds him asleep. She laughs softly and kisses him before he wakes, and they share a tender moment. Butch quickly dresses and frantically searches the suitcase Fabienne packed, causing her distress. He calms slightly and dons his high school jacket before they leave. In his little Honda, Butch drives swiftly toward his destination, parking discreetly to assess his apartment's surroundings. Upon confirming everything appears normal, he prepares to enter his home."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Butch pulls on his tee-shirt, a simple gray shirt emblazoned with the logo of his favorite local diner, and Esmarelda bounces in her seat with excitement as he looks at her license, which indicates she's a newly accredited private detective. We DOLLY around a phone booth, a relic from the late 20th century when mobile phones were not yet ubiquitous, as Butch talks inside, then hangs up the phone. Butch holds up a hundred dollar bill, the kind that features the portrait of Benjamin Franklin, causing Esmarelda's eyes to light up. She goes to take it, but Butch holds it for some time before giving her the bill, as if savoring the moment of a completed job. Butch flicks the switch back, plunging the room into darkness that closely resembles the atmosphere of film noir classics, and climbs into bed, spooning Fabienne from behind. When Butch and Fabienne speak to each other, they use babytalk, a playful and intimate form of communication often reserved for close relationships. Fabienne rolls over, and Butch gets on top of her. They kiss, and Butch's hand goes out of frame and starts massaging her crotch, initiating a moment of intimacy. Fabienne reacts, lies her head back, and Butch continues to massage her crotch. Butch kisses her on the mouth and then his head goes down out of frame to carry out the oral pleasure, an act that expresses their deepening bond. Fabienne's face is alone in the frame; she finishes drying her hair, which she carefully styles with a plush towel like a turban on her head, handing him a towel as Butch exits the bathroom. We stay on Fabienne as she brushes her teeth with mint toothpaste while Butch keeps on talking from the other room. Fabienne brushes her teeth, and as we watch her for a moment or two, she remembers something important about their next trip. She walks out of the bathroom to ask Butch a question, only to find him sound asleep in bed. She looks at him for a moment as Butch squints down the front of the bed at her, trying to focus on her silhouette in the dim light. Fabienne enters the room, laughs softly at his sleepiness, and gives Butch a sweet long kiss. Butch climbs out of bed and starts pulling clothes out of the suitcase that Fabienne brought, which is stuffed with casual and travel-friendly attire. Butch is finished dressing as he goes through the suitcase. By now, Butch is frantically rummaging through the suitcase, throwing clothes everywhere in search of something specific. Fabienne can hardly speak, as she’s never seen Butch this way, his usually calm demeanor now replaced with a frantic urgency. Fabienne is crying and scared, her tears a testament to the stress of an unforeseen threat. Butch lowers his voice, which only serves to make him more menacing, and he bends down in front of the woman who has sunk to the floor, then rises as Fabienne is still sniffling, struggling to comprehend the gravity of the situation. Butch goes to the closet, puts on his high school jacket, a memento from his football days, and rises from the floor. The little Honda, a compact and reliable vehicle often praised for its fuel efficiency, races toward its destination as fast as its little engine will take it. He has parked his car a couple of blocks from his apartment to check things out before he goes boppin' through the front door, a cautious approach due to recent suspicious activity. Butch walks down the alley until he gets to another street, then he discreetly glances out to ensure he isn't being followed. Everything seems normal, more or less the right number of cars in the street, with none of the parked cars appearing out of place, basically looking like normal morning activity in front of Butch's home, giving him a momentary sense of relief."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Butch pulls on his teeshirt and Esmarelda bounces in her seat with excitement as he looks at her license. We DOLLY around a phone booth as Butch talks inside then hangs up the phone. Butch holds up a hundred dollar bill causing Esmarelda's eyes to light up. She goes to take it but Butch holds it for some time before giving her the bill. Butch flicks the switch back making the room dark again and climbs into bed spooning Fabienne from behind. When Butch and Fabienne speak to each other they speak in babytalk. Fabienne rolls over and Butch gets on top of her. They kiss and Butch's hand goes out of frame and starts massaging her crotch. Fabienne reacts lies her head back and Butch continues to massage her crotch. Butch kisses her on the mouth and then his head goes down out of frame to carry out the oral pleasure. Fabienne's face is alone in the frame. she finishes drying her hair and wraps the towel like a turban on her head handing him a towel as Butch exits the bathroom. We stay on Fabienne as she brushes her teeth while Butch keeps on talking from the other room. Fabienne brushes her teeth and as we watch her for a moment or two she remembers something. She walks out of the bathroom to ask Butch a question only to find him sound asleep in bed. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. She looks at him for a moment as Butch squints down the front of the bed at her trying to focus. Fabienne enters the room laughs and gives Butch a sweet long kiss. Butch climbs out of bed and starts pulling clothes out of the suitcase that Fabienne brought. Butch is finished dressing as he goes through the suitcase. By now Butch is frantically rummaging through the suitcase throwing clothes. Fabienne can hardly speak as she is never seen Butch this way. Fabienne is crying and scared. Butch lowers his voice which only serves to make him more menacing and he bends down in front of the woman who has sunk to the floor then rises as Fabienne is still sniffling. Butch goes to the closet puts on his high school jacket and rises from the floor. The little Honda races toward its destination as fast as its little engine will take it. He has parked his car a couple of blocks from his apartment to check things out before he goes boppin' through the front door. Butch walks down the alley until he gets to another street. then he discreetly glances out. Everything seems normal more or less the right number of cars in the street. None of the parked cars appear out of place basically looking like normal morning activity in front of Butch's home."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Butch pulls on his teeshirt and Esmarelda bounces in her seat with excitement as he looks at her license. We DOLLY around a phone booth as Butch talks inside then hangs up the phone. Butch holds up a hundred dollar bill causing Esmarelda's eyes to light up. She goes to take it but Butch holds it for some time before giving her the bill. Butch flicks the switch back making the room dark again and climbs into bed spooning Fabienne from behind. When Butch and Fabienne speak to each other they speak in babytalk. Fabienne rolls over and Butch gets on top of her. They kiss and Butch's hand goes out of frame and starts massaging her crotch. Fabienne reacts lies her head back and Butch continues to massage her crotch. Butch kisses her on the mouth and then his head goes down out of frame to carry out the oral pleasure. Fabienne's face is alone in the frame. she finishes drying her hair and wraps the towel like a turban on her head handing him a towel as Butch exits the bathroom. We stay on Fabienne as she brushes her teeth while Butch keeps on talking from the other room. Fabienne brushes her teeth and as we watch her for a moment or two she remembers something. She walks out of the bathroom to ask Butch a question only to find him sound asleep in bed. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. She looks at him for a moment as Butch squints down the front of the bed at her trying to focus. Fabienne enters the room laughs and gives Butch a sweet long kiss. Butch climbs out of bed and starts pulling clothes out of the suitcase that Fabienne brought. Butch is finished dressing as he goes through the suitcase. By now Butch is frantically rummaging through the suitcase throwing clothes. Fabienne can hardly speak as she is never seen Butch this way. Fabienne is crying and scared. Butch lowers his voice which only serves to make him more menacing and he bends down in front of the woman who has sunk to the floor then rises as Fabienne is still sniffling. Butch goes to the closet puts on his high school jacket and rises from the floor. The little Honda races toward its destination as fast as its little engine will take it. He has parked his car a couple of blocks from his apartment to check things out before he goes boppin' through the front door. Butch walks down the alley until he gets to another street. then he discreetly glances out. Everything seems normal more or less the right number of cars in the street. None of the parked cars appear out of place basically looking like normal morning activity in front of Butch's home."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Butch pulls on his teeshirt and Esmarelda bounces in her seat with excitement as he looks at her license. We DOLLY around a phone booth as Butch talks inside then hangs up the phone. Butch holds up a hundred dollar bill causing Esmarelda's eyes to light up. She goes to take it but Butch holds it for some time before giving her the bill. Butch flicks the switch back making the room dark again and climbs into bed spooning Fabienne from behind. When Butch and Fabienne speak to each other they speak in babytalk. Fabienne rolls over and Butch gets on top of her. They kiss and Butch's hand goes out of frame and starts massaging her crotch. Butch goes to the closet puts on his high school jacket and rises from the floor. The little Honda races toward its destination as fast as its little engine will take it. He has parked his car a couple of blocks from his apartment to check things out before he goes boppin' through the front door. Butch walks down the alley until he gets to another street. then he discreetly glances out. Everything seems normal more or less the right number of cars in the street. None of the parked cars appear out of place basically looking like normal morning activity in front of Butch's home."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Butch pulls on his teeshirt and Esmarelda bounces in her seat with excitement as he looks at her license. We DOLLY around a phone booth as Butch talks inside then hangs up the phone. Butch holds up a hundred dollar bill causing Esmarelda's eyes to light up. then he discreetly glances out. Everything seems normal more or less the right number of cars in the street. None of the parked cars appear out of place basically looking like normal morning activity in front of Butch's home."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Rufus tugs on his hoodie, and Lucinda jiggles in her chair with anticipation as he inspects her passport. We FLOAT around a vending machine as Rufus whispers inside, then drops the receiver. Rufus waves a fifty pound note, causing Lucinda's cheeks to glow. She reaches to seize it, but Rufus dangles it for a while before handing her the cash. Rufus flips the dial forward, dimming the space entirely, and snuggles under the blanket, embracing Giselle from the side. When Rufus and Giselle converse together, they chat in whispers. Giselle turns away, and Rufus kneels above her. They embrace, and Rufus's arm goes off screen and begins tickling her shoulder. Giselle giggles, rests her head back, and Rufus continues to tickle her shoulder. Rufus hugs her on the cheek and then his head descends off screen to deliver the soothing whisper. Giselle's smile is centered in the shot; she finishes fluffing her hair and wraps the scarf like a crown on her head, passing him a scarf as Rufus leaves the kitchen. We linger on Giselle as she grooms her nails while Rufus keeps on chatting from the hallway. Giselle grooms her nails, and as we observe her briefly, she recalls something. She steps out of the kitchen to pose Rufus a question, only to see him fast asleep on the couch. She gazes at him briefly as Rufus peeks over the edge of the couch at her, attempting to concentrate. Giselle enters the lounge, chuckles, and grants Rufus a tender long embrace. Rufus hops off the couch and begins tossing garments out of the backpack that Giselle carried. Rufus is done getting dressed as he rifles the backpack. By this point, Rufus is frenetically searching through the backpack, tossing garments around. Giselle can barely utter a word, as she’s never observed Rufus in this manner. Giselle is weeping and anxious. Rufus hushes his tone, which only makes him seem more intimidating, and he crouches before the person who has slumped to the ground, then ascends as Giselle is still weeping. Rufus heads to the wardrobe, throws on his college blazer, and stands up from the ground. The tiny scooter dashes toward its goal as swiftly as its tiny motor will allow. He has left his bike a block from his flat to survey the scene before he strides through the entrance. Rufus strolls down the pathway until he reaches another road, then he cautiously peeks out. Everything appears ordinary, more or less the correct number of vehicles on the avenue. None of the stationary vehicles seem amiss, essentially resembling typical morning goings-on in front of Rufus's residence."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Butch pulls on his tee-shirt, causing Esmarelda to bounce excitedly as she sees her license. Butch hangs up a call from a phone booth, revealing a hundred-dollar bill to Esmarelda, withholding it momentarily before giving it to her. He flicks a switch, darkening the room. Climbing into bed with Fabienne, they speak in babytalk, and intimate moments ensue. Fabienne dries her hair, hands Butch a towel, then brushes her teeth while listening to him talk from another room. Remembering something, she exits the bathroom to find Butch asleep, but he wakes and they share a sweet kiss. Butch dresses quickly, frantically searching through the suitcase Fabienne brought. Fabienne, scared and crying, watches as Butch lowers his voice, becoming more menacing, before donning his high school jacket. Butch's little Honda races towards its destination. He parks a few blocks from his apartment, cautiously checking the surroundings. Everything appears normal with the right amount of morning activity outside his home."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "None of the parked cars appear out of place basically looking like normal morning activity in front of Butch's home Everything seems normal more or less the right number of cars in the street then he discreetly glances out Butch walks down the alley until he gets to another street He has parked his car a couple of blocks from his apartment to check things out before he goes boppin' through the front door The little Honda races toward its destination as fast as its little engine will take it Butch goes to the closet puts on his high school jacket and rises from the floor Butch lowers his voice which only serves to make him more menacing and he bends down in front of the woman who has sunk to the floor then rises as Fabienne is still sniffling Fabienne is crying and scared Fabienne can hardly speak as she is never seen Butch this way By now Butch is frantically rummaging through the suitcase throwing clothes Butch is finished dressing as he goes through the suitcase Butch climbs out of bed and starts pulling clothes out of the suitcase that Fabienne brought Fabienne enters the room laughs and gives Butch a sweet long kiss She looks at him for a moment as Butch squints down the front of the bed at her trying to focus She walks out of the bathroom to ask Butch a question only to find him sound asleep in bed Fabienne brushes her teeth and as we watch her for a moment or two she remembers something We stay on Fabienne as she brushes her teeth while Butch keeps on talking from the other room she finishes drying her hair and wraps the towel like a turban on her head handing him a towel as Butch exits the bathroom Fabienne's face is alone in the frame Butch kisses her on the mouth and then his head goes down out of frame to carry out the oral pleasure Fabienne reacts lies her head back and Butch continues to massage her crotch They kiss and Butch's hand goes out of frame and starts massaging her crotch Fabienne rolls over and Butch gets on top of her When Butch and Fabienne speak to each other they speak in babytalk Butch flicks the switch back making the room dark again and climbs into bed spooning Fabienne from behind She goes to take it but Butch holds it for some time before giving her the bill Butch holds up a hundred dollar bill causing Esmarelda's eyes to light up We DOLLY around a phone booth as Butch talks inside then hangs up the phone Butch pulls on his teeshirt and Esmarelda bounces in her seat with excitement as he looks at her license"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "We DOLLY around a phone booth as Butch talks inside then hangs up the phone Butch pulls on his teeshirt and Esmarelda bounces in her seat with excitement as he looks at her license She goes to take it but Butch holds it for some time before giving her the bill Butch holds up a hundred dollar bill causing Esmarelda's eyes to light up When Butch and Fabienne speak to each other they speak in babytalk Butch flicks the switch back making the room dark again and climbs into bed spooning Fabienne from behind They kiss and Butch's hand goes out of frame and starts massaging her crotch Fabienne rolls over and Butch gets on top of her Butch kisses her on the mouth and then his head goes down out of frame to carry out the oral pleasure Fabienne reacts lies her head back and Butch continues to massage her crotch she finishes drying her hair and wraps the towel like a turban on her head handing him a towel as Butch exits the bathroom Fabienne's face is alone in the frame Fabienne brushes her teeth and as we watch her for a moment or two she remembers something We stay on Fabienne as she brushes her teeth while Butch keeps on talking from the other room She looks at him for a moment as Butch squints down the front of the bed at her trying to focus She walks out of the bathroom to ask Butch a question only to find him sound asleep in bed Butch climbs out of bed and starts pulling clothes out of the suitcase that Fabienne brought Fabienne enters the room laughs and gives Butch a sweet long kiss By now Butch is frantically rummaging through the suitcase throwing clothes Butch is finished dressing as he goes through the suitcase Fabienne is crying and scared Fabienne can hardly speak as she is never seen Butch this way Butch goes to the closet puts on his high school jacket and rises from the floor Butch lowers his voice which only serves to make him more menacing and he bends down in front of the woman who has sunk to the floor then rises as Fabienne is still sniffling He has parked his car a couple of blocks from his apartment to check things out before he goes boppin' through the front door The little Honda races toward its destination as fast as its little engine will take it then he discreetly glances out Butch walks down the alley until he gets to another street None of the parked cars appear out of place basically looking like normal morning activity in front of Butch's home Everything seems normal more or less the right number of cars in the street"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She looks at him for a moment as Butch squints down the front of the bed at her trying to focus Fabienne enters the room laughs and gives Butch a sweet long kiss Butch climbs out of bed and starts pulling clothes out of the suitcase that Fabienne brought Butch is finished dressing as he goes through the suitcase By now Butch is frantically rummaging through the suitcase throwing clothes Fabienne can hardly speak as she is never seen Butch this way Fabienne is crying and scared Butch lowers his voice which only serves to make him more menacing and he bends down in front of the woman who has sunk to the floor then rises as Fabienne is still sniffling Butch goes to the closet puts on his high school jacket and rises from the floor The little Honda races toward its destination as fast as its little engine will take it He has parked his car a couple of blocks from his apartment to check things out before he goes boppin' through the front door Butch walks down the alley until he gets to another street then he discreetly glances out Everything seems normal more or less the right number of cars in the street None of the parked cars appear out of place basically looking like normal morning activity in front of Butch's home Butch pulls on his teeshirt and Esmarelda bounces in her seat with excitement as he looks at her license We DOLLY around a phone booth as Butch talks inside then hangs up the phone Butch holds up a hundred dollar bill causing Esmarelda's eyes to light up She goes to take it but Butch holds it for some time before giving her the bill Butch flicks the switch back making the room dark again and climbs into bed spooning Fabienne from behind When Butch and Fabienne speak to each other they speak in babytalk Fabienne rolls over and Butch gets on top of her They kiss and Butch's hand goes out of frame and starts massaging her crotch Fabienne reacts lies her head back and Butch continues to massage her crotch Butch kisses her on the mouth and then his head goes down out of frame to carry out the oral pleasure Fabienne's face is alone in the frame she finishes drying her hair and wraps the towel like a turban on her head handing him a towel as Butch exits the bathroom We stay on Fabienne as she brushes her teeth while Butch keeps on talking from the other room Fabienne brushes her teeth and as we watch her for a moment or two she remembers something She walks out of the bathroom to ask Butch a question only to find him sound asleep in bed"
        }
      ]
    }
  ]
}