{
  "ground_truth": "Butch peers around a wall, taking in the vital information, walks out of the alley, and is ready for anything. He crosses the street and enters his apartment courtyard in North Hollywood, where everything appears normal: the laundry room, the pool, and his apartment door are undisturbed. Butch climbs the stairs to his apartment, number 12, steps outside the door, listens inside, and slowly inserts the key, quietly opening it to find that his apartment hasn't been touched. He cautiously steps inside, shuts the door, takes a quick look around, walks into his modest kitchen, and opens the refrigerator before going to the bedroom. His bedroom, like the rest of the apartment, is neat, clean, and anonymous, and sure enough, the watch is as he said it was—on the bedside table, hanging on his little kangaroo statue. He walks through the apartment back into the kitchen, opens a cupboard, takes out a box of Pop Tarts, puts down the milk, opens the box, takes out two Pop Tarts, and puts them in the toaster. Butch glances to his right and sees a small compact Czech M61 submachine gun with a huge silencer on the kitchen counter, which makes him laugh out loud. As he laughs, he flips a tape in the cassette player, and when the music starts, he sings along with it. He drives by the apartment but is stopped at the light on the corner across from Teriyaki Donut, still chuckling and singing along with the song. Marsellus Wallace exits Teriyaki Donut, carrying a box of a dozen donuts and two large styrofoam cups of coffee, steps off the curb, and crosses the street in front of Butch's car. Laughing boy stops when he sees Marsellus in front of him; Marsellus casually glances at Butch, continues walking, and Butch stomps on the gas pedal. The Honda slams into Marsellus, sending him, the donuts, and the coffee hitting the pavement at thirty miles an hour. Butch cuts into cross traffic and is broad-sided by a gold Camaro Z-28, breaking all the windows in the Honda and sending it up on the sidewalk. Butch sits dazed and confused in the crumpled mess of what was Fabienne's Honda, with blood flowing from his nostrils, as a pedestrian pokes his head inside. Marsellus Wallace lies sprawled out in the street, gawkers gather around the body, and the yelling makes Marsellus come to.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Butch gazes around a partition, absorbing the essential details, strides out of the passageway, and is prepared for anything. He traverses the road and enters his residence courtyard in North Hollywood, where everything seems routine: the washroom, the pool, and his apartment entry remain intact. Butch ascends the steps to his residence, number 12, stands outside the entry, listens inside, and gradually inserts the key, softly unlocking it to find that his apartment hasn't been disturbed. He cautiously enters, closes the door, takes a swift glance around, walks into his simple kitchen, and opens the refrigerator before heading to the bedroom. His bedroom, like the rest of the apartment, is tidy, spotless, and impersonal, and sure enough, the timepiece is as he said it was—on the bedside stand, hanging on his little kangaroo figurine. He walks through the apartment back into the kitchen, opens a cabinet, takes out a box of Pop Tarts, sets down the milk, opens the box, extracts two Pop Tarts, and places them in the toaster. Butch glances to his right and perceives a diminutive compact Czech M61 submachine gun with a massive suppressor on the kitchen counter, which causes him to laugh out loud. As he laughs, he flips a tape in the cassette player, and when the music begins, he sings along with it. He drives by the apartment but is halted at the signal on the corner across from Teriyaki Donut, still chuckling and singing along with the tune. Marsellus Wallace exits Teriyaki Donut, carrying a container of a dozen donuts and two large styrofoam cups of coffee, steps off the curb, and traverses the street in front of Butch's vehicle. Laughing boy stops when he notices Marsellus in front of him; Marsellus casually glances at Butch, continues walking, and Butch stomps on the accelerator. The Honda crashes into Marsellus, sending him, the donuts, and the coffee hitting the pavement at thirty miles an hour. Butch cuts into cross traffic and is broad-sided by a gold Camaro Z-28, shattering all the windows in the Honda and sending it onto the sidewalk. Butch sits stunned and perplexed in the crumpled wreck of what was Fabienne's Honda, with blood flowing from his nostrils, as a bystander pokes his head inside. Marsellus Wallace lies sprawled out in the street, onlookers gather around the body, and the shouting makes Marsellus regain consciousness."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Butch peers around a wall, vital information is taken in by him, walks out of the alley, and is ready for anything. The street is crossed by him, and the apartment courtyard in North Hollywood is entered, where everything appears normal: the laundry room, the pool, and his apartment door remain undisturbed. The stairs to his apartment, number 12, are climbed by Butch; he steps outside the door, listens inside, and the key is slowly inserted by him, quietly opening it to find that nobody has touched his apartment. He cautiously steps inside, the door is shut by him, a quick look around is taken, he walks into his modest kitchen, the refrigerator is opened by him before he goes to the bedroom. His bedroom, like the rest of the apartment, he keeps neat, clean, and anonymous, and sure enough, he has the watch as he said it was—on the bedside table, hanging on his little kangaroo statue. Walking through the apartment back into the kitchen, he opens a cupboard, a box of Pop Tarts is taken out, he puts down the milk, the box is opened by him, two Pop Tarts are taken out, and they are put in the toaster by him. Butch glances to his right and a small compact Czech M61 submachine gun with a huge silencer is seen on the kitchen counter, which makes him laugh out loud. As he laughs, a tape is flipped by him in the cassette player, and when the music starts, he sings along with it. He drives by the apartment but stops at the light on the corner across from Teriyaki Donut, still chuckling and singing along with the song. Teriyaki Donut is exited by Marsellus Wallace, who carries a box of a dozen donuts and two large styrofoam cups of coffee, steps off the curb, and the street in front of Butch's car is crossed by him. Laughing boy stops when Marsellus is seen in front of him; Marsellus casually glances at Butch, continues walking, and the gas pedal is stomped on by Butch. Marsellus is slammed into by the Honda, sending him, the donuts, and the coffee hitting the pavement at thirty miles an hour. Cross traffic is cut into by Butch, and a gold Camaro Z-28 broad-sides him, breaking all the windows in the Honda and sending it up on the sidewalk. Butch sits dazed and confused in the crumpled mess of what was Fabienne's Honda, with blood flowing from his nostrils, as a pedestrian pokes his head inside. Marsellus Wallace lies sprawled out in the street, the body is gathered around by gawkers, and the yelling makes Marsellus come to."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Butch peers around a wall, absorbing crucial details, then leaves the alley, ready for anything. He crosses the street into his North Hollywood apartment courtyard, where everything seems normal: the laundry room, pool, and apartment door are undisturbed. Ascending to apartment 12, he listens, inserts the key, and finds his place untouched. Inside, he checks his neat, clean bedroom, confirming his watch is on the bedside table, hanging on a kangaroo statue. In the kitchen, he opens a cupboard, grabs a box of Pop Tarts, sets down the milk, and prepares two in the toaster. Butch spots a Czech M61 submachine gun with a silencer on the counter, laughing out loud. Flipping a tape, he sings along with the music. Driving by the apartment, he is stopped at a light across Teriyaki Donut, still chuckling and singing. Marsellus Wallace exits with donuts and coffee, crosses in front of Butch's car. Butch stomps on the gas, hitting Marsellus, sending him, the donuts, and coffee flying. Butch cuts into cross traffic, colliding with a gold Camaro Z-28, shattering the Honda's windows and landing on the sidewalk. Dazed, Butch sits in the wrecked Honda, blood from his nostrils, as a pedestrian peers in. Marsellus lies sprawled on the street as onlookers gather, and their yelling revives him."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Butch observes from a wall, leaves the alley, and reaches his apartment in North Hollywood, where all seems undisturbed. He enters apartment 12, checks it, and finds the watch on the bedside table. In the kitchen, he prepares Pop Tarts and notices a submachine gun, laughing as he flips a tape in the player and sings. Driving away, he stops at a light near Teriyaki Donut. Marsellus Wallace crosses with donuts and coffee; Butch accelerates, hitting him. Butch's car crashes into a Camaro, leaving him dazed and bleeding as onlookers gather around Marsellus, who regains consciousness."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Butch, cautious and vigilant, peers around the corner of a concealing wall, taking in all the vital information with keen eyes. With a newfound readiness for anything life might throw at him, he strides confidently out of the dim alleyway. As he crosses the bustling street, he makes his way toward the familiar, welcoming confines of his apartment courtyard in the vibrant area of North Hollywood. Here, everything appears perfectly ordinary and undisturbed: the laundry room stands still, the pool shimmers under the sunlight, and the threshold to his apartment remains untouched and silent. \n\nWith a deliberate pace, Butch ascends the stairs that lead to his apartment, number 12. He pauses outside his door, pressing his ear softly against it to listen for any unusual sounds from within. Hearing nothing amiss, he slowly and quietly inserts the key into the lock, gently turning it and opening the door to find his apartment undisturbed and exactly as he left it. With cautious steps, he enters, shutting the door behind him. After a quick, reassuring glance around the surroundings, he proceeds into his modest kitchen, where he opens the refrigerator before heading toward the bedroom.\n\nOnce in his bedroom, he observes that it, like the rest of his humble apartment, remains neat and clean in an almost anonymous manner. True to his earlier assurance, the watch is precisely where he said it would be—resting on the bedside table, draped over his little kangaroo statue. After retrieving the watch, Butch moves back through the apartment and into the kitchen once more. He opens a cupboard and takes out a box of Pop Tarts, setting the milk down before opening the box and placing two Pop Tarts into the toaster.\n\nAs he stands in his kitchen, Butch's gaze shifts to his right, where he notices a small, compact Czech M61 submachine gun lying on the counter, equipped with a massive silencer. This unexpected sight triggers a hearty laugh. Amid his laughter, he flips a tape in the cassette player, and as the music begins to play, he can't help but sing along. Later, as he drives his car past the apartment, he finds himself stopped at a red light right at the corner across from Teriyaki Donut, still chuckling and harmonizing with the song.\n\nMeanwhile, Marsellus Wallace emerges from Teriyaki Donut, carrying a box filled with a dozen freshly baked donuts and two large styrofoam cups brimming with coffee. He steps off the curb and saunters across the street in front of Butch's car. As Butch, still amused, comes to a stop upon spotting Marsellus directly in front of him, Marsellus offers a casual, fleeting glance toward Butch before continuing on his path. Butch makes a sudden decision; he forcefully stomps on the gas pedal. The Honda surges forward, colliding with Marsellus, sending him, along with the donuts and coffee, sprawling across the pavement at thirty miles an hour.\n\nIn a desperate maneuver, Butch swerves into cross traffic, only to be violently broad-sided by a gleaming gold Camaro Z-28. The impact shatters all the windows of the Honda, sending the vehicle careening onto the sidewalk. Butch finds himself sitting dazed and utterly confused amidst the wreckage of what was once Fabienne's beloved Honda, blood flowing freely from his nostrils. A concerned pedestrian approaches and peers inside, assessing the damage. Meanwhile, Marsellus Wallace lies spread out on the street, surrounded by curious onlookers who gather around his prone body. The commotion reaches his ears, and amidst the yelling, Marsellus slowly begins to regain consciousness."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Butch, with a demeanor that can best be described as cautious and vigilant, carefully peers around the corner of a concealing wall. His sharp eyes take in all the vital information, absorbing every detail of the surroundings. Feeling an enhanced readiness for whatever unexpected challenges life might present, he strides confidently out of the dim confines of the alleyway. As he crosses the bustling street, he makes deliberate progress toward the familiar and welcoming confines of his apartment courtyard, nestled in the vibrant and lively area of North Hollywood. Here, everything appears perfectly ordinary and undisturbed, creating a deceptive calm: the laundry room stands motionless, the pool shimmers gently under the bright sunlight, and the threshold to his apartment remains untouched and silent, unchanged since he last saw it.\n\nWith a deliberate and measured pace, Butch ascends the stairs leading to his apartment, number 12. He pauses momentarily outside his door, pressing his ear softly against it to listen intently for any unusual or suspicious sounds from within. Hearing nothing at all amiss, he slowly and quietly inserts the key into the lock, gently turning it and opening the door to find that his apartment remains undisturbed and precisely as he left it before. With cautious steps, he enters, shutting the door quietly behind him. After a reassuring glance around his surroundings, he proceeds into his modest kitchen. There, he opens the refrigerator briefly before heading toward his bedroom.\n\nUpon entering his bedroom, he observes that it, like the rest of his humble apartment, remains neat and clean in an almost anonymous manner. True to his earlier assurance, the watch is precisely where he said it would be—resting on the bedside table, draped over his little kangaroo statue. After retrieving the watch to his satisfaction, Butch moves back through the apartment and into the kitchen once more. He opens a cupboard and takes out a box of Pop Tarts, setting the milk down before opening the box and placing two Pop Tarts into the toaster.\n\nAs he stands in his small kitchen, Butch's gaze shifts to his right, where he notices a small, compact Czech M61 submachine gun lying conspicuously on the counter, equipped with a massive silencer. This unexpected sight is so jarring that it triggers a hearty laugh from him. Amid his laughter, he flips a tape in the cassette player, and as the music begins to play, he finds himself unable to resist singing along with the tune. Later, as he drives his car past the apartment building, he finds himself stopped at a red light right at the corner across from Teriyaki Donut, still chuckling and harmonizing with the song.\n\nMeanwhile, Marsellus Wallace emerges from Teriyaki Donut, carrying a box brimming with a dozen freshly baked donuts and two large styrofoam cups filled to the brim with steaming coffee. He steps off the curb with his characteristic saunter and crosses the street directly in front of Butch's car. As Butch, still amused, comes to a stop upon spotting Marsellus directly in front of him, Marsellus offers a casual, fleeting glance towards Butch before continuing on his path across the street. Butch, in a moment of sudden impulsivity, makes a decisive decision; he forcefully stomps on the gas pedal. The Honda surges forward, colliding with Marsellus and sending him, along with the donuts and coffee, sprawling across the pavement at a velocity of thirty miles an hour.\n\nIn a desperate maneuver to regain control, Butch swerves into the unpredictable chaos of cross-traffic, only to be violently broad-sided by a gleaming gold Camaro Z-28. The impact is so severe that it shatters all the windows of the Honda, sending the vehicle careening uncontrollably onto the nearby sidewalk. Butch finds himself sitting dazed and utterly confused amidst the wreckage of what was once Fabienne's beloved Honda, blood flowing freely from his nostrils. A concerned pedestrian approaches cautiously and peers inside, assessing the damage with growing concern. Meanwhile, Marsellus Wallace lies sprawled on the street, surrounded by curious and concerned onlookers who gather around his prone body. The commotion reaches his ears, and amidst the chaotic yelling, Marsellus slowly begins to regain consciousness, gradually becoming aware of his dire situation."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Butch cautiously peeks around the wall, his eyes scanning the surroundings to gather any crucial details that might affect his next move. With the vital information collected, he confidently walks out of the alley, mentally preparing himself for any situation he might encounter. He decisively crosses the street, his eyes focused ahead, and enters the courtyard of his apartment in North Hollywood, noting with relief that the familiar sights—the laundry room, the pool, and his apartment door—all remain undisturbed. He climbs the stairs leading to his apartment, number 12, and pauses outside the door, listening intently for any sounds inside before slowly inserting the key into the lock. He quietly opens the door, his eyes scanning the interior, confirming that nothing inside has been tampered with. With a cautious step, he enters the apartment, gently shutting the door behind him before casting a quick, observant glance around the living room. Satisfied, he walks into his modest kitchen and pulls open the refrigerator door, surveying the contents for a brief moment before heading to the bedroom. The bedroom, like the rest of the apartment, remains neat, clean, and impersonal, and as he had hoped, his watch is exactly where he left it—resting on the bedside table, draped over a small kangaroo statue. After a moment of reassurance, he walks back through the apartment into the kitchen, opening a cupboard to retrieve a box of Pop Tarts. He sets down the milk, opens the box, takes out two Pop Tarts, and places them in the toaster, anticipating a snack. As he does so, his eyes shift to the right, landing on a small compact Czech M61 submachine gun with an oversized silencer sitting conspicuously on the kitchen counter, eliciting a genuine laugh from him. Amused, he flips a tape in the cassette player, and as the music starts to play, he begins to sing along, the melody lifting his spirits. Later, while driving past the apartment, he halts at a red light at the corner across from Teriyaki Donut, still chuckling and singing to the tune playing in his car. Meanwhile, Marsellus Wallace exits Teriyaki Donut, his hands full with a box of a dozen donuts and two large styrofoam cups of coffee, before stepping off the curb and beginning to cross the street directly in front of Butch's car. The lightheartedness vanishes as Butch halts his singing upon seeing Marsellus in front of him; Marsellus makes brief eye contact with Butch, nonchalantly continuing his walk across the street. In a swift and deliberate motion, Butch floors the gas pedal, the Honda surging forward to collide with Marsellus, propelling him, the donuts, and the coffee onto the pavement at thirty miles an hour. As chaos ensues, Butch swerves into cross traffic, only to be violently broad-sided by a gold Camaro Z-28, the impact shattering all the windows in Fabienne's Honda and launching it onto the sidewalk. Amidst the wreckage, Butch sits stunned and disoriented in the demolished remains of the car, blood dripping steadily from his nostrils as a concerned pedestrian leans in to check on him. Meanwhile, Marsellus Wallace lies sprawling in the street, passersby gathering around his fallen form. The raucous commotion from the onlookers eventually rouses Marsellus back to consciousness."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Butch emerges from the alley, alert and prepared, crosses the street, and enters his apartment courtyard in North Hollywood, noting the undisturbed surroundings. After cautiously entering his apartment, he confirms everything is intact, including his watch on the bedside table. He heads to the kitchen, takes out Pop Tarts, and starts toasting them when he notices a small Czech M61 submachine gun with a silencer on the counter, which amuses him. Laughing, he flips a tape in the cassette player and sings along. Later, while driving by his apartment, he stops at a light across from Teriyaki Donut. Marsellus Wallace exits the shop and crosses in front of Butch's car. Recognizing Marsellus, Butch accelerates, hitting him and sending Marsellus, along with donuts and coffee, tumbling onto the pavement. Butch then collides with a Camaro Z-28, leaving him dazed in the wrecked Honda as a pedestrian checks on him. Meanwhile, Marsellus, sprawled on the street, begins to regain consciousness amid a gathering crowd."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Butch, once a former prizefighter who now lives a quieter life, peers around a wall, taking in the vital information, walks out of the alley, and is ready for anything. He crosses the street and enters his apartment courtyard in North Hollywood, a district recognized for its vibrant arts community and proximity to the entertainment industry, where everything appears normal: the laundry room, the pool, and his apartment door are undisturbed. Butch climbs the stairs to his apartment, number 12, steps outside the door, listens inside, and slowly inserts the key, quietly opening it to find that his apartment hasn't been touched. He cautiously steps inside, shuts the door, takes a quick look around, walks into his modest kitchen, and opens the refrigerator before going to the bedroom. His bedroom, like the rest of the apartment, is neat, clean, and anonymous, and sure enough, the watch is as he said it was—on the bedside table, hanging on his little kangaroo statue, a quirky souvenir inherited from his late father. He walks through the apartment back into the kitchen, opens a cupboard, takes out a box of Pop Tarts, a popular breakfast treat introduced in the 1960s, puts down the milk, opens the box, takes out two Pop Tarts, and puts them in the toaster. Butch glances to his right and sees a small compact Czech M61 submachine gun with a huge silencer on the kitchen counter, a weapon known for its compact design favored by special forces, which makes him laugh out loud. As he laughs, he flips a tape in the cassette player, and when the music starts, he sings along with it. He drives by the apartment but is stopped at the light on the corner across from Teriyaki Donut, an eccentric eatery combining Asian and American snack favorites, still chuckling and singing along with the song. Marsellus Wallace exits Teriyaki Donut, carrying a box of a dozen donuts and two large styrofoam cups of coffee, steps off the curb, and crosses the street in front of Butch's car. Laughing boy stops when he sees Marsellus in front of him; Marsellus, a powerful crime boss known for his imposing presence, casually glances at Butch, continues walking, and Butch stomps on the gas pedal. The Honda slams into Marsellus, sending him, the donuts, and the coffee hitting the pavement at thirty miles an hour. Butch cuts into cross traffic and is broad-sided by a gold Camaro Z-28, a classic American muscle car cherished for its speed and style, breaking all the windows in the Honda and sending it up on the sidewalk. Butch sits dazed and confused in the crumpled mess of what was Fabienne's Honda, a gift from his girlfriend who treasures it dearly, with blood flowing from his nostrils, as a pedestrian pokes his head inside. Marsellus Wallace lies sprawled out in the street, gawkers gather around the body, and the yelling makes Marsellus come to."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Butch cuts into cross traffic and is broadsided by a gold Camaro Z28 breaking all the windows in the Honda and sending it up on the sidewalk Butch peers around a wall taking in the vital information walks out of the alley and is ready for anything the laundry room the pool and his apartment door are undisturbed Butch glances to his right and sees a small compact Czech M61 submachine gun with a huge silencer on the kitchen counter which makes him laugh out loud He crosses the street and enters his apartment courtyard in North Hollywood where everything appears normal Butch climbs the stairs to his apartment number 12 steps outside the door listens inside and slowly inserts the key quietly opening it to find that his apartment has not been touched Teriyaki Donut carrying a box of a dozen donuts and two large styrofoam cups of coffee steps off the curb and crosses the street in front of Butch's car He crosses the street and enters his apartment courtyard in North Hollywood where everything appears normal the laundry room the pool and his apartment door are undisturbed Butch climbs the stairs to his apartment number 12 steps outside the door listens inside and slowly inserts the key quietly opening it to find that his apartment has not been touched He cautiously steps inside shuts the door takes a quick look around walks into his modest kitchen and opens the refrigerator before going to the bedroom His bedroom like the rest of the apartment is neat clean and anonymous and sure enough the watch is as he said it was—on the bedside table hanging on his little kangaroo statue He walks through the apartment back into the kitchen opens a cupboard takes out a box of Pop Tarts puts down the milk opens the box takes out two Pop Tarts and puts them in the toaster Butch glances to his right and sees a small compact Czech M61 submachine gun with a huge silencer on the kitchen counter which makes him laugh out loud As he laughs he flips a tape in the cassette player and when the music starts he sings along with it He drives by the apartment but is stopped at the light on the corner across from Teriyaki Donut still chuckling and singing along with the song Marsellus Wallace exits Marsellus Wallace exits Teriyaki Donut carrying a box of a dozen donuts and two large styrofoam cups of coffee steps off the curb and crosses the street in front of Butch's car Butch sits dazed and confused in the crumpled mess of what was Fabienne's Honda with blood flowing from his nostrils As he laughs he flips a tape in the cassette player and when the music starts he sings along with it Laughing boy stops when he sees Marsellus in front of him Marsellus casually glances at Butch continues walking and Butch stomps on the gas pedal The Honda slams into Marsellus sending him the donuts and the coffee hitting the pavement at thirty miles an hour Butch cuts into cross traffic and is broadsided by a gold Camaro Z28 breaking all the windows in the Honda and sending it up on the sidewalk Butch peers around a wall taking in the vital information walks out of the alley and is ready for anything Butch sits dazed and confused in the crumpled mess of what was Fabienne's Honda with blood flowing from his nostrils as a pedestrian pokes his head inside Marsellus Wallace lies sprawled out in the street gawkers gather around the body and the yelling makes Marsellus come to"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Butch peers around a wall taking in the vital information walks out of the alley and is ready for anything. He crosses the street and enters his apartment courtyard in North Hollywood where everything appears normal. the laundry room the pool and his apartment door are undisturbed. Butch climbs the stairs to his apartment number 12 steps outside the door listens inside and slowly inserts the key quietly opening it to find that his apartment has not been touched. He cautiously steps inside shuts the door takes a quick look around walks into his modest kitchen and opens the refrigerator before going to the bedroom. His bedroom like the rest of the apartment is neat clean and anonymous and sure enough the watch is as he said it was—on the bedside table hanging on his little kangaroo statue. He walks through the apartment back into the kitchen opens a cupboard takes out a box of Pop Tarts puts down the milk opens the box takes out two Pop Tarts and puts them in the toaster. Butch glances to his right and sees a small compact Czech M61 submachine gun with a huge silencer on the kitchen counter which makes him laugh out loud. As he laughs he flips a tape in the cassette player and when the music starts he sings along with it. He drives by the apartment but is stopped at the light on the corner across from Teriyaki Donut still chuckling and singing along with the song. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Marsellus Wallace exits. Teriyaki Donut carrying a box of a dozen donuts and two large styrofoam cups of coffee steps off the curb and crosses the street in front of Butch's car. Laughing boy stops when he sees Marsellus in front of him. Marsellus casually glances at Butch continues walking and Butch stomps on the gas pedal. The Honda slams into Marsellus sending him the donuts and the coffee hitting the pavement. at thirty miles an hour. Butch cuts into cross traffic and is broadsided by a gold Camaro Z28 breaking all the windows in the Honda and sending it up on the sidewalk. Butch sits dazed and confused in the crumpled mess of what was Fabienne's Honda with blood flowing from his nostrils. as a pedestrian pokes his head inside. Marsellus Wallace lies sprawled out in the street gawkers gather around the body and the yelling makes Marsellus come to."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Butch peers around a wall taking in the vital information walks out of the alley and is ready for anything. He crosses the street and enters his apartment courtyard in North Hollywood where everything appears normal. the laundry room the pool and his apartment door are undisturbed. Butch climbs the stairs to his apartment number 12 steps outside the door listens inside and slowly inserts the key quietly opening it to find that his apartment has not been touched. He cautiously steps inside shuts the door takes a quick look around walks into his modest kitchen and opens the refrigerator before going to the bedroom. His bedroom like the rest of the apartment is neat clean and anonymous and sure enough the watch is as he said it was—on the bedside table hanging on his little kangaroo statue. He walks through the apartment back into the kitchen opens a cupboard takes out a box of Pop Tarts puts down the milk opens the box takes out two Pop Tarts and puts them in the toaster. Butch glances to his right and sees a small compact Czech M61 submachine gun with a huge silencer on the kitchen counter which makes him laugh out loud. As he laughs he flips a tape in the cassette player and when the music starts he sings along with it. He drives by the apartment but is stopped at the light on the corner across from Teriyaki Donut still chuckling and singing along with the song. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Marsellus Wallace exits. Teriyaki Donut carrying a box of a dozen donuts and two large styrofoam cups of coffee steps off the curb and crosses the street in front of Butch's car. Laughing boy stops when he sees Marsellus in front of him. Marsellus casually glances at Butch continues walking and Butch stomps on the gas pedal. The Honda slams into Marsellus sending him the donuts and the coffee hitting the pavement. at thirty miles an hour. Butch cuts into cross traffic and is broadsided by a gold Camaro Z28 breaking all the windows in the Honda and sending it up on the sidewalk. Butch sits dazed and confused in the crumpled mess of what was Fabienne's Honda with blood flowing from his nostrils. as a pedestrian pokes his head inside. Marsellus Wallace lies sprawled out in the street gawkers gather around the body and the yelling makes Marsellus come to."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Butch peers around a wall taking in the vital information walks out of the alley and is ready for anything. He crosses the street and enters his apartment courtyard in North Hollywood where everything appears normal. the laundry room the pool and his apartment door are undisturbed. Butch climbs the stairs to his apartment number 12 steps outside the door listens inside and slowly inserts the key quietly opening it to find that his apartment has not been touched. He cautiously steps inside shuts the door takes a quick look around walks into his modest kitchen and opens the refrigerator before going to the bedroom. at thirty miles an hour. Butch cuts into cross traffic and is broadsided by a gold Camaro Z28 breaking all the windows in the Honda and sending it up on the sidewalk. Butch sits dazed and confused in the crumpled mess of what was Fabienne's Honda with blood flowing from his nostrils. as a pedestrian pokes his head inside. Marsellus Wallace lies sprawled out in the street gawkers gather around the body and the yelling makes Marsellus come to."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Butch peers around a wall taking in the vital information walks out of the alley and is ready for anything. He crosses the street and enters his apartment courtyard in North Hollywood where everything appears normal. as a pedestrian pokes his head inside. Marsellus Wallace lies sprawled out in the street gawkers gather around the body and the yelling makes Marsellus come to."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Ginger peers around a wall, taking in the vital information, walks out of the alley, and is ready for anything. She crosses the street and enters her apartment courtyard in North Hollywood, where everything appears normal: the laundry room, the pool, and her apartment door are undisturbed. Ginger climbs the stairs to her apartment, number 12, steps outside the door, listens inside, and slowly inserts the key, quietly opening it to find that her apartment hasn't been touched. She cautiously steps inside, shuts the door, takes a quick look around, walks into her modest kitchen, and opens the refrigerator before going to the bedroom. Her bedroom, like the rest of the apartment, is neat, clean, and anonymous, and sure enough, the watch is as she said it was—on the bedside table, hanging on her little kangaroo statue. She walks through the apartment back into the kitchen, opens a cupboard, takes out a box of Pop Tarts, puts down the milk, opens the box, takes out two Pop Tarts, and puts them in the toaster. Ginger glances to her right and sees a small compact Czech M61 submachine gun with a huge silencer on the kitchen counter, which makes her laugh out loud. As she laughs, she flips a tape in the cassette player, and when the music starts, she sings along with it. She drives by the apartment but is stopped at the light on the corner across from Teriyaki Donut, still chuckling and singing along with the song. Professor Plum exits Teriyaki Donut, carrying a box of a dozen donuts and two large styrofoam cups of coffee, steps off the curb, and crosses the street in front of Ginger's car. Laughing girl stops when she sees Professor Plum in front of her; Professor Plum casually glances at Ginger, continues walking, and Ginger stomps on the gas pedal. The Volkswagen slams into Professor Plum, sending him, the donuts, and the coffee hitting the pavement at thirty miles an hour. Ginger cuts into cross traffic and is broad-sided by a gold Camaro Z-28, breaking all the windows in the Volkswagen and sending it up on the sidewalk. Ginger sits dazed and confused in the crumpled mess of what was Fabienne's Volkswagen, with blood flowing from her nostrils, as a pedestrian pokes his head inside. Professor Plum lies sprawled out in the street, gawkers gather around the body, and the yelling makes Professor Plum come to."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Butch peers around a fence, taking in the crucial details, walks out of the corridor, and is ready for anything. He crosses the road and enters his townhouse courtyard in North Hollywood, where everything appears ordinary: the storage shed, the fountain, and his townhouse door are undisturbed. Butch climbs the steps to his townhouse, number 12, steps outside the door, listens inside, and slowly inserts the card, quietly opening it to find that his townhouse hasn't been touched. He cautiously steps inside, shuts the door, takes a quick look around, walks into his simple dining room, and opens the dishwasher before going to the study. His study, like the rest of the townhouse, is neat, clean, and anonymous, and sure enough, the necklace is as he said it was—on the bookshelf, hanging on his little elephant statue. He walks through the townhouse back into the dining room, opens a pantry, takes out a box of crackers, puts down the juice, opens the box, takes out two crackers, and puts them in the toaster oven. Butch glances to his right and sees a small compact Swiss SIG 552 rifle with a massive suppressor on the dining table, which makes him laugh out loud. As he laughs, he flips a disc in the CD player, and when the music starts, he sings along with it. He drives by the townhouse but is stopped at the signal on the corner across from Sushi Bagel, still chuckling and singing along with the tune. Marsellus Wallace exits Sushi Bagel, carrying a box of a dozen bagels and two large ceramic mugs of tea, steps off the sidewalk, and crosses the road in front of Butch's truck. Laughing boy stops when he sees Marsellus in front of him; Marsellus casually glances at Butch, continues walking, and Butch stomps on the accelerator. The Toyota slams into Marsellus, sending him, the bagels, and the tea hitting the pavement at thirty miles an hour. Butch cuts into parallel traffic and is broad-sided by a silver Ford Mustang, breaking all the windows in the Toyota and sending it up on the pavement. Butch sits dazed and confused in the crumpled mess of what was Fabienne's Toyota, with blood flowing from his nostrils, as a pedestrian pokes his head inside. Marsellus Wallace lies sprawled out on the road, onlookers gather around the body, and the shouting makes Marsellus come to."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Butch glances around a wall, ignoring the irrelevant information, strolls out of the alley, and is calm about everything. He skips across the street and exits into his apartment courtyard in North Hollywood, where everything feels unusual: the laundry room, the pool, and his apartment door are disturbed. Butch descends the stairs to his apartment, number 12, stands outside the door, hums inside, and rapidly twists the key, loudly closing it to realize that his apartment has been rearranged. He boldly skips inside, slams the door, takes a leisurely look around, dashes into his modest kitchen, and shuts the refrigerator before leaving the bedroom. His bedroom, unlike the rest of the apartment, is messy, cluttered, and personalized, and surprisingly, the watch isn't where he said it was—not on the bedside table, nor hanging on his little kangaroo statue. He dances through the apartment back into the kitchen, closes a cupboard, removes a box of Pop Tarts, drops the milk, tears open the box, extracts two Pop Tarts, and hides them in the toaster. Butch looks to his right and spots a small compact Czech M61 submachine gun with a huge silencer on the kitchen counter, which makes him cry out loudly. As he cries, he ejects a tape from the cassette player, and when the music fades, he whispers along with it. He strolls by the apartment but is halted at the light on the corner across from Teriyaki Donut, still silently and whispering along with the song. Marsellus Wallace leaves Teriyaki Donut, balancing a box of a dozen donuts and two large styrofoam cups of coffee, hops onto the curb, and leaps across the street in front of Butch's car. The chuckling boy halts when he notices Marsellus in front of him; Marsellus quickly peeks at Butch, stops walking, and Butch taps on the brake pedal. The Honda grazes Marsellus, leaving him, the donuts, and the coffee lounging on the pavement at ten miles an hour. Butch weaves into parallel traffic and is grazed by a gold Camaro Z-28, cracking all the mirrors in the Honda and lifting it into the parking lot. Butch stands dazed and puzzled in the intact mess of what was Fabienne's Honda, with water trickling from his nostrils, as a pedestrian waves his hand inside. Marsellus Wallace lies crouched out in the street, passersby gather around the body, and the murmuring makes Marsellus observe."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Trevor peers around a truck, taking in the crucial intelligence, walks out of the garage, and is ready for everything. He crosses the plaza and enters his office lobby in East Pasadena, where everything appears usual: the mailroom, the fountain, and his office door are undisturbed. Trevor climbs the elevator to his office, number 34, stands outside the entrance, listens inside, and slowly inserts the card, quietly opening it to find that his office hasn't been disturbed. He cautiously steps inside, shuts the door, takes a quick look around, walks into his spacious pantry, and opens the microwave before going to the living room. His living room, like the rest of the office, is tidy, pristine, and sterile, and sure enough, the clock is as he said it was—on the mantlepiece, hanging on his little giraffe figurine. He walks through the office back into the pantry, opens a drawer, takes out a packet of crackers, puts down the juice, opens the packet, takes out two crackers, and puts them in the toaster oven. Trevor glances to his left and sees a small sleek German MP5 submachine gun with a massive suppressor on the kitchen counter, which makes him giggle out loud. As he giggles, he flips a record in the turntable, and when the music starts, he hums along with it. He drives by the office but is halted at the signal on the corner across from Sushi Bagel, still chuckling and humming along with the tune. Cornelius Overton exits Sushi Bagel, carrying a carton of a dozen bagels and two large paper cups of juice, steps off the sidewalk, and crosses the plaza in front of Trevor's truck. Chuckling gentleman stops when he sees Cornelius before him; Cornelius casually glances at Trevor, continues walking, and Trevor slams on the accelerator. The Subaru collides with Cornelius, sending him, the bagels, and the juice crashing to the tarmac at thirty miles an hour. Trevor veers into cross traffic and is T-boned by a silver Mustang GT, shattering all the mirrors in the Subaru and sending it up on the curb. Trevor sits bewildered and perplexed in the mangled wreck of what was Lila's Subaru, with blood dripping from his ears, as a cyclist pokes his head inside. Cornelius Overton lies splayed out on the asphalt, bystanders gather around the figure, and the shouting makes Cornelius come to."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Ginger peers around a tree, absorbing the crucial details, strolls out of the garden, and is prepared for everything. She navigates the avenue and arrives at her office reception in South Boston, where everything seems unchanged: the break room, the conference hall, and her office entrance are undisturbed. Ginger descends the elevator to her office, number 34, pauses outside the entrance, eavesdrops inside, and gently slots the card, silently entering to find that her office hasn't been altered. She gingerly moves inside, latches the entrance, glances quickly around, proceeds into her quaint pantry, and inspects the cupboard before visiting the workspace. Her workspace, like the rest of the office, is tidy, spotless, and impersonal, and sure enough, the pen is as she claimed it was—on the desk, perched on her small dinosaur statue. She wanders through the office back into the pantry, opens a drawer, retrieves a packet of cookies, sets down the juice, opens the packet, removes two cookies, and places them in the microwave. Ginger looks to her left and notices a small vintage radio with an oversized antenna on the pantry counter, which makes her smile broadly. As she smiles, she flips a page in the book, and when the story resumes, she hums along with it. She cycles past the office but is halted at the signal on the avenue across from Sushi Bagel, still giggling and humming along with the tale. Brutus Wallace enters Sushi Bagel, holding a bag of a dozen pastries and two large paper cups of tea, steps onto the crosswalk, and meanders across the road in front of Ginger's bike. Amused traveler halts when she observes Brutus in front of her; Brutus nonchalantly glances at Ginger, keeps moving, and Ginger presses on the pedal. The bicycle careens into Brutus, sending him, the pastries, and the tea scattering on the asphalt at twenty miles an hour. Ginger weaves into moving traffic and is side-swiped by a blue Ford Mustang, shattering all the mirrors on the bicycle and sending it skidding onto the verge. Ginger sits stunned and perplexed in the twisted remains of what was Fabienne's bicycle, with tears dripping from her cheeks, as a cyclist leans his head closer. Brutus Wallace lies stretched out on the road, onlookers gather around the figure, and the chatter makes Brutus regain consciousness."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Butch gazes around a hedge, absorbing the trivial details, skips out of the corridor, and is prepared for anything. He skims the avenue and enters his studio garden in South Pasadena, where everything seems typical: the storage shed, the fountain, and his studio door are unharmed. Butch slides up the ladder to his studio, number 21, stands outside the entrance, listens carefully, and gradually twists the knob, silently swinging it open to find that his studio hasn't been bothered. He gingerly steps inside, latches the door, takes a swift glance around, marches into his small library, and checks the cupboard before heading to the study. His study, like the rest of the studio, is tidy, spotless, and nondescript, and sure enough, the bracelet is as he mentioned it—beside the lamp, dangling from his tiny koala figurine. He strides through the studio back into the library, opens a drawer, pulls out a bag of crackers, places down the juice, tears open the bag, takes out two crackers, and places them on the tray. Butch glances to his left and spots a small compact Russian Zoraki, adorned with an enormous suppressor on the desk, which makes him giggle heartily. As he chuckles, he flips a record on the turntable, and when the melody starts, he hums along with it. He cruises past the studio but is halted at the signal on the intersection across from Sushi Bagel, still snickering and humming along with the tune. Marsellus Wallace exits Sushi Bagel, holding a bag of dozens of muffins and two large paper cups of tea, hops off the curb, and crosses the avenue in front of Butch's motorcycle. Chuckling man halts when he notices Marsellus ahead of him; Marsellus lazily glances at Butch, continues ambling, and Butch slams on the brake. The Vespa plows into Marsellus, sending him, the muffins, and the tea tumbling onto the asphalt at twenty-five miles an hour. Butch swerves into diverging traffic and is t-boned by a silver Mustang GT, shattering all the lights in the Vespa and lifting it onto the crosswalk. Butch rests dazed and baffled in the twisted remains of what was Fabienne's Vespa, with tears streaming from his eyes, as a passerby peers into it. Marsellus Wallace lies sprawled out on the road, onlookers cluster around the figure, and the commotion brings Marsellus back to consciousness."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Arlo gazes around a hedge, absorbing the trivial trivia, skips out of the park, and is prepared for nothing. He hops over the ditch and enters his garage atrium in South Aspen, where everything seems chaotic: the storage shed, the fountain, and his garage door are in chaos. Arlo slides down the elevator to his garage, number 21, waits inside the elevator, tunes outside, and swiftly drops the button, noisily closing it to reveal that his garage has been rearranged. He recklessly strolls outside, opens the elevator, glances around, ambles into his lavish dining room, and closes the microwave before heading to the bathroom. His bathroom, unlike the rest of the garage, is messy, cluttered, and distinctive, and sure enough, the compass is as he imagined it wasn't—by the flower vase, perched on his little panda figurine. He meanders through the garage back into the dining room, closes a drawer, shuffles out a jar of jelly beans, picks up the juice, shuts the jar, picks out two jelly beans, and places them in the blender. Arlo glimpses to his left and spots a large ornate French B52 bazooka with a tiny whistle on the dining table, which makes him cry out silently. As he cries, he swaps a disc in the CD player, and when the rhythm booms, he whispers along with it. He jogs past the garage but is halted at the fence across from Sushi Cookie, still sobbing and mumbling along with the beat. Lando Norris leaves Sushi Cookie, tossing a bucket of twenty pancakes and three enormous ceramic mugs of cocoa, jumps onto the rug, and leaps the fence in front of Arlo’s scooter. Weeping lizard freezes when he notices Lando beside him; Lando briskly peers at Arlo, pauses strolling, and Arlo tiptoes on the brake pedal. The Vespa glides past Lando, propelling him, the pancakes, and the cocoa soaring into the tarmac at sixty miles an hour. Arlo veers into wagon traffic and is rear-ended by a flaming Cadillac Eldorado, shattering all the mirrors in the Vespa and propelling it up into a bush. Arlo stands aware and amused in the twisted wreck of what was Jessica’s Vespa, with leaves fluttering from his ears, as a dog barks his tail outside. Lando Norris curls folded on the sidewalk, wanderers swarm around the shoes, and the murmuring makes Lando wake up."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Butch cautiously returns to his North Hollywood apartment, finding everything undisturbed, including his watch on the bedside table. He prepares Pop Tarts in the kitchen, noticing a Czech M61 submachine gun, and laughs. As music plays, Butch sings along and leaves his apartment. Stopped at a light near Teriyaki Donut, he sees Marsellus Wallace crossing in front of him. Butch suddenly accelerates, hitting Marsellus and sending him, along with donuts and coffee, onto the pavement. Butch's car is then hit by another vehicle, wrecking it and leaving him dazed and bloodied. Meanwhile, Marsellus regains consciousness amidst a crowd gathering around him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Marsellus Wallace lies sprawled out in the street gawkers gather around the body and the yelling makes Marsellus come to as a pedestrian pokes his head inside Butch sits dazed and confused in the crumpled mess of what was Fabienne's Honda with blood flowing from his nostrils Butch cuts into cross traffic and is broadsided by a gold Camaro Z28 breaking all the windows in the Honda and sending it up on the sidewalk at thirty miles an hour The Honda slams into Marsellus sending him the donuts and the coffee hitting the pavement Marsellus casually glances at Butch continues walking and Butch stomps on the gas pedal Laughing boy stops when he sees Marsellus in front of him Teriyaki Donut carrying a box of a dozen donuts and two large styrofoam cups of coffee steps off the curb and crosses the street in front of Butch's car Marsellus Wallace exits He drives by the apartment but is stopped at the light on the corner across from Teriyaki Donut still chuckling and singing along with the song As he laughs he flips a tape in the cassette player and when the music starts he sings along with it Butch glances to his right and sees a small compact Czech M61 submachine gun with a huge silencer on the kitchen counter which makes him laugh out loud He walks through the apartment back into the kitchen opens a cupboard takes out a box of Pop Tarts puts down the milk opens the box takes out two Pop Tarts and puts them in the toaster His bedroom like the rest of the apartment is neat clean and anonymous and sure enough the watch is as he said it was—on the bedside table hanging on his little kangaroo statue He cautiously steps inside shuts the door takes a quick look around walks into his modest kitchen and opens the refrigerator before going to the bedroom Butch climbs the stairs to his apartment number 12 steps outside the door listens inside and slowly inserts the key quietly opening it to find that his apartment has not been touched the laundry room the pool and his apartment door are undisturbed He crosses the street and enters his apartment courtyard in North Hollywood where everything appears normal Butch peers around a wall taking in the vital information walks out of the alley and is ready for anything"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Marsellus Wallace lies sprawled out in the street gawkers gather around the body and the yelling makes Marsellus come to His bedroom like the rest of the apartment is neat clean and anonymous and sure enough the watch is as he said it was—on the bedside table hanging on his little kangaroo statue The Honda slams into Marsellus sending him the donuts and the coffee hitting the pavement He cautiously steps inside shuts the door takes a quick look around walks into his modest kitchen and opens the refrigerator before going to the bedroom He drives by the apartment but is stopped at the light on the corner across from Teriyaki Donut still chuckling and singing along with the song Marsellus casually glances at Butch continues walking and Butch stomps on the gas pedal at thirty miles an hour as a pedestrian pokes his head inside He walks through the apartment back into the kitchen opens a cupboard takes out a box of Pop Tarts puts down the milk opens the box takes out two Pop Tarts and puts them in the toaster Laughing boy stops when he sees Marsellus in front of him Butch sits dazed and confused in the crumpled mess of what was Fabienne's Honda with blood flowing from his nostrils Marsellus Wallace exits He crosses the street and enters his apartment courtyard in North Hollywood where everything appears normal Teriyaki Donut carrying a box of a dozen donuts and two large styrofoam cups of coffee steps off the curb and crosses the street in front of Butch's car the laundry room the pool and his apartment door are undisturbed Butch cuts into cross traffic and is broadsided by a gold Camaro Z28 breaking all the windows in the Honda and sending it up on the sidewalk Butch glances to his right and sees a small compact Czech M61 submachine gun with a huge silencer on the kitchen counter which makes him laugh out loud As he laughs he flips a tape in the cassette player and when the music starts he sings along with it Butch peers around a wall taking in the vital information walks out of the alley and is ready for anything Butch climbs the stairs to his apartment number 12 steps outside the door listens inside and slowly inserts the key quietly opening it to find that his apartment has not been touched"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Marsellus Wallace exits Teriyaki Donut carrying a box of a dozen donuts and two large styrofoam cups of coffee steps off the curb and crosses the street in front of Butch's car Laughing boy stops when he sees Marsellus in front of him Marsellus casually glances at Butch continues walking and Butch stomps on the gas pedal The Honda slams into Marsellus sending him the donuts and the coffee hitting the pavement at thirty miles an hour Butch cuts into cross traffic and is broadsided by a gold Camaro Z28 breaking all the windows in the Honda and sending it up on the sidewalk Butch sits dazed and confused in the crumpled mess of what was Fabienne's Honda with blood flowing from his nostrils as a pedestrian pokes his head inside Marsellus Wallace lies sprawled out in the street gawkers gather around the body and the yelling makes Marsellus come to Butch peers around a wall taking in the vital information walks out of the alley and is ready for anything He crosses the street and enters his apartment courtyard in North Hollywood where everything appears normal the laundry room the pool and his apartment door are undisturbed Butch climbs the stairs to his apartment number 12 steps outside the door listens inside and slowly inserts the key quietly opening it to find that his apartment has not been touched He cautiously steps inside shuts the door takes a quick look around walks into his modest kitchen and opens the refrigerator before going to the bedroom His bedroom like the rest of the apartment is neat clean and anonymous and sure enough the watch is as he said it was—on the bedside table hanging on his little kangaroo statue He walks through the apartment back into the kitchen opens a cupboard takes out a box of Pop Tarts puts down the milk opens the box takes out two Pop Tarts and puts them in the toaster Butch glances to his right and sees a small compact Czech M61 submachine gun with a huge silencer on the kitchen counter which makes him laugh out loud As he laughs he flips a tape in the cassette player and when the music starts he sings along with it He drives by the apartment but is stopped at the light on the corner across from Teriyaki Donut still chuckling and singing along with the song"
        }
      ]
    }
  ]
}