{
  "ground_truth": "A weaving knee-level tracking shot follows a six-year-old boy in shorts and a dirty T-shirt as he tramps around the trailer, brandishing a big stick, before shifting focus to Hi, who bends down to pull a couple of beers from the refrigerator, raising his voice to be heard over the din of children. As Hi considers the situation, he looks down, starts laughing, then catches himself, while the bam-shouting six-year-old bangs a stick on the TV and a kid in a cowboy hat slaps Hi on the ass. Hi takes a sip of beer and looks at another child finishing off the T in FART in crayon on the wall as Glen chuckles at his errant child, just before the sound of shattering glass is heard. Glen looks around, then Dot faces Hi and Ed across a picnic table covered with grilled hamburgers, rolls, a green jello mold, and a cooler, as one younger child occasionally flings jello at Hi, unnoticed by the two women. Hi sits stock-still with a stony face as Dot shrieks, then he shrugs and flinches at jello hitting his shoulder while Dot looks offscreen. The scene shifts to tracking on Hi and Glen walking side by side, with Glen sopping wet, in a swimming suit and wing-tipped shoes, his body ghostly pale except for a bright angry red V-area and arms below the short sleeve line. Glen bursts out laughing, slaps Hi on the back, and chuckles as he eyes Hi shrewdly. Both stop walking; Hi looks puzzled at Glen, who lays a companionable hand on Hi's shoulder and speaks confidentially, nodding energetically through clenched teeth, until THWAK - Hi's fist connects with Glen's jaw, sending him airborne and landing in a heap. Glen rubs his jaw groggily as Hi approaches menacingly, prompting Glen to run, with Hi pursuing. Glen, looking back, shouts at Hi but crashes into a tree and drops like a sack of cement. Later, Hi drives with his jaw rigidly set and temple throbbing, while Nathan Jr. sits in a safety seat between him and Ed.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A meandering knee-level trailing shot follows a six-year-old lad in shorts and a grimy T-shirt as he tramps around the caravan, brandishing a large stick, before shifting attention to Hi, who stoops down to extract a pair of brews from the fridge, raising his voice to be heard over the din of youngsters. As Hi reflects on the predicament, he gazes downward, begins chuckling, then checks himself, while the bam-yelling six-year-old bashes a stick on the television and a youngster in a cowboy hat slaps Hi on the rear. Hi takes a sip of brew and observes another youngster finishing off the T in FART in crayon on the partition as Glen chuckles at his wayward youngster, just before the noise of breaking glass is heard. Glen glances around, then Dot faces Hi and Ed across a picnic table laden with grilled burgers, buns, a green jello mold, and a cooler, as one younger youngster occasionally flings jello at Hi, unnoticed by the two women. Hi sits motionless with a stony expression as Dot shrieks, then he shrugs and flinches at jello striking his shoulder while Dot looks offscreen. The scene transitions to trailing on Hi and Glen strolling side by side, with Glen sopping damp, in a swimwear and wing-tipped shoes, his body ghostly pale except for a bright irate red V-area and arms below the short sleeve line. Glen erupts into laughter, slaps Hi on the back, and chuckles as he gazes at Hi shrewdly. Both halt strolling; Hi looks baffled at Glen, who places a friendly hand on Hi's shoulder and speaks confidentially, nodding energetically through clenched teeth, until THWAK - Hi's fist connects with Glen's jaw, sending him airborne and landing in a heap. Glen massages his jaw groggily as Hi approaches threateningly, prompting Glen to flee, with Hi pursuing. Glen, glancing back, shouts at Hi but crashes into a tree and collapses like a sack of concrete. Later, Hi drives with his jaw rigidly set and temple throbbing, while Nathan Jr. sits in a safety seat between him and Ed."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A weaving knee-level tracking shot is followed by a six-year-old boy in shorts and a dirty T-shirt as a big stick is brandished by him while he tramps around the trailer, before the focus is shifted to Hi, who is bent down and pulls a couple of beers from the refrigerator, raising his voice to be heard over the din of children. As the situation is considered by Hi, he looks down, starts laughing, then he catches himself, while a stick is banged on the TV by the bam-shouting six-year-old and the ass of Hi is slapped by a kid in a cowboy hat. A sip of beer is taken by Hi and he looks at another child, who finishes off the T in FART in crayon on the wall, as Glen chuckles at his errant child, just before the sound of shattering glass is heard. Glen looks around, then Dot faces Hi and Ed across a picnic table covered with grilled hamburgers, rolls, a green jello mold, and a cooler, while one younger child occasionally flings jello at Hi, unnoticed by the two women. Hi is sat stock-still with a stony face as Dot shrieks; then he shrugs and flinches at jello, which hits his shoulder while Dot looks offscreen. The scene is shifted to tracking on Hi and Glen, who are walking side by side, with Glen being sopped wet, in a swimming suit and wing-tipped shoes, his body ghostly pale except for a bright angry red V-area and arms below the short sleeve line. Glen bursts out laughing, slaps Hi on the back, and he chuckles as Hi is eyed shrewdly by him. Both stop walking; Hi's puzzled look is directed at Glen, who lays a companionable hand on Hi's shoulder and speaks confidentially, energetically nodding through clenched teeth, until THWAK - Glen's jaw is connected with by Hi's fist, sending him airborne and he lands in a heap. Glen's jaw is rubbed groggily by him as Hi menaces in approach, prompting Glen to run, with Hi pursuing. Glen, looking back, shouts at Hi but he crashes into a tree and he drops like a sack of cement. Later, a car is driven by Hi with his jaw rigidly set and temple throbbing, while Nathan Jr. is sat in a safety seat between him and Ed."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A knee-level tracking shot follows a six-year-old in shorts and a dirty shirt as he tramps around the trailer with a stick, shifting to Hi pulling beers from the fridge, speaking over children's noise. Hi laughs but restrains himself as the boy bangs a stick on the TV and another in a cowboy hat smacks Hi. Hi drinks beer, observing a kid finish \"FART\" in crayon on the wall while Glen chuckles at his kid, just before shattering glass sounds. Dot faces Hi and Ed at a picnic table with burgers, rolls, jello, and a cooler; a child occasionally flings jello at Hi, unnoticed by the women. Hi remains still, flinching at jello hitting his shoulder while Dot shrieks. The scene shifts to Hi and Glen walking, with Glen sopping wet in a swimsuit and wing-tipped shoes, pale except for a bright red V and arms below the sleeves. Glen laughs, slaps Hi's back, and speaks confidentially until Hi's fist hits Glen's jaw, sending him flying. Glen rubs his jaw as Hi approaches menacingly, and Glen runs. He shouts back at Hi but crashes into a tree. Later, Hi drives with a tense jaw and throbbing temple as Nathan Jr. sits in a safety seat between him and Ed."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A knee-level tracking shot follows a six-year-old boy with a big stick around the trailer, then shifts to Hi grabbing beers from the fridge, raising his voice over noisy kids. Hi laughs, stops, and a boy hits the TV with a stick while another slaps Hi. Hi drinks beer as a child finishes \"FART\" in crayon on the wall, and Glen chuckles at his child's antics. Shattering glass is heard. Dot faces Hi and Ed at a picnic table with food, as a child throws jello at Hi. Hi sits motionless, flinching as jello hits him, while Dot shrieks. The scene shifts to Hi and Glen walking, with Glen wet in a swimsuit and shoes, laughing and slapping Hi's back. Glen speaks confidentially to Hi until Hi punches him, sending him flying. Glen groggily rubs his jaw as Hi approaches, prompting Glen to flee. Glen crashes into a tree while looking back. Later, Hi drives with a tense jaw, Nathan Jr. in a safety seat between him and Ed."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The camera follows a weaving knee-level tracking shot that captures the movements of a young boy, no older than six, clad in shorts and a grubby T-shirt. With an air of adventure, he makes his way around the trailer, wielding a substantial stick, before the focus shifts to Hi. Hi is seen bending down to retrieve a couple of beers from the refrigerator, raising his voice to ensure he is heard above the clamorous sounds of children playing noisily in the background. As Hi contemplates the unfolding situation, he looks downward, begins to laugh heartily, then quickly composes himself, while the exuberant six-year-old enthusiastically bangs a stick against the TV. A kid, wearing a distinctive cowboy hat, playfully slaps Hi on the backside. Hi takes a moment to sip his beer and notices another child completing the letter \"T\" in the word \"FART\" with crayon on the wall. Meanwhile, Glen chuckles at the antics of his unruly offspring, just before the abrupt sound of shattering glass pierces the air. Glen darts his eyes around, while Dot turns to face Hi and Ed across a picnic table, which is laden with an array of delectable grilled hamburgers, fresh rolls, a vibrant green jello mold, and a cooler. Every now and then, a younger child hurls a bit of jello at Hi, going unnoticed by the two women due to their engrossing conversation. Hi remains perfectly still, his demeanor unreadable, as Dot lets out a shriek. He then shrugs, flinching slightly as another piece of jello lands on his shoulder, with Dot's attention momentarily diverted offscreen. The scene transitions smoothly to a tracking shot of Hi and Glen walking side by side. Glen, completely drenched, wears an unusual combination of a swimming suit and wing-tipped shoes, his exposed skin ghostly pale, except for a brilliant, angry red V-shaped patch along with his arms below the short sleeve line. Glen erupts in laughter, giving Hi a hearty slap on the back, and chuckles while studying Hi with a shrewd gaze. Both men come to a stop; Hi exhibits a puzzled expression as Glen, laying a friendly hand on Hi's shoulder, begins to speak in a confidential tone, nodding with vigor through clenched teeth. Without warning, THWAK - Hi's fist lands squarely on Glen's jaw, sending him airborne before he crashes down in a heap. Rubbing his jaw sluggishly, Glen registers Hi’s menacing approach, which propels him to take flight, with Hi hot on his heels. In a desperate attempt to escape, Glen looks back to yell at Hi but inadvertently crashes into a tree, collapsing to the ground like a heavy sack of cement. In the aftermath, Hi is seen driving, his jaw set with determination and his temple visibly throbbing with tension, while young Nathan Jr. sits securely in a safety seat, nestled between Hi and Ed."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In a dynamic scene artfully captured by the camera, a weaving, knee-high tracking shot follows with precision, capturing the lively movements of a young boy, who appears to be no older than the tender age of six years. This spirited young lad, dressed in well-worn shorts and a grubby T-shirt, embodies the essence of childhood adventure as he energetically navigates his way around the trailer. With a substantial stick held firmly in his hands, his antics are captured before the focus shifts seamlessly to Hi. In this moment, Hi is observed bending down with intent, as he retrieves a couple of beers from the refrigerator. To ensure he is heard above the lively and clamorous din created by children playing noisily in the background, he raises his voice, projecting it over the chaos. Reflecting on the unfolding situation, Hi looks downward thoughtfully, and a hearty laugh escapes him before he quickly composes himself. Meanwhile, the exuberant six-year-old enthusiastically taps the stick against the television set. A child, sporting a distinctive cowboy hat, playfully delivers a light-hearted slap to Hi’s backside. Taking a moment to savor a sip of his beer, Hi then notices another child diligently completing the letter \"T\" in the word \"FART\" on the wall using a crayon. Concurrently, Glen is seen chuckling at the antics of his unruly offspring, just moments before the sharp, abrupt sound of shattering glass cuts through the air. Glen's eyes dart around swiftly, while Dot turns her attention to face Hi and Ed across a picnic table—a table laden with an enticing array of delectable grilled hamburgers, fresh rolls, a vibrant green jello mold, and a conveniently placed cooler. From time to time, one of the younger children mischievously hurls a piece of jello at Hi, which goes unnoticed by the two women who are deeply engrossed in their conversation. Hi stands perfectly still, his expression unreadable, as Dot suddenly lets out a shriek. He merely shrugs, flinching slightly as another fragment of jello lands squarely on his shoulder, with Dot's attention momentarily diverted offscreen. The scene transitions smoothly, maintaining its fluidity, to a new tracking shot of Hi and Glen walking side by side. Glen appears completely drenched, curiously dressed in an unusual combination of a swimming suit paired with wing-tipped shoes. His exposed skin is a ghostly pale, notably except for a vivid, angry red V-shaped patch that marks his arms below the short sleeve line. Glen erupts into boisterous laughter, giving Hi a hearty, friendly slap on the back, all the while chuckling and studying Hi with a shrewd, discerning gaze. As both men come to a halt, Hi’s expression betrays a sense of puzzled wonder, while Glen, placing a friendly hand on Hi's shoulder, begins speaking in a confidential tone, nodding with visible vigor through his clenched teeth. Without warning, THWAK – Hi's fist lands squarely on Glen's jaw, sending him airborne before he crashes to the ground in a heap. Rubbing his jaw sluggishly, Glen registers Hi’s menacing approach, which propels him to take flight, with Hi relentlessly pursuing him. In a desperate bid to escape, Glen glances back to shout at Hi but inadvertently collides headlong into a tree, collapsing to the ground like a heavy sack of cement. In the aftermath of these frenetic events, Hi is seen driving, his jaw set with unwavering determination and his temple visibly throbbing with the tension of the moment, while young Nathan Jr. sits securely in a safety seat, nestled comfortably between Hi and Ed."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The camera captures a weaving knee-level tracking shot, honing in on a six-year-old boy clad in shorts and a dirty T-shirt. His small frame energetically circles the trailer, a big stick brandished in his hand, creating a lively scene that momentarily dominates the screen. The camera then shifts its focus to Hi, who bends his knees, lowering his tall frame to reach into the refrigerator, from which he retrieves a couple of beers. As he pulls himself upright, he raises his voice, striving to be heard over the commotion of children filling the air with chaos. Pondering the situation at hand, Hi's gaze drops downward, a chuckle inadvertently escaping his lips, though he quickly stifles it. Meanwhile, the bam-shouting six-year-old exuberantly bangs his stick against the TV, and another child, donning a cowboy hat, cheekily slaps Hi on the rear. Hi pauses, lifting the beer bottle to his lips for a sip, and his eyes catch sight of yet another child putting the final crayon strokes on the 'T' in 'FART' on the wall. Glen, witnessing his child's escapade, chuckles quietly to himself. The jovial moment is abruptly interrupted by the sound of glass shattering nearby. Glen casts his eyes around, assessing the surroundings, and the scene transitions to Dot, who faces Hi and Ed across a picnic table laden with grilled hamburgers, rolls, a jello mold in a vibrant green hue, and a cooler. Amid this setting, a younger child occasionally lets jello fly at Hi, with neither Dot nor Ed noticing. Hi remains perfectly still, maintaining a stony facade, even as Dot's shrieks punctuate the air, causing him to shrug and involuntarily flinch when jello splats onto his shoulder. Dot's attention diverts offscreen, leading to the next scene where Hi and Glen walk side by side, with Glen notably sopping wet, dressed peculiarly in a swimming suit paired with wing-tipped shoes. Glen's skin appears ghostly pale, stark against the vivid, angry red V-area on his chest and his sunburnt arms below the short sleeve line. Their walk is interrupted as Glen bursts into laughter, a friendly hand reaching to slap Hi on the back, his gaze shrewd and full of mirth. As they both come to a halt, Hi gives Glen a puzzled look, and Glen, in response, places a companionable hand on Hi's shoulder, speaking in a confidential tone, nodding energetically through teeth clenched with amusement. Suddenly, THWAK—Hi's fist meets Glen's jaw with force, propelling Glen into the air and sending him crashing into a heap on the ground. Groggily, Glen rubs his jaw, trying to gather his senses as Hi approaches, exuding a menacing aura. Alarmed, Glen scrambles to his feet and races away, Hi hot on his heels. As Glen glances back, he shouts over his shoulder at his pursuer but fails to see a tree looming ahead, resulting in a collision that leaves him crumpled like a sack of cement. Eventually, the scene shifts to Hi driving, his jaw set rigidly, the tension evident in the throbbing of his temple. Beside him, Nathan Jr. sits securely in a safety seat, sandwiched between Hi and Ed, as the vehicle moves forward."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The camera tracks a six-year-old boy wielding a big stick as he moves around the trailer, before transitioning to Hi, who grabs some beers from the fridge and raises his voice over the noise of children. As Hi contemplates the situation, he laughs to himself, momentarily interrupted by a six-year-old banging a stick on the TV and a kid in a cowboy hat playfully slapping him. Hi sips his beer, observing another child finishing graffiti on the wall while Glen chuckles at his child's antics, just as the sound of breaking glass is heard. Glen scans the room, and Dot faces Hi and Ed across a picnic table laden with food, while a young child sporadically lobs jello at Hi, unnoticed by the women. Hi remains still with a stoic expression as Dot shrieks, then reacts to jello hitting him, while Dot looks away. The scene shifts to Hi and Glen walking side by side; Glen is soaked, wearing a swimsuit and dress shoes, with a pale complexion except for sunburned areas. Glen bursts into laughter, slapping Hi's back and eyeing him shrewdly. They stop, and Glen talks confidentially, nodding vigorously until Hi punches him, sending him flying. Groggily, Glen rubs his jaw as Hi menaces him, prompting Glen to flee with Hi in pursuit. Glen looks back, shouting, but crashes into a tree and collapses. Later, Hi drives with a tense jaw and throbbing temple, with Nathan Jr. in a safety seat between him and Ed."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A weaving knee-level tracking shot follows a six-year-old boy in shorts and a dirty T-shirt as he tramps around the trailer park, a community often associated with transient living and close-quartered neighborhoods, brandishing a big stick, before shifting focus to Hi, who bends down to pull a couple of beers from the refrigerator, the brand emblazoned with a familiar logo from a local brewery, raising his voice to be heard over the din of children. As Hi considers the chaotic situation, reminiscent of a scene from a classic domestic comedy, he looks down, starts laughing, then catches himself, while the bam-shouting six-year-old bangs a stick on the TV, an old CRT model with rabbit ear antennas, and a kid in a cowboy hat, a nod to the area's Western influences, slaps Hi on the ass. Hi takes a sip of beer and looks at another child finishing off the T in FART in crayon on the wall as Glen, who is often amused by his child's antics, chuckles at his errant child, just before the sound of shattering glass is heard, echoing the domestic mayhem. Glen looks around, then Dot faces Hi and Ed across a picnic table covered with grilled hamburgers, rolls, a green jello mold popular in mid-century American cuisine, and a cooler, as one younger child occasionally flings jello at Hi, unnoticed by the two women engaged in a conversation typical of suburban gatherings. Hi sits stock-still with a stony face as Dot shrieks at the flying dessert, then he shrugs and flinches at jello hitting his shoulder, while Dot looks offscreen, perhaps distracted by another commotion. The scene shifts to tracking on Hi and Glen walking side by side, with Glen sopping wet, in a swimming suit and wing-tipped shoes, a dissonant combination suggesting a recent spontaneous swim that left his body ghostly pale except for a bright angry red V-area and arms below the short sleeve line, a result of sunburn from uneven sun exposure. Glen bursts out laughing, slaps Hi on the back, and chuckles as he eyes Hi shrewdly with the air of someone concocting a mischievous plan. Both stop walking; Hi looks puzzled at Glen, who lays a companionable hand on Hi's shoulder and speaks confidentially, nodding energetically through clenched teeth, a sign of trying to convince Hi of something dubious, until THWAK - Hi's fist connects with Glen's jaw, sending him airborne and landing in a heap, much like a scene in slapstick comedy. Glen rubs his jaw groggily as Hi approaches menacingly, prompting Glen to run, with Hi pursuing in a chase reminiscent of cat-and-mouse antics. Glen, looking back and shouting pleas for calm at Hi but crashes into a tree, a mishap that leaves him dropping like a sack of cement. Later, Hi drives with his jaw rigidly set and temple throbbing, the tension simmering beneath his calm facade, while Nathan Jr., the baby they are determined to raise as their own despite all chaos, sits in a safety seat between him and Ed."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Later Hi drives with his jaw rigidly set and temple throbbing while Nathan Jr sits in a safety seat between him and Ed A weaving kneelevel tracking shot follows a sixyearold boy in shorts and a dirty Tshirt as he tramps around the trailer brandishing a big stick before shifting focus to Hi who bends down to pull a couple of beers from the refrigerator raising his voice to be heard over the din of children Hi looks puzzled at Glen who lays a companionable hand on Hi's shoulder and speaks confidentially nodding energetically through clenched teeth until THWAK as Glen chuckles at his errant child just before the sound of shattering glass is heard As Hi considers the situation he looks down starts laughing then catches himself while the bamshouting sixyearold bangs a stick on the TV Hi takes a sip of beer and looks at another child finishing off the T in FART in crayon on the wall and a kid in a cowboy hat slaps Hi on the ass As Hi considers the situation he looks down starts laughing then catches himself while the bamshouting sixyearold bangs a stick on the TV and a kid in a cowboy hat slaps Hi on the ass Hi takes a sip of beer and looks at another child finishing off the T in FART in crayon on the wall as Glen chuckles at his errant child just before the sound of shattering glass is heard Glen looks around then Dot faces Hi and Ed across a picnic table covered with grilled hamburgers rolls a green jello mold and a cooler as one younger child occasionally flings jello at Hi unnoticed by the two women Hi sits stockstill with a stony face as Dot shrieks then he shrugs and flinches at jello hitting his shoulder while Dot looks offscreen The scene shifts to tracking on Hi and Glen walking side by side with Glen sopping wet in a swimming suit and wingtipped shoes his body ghostly pale except for a bright angry red Varea and arms below the short sleeve line then he shrugs and flinches at jello hitting his shoulder while Dot looks offscreen Glen bursts out laughing slaps Hi on the back and chuckles as he eyes Hi shrewdly Both stop walking Both stop walking Hi looks puzzled at Glen who lays a companionable hand on Hi's shoulder and speaks confidentially nodding energetically through clenched teeth until THWAK Hi's fist connects with Glen's jaw sending him airborne and landing in a heap Glen rubs his jaw groggily as Hi approaches menacingly prompting Glen to run with Hi pursuing Glen looking back shouts at Hi but crashes into a tree and drops like a sack of cement Later Hi drives with his jaw rigidly set and temple throbbing while Nathan Jr sits in a safety seat between him and Ed A weaving kneelevel tracking shot follows a sixyearold boy in shorts and a dirty Tshirt as he tramps around the trailer brandishing a big stick before shifting focus to Hi who bends down to pull a couple of beers from the refrigerator raising his voice to be heard over the din of children"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "A weaving kneelevel tracking shot follows a sixyearold boy in shorts and a dirty Tshirt as he tramps around the trailer brandishing a big stick before shifting focus to Hi who bends down to pull a couple of beers from the refrigerator raising his voice to be heard over the din of children. As Hi considers the situation he looks down starts laughing then catches himself while the bamshouting sixyearold bangs a stick on the TV. and a kid in a cowboy hat slaps Hi on the ass. Hi takes a sip of beer and looks at another child finishing off the T in FART in crayon on the wall. as Glen chuckles at his errant child just before the sound of shattering glass is heard. Glen looks around. then Dot faces Hi and Ed across a picnic table covered with grilled hamburgers rolls a green jello mold and a cooler as one younger child occasionally flings jello at Hi unnoticed by the two women. Hi sits stockstill with a stony face as Dot shrieks. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. then he shrugs and flinches at jello hitting his shoulder while Dot looks offscreen. The scene shifts to tracking on Hi and Glen walking side by side with Glen sopping wet in a swimming suit and wingtipped shoes his body ghostly pale except for a bright angry red Varea and arms below the short sleeve line. Glen bursts out laughing slaps Hi on the back and chuckles as he eyes Hi shrewdly. Both stop walking. Hi looks puzzled at Glen who lays a companionable hand on Hi's shoulder and speaks confidentially nodding energetically through clenched teeth until THWAK. Hi's fist connects with Glen's jaw sending him airborne and landing in a heap. Glen rubs his jaw groggily as Hi approaches menacingly prompting Glen to run with Hi pursuing. Glen looking back shouts at Hi but crashes into a tree and drops like a sack of cement. Later Hi drives with his jaw rigidly set and temple throbbing while Nathan Jr sits in a safety seat between him and Ed."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "A weaving kneelevel tracking shot follows a sixyearold boy in shorts and a dirty Tshirt as he tramps around the trailer brandishing a big stick before shifting focus to Hi who bends down to pull a couple of beers from the refrigerator raising his voice to be heard over the din of children. As Hi considers the situation he looks down starts laughing then catches himself while the bamshouting sixyearold bangs a stick on the TV. and a kid in a cowboy hat slaps Hi on the ass. Hi takes a sip of beer and looks at another child finishing off the T in FART in crayon on the wall. as Glen chuckles at his errant child just before the sound of shattering glass is heard. Glen looks around. then Dot faces Hi and Ed across a picnic table covered with grilled hamburgers rolls a green jello mold and a cooler as one younger child occasionally flings jello at Hi unnoticed by the two women. Hi sits stockstill with a stony face as Dot shrieks. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. then he shrugs and flinches at jello hitting his shoulder while Dot looks offscreen. The scene shifts to tracking on Hi and Glen walking side by side with Glen sopping wet in a swimming suit and wingtipped shoes his body ghostly pale except for a bright angry red Varea and arms below the short sleeve line. Glen bursts out laughing slaps Hi on the back and chuckles as he eyes Hi shrewdly. Both stop walking. Hi looks puzzled at Glen who lays a companionable hand on Hi's shoulder and speaks confidentially nodding energetically through clenched teeth until THWAK. Hi's fist connects with Glen's jaw sending him airborne and landing in a heap. Glen rubs his jaw groggily as Hi approaches menacingly prompting Glen to run with Hi pursuing. Glen looking back shouts at Hi but crashes into a tree and drops like a sack of cement. Later Hi drives with his jaw rigidly set and temple throbbing while Nathan Jr sits in a safety seat between him and Ed."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "A weaving kneelevel tracking shot follows a sixyearold boy in shorts and a dirty Tshirt as he tramps around the trailer brandishing a big stick before shifting focus to Hi who bends down to pull a couple of beers from the refrigerator raising his voice to be heard over the din of children. As Hi considers the situation he looks down starts laughing then catches himself while the bamshouting sixyearold bangs a stick on the TV. and a kid in a cowboy hat slaps Hi on the ass. Hi takes a sip of beer and looks at another child finishing off the T in FART in crayon on the wall. Hi looks puzzled at Glen who lays a companionable hand on Hi's shoulder and speaks confidentially nodding energetically through clenched teeth until THWAK. Hi's fist connects with Glen's jaw sending him airborne and landing in a heap. Glen rubs his jaw groggily as Hi approaches menacingly prompting Glen to run with Hi pursuing. Glen looking back shouts at Hi but crashes into a tree and drops like a sack of cement. Later Hi drives with his jaw rigidly set and temple throbbing while Nathan Jr sits in a safety seat between him and Ed."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "A weaving kneelevel tracking shot follows a sixyearold boy in shorts and a dirty Tshirt as he tramps around the trailer brandishing a big stick before shifting focus to Hi who bends down to pull a couple of beers from the refrigerator raising his voice to be heard over the din of children. As Hi considers the situation he looks down starts laughing then catches himself while the bamshouting sixyearold bangs a stick on the TV. Glen looking back shouts at Hi but crashes into a tree and drops like a sack of cement. Later Hi drives with his jaw rigidly set and temple throbbing while Nathan Jr sits in a safety seat between him and Ed."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A weaving knee-level tracking shot follows a dog in shorts and a dirty T-shirt as it tramps around the trailer, brandishing a big stick, before shifting focus to a cat, who bends down to pull a couple of beers from the refrigerator, raising its voice to be heard over the din of children. As the cat considers the situation, it looks down, starts laughing, then catches itself, while the bam-shouting dog bangs a stick on the TV and a kid in a cowboy hat slaps the cat on the ass. The cat takes a sip of beer and looks at another child finishing off the T in FART in crayon on the wall as a fish chuckles at its errant child, just before the sound of shattering glass is heard. The fish looks around, then an owl faces the cat and a rabbit across a picnic table covered with grilled hamburgers, rolls, a green jello mold, and a cooler, as one younger child occasionally flings jello at the cat, unnoticed by the two women. The cat sits stock-still with a stony face as the owl shrieks, then it shrugs and flinches at jello hitting its shoulder while the owl looks offscreen. The scene shifts to tracking on the cat and the fish walking side by side, with the fish sopping wet, in a swimming suit and wing-tipped shoes, its body ghostly pale except for a bright angry red V-area and arms below the short sleeve line. The fish bursts out laughing, slaps the cat on the back, and chuckles as it eyes the cat shrewdly. Both stop walking; the cat looks puzzled at the fish, who lays a companionable hand on the cat's shoulder and speaks confidentially, nodding energetically through clenched teeth, until THWAK - the cat's fist connects with the fish's jaw, sending it airborne and landing in a heap. The fish rubs its jaw groggily as the cat approaches menacingly, prompting the fish to run, with the cat pursuing. The fish, looking back, shouts at the cat but crashes into a tree and drops like a sack of cement. Later, the cat drives with its jaw rigidly set and temple throbbing, while a squirrel sits in a safety seat between it and the rabbit."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "A weaving knee-level tracking shot follows a six-year-old boy in pajamas and a stained sweater as he wanders around the cabin, brandishing a wooden spoon, before shifting focus to Hi, who bends down to pull a couple of sodas from the pantry, raising his voice to be heard over the racket of children. As Hi considers the situation, he looks down, starts laughing, then catches himself, while the bam-shouting six-year-old bangs a spoon on the radio and a kid in a pirate hat slaps Hi on the back. Hi takes a sip of soda and looks at another child finishing off the R in CART in marker on the floor as Glen chuckles at his errant child, just before the sound of breaking plates is heard. Glen looks around, then Dot faces Hi and Ed across a blanket covered with grilled hotdogs, buns, a red jello mold, and a basket, as one younger child occasionally flings jello at Hi, unnoticed by the two women. Hi sits stock-still with a stony face as Dot shrieks, then he shrugs and flinches at jello hitting his arm while Dot looks offscreen. The scene shifts to tracking on Hi and Glen walking side by side, with Glen sopping wet, in a bathrobe and flip-flops, his body ghostly pale except for a bright angry red V-area and legs below the short hemline. Glen bursts out laughing, slaps Hi on the shoulder, and chuckles as he eyes Hi shrewdly. Both stop walking; Hi looks puzzled at Glen, who lays a companionable hand on Hi's arm and speaks confidentially, nodding energetically through clenched teeth, until THWAK - Hi's fist connects with Glen's nose, sending him airborne and landing in a heap. Glen rubs his nose groggily as Hi approaches menacingly, prompting Glen to run, with Hi pursuing. Glen, looking back, shouts at Hi but crashes into a bush and drops like a sack of flour. Later, Hi drives with his mouth rigidly set and temple throbbing, while Nathan Jr. sits in a booster seat between him and Ed."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "A weaving knee-level tracking shot follows a six-year-old boy in shorts and a dirty T-shirt as he prances around the trailer, juggling a big stick, before shifting focus to Hi, who kneels down to extract a couple of beers from the refrigerator, raising his voice to be heard over the chatter of children. As Hi evaluates the situation, he glances down, bursts into laughter, then composes himself, while the bam-shouting six-year-old taps a stick on the TV and a kid in a cowboy hat pats Hi on the back. Hi takes a swig of beer and observes another child completing the T in FART in crayon on the wall as Glen laughs softly at his errant child, just before the sound of shattering glass is heard. Glen scans the area, then Dot faces Hi and Ed across a picnic table crowded with grilled hamburgers, rolls, a green jello mold, and a cooler, as one younger child occasionally launches jello at Hi, unnoticed by the two women. Hi sits motionless with a stony face as Dot gasps, then he sighs and winces at jello grazing his shoulder while Dot glances offscreen. The scene shifts to tracking on Hi and Glen wandering side by side, with Glen drenched, in a swimming suit and wing-tipped shoes, his body ghostly pale except for a bright angry red V-area and arms below the short sleeve line. Glen bursts out laughing, pats Hi on the back, and giggles as he observes Hi shrewdly. Both halt walking; Hi looks bewildered at Glen, who places a friendly hand on Hi's shoulder and whispers confidentially, nodding enthusiastically through clenched teeth, until THWAK - Hi's fist contacts Glen's jaw, sending him airborne and collapsing in a heap. Glen massages his jaw groggily as Hi advances menacingly, prompting Glen to sprint, with Hi following. Glen, glancing back, yells at Hi but collides with a tree and falls like a sack of cement. Later, Hi drives with his jaw rigidly set and temple throbbing, while Nathan Jr. sits in a safety seat between him and Ed."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "A weaving elbow-level tracking shot follows a twelve-year-old girl in overalls and a clean sweatshirt as she dances around the mailbox, wielding a small shoe, before shifting focus to Lou, who stands up to grab a couple of sandwiches from the freezer, raising his voice to be heard over the hum of radios. As Lou analyzes the circumstance, he looks up, starts sneezing, then composes himself, while the horn-honking twelve-year-old waves a shoe at the laptop and a cat in a pirate hat pats Lou on the elbow. Lou takes a gulp of juice and looks at another kitten finishing off the S in WISE in marker on the window as Sam giggles at his mischievous kitten, just before the sound of ringing bells is heard. Sam glances around, then Pat faces Lou and Fay across a coffee table covered with roasted chicken, buns, a blue pudding mold, and a basket, as one older kitten occasionally tosses pudding at Lou, unnoticed by the two men. Lou sits motionless with a blank expression as Pat squeals, then he sighs and winces at pudding splattering his ankle while Pat looks onscreen. The scene transitions to tracking on Lou and Sam walking side by side, with Sam soaked, in a tuxedo and flip-flops, his body strikingly tan except for a bright angry green Y-area and legs above the long sock line. Sam explodes with laughter, pats Lou on the shoulder, and snickers as he watches Lou slyly. Both halt; Lou looks bewildered at Sam, who places a friendly paw on Lou's knee and speaks quietly, nodding vigorously through clenched lips, until WHAM - Lou's foot connects with Sam's chin, sending him soaring and landing in a bundle. Sam massages his chin groggily as Lou advances threateningly, prompting Sam to dash, with Lou chasing. Sam, glancing forward, calls to Lou but collides with a lamppost and drops like a sack of flour. Later, Lou cycles with his chin firmly set and knee pulsing, while Oliver Sr. relaxes in a booster seat between him and Fay."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "A meandering waist-high tracking shot shadows a three-legged dog in a tutu and a clean sweatshirt as it prances around the cabin, wielding a small umbrella, before diverting focus to Lou, who stretches up to extract a couple of apples from the cupboard, whispering to be heard over the clamor of birds. As Lou imagines the dilemma, he gazes up, starts crying, then checks himself, while the laugh-singing three-legged dog taps an umbrella on the stereo and a cat in a pirate hat pokes Lou on the knee. Lou munches on an apple and observes another creature finishing off the M in STORM in paint on the ceiling as Sam chuckles at his mischievous pet, just before the sound of crashing wood is heard. Sam scans the room, then Pat turns towards Lou and Ann across a dining table filled with fresh pizzas, cookies, a red jelly sculpture, and a pitcher, as one smaller bird periodically tosses jelly at Lou, unseen by the two gentlemen. Lou stands frozen with a calm expression as Pat wails, then he shrugs and winces at jelly hitting his elbow while Pat gazes offscreen. The scene transitions to tracking on Lou and Sam skipping side by side, with Sam soaking wet, in a bathrobe and hiking boots, his form eerily pale except for a bright vibrant purple W-area and arms below the sleeve edge. Sam erupts in giggles, pats Lou on the elbow, and snickers as he examines Lou carefully. Both halt their skipping; Lou appears baffled at Sam, who places a friendly foot on Lou's back and speaks secretly, nodding enthusiastically through gritted teeth, until THWAK - Lou's foot collides with Sam's chest, sending him airborne and landing in a pile. Sam rubs his chest groggily as Lou advances threateningly, prompting Sam to leap, with Lou chasing. Sam, glancing backward, yells at Lou but collides with a mailbox and tumbles like a block of clay. Eventually, Lou cycles with his back tensely arched and forehead pulsating, while Charlie Jr. rests in a basket between him and Ann."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "A weaving knee-level tracking shot follows a six-year-old boy in pajamas and a chaotic sweater as he skips around the sandbox, waving a giant feather, before shifting focus to Hi, who crouches down to grab a couple of sandwiches from the cupboard, lowering his voice to whisper over the chatter of children. As Hi evaluates the situation, he gazes upward, starts humming, then catches himself, while the bam-yelling six-year-old taps a feather on the microwave and a kid in a firefighter's helmet pats Hi on the knee. Hi nibbles on a sandwich and watches another child completing the A in FAST in pastel on the ceiling as Glen snickers at his mischievous child, just before the sound of crumpling paper is heard. Glen glances around, then Dot faces Hi and Ed across a picnic blanket strewn with roasted chicken, bagels, a red jelly sculpture, and a thermos, as one younger child occasionally catapults jelly at Hi, unnoticed by the two women. Hi sits motionless with a blank face as Dot giggles, then he nods and blinks at jelly bouncing off his elbow while Dot looks offscreen. The scene shifts to tracking on Hi and Glen skipping side by side, with Glen dry as a bone, in a raincoat and wooden boots, his skin ghostly pale except for a vivid angry red U-area and legs below the short hemline. Glen breaks into giggles, taps Hi on the knee, and chuckles as he watches Hi keenly. Both halt; Hi looks confused at Glen, who places a friendly hand on Hi's elbow and whispers secretly, shaking energetically through gritted teeth, until BAM - Hi's foot connects with Glen's shin, sending him hopping and tumbling into a bundle. Glen massages his shin groggily as Hi approaches threateningly, prompting Glen to dash, with Hi chasing. Glen, glancing back, yells at Hi but collides with a bush and topples like a sack of feathers. Later, Hi pedals with his jaw loosely set and temple throbbing, while Nathan Jr. perches in a booster seat between him and Ed."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "A drifting knee-level surveillance glide follows a twelve-year-old girl in pants and a muddy sweatshirt as she skips around the cottage, wielding a large umbrella, before diverting attention to Lou, who crouches down to retrieve a pair of sodas from the cabinet, raising her voice to be heard over the cacophony of animals. As Lou ponders the predicament, she glances upward, starts sneezing, then restrains herself, while the noise-making twelve-year-old pounds an umbrella on the radio and a kid in a pirate hat punches Lou on the elbow. Lou takes a gulp of soda and gazes at another pet completing the P in SPOT with paint on the floor as Fran giggles at her naughty pet, just before the sound of roaring thunder is heard. Fran glances around, then Pat stares at Lou and Al across a crafting bench covered with grilled sausages, buns, a red pudding mold, and a flask, as one younger pet sporadically tosses pudding at Lou, unnoticed by the two men. Lou stands motionless with a blank expression as Pat hollers, then he shrugs and winces at pudding splattering his ankle while Pat gazes upward. The scene transitions to tracking on Lou and Fran strolling side by side, with Fran soaking dry, in a tuxedo and flip-flop sandals, his skin eerily green except for a bright calm yellow M-area and legs below the capri line. Fran erupts with giggles, punches Lou on the shin, and guffaws as he scrutinizes Lou slyly. Both halt strolling; Lou looks bewildered at Fran, who lays a supportive foot on Lou's elbow and whispers cryptically, nodding vigorously through chattering lips, until SNAP - Lou's foot collides with Fran's shoulder, sending him skyward and landing in a pile. Fran massages his shoulder drowsily as Lou approaches threateningly, prompting Fran to dash, with Lou tailing. Fran, glancing back, yells at Lou but collides with a wall and collapses like a bale of wool. Later, Lou sails with his chin loosely hanging and forehead throbbing, while Ruthie Jr. rests in a backpack between him and Al."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The camera follows a six-year-old boy with a stick, then shifts to Hi, who grabs beers from the fridge, speaking over the noise. Hi laughs at the chaotic scene with kids causing mayhem, including a child completing \"FART\" on the wall with crayon. Glen laughs at his child’s antics, as Dot and Ed sit at a picnic table while a child throws jello at Hi. Later, Glen, wet and in swimwear, walks with Hi, laughing and placing a hand on Hi's shoulder. Hi suddenly punches Glen, who falls and flees. Hi chases him until Glen crashes into a tree. Hi then drives with Nathan Jr. between him and Ed, his jaw clenched."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Later Hi drives with his jaw rigidly set and temple throbbing while Nathan Jr sits in a safety seat between him and Ed Glen looking back shouts at Hi but crashes into a tree and drops like a sack of cement Glen rubs his jaw groggily as Hi approaches menacingly prompting Glen to run with Hi pursuing Hi's fist connects with Glen's jaw sending him airborne and landing in a heap Hi looks puzzled at Glen who lays a companionable hand on Hi's shoulder and speaks confidentially nodding energetically through clenched teeth until THWAK Both stop walking Glen bursts out laughing slaps Hi on the back and chuckles as he eyes Hi shrewdly The scene shifts to tracking on Hi and Glen walking side by side with Glen sopping wet in a swimming suit and wingtipped shoes his body ghostly pale except for a bright angry red Varea and arms below the short sleeve line then he shrugs and flinches at jello hitting his shoulder while Dot looks offscreen Hi sits stockstill with a stony face as Dot shrieks then Dot faces Hi and Ed across a picnic table covered with grilled hamburgers rolls a green jello mold and a cooler as one younger child occasionally flings jello at Hi unnoticed by the two women Glen looks around as Glen chuckles at his errant child just before the sound of shattering glass is heard Hi takes a sip of beer and looks at another child finishing off the T in FART in crayon on the wall and a kid in a cowboy hat slaps Hi on the ass As Hi considers the situation he looks down starts laughing then catches himself while the bamshouting sixyearold bangs a stick on the TV A weaving kneelevel tracking shot follows a sixyearold boy in shorts and a dirty Tshirt as he tramps around the trailer brandishing a big stick before shifting focus to Hi who bends down to pull a couple of beers from the refrigerator raising his voice to be heard over the din of children"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Hi sits stockstill with a stony face as Dot shrieks Glen bursts out laughing slaps Hi on the back and chuckles as he eyes Hi shrewdly Glen looks around then Dot faces Hi and Ed across a picnic table covered with grilled hamburgers rolls a green jello mold and a cooler as one younger child occasionally flings jello at Hi unnoticed by the two women Glen looking back shouts at Hi but crashes into a tree and drops like a sack of cement Glen rubs his jaw groggily as Hi approaches menacingly prompting Glen to run with Hi pursuing Hi's fist connects with Glen's jaw sending him airborne and landing in a heap The scene shifts to tracking on Hi and Glen walking side by side with Glen sopping wet in a swimming suit and wingtipped shoes his body ghostly pale except for a bright angry red Varea and arms below the short sleeve line then he shrugs and flinches at jello hitting his shoulder while Dot looks offscreen As Hi considers the situation he looks down starts laughing then catches himself while the bamshouting sixyearold bangs a stick on the TV and a kid in a cowboy hat slaps Hi on the ass Hi looks puzzled at Glen who lays a companionable hand on Hi's shoulder and speaks confidentially nodding energetically through clenched teeth until THWAK Later Hi drives with his jaw rigidly set and temple throbbing while Nathan Jr sits in a safety seat between him and Ed as Glen chuckles at his errant child just before the sound of shattering glass is heard Both stop walking A weaving kneelevel tracking shot follows a sixyearold boy in shorts and a dirty Tshirt as he tramps around the trailer brandishing a big stick before shifting focus to Hi who bends down to pull a couple of beers from the refrigerator raising his voice to be heard over the din of children Hi takes a sip of beer and looks at another child finishing off the T in FART in crayon on the wall"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The scene shifts to tracking on Hi and Glen walking side by side with Glen sopping wet in a swimming suit and wingtipped shoes his body ghostly pale except for a bright angry red Varea and arms below the short sleeve line Glen bursts out laughing slaps Hi on the back and chuckles as he eyes Hi shrewdly Both stop walking Hi looks puzzled at Glen who lays a companionable hand on Hi's shoulder and speaks confidentially nodding energetically through clenched teeth until THWAK Hi's fist connects with Glen's jaw sending him airborne and landing in a heap Glen rubs his jaw groggily as Hi approaches menacingly prompting Glen to run with Hi pursuing Glen looking back shouts at Hi but crashes into a tree and drops like a sack of cement Later Hi drives with his jaw rigidly set and temple throbbing while Nathan Jr sits in a safety seat between him and Ed A weaving kneelevel tracking shot follows a sixyearold boy in shorts and a dirty Tshirt as he tramps around the trailer brandishing a big stick before shifting focus to Hi who bends down to pull a couple of beers from the refrigerator raising his voice to be heard over the din of children As Hi considers the situation he looks down starts laughing then catches himself while the bamshouting sixyearold bangs a stick on the TV and a kid in a cowboy hat slaps Hi on the ass Hi takes a sip of beer and looks at another child finishing off the T in FART in crayon on the wall as Glen chuckles at his errant child just before the sound of shattering glass is heard Glen looks around then Dot faces Hi and Ed across a picnic table covered with grilled hamburgers rolls a green jello mold and a cooler as one younger child occasionally flings jello at Hi unnoticed by the two women Hi sits stockstill with a stony face as Dot shrieks then he shrugs and flinches at jello hitting his shoulder while Dot looks offscreen"
        }
      ]
    }
  ]
}