{
  "ground_truth": "He is pulling into a convenience store parking lot and puts the car in park but leaves it running. As he gets out of the car, a hand enters to take a package of panty hose from the standing rack, and another hand takes a big carton of disposable diapers from the shelf. A pimply-faced lad with a paper 7-Eleven cap on his head is looking up from a dirty magazine, reacting in horror to something approaching. Hi is approaching the check-out island with a gun in one hand and the carton of Huggies tucked under the other. The L'Eggs stocking is pulled over his head to distort his features as he presses a silent alarm under the lip of the counter. Ed is reading to Nathan Jr. from a large picture book but pauses for a moment, listening, as they can barely hear a distant siren. She resumes absently, but her voice trails off as the WHOO-WHOO of the siren is definitely approaching. Ed hooks an arm around the seat and looks behind the car, then looks forward. Indistinctly visible through the semi-reflective glass are two figures at the check-out island, one pointing something at the other as the siren grows louder. Under her breath, she unstraps herself and gets out of the car. In a two-shot of Hi and the Cashier, the cashier is stuffing bills into a grocery bag, and beyond them Ed can be seen outside, circling the front of the car. Her shout is muffled through the glass, and with this Hi notices her. He turns to the Cashier, but Ed is already getting into the driver's seat of the car. As she slams the car door shut, the siren is quite loud now, and the car squeals out of the lot. The squad car tops a rise to bounce into view, its siren wailing. Hi bursts out the door, still wearing the stocking, and the carton of Huggies is still tucked under one arm as he bellows hopefully after his departing car. Hi looks around the parking lot, bewildered, as the wailing siren becomes painfully loud. Hi looks behind him at the plate-glass front of the store, where a bullet pock mars the glass. Through the glass, the pimply young Cashier with the paper 7-Eleven cap pops up from behind the counter to sight down his huge .44 Magnum for another shot, the gun so big he uses both hands to heft it. SMACK-CRACK - the bullet kisses another hole in the glass. Hi is off and running as the squad car is screeching into the lot. An officer tumbles out of the passenger side before the car is fully stopped, rolls on the pavement, then hurriedly rights himself and takes up a half-kneeling shooting stance.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He is pulling into a convenience store parking lot and puts the automobile in park but leaves it operating. As he gets out of the automobile, a hand enters to take a parcel of panty hose from the standing rack, and another hand takes a large carton of disposable diapers from the shelf. A pimply-faced youth with a paper 7-Eleven cap on his head is looking up from a filthy publication, reacting in horror to something approaching. Hi is approaching the check-out island with a firearm in one hand and the carton of Huggies tucked under the other. The L'Eggs stocking is pulled over his head to distort his features as he presses a silent alarm under the lip of the counter. Ed is reading to Nathan Jr. from a large picture book but pauses for a moment, listening, as they can barely hear a distant siren. She resumes absently, but her voice trails off as the WHOO-WHOO of the siren is definitely approaching. Ed hooks an arm around the seat and looks behind the automobile, then looks forward. Indistinctly visible through the semi-reflective glass are two figures at the check-out island, one pointing something at the other as the siren grows louder. Under her breath, she unstraps herself and gets out of the automobile. In a two-shot of Hi and the Cashier, the cashier is stuffing bills into a grocery sack, and beyond them Ed can be seen outside, circling the front of the automobile. Her shout is muffled through the glass, and with this Hi notices her. He turns to the Cashier, but Ed is already getting into the driver's seat of the automobile. As she slams the automobile door shut, the siren is quite loud now, and the automobile squeals out of the lot. The squad automobile tops a rise to bounce into view, its siren wailing. Hi bursts out the door, still wearing the stocking, and the carton of Huggies is still tucked under one arm as he bellows hopefully after his departing automobile. Hi looks around the parking lot, bewildered, as the wailing siren becomes painfully loud. Hi looks behind him at the plate-glass front of the store, where a bullet pock mars the glass. Through the glass, the pimply young Cashier with the paper 7-Eleven cap pops up from behind the counter to sight down his huge .44 Magnum for another shot, the firearm so big he uses both hands to heft it. SMACK-CRACK - the bullet kisses another hole in the glass. Hi is off and sprinting as the squad automobile is screeching into the lot. An officer tumbles out of the passenger side before the automobile is fully stopped, rolls on the pavement, then hurriedly rights himself and takes up a half-kneeling shooting stance."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He is pulling into a convenience store parking lot, and the car is put in park, but it is left running by him. As he gets out of the car, a package of panty hose is taken from the standing rack by a hand, and a big carton of disposable diapers is taken from the shelf by another hand. A pimply-faced lad with a paper 7-Eleven cap on his head looks up from a dirty magazine and reacts in horror to something approaching. The check-out island is being approached by Hi with a gun in one hand and the carton of Huggies tucked under the other. He pulls the L'Eggs stocking over his head to distort his features as a silent alarm is pressed under the lip of the counter by him. Nathan Jr. is being read to by Ed from a large picture book, but she pauses for a moment, listening, as a distant siren can barely be heard by them. She resumes absently, but the WHOO-WHOO of the siren trails off her voice as it is definitely approaching. An arm is hooked around the seat by Ed, and she looks behind the car, then looks forward. Through the semi-reflective glass, two figures are indistinctly visible at the check-out island, one pointing something at the other as the siren grows louder. Under her breath, she unstraps herself and gets out of the car. In a two-shot of Hi and the Cashier, bills are stuffed into a grocery bag by the cashier, and beyond them, Ed can be seen outside, circling the front of the car. Her shout is muffled through the glass, and with this, she is noticed by Hi. The Cashier is turned to by him, but Ed is already getting into the driver's seat of the car. As the car door is slammed shut by her, the siren is quite loud now, and the lot is squealed out of by the car. The squad car tops a rise to bounce into view, its siren wailing. Hi bursts out the door, still wearing the stocking, and the carton of Huggies is still tucked under one arm as he hopefully bellows after his departing car. Hi looks around the parking lot, bewildered, as the wailing siren becomes painfully loud. Hi looks behind him at the plate-glass front of the store, where the glass is marred by a bullet pock. Through the glass, the pimply young Cashier with the paper 7-Eleven cap pops up from behind the counter to sight down his huge .44 Magnum for another shot, the gun so big it is hefted by him using both hands. SMACK-CRACK - another hole is kissed in the glass by the bullet. Hi is off and running as the squad car screeches into the lot. The passenger side is tumbled out of by an officer before the car is fully stopped, and the officer rolls on the pavement, then hurriedly rights himself and takes up a half-kneeling shooting stance."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He pulls into a convenience store parking lot, leaves the car running, and exits. A hand grabs pantyhose from a rack, and another takes a carton of diapers. A pimply-faced lad in a 7-Eleven cap looks up from a magazine, horrified. Hi approaches the checkout with a gun and the diapers, wearing a stocking over his head. Ed reads to Nathan Jr. but pauses, hearing a distant siren. She resumes, but the siren grows louder. Ed looks around, unstraps herself, and exits the car. At the checkout, the cashier stuffs bills into a bag as Ed circles the car. Her muffled shout catches Hi's attention. Ed gets into the driver's seat, slams the door, and the car squeals away as the siren blares. A squad car appears, siren wailing. Hi bursts out, still wearing the stocking and holding the diapers, shouting after the car. Bewildered, he sees a bullet hole in the store's glass. The young cashier, with a .44 Magnum, fires again, creating another hole. Hi runs as the squad car screeches into the lot. An officer tumbles out, rolls, and takes a shooting stance."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He pulls into a convenience store parking lot, parks, but leaves the car running. Exiting, a hand grabs pantyhose from a rack, another takes a carton of diapers. A pimply cashier in a 7-Eleven cap looks up from a magazine, horrified. Hi approaches the checkout with a gun and the diapers, wearing a stocking over his head. Ed reads to Nathan Jr., pauses at a distant siren, then resumes. The siren grows louder; Ed looks around, unstraps, and exits the car. At the checkout, the cashier stuffs bills into a bag as Ed circles the car. Her muffled shout alerts Hi, who turns to see her in the driver's seat. She slams the door, and the car squeals away as a squad car appears, siren wailing. Hi exits, still wearing the stocking, diapers under his arm, shouting after the car. Bewildered, he sees a bullet hole in the store's glass. The cashier, with a .44 Magnum, fires again, creating another hole. Hi runs as the squad car screeches in, an officer tumbles out, rolls, and takes a shooting stance."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He is maneuvering his vehicle into the parking lot of a convenience store, carefully pulling into a spot. He shifts the car into park but leaves the engine running, humming softly. As he exits the vehicle, a hand reaches in to grab a package of panty hose from the standing rack, while another hand swiftly snatches a large carton of disposable diapers from the shelf. A young lad, whose face is dotted with pimples, is wearing a paper 7-Eleven cap perched on his head. He is glancing up from a dirty magazine, his expression shifting to one of horror as he reacts to something approaching. Hi is making his way toward the check-out island, a gun gripped firmly in one hand and the carton of Huggies securely tucked under his other arm. The L'Eggs stocking is stretched over his head, distorting his features as he discreetly presses a silent alarm located under the lip of the counter. Meanwhile, Ed is engrossed in reading to Nathan Jr. from a large picture book but pauses momentarily, listening intently as they faintly hear the distant wail of a siren. She resumes reading absentmindedly, but her voice trails off as the WHOO-WHOO of the siren becomes unmistakably closer. Ed hooks an arm around the seat, glancing behind the car, then shifts her gaze forward. Through the semi-reflective glass, two figures are indistinctly visible at the check-out island, one pointing something at the other as the siren's sound grows increasingly louder. Muttering under her breath, she unstraps herself and exits the car. In a two-shot of Hi and the Cashier, the cashier is hurriedly stuffing bills into a grocery bag, and beyond them, Ed can be seen outside, circling the front of the car. Her shout is muffled through the glass, and with this, Hi notices her presence. He turns to the Cashier, but Ed is already sliding into the driver's seat of the car. As she slams the car door shut, the siren is now quite loud, and the car screeches out of the lot. The squad car tops a rise, bouncing into view with its siren wailing. Hi bursts out the door, still wearing the stocking over his head, and the carton of Huggies remains tucked under one arm as he bellows hopefully after his departing car. Hi looks around the parking lot, bewildered, as the wailing siren becomes painfully loud. He glances behind him at the plate-glass front of the store, where a bullet pock mars the glass. Through the glass, the pimply young Cashier with the paper 7-Eleven cap pops up from behind the counter, aiming down his massive .44 Magnum for another shot, the gun so large he uses both hands to heft it. SMACK-CRACK - the bullet kisses another hole in the glass. Hi is off and running as the squad car screeches into the lot. An officer tumbles out of the passenger side before the car is fully stopped, rolling on the pavement, then hurriedly rights himself and takes up a half-kneeling shooting stance."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He is skillfully maneuvering his vehicle into the parking lot of a bustling convenience store, taking great care as he pulls the car into a designated parking spot. Once there, he shifts the vehicle into park but inexplicably leaves the engine running, humming softly all the while. As he makes his way out of the vehicle, a hand reaches inside to grab a package of panty hose from a standing rack, while another hand swiftly and efficiently snatches a large carton of disposable diapers from a nearby shelf. A young lad, whose face is dotted with pimples, stands present beneath a paper 7-Eleven cap perched jauntily on his head. He glances up from the dirty magazine he’s engrossed in, his expression rapidly transitioning to one of sheer horror as he reacts to something approaching.\n\nMeanwhile, Hi is making his determined way toward the check-out island, gripping a gun firmly in one hand while keeping the carton of Huggies diapers securely tucked under his other arm. The L'Eggs stocking is stretched tightly over his head, grotesquely distorting his facial features as he discreetly presses the silent alarm located just beneath the lip of the counter. At this same moment, Ed is engrossed in reading aloud to Nathan Jr. from a large picture book but pauses for just a moment, listening intently as they faintly catch the distant wail of a siren echoing in the background. She attempts to resume her reading, albeit absentmindedly, but her voice trails off as the unmistakable WHOO-WHOO of the siren grows ever closer. \n\nEd carefully hooks an arm around the car seat, glancing keenly behind the vehicle before shifting her gaze forward. Through the semi-reflective glass, two indistinct figures are visible at the check-out island, one appearing to point an object at the other while the wailing of the siren becomes increasingly loud. Muttering words under her breath, she quickly unstraps herself and exits the car with determination. In a two-shot of Hi and the Cashier, the young cashier is hurriedly stuffing bills into a grocery bag, and beyond them, Ed can be seen outside the store, circling the front of the car. Her shout, though muffled through the glass, catches Hi's attention as he notices her presence. He turns back to the Cashier, but Ed is already sliding into the driver's seat of the vehicle. As she slams the car door shut, the siren is now quite loud, and abruptly, the car screeches out of the lot. The squad car quickly tops a nearby rise, bouncing into view with its siren continuing to wail. \n\nHi bursts out of the store's door, still wearing the stocking over his head, and the carton of Huggies remains tucked under one arm as he bellows hopefully after his departing car. Bewildered, Hi takes a moment to survey the parking lot as the wailing of the siren becomes almost painfully loud. He glances back at the plate-glass front of the store, where a bullet pock marks the glass. Through the shattered glass, the pimply young Cashier, still wearing his paper 7-Eleven cap, pops up from behind the counter, aiming down his massive .44 Magnum for yet another shot, the gun so large that he uses both hands to heft it. SMACK-CRACK - the bullet kisses another hole in the glass. Hi takes off running as the squad car screeches dramatically into the lot. An officer tumbles out from the passenger side of the car before it comes to a complete stop, rolling on the pavement and then hurriedly righting himself to take up a half-kneeling shooting stance."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He carefully maneuvers his car into the convenience store parking lot, ensuring it is properly aligned within the space before shifting the gear into park, though he leaves the engine idling. As he opens the car door and steps out, a hand reaches into the store to deftly grab a package of panty hose from a standing rack, while another hand swiftly snatches a large carton of disposable diapers from a nearby shelf. Inside the store, a young man with a face marked by acne and a paper 7-Eleven cap perched on his head glances up from the dirty magazine he was engrossed in, his expression shifting to one of horror as he reacts to an alarming sight approaching him. Hi strides purposefully toward the check-out island, brandishing a gun in one hand while securely tucking the carton of Huggies under his other arm. He has pulled a L'Eggs stocking over his head, distorting his features as he reaches under the counter to press a silent alarm. Meanwhile, Ed is seated in the car, reading aloud to Nathan Jr. from a large picture book. She pauses momentarily, her attention caught by the faint sound of a distant siren, but resumes reading, though her voice trails off as the siren's WHOO-WHOO grows unmistakably closer. Ed instinctively hooks an arm around the seat, glancing behind the car before turning her gaze forward. Through the semi-reflective glass, she can indistinctly make out two figures at the check-out island, one of whom is pointing something at the other, as the siren's wail intensifies. Muttering under her breath, she unbuckles her seatbelt and exits the car. In a two-shot of Hi and the Cashier, the latter is seen hurriedly stuffing bills into a grocery bag, while beyond them, Ed is visible outside, making her way around the front of the car. Her shout is muffled by the glass, but it catches Hi's attention. He turns toward the Cashier, but Ed has already slipped into the driver's seat. As she slams the car door shut, the siren's blare is now deafening, and the car screeches out of the lot. A squad car crests a rise, bouncing into view with its siren wailing. Hi bursts through the store door, still wearing the stocking over his head, the carton of Huggies clutched under one arm, as he desperately calls after his departing car. He stands in the parking lot, bewildered, as the siren's wail becomes almost unbearably loud. Hi glances back at the store's plate-glass front, where a bullet hole mars the surface. Through the glass, the pimply young Cashier with the paper 7-Eleven cap reappears from behind the counter, aiming his massive .44 Magnum with both hands for another shot. SMACK-CRACK - the bullet creates another hole in the glass. Hi takes off running just as the squad car screeches into the lot. An officer tumbles out of the passenger side before the car has fully stopped, rolling on the pavement before quickly righting himself and assuming a half-kneeling shooting stance."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He pulls into a convenience store parking lot, leaves the car running, and exits. Inside, he grabs a carton of disposable diapers while wearing a L'Eggs stocking over his head, distorting his features. A pimply-faced cashier, distracted by a magazine, reacts in horror as Hi approaches the check-out island with a gun and the carton of Huggies. Meanwhile, Ed, reading to Nathan Jr. in the car, pauses as a distant siren grows louder. She unstraps herself, exits the car, and circles to the driver's seat, unnoticed by Hi, who is focused on the cashier stuffing bills into a bag. As Ed drives away, the siren becomes deafening, and Hi bursts out of the store, still wearing the stocking and holding the diapers, shouting after the departing car. Bewildered, he notices a bullet hole in the store's glass and turns to see the cashier aiming a .44 Magnum. As another bullet shatters the glass, Hi runs as a squad car screeches into the lot, and an officer tumbles out, taking a shooting stance."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He is pulling into a convenience store parking lot and puts the car in park but leaves it running, a classic move in haste or when planning a quick getaway. As he gets out of the car, a hand enters to take a package of panty hose from the standing rack, and another hand takes a big carton of disposable diapers, specifically Huggies, a popular brand known for its reliability and comfort, from the shelf. A pimply-faced lad with a paper 7-Eleven cap on his head, indicating he works at this globally recognized chain famous for its 24/7 service, is looking up from a dirty magazine, reacting in horror to something approaching. Hi is approaching the check-out island with a gun in one hand and the carton of Huggies tucked under the other, the L'Eggs stocking pulled over his head to distort his features, an allusion to the common trope of using such hosiery in robberies to obscure one’s identity, as he presses a silent alarm under the lip of the counter. Ed is reading to Nathan Jr. from a large picture book, but pauses for a moment, listening, as they can barely hear a distant siren, indicating an approaching police vehicle. She resumes absently, but her voice trails off as the WHOO-WHOO of the siren, characteristic of American police cars, is definitely approaching. Ed hooks an arm around the seat and looks behind the car, then looks forward. Indistinctly visible through the semi-reflective glass, which often makes it hard to discern details from outside, are two figures at the check-out island, one pointing something at the other as the siren grows louder. Under her breath, she unstraps herself and gets out of the car. In a two-shot of Hi and the Cashier, the cashier is stuffing bills into a grocery bag, and beyond them Ed can be seen outside, circling the front of the car. Her shout is muffled through the glass, and with this Hi notices her. He turns to the Cashier, but Ed is already getting into the driver's seat of the car. As she slams the car door shut, the siren is quite loud now, and the car squeals out of the lot, the tires screeching in friction with the asphalt. The squad car tops a rise to bounce into view, its siren wailing. Hi bursts out the door, still wearing the stocking, and the carton of Huggies is still tucked under one arm as he bellows hopefully after his departing car. Hi looks around the parking lot, bewildered, as the wailing siren becomes painfully loud. Hi looks behind him at the plate-glass front of the store, where a bullet pock mars the glass. Through the glass, the pimply young Cashier with the paper 7-Eleven cap pops up from behind the counter to sight down his huge .44 Magnum, a powerful and iconic handgun often associated with law enforcement or crime dramas, for another shot, the gun so big he uses both hands to heft it. SMACK-CRACK - the bullet kisses another hole in the glass. Hi is off and running as the squad car is screeching into the lot. An officer tumbles out of the passenger side before the car is fully stopped, rolls on the pavement, a technique sometimes taught in police training for quick exits, then hurriedly rights himself and takes up a half-kneeling shooting stance."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He is pulling into a convenience store parking lot and puts the car in park but leaves it running. As he gets out of the car a hand enters to take a package of panty hose from the standing rack and another hand takes a big carton of disposable diapers from the shelf. A pimplyfaced lad with a paper 7Eleven cap on his head is looking up from a dirty magazine reacting in horror to something approaching. Hi is approaching the checkout island with a gun in one hand and the carton of Huggies tucked under the other. The L'Eggs stocking is pulled over his head to distort his features as he presses a silent alarm under the lip of the counter. Ed is reading to Nathan Jr from a large picture book but pauses for a moment listening as they can barely hear a distant siren. She resumes absently but her voice trails off as the WHOOWHOO of the siren is definitely approaching. Ed hooks an arm around the seat and looks behind the car then looks forward. Indistinctly visible through the semireflective glass are two figures at the checkout island one pointing something at the other as the siren grows louder. Under her breath she unstraps herself and gets out of the car. In a twoshot of Hi and the Cashier. the cashier is stuffing bills into a grocery bag and beyond them. Ed can be seen outside circling the front of the car. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Her shout is muffled through the glass and with this Hi notices her. He turns to the Cashier but Ed is already getting into the driver's seat of the car. As she slams the car door shut the siren is quite loud now and the car squeals out of the lot. The squad car tops a rise to bounce into view its siren wailing. Hi bursts out the door still wearing the stocking and the carton of Huggies is still tucked under one arm as he bellows hopefully after his departing car. Hi looks around the parking lot bewildered as the wailing siren becomes painfully loud. Hi looks behind him at the plateglass front of the store where a bullet pock mars the glass. Through the glass the pimply young Cashier with the paper 7Eleven cap pops up from behind the counter to sight down his huge 44 Magnum for another shot. the gun so big he uses both hands to heft it. SMACKCRACK. the bullet kisses another hole in the glass. Hi is off and running as the squad car is screeching into the lot. An officer tumbles out of the passenger side before the car is fully stopped rolls on the pavement then hurriedly rights himself and takes up a halfkneeling shooting stance."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He is pulling into a convenience store parking lot and puts the car in park but leaves it running. As he gets out of the car a hand enters to take a package of panty hose from the standing rack and another hand takes a big carton of disposable diapers from the shelf. A pimplyfaced lad with a paper 7Eleven cap on his head is looking up from a dirty magazine reacting in horror to something approaching. Hi is approaching the checkout island with a gun in one hand and the carton of Huggies tucked under the other. The L'Eggs stocking is pulled over his head to distort his features as he presses a silent alarm under the lip of the counter. Ed is reading to Nathan Jr from a large picture book but pauses for a moment listening as they can barely hear a distant siren. She resumes absently but her voice trails off as the WHOOWHOO of the siren is definitely approaching. Ed hooks an arm around the seat and looks behind the car then looks forward. Indistinctly visible through the semireflective glass are two figures at the checkout island one pointing something at the other as the siren grows louder. Under her breath she unstraps herself and gets out of the car. In a twoshot of Hi and the Cashier. the cashier is stuffing bills into a grocery bag and beyond them. Ed can be seen outside circling the front of the car. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Her shout is muffled through the glass and with this Hi notices her. He turns to the Cashier but Ed is already getting into the driver's seat of the car. As she slams the car door shut the siren is quite loud now and the car squeals out of the lot. The squad car tops a rise to bounce into view its siren wailing. Hi bursts out the door still wearing the stocking and the carton of Huggies is still tucked under one arm as he bellows hopefully after his departing car. Hi looks around the parking lot bewildered as the wailing siren becomes painfully loud. Hi looks behind him at the plateglass front of the store where a bullet pock mars the glass. Through the glass the pimply young Cashier with the paper 7Eleven cap pops up from behind the counter to sight down his huge 44 Magnum for another shot. the gun so big he uses both hands to heft it. SMACKCRACK. the bullet kisses another hole in the glass. Hi is off and running as the squad car is screeching into the lot. An officer tumbles out of the passenger side before the car is fully stopped rolls on the pavement then hurriedly rights himself and takes up a halfkneeling shooting stance."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He is pulling into a convenience store parking lot and puts the car in park but leaves it running. As he gets out of the car a hand enters to take a package of panty hose from the standing rack and another hand takes a big carton of disposable diapers from the shelf. A pimplyfaced lad with a paper 7Eleven cap on his head is looking up from a dirty magazine reacting in horror to something approaching. Hi is approaching the checkout island with a gun in one hand and the carton of Huggies tucked under the other. The L'Eggs stocking is pulled over his head to distort his features as he presses a silent alarm under the lip of the counter. Ed is reading to Nathan Jr from a large picture book but pauses for a moment listening as they can barely hear a distant siren. She resumes absently but her voice trails off as the WHOOWHOO of the siren is definitely approaching. Through the glass the pimply young Cashier with the paper 7Eleven cap pops up from behind the counter to sight down his huge 44 Magnum for another shot. the gun so big he uses both hands to heft it. SMACKCRACK. the bullet kisses another hole in the glass. Hi is off and running as the squad car is screeching into the lot. An officer tumbles out of the passenger side before the car is fully stopped rolls on the pavement then hurriedly rights himself and takes up a halfkneeling shooting stance."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He is pulling into a convenience store parking lot and puts the car in park but leaves it running. As he gets out of the car a hand enters to take a package of panty hose from the standing rack and another hand takes a big carton of disposable diapers from the shelf. A pimplyfaced lad with a paper 7Eleven cap on his head is looking up from a dirty magazine reacting in horror to something approaching. the bullet kisses another hole in the glass. Hi is off and running as the squad car is screeching into the lot. An officer tumbles out of the passenger side before the car is fully stopped rolls on the pavement then hurriedly rights himself and takes up a halfkneeling shooting stance."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "She is drifting into a candy shop driveway and slides the bicycle into halt but keeps it humming. As she jumps off the bicycle, a foot stretches to grab a tub of yogurt from the twisting display, and another foot snags a massive crate of oranges from the table. A grumpy-faced dog with a plastic chef's hat on its tail is gazing down from a dusty novel, responding with delight to something retreating. You are retreating from the viewing balcony with a broom in one foot and the crate of oranges balanced on the other. The sock puppet is draped over her face to enhance her persona as she taps a loud siren above the edge of the ceiling. Ron is humming to Marcy from a tiny crossword puzzle but halts for a second, humming, as they can barely feel a nearby bell. He resumes cheerily, but her whisper fades away as the DING-DONG of the bell is certainly retreating. Ron grabs a leg around the seat and peers ahead of the bicycle, then peers backward. Faintly visible through the partially-translucent curtain are two shadows at the viewing balcony, one tossing something at the other as the bell grows softer. Over her head, she buckles herself and hops from the bicycle. In a close-up of You and the Waiter, the waiter is slipping keys into a lunchbox, and beyond them Ron can be observed inside, skipping the rear of the bicycle. His laugh is muted through the curtain, and with that You notices him. She turns from the Waiter, but Ron is already hopping into the conductor's seat of the bicycle. As she shuts the bicycle gate tightly, the bell is faint now, and the bicycle zooms silently down the driveway. The ice cream truck reaches a valley to float into vision, its bell tolling. You bursts into the hall, still wearing the sock puppet, and the crate of oranges is still balanced on one foot as she whispers calmly after her returning bicycle. You scans the driveway, puzzled, as the tolling bell becomes soothingly faint. You glances ahead of her at the plastic front of the shop, where a bubble smudge tarnishes the curtain. Beyond the curtain, the grumpy young Waiter with the plastic chef's hat bounces up from above the ceiling to peer down his light .22 Water Pistol for another splash, the broom so tiny he uses one foot to wave it. DRIP-DROP - the bubble traces another streak in the curtain. You is off and hopping as the ice cream truck is sneaking into the driveway. A clown stumbles out of the driver side before the truck is gently rolling, skips on the grass, then nimbly sets herself and takes up a one-knee throwing pose."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Hi arrives at a convenience store and exits his car, which is left running. He grabs a carton of diapers and dons a stocking over his head, approaching the cashier with a gun. The cashier reacts in horror, triggering a silent alarm. Meanwhile, Ed reads to Nathan Jr. but stops when she hears a distant siren that grows louder. She sees Hi inside the store and gets into the driver's seat. The siren blares as Ed drives off, leaving Hi, who notices too late. As the squad car arrives, the cashier fires a shot, shattering the store's glass. Hi bolts as a police officer emerges from the squad car, taking aim at him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "An officer tumbles out of the passenger side before the car is fully stopped rolls on the pavement then hurriedly rights himself and takes up a halfkneeling shooting stance Hi is off and running as the squad car is screeching into the lot  the bullet kisses another hole in the glass  SMACKCRACK   the gun so big he uses both hands to heft it  Through the glass the pimply young Cashier with the paper 7Eleven cap pops up from behind the counter to sight down his huge 44 Magnum for another shot  Hi looks behind him at the plateglass front of the store where a bullet pock mars the glass  Hi looks around the parking lot bewildered as the wailing siren becomes painfully loud  Hi bursts out the door still wearing the stocking and the carton of Huggies is still tucked under one arm as he bellows hopefully after his departing car  The squad car tops a rise to bounce into view its siren wailing  As she slams the car door shut the siren is quite loud now and the car squeals out of the lot  He turns to the Cashier but Ed is already getting into the driver's seat of the car  Her shout is muffled through the glass and with this Hi notices her  Ed can be seen outside circling the front of the car  the cashier is stuffing bills into a grocery bag and beyond them  In a twoshot of Hi and the Cashier  Under her breath she unstraps herself and gets out of the car  Indistinctly visible through the semireflective glass are two figures at the checkout island one pointing something at the other as the siren grows louder  Ed hooks an arm around the seat and looks behind the car then looks forward  She resumes absently but her voice trails off as the WHOOWHOO of the siren is definitely approaching  Ed is reading to Nathan Jr from a large picture book but pauses for a moment listening as they can barely hear a distant siren  The L'Eggs stocking is pulled over his head to distort his features as he presses a silent alarm under the lip of the counter  Hi is approaching the checkout island with a gun in one hand and the carton of Huggies tucked under the other  A pimplyfaced lad with a paper 7Eleven cap on his head is looking up from a dirty magazine reacting in horror to something approaching  As he gets out of the car a hand enters to take a package of panty hose from the standing rack and another hand takes a big carton of disposable diapers from the shelf  He is pulling into a convenience store parking lot and puts the car in park but leaves it running "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "As he gets out of the car a hand enters to take a package of panty hose from the standing rack and another hand takes a big carton of disposable diapers from the shelf He is pulling into a convenience store parking lot and puts the car in park but leaves it running Hi is approaching the checkout island with a gun in one hand and the carton of Huggies tucked under the other A pimplyfaced lad with a paper 7Eleven cap on his head is looking up from a dirty magazine reacting in horror to something approaching Ed is reading to Nathan Jr from a large picture book but pauses for a moment listening as they can barely hear a distant siren The L'Eggs stocking is pulled over his head to distort his features as he presses a silent alarm under the lip of the counter Ed hooks an arm around the seat and looks behind the car then looks forward She resumes absently but her voice trails off as the WHOOWHOO of the siren is definitely approaching Under her breath she unstraps herself and gets out of the car Indistinctly visible through the semireflective glass are two figures at the checkout island one pointing something at the other as the siren grows louder the cashier is stuffing bills into a grocery bag and beyond them In a twoshot of Hi and the Cashier Her shout is muffled through the glass and with this Hi notices her Ed can be seen outside circling the front of the car As she slams the car door shut the siren is quite loud now and the car squeals out of the lot He turns to the Cashier but Ed is already getting into the driver's seat of the car Hi bursts out the door still wearing the stocking and the carton of Huggies is still tucked under one arm as he bellows hopefully after his departing car The squad car tops a rise to bounce into view its siren wailing Hi looks behind him at the plateglass front of the store where a bullet pock mars the glass Hi looks around the parking lot bewildered as the wailing siren becomes painfully loud the gun so big he uses both hands to heft it Through the glass the pimply young Cashier with the paper 7Eleven cap pops up from behind the counter to sight down his huge 44 Magnum for another shot the bullet kisses another hole in the glass SMACKCRACK An officer tumbles out of the passenger side before the car is fully stopped rolls on the pavement then hurriedly rights himself and takes up a halfkneeling shooting stance Hi is off and running as the squad car is screeching into the lot"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Her shout is muffled through the glass and with this Hi notices her  He turns to the Cashier but Ed is already getting into the driver's seat of the car  As she slams the car door shut the siren is quite loud now and the car squeals out of the lot  The squad car tops a rise to bounce into view its siren wailing  Hi bursts out the door still wearing the stocking and the carton of Huggies is still tucked under one arm as he bellows hopefully after his departing car  Hi looks around the parking lot bewildered as the wailing siren becomes painfully loud  Hi looks behind him at the plateglass front of the store where a bullet pock mars the glass  Through the glass the pimply young Cashier with the paper 7Eleven cap pops up from behind the counter to sight down his huge 44 Magnum for another shot  the gun so big he uses both hands to heft it  SMACKCRACK   the bullet kisses another hole in the glass  Hi is off and running as the squad car is screeching into the lot  An officer tumbles out of the passenger side before the car is fully stopped rolls on the pavement then hurriedly rights himself and takes up a halfkneeling shooting stance He is pulling into a convenience store parking lot and puts the car in park but leaves it running  As he gets out of the car a hand enters to take a package of panty hose from the standing rack and another hand takes a big carton of disposable diapers from the shelf  A pimplyfaced lad with a paper 7Eleven cap on his head is looking up from a dirty magazine reacting in horror to something approaching  Hi is approaching the checkout island with a gun in one hand and the carton of Huggies tucked under the other  The L'Eggs stocking is pulled over his head to distort his features as he presses a silent alarm under the lip of the counter  Ed is reading to Nathan Jr from a large picture book but pauses for a moment listening as they can barely hear a distant siren  She resumes absently but her voice trails off as the WHOOWHOO of the siren is definitely approaching  Ed hooks an arm around the seat and looks behind the car then looks forward  Indistinctly visible through the semireflective glass are two figures at the checkout island one pointing something at the other as the siren grows louder  Under her breath she unstraps herself and gets out of the car  In a twoshot of Hi and the Cashier  the cashier is stuffing bills into a grocery bag and beyond them  Ed can be seen outside circling the front of the car "
        }
      ]
    }
  ]
}