{
  "ground_truth": "Similarly producing a long wooden match, biting down on the cigar, and dragging the kitchen match along the unfinished wood surface of an expensive bureau, leaving an ugly black scar, the match erupts into roaring flame, crackling as it is lit, from the inside of the office. The name on the pebbled glass is a backwards Nathan Arizona. There is the shadow of a man approaching the door, and muffled voices. The door swings open and Nathan stands looking in, his middle-aged secretary hanging at his elbow. Nathan is staring toward his desk where the Biker sits with his back to us, jackboots propped lazily on the desk. His head bobs and ducks, as if he is following some movement in the air in front of him. Eyes on the Biker, Nathan slams the door shut behind him, looking for some reaction, but the Biker still does not react to Nathan, not even bothering to give him a glance. His eyes continue to follow some phantom movement, and when the Biker speaks, it is still without looking at Nathan, and in a surprisingly soft voice and mild, unhurried manner. He takes a drag on his cigar. SMALLS is pleasantly shaking his head, while Nathan is looking at him stonily. Quick as a flash, the heretofore languid Smalls bolts forward, his fist stopped an inch short of Nathan's nose, his index finger and thumb pinched together, holding the leg of a struggling fly that he has just plucked from the air. He flicks the fly away, and Nathan stares grimly at Smalls then swivels to punch numbers on a telephone. Nathan swivels back, looking up, and his speech stops short. The office is empty. A whipcrack effect builds to the cut, and he has been slumped over the kitchen table, asleep. Hi looks up as Gale and Evelle are smiling down at him. Hi takes the envelope that he was slumped over, with \"to Ed\" written on its face. There is a harsh knock at the door and all three tense. Hi is staring as the knock comes again. He goes to the door, pulls back its shade, and peeks out, looking at Glen evenly. Hi is suddenly nervous and urgent, taking one step down and holding out a calming hand as Glen takes two nervous steps away and reassures himself by resting a hand on the door of his station wagon, while Hi stops short. Glen smiles, spits on the dirt in front of him, and Hi's face is set in rigid dismay as Glen gets into his car, slams the door, and the car squeals off. Hi looks back at the trailer as a slat in the window blind drops back into place. He opens the door as Evelle is already emerging from the bedroom with the baby in his arms.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Certainly! Here’s the transformed text with exact synonyms:\n\n---\n\nSimilarly generating a lengthy timber match, clamping down on the stogie, and pulling the kitchen match along the unfinished timber surface of an pricey dresser, leaving an unsightly black mark, the match bursts into roaring blaze, snapping as it is ignited, from the interior of the workspace. The designation on the textured glass is a reverse Nathan Arizona. There is the silhouette of a figure nearing the entrance, and muted voices. The entrance swings open and Nathan stands observing in, his middle-aged assistant dangling at his arm. Nathan is gazing toward his workstation where the Biker reclines with his reverse to us, jackboots placed idly on the workstation. His head bobs and dips, as if he is tracking some motion in the air ahead of him. Eyes on the Biker, Nathan bangs the entrance closed behind him, seeking for some response, but the Biker still does not respond to Nathan, not even troubling to give him a look. His eyes persist to track some apparition motion, and when the Biker speaks, it is still without glancing at Nathan, and in a astonishingly gentle voice and moderate, unhurried style. He takes a puff on his stogie. SMALLS is agreeably shaking his head, while Nathan is regarding him stonily. Quick as a flash, the previously leisurely Smalls lunges forward, his fist halted an inch brief of Nathan's nose, his index digit and thumb pinched jointly, clutching the leg of a struggling insect that he has just snatched from the air. He flicks the insect away, and Nathan gazes grimly at Smalls then rotates to punch figures on a phone. Nathan rotates back, observing up, and his speech ceases short. The workspace is vacant. A whipcrack effect builds to the cut, and he has been slumped over the kitchen table, dozing. Hi looks up as Gale and Evelle are grinning down at him. Hi takes the packet that he was slumped over, with \"to Ed\" inscribed on its surface. There is a harsh rap at the entrance and all three brace. Hi is staring as the rap comes again. He proceeds to the entrance, pulls back its shade, and peeks out, observing at Glen evenly. Hi is suddenly uneasy and urgent, taking one pace down and holding out a calming hand as Glen takes two uneasy paces away and reassures himself by resting a hand on the entrance of his station wagon, while Hi ceases short. Glen grins, spits on the soil in front of him, and Hi's visage is set in rigid dismay as Glen enters his automobile, bangs the entrance, and the vehicle screeches off. Hi observes back at the trailer as a slat in the window blind descends back into position. He opens the entrance as Evelle is already emerging from the bedroom with the infant in his arms."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Similarly, a long wooden match was produced by him, the cigar was bitten down on, and the kitchen match was dragged along the unfinished wood surface of an expensive bureau, leaving an ugly black scar, as a roaring flame erupted from the match, crackling as he lit it from the inside of the office. A backwards Nathan Arizona was the name on the pebbled glass. A man was approaching the door, and muffled voices were heard. The door was swung open by Nathan, who stood looking in, with his middle-aged secretary hanging at his elbow. Nathan stared toward his desk where the Biker was sitting with his back to us, with jackboots propped lazily on the desk. His head bobbed and ducked, as if some movement was being followed by him in the air in front of him. With eyes on the Biker, the door was slammed shut by Nathan, looking for some reaction, but no reaction was received by Nathan from the Biker, as he did not even bother to give him a glance. The Biker's eyes continued to follow some phantom movement, and when he spoke, Nathan was still not looked at by him, and his voice was surprisingly soft and his manner mild, unhurried. A drag was taken by him on his cigar. SMALLS pleasantly shook his head, while he was looked at stonily by Nathan. Smalls, heretofore languid, bolted forward quick as a flash, his fist stopping an inch short of Nathan's nose, with his index finger and thumb pinched together, holding the leg of a struggling fly that he had just plucked from the air. The fly was flicked away by him, and Nathan stared grimly at Smalls then swiveled to punch numbers on a telephone. Nathan swiveled back, looked up, and his speech stopped short. The office was empty. A whipcrack effect built to the cut, and he slumped over the kitchen table, asleep. Hi looked up as Gale and Evelle smiled down at him. Hi took the envelope over which he had slumped, with \"to Ed\" written on its face. A harsh knock was heard at the door and all three tensed. Hi stared as the knock came again. The door was approached by him, its shade was pulled back, and Glen was evenly looked at by him through a peek. Hi suddenly became nervous and urgent, taking one step down and holding out a calming hand as Glen took two nervous steps away and reassured himself by resting a hand on the door of his station wagon, while Hi stopped short. Glen smiled, spat on the dirt in front of him, and Hi's face was set in rigid dismay as Glen got into his car, slammed the door, and the car squealed off. Hi looked back at the trailer as a slat in the window blind dropped back into place. The door was opened by him as Evelle was already emerging from the bedroom with the baby in his arms."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Producing a long wooden match, biting down on the cigar, and striking it on an unfinished bureau, creating a black scar, a flame erupts inside the office. The pebbled glass shows \"Nathan Arizona\" backward. As a man’s shadow approaches, Nathan opens the door with his secretary. Nathan sees the Biker at his desk, ignoring him while tracking a phantom movement. The Biker, in a soft voice, speaks without acknowledging Nathan. Smalls shakes his head pleasantly; Nathan watches sternly. Suddenly, Smalls lunges forward, plucking a struggling fly from the air. He flicks it away, and Nathan, grim, turns to the phone. When he swivels back, the office is empty; a whipcrack effect cues that he is slumped over a kitchen table asleep. Hi looks up at Gale and Evelle, smiling. He grabs the envelope marked \"to Ed.\" A harsh knock startles them. Hi peeks through the door shade at Glen, becoming nervous. Hi steps forward with a calming gesture as Glen retreats, reassured by his station wagon. Glen smiles, spits, and drives off. Hi's face is set in rigid dismay as he looks back at the trailer. Evelle emerges from the bedroom with the baby."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Producing a long match, biting a cigar, and striking the match on an expensive bureau, leaving a black scar, it flares up inside the office. Nathan Arizona's name is on the glass. A man approaches; the door opens, revealing Nathan and his secretary. Nathan stares at the Biker, whose boots are on the desk. The Biker, tracking something unseen, does not react to Nathan. Speaking softly, he drags on his cigar. Smalls shakes his head pleasantly as Nathan looks stonily. Smalls suddenly lunges, stopping an inch from Nathan's nose, holding a captured fly. He flicks it away, and Nathan turns to the phone, stopping mid-speech. The office is empty. A whipcrack effect reveals Hi, asleep at the table. Gale and Evelle smile at him. Hi takes an envelope marked \"to Ed\" as a knock tenses them. Hi checks the door, seeing Glen. Nervously, Hi steps down as Glen reassures himself by his station wagon before driving off. Hi looks back at the trailer as a slat falls into place. He opens the door as Evelle emerges with the baby."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In a similar manner, a long wooden match is produced with precision from the inside of the office. With a determined bite on the cigar, the match is dragged along the unfinished wooden surface of an expensive bureau, leaving behind an ugly, prominent black scar. As the match erupts into a roaring flame, it crackles loudly, signaling its ignition. The name etched on the pebbled glass of the door appears in reverse, revealing the name Nathan Arizona. Shadows shift as a man approaches the door, accompanied by the muffled sound of voices that can be heard faintly. The door swings open, revealing Nathan as he stands there, with his middle-aged secretary hanging closely at his elbow. Nathan's gaze is fixed intently on his desk, where the Biker sits with his back towards those at the door, casually resting his jackboots on the desk. His head bobs and ducks methodically, as if tracing some elusive movement in the air before him. Even as Nathan slams the door shut behind him, seeking some form of reaction, his eyes remain locked on the Biker. However, the Biker remains entirely unfazed by Nathan's presence, not bothering to spare even the briefest glance in his direction. His eyes continue to pursue the imagined, phantom movement, and when he finally speaks, it is done without turning his head towards Nathan, expressed in a surprisingly soft, gentle voice and a mild, unhurried manner. He takes another leisurely drag on his cigar. SMALLS, meanwhile, is pleasantly shaking his head, while Nathan maintains a stony expression directed at him. Suddenly, in a flash of unexpected speed, the previously languid Smalls bolts forward, his fist halting mere inches from Nathan's nose, his index finger and thumb deftly pinched together, grasping the leg of a struggling fly he has managed to pluck from the air. With a casual flick, he sends the fly away, and Nathan's gaze darkens as he stares grimly at Smalls before swiveling to punch numbers on a telephone. Nathan swivels back, his eyes lifting, but his speech abruptly stops as he realizes the office is now empty. A whipcrack effect builds to the cut, revealing him slumped over the kitchen table, asleep. Hi lifts his head as Gale and Evelle smile down at him. Hi takes the envelope he was resting on, with \"to Ed\" penned on its face. A harsh knock at the door startles them all, making them tense. Hi focuses intently as the knock is repeated. He cautiously goes to the door, pulls back the shade, and peers out, meeting Glen's gaze evenly. Suddenly consumed by nerves and urgency, Hi takes a cautious step forward and extends a calming hand as Glen, equally unsettled, steps back and reassures himself by resting a hand on the door of his station wagon. Hi halts his advance abruptly. Glen, with a smile, spits onto the dirt in front of him, causing Hi's face to set in rigid dismay as Glen enters his car, slams the door shut, and speeds off, tires squealing. Hi casts a backward glance at the trailer as a slat in the window blind drops back into place. As he opens the door, Evelle emerges from the bedroom with the baby securely in his arms."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In a manner quite similar to the one previously described, a long wooden match is meticulously crafted with great precision from within the confines of the office. With a determined bite on the cigar, showing his resolve, the match is dragged insistently along the unfinished wooden surface of an expensive bureau, leaving behind an ugly, prominent black scar that starkly mars its surface. As the match erupts into a fierce, roaring flame, it crackles loudly, signaling its ignition with an audible announcement. The name etched on the pebbled glass of the door stands out in reverse, revealing the name \"Nathan Arizona\" clearly to those positioned inside. Shadows begin to shift and move as a man approaches the door, accompanied by the muffled sound of distant voices that can be heard faintly in the background. The door swings open dramatically, revealing Nathan as he stands there, with his middle-aged secretary hanging closely at his elbow, lending assistance. Nathan's gaze is fixed intently on his desk, where the Biker is seated leisurely. The Biker sits there with his back turned towards those at the door, casually resting his heavy jackboots on the surface of the desk. His head bobs and ducks methodically, as if tracing some elusive movement in the air before him. Even as Nathan slams the door shut behind him in a bid to elicit some form of reaction, his eyes remain locked on the Biker intently. However, the Biker appears completely unfazed by Nathan's commanding presence, not bothering to spare even the briefest glance in his direction. His eyes continue to pursue the imagined, phantom movement, and when he finally speaks, it is done without turning his head towards Nathan. His words are expressed in a surprisingly soft, gentle voice and in a mild, unhurried manner. He takes another leisurely and deliberate drag on his cigar. Meanwhile, SMALLS is pleasantly shaking his head, while Nathan maintains a stony expression directed at him, unyielding in his demeanor. Suddenly, in a flash of unexpected speed, the previously languid Smalls bolts forward with astonishing quickness, his fist halting mere inches from Nathan's nose, with his index finger and thumb deftly pinched together to grasp the leg of a struggling fly he has managed to pluck from the air with skillful precision. With a casual flick of his fingers, he sends the fly away, and Nathan's gaze darkens significantly as he stares grimly at Smalls before swiveling to punch numbers on a telephone with determination. Nathan turns back around, his eyes lifting as he prepares to speak, but his speech abruptly stops as he realizes the office is now eerily empty. A whipcrack effect builds to the cut, revealing him slumped over the kitchen table, fast asleep. Hi lifts his head slowly as Gale and Evelle stand over him, smiling down warmly at him. Hi takes the envelope he was resting on, noticing the words \"to Ed\" penned clearly on its face. A sudden and harsh knock at the door startles them all, making them tense with anxiety. Hi focuses intently on the door as the knock is repeated insistently. He cautiously approaches the door, pulls back the shade for a better view, and peers out, meeting Glen's gaze evenly. Suddenly consumed by nerves and an urgency he cannot ignore, Hi takes a cautious step forward and extends a calming hand as Glen, equally unsettled by the situation, steps back and reassures himself by resting a hand on the door of his station wagon. Hi halts his advance abruptly, sensing the tension. Glen, with a smile that doesn't quite reach his eyes, spits onto the dirt in front of him, causing Hi's face to set in rigid dismay. Glen then enters his car, slams the door shut with finality, and speeds off, tires squealing as he departs. Hi casts a backward glance at the trailer, noticing a slat in the window blind dropping back into place with a soft sound. As he opens the door, Evelle emerges from the bedroom, carrying the baby securely and protectively in his arms."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "In a smooth, practiced motion, a long wooden match is drawn, gripped tightly between fingers, and positioned near the mouth where teeth securely bite down on the cigar. Focusing on igniting the cigar, the match is dragged slowly along the unfinished wood surface of an expensive bureau, leaving behind a trail of scorched wood—a black scar marring the fine furniture. As the match erupts into a roaring flame, crackling energetically upon being lit, it illuminates the dim interior of the office. Through the pebbled glass, the name Nathan Arizona is visible in reverse, while the shadow of a man approaches the door amidst muffled voices. The door swings open to reveal Nathan standing with a commanding presence, his middle-aged secretary at his elbow, offering support. Nathan's gaze fixes on his desk where a Biker sits nonchalantly, his back turned, with jackboots comfortably propped up. The Biker's head bobs and ducks as though tracking something unseen in the air before him. Nathan, seeking acknowledgment, slams the door shut with a force meant to demand attention, but the Biker remains unphased, eyes unwaveringly following an invisible dance in the room. When the Biker eventually speaks, he does so without shifting his gaze to Nathan, his voice unexpectedly soft and unhurried. Puffing leisurely on his cigar, SMALLS shakes his head in a seemingly pleasant manner, contrasting with Nathan's stony expression. Suddenly, in a burst of speed that dispels his previous languid demeanor, Smalls lunges forward, halting his fist mere inches from Nathan's nose, pinching tightly between his fingers the leg of a struggling fly caught mid-flight. With a flick, the fly is dismissed, and Nathan, eyes locked grimly on Smalls, swivels to punch numbers into a telephone before swiveling back, his gaze lifted, only to be interrupted mid-speech by the realization that the office is empty. The scene shifts abruptly with a whipcrack effect, revealing Hi slouched over a kitchen table, asleep but now waking. He glances up to find Gale and Evelle smiling down at him, and he reaches out for the envelope over which he had been slumped, noticing \"to Ed\" written on its surface. A sudden, harsh knock at the door causes all three to tense, and as the knocking repeats, Hi approaches the door with caution, pulling back its shade to peer out evenly at Glen. Hi's demeanor shifts to one of nervous urgency, taking a single step down while extending a placating hand toward Glen, who responds with his own two nervous steps, eventually resting a reassuring hand on the door of his station wagon. Hi abruptly halts, his anxiety evident as Glen, smiling, spits on the dirt, an action that leaves Hi's expression fixed in rigid dismay. Glen climbs into his car, slams the door shut, and speeds away with a squeal of tires. As Hi looks back toward the trailer, a slat in the window blind gently falls back into place. Opening the door, Hi sees Evelle emerge from the bedroom, already holding the baby securely in his arms."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The Biker ignites a wooden match against an expensive bureau, damaging its surface, as Nathan Arizona's name appears reversed on the pebbled office glass. Nathan enters with his secretary, witnessing the Biker, Smalls, who ignores Nathan with a calm demeanor while fixated on something unseen. Nathan attempts to provoke a reaction by shutting the door forcefully, but Smalls remains unresponsive, calmly smoking a cigar. Suddenly, Smalls swiftly captures a fly mid-air, which he discards, leaving Nathan to grimly dial numbers on a phone. As Nathan turns around, the office is mysteriously empty, and the scene abruptly shifts to Hi, who wakes up slumped over a kitchen table with an envelope labeled \"to Ed.\" Gale and Evelle observe him as a tense knock on the door captures their attention. Hi cautiously checks the door, finding Glen outside, prompting a brief, nervous exchange before Glen departs in his station wagon. Hi watches him leave, noting a telltale movement of a window blind before opening the door to see Evelle emerging from the bedroom with the baby."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Similarly producing a long wooden match, biting down on the cigar popular among aficionados for its robust flavor, and dragging the kitchen match along the unfinished wood surface of an expensive bureau made of mahogany, imported at great expense from Brazil, leaving an ugly black scar, the match erupts into roaring flame, crackling as it is lit, from the inside of the office. The name on the pebbled glass is a backwards Nathan Arizona, who runs a local chain of unpainted furniture stores, making him a well-known figure in the community. There is the shadow of a man approaching the door, and muffled voices resonate in the hallway, suggesting a lively office environment. The door swings open and Nathan stands looking in, his middle-aged secretary, who has been with him for over a decade and knows all his habits, hanging at his elbow. Nathan is staring toward his desk where the Biker sits, with a reputation as a feared bounty hunter, with his back to us, jackboots propped lazily on the desk. His head bobs and ducks, as if he is following some movement in the air in front of him, perhaps another one of his perceptive observations that earned him his reputation. Eyes on the Biker, Nathan slams the door shut behind him, looking for some reaction, but the Biker still does not react to Nathan, not even bothering to give him a glance. His eyes continue to follow some phantom movement, and when the Biker speaks, it is still without looking at Nathan, and in a surprisingly soft voice and mild, unhurried manner, which is unexpected given his intimidating presence. He takes a drag on his cigar. SMALLS, whose real name is Leonard Smalls, but acquired his nickname due to his imposing stature, is pleasantly shaking his head, while Nathan is looking at him stonily. Quick as a flash, the heretofore languid Smalls bolts forward, his fist stopped an inch short of Nathan's nose, his index finger and thumb pinched together, holding the leg of a struggling fly that he has just plucked from the air with remarkable precision, a testament to his sharp reflexes. He flicks the fly away, and Nathan stares grimly at Smalls then swivels to punch numbers on a telephone, likely contacting someone crucial. Nathan swivels back, looking up, and his speech stops short. The office is empty. A whipcrack effect builds to the cut, revealing it was all a dream as he has been slumped over the kitchen table, asleep. Hi looks up as Gale and Evelle, his partners in crime from a recent bank heist, are smiling down at him. Hi takes the envelope that he was slumped over, with \"to Ed\" written on its face, indicating a personal message for his wife. There is a harsh knock at the door and all three tense, aware of their precarious situation. Hi is staring as the knock comes again, heightening the tension. He goes to the door, pulls back its shade, and peeks out, looking at Glen evenly, a nosy neighbor with a penchant for gossip. Hi is suddenly nervous and urgent, taking one step down and holding out a calming hand as Glen takes two nervous steps away and reassures himself by resting a hand on the door of his station wagon, a classic model from the 1970s. Hi stops short. Glen smiles, spits on the dirt in front of him, a habit he picked up from his rural upbringing, and Hi's face is set in rigid dismay as Glen gets into his car, slams the door, and the car squeals off, its tires kicking up dust. Hi looks back at the trailer, his temporary refuge, as a slat in the window blind drops back into place. He opens the door as Evelle is already emerging from the bedroom with the baby in his arms, a reminder of their recent caper that involved the accidental kidnapping."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Similarly producing a long wooden match biting down on the cigar and dragging the kitchen match along the unfinished wood surface of an expensive bureau leaving an ugly black scar the match erupts into roaring flame crackling as it is lit from the inside of the office. The name on the pebbled glass is a backwards. Nathan Arizona. There is the shadow of a man approaching the door and muffled voices. The door swings open and Nathan stands looking in his middleaged secretary hanging at his elbow. Nathan is staring toward his desk where the Biker sits with his back to us jackboots propped lazily on the desk. His head bobs and ducks as if he is following some movement in the air in front of him. Eyes on the Biker. Nathan slams the door shut behind him looking for some reaction but the Biker still does not react to Nathan not even bothering to give him a glance. His eyes continue to follow some phantom movement and when the Biker speaks it is still without looking at Nathan and in a surprisingly soft voice and mild unhurried manner. He takes a drag on his cigar. SMALLS is pleasantly shaking his head while Nathan is looking at him stonily. Quick as a flash the heretofore languid Smalls bolts forward. his fist stopped an inch short of Nathan's nose. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. his index finger and thumb pinched together holding the leg of a struggling fly that he has just plucked from the air. He flicks the fly away and Nathan stares grimly at Smalls then swivels to punch numbers on a telephone. Nathan swivels back looking up and his speech stops short. The office is empty. A whipcrack effect builds to the cut and he has been slumped over the kitchen table asleep. Hi looks up as Gale and Evelle are smiling down at him. Hi takes the envelope that he was slumped over with to Ed written on its face. There is a harsh knock at the door and all three tense. Hi is staring as the knock comes again. He goes to the door pulls back its shade and peeks out looking at Glen evenly. Hi is suddenly nervous and urgent taking one step down and holding out a calming hand as Glen takes two nervous steps away and reassures himself by resting a hand on the door of his station wagon. while Hi stops short. Glen smiles spits on the dirt in front of him and Hi's face is set in rigid dismay as Glen gets into his car slams the door and the car squeals off. Hi looks back at the trailer as a slat in the window blind drops back into place. He opens the door as Evelle is already emerging from the bedroom with the baby in his arms."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Similarly producing a long wooden match biting down on the cigar and dragging the kitchen match along the unfinished wood surface of an expensive bureau leaving an ugly black scar the match erupts into roaring flame crackling as it is lit from the inside of the office. The name on the pebbled glass is a backwards. Nathan Arizona. There is the shadow of a man approaching the door and muffled voices. The door swings open and Nathan stands looking in his middleaged secretary hanging at his elbow. Nathan is staring toward his desk where the Biker sits with his back to us jackboots propped lazily on the desk. His head bobs and ducks as if he is following some movement in the air in front of him. Eyes on the Biker. Nathan slams the door shut behind him looking for some reaction but the Biker still does not react to Nathan not even bothering to give him a glance. His eyes continue to follow some phantom movement and when the Biker speaks it is still without looking at Nathan and in a surprisingly soft voice and mild unhurried manner. He takes a drag on his cigar. SMALLS is pleasantly shaking his head while Nathan is looking at him stonily. Quick as a flash the heretofore languid Smalls bolts forward. his fist stopped an inch short of Nathan's nose. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his index finger and thumb pinched together holding the leg of a struggling fly that he has just plucked from the air. He flicks the fly away and Nathan stares grimly at Smalls then swivels to punch numbers on a telephone. Nathan swivels back looking up and his speech stops short. The office is empty. A whipcrack effect builds to the cut and he has been slumped over the kitchen table asleep. Hi looks up as Gale and Evelle are smiling down at him. Hi takes the envelope that he was slumped over with to Ed written on its face. There is a harsh knock at the door and all three tense. Hi is staring as the knock comes again. He goes to the door pulls back its shade and peeks out looking at Glen evenly. Hi is suddenly nervous and urgent taking one step down and holding out a calming hand as Glen takes two nervous steps away and reassures himself by resting a hand on the door of his station wagon. while Hi stops short. Glen smiles spits on the dirt in front of him and Hi's face is set in rigid dismay as Glen gets into his car slams the door and the car squeals off. Hi looks back at the trailer as a slat in the window blind drops back into place. He opens the door as Evelle is already emerging from the bedroom with the baby in his arms."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Similarly producing a long wooden match biting down on the cigar and dragging the kitchen match along the unfinished wood surface of an expensive bureau leaving an ugly black scar the match erupts into roaring flame crackling as it is lit from the inside of the office. The name on the pebbled glass is a backwards. Nathan Arizona. There is the shadow of a man approaching the door and muffled voices. The door swings open and Nathan stands looking in his middleaged secretary hanging at his elbow. Nathan is staring toward his desk where the Biker sits with his back to us jackboots propped lazily on the desk. His head bobs and ducks as if he is following some movement in the air in front of him. There is a harsh knock at the door and all three tense. Hi is staring as the knock comes again. He goes to the door pulls back its shade and peeks out looking at Glen evenly. Hi is suddenly nervous and urgent taking one step down and holding out a calming hand as Glen takes two nervous steps away and reassures himself by resting a hand on the door of his station wagon. while Hi stops short. Glen smiles spits on the dirt in front of him and Hi's face is set in rigid dismay as Glen gets into his car slams the door and the car squeals off. Hi looks back at the trailer as a slat in the window blind drops back into place. He opens the door as Evelle is already emerging from the bedroom with the baby in his arms."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Similarly producing a long wooden match biting down on the cigar and dragging the kitchen match along the unfinished wood surface of an expensive bureau leaving an ugly black scar the match erupts into roaring flame crackling as it is lit from the inside of the office. The name on the pebbled glass is a backwards. Nathan Arizona. Glen smiles spits on the dirt in front of him and Hi's face is set in rigid dismay as Glen gets into his car slams the door and the car squeals off. Hi looks back at the trailer as a slat in the window blind drops back into place. He opens the door as Evelle is already emerging from the bedroom with the baby in his arms."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Similarly producing a long metallic spoon, nibbling on the marshmallow, and sliding the garage broom along the bright marble surface of a luxurious table, leaving a messy red trail, the spoon erupts into quiet shadows, rustling as it is polished, from the basement of the library. The label on the frosted glass is a backward Alec Toronto. There is the silhouette of a cat approaching the window, and whispered songs. The window slides open and Alec peers inside, his young niece dangling from his shoulder. Alec is peeking toward his couch where the Juggler lounges with his face away from us, sneakers resting lazily on the table. His head tilts and shifts, as if he is following some melody in the breeze around him. Eyes on the Juggler, Alec pushes the window closed behind him, waiting for some reaction, but the Juggler still does not react to Alec, not even bothering to give him a nod. His eyes continue to follow some invisible sound, and when the Juggler murmurs, it is still without regarding Alec, and in a surprisingly rough voice and gentle, unhurried demeanor. He inhales the scent of marshmallow. SQUIRREL is cheerfully nodding his head, while Alec is staring at him stoically. Quick as a blink, the previously sluggish Squirrel leaps sideways, his paw halted an inch away from Alec's ear, his pinky and ring finger squeezed together, holding the leg of a fluttering moth that he has just snatched from the air. He flings the moth away, and Alec gazes sternly at Squirrel then turns to shuffle papers on a typewriter. Alec twists back, gazing downward, and his words stop abruptly. The library is vacant. A windchime sound builds to the cut, and he has been dozing over the park bench, dreaming. Lo gazes up as Dale and Neville are chuckling down at him. Lo takes the paper that he was dozing over, with \"to Ted\" scribbled on its face. There is a soft rap at the window and all three freeze. Lo is gazing as the rap echoes once more. He edges to the window, draws back its curtain, and peers out, squinting at Ralph evenly. Lo is abruptly jittery and brisk, stepping backward and extending a soothing palm as Ralph takes two cautious backward steps and reassures himself by steadying a palm on the roof of his caravan, while Lo halts abruptly. Ralph chuckles, spits on the grass beside him, and Lo's expression is one of controlled panic as Ralph clambers into his van, slams the gate, and the van roars away. Lo glances back at the cabin as a hinge on the door creaks back into its groove. He opens the window as Neville is presently stepping out of the closet with the dog in his grip."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Inside an office, Nathan Arizona approaches as a Biker, identified as Smalls, sits with his boots on Nathan’s desk, seemingly fixated on something unseen. Nathan tries to provoke a reaction by slamming the door, but Smalls remains indifferent. Suddenly, Smalls captures a fly in mid-air, startling Nathan, who turns to use the phone. When Nathan finishes, the office is empty. Meanwhile, Hi wakes up at the kitchen table, where he, Gale, and Evelle notice a letter addressed to Ed. A knock on the door puts them on edge. Hi cautiously peeks out to see Glen, who nervously backs away to his car. Glen leaves abruptly, and Hi turns to find Evelle holding a baby, ready to move."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He opens the door as Evelle is already emerging from the bedroom with the baby in his arms Hi looks back at the trailer as a slat in the window blind drops back into place Glen smiles spits on the dirt in front of him and Hi's face is set in rigid dismay as Glen gets into his car slams the door and the car squeals off while Hi stops short Hi is suddenly nervous and urgent taking one step down and holding out a calming hand as Glen takes two nervous steps away and reassures himself by resting a hand on the door of his station wagon He goes to the door pulls back its shade and peeks out looking at Glen evenly Hi is staring as the knock comes again There is a harsh knock at the door and all three tense Hi takes the envelope that he was slumped over with to Ed written on its face Hi looks up as Gale and Evelle are smiling down at him A whipcrack effect builds to the cut and he has been slumped over the kitchen table asleep The office is empty Nathan swivels back looking up and his speech stops short He flicks the fly away and Nathan stares grimly at Smalls then swivels to punch numbers on a telephone his index finger and thumb pinched together holding the leg of a struggling fly that he has just plucked from the air his fist stopped an inch short of Nathan's nose Quick as a flash the heretofore languid Smalls bolts forward SMALLS is pleasantly shaking his head while Nathan is looking at him stonily He takes a drag on his cigar His eyes continue to follow some phantom movement and when the Biker speaks it is still without looking at Nathan and in a surprisingly soft voice and mild unhurried manner Nathan slams the door shut behind him looking for some reaction but the Biker still does not react to Nathan not even bothering to give him a glance Eyes on the Biker His head bobs and ducks as if he is following some movement in the air in front of him Nathan is staring toward his desk where the Biker sits with his back to us jackboots propped lazily on the desk The door swings open and Nathan stands looking in his middleaged secretary hanging at his elbow There is the shadow of a man approaching the door and muffled voices Nathan Arizona The name on the pebbled glass is a backwards Similarly producing a long wooden match biting down on the cigar and dragging the kitchen match along the unfinished wood surface of an expensive bureau leaving an ugly black scar the match erupts into roaring flame crackling as it is lit from the inside of the office"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The name on the pebbled glass is a backwards Similarly producing a long wooden match biting down on the cigar and dragging the kitchen match along the unfinished wood surface of an expensive bureau leaving an ugly black scar the match erupts into roaring flame crackling as it is lit from the inside of the office There is the shadow of a man approaching the door and muffled voices Nathan Arizona Nathan is staring toward his desk where the Biker sits with his back to us jackboots propped lazily on the desk The door swings open and Nathan stands looking in his middleaged secretary hanging at his elbow Eyes on the Biker His head bobs and ducks as if he is following some movement in the air in front of him His eyes continue to follow some phantom movement and when the Biker speaks it is still without looking at Nathan and in a surprisingly soft voice and mild unhurried manner Nathan slams the door shut behind him looking for some reaction but the Biker still does not react to Nathan not even bothering to give him a glance SMALLS is pleasantly shaking his head while Nathan is looking at him stonily He takes a drag on his cigar his fist stopped an inch short of Nathan's nose Quick as a flash the heretofore languid Smalls bolts forward He flicks the fly away and Nathan stares grimly at Smalls then swivels to punch numbers on a telephone his index finger and thumb pinched together holding the leg of a struggling fly that he has just plucked from the air The office is empty Nathan swivels back looking up and his speech stops short Hi looks up as Gale and Evelle are smiling down at him A whipcrack effect builds to the cut and he has been slumped over the kitchen table asleep There is a harsh knock at the door and all three tense Hi takes the envelope that he was slumped over with to Ed written on its face He goes to the door pulls back its shade and peeks out looking at Glen evenly Hi is staring as the knock comes again while Hi stops short Hi is suddenly nervous and urgent taking one step down and holding out a calming hand as Glen takes two nervous steps away and reassures himself by resting a hand on the door of his station wagon Hi looks back at the trailer as a slat in the window blind drops back into place Glen smiles spits on the dirt in front of him and Hi's face is set in rigid dismay as Glen gets into his car slams the door and the car squeals off He opens the door as Evelle is already emerging from the bedroom with the baby in his arms"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He flicks the fly away and Nathan stares grimly at Smalls then swivels to punch numbers on a telephone Nathan swivels back looking up and his speech stops short The office is empty A whipcrack effect builds to the cut and he has been slumped over the kitchen table asleep Hi looks up as Gale and Evelle are smiling down at him Hi takes the envelope that he was slumped over with to Ed written on its face There is a harsh knock at the door and all three tense Hi is staring as the knock comes again He goes to the door pulls back its shade and peeks out looking at Glen evenly Hi is suddenly nervous and urgent taking one step down and holding out a calming hand as Glen takes two nervous steps away and reassures himself by resting a hand on the door of his station wagon while Hi stops short Glen smiles spits on the dirt in front of him and Hi's face is set in rigid dismay as Glen gets into his car slams the door and the car squeals off Hi looks back at the trailer as a slat in the window blind drops back into place He opens the door as Evelle is already emerging from the bedroom with the baby in his arms Similarly producing a long wooden match biting down on the cigar and dragging the kitchen match along the unfinished wood surface of an expensive bureau leaving an ugly black scar the match erupts into roaring flame crackling as it is lit from the inside of the office The name on the pebbled glass is a backwards Nathan Arizona There is the shadow of a man approaching the door and muffled voices The door swings open and Nathan stands looking in his middleaged secretary hanging at his elbow Nathan is staring toward his desk where the Biker sits with his back to us jackboots propped lazily on the desk His head bobs and ducks as if he is following some movement in the air in front of him Eyes on the Biker Nathan slams the door shut behind him looking for some reaction but the Biker still does not react to Nathan not even bothering to give him a glance His eyes continue to follow some phantom movement and when the Biker speaks it is still without looking at Nathan and in a surprisingly soft voice and mild unhurried manner He takes a drag on his cigar SMALLS is pleasantly shaking his head while Nathan is looking at him stonily Quick as a flash the heretofore languid Smalls bolts forward his fist stopped an inch short of Nathan's nose his index finger and thumb pinched together holding the leg of a struggling fly that he has just plucked from the air"
        }
      ]
    }
  ]
}