{
  "ground_truth": "The rumble builds louder and louder until it is snapped off by a click. The front door handle clicks open, and Smalls stands in the doorway of the abandoned trailer, which is perfectly quiet. The room is a complete shambles from the fight, as sunlight filters in between the slats of the venetian blinds. Smoke from Lenny Smalls' cheroot ripples up through the light. After a momentary pause at the door to take in the scene, Smalls goes directly to a specific spot in the debris and nudges some of it aside with his toe, exposing a piece of paper. He bends down to pick it up but suddenly freezes with a soft grunt of surprise as he stands up with the piece of paper. It is Gale's picture of the Farmers and Mechanics Bank, baking in the noonday sun. Sitting in the front seat of their idling car, looking at the bank, Gale and Evelle look at each other. Gale reaches for his door, and as Gale and Evelle bang in through the door, Evelle holds a shotgun, and Gale holds a shotgun in one hand and Nathan Jr. in his car seat in the other. Everyone freezes, staring at Gale and Evelle. An old hayseed with his hands in the air speaks up, and there is a murmur of acknowledgment from all the people on the ground. Gale is tossing Evelle a sack and is looking in shock at the tellers' counter when a muffled voice from offscreen is heard. Evelle is momentarily abashed but then brightens as Gale registers understanding. Again, there is a murmur of acknowledgment from all the people on the ground. The camera is locked down on the roof of the rocketing squad car, looking past its flashing gumballs as the car approaches the townlet, its siren wailing. A teller is finishing stuffing the last of two burlap bags, and close on her hands, we see her putting in a cash packet that is really only a few bills and a sleeve surrounding and hiding a small plastic device. The teller hits a button on the device and it starts ticking; she shoves it into the sack. He is grabbing the two sacks and tosses one to Gale, who also picks up the baby as the two are backing toward the door. They bolt out the door, and the siren jumps in loud at the cut. It is the same locked-down shot over the gumballs as they peel out from in front of the bank. Gale is driving, and Evelle starts pawing through one of the sacks when a thought registers with Gale and Evelle at the same moment. They look at each other, and they both twist frantically to look in the back seat. Bellowing, KA-POP! With a loud flat crack, something detonates in the front seat, and the interior of the car is spattered with bright blue paint.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The growl amplifies louder and louder until it is snapped off by a click. The anterior door grip clicks open, and Smalls stands in the entrance of the deserted trailer, which is perfectly silent. The chamber is a total wreck from the skirmish, as sunlight sifts in between the slats of the venetian shades. Smoke from Lenny Smalls' cigar curls up through the light. After a temporary pause at the door to take in the scene, Smalls goes directly to a specific location in the rubble and nudges some of it aside with his toe, revealing a sheet of paper. He bends down to pick it up but suddenly halts with a soft grunt of astonishment as he stands up with the sheet of paper. It is Gale's photograph of the Farmers and Mechanics Bank, baking in the midday sun. Seated in the front seat of their idling car, looking at the bank, Gale and Evelle look at each other. Gale reaches for his door, and as Gale and Evelle bang in through the door, Evelle holds a shotgun, and Gale holds a shotgun in one hand and Nathan Jr. in his car seat in the other. Everyone freezes, staring at Gale and Evelle. An old countryman with his hands in the air speaks up, and there is a murmur of acknowledgment from all the people on the ground. Gale is tossing Evelle a sack and is looking in disbelief at the tellers' counter when a muffled voice from offscreen is heard. Evelle is momentarily abashed but then brightens as Gale registers comprehension. Again, there is a murmur of acknowledgment from all the people on the ground. The camera is fixed down on the roof of the rocketing patrol car, looking past its flashing gumballs as the car approaches the hamlet, its siren wailing. A teller is finishing stuffing the last of two burlap bags, and close on her hands, we see her putting in a cash packet that is really only a few bills and a sleeve surrounding and concealing a small plastic device. The teller hits a button on the device and it starts ticking; she shoves it into the sack. He is grabbing the two sacks and tosses one to Gale, who also picks up the baby as the two are backing toward the door. They dash out the door, and the siren jumps in loud at the cut. It is the same fixed-down shot over the gumballs as they peel out from in front of the bank. Gale is driving, and Evelle starts pawing through one of the sacks when an idea registers with Gale and Evelle at the same instant. They look at each other, and they both twist frantically to look in the back seat. Roaring, KA-POP! With a loud flat crack, something explodes in the front seat, and the interior of the car is splattered with vivid blue paint."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The rumble is built louder and louder until a click snaps it off. The front door handle is clicked open by Smalls, who stands in the doorway of the abandoned trailer, which is perfectly quiet. The fight has left the room in complete shambles, as sunlight is filtered in between the slats of the venetian blinds. Lenny Smalls' cheroot ripples smoke up through the light. After a momentary pause at the door to take in the scene, a specific spot in the debris is directly approached by Smalls, who nudges some of it aside with his toe, exposing a piece of paper. He bends down to pick it up but suddenly freezes with a soft grunt of surprise when the piece of paper is stood up with. Gale's picture of the Farmers and Mechanics Bank is baking in the noonday sun. Seated in the front seat of their idling car, Gale and Evelle look at each other while looking at the bank. The door is reached for by Gale, and as the door is banged in through by Gale and Evelle, a shotgun is held by Evelle, and Gale holds a shotgun in one hand and Nathan Jr. in his car seat in the other. Everyone stares at Gale and Evelle, frozen. An old hayseed with his hands in the air speaks up, and all the people on the ground murmur acknowledgment. Evelle is tossed a sack by Gale, who looks in shock at the tellers' counter when a muffled voice is heard from offscreen. Gale registers understanding as Evelle is momentarily abashed but then brightens. Again, acknowledgment is murmured by all the people on the ground. The camera is locking down on the roof of the rocketing squad car, looking past its flashing gumballs as the townlet is approached by the car, its siren wailing. The last of two burlap bags is finished being stuffed by a teller, and close on her hands, we see a cash packet, which is really only a few bills and a sleeve surrounding and hiding a small plastic device, being put in by her. The button on the device is hit by the teller, and it starts ticking; the device is shoved into the sack by her. The two sacks are grabbed by him, and one is tossed to Gale, who also picks up the baby as the door is backed toward by the two. The door is bolted out of, and the siren jumps in loud at the cut. It is the same locked-down shot over the gumballs as the bank is peeled out from in front of. The car is driven by Gale, and one of the sacks is pawed through by Evelle when a thought is registered with Gale and Evelle at the same moment. Each looks at the other, and they both twist frantically to look in the back seat. KA-POP! Bellowing, with a loud flat crack, something detonates in the front seat, and bright blue paint spattered the interior of the car."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The rumble grows louder until it's silenced by a click. Smalls opens the abandoned trailer's door, standing in the silent, sunlit room, disrupted by a fight. Smoke rises from his cheroot as he pauses, then nudges debris aside to reveal a paper. He picks it up, surprised; it's Gale's picture of the Farmers and Mechanics Bank. In their car, Gale and Evelle, armed with shotguns, exchange glances. Inside, they confront people as an old man raises his hands. Gale tosses a sack to Evelle and stares at the teller's counter. A muffled voice is heard; Evelle brightens as Gale understands. Again, a murmur comes from the crowd. The camera shows the police car racing toward town, siren blaring. The teller stuffs burlap bags, adding a small ticking device hidden in cash. She triggers it and shoves it in. Gale grabs the bags and the baby, backing out. They rush out as the siren loudly resumes. The camera follows the car peeling away. Gale drives while Evelle searches a sack. A realization strikes them, and they check the back seat. A loud crack erupts, splattering the car's interior with blue paint."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The rumble intensifies until a click silences it. The front door handle clicks open, and Smalls stands in the trailer's doorway, now quiet. The chaotic room is lit by sunlight through venetian blinds. Lenny Smalls' cheroot smoke drifts up in the light. After hesitating, Smalls uncovers a paper in the debris and freezes with surprise—it is Gale's picture of Farmers and Mechanics Bank in sunlight. In the car, Gale and Evelle exchange looks, and as they enter with shotguns, everyone freezes. An old man speaks up, causing murmurs of acknowledgment. Gale tosses Evelle a sack and notices the tellers' counter, where a voice is heard offscreen. Evelle brightens as Gale understands, and the murmurs continue. A locked-down camera captures the squad car, sirens wailing toward town. A teller stuffs burlap bags and hides a ticking device in one. She hits a button, and the device starts ticking; she shoves it into the sack. Grabbing the sacks, Gale and Evelle back toward the door, escape, and peel out from the bank. As Gale drives, Evelle checks a sack, and they both realize something, frantically looking back. KA-POP! A detonation splatters bright blue paint inside the car."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The deep, resonating rumble builds progressively louder and increasingly intense until it is abruptly silenced by a definitive click. At that precise moment, the front door handle audibly clicks open, revealing Smalls standing firmly in the doorway of the old, abandoned trailer, which is now cloaked in an eerie and unsettling silence. The room is left in utter disarray, remnants of a fierce battle, as delicate streams of sunlight filter in between the narrow slats of the venetian blinds. Smoke, curling up from Lenny Smalls' cheroot, elegantly drifts through the beam of light. After he pauses momentarily at the threshold to thoroughly absorb the chaotic scene before him, Smalls makes his way directly to a specific location amidst the debris. With a deliberate motion, he nudges some of the disorderly clutter aside with his toe, thereby revealing a piece of paper partially concealed beneath. He leans down to pick it up, but as he stands, he suddenly freezes with a soft grunt of surprise. The paper in his hand is Gale's picture of the Farmers and Mechanics Bank, glaring under the harsh noonday sun. Meanwhile, sitting in the front seat of their idling car, poised and alert, Gale and Evelle exchange a knowing glance at each other. With a decisive move, Gale reaches for his door, and simultaneously, both Gale and Evelle burst energetically through the door. Evelle holds a shotgun at the ready, while Gale clutches a shotgun in one hand and Nathan Jr. securely in his car seat in the other. All individuals within freeze, their eyes locked on Gale and Evelle. An old hayseed, his hands held high in surrender, cautiously speaks up, eliciting a murmur of acknowledgment from all those crouched on the ground. Gale, visibly shocked, tosses a sack to Evelle while casting a startled look at the tellers' counter. A muffled voice is heard from offscreen, momentarily catching Evelle off guard, but then he regains his senses as Gale processes the situation with newfound understanding. Once more, a soft murmur of acknowledgment ripples through the people on the ground. The camera remains steadfast, locked down on the speeding squad car’s roof, peering past its flashing gumballs as the vehicle races toward the townlet, its siren wailing loudly. A teller is just completing the task of stuffing the last of two burlap bags and, in a close-up of her hands, we see her discreetly placing a cash packet inside. It cleverly contains only a few bills, with a cleverly hidden small plastic device encased in its sleeve. The teller presses a button on the device, initiating a ticking sound, and quickly shoves it into the sack. Grabbing the two sacks with haste, they toss one to Gale, who also retrieves the baby as the duo retreats backwards toward the door. They bolt out through the door, and the siren explodes loudly at the cut, echoing with the same stationary shot past the gumballs as they speed away from the bank. With Gale at the wheel, Evelle starts rummaging through one of the sacks when a sudden realization dawns on both of them. They exchange a frantic look before both twist sharply to peer into the back seat. A bellowing KA-POP! reverberates as, with a loud, flat crack, something detonates in the front seat. The car's interior is suddenly and dramatically splattered with a vibrant splash of bright blue paint."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As the story unfolds, a deep and resonating rumble fills the air, growing progressively louder and becoming more intense with each passing moment. This growing cacophony is suddenly and sharply silenced by the sound of a definitive click. At that exact moment, the front door handle makes an audible click, opening smoothly to reveal Smalls standing with determination in the doorway of the old, long-abandoned trailer. The interior of the trailer is now shrouded in an eerie and unsettling silence, adding to the atmosphere of desolation. Inside, the room is left in complete disarray, bearing the remnants of a fierce and chaotic struggle, while delicate streams of sunlight filter through the narrow slats of the venetian blinds, casting soft patterns on the floor. Smoke, spiraling upward from Lenny Smalls' cheroot, elegantly weaves through the beam of light, creating a mesmerizing effect. After pausing briefly at the threshold to fully absorb the chaotic and disordered scene before him, Smalls moves purposefully to a specific spot amidst the clutter. With a deliberate and precise motion, he uses his toe to nudge aside some of the disorderly clutter, thereby revealing a piece of paper that had been partially concealed beneath the debris. He bends down to pick it up, but as he stands up again, he suddenly freezes in place, emitting a soft grunt of surprise. The paper he now holds in his hand is none other than Gale's picture of the Farmers and Mechanics Bank, which is glaringly illuminated under the harsh noonday sun. Meanwhile, sitting in the front seat of their idling car, vigilant and alert, Gale and Evelle exchange a knowing and meaningful glance at each other. With a decisive action, Gale reaches for his door, and simultaneously, both Gale and Evelle burst energetically out through the car door. Evelle is holding a shotgun at the ready, while Gale clutches his own shotgun in one hand and Nathan Jr. securely in his car seat with the other. All of the individuals within freeze instantly, their eyes fixated on Gale and Evelle. An old hayseed cautiously raises his hands high in surrender and speaks up, prompting a murmur of acknowledgment from everyone crouched on the ground. Gale, visibly shocked, tosses a sack to Evelle while casting a bewildered look toward the tellers' counter. A muffled voice from offscreen momentarily catches Evelle off guard, but he quickly regains his senses as Gale assesses the situation with newfound understanding. Once again, a soft murmur of acknowledgment ripples through those on the ground. The camera remains steady and focused, locked onto the speeding squad car’s roof, peering past its flashing gumballs as the vehicle races with urgency toward the townlet, its siren wailing loudly. A teller is in the process of finishing the task of stuffing the last of two burlap bags, and in a close-up of her hands, we see her discreetly placing a cash packet inside. The packet cleverly contains only a few bills, with a small plastic device, cleverly concealed, encased in its sleeve. The teller presses a button on the device, initiating a ticking sound, and quickly shoves the packet into the sack. Grabbing the two sacks hastily, they throw one to Gale, who also retrieves the baby, as the duo retreats backward to the door. They bolt out through the door, and the siren explodes loudly at the precise moment of the cut, echoing with the same stationary shot past the gumballs as they speed away from the bank. With Gale at the wheel, Evelle begins rummaging through one of the sacks when a sudden realization dawns on both of them. They exchange a frantic look before twisting sharply to peer into the back seat. A bellowing KA-POP! reverberates throughout the vehicle as, with a loud, flat crack, something detonates in the front seat of the car. The car’s interior is suddenly and dramatically splattered with a vibrant splash of bright blue paint, creating an unexpected and striking scene."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The rumble gradually intensifies, growing louder and louder until it is abruptly silenced by a sudden click. At this very moment, the front door handle clicks open, and Smalls appears standing in the doorway of the abandoned trailer, which is engulfed in an almost eerie silence. The room, now a complete shambles from a previous fight, is illuminated by sunlight filtering through the slats of the venetian blinds. Meanwhile, smoke from Lenny Smalls' cheroot gently rises and ripples through the beams of light. Pausing momentarily at the door, Smalls takes in the chaotic scene before him, then strides directly to a specific spot amidst the chaos. There, with deliberate care, he uses his toe to nudge some of the debris aside, revealing a piece of paper. As he bends down to retrieve it, he suddenly freezes, emitting a soft grunt of surprise as he stands upright, the piece of paper in hand. It turns out to be Gale's picture of the Farmers and Mechanics Bank, glistening under the noonday sun. Meanwhile, Gale and Evelle are seated in the front seat of their idling car, gazing at the bank. They exchange a glance, and Gale reaches for his door handle. As they burst through the door with a crash, Evelle is gripping a shotgun, while Gale, holding both a shotgun in one hand and Nathan Jr. in his car seat in the other, commands attention. The moment is frozen, as everyone stares at Gale and Evelle. An old hayseed, raising his hands in the air, speaks up, prompting a murmur of acknowledgment from all the people sprawled on the ground. Gale hurriedly tosses a sack to Evelle and stares in shock at the tellers' counter, just as a muffled voice is heard from offscreen. Evelle, briefly abashed, quickly brightens as Gale registers understanding, eliciting another murmur of acknowledgment from the grounded crowd. The camera remains fixed on the roof of the speeding squad car, looking past its flashing gumballs as it races toward the townlet, its siren wailing a piercing cry. A teller is seen completing the task of stuffing the last of two burlap bags; we focus closely on her hands as she inconspicuously slips a cash packet into the bag—a packet concealing a small plastic device wrapped with just a few bills and a sleeve. She discreetly taps a button on the device, setting it ticking before shoving it into the sack. He swiftly snatches the two sacks, tossing one to Gale, who simultaneously picks up the baby as they cautiously back toward the door. With urgency, they bolt through the door, and the siren swells to a loud clamor at the cut. The same fixed shot reappears, capturing them from above the gumballs as they screech away from the bank's facade. With Gale at the wheel, Evelle begins rifling through one of the sacks when a simultaneous realization dawns on both him and Gale. Their eyes meet in mutual understanding, and they twist frantically to peer into the back seat. A sudden bellowing, KA-POP, rings out, followed by a loud, flat crack as something detonates in the front seat, splattering the car's interior with vivid blue paint."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The rumble intensifies until a sudden click halts it. Smalls steps into the doorway of an abandoned trailer, now silent and in disarray from a previous fight, with sunlight streaming through the blinds and cheroot smoke drifting through the air. After briefly surveying the scene, Smalls moves purposefully to a particular spot, nudging debris aside to reveal a piece of paper. As he picks it up, he freezes in surprise upon recognizing it as Gale's picture of the Farmers and Mechanics Bank under the noonday sun.\n\nMeanwhile, Gale and Evelle sit in their idling car, exchanging glances before rushing into the bank—Gale holding a shotgun and Nathan Jr. in his car seat, while Evelle grips another shotgun. Their entrance halts activity as an old hayseed raises his hands and elicits murmurs from those inside. Amidst this, Gale tosses a sack to Evelle, shock crossing his face as he sees the tellers' counter. A muffled voice from offscreen prompts Evelle to brighten with comprehension, echoed by further murmurs from onlookers.\n\nOutside, a squad car approaches the town, its siren piercing the air. Back at the bank, a teller discreetly inserts a ticking device into a burlap sack of cash. Grabbing the sacks, Gale tosses one to Evelle, picks up the baby, and they retreat toward the door, bolting outside as the siren resumes its wail. They drive off, Gale at the wheel, while Evelle rummages through a sack. Suddenly, a simultaneous realization prompts them to check the back seat. As they frantically turn, a loud crack erupts, and the car's interior is splattered with bright blue paint."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The rumble builds louder and louder until it is snapped off by a click. The front door handle clicks open, and Smalls stands in the doorway of the abandoned trailer, which had been deserted ever since the nearby factory shut down, rendering the area almost perfectly quiet. The room is a complete shambles from the fight, with broken furniture and scattered papers, as sunlight filters in between the slats of the venetian blinds. Smoke from Lenny Smalls' cheroot, a type of small cigar favored by those who enjoy a more intense flavor, ripples up through the light. After a momentary pause at the door to take in the scene, Smalls goes directly to a specific spot in the debris—a place previously known to hide important documents—and nudges some of it aside with his toe, exposing a piece of paper. He bends down to pick it up but suddenly freezes with a soft grunt of surprise as he stands up with the piece of paper. It is Gale's detailed sketch of the Farmers and Mechanics Bank, a local financial institution known for its old-fashioned vaults, baking in the noonday sun. Sitting in the front seat of their idling car in the parking lot, looking at the bank, Gale and Evelle, notorious for their ill-planned heists, look at each other. Gale reaches for his door, and as Gale and Evelle bang in through the door, Evelle holds a shotgun, reminiscent of the ones used by old-time outlaws, and Gale holds a shotgun in one hand and Nathan Jr. in his car seat in the other. Everyone freezes, staring at Gale and Evelle. An old hayseed, a term affectionately used in the region for locals accustomed to rural life, with his hands in the air speaks up, and there is a murmur of acknowledgment from all the people on the ground. Gale is tossing Evelle a sack and is looking in shock at the tellers' counter when a muffled voice from offscreen, probably one of the bank staff, is heard. Evelle is momentarily abashed but then brightens as Gale registers understanding. Again, there is a murmur of acknowledgment from all the people on the ground. The camera, perched strategically on the roof of the rocketing squad car, looking past its flashing gumballs—police lights that signal urgency—as the car approaches the townlet, its siren wailing like an alarm for the sleepy residents. A teller is finishing stuffing the last of two burlap bags, often used for their durability in transporting goods, and close on her hands, we see her putting in a cash packet that is really only a few bills and a sleeve surrounding and hiding a small plastic device, a dye pack designed to mark stolen money. The teller hits a button on the device and it starts ticking; she shoves it into the sack. He is grabbing the two sacks and tosses one to Gale, who also picks up the baby as the two are backing toward the door. They bolt out the door, and the siren jumps in loud at the cut. It is the same locked-down shot over the gumballs as they peel out from in front of the bank. Gale is driving, and Evelle starts pawing through one of the sacks when a thought registers simultaneously with Gale and Evelle as they recall the security measures employed by the bank. They look at each other, and they both twist frantically to look in the back seat. Bellowing, KA-POP! With a loud flat crack, something detonates in the front seat, and the interior of the car is spattered with bright blue paint from the dye pack, marking their haul as stolen."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Gale is tossing Evelle a sack and is looking in shock at the tellers' counter The rumble builds louder and louder until it is snapped off by a click Sitting in the front seat of their idling car looking at the bank The front door handle clicks open and Smalls stands in the doorway of the abandoned trailer which is perfectly quiet The room is a complete shambles from the fight as sunlight filters in between the slats of the venetian blinds Smoke from Lenny Smalls' cheroot ripples up through the light we see her putting in a cash packet that is really only a few bills and a sleeve surrounding and hiding a small plastic device After a momentary pause at the door to take in the scene Smalls goes directly to a specific spot in the debris and nudges some of it aside with his toe exposing a piece of paper He bends down to pick it up but suddenly freezes with a soft grunt of surprise as he stands up with the piece of paper The front door handle clicks open and Smalls stands in the doorway of the abandoned trailer which is perfectly quiet It is Gale's picture of the Farmers and Mechanics Bank baking in the noonday sun Sitting in the front seat of their idling car looking at the bank Gale and Evelle look at each other It is the same lockeddown shot over the gumballs as they peel out from in front of the bank Gale reaches for his door and as Gale and Evelle bang in through the door Evelle holds a shotgun and Gale holds a shotgun in one hand and Nathan Jr in his car seat in the other The teller hits a button on the device and it starts ticking Everyone freezes staring at Gale and Evelle Smoke from Lenny as the car approaches the townlet its siren wailing The rumble builds louder and louder until it is snapped off by a click An old hayseed with his hands in the air speaks up and there is a murmur of acknowledgment from all the people on the ground Gale is tossing Evelle a sack and is looking in shock at the tellers' counter when a muffled voice from offscreen is heard Evelle is momentarily abashed but then brightens as Gale registers understanding Again there is a murmur of acknowledgment from all the people on the ground The camera is locked down on the roof of the rocketing squad car looking past its flashing gumballs as the car approaches the townlet its siren wailing A teller is finishing stuffing the last of two burlap bags and close on her hands we see her putting in a cash packet that is really only a few bills and a sleeve surrounding and hiding a small plastic device Bellowing KAPOP The camera is locked down on the roof of the rocketing squad car looking past its flashing gumballs The teller hits a button on the device and it starts ticking she shoves it into the sack He is grabbing the two sacks and tosses one to Gale who also picks up the baby as the two are backing toward the door They bolt out the door and the siren jumps in loud at the cut It is the same lockeddown shot over the gumballs as they peel out from in front of the bank Gale is driving and Evelle starts pawing through one of the sacks when a thought registers with Gale and Evelle at the same moment They look at each other and they both twist frantically to look in the back seat The room is a complete shambles from the fight as sunlight filters in between the slats of the venetian blinds Smalls' cheroot ripples up through the light He is grabbing the two sacks and tosses one to Gale who also picks up the baby as the two are backing toward the door Bellowing KAPOP They look at each other and they both twist frantically to look in the back seat It is Gale's picture of the Farmers and Mechanics Bank baking in the noonday sun With a loud flat crack something detonates in the front seat and the interior of the car is spattered with bright blue paint"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The rumble builds louder and louder until it is snapped off by a click. The front door handle clicks open and Smalls stands in the doorway of the abandoned trailer which is perfectly quiet. The room is a complete shambles from the fight as sunlight filters in between the slats of the venetian blinds. Smoke from Lenny. Smalls' cheroot ripples up through the light. After a momentary pause at the door to take in the scene Smalls goes directly to a specific spot in the debris and nudges some of it aside with his toe exposing a piece of paper. He bends down to pick it up but suddenly freezes with a soft grunt of surprise as he stands up with the piece of paper. It is Gale's picture of the Farmers and Mechanics Bank baking in the noonday sun. Sitting in the front seat of their idling car looking at the bank. Gale and Evelle look at each other. Gale reaches for his door and as Gale and Evelle bang in through the door Evelle holds a shotgun and Gale holds a shotgun in one hand and Nathan Jr in his car seat in the other. Everyone freezes staring at Gale and Evelle. An old hayseed with his hands in the air speaks up and there is a murmur of acknowledgment from all the people on the ground. Gale is tossing Evelle a sack and is looking in shock at the tellers' counter. when a muffled voice from offscreen is heard. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Evelle is momentarily abashed but then brightens as Gale registers understanding. Again there is a murmur of acknowledgment from all the people on the ground. The camera is locked down on the roof of the rocketing squad car looking past its flashing gumballs. as the car approaches the townlet its siren wailing. A teller is finishing stuffing the last of two burlap bags and close on her hands. we see her putting in a cash packet that is really only a few bills and a sleeve surrounding and hiding a small plastic device. The teller hits a button on the device and it starts ticking. she shoves it into the sack. He is grabbing the two sacks and tosses one to Gale who also picks up the baby as the two are backing toward the door. They bolt out the door and the siren jumps in loud at the cut. It is the same lockeddown shot over the gumballs as they peel out from in front of the bank. Gale is driving and Evelle starts pawing through one of the sacks. when a thought registers with Gale and Evelle at the same moment. They look at each other and they both twist frantically to look in the back seat. Bellowing KAPOP. With a loud flat crack something detonates in the front seat and the interior of the car is spattered with bright blue paint."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The rumble builds louder and louder until it is snapped off by a click. The front door handle clicks open and Smalls stands in the doorway of the abandoned trailer which is perfectly quiet. The room is a complete shambles from the fight as sunlight filters in between the slats of the venetian blinds. Smoke from Lenny. Smalls' cheroot ripples up through the light. After a momentary pause at the door to take in the scene Smalls goes directly to a specific spot in the debris and nudges some of it aside with his toe exposing a piece of paper. He bends down to pick it up but suddenly freezes with a soft grunt of surprise as he stands up with the piece of paper. It is Gale's picture of the Farmers and Mechanics Bank baking in the noonday sun. Sitting in the front seat of their idling car looking at the bank. Gale and Evelle look at each other. Gale reaches for his door and as Gale and Evelle bang in through the door Evelle holds a shotgun and Gale holds a shotgun in one hand and Nathan Jr in his car seat in the other. Everyone freezes staring at Gale and Evelle. An old hayseed with his hands in the air speaks up and there is a murmur of acknowledgment from all the people on the ground. Gale is tossing Evelle a sack and is looking in shock at the tellers' counter. when a muffled voice from offscreen is heard. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Evelle is momentarily abashed but then brightens as Gale registers understanding. Again there is a murmur of acknowledgment from all the people on the ground. The camera is locked down on the roof of the rocketing squad car looking past its flashing gumballs. as the car approaches the townlet its siren wailing. A teller is finishing stuffing the last of two burlap bags and close on her hands. we see her putting in a cash packet that is really only a few bills and a sleeve surrounding and hiding a small plastic device. The teller hits a button on the device and it starts ticking. she shoves it into the sack. He is grabbing the two sacks and tosses one to Gale who also picks up the baby as the two are backing toward the door. They bolt out the door and the siren jumps in loud at the cut. It is the same lockeddown shot over the gumballs as they peel out from in front of the bank. Gale is driving and Evelle starts pawing through one of the sacks. when a thought registers with Gale and Evelle at the same moment. They look at each other and they both twist frantically to look in the back seat. Bellowing KAPOP. With a loud flat crack something detonates in the front seat and the interior of the car is spattered with bright blue paint."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The rumble builds louder and louder until it is snapped off by a click. The front door handle clicks open and Smalls stands in the doorway of the abandoned trailer which is perfectly quiet. The room is a complete shambles from the fight as sunlight filters in between the slats of the venetian blinds. Smoke from Lenny. Smalls' cheroot ripples up through the light. After a momentary pause at the door to take in the scene Smalls goes directly to a specific spot in the debris and nudges some of it aside with his toe exposing a piece of paper. He bends down to pick it up but suddenly freezes with a soft grunt of surprise as he stands up with the piece of paper. It is Gale's picture of the Farmers and Mechanics Bank baking in the noonday sun. He is grabbing the two sacks and tosses one to Gale who also picks up the baby as the two are backing toward the door. They bolt out the door and the siren jumps in loud at the cut. It is the same lockeddown shot over the gumballs as they peel out from in front of the bank. Gale is driving and Evelle starts pawing through one of the sacks. when a thought registers with Gale and Evelle at the same moment. They look at each other and they both twist frantically to look in the back seat. Bellowing KAPOP. With a loud flat crack something detonates in the front seat and the interior of the car is spattered with bright blue paint."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The rumble builds louder and louder until it is snapped off by a click. The front door handle clicks open and Smalls stands in the doorway of the abandoned trailer which is perfectly quiet. The room is a complete shambles from the fight as sunlight filters in between the slats of the venetian blinds. when a thought registers with Gale and Evelle at the same moment. They look at each other and they both twist frantically to look in the back seat. Bellowing KAPOP. With a loud flat crack something detonates in the front seat and the interior of the car is spattered with bright blue paint."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The rumble builds louder and louder until it is snapped off by a click. The front door handle clicks open, and a giraffe stands in the doorway of the abandoned trailer, which is perfectly quiet. The room is a complete shambles from the fight, as sunlight filters in between the slats of the venetian blinds. Smoke from Winston the penguin's cheroot ripples up through the light. After a momentary pause at the door to take in the scene, the giraffe goes directly to a specific spot in the debris and nudges some of it aside with its hoof, exposing a piece of paper. The giraffe bends down to pick it up but suddenly freezes with a soft grunt of surprise as it stands up with the piece of paper. It is Tina's picture of the Farmers and Mechanics Bank, baking in the noonday sun. Sitting in the front seat of their idling car, looking at the bank, Tina and Olaf look at each other. Tina reaches for her door, and as Tina and Olaf bang in through the door, Olaf holds a shotgun, and Tina holds a shotgun in one hand and Nathan Jr. in his car seat in the other. Everyone freezes, staring at Tina and Olaf. A raccoon with its hands in the air speaks up, and there is a murmur of acknowledgment from all the people on the ground. Tina is tossing Olaf a sack and is looking in shock at the tellers' counter when a muffled voice from offscreen is heard. Olaf is momentarily abashed but then brightens as Tina registers understanding. Again, there is a murmur of acknowledgment from all the people on the ground. The camera is locked down on the roof of the rocketing squad car, looking past its flashing gumballs as the car approaches the townlet, its siren wailing. A koala is finishing stuffing the last of two burlap bags, and close on her hands, we see her putting in a cash packet that is really only a few bills and a sleeve surrounding and hiding a small plastic device. The koala hits a button on the device and it starts ticking; she shoves it into the sack. A platypus is grabbing the two sacks and tosses one to Tina, who also picks up the baby as the two are backing toward the door. They bolt out the door, and the siren jumps in loud at the cut. It is the same locked-down shot over the gumballs as they peel out from in front of the bank. Tina is driving, and Olaf starts pawing through one of the sacks when a thought registers with Tina and Olaf at the same moment. They look at each other, and they both twist frantically to look in the back seat. Bellowing, KA-POP! With a loud flat crack, something detonates in the front seat, and the interior of the car is spattered with bright blue paint."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The rumble builds louder and louder until it is snapped off by a click. The front gate handle clicks open, and Smalls stands in the doorway of the deserted cabin, which is perfectly quiet. The room is a complete shambles from the fight, as moonlight filters in between the slats of the wooden shutters. Dust from Lenny Smalls' cigar ripples up through the light. After a momentary pause at the door to take in the scene, Smalls goes directly to a specific spot in the debris and nudges some of it aside with his toe, exposing a magazine. He bends down to pick it up but suddenly freezes with a soft grunt of surprise as he stands up with the magazine. It is Gale's drawing of the Orchard and Vineyard Bank, baking in the afternoon heat. Sitting in the front seat of their idling van, looking at the bank, Gale and Evelle look at each other. Gale reaches for his door, and as Gale and Evelle bang in through the door, Evelle holds a baseball bat, and Gale holds a baseball bat in one hand and Nathan Jr. in his stroller in the other. Everyone freezes, staring at Gale and Evelle. An old farmer with his hands in the air speaks up, and there is a murmur of acknowledgment from all the people on the floor. Gale is tossing Evelle a backpack and is looking in shock at the clerks' desk when a muffled voice from offscreen is heard. Evelle is momentarily abashed but then brightens as Gale registers understanding. Again, there is a murmur of acknowledgment from all the people on the floor. The camera is locked down on the roof of the rocketing fire truck, looking past its flashing lanterns as the vehicle approaches the village, its horn blaring. A clerk is finishing stuffing the last of two canvas bags, and close on her hands, we see her putting in a coin pouch that is really only a few coins and a wrapper surrounding and hiding a small metal gadget. The clerk hits a button on the gadget and it starts ticking; she shoves it into the backpack. He is grabbing the two backpacks and tosses one to Gale, who also picks up the baby as the two are backing toward the door. They bolt out the door, and the horn jumps in loud at the cut. It is the same locked-down shot over the lanterns as they peel out from in front of the bank. Gale is driving, and Evelle starts pawing through one of the backpacks when a thought registers with Gale and Evelle at the same moment. They look at each other, and they both twist frantically to look in the back seat. Bellowing, KA-POP! With a loud flat crack, something detonates in the front seat, and the interior of the van is spattered with bright red paint."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The rumble fades softer and softer until it is switched off by a snap. The front door handle creaks closed, and Smalls sits in the doorway of the abandoned trailer, which is perfectly silent. The room is a complete order from the fight, as sunlight shimmers in between the slats of the venetian blinds. Smoke from Lenny Smalls' cheroot coils around through the light. After a momentary pause at the door to observe the scene, Smalls moves indirectly to a random spot in the debris and kicks some of it aside with his toe, covering a piece of paper. He straightens up to overlook it but suddenly leaps with a soft grunt of surprise as he crouches down with the piece of paper. It is Gale's picture of the Farmers and Mechanics Bank, freezing in the noonday sun. Sitting in the front seat of their stalled car, gazing at the bank, Gale and Evelle nod at each other. Gale closes his door, and as Gale and Evelle slide out through the door, Evelle drops a shotgun, and Gale balances a shotgun in one hand and Nathan Jr. in his car seat in the other. Everyone relaxes, whispering at Gale and Evelle. An old hayseed with his hands in the air stays silent, and there is a murmur of silence from all the people on the ground. Gale is catching Evelle a sack and is staring in shock at the tellers' counter when a muffled voice from offscreen is ignored. Evelle is momentarily embarrassed but then frowns as Gale registers confusion. Again, there is a murmur of silence from all the people on the ground. The camera is zoomed in on the roof of the parked squad car, looking past its flashing gumballs as the car departs from the townlet, its siren silent. A teller is dropping the last of two burlap bags, and close on her hands, we see her removing a cash packet that is really only a few bills and a sleeve surrounding and hiding a small plastic device. The teller spins a dial on the device and it stops ticking; she pulls it into the sack. He is holding the two sacks and tosses one to Gale, who also drops the baby as the two are running toward the door. They slide in through the door, and the siren fades out loud at the cut. It is the same zoomed-in shot over the gumballs as they drive away from in front of the bank. Gale is parking, and Evelle stops pawing through one of the sacks when a thought disappears from Gale and Evelle at the same moment. They shake their heads at each other, and they both lean calmly to look in the back seat. Whispering, KA-POP! With a soft gentle hum, something whispers in the front seat, and the interior of the car is splattered with vibrant blue paint."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The whisper swells softer and softer until it is snapped off by a beep. The garden gate latch beeps open, and Pebbles stands in the archway of the bustling spaceship, which is perfectly noisy. The hallway is a complete sanctuary from the dance, as moonlight filters in between the slats of the metal shutters. Mist from Bonnie Pebbles' cigar ripples down through the shadow. After a momentary pause at the archway to take in the drama, Pebbles goes directly to a random spot in the clutter and nudges some of it aside with his elbow, exposing a can of beans. He leans down to pick it up but suddenly freezes with a soft grunt of surprise as he stands up with the can of beans. It is Chuck's drawing of the Teachers and Students Observatory, shimmering in the midnight rain. Sitting in the back seat of their parked bike, looking at the observatory, Chuck and Merv look at each other. Chuck reaches for his window, and as Chuck and Merv smash through the window, Merv holds a flashlight, and Chuck holds a flashlight in one hand and Dustin Jr. in his highchair in the other. Everyone unfreezes, staring at Chuck and Merv. A young city dweller with his feet in the air speaks up, and there is a murmur of disagreement from all the creatures on the ceiling. Chuck is tossing Merv a book and is looking in amazement at the managers' desk when a clear voice from onscreen is heard. Merv is momentarily embarrassed but then darkens as Chuck registers confusion. Again, there is a murmur of disagreement from all the creatures on the ceiling. The camera is floating up on the ground of the hovering police van, looking past its glowing headlights as the van approaches the metropolis, its horn blaring. A manager is starting to empty the first of four leather purses, and close on his feet, we see him taking out a coin clip that is really only a stack of tokens and a ribbon wrapping and shielding a large wooden artifact. The manager taps a switch on the artifact and it starts humming; he drags it into the book. She is dropping the four books and tosses one to Chuck, who also picks up the toddler as the four are retreating toward the window. They sneak out the window, and the horn fades out quiet at the fade. It is the same floating-up shot over the headlights as they glide away from in front of the observatory. Chuck is leaping, and Merv starts digging through one of the books when a dream registers with Chuck and Merv at the same moment. They glance at each other, and they both leap frantically to glance in the front seat. Whispering, ZIP-ZAP! With a loud booming crack, something fizzes in the back seat, and the exterior of the van is splattered with deep red ink."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The cacophony swells louder and louder until it is silenced by a snap. The back window latch swings open, and Jasper lounges in the frame of the deserted cabin, which is completely still. The hallway is an utter mess from the frenzy, as moonlight streams in between the slats of the venetian blinds. Steam from Lenny Jasper’s cigar twists up through the light. After a fleeting hesitation at the entrance to absorb the chaos, Jasper wanders directly to a precise spot in the wreckage and kicks some of it aside with his heel, revealing a piece of cloth. He stoops down to lift it up but suddenly pauses with a soft gasp of revelation as he rises with the piece of cloth. It is Dale's sketch of the Farmers and Mechanics Post Office, basking in the afternoon shade. Sitting in the back seat of their parked truck, facing the post office, Dale and Yvette glance at one another. Dale reaches for his handle, and as Dale and Yvette smash in through the portal, Yvette brandishes a hammer, and Dale clutches a hammer in one hand and Nathan Jr. in his crib in the other. Everyone pauses, gazing at Dale and Yvette. An aged rancher with his arms raised chimes in, and there is a murmur of recognition from all the individuals on the floor. Dale is tossing Yvette a bag and is staring in disbelief at the clerks' desk when a muffled voice from offscreen is heard. Yvette is briefly flustered but then beams as Dale signals comprehension. Once more, there is a murmur of recognition from all the individuals on the floor. The camera is fixed on the rooftop of the speeding pickup, looking past its rotating sirens as the vehicle nears the hamlet, its horn blaring. A clerk is completing filling the last of two canvas sacks, and close on her hands, we see her placing in a stack of papers that is really only a few drafts and a sleeve surrounding and concealing a tiny metallic gadget. The clerk presses a switch on the gadget and it begins beeping; she pushes it into the sack. He is clutching the two sacks and flings one to Dale, who also retrieves the infant as the duo are retreating toward the portal. They dash out the portal, and the horn blares loudly at the transition. It is the same fixed shot over the sirens as they speed away from in front of the post office. Dale is steering, and Yvette starts rifling through one of the sacks when an idea hits Dale and Yvette concurrently. They glance at each other, and both pivot frantically to inspect the rear seat. Roaring, KA-POP! With a sharp popping sound, something bursts in the front seat, and the inside of the truck is splattered with bright red paint."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The whisper grows softer and softer until it is silenced by a jingle. The closet knob jingles open, and Smalls stands in the gateway of the deserted carnival, which is utterly still. The yard is a chaotic whirlwind from the chase, as moonlight trickles in between the gaps of the wooden shutters. Mist from Lenny Smalls' cigar floats down through the shadow. After a fleeting stillness at the gateway to absorb the scene, Smalls skips to a certain patch in the clutter and brushes some of it aside with his elbow, uncovering a slice of bread. He kneels down to lift it up but suddenly pauses with a quiet sigh of astonishment as he straightens up with the slice of bread. It is Gale's sketch of the Butchers and Bakers Shop, melting in the morning drizzle. Sitting in the back seat of their parked bike, gazing at the shop, Gale and Evelle glance at each other. Gale reaches for his window, and as Gale and Evelle slide through the window, Evelle holds a broom, and Gale holds a broom in one hand and Nathan Jr. in his pram in the other. Everyone pauses, gazing at Gale and Evelle. An old timer with his feet in the air pipes up, and there is a rustle of agreement from all the people around. Gale is flipping Evelle a backpack and is staring in awe at the florists' counter when a muffled whisper from offscreen is overheard. Evelle is briefly flustered but then beams as Gale comprehends. Again, there is a rustle of agreement from all the people around. The camera is fastened to the wing of the soaring helicopter, looking past its rotating pinwheels as it approaches the village, its horn blaring. A florist is finishing packing the last of two paper bags, and close on her fingers, we observe her placing in a coin roll that is really only a few coins and a wrapper concealing a tiny metal object. The florist presses a switch on the object, and it starts vibrating; she slides it into the backpack. He is clutching the two backpacks and flings one to Gale, who also grabs the stroller as the two are inching toward the window. They leap through the window, and the horn bursts loudly at the cut. It is the same fastened shot over the pinwheels as they dash out from in front of the shop. Gale is pedaling, and Evelle starts rifling through one of the backpacks when an idea hits Gale and Evelle at the same instant. They glance at each other, and they both swivel eagerly to peer in the trunk. Barking, WHAM! With a sharp dull thud, something pops in the back seat, and the inside of the bike is splattered with bright pink ink."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The clattering echoes softer and softer until it is flicked away by a snap. The gate latch flips shut, and Tiny perches at the threshold of the haunted cottage, which is perfectly lively. The corridor is a complete masterpiece from the gathering, as moonlight drifts in between the gaps of the wooden shutters. Mist from Benny Tiny’s cigar wafts down through the shadow. After a quick skip at the archway to take in the atmosphere, Tiny skips directly to a random area in the clutter and kicks some of it aside with his heel, revealing a slice of toast. He crouches down to lift it but suddenly halts with a loud whoop of delight as he rises with the slice of toast. It is Dale’s portrait of the Bakers and Crafters Shop, simmering in the midnight fog. Standing in the back booth of their parked tractor, gazing at the shop, Dale and Neville glance at one another. Dale reaches for his handle, and as Dale and Neville slam out through the gate, Neville grips a slingshot, and Dale clutches a slingshot in one hand and Lucas Jr. in his buggy in the other. Everybody thaws, ogling at Dale and Neville. A young city slicker with her feet in the dust pipes up, and there is a chorus of disbelief from all the animals on the roof. Dale is handing Neville a pillow and is peering in amazement at the bakers’ stand when an echoing word from the attic is perceived. Neville is briefly stunned but then shines as Dale notes comprehension. Once more, there is a chorus of disbelief from all the animals on the roof. The camera is unchained on the base of the soaring tricycle, gazing past its glowing headlights as the tricycle retreats from the hamlet, its siren whispering. A baker is beginning filling the first of three woolen hats, and near on her feet, we see her inserting a fruit roll-up that is truly many coins and a wrapper hiding and revealing a large wooden cube. The baker pushes a knob on the cube, and it stops beeping; she tucks it into the pillow. He is catching the three pillows and hurls one to Dale, who also lifts the toddler as the trio is rushing away from the gate. They drift into the gate, and the siren whispers softly at the scene. It is the different unchained shot under the headlights as they zoom in from behind the shop. Dale is napping, and Neville starts scratching through one of the pillows when a memory registers with Dale and Neville at the same moment. They shrug at one another, and they both reach eagerly to glance in the front booth. Whispering, BANG! With a soft round pop, something burst open in the back booth, and the exterior of the tricycle is drizzled with bright red syrup."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Smalls enters an abandoned trailer disrupted from a fight, smoke wafting from his cheroot, and uncovers a piece of paper showing Gale's picture of the Farmers and Mechanics Bank. Meanwhile, Gale and Evelle, armed with shotguns and carrying Nathan Jr. in a car seat, storm into a bank, causing everyone to freeze. An old hayseed raises his hands, and Gale tosses Evelle a sack. Amid murmurs, a teller discreetly hides a ticking device within a cash packet. Gale and Evelle grab the sacks and baby, escaping as the sirens blare. Driving away, they realize something's wrong, but before they can react, a loud pop erupts, covering their car's interior in blue paint."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "With a loud flat crack something detonates in the front seat and the interior of the car is spattered with bright blue paint Bellowing KAPOP They look at each other and they both twist frantically to look in the back seat when a thought registers with Gale and Evelle at the same moment Gale is driving and Evelle starts pawing through one of the sacks It is the same lockeddown shot over the gumballs as they peel out from in front of the bank They bolt out the door and the siren jumps in loud at the cut He is grabbing the two sacks and tosses one to Gale who also picks up the baby as the two are backing toward the door she shoves it into the sack The teller hits a button on the device and it starts ticking we see her putting in a cash packet that is really only a few bills and a sleeve surrounding and hiding a small plastic device A teller is finishing stuffing the last of two burlap bags and close on her hands as the car approaches the townlet its siren wailing The camera is locked down on the roof of the rocketing squad car looking past its flashing gumballs Again there is a murmur of acknowledgment from all the people on the ground Evelle is momentarily abashed but then brightens as Gale registers understanding when a muffled voice from offscreen is heard Gale is tossing Evelle a sack and is looking in shock at the tellers' counter An old hayseed with his hands in the air speaks up and there is a murmur of acknowledgment from all the people on the ground Everyone freezes staring at Gale and Evelle Gale reaches for his door and as Gale and Evelle bang in through the door Evelle holds a shotgun and Gale holds a shotgun in one hand and Nathan Jr in his car seat in the other Gale and Evelle look at each other Sitting in the front seat of their idling car looking at the bank It is Gale's picture of the Farmers and Mechanics Bank baking in the noonday sun He bends down to pick it up but suddenly freezes with a soft grunt of surprise as he stands up with the piece of paper After a momentary pause at the door to take in the scene Smalls goes directly to a specific spot in the debris and nudges some of it aside with his toe exposing a piece of paper Smalls' cheroot ripples up through the light Smoke from Lenny The room is a complete shambles from the fight as sunlight filters in between the slats of the venetian blinds The front door handle clicks open and Smalls stands in the doorway of the abandoned trailer which is perfectly quiet The rumble builds louder and louder until it is snapped off by a click"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "A teller is finishing stuffing the last of two burlap bags and close on her hands when a muffled voice from offscreen is heard Gale reaches for his door and as Gale and Evelle bang in through the door Evelle holds a shotgun and Gale holds a shotgun in one hand and Nathan Jr in his car seat in the other They bolt out the door and the siren jumps in loud at the cut when a thought registers with Gale and Evelle at the same moment He bends down to pick it up but suddenly freezes with a soft grunt of surprise as he stands up with the piece of paper After a momentary pause at the door to take in the scene Smalls goes directly to a specific spot in the debris and nudges some of it aside with his toe exposing a piece of paper An old hayseed with his hands in the air speaks up and there is a murmur of acknowledgment from all the people on the ground Everyone freezes staring at Gale and Evelle Evelle is momentarily abashed but then brightens as Gale registers understanding Gale and Evelle look at each other Gale is driving and Evelle starts pawing through one of the sacks With a loud flat crack something detonates in the front seat and the interior of the car is spattered with bright blue paint she shoves it into the sack Again there is a murmur of acknowledgment from all the people on the ground They look at each other and they both twist frantically to look in the back seat The front door handle clicks open and Smalls stands in the doorway of the abandoned trailer which is perfectly quiet Gale is tossing Evelle a sack and is looking in shock at the tellers' counter as the car approaches the townlet its siren wailing The room is a complete shambles from the fight as sunlight filters in between the slats of the venetian blinds The camera is locked down on the roof of the rocketing squad car looking past its flashing gumballs The teller hits a button on the device and it starts ticking Bellowing KAPOP Smalls' cheroot ripples up through the light It is the same lockeddown shot over the gumballs as they peel out from in front of the bank It is Gale's picture of the Farmers and Mechanics Bank baking in the noonday sun Sitting in the front seat of their idling car looking at the bank He is grabbing the two sacks and tosses one to Gale who also picks up the baby as the two are backing toward the door The rumble builds louder and louder until it is snapped off by a click Smoke from Lenny we see her putting in a cash packet that is really only a few bills and a sleeve surrounding and hiding a small plastic device"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Again there is a murmur of acknowledgment from all the people on the ground The camera is locked down on the roof of the rocketing squad car looking past its flashing gumballs as the car approaches the townlet its siren wailing A teller is finishing stuffing the last of two burlap bags and close on her hands we see her putting in a cash packet that is really only a few bills and a sleeve surrounding and hiding a small plastic device The teller hits a button on the device and it starts ticking she shoves it into the sack He is grabbing the two sacks and tosses one to Gale who also picks up the baby as the two are backing toward the door They bolt out the door and the siren jumps in loud at the cut It is the same lockeddown shot over the gumballs as they peel out from in front of the bank Gale is driving and Evelle starts pawing through one of the sacks when a thought registers with Gale and Evelle at the same moment They look at each other and they both twist frantically to look in the back seat Bellowing KAPOP With a loud flat crack something detonates in the front seat and the interior of the car is spattered with bright blue paint The rumble builds louder and louder until it is snapped off by a click The front door handle clicks open and Smalls stands in the doorway of the abandoned trailer which is perfectly quiet The room is a complete shambles from the fight as sunlight filters in between the slats of the venetian blinds Smoke from Lenny Smalls' cheroot ripples up through the light After a momentary pause at the door to take in the scene Smalls goes directly to a specific spot in the debris and nudges some of it aside with his toe exposing a piece of paper He bends down to pick it up but suddenly freezes with a soft grunt of surprise as he stands up with the piece of paper It is Gale's picture of the Farmers and Mechanics Bank baking in the noonday sun Sitting in the front seat of their idling car looking at the bank Gale and Evelle look at each other Gale reaches for his door and as Gale and Evelle bang in through the door Evelle holds a shotgun and Gale holds a shotgun in one hand and Nathan Jr in his car seat in the other Everyone freezes staring at Gale and Evelle An old hayseed with his hands in the air speaks up and there is a murmur of acknowledgment from all the people on the ground Gale is tossing Evelle a sack and is looking in shock at the tellers' counter when a muffled voice from offscreen is heard Evelle is momentarily abashed but then brightens as Gale registers understanding"
        }
      ]
    }
  ]
}