{
  "ground_truth": "As she runs for the back door and pushes through it, and as he slaloms through the wildly scattering hayseeds, Lenny bursts out. With a whipcrack effect, he looks left, then right, and jerks the bike right to where an alleyway flanks the side of the bank. Ed is running up the alley toward the front of the bank as Lenny enters, and he roars after her, roaring down the alley as the bike approaches behind her. Closing on Ed as she reaches the mouth of the alley, a plank swings into frame straight at the camera, matching action as Hi finishes swinging the plank into Lenny's face. Lenny hits the ground hard as his bike spins out from under him, riderless, twisting crazily into the street where it collapses. Lenny is rising to his feet beyond them as Hi nods encouragement to Ed, and Lenny is reaching back to throw his knife. Hi, unaware, is turning to face him, presenting the plank as the knife is thrown, and it thunks into the plank, piercing it through. Hi backs up, swinging the knife-studded plank to make Lenny keep his distance as he reaches up to unhook a chain from a ring on his vest shoulder, and the free chain drops down into his palm. Swinging the chain, WHOOSH WHOOSH, at the backpedaling Hi, the chain snakes around it and rips it out of Hi's hands. Grabbing Hi by the shirtfront, Lenny swings down and brass knuckles appear on it, as Lenny's fist swings into frame to club him forehand, then backhand. An uppercut from his heels sends Hi sprawling back as Hi lands against it, banging his head, and he sinks to the ground. Lenny is casually walking toward him, lighting a cheroot, as Hi flops over onto his stomach and starts wriggling under the car. Hi's face in the foreground as he desperately seeks escape, behind him we can see Lenny casually reaching down and grabbing an ankle. The shot is framed identically to the shot in the Arizona nursery where Hi pulled a baby from under the crib, and Lenny pulls. Hi is dragged away from the camera and out from under the car, struggling to stand up. Lenny wraps his arms around him and applies a tremendous bear hug, crushed against Lenny, his hands paw futilely at Lenny's chest. Lenny finally flings Hi away, landing in the dust, all the fight beaten out of him, tired of the fight: he saws out both shotguns. On the guns as Lenny's thumbs draw them back, he raises the guns to fire, the end of the road, he wearily lifts a hand, defensively extending it in front of him, then stops, staring at.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "As she dashes for the rear entrance and shoves through it, and as he weaves through the frantically dispersing hayseeds, Lenny erupts out. With a whipcrack effect, he glances left, then right, and yanks the bicycle right to where a passageway borders the side of the bank. Ed is sprinting up the passage toward the front of the bank as Lenny enters, and he bellows after her, roaring down the passage as the bicycle nears behind her. Closing on Ed as she arrives at the mouth of the passage, a board swings into view directly at the camera, matching action as Hi completes swinging the board into Lenny's visage. Lenny strikes the ground hard as his bicycle spins out from beneath him, riderless, spiraling wildly into the avenue where it collapses. Lenny is rising to his feet beyond them as Hi nods encouragement to Ed, and Lenny is reaching back to hurl his dagger. Hi, unaware, is turning to confront him, presenting the board as the dagger is thrown, and it thuds into the board, penetrating it through. Hi retreats, swinging the dagger-studded board to make Lenny keep his distance as he reaches up to detach a chain from a ring on his vest shoulder, and the free chain descends into his palm. Swinging the chain, WHOOSH WHOOSH, at the retreating Hi, the chain coils around it and wrenches it out of Hi's hands. Grabbing Hi by the shirtfront, Lenny swings down and brass knuckles appear on it, as Lenny's fist swings into view to club him forehand, then backhand. An uppercut from his heels sends Hi sprawling back as Hi lands against it, striking his head, and he sinks to the ground. Lenny is casually strolling toward him, lighting a cheroot, as Hi flops over onto his stomach and starts wriggling under the automobile. Hi's visage in the foreground as he desperately seeks escape, behind him we can see Lenny casually reaching down and grabbing an ankle. The shot is framed identically to the shot in the Arizona nursery where Hi pulled an infant from under the crib, and Lenny pulls. Hi is dragged away from the camera and out from under the automobile, struggling to stand up. Lenny wraps his arms around him and applies a tremendous bear embrace, crushed against Lenny, his hands paw futilely at Lenny's chest. Lenny finally flings Hi away, landing in the dust, all the fight beaten out of him, tired of the fight: he saws out both shotguns. On the firearms as Lenny's thumbs draw them back, he raises the firearms to fire, the end of the road, he wearily lifts a hand, defensively extending it in front of him, then stops, staring at."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "As the back door is run for and pushed through by her, and as the wildly scattering hayseeds are slalomed through by him, Lenny is bursting out. With a whipcrack effect, left and right are looked at by him, and the bike is jerked by him right to where the bank is flanked by an alleyway. Ed runs up the alley toward the front of the bank as it is entered by Lenny, and after her he roars, the bike roaring down the alley as she is approached from behind by it. As Ed reaches the mouth of the alley, the closing Lenny is swung at by a plank into frame straight at the camera, the action matched as the plank is swung by Hi into Lenny's face. The ground is hit hard by Lenny as his bike, riderless, spins out from under him, twisting crazily into the street where it collapses. Lenny rises to his feet beyond them as encouragement is nodded to Ed by Hi, and a knife is reached for by Lenny. Hi, unaware, turns to face him, the plank presented as the knife is thrown, thunking into the plank, piercing it through. Hi swings the knife-studded plank to keep Lenny at a distance while a chain is unhooked from a ring on his vest shoulder, and the free chain drops into his palm. The chain is swung by Lenny, WHOOSH WHOOSH, at the backpedaling Hi, who has the chain snake around and rip it out of his hands. Hi is grabbed by the shirtfront by Lenny, and as he swings down, brass knuckles appear on his fist as it swings into frame to club Hi forehand, then backhand. An uppercut sends Hi sprawling back as his head bangs against it, and to the ground he sinks. As Hi flops over onto his stomach and starts wriggling under the car, Lenny casually walks toward him, lighting a cheroot. Hi's face is desperately seeking escape in the foreground, and behind him, Lenny casually reaches down and grabs an ankle. The shot is framed identically to the shot in the Arizona nursery where Hi pulled a baby from under the crib, and Hi is pulled by Lenny. Away from the camera and out from under the car, Hi is dragged, struggling to stand up. Lenny wraps his arms around him and applies a tremendous bear hug, and against Lenny, Hi is crushed, his hands pawing futilely at Lenny's chest. Hi is finally flung away by Lenny, landing in the dust, all the fight beaten out of him, tired of the fight: both shotguns are sawed out by him. On the guns, the thumbs draw them back, and the guns are raised by him to fire, the end of the road, and he lifts a hand wearily, extending it defensively in front of him, then stops, staring at."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "As she dashes through the back door and he maneuvers around scattering hayseeds, Lenny bursts out. Spotting an alley beside the bank, he jerks the bike right. Ed is running up the alley as Lenny follows, roaring toward her. At the alley's mouth, Hi swings a plank into Lenny's face, causing him to fall and his bike to spin into the street. Lenny rises, reaching for his knife, but Hi unknowingly presents the plank, and the knife pierces it. Hi swings the plank to keep Lenny at bay while unhooking a chain from his vest, which Lenny uses to disarm Hi. Seizing Hi's shirt, Lenny uses brass knuckles to club him, sending Hi sprawling. Lenny casually approaches, igniting a cheroot, as Hi tries to escape under a car. As Lenny grabs Hi's ankle, reminiscent of Hi pulling a baby in Arizona, he drags Hi out. Lenny hugs Hi tightly, then flings him away, exhausted. Lenny raises his shotguns, but before firing, stops, contemplating the scene."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "As she dashes through the back door with Lenny in pursuit, Lenny sees the alley beside the bank and turns his bike sharply. Ed runs toward the bank's front as Lenny quickly follows. As Ed nears the alley's end, Hi swings a plank at the camera, hitting Lenny and causing his bike to crash. Lenny rises, throws a knife at the unsuspecting Hi, but it gets stuck in the plank. Hi backs away, swinging the plank to keep Lenny at bay while unhooking a chain from his vest. Lenny's chain disarms Hi, then grabs him, using brass knuckles to beat him until Hi collapses. As Lenny approaches, Hi squirms under a car, but Lenny grabs his ankle, dragging him out like in the Arizona nursery scene. Lenny bear hugs Hi, then throws him aside, exhausted from the fight. Lenny raises his shotguns to fire, while Hi defensively lifts his hand, eyes fixed ahead."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As she urgently sprints toward the back door, hastily pushing her way through it, he expertly maneuvers, weaving through the wildly scattering hayseeds. Suddenly, Lenny bursts out into the open. With a whipcrack effect, he quickly glances left and right before making a swift decision to jerk the bike to the right, heading toward an alleyway that runs along the side of the bank. Meanwhile, Ed is already running up the alley toward the bank’s front entrance just as Lenny enters, and he roars after her, the powerful engine roaring loudly as the bike closes in behind her. As Ed approaches the mouth of the alley, a plank suddenly swings into the frame, moving straight towards the camera. The plank’s motion matches as Hi finishes swinging it directly into Lenny’s face. Lenny hits the ground with a hard impact as his bike, now without a rider, spins uncontrollably into the street, twisting wildly before it finally collapses. In the background, Lenny begins to rise to his feet. Hi gives Ed an encouraging nod, unaware that Lenny, now on his feet, is reaching back to unsheathe his knife. Just then, Hi turns to face Lenny, inadvertently presenting the plank as the knife is hurled, embedding itself into the wood with a solid thunk. Hi, realizing the situation, slowly backs up, swinging the knife-pierced plank to maintain distance between himself and Lenny, who is now reaching up to unhook a chain from a ring on his vest’s shoulder, allowing the chain to drop freely into his waiting palm. With a powerful swing and the sound of WHOOSH WHOOSH cutting through the air, Lenny sends the chain snaking around the plank, forcefully ripping it out of Hi's grasp. Lenny, seizing the opportunity, grabs Hi by the shirtfront, revealing brass knuckles as his fist swings into the frame, delivering a harsh forehand blow followed quickly by a backhand. With an upward swing, an uppercut powered from his heels sends Hi sprawling backward until he lands heavily against an object, banging his head, and slowly sinking to the ground. Lenny, with a casual air, strolls towards him while lighting a cheroot, as Hi flops over onto his stomach and desperately starts wriggling under a nearby car, trying to escape. Hi’s face is in the foreground, filled with desperation as he searches for a way out while, behind him, Lenny casually reaches down and grasps an ankle. The shot mirrors the scene in the Arizona nursery where Hi pulled a baby from under the crib, but now Lenny is the one pulling. Hi is dragged away from the camera, out from under the car, as he struggles to stand. Lenny wraps his arms around him, applying a crushing bear hug. Trapped against Lenny, Hi’s hands paw futilely at his chest. Finally, Lenny flings Hi away, sending him sprawling into the dust, all his fight drained, tired of the relentless struggle. In a decisive moment, Lenny saws out both shotguns. Focused on the guns as Lenny’s thumbs pull them back, he raises the weapons to fire, signaling the end of the road. Hi, now weary, lifts a hand, defensively extending it in front of him, then pauses, staring at something."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As she frantically sprints toward the rear entrance, she hastily pushes her way through the door, while he skillfully maneuvers, weaving expertly through the wildly scattering hayseeds. Suddenly, Lenny bursts out into the open space. With a sound like a whipcrack, he rapidly glances left and then right before making a quick decision to sharply jerk the bike to the right, heading decisively toward an alleyway that runs alongside the bank. Meanwhile, Ed is already racing up the alley toward the bank’s front entrance just as Lenny enters, and he roars after her, with the powerful engine roaring loudly as the bike rapidly closes in behind her. As Ed approaches the mouth of the alley, a wooden plank suddenly swings into the frame, moving directly towards the camera. The plank’s motion matches perfectly as Hi finishes executing a swing that lands directly into Lenny’s face. Lenny hits the ground with a loud, hard impact as his bike, now devoid of a rider, spins uncontrollably out into the street, twisting wildly before it finally collapses. In the background, Lenny begins to rise shakily to his feet. Hi gives Ed an encouraging nod, completely unaware that Lenny, now back on his feet, is reaching behind to unsheathe his knife. At that moment, Hi turns to face Lenny, inadvertently presenting the plank as the knife is hurled, embedding itself with a solid thunk into the wood. Hi, realizing the precarious situation, slowly backs away, swinging the knife-pierced plank to keep a safe distance between himself and Lenny, who is now reaching up to unhook a chain from a ring on his vest’s shoulder, letting the chain fall freely into his waiting palm. With a forceful swing and the sound of WHOOSH WHOOSH slicing through the air, Lenny sends the chain snaking around the plank, yanking it out of Hi's grasp. Lenny, seizing the moment, grabs Hi by the shirtfront, revealing brass knuckles as his fist swings into the frame, delivering a harsh forehand blow followed quickly by a backhand. With an upward swing, an uppercut, powered from his heels, sends Hi sprawling backward until he lands heavily against an object, banging his head, and gradually sinking to the ground. Lenny, with a casual air and attitude, strolls towards him while lighting a cheroot, as Hi flops over onto his stomach and desperately starts wriggling under a nearby car, trying to escape. Hi’s face is in the foreground, filled with desperation as he frantically searches for a way out while, behind him, Lenny casually reaches down and grasps an ankle. The shot mirrors the earlier scene in the Arizona nursery where Hi pulled a baby from under the crib, but now it is Lenny who is doing the pulling. Hi is dragged away from the camera, out from under the car, as he struggles to stand up. Lenny wraps his strong arms around him, applying a crushing bear hug. Trapped securely against Lenny, Hi’s hands paw futilely at his chest. Finally, in a moment of sheer power, Lenny flings Hi away, sending him sprawling into the dust, leaving him with all his fight drained, completely tired of the relentless struggle. In a decisive moment, Lenny saws out both shotguns. Focused intently on the guns as Lenny’s thumbs pull them back, he raises the weapons to fire, signaling the end of the road. Hi, now weary and worn, lifts a hand, defensively extending it in front of him, then pauses, intently staring at something."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As she races toward the back door, each footfall quick and purposeful, she pushes through it with a burst of force, allowing the door to swing open wide. Meanwhile, he maneuvers deftly through the scattering hayseeds, zigzagging like a slalom skier to avoid them. At that moment, Lenny bursts out with a sudden surge of energy. With a swift, whipcrack-like motion, he sharply glances to his left, then just as quickly to his right, assessing his surroundings before making a decisive jerk of the bike to the right, aiming it toward an alleyway that runs alongside the bank. Ed, simultaneously, is sprinting up the alley, her feet pounding against the ground as she makes her way to the front of the bank, just as Lenny enters the scene. He roars down the alley with the bike roaring after her, engine revving as he quickly closes the distance to Ed, who is just reaching the opening of the alley. Suddenly, a plank swings into the frame with precise timing, lining up with the camera's view as Hi completes his swing, connecting the plank directly with Lenny's face. The impact sends Lenny crashing to the ground as his bike, now without a rider, spins wildly out of control, twisting across the pavement until it collapses onto the street. As Lenny begins to rise to his feet, shaking off the fall, Hi nods at Ed, urging her with encouragement. Meanwhile, Lenny is reaching back, his hand gripping the handle of a knife, which he hurls forward. As Hi is turning to face him, unaware of the impending threat, he instinctively presents the plank at just the right moment. The knife flies through the air and embeds itself into the plank with a resonating thunk, piercing through the wood. Hi quickly steps back, swinging the now knife-studded plank to keep Lenny at bay, as he reaches up to unhook a chain from a ring on his vest shoulder, letting the chain drop into his open palm. Swinging the chain with precision, it slices through the air with a WHOOSH WHOOSH sound, aimed at the retreating Hi, the chain coils around the plank and yanks it from Hi's grasp. Quick on his feet, Lenny lunges forward, gripping Hi's shirtfront firmly, and in one swift move, brass knuckles slip onto his hand. His fist swings into frame, delivering a powerful forehand club, followed by a backhand strike. With a forceful uppercut, propelled from his heels, Hi is sent sprawling backward, crashing into an object behind him, his head striking with a thud as he sinks to the ground. Lenny approaches casually, lighting a cheroot with an air of calm confidence, while Hi struggles, flipping onto his stomach and beginning to wriggle under a nearby car in a desperate bid to escape. In the foreground, Hi's face conveys urgency and determination as he tries to find a way out, but behind him, Lenny casually reaches down, his grip finding and securing an ankle. The camera's shot mirrors the one from the Arizona nursery where Hi once pulled a baby from under a crib, as Lenny now pulls Hi away from the camera and out from under the car, leaving Hi scrambling to regain his footing. Lenny moves in, wrapping his muscular arms around Hi, applying a relentless bear hug that squeezes the air out of Hi's lungs, his hands futilely pawing at Lenny's chest as he struggles. Eventually, Lenny flings Hi aside with a powerful throw, sending him into the dust, drained and devoid of fight. Wearily, Lenny draws out both shotguns, spinning them into position. As Lenny's thumbs pull back the hammers, he raises the guns, ready to fire, seemingly at the end of the road. Hi, weary and defenseless, instinctively lifts a hand in front of him, extending it in a defensive gesture, then suddenly stops, his gaze fixating in disbelief."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As she bursts through the back door, Lenny maneuvers through the scattering hayseeds and quickly navigates his bike toward an alley next to the bank. Ed runs up the alley, with Lenny closing in on her, when suddenly a plank swings into view, striking Lenny in the face as Hi finishes the swing. Lenny crashes to the ground as his bike spins out into the street. Rising to his feet, Lenny prepares to throw his knife at Hi, who turns just in time and blocks it with the plank. As Hi retreats, swinging the plank to maintain distance, Lenny deftly unhooks a chain from his vest and uses it to disarm Hi. Grabbing Hi by the shirtfront, Lenny brutally punches him with brass knuckles, leaving Hi sprawling back against a car. As Lenny approaches, lighting a cheroot, Hi desperately wriggles under the car, but Lenny pulls him out by the ankle. In a scene reminiscent of Hi pulling a baby from under a crib, Lenny drags him out and ensnares him in a crushing bear hug. Exhausted and defeated, Hi is flung to the ground by Lenny, who then readies his shotguns. Lenny raises the guns to fire, but Hi, at the end of his strength, wearily lifts a hand in defense, frozen in place."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "As she runs for the back door and pushes through it, in an attempt to escape a chaotic scene, and as he slaloms through the wildly scattering hayseeds, a nod to the rural setting often depicted in action sequences in films, Lenny bursts out. With a whipcrack effect, reminiscent of the dramatic sounds found in Western movies, he looks left, then right, and jerks the bike right to where an alleyway flanks the side of the bank, a location often targeted for heists due to its narrow escape routes. Ed is running up the alley toward the front of the bank as Lenny enters, and he roars after her, roaring down the alley as the bike approaches behind her, the sound echoing off the brick walls typical of urban settings. Closing on Ed as she reaches the mouth of the alley, a plank swings into frame straight at the camera, a classic suspense-building technique used in cinematography, matching action as Hi finishes swinging the plank into Lenny's face. Lenny hits the ground hard as his bike spins out from under him, riderless, twisting crazily into the street where it collapses, reminiscent of stunts in action films. Lenny is rising to his feet beyond them as Hi nods encouragement to Ed, signaling teamwork in tense situations, and Lenny is reaching back to throw his knife, a weapon favored for its speed and danger in close combat. Hi, unaware, is turning to face him, presenting the plank as the knife is thrown, and it thunks into the plank, piercing it through, demonstrating Lenny's strength and precision. Hi backs up, swinging the knife-studded plank to make Lenny keep his distance as he reaches up to unhook a chain from a ring on his vest shoulder, similar to accessories worn by bikers for both style and practical use, and the free chain drops down into his palm. Swinging the chain, WHOOSH WHOOSH, at the backpedaling Hi, the chain snakes around it and rips it out of Hi's hands, reflecting the swift and destructive nature of such weapons. Grabbing Hi by the shirtfront, Lenny swings down and brass knuckles appear on it, a weapon notorious for enhancing punching power, as Lenny's fist swings into frame to club him forehand, then backhand. An uppercut from his heels sends Hi sprawling back as Hi lands against it, a parked truck in need of repairs, banging his head, and he sinks to the ground. Lenny is casually walking toward him, lighting a cheroot, which is a type of cigar often associated with tough, nonchalant characters in literature and film, as Hi flops over onto his stomach and starts wriggling under the car, hoping for a narrow chance of escape. Hi's face in the foreground as he desperately seeks escape, behind him we can see Lenny casually reaching down and grabbing an ankle, in a move reminiscent of a predator capturing its prey. The shot is framed identically to the shot in the Arizona nursery, a setting of an earlier scene pivotal to Hi's backstory, where Hi pulled a baby from under the crib, and Lenny pulls. Hi is dragged away from the camera and out from under the car, struggling to stand up. Lenny wraps his arms around him and applies a tremendous bear hug, a move that demonstrates his overwhelming physical strength, crushed against Lenny, his hands paw futilely at Lenny's chest. Lenny finally flings Hi away, landing in the dust, all the fight beaten out of him, tired of the fight: he saws out both shotguns, firearms known for their devastating power. On the guns as Lenny's thumbs draw them back, he raises the guns to fire, signaling the end of the road, a dramatic metaphor for the climax of conflict, he wearily lifts a hand, defensively extending it in front of him, then stops, staring at."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "we can see Lenny casually reaching down and grabbing an ankle Hi backs up swinging the knifestudded plank to make Lenny keep his distance as he reaches up to unhook a chain from a ring on his vest shoulder and the free chain drops down into his palm As she runs for the back door and pushes through it and as he slaloms through the wildly scattering hayseeds Lenny bursts out With a whipcrack effect he looks left then right and jerks the bike right to where an alleyway flanks the side of the bank Ed is running up the alley toward the front of the bank as Lenny enters and he roars after her roaring down the alley as the bike approaches behind her Closing on Ed as she reaches the mouth of the alley a plank swings into frame straight at the camera matching action as Hi finishes swinging the plank into Lenny's face Lenny hits the ground hard as his bike spins out from under him riderless twisting crazily into the street where it collapses Lenny is rising to his feet beyond them as Hi nods encouragement to Ed and Lenny is reaching back to throw his knife all the fight beaten out of him Closing on Ed as she reaches the mouth of the alley a plank swings into frame straight at the camera matching action as Hi finishes swinging the plank into Lenny's face With a whipcrack effect he looks left then right and jerks the bike right to where an alleyway flanks the side of the bank Hi unaware is turning to face him presenting the plank as the knife is thrown and it thunks into the plank piercing it through Hi backs up swinging the knifestudded plank to make Lenny keep his distance as he reaches up to unhook a chain from a ring on his vest shoulder and the free chain drops down into his palm Swinging the chain WHOOSH WHOOSH at the backpedaling Hi the chain snakes around it and rips it out of Hi's hands Lenny hits the ground hard as his bike spins out from under him riderless twisting crazily into the street where it collapses Grabbing Hi by the shirtfront Ed is running up the alley toward the front of the bank as Lenny enters and he roars after her roaring down the alley as the bike approaches behind her Lenny swings down and brass knuckles appear on it as Lenny's fist swings into frame to club him forehand then backhand An uppercut from his heels sends Hi sprawling back as Hi lands against it banging his head and he sinks to the ground he saws out both shotguns On the guns as Lenny's thumbs draw them back Lenny is casually walking toward him lighting a cheroot as Hi flops over onto his stomach and starts wriggling under the car Hi's face in the foreground as he desperately seeks escape behind him he wearily lifts a hand defensively extending it in front of him then stops staring at As she runs for the back door and pushes through it and as he slaloms through the wildly scattering hayseeds Lenny bursts out we can see Lenny casually reaching down and grabbing an ankle The shot is framed identically to the shot in the Arizona nursery where Hi pulled a baby from under the crib and Lenny pulls Swinging the chain WHOOSH WHOOSH at the backpedaling Hi the chain snakes around it and rips it out of Hi's hands Hi is dragged away from the camera and out from under the car struggling to stand up Lenny wraps his arms around him and applies a tremendous bear hug crushed against Lenny his hands paw futilely at Lenny's chest he raises the guns to fire the end of the road Hi's face in the foreground as he desperately seeks escape behind him Lenny finally flings Hi away landing in the dust all the fight beaten out of him tired of the fight he saws out both shotguns On the guns as Lenny's thumbs draw them back he raises the guns to fire the end of the road he wearily lifts a hand defensively extending it in front of him then stops staring at"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "As she runs for the back door and pushes through it and as he slaloms through the wildly scattering hayseeds Lenny bursts out. With a whipcrack effect he looks left then right and jerks the bike right to where an alleyway flanks the side of the bank. Ed is running up the alley toward the front of the bank as Lenny enters and he roars after her roaring down the alley as the bike approaches behind her. Closing on Ed as she reaches the mouth of the alley a plank swings into frame straight at the camera matching action as Hi finishes swinging the plank into Lenny's face. Lenny hits the ground hard as his bike spins out from under him riderless twisting crazily into the street where it collapses. Lenny is rising to his feet beyond them as Hi nods encouragement to Ed and Lenny is reaching back to throw his knife. Hi unaware is turning to face him presenting the plank as the knife is thrown and it thunks into the plank piercing it through. Hi backs up swinging the knifestudded plank to make Lenny keep his distance as he reaches up to unhook a chain from a ring on his vest shoulder and the free chain drops down into his palm. Swinging the chain WHOOSH WHOOSH at the backpedaling Hi the chain snakes around it and rips it out of Hi's hands. Grabbing Hi by the shirtfront. Lenny swings down and brass knuckles appear on it as Lenny's fist swings into frame to club him forehand then backhand. An uppercut from his heels sends Hi sprawling back as Hi lands against it banging his head and he sinks to the ground. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Lenny is casually walking toward him lighting a cheroot as Hi flops over onto his stomach and starts wriggling under the car. Hi's face in the foreground as he desperately seeks escape behind him. we can see Lenny casually reaching down and grabbing an ankle. The shot is framed identically to the shot in the Arizona nursery where Hi pulled a baby from under the crib and Lenny pulls. Hi is dragged away from the camera and out from under the car struggling to stand up. Lenny wraps his arms around him and applies a tremendous bear hug crushed against Lenny. his hands paw futilely at Lenny's chest. Lenny finally flings Hi away landing in the dust. all the fight beaten out of him. tired of the fight. he saws out both shotguns On the guns as Lenny's thumbs draw them back. he raises the guns to fire the end of the road. he wearily lifts a hand defensively extending it in front of him then stops staring at."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "As she runs for the back door and pushes through it and as he slaloms through the wildly scattering hayseeds Lenny bursts out. With a whipcrack effect he looks left then right and jerks the bike right to where an alleyway flanks the side of the bank. Ed is running up the alley toward the front of the bank as Lenny enters and he roars after her roaring down the alley as the bike approaches behind her. Closing on Ed as she reaches the mouth of the alley a plank swings into frame straight at the camera matching action as Hi finishes swinging the plank into Lenny's face. Lenny hits the ground hard as his bike spins out from under him riderless twisting crazily into the street where it collapses. Lenny is rising to his feet beyond them as Hi nods encouragement to Ed and Lenny is reaching back to throw his knife. Hi unaware is turning to face him presenting the plank as the knife is thrown and it thunks into the plank piercing it through. Hi backs up swinging the knifestudded plank to make Lenny keep his distance as he reaches up to unhook a chain from a ring on his vest shoulder and the free chain drops down into his palm. Swinging the chain WHOOSH WHOOSH at the backpedaling Hi the chain snakes around it and rips it out of Hi's hands. Grabbing Hi by the shirtfront. Lenny swings down and brass knuckles appear on it as Lenny's fist swings into frame to club him forehand then backhand. An uppercut from his heels sends Hi sprawling back as Hi lands against it banging his head and he sinks to the ground. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Lenny is casually walking toward him lighting a cheroot as Hi flops over onto his stomach and starts wriggling under the car. Hi's face in the foreground as he desperately seeks escape behind him. we can see Lenny casually reaching down and grabbing an ankle. The shot is framed identically to the shot in the Arizona nursery where Hi pulled a baby from under the crib and Lenny pulls. Hi is dragged away from the camera and out from under the car struggling to stand up. Lenny wraps his arms around him and applies a tremendous bear hug crushed against Lenny. his hands paw futilely at Lenny's chest. Lenny finally flings Hi away landing in the dust. all the fight beaten out of him. tired of the fight. he saws out both shotguns On the guns as Lenny's thumbs draw them back. he raises the guns to fire the end of the road. he wearily lifts a hand defensively extending it in front of him then stops staring at."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "As she runs for the back door and pushes through it and as he slaloms through the wildly scattering hayseeds Lenny bursts out. With a whipcrack effect he looks left then right and jerks the bike right to where an alleyway flanks the side of the bank. Ed is running up the alley toward the front of the bank as Lenny enters and he roars after her roaring down the alley as the bike approaches behind her. Closing on Ed as she reaches the mouth of the alley a plank swings into frame straight at the camera matching action as Hi finishes swinging the plank into Lenny's face. Lenny hits the ground hard as his bike spins out from under him riderless twisting crazily into the street where it collapses. Lenny is rising to his feet beyond them as Hi nods encouragement to Ed and Lenny is reaching back to throw his knife. his hands paw futilely at Lenny's chest. Lenny finally flings Hi away landing in the dust. all the fight beaten out of him. tired of the fight. he saws out both shotguns On the guns as Lenny's thumbs draw them back. he raises the guns to fire the end of the road. he wearily lifts a hand defensively extending it in front of him then stops staring at."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "As she runs for the back door and pushes through it and as he slaloms through the wildly scattering hayseeds Lenny bursts out. With a whipcrack effect he looks left then right and jerks the bike right to where an alleyway flanks the side of the bank. he saws out both shotguns On the guns as Lenny's thumbs draw them back. he raises the guns to fire the end of the road. he wearily lifts a hand defensively extending it in front of him then stops staring at."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "As the dog runs for the back door and pushes through it, and as the rabbit slaloms through the wildly scattering hayseeds, the giraffe bursts out. With a whipcrack effect, the giraffe looks left, then right, and jerks the bike right to where an alleyway flanks the side of the bank. The parrot is running up the alley toward the front of the bank as the giraffe enters, and the giraffe roars after the dog, roaring down the alley as the bike approaches behind the dog. Closing on the parrot as the dog reaches the mouth of the alley, a plank swings into frame straight at the camera, matching action as the penguin finishes swinging the plank into the giraffe's face. The giraffe hits the ground hard as its bike spins out from under it, riderless, twisting crazily into the street where it collapses. The giraffe is rising to its feet beyond them as the penguin nods encouragement to the parrot, and the giraffe is reaching back to throw its knife. The penguin, unaware, is turning to face the giraffe, presenting the plank as the knife is thrown, and it thunks into the plank, piercing it through. The penguin backs up, swinging the knife-studded plank to make the giraffe keep its distance as it reaches up to unhook a chain from a ring on its vest shoulder, and the free chain drops down into its palm. Swinging the chain, WHOOSH WHOOSH, at the backpedaling penguin, the chain snakes around it and rips it out of the penguin's hands. Grabbing the penguin by the shirtfront, the giraffe swings down and brass knuckles appear on it, as the giraffe's fist swings into frame to club the penguin forehand, then backhand. An uppercut from its heels sends the penguin sprawling back as the penguin lands against it, banging its head, and it sinks to the ground. The giraffe is casually walking toward it, lighting a cheroot, as the penguin flops over onto its stomach and starts wriggling under the car. The penguin's face in the foreground as it desperately seeks escape, behind it we can see the giraffe casually reaching down and grabbing an ankle. The shot is framed identically to the shot in the Arizona nursery where the penguin pulled a baby from under the crib, and the giraffe pulls. The penguin is dragged away from the camera and out from under the car, struggling to stand up. The giraffe wraps its arms around the penguin and applies a tremendous bear hug, crushed against the giraffe, its hands paw futilely at the giraffe's chest. The giraffe finally flings the penguin away, landing in the dust, all the fight beaten out of it, tired of the fight: it saws out both shotguns. On the guns as the giraffe's thumbs draw them back, it raises the guns to fire, the end of the road, it wearily lifts a hand, defensively extending it in front of it, then stops, staring at."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "As she runs for the side door and pushes through it, and as he zigzags through the wildly scattering rose petals, Lenny bursts out. With a whipcrack effect, he looks left, then right, and jerks the scooter right to where a corridor flanks the side of the library. Ed is running up the corridor toward the front of the library as Lenny enters, and he roars after her, roaring down the corridor as the scooter approaches behind her. Closing on Ed as she reaches the mouth of the corridor, a shovel swings into frame straight at the camera, matching action as Hi finishes swinging the shovel into Lenny's face. Lenny hits the ground hard as his scooter spins out from under him, riderless, twisting crazily into the aisle where it collapses. Lenny is rising to his feet beyond them as Hi nods encouragement to Ed, and Lenny is reaching back to throw his stick. Hi, unaware, is turning to face him, presenting the shovel as the stick is thrown, and it thunks into the shovel, piercing it through. Hi backs up, swinging the stick-studded shovel to make Lenny keep his distance as he reaches up to unhook a rope from a hook on his vest shoulder, and the free rope drops down into his palm. Swinging the rope, WHOOSH WHOOSH, at the backpedaling Hi, the rope snakes around it and rips it out of Hi's hands. Grabbing Hi by the hoodie, Lenny swings down and a pair of handcuffs appear on it, as Lenny's fist swings into frame to club him forehand, then backhand. An uppercut from his heels sends Hi sprawling back as Hi lands against it, banging his head, and he sinks to the ground. Lenny is casually walking toward him, lighting a cigarillo, as Hi flops over onto his stomach and starts wriggling under the bench. Hi's face in the foreground as he desperately seeks escape, behind him we can see Lenny casually reaching down and grabbing an ankle. The shot is framed identically to the shot in the Nevada playground where Hi pulled a teddy bear from under the swing, and Lenny pulls. Hi is dragged away from the camera and out from under the bench, struggling to stand up. Lenny wraps his arms around him and applies a tremendous bear hug, crushed against Lenny, his hands paw futilely at Lenny's chest. Lenny finally flings Hi away, landing in the mud, all the fight beaten out of him, tired of the fight: he saws out both umbrellas. On the parasols as Lenny's thumbs draw them back, he raises the parasols to open, the end of the road, he wearily lifts a hand, defensively extending it in front of him, then stops, staring at."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "As she sprints for the back door and slides through it, and as he weaves through the wildly scattering hayseeds, Lenny emerges out. With a snap effect, he glances left, then right, and veers the bike right to where an alleyway skirts the side of the bank. Ed is jogging up the alley toward the front of the bank as Lenny dives in, and he bellows after her, speeding down the alley as the bike trails behind her. Closing on Ed as she arrives at the mouth of the alley, a plank emerges into frame straight at the camera, matching action as Hi finishes lifting the plank into Lenny's face. Lenny bounces off the ground hard as his bike tumbles away from under him, riderless, spinning crazily into the street where it crumbles. Lenny is scrambling to his feet beyond them as Hi gestures encouragement to Ed, and Lenny is extending back to toss his knife. Hi, unaware, is spinning to face him, presenting the plank as the knife is hurled, and it embeds into the plank, puncturing it through. Hi retreats, twirling the knife-studded plank to make Lenny maintain his distance as he reaches up to detach a chain from a ring on his vest shoulder, and the free chain slips down into his palm. Slinging the chain, WHOOSH WHOOSH, at the retreating Hi, the chain spirals around it and snatches it out of Hi's hands. Grabbing Hi by the shirtfront, Lenny swings downward and brass knuckles materialize on it, as Lenny's fist swings into frame to whack him forehand, then backhand. An uppercut from his heels sends Hi tumbling back as Hi collides against it, knocking his head, and he sinks to the ground. Lenny is leisurely strolling toward him, igniting a cheroot, as Hi rolls over onto his stomach and begins squirming under the car. Hi's face in the foreground as he frantically looks for escape, behind him we can see Lenny leisurely stretching down and seizing an ankle. The shot is framed identically to the shot in the Arizona nursery where Hi extracted a baby from under the crib, and Lenny tugs. Hi is pulled away from the camera and out from under the car, grappling to stand up. Lenny wraps his arms around him and administers a tremendous bear hug, squeezed against Lenny, his hands claw futilely at Lenny's chest. Lenny ultimately hurls Hi away, landing in the dust, all the fight drained out of him, weary of the struggle: he draws out both shotguns. On the guns as Lenny's thumbs retract them back, he hoists the guns to shoot, the end of the road, he languidly raises a hand, defensively extending it in front of him, then halts, gazing at."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "As the toaster runs for the garden hose and pushes through it, and as the microwave slaloms through the wildly scattering marbles, the cat bursts out. With a whipcrack effect, the cat looks left, then right, and jerks the piano right to where a staircase flanks the side of the mailbox. The giraffe is running up the staircase toward the front of the mailbox as the cat enters, and the cat roars after the toaster, roaring down the staircase as the piano approaches behind the toaster. Closing on the giraffe as the toaster reaches the mouth of the staircase, a broom swings into frame straight at the camera, matching action as the lamp finishes swinging the broom into the cat's face. The cat hits the ground hard as its piano spins out from under it, driverless, twisting crazily into the street where it collapses. The cat is rising to its feet beyond them as the lamp nods encouragement to the giraffe, and the cat is reaching back to throw its balloon. The lamp, unaware, is turning to face the cat, presenting the broom as the balloon is thrown, and it thunks into the broom, piercing it through. The lamp backs up, swinging the balloon-studded broom to make the cat keep its distance as the lamp reaches up to unhook a necklace from a ring on its shoe shoulder, and the free necklace drops down into its palm. Swinging the necklace, WHOOSH WHOOSH, at the backpedaling lamp, the necklace snakes around it and rips it out of the lamp's hands. Grabbing the lamp by the jacket, the cat swings down and butter knives appear on it, as the cat's whisk swings into frame to club the lamp forehand, then backhand. An uppercut from its heels sends the lamp sprawling back as the lamp lands against it, banging its head, and it sinks to the ground. The cat is casually walking toward the lamp, lighting a candle, as the lamp flops over onto its stomach and starts wriggling under the piano. The lamp's face in the foreground as it desperately seeks escape, behind it we can see the cat casually reaching down and grabbing a sock. The shot is framed identically to the shot in the refrigerator nursery where the lamp pulled a teddy bear from under the table, and the cat pulls. The lamp is dragged away from the camera and out from under the piano, struggling to stand up. The cat wraps its arms around the lamp and applies a tremendous bear hug, crushed against the cat, its hands paw futilely at the cat's chest. The cat finally flings the lamp away, landing in the dust, all the fight beaten out of the lamp, tired of the fight: it saws out both hammers. On the hammers as the cat's thumbs draw them back, it raises the hammers to fire, the end of the road, it wearily lifts a spoon, defensively extending it in front of it, then stops, staring at."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "As the cat darts for the back door and slips through it, and as the squirrel zigzags through the wildly scattering hayseeds, Charlie erupts out. With a whipcrack effect, he glances left, then right, and veers the skateboard right to where an alleyway flanks the side of the library. Daisy is skipping up the alley toward the front of the library as Charlie slides in, and he howls after her, gliding down the alley as the skateboard rolls behind her. Closing on Daisy as she reaches the entrance of the alley, a broom swoops into frame straight at the camera, matching action as Max finishes swinging the broom into Charlie's face. Charlie crashes to the ground hard as his skateboard whirls out from under him, riderless, spiraling crazily into the street where it topples. Charlie is scrambling to his feet beyond them as Max winks encouragement to Daisy, and Charlie is reaching back to toss his hat. Max, unaware, spins to face him, presenting the broom as the hat is tossed, and it thuds into the broom, puncturing it through. Max retreats, wielding the hat-pierced broom to make Charlie keep his distance as he reaches up to unclasp a scarf from a ring on his helmet, and the free scarf drops down into his palm. Swinging the scarf, WHOOSH WHOOSH, at the retreating Max, the scarf coils around it and yanks it out of Max's hands. Grabbing Max by the lapel, Charlie swings down and brass knuckles appear on it, as Charlie's fist punches into frame to jab him forehand, then backhand. An uppercut from his heels sends Max tumbling back as Max crashes against it, bumping his head, and he slumps to the ground. Charlie is leisurely strolling toward him, puffing on a toothpick, as Max rolls over onto his stomach and starts shimmying under the wagon. Max's face in the foreground as he frantically seeks escape, behind him we can see Charlie leisurely reaching down and grabbing a shoelace. The shot is framed identically to the shot in the orchard where Max dragged a kitten from under the basket, and Charlie yanks. Max is pulled away from the camera and out from under the wagon, scrambling to stand up. Charlie wraps his arms around him and applies a tremendous bear hug, squeezed against Charlie, his hands claw uselessly at Charlie's coat. Charlie finally flicks Max away, landing in the dust, all the strength drained from him, exhausted from the struggle: he pulls out both flutes. On the flutes as Charlie's thumbs slide them back, he raises the flutes to play, the end of the concert, he wearily lifts a foot, defensively stretching it out in front of him, then halts, staring at."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "As she tiptoes toward the attic door and spins it open, and as he skips through the wildly bouncing marbles, Lenny tiptoes in. With a drumroll effect, he glances up, then down, and wobbles the unicycle left to where a hedge borders the side of the library. Ed is rolling up the hedge toward the back of the library as Lenny prances, and he mumbles behind her, mumbling down the hedge as the unicycle glides beside her. Nearing Ed as she reaches the opening of the hedge, a curtain sways into the shot straight at the camera, matching action as Hi completes swaying the curtain into Lenny's path. Lenny tumbles onto the grass as his unicycle veers out from beneath him, riderless, dancing erratically into the courtyard where it topples. Lenny is leaping to his feet nearby as Hi shakes approval to Ed, and Lenny is reaching back to grasp his spoon. Hi, unaware, is turning to confront him, presenting the curtain as the spoon is flung, and it thuds into the curtain, poking through. Hi stumbles back, swinging the spoon-pierced curtain to make Lenny maintain his distance as he reaches up to detach a rope from a button on his vest collar, and the loose rope falls into his grip. Swinging the rope, SWISH SWISH, at the retreating Hi, the rope curls around it and snatches it out of Hi's hands. Seizing Hi by the collar, Lenny swings upward and mittens appear on it, as Lenny's hand swings into view to pat him forehand, then backhand. An underhand toss from his knees sends Hi sprawling forward as Hi collides with it, bumping his elbow, and he collapses to the ground. Lenny is leisurely strolling toward him, chewing a licorice stick, as Hi flops over onto his side and starts slithering under the bench. Hi's eyes in the foreground as he frantically searches for an escape, behind him we can see Lenny leisurely reaching down and grasping a shoelace. The shot mirrors the angle of the shot in the Mississippi playground where Hi pulled a toy from under the swing set, and Lenny pulls. Hi is dragged toward the camera and out from under the bench, wobbling to stand up. Lenny wraps his arms around him and applies a gentle hug, squashed against Lenny, his hands caress feebly at Lenny's stomach. Lenny eventually tosses Hi away, landing in the leaves, all the struggle drained out of him, weary of the struggle: he draws out both flutes. On the flutes as Lenny's fingers tap them gently, he raises the flutes to play, the end of the journey, he slowly lifts a finger, defensively extending it in front of him, then pauses, contemplating at."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "As the cat sprints for the window and nudges through it, and as the frog slaloms through the wildly fluttering butterflies, Marvin leaps out. With a thunderclap effect, he glances up, then down, and jerks the skateboard left to where a hallway flanks the side of the post office. June is skipping up the hallway toward the back of the post office as Marvin enters, and he bellows after her, hollering down the hallway as the skateboard approaches behind her. Closing on June as she reaches the entrance of the hallway, a bouquet swings into frame straight at the camera, mirroring action as Moe finishes swinging the bouquet into Marvin's torso. Marvin strikes the ground hard as his skateboard spins out from under him, riderless, whirling wildly into the yard where it collapses. Marvin is rising to his knees beyond them as Moe winks encouragement to June, and Marvin is reaching forward to toss his apple. Moe, unaware, is spinning to face him, presenting the bouquet as the apple is tossed, and it thunks into the bouquet, impaling it through. Moe sidesteps, swinging the apple-studded bouquet to make Marvin maintain his distance as he reaches down to untangle a rope from a hook on his hat brim, and the loosened rope falls down into his grasp. Swinging the rope, WHOOSH WHOOSH, at the retreating Moe, the rope coils around it and yanks it out of Moe’s grip. Grabbing Moe by the collar, Marvin swings back and sunglasses appear on it, as Marvin's knuckles swing into frame to smack him forehand, then backhand. A jab from his shoes sends Moe tumbling back as Moe lands against it, bumping his elbow, and he slides to the floor. Marvin is leisurely striding toward him, lighting a matchstick, as Moe flips over onto his back and starts scooting under the bench. Moe's face in the foreground as he desperately seeks refuge, behind him we can see Marvin leisurely reaching up and clutching a shoelace. The shot mirrors the shot in the Montana meadow where Moe tugged a rabbit from under the log, and Marvin pulls. Moe is hauled away from the camera and out from under the bench, struggling to stand upright. Marvin wraps his elbows around him and applies an impressive headlock, squeezed against Marvin, his fingers claw ineffectively at Marvin's elbow. Marvin finally tosses Moe aside, landing in the sand, all the energy drained from him, weary of the scuffle: he saws out both accordions. On the instruments as Marvin's thumbs press them back, he raises the instruments to play, the end of the dance, he slowly raises a finger, defensively extending it in front of him, then halts, gazing at."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Lenny bursts out of the back door, quickly scanning before veering his bike into an alley flanking the bank. Ed runs up the alley, pursued by Lenny, until Hi swings a plank into Lenny's face, causing him to crash. Rising, Lenny hurls a knife, which hits Hi's plank. As Hi backs up, Lenny swings a chain, disarming Hi and grabbing him with brass-knuckled punches. Hi is knocked down and tries to escape under a car, but Lenny drags him out, applying a crushing bear hug. Exhausted, Hi is flung away, and Lenny prepares to end the confrontation with shotguns, forcing Hi to lift a hand defensively."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "he wearily lifts a hand defensively extending it in front of him then stops staring at he raises the guns to fire the end of the road he saws out both shotguns On the guns as Lenny's thumbs draw them back tired of the fight all the fight beaten out of him Lenny finally flings Hi away landing in the dust his hands paw futilely at Lenny's chest Lenny wraps his arms around him and applies a tremendous bear hug crushed against Lenny Hi is dragged away from the camera and out from under the car struggling to stand up The shot is framed identically to the shot in the Arizona nursery where Hi pulled a baby from under the crib and Lenny pulls we can see Lenny casually reaching down and grabbing an ankle Hi's face in the foreground as he desperately seeks escape behind him Lenny is casually walking toward him lighting a cheroot as Hi flops over onto his stomach and starts wriggling under the car An uppercut from his heels sends Hi sprawling back as Hi lands against it banging his head and he sinks to the ground Lenny swings down and brass knuckles appear on it as Lenny's fist swings into frame to club him forehand then backhand Grabbing Hi by the shirtfront Swinging the chain WHOOSH WHOOSH at the backpedaling Hi the chain snakes around it and rips it out of Hi's hands Hi backs up swinging the knifestudded plank to make Lenny keep his distance as he reaches up to unhook a chain from a ring on his vest shoulder and the free chain drops down into his palm Hi unaware is turning to face him presenting the plank as the knife is thrown and it thunks into the plank piercing it through Lenny is rising to his feet beyond them as Hi nods encouragement to Ed and Lenny is reaching back to throw his knife Lenny hits the ground hard as his bike spins out from under him riderless twisting crazily into the street where it collapses Closing on Ed as she reaches the mouth of the alley a plank swings into frame straight at the camera matching action as Hi finishes swinging the plank into Lenny's face Ed is running up the alley toward the front of the bank as Lenny enters and he roars after her roaring down the alley as the bike approaches behind her With a whipcrack effect he looks left then right and jerks the bike right to where an alleyway flanks the side of the bank As she runs for the back door and pushes through it and as he slaloms through the wildly scattering hayseeds Lenny bursts out"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Hi is dragged away from the camera and out from under the car struggling to stand up Lenny is casually walking toward him lighting a cheroot as Hi flops over onto his stomach and starts wriggling under the car Grabbing Hi by the shirtfront Lenny finally flings Hi away landing in the dust his hands paw futilely at Lenny's chest Hi unaware is turning to face him presenting the plank as the knife is thrown and it thunks into the plank piercing it through Lenny is rising to his feet beyond them as Hi nods encouragement to Ed and Lenny is reaching back to throw his knife Lenny swings down and brass knuckles appear on it as Lenny's fist swings into frame to club him forehand then backhand The shot is framed identically to the shot in the Arizona nursery where Hi pulled a baby from under the crib and Lenny pulls tired of the fight An uppercut from his heels sends Hi sprawling back as Hi lands against it banging his head and he sinks to the ground Lenny wraps his arms around him and applies a tremendous bear hug crushed against Lenny With a whipcrack effect he looks left then right and jerks the bike right to where an alleyway flanks the side of the bank we can see Lenny casually reaching down and grabbing an ankle he saws out both shotguns On the guns as Lenny's thumbs draw them back Hi's face in the foreground as he desperately seeks escape behind him Ed is running up the alley toward the front of the bank as Lenny enters and he roars after her roaring down the alley as the bike approaches behind her he raises the guns to fire the end of the road Lenny hits the ground hard as his bike spins out from under him riderless twisting crazily into the street where it collapses he wearily lifts a hand defensively extending it in front of him then stops staring at Hi backs up swinging the knifestudded plank to make Lenny keep his distance as he reaches up to unhook a chain from a ring on his vest shoulder and the free chain drops down into his palm Swinging the chain WHOOSH WHOOSH at the backpedaling Hi the chain snakes around it and rips it out of Hi's hands As she runs for the back door and pushes through it and as he slaloms through the wildly scattering hayseeds Lenny bursts out Closing on Ed as she reaches the mouth of the alley a plank swings into frame straight at the camera matching action as Hi finishes swinging the plank into Lenny's face all the fight beaten out of him"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Hi's face in the foreground as he desperately seeks escape behind him we can see Lenny casually reaching down and grabbing an ankle The shot is framed identically to the shot in the Arizona nursery where Hi pulled a baby from under the crib and Lenny pulls Hi is dragged away from the camera and out from under the car struggling to stand up Lenny wraps his arms around him and applies a tremendous bear hug crushed against Lenny his hands paw futilely at Lenny's chest Lenny finally flings Hi away landing in the dust all the fight beaten out of him tired of the fight he saws out both shotguns On the guns as Lenny's thumbs draw them back he raises the guns to fire the end of the road he wearily lifts a hand defensively extending it in front of him then stops staring at As she runs for the back door and pushes through it and as he slaloms through the wildly scattering hayseeds Lenny bursts out With a whipcrack effect he looks left then right and jerks the bike right to where an alleyway flanks the side of the bank Ed is running up the alley toward the front of the bank as Lenny enters and he roars after her roaring down the alley as the bike approaches behind her Closing on Ed as she reaches the mouth of the alley a plank swings into frame straight at the camera matching action as Hi finishes swinging the plank into Lenny's face Lenny hits the ground hard as his bike spins out from under him riderless twisting crazily into the street where it collapses Lenny is rising to his feet beyond them as Hi nods encouragement to Ed and Lenny is reaching back to throw his knife Hi unaware is turning to face him presenting the plank as the knife is thrown and it thunks into the plank piercing it through Hi backs up swinging the knifestudded plank to make Lenny keep his distance as he reaches up to unhook a chain from a ring on his vest shoulder and the free chain drops down into his palm Swinging the chain WHOOSH WHOOSH at the backpedaling Hi the chain snakes around it and rips it out of Hi's hands Grabbing Hi by the shirtfront Lenny swings down and brass knuckles appear on it as Lenny's fist swings into frame to club him forehand then backhand An uppercut from his heels sends Hi sprawling back as Hi lands against it banging his head and he sinks to the ground Lenny is casually walking toward him lighting a cheroot as Hi flops over onto his stomach and starts wriggling under the car"
        }
      ]
    }
  ]
}