{
  "ground_truth": "A hand grenade pin hangs, glinting, from one of his fingers, as pawing at Lenny's chest he must have hooked his finger through its ring. Reacting and reacting to Hi reacting, he looks down to see the bandoliers across his chest with silver pins glinting in all the grenades except one, where its squeeze-lever juts at a right angle. Hi's jaw drops and the lit cheroot hits the ground between his boots. Scrambling to his feet and trying to drop the shotguns to free his hands, in his panic his fingers tangle in the trigger guards. Starting to run, he finally frees his hands and dives behind the parked car. His hands fly in to wrap around the grenade, but too late, bright light blows sky-high. There is a roar, as if the earth were cracking open, and flame, as if hell were slipping out. We pan the fire to the sky where a white aluminum ladder rises up into the blackness, clanking softly. The top of the ladder arcs toward the camera. Late at night, the nursery is dark and empty, of the unpainted crib with the burned-in names: Harry, Barry, Larry, Garry, and Nathan Jr. As we pull back from the headboard, Ed's arms gently deposit the sleeping Nathan Jr. into the crib. Hi puts the singed copy of Dr. Spock's Baby and Child Care next to the baby as he and Ed look sadly down at the baby. The silence is broken by the bleat of a squeeze-me toy as the lights are snapped on, startling Hi and Ed. Nathan stands in his jammies, hair disheveled, holding a gun and squinting against the light, keeping the gun trained on Hi and Ed as he slowly raises a pair of eyeglasses to his nose and advances cautiously into the nursery, gesturing with his gun. Hi and Ed back away from the crib as Nathan peers in, studies the baby for a moment, lays the gun down, tenderly picks up the baby, and holds him to his chest with a tear forming at the corner of his eye. Hi and Ed quietly move back towards the ladder as he bounces the baby, studying Hi and Ed, and Hi shrugs. Nathan turns to put the baby back in the crib, turns around with a thought, and Hi does a small take, surprised at this much integrity. She stands looking into the crib, and Hi steps up next to her and puts an arm around her shoulder. Ed starts crying softly as she gazes into the crib, and Hi murmurs something to comfort her. Nathan is studying the two of them as Hi turns to face him and speaks in a rush. Nathan looks at her, finally nods, and sighs.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A hand explosive pin dangles, shimmering, from one of his digits, as pawing at Lenny's torso he must have snagged his digit through its loop. Reacting and reacting to Hi reacting, he glances down to see the bandoliers across his torso with argent pins shimmering in all the explosives except one, where its squeeze-lever protrudes at a right angle. Hi's mouth opens and the lit cheroot strikes the ground between his boots. Scrambling to his feet and attempting to drop the shotguns to free his hands, in his panic his digits entangle in the trigger guards. Beginning to run, he eventually frees his hands and dives behind the parked automobile. His hands fly in to wrap around the explosive, but too late, bright light explodes sky-high. There is a roar, as if the earth were cracking open, and flame, as if hell were slipping out. We pan the blaze to the sky where a white aluminum ladder ascends into the darkness, clanking softly. The top of the ladder curves toward the camera. Late at night, the nursery is dim and vacant, of the unpainted crib with the burned-in names: Harry, Barry, Larry, Garry, and Nathan Jr. As we pull back from the headboard, Ed's arms gently deposit the slumbering Nathan Jr. into the crib. Hi places the singed copy of Dr. Spock's Baby and Child Care next to the infant as he and Ed look sadly down at the infant. The silence is interrupted by the bleat of a squeeze-me toy as the lights are snapped on, startling Hi and Ed. Nathan stands in his sleepwear, hair tousled, holding a firearm and squinting against the light, keeping the firearm trained on Hi and Ed as he slowly raises a pair of spectacles to his nose and advances cautiously into the nursery, gesturing with his firearm. Hi and Ed back away from the crib as Nathan peers in, examines the infant for a moment, lays the firearm down, tenderly picks up the infant, and holds him to his torso with a tear forming at the corner of his eye. Hi and Ed quietly move back towards the ladder as he bounces the infant, examining Hi and Ed, and Hi shrugs. Nathan turns to place the infant back in the crib, turns around with a thought, and Hi does a small take, surprised at this much integrity. She stands looking into the crib, and Hi steps up next to her and puts an arm around her shoulder. Ed starts weeping softly as she gazes into the crib, and Hi murmurs something to comfort her. Nathan is examining the two of them as Hi turns to face him and speaks in a rush. Nathan looks at her, finally nods, and exhales."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A hand grenade pin is hung, glinting, from one of his fingers, as Lenny's chest is pawed at by him and he must have hooked his finger through its ring. Reacting and reacting to Hi's reaction, down he looks to see the bandoliers across his chest with silver pins glinting in all the grenades except one, where its squeeze-lever is jutting at a right angle. Hi drops his jaw and the lit cheroot is hit to the ground between his boots. He scrambles to his feet and tries to drop the shotguns to free his hands; in his panic, the trigger guards tangle his fingers. His hands are finally freed, and the parked car is dived behind by him, starting to run. In his hands, the grenade is wrapped around, but it's too late; bright light is blown sky-high by it. A roar is heard, as if the earth is cracking open, and flame appears, as if hell is slipping out. The fire is panned by us to the sky where a white aluminum ladder is rising up into the blackness, clanking softly. Toward the camera, the ladder's top arcs. Late at night, the nursery is dark and empty, with an unpainted crib bearing the burned-in names: Harry, Barry, Larry, Garry, and Nathan Jr. The sleeping Nathan Jr. is gently deposited into the crib by Ed's arms as we pull back from the headboard. Next to the baby, the singed copy of Dr. Spock's Baby and Child Care is put by Hi as he and Ed look sadly down at the baby. The silence is broken by Hi and Ed startling as the lights are snapped on with the bleat of a squeeze-me toy. In his jammies, disheveled hair, holding a gun and squinting against the light, Nathan stands, keeping the gun trained on Hi and Ed as a pair of eyeglasses is slowly raised to his nose and the nursery is cautiously advanced into by him, his gun gesturing. Away from the crib, Hi and Ed back as the baby is peered in by Nathan, studied for a moment, and then the gun is laid down. The baby is tenderly picked up by Nathan and held to his chest with a tear forming at the corner of his eye. Back towards the ladder, Hi and Ed quietly move as Nathan bounces the baby, studying Hi and Ed, and a shrug is given by Hi. To put the baby back in the crib, Nathan turns, then turns around with a thought, and a small take is done by Hi, surprised at this much integrity. Into the crib, she stands looking, and next to her steps up Hi and an arm is put around her shoulder. Softly, Ed starts crying as into the crib she gazes, and something is murmured by Hi to comfort her. The two of them are studied by Nathan as Hi turns to face him and speaks in a rush. Finally, he looks at her, nods, and a sigh is released by him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A grenade pin dangles from his finger after hooking it on Lenny’s chest. Hi reacts, looking at the bandoliers across his chest, noting all the silver pins in the grenades except one, which has a protruding squeeze-lever. Hi's jaw drops, and his lit cheroot falls to the ground. Panicked, he tries to drop the shotguns, fingers tangling in the trigger guards. Finally freeing his hands, he dives behind a parked car. Too late, as a bright light explodes sky-high. A roar and flames emerge, while a white ladder rises into the sky, clanking softly. Late at night, the nursery is dark; an unpainted crib displays burned-in names: Harry, Barry, Larry, Garry, and Nathan Jr. Ed places the sleeping Nathan Jr. in the crib, as Hi sets a singed Dr. Spock book beside him. A toy bleats as the lights snap on, startling them. Nathan, in pajamas, hair disheveled, holds a gun, squinting into the light, advancing cautiously. Hi and Ed back away as Nathan peers at the baby, then tenderly picks him up, tearful. Hi and Ed retreat toward the ladder; Nathan, holding the baby, studies them. He turns to place the baby back, then pauses, surprising Hi with his integrity. Ed cries softly by the crib, Hi comforting her. Nathan studies them as Hi speaks quickly. Nathan nods, sighing."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A grenade pin glints on his finger, caught while pawing at Lenny's chest. Reacting, he sees bandoliers with glinting pins, except one grenade with its lever at a right angle. Hi's jaw drops, dropping his cheroot. Scrambling, he fumbles with shotguns, freeing his hands and diving behind a car. Grabbing the grenade too late, a bright explosion erupts with a roar and flame. The camera pans to a ladder rising into darkness. At night, the nursery is dark with an unpainted crib bearing names: Harry, Barry, Larry, Garry, and Nathan Jr. Ed gently places Nathan Jr. in the crib. Hi places a singed book nearby, and they look sadly at the baby. A toy bleats as lights snap on, startling them. Nathan, disheveled and armed, squints against the light, approaching cautiously. Hi and Ed back away as Nathan examines the baby, then picks him up tenderly, tearful. Hi and Ed retreat towards the ladder as Nathan bounces the baby. Hi shrugs, surprised at his integrity. Nathan returns the baby, then ponders, prompting Hi to react. Standing by the crib, Hi comforts a crying Ed. Nathan studies them, nods, and sighs."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As he fumbled with Lenny’s chest, a hand grenade pin happened to dangle and glint brightly, hanging precariously from one of his fingers. This occurred because, in his frantic movements, his finger inadvertently slipped through the ring of the grenade’s pin. His reaction was driven by a chain of reactions, notably those of Hi, and this spurred him to glance downward, his eyes scanning the bandoliers draped across his chest. Each bandolier was adorned with grenades, their silver pins catching and reflecting the light, except for one grenade. In that instance, its squeeze-lever jutted out conspicuously at a right angle. Hi's mouth fell open in shock, and the lit cheroot cascaded to the ground, landing between his boots. In a desperate scramble to regain control, he rushed to his feet, trying to discard the shotguns and free his hands. Yet, in his frantic state, his fingers became entangled in the trigger guards, adding to the chaos. As he began to sprint, he finally managed to liberate his hands and dived frantically behind the parked car for cover. Desperation took hold as his hands darted in to grasp the grenade, but tragically, it was too late. A piercing, bright light erupted skyward, creating an explosion that roared with the intensity as if the earth itself was splitting apart, with flames suggesting the fiery depths of hell were breaking loose. Our view shifts upward, tracking the fire ascending toward the heavens where a stark white aluminum ladder climbed into the void of the night sky, clanking softly as it moved. The top of this ladder arched slowly toward the camera's lens. \n\nLate into the night, the nursery lay steeped in darkness, silent and empty except for the unpainted crib, which bore burned-in names: Harry, Barry, Larry, Garry, and Nathan Jr. As our perspective widens, Ed’s gentle arms carefully lower the peacefully slumbering Nathan Jr. into the crib. Hi, standing by, sets the singed copy of Dr. Spock’s *Baby and Child Care* beside the baby, and both he and Ed cast melancholic gazes down at the innocent slumbering child. The silence, deep and profound, is abruptly interrupted by the high-pitched bleat of a squeeze-me toy. Suddenly, the nursery lights snap on, jarring Hi and Ed into alertness. Nathan stands there in his pajamas, his hair disheveled, holding a gun while squinting against the sudden harshness of the light. His grip on the gun remains steady as he keeps it aimed at Hi and Ed, all the while slowly lifting a pair of eyeglasses to his nose. He advances cautiously into the nursery, using the gun as a gesture to direct Hi and Ed, who instinctively retreat from the crib. Nathan takes a moment to peer into the crib, studying the baby with a discerning eye before laying down the gun. Tenderness sweeps over him as he gently picks up the baby, holding him close against his chest with emotion welling up, a tear forming at the corner of his eye. Quietly, Hi and Ed begin to move back towards the ladder. Nathan, meanwhile, is gently bouncing the baby, his eyes observing Hi and Ed, and Hi offers a simple shrug in response. Nathan turns slightly to return the baby to the crib, but then spins around with a thought, prompting a small expression of surprise from Hi at witnessing such integrity. She stands still, gazing into the crib, and Hi steps up beside her, placing a comforting arm around her shoulder. Tears begin to form and fall as Ed gazes into the crib, her emotions spilling over, and Hi murmurs softly, offering comfort with gentle words. As they stand together, Nathan studies the pair, his eyes analyzing their presence. Hi turns to face him, speaking quickly, almost in a rush. Nathan looks across at her, finally nods in understanding, and lets out a sigh, resonating with acceptance."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As he awkwardly fumbled about Lenny’s chest, a hand grenade pin unexpectedly dangled and glinted with a bright, reflective gleam, precariously hanging from one of his fingers. This unexpected situation occurred because, during his frantic, hurried movements, his finger had inadvertently slipped right through the small, metallic ring of the grenade’s pin. His reaction was propelled by a chain of events, notably initiated by Hi, which prompted him to glance quickly downward, his eyes scanning the bandoliers that were draped across his chest. Each of these bandoliers was decorated with grenades, their silver pins catching and reflecting the ambient light—except for one grenade. In that critical moment, its squeeze-lever jutted out conspicuously at a sharp right angle. Hi's mouth fell open in utter shock, and the lit cheroot he had been holding cascaded to the ground, landing in the space between his boots. In a desperate scramble to regain control of the situation, he sprang to his feet, attempting to discard the shotguns and free his hands from the chaos. Yet, in his frantic state, his fingers became hopelessly entangled in the trigger guards, adding even more to the unfolding chaos. As he began to sprint with urgency, he finally managed to liberate his hands and dove frantically behind the parked car, seeking cover in desperation. However, desperation had already taken hold, and his hands darted in to grasp the grenade, but tragically, it was already too late. A piercing, bright light shattered the scene, erupting skyward with a force that created an explosion roaring with an intensity as if the earth itself was being violently split apart, flames suggesting that the fiery depths of hell were breaking loose. Our view then shifts upward, tracking the fire as it ascends toward the heavens, where a stark white aluminum ladder climbed into the void of the expansive night sky, softly clanking as it moved. The top of this ladder arched slowly toward the camera's lens, creating a striking visual.\n\nLate into the night, the nursery lay steeped deeply in darkness, silent and devoid of life except for the solitary, unpainted crib, which bore burned-in names: Harry, Barry, Larry, Garry, and Nathan Jr. As our perspective widens, Ed’s gentle and nurturing arms carefully lower the peacefully slumbering Nathan Jr. into the crib. Hi, standing close by, places the singed copy of Dr. Spock’s *Baby and Child Care* beside the baby, and both he and Ed cast melancholic, lingering gazes down at the innocent slumbering child. The silence, deep and profound, is suddenly and abruptly interrupted by the high-pitched bleat of a squeeze-me toy. In that moment, the nursery lights snap on, jolting Hi and Ed into a state of alertness. Nathan stands there in his pajamas, his hair disheveled and tousled, holding a gun while squinting against the sudden, harsh brightness of the light. His grip on the gun remains steady and unwavering as he keeps it aimed at Hi and Ed, all the while slowly lifting a pair of eyeglasses to rest on his nose. He advances cautiously into the nursery, using the gun as a gesture to direct Hi and Ed, who instinctively retreat from the crib. Nathan takes a moment to peer into the crib, studying the baby with a discerning, critical eye before laying down the gun. Tenderness washes over him as he gently picks up the baby, holding him close against his chest while emotion wells up inside, a tear forming at the corner of his eye. Quietly, Hi and Ed begin to move cautiously back toward the ladder. Nathan, meanwhile, is gently bouncing the baby, his eyes observing Hi and Ed, and Hi offers a simple shrug in response. Nathan turns slightly to return the baby to the crib, but then spins around with a thoughtful expression, prompting a small flicker of surprise from Hi at witnessing such integrity. She stands still, gazing deeply into the crib, while Hi steps up beside her, placing a comforting arm around her shoulders. Tears begin to form and fall as Ed gazes into the crib, her emotions spilling over, and Hi murmurs softly, offering comfort with gentle and reassuring words. As they stand together, Nathan studies the pair, his eyes keenly analyzing their presence. Hi turns to face him, speaking quickly, almost in a rush. Nathan looks across at her, then finally nods in understanding, letting out a sigh resonating with acceptance."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A hand grenade pin dangles, glinting under the light, from one of his fingers, caught on his finger as he inadvertently hooked it through the ring while pawing at Lenny's chest. In a split-second reaction and mirroring Hi's startled response, his gaze drops to his chest to discover the bandoliers strapped across it, each grenade's silver pin shining except for one, where its squeeze-lever protrudes at an awkward right angle. Hi's jaw falls open in disbelief, and the lit cheroot slips from his lips, tumbling to the ground between his boots. In a frantic bid to escape, he scrambles to his feet, desperately trying to let go of the shotguns to free his hands, only to find his fingers tangled in the trigger guards in his panic. As he begins to spring into motion, he finally liberates his hands, racing away to dive behind a nearby parked car. His hands dart towards the grenade, aiming to contain the impending threat, only to be too late, as a blinding light erupts skyward. A thunderous roar follows, as if the very earth is splitting apart, accompanied by a searing flame, as though the gates of hell have flung open. The camera pans upward, capturing the trail of fire against the sky where a white aluminum ladder ascends into the darkness, clanking softly with each movement. The ladder's top arcs gracefully toward the camera. Meanwhile, late at night, the nursery is engulfed in darkness, containing an unpainted crib adorned with the burned-in names: Harry, Barry, Larry, Garry, and Nathan Jr. As the view pulls back from the headboard, Ed's arms gently lower the sleeping Nathan Jr. into the crib. Hi places a singed copy of Dr. Spock's Baby and Child Care next to the baby, and both he and Ed look down at the baby with a sense of melancholy. Silence pervades the room until it's abruptly broken by the bleat of a squeeze-me toy as the lights snap on, startling both Hi and Ed. Nathan stands there in his pajamas, hair tousled, holding a gun and squinting against the sudden brightness. He keeps the gun trained on Hi and Ed while slowly raising a pair of eyeglasses to his nose and cautiously advancing into the nursery, gesturing with the gun for them to move. Hi and Ed retreat from the crib as Nathan peers inside, examining the baby momentarily before setting his gun down. With tenderness, he picks up the baby, holding it close to his chest as a tear wells up at the corner of his eye. Hi and Ed quietly edge back toward the ladder as Nathan bounces the baby gently, his eyes studying Hi and Ed, with Hi offering a slight shrug. Nathan turns back to return the baby to the crib, pauses with a contemplative expression, prompting Hi to register the integrity of the moment with surprised acknowledgment. She stands there, peering into the crib, as Hi steps up beside her, draping an arm around her shoulders. Ed begins to cry softly while gazing at the crib, and Hi whispers something softly to comfort her. Nathan observes the pair with scrutiny as Hi turns to face him, speaking rapidly. Nathan listens, then looks at her, eventually nodding his head with a resigned sigh."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A hand grenade pin dangles from his finger, snagged while he grappled with Lenny's chest, prompting him to check the bandoliers on his chest. They all glint with pins except for one, whose grenade squeeze-lever sticks out. Hi's jaw slackens, and his lit cheroot drops to the ground. Panicking, he scrambles to his feet, fumbles with the shotguns, and untangles his fingers from the trigger guards as he begins to run. He dives behind a parked car, but before he can grasp the grenade, it detonates with a blinding light and deafening roar, sending flames skyward. The camera catches a white aluminum ladder rising into the darkness, clanking softly as it arcs toward the camera. \n\nLater, in the dark nursery, Ed gently places the sleeping Nathan Jr. into the crib with names burned into it. Hi sets a singed copy of Dr. Spock's Baby and Child Care beside the baby as they both look down sadly. The silence breaks as a squeeze-me toy bleats, and the lights snap on, startling them. Nathan, in pajamas, disheveled and armed, squints against the light and cautiously advances, keeping the gun trained on Hi and Ed. They back away as Nathan inspects the baby, lays down the gun, and tenderly holds the baby to his chest, a tear forming in his eye. Hi and Ed quietly retreat towards the ladder while Nathan bounces the baby and studies them. Hi shrugs as Nathan puts the baby back in the crib, then turns back with a thoughtful pause, surprising Hi with his integrity. Ed stands gazing into the crib, and Hi steps beside her, comforting her as she softly cries. Nathan watches them, and Hi turns to him, speaking in a rush. Nathan nods and sighs in response."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A hand grenade pin hangs, glinting, from one of his fingers, as pawing at Lenny's chest he must have hooked his finger through its ring, an action that can trigger the grenade's explosion by releasing the safety mechanism. Reacting and reacting to Hi reacting, he looks down to see the bandoliers across his chest; these are ammunition belts used to carry grenades, with silver pins glinting in all the grenades except one, where its squeeze-lever juts at a right angle, indicating it is armed and ready to detonate. Hi's jaw drops and the lit cheroot, a type of thin cigar popular in some cultures for its sturdy tobacco flavor, hits the ground between his boots. Scrambling to his feet and trying to drop the shotguns to free his hands, in his panic his fingers tangle in the trigger guards, small loops of metal designed to protect the trigger from accidental discharge. Starting to run, he finally frees his hands and dives behind the parked car, using it as improvised cover. His hands fly in to wrap around the grenade, but too late, bright light blows sky-high, signifying the grenade's explosion with a powerful blast. There is a roar, as if the earth were cracking open, and flame, as if hell were slipping out with intense heat and destruction. We pan the fire to the sky where a white aluminum ladder, commonly used by firefighters for rescues, rises up into the blackness, clanking softly. The top of the ladder arcs toward the camera. Late at night, the nursery is dark and empty, of the unpainted crib with the burned-in names: Harry, Barry, Larry, Garry, and Nathan Jr., perhaps hinting at a tradition or series of hopes for multiple children. As we pull back from the headboard, Ed's arms gently deposit the sleeping Nathan Jr. into the crib. Hi puts the singed copy of Dr. Spock's Baby and Child Care, a bestselling parenting book known for its then-revolutionary advice to parents, next to the baby as he and Ed look sadly down at the baby. The silence is broken by the bleat of a squeeze-me toy, a soft toy that emits sound when pressed, as the lights are snapped on, startling Hi and Ed. Nathan stands in his jammies, hair disheveled from sleep, holding a gun and squinting against the light, keeping the gun trained on Hi and Ed as he slowly raises a pair of eyeglasses to his nose, a gesture hinting at his cautious nature, and advances cautiously into the nursery, gesturing with his gun. Hi and Ed back away from the crib as Nathan peers in, studies the baby for a moment, lays the gun down, tenderly picks up the baby, and holds him to his chest with a tear forming at the corner of his eye, showing his emotional connection to the child. Hi and Ed quietly move back towards the ladder as he bounces the baby, studying Hi and Ed, and Hi shrugs, possibly indicating resignation or acceptance of the situation. Nathan turns to put the baby back in the crib, turns around with a thought, and Hi does a small take, surprised at this much integrity, which suggests a change of heart or ethical decision. She stands looking into the crib, and Hi steps up next to her and puts an arm around her shoulder. Ed starts crying softly as she gazes into the crib, and Hi murmurs something to comfort her with gentle reassurance. Nathan is studying the two of them as Hi turns to face him and speaks in a rush, perhaps to explain or justify their actions. Nathan looks at her, finally nods, and sighs, signaling his reluctant understanding or acceptance."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "A hand grenade pin hangs glinting from one of his fingers as pawing at Lenny's chest. he must have hooked his finger through its ring. Reacting and reacting to Hi reacting he looks down to see the bandoliers across his chest with silver pins glinting in all the grenades except one where its squeezelever juts at a right angle. Hi's jaw drops and the lit cheroot hits the ground between his boots. Scrambling to his feet and trying to drop the shotguns to free his hands in his panic his fingers tangle in the trigger guards. Starting to run he finally frees his hands and dives behind the parked car. His hands fly in to wrap around the grenade but too late. bright light blows skyhigh. There is a roar as if the earth were cracking open and flame as if hell were slipping out. We pan the fire to the sky where a white aluminum ladder rises up into the blackness clanking softly. The top of the ladder arcs toward the camera. Late at night the nursery is dark and empty of the unpainted crib with the burnedin names Harry Barry Larry Garry and Nathan Jr. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. As we pull back from the headboard Ed's arms gently deposit the sleeping Nathan Jr into the crib. Hi puts the singed copy of Dr Spock's Baby and Child Care next to the baby as he and Ed look sadly down at the baby. The silence is broken by the bleat of a squeezeme toy as the lights are snapped on startling Hi and Ed. Nathan stands in his jammies hair disheveled holding a gun and squinting against the light keeping the gun trained on Hi and Ed as he slowly raises a pair of eyeglasses to his nose and advances cautiously into the nursery gesturing with his gun. Hi and Ed back away from the crib. as Nathan peers in studies. the baby for a moment lays the gun down tenderly picks up the baby and holds him to his chest with a tear forming at the corner of his eye. Hi and Ed quietly move back towards the ladder as he bounces the baby studying Hi and Ed and Hi shrugs. Nathan turns to put the baby back in the crib turns around with a thought and Hi does a small take surprised at this much integrity. She stands looking into the crib and Hi steps up next to her and puts an arm around her shoulder. Ed starts crying softly as she gazes into the crib and Hi murmurs something to comfort her. Nathan is studying the two of them as Hi turns to face him and speaks in a rush. Nathan looks at her finally nods and sighs."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "A hand grenade pin hangs glinting from one of his fingers as pawing at Lenny's chest. he must have hooked his finger through its ring. Reacting and reacting to Hi reacting he looks down to see the bandoliers across his chest with silver pins glinting in all the grenades except one where its squeezelever juts at a right angle. Hi's jaw drops and the lit cheroot hits the ground between his boots. Scrambling to his feet and trying to drop the shotguns to free his hands in his panic his fingers tangle in the trigger guards. Starting to run he finally frees his hands and dives behind the parked car. His hands fly in to wrap around the grenade but too late. bright light blows skyhigh. There is a roar as if the earth were cracking open and flame as if hell were slipping out. We pan the fire to the sky where a white aluminum ladder rises up into the blackness clanking softly. The top of the ladder arcs toward the camera. Late at night the nursery is dark and empty of the unpainted crib with the burnedin names Harry Barry Larry Garry and Nathan Jr. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. As we pull back from the headboard Ed's arms gently deposit the sleeping Nathan Jr into the crib. Hi puts the singed copy of Dr Spock's Baby and Child Care next to the baby as he and Ed look sadly down at the baby. The silence is broken by the bleat of a squeezeme toy as the lights are snapped on startling Hi and Ed. Nathan stands in his jammies hair disheveled holding a gun and squinting against the light keeping the gun trained on Hi and Ed as he slowly raises a pair of eyeglasses to his nose and advances cautiously into the nursery gesturing with his gun. Hi and Ed back away from the crib. as Nathan peers in studies. the baby for a moment lays the gun down tenderly picks up the baby and holds him to his chest with a tear forming at the corner of his eye. Hi and Ed quietly move back towards the ladder as he bounces the baby studying Hi and Ed and Hi shrugs. Nathan turns to put the baby back in the crib turns around with a thought and Hi does a small take surprised at this much integrity. She stands looking into the crib and Hi steps up next to her and puts an arm around her shoulder. Ed starts crying softly as she gazes into the crib and Hi murmurs something to comfort her. Nathan is studying the two of them as Hi turns to face him and speaks in a rush. Nathan looks at her finally nods and sighs."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "A hand grenade pin hangs glinting from one of his fingers as pawing at Lenny's chest. he must have hooked his finger through its ring. Reacting and reacting to Hi reacting he looks down to see the bandoliers across his chest with silver pins glinting in all the grenades except one where its squeezelever juts at a right angle. Hi's jaw drops and the lit cheroot hits the ground between his boots. Scrambling to his feet and trying to drop the shotguns to free his hands in his panic his fingers tangle in the trigger guards. Starting to run he finally frees his hands and dives behind the parked car. the baby for a moment lays the gun down tenderly picks up the baby and holds him to his chest with a tear forming at the corner of his eye. Hi and Ed quietly move back towards the ladder as he bounces the baby studying Hi and Ed and Hi shrugs. Nathan turns to put the baby back in the crib turns around with a thought and Hi does a small take surprised at this much integrity. She stands looking into the crib and Hi steps up next to her and puts an arm around her shoulder. Ed starts crying softly as she gazes into the crib and Hi murmurs something to comfort her. Nathan is studying the two of them as Hi turns to face him and speaks in a rush. Nathan looks at her finally nods and sighs."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "A hand grenade pin hangs glinting from one of his fingers as pawing at Lenny's chest. he must have hooked his finger through its ring. Ed starts crying softly as she gazes into the crib and Hi murmurs something to comfort her. Nathan is studying the two of them as Hi turns to face him and speaks in a rush. Nathan looks at her finally nods and sighs."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "A paperclip dangles, shining, from one of her toes, as scratching at Benny’s knee she must have snagged her foot through its loop. Responding and responding to Jo responding, she glances up to see the garlands across her waist with golden clips glinting in all the bracelets except one, where its clasp-jewel juts at an obtuse angle. Jo's eyes widen and the lit cigarillo tumbles to the rug between her sneakers. Lunging to her hands and trying to discard the newspapers to free her arms, in her haste her elbows tangle in the rubber bands. Beginning to skip, she eventually frees her arms and dives below the parked motorcycle. Her arms dive in to grip the bracelet, but too late, radiant glow bursts skyward. There is an explosion, as if the sky were splitting wide, and smoke, as if thunder were spilling out. We tilt the flames to the cosmos where a blue plastic stepladder climbs up into the shadow, clinking gently. The peak of the stepladder pivots toward the lens. Late in the evening, the greenhouse is dim and vacant, of the unvarnished table with the etched initials: Felix, Alex, Rex, Lex, and Norman Jr. As we pull away from the tabletop, Ned's hands softly place the slumbering Norman Jr. onto the table. Jo places the scorched edition of Dr. Seuss's Green Eggs and Ham beside the toddler as she and Ned gaze thoughtfully down at the toddler. The quiet is interrupted by the squeak of a wind-up car as the bulbs are flicked on, startling Jo and Ned. Norman stands in his overalls, hair tousled, gripping a stick and blinking against the brightness, keeping the stick aimed at Jo and Ned as he gradually lifts a pair of binoculars to his forehead and steps cautiously into the greenhouse, waving with his stick. Jo and Ned edge away from the table as Norman peers over, inspects the toddler for an instant, sets the stick down, gently scoops up the toddler, and hugs him to his stomach with a tear forming at the edge of his cheek. Jo and Ned quietly advance towards the stepladder as he cradles the toddler, examining Jo and Ned, and Jo shrugs. Norman turns to place the toddler back on the table, turns around with a notion, and Jo does a small double-take, startled at this level of honesty. She stands looking over the table, and Jo steps up beside her and places an arm around her elbow. Ned starts weeping softly as he looks into the table, and Jo whispers something to console him. Norman is observing the two of them as Jo turns to address him and speaks in a flurry. Norman looks at him, eventually nods, and exhales deeply."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A grenade pin hangs from Hi's finger after it catches on Lenny's chest. Realizing a grenade is about to explode, Hi drops his shotguns, tangles with the trigger guards, and dives behind a car. Despite his efforts, the grenade explodes, engulfing the scene in flames. A ladder rises into the sky amidst the chaos. Later, in a dark nursery, Ed gently places the sleeping Nathan Jr. into a crib with burned-in names. Hi places a singed Dr. Spock's Baby and Child Care book beside the baby. Suddenly, Nathan enters, disheveled and armed, surprising Hi and Ed. After a tense moment, Nathan lays down his weapon, tenderly holds the baby, and sheds a tear. Hi and Ed quietly retreat as Nathan bounces the baby. Nathan's integrity surprises Hi when he turns to put the baby back. Ed starts crying softly, and Hi comforts her. Nathan observes them, listens to Hi's rushed words, nods, and sighs."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Nathan looks at her finally nods and sighs Nathan is studying the two of them as Hi turns to face him and speaks in a rush Ed starts crying softly as she gazes into the crib and Hi murmurs something to comfort her She stands looking into the crib and Hi steps up next to her and puts an arm around her shoulder Nathan turns to put the baby back in the crib turns around with a thought and Hi does a small take surprised at this much integrity Hi and Ed quietly move back towards the ladder as he bounces the baby studying Hi and Ed and Hi shrugs the baby for a moment lays the gun down tenderly picks up the baby and holds him to his chest with a tear forming at the corner of his eye as Nathan peers in studies Hi and Ed back away from the crib Nathan stands in his jammies hair disheveled holding a gun and squinting against the light keeping the gun trained on Hi and Ed as he slowly raises a pair of eyeglasses to his nose and advances cautiously into the nursery gesturing with his gun The silence is broken by the bleat of a squeezeme toy as the lights are snapped on startling Hi and Ed Hi puts the singed copy of Dr Spock's Baby and Child Care next to the baby as he and Ed look sadly down at the baby As we pull back from the headboard Ed's arms gently deposit the sleeping Nathan Jr into the crib Late at night the nursery is dark and empty of the unpainted crib with the burnedin names Harry Barry Larry Garry and Nathan Jr The top of the ladder arcs toward the camera We pan the fire to the sky where a white aluminum ladder rises up into the blackness clanking softly There is a roar as if the earth were cracking open and flame as if hell were slipping out bright light blows skyhigh His hands fly in to wrap around the grenade but too late Starting to run he finally frees his hands and dives behind the parked car Scrambling to his feet and trying to drop the shotguns to free his hands in his panic his fingers tangle in the trigger guards Hi's jaw drops and the lit cheroot hits the ground between his boots Reacting and reacting to Hi reacting he looks down to see the bandoliers across his chest with silver pins glinting in all the grenades except one where its squeezelever juts at a right angle he must have hooked his finger through its ring A hand grenade pin hangs glinting from one of his fingers as pawing at Lenny's chest"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "he must have hooked his finger through its ring A hand grenade pin hangs glinting from one of his fingers as pawing at Lenny's chest Hi's jaw drops and the lit cheroot hits the ground between his boots Reacting and reacting to Hi reacting he looks down to see the bandoliers across his chest with silver pins glinting in all the grenades except one where its squeezelever juts at a right angle Starting to run he finally frees his hands and dives behind the parked car Scrambling to his feet and trying to drop the shotguns to free his hands in his panic his fingers tangle in the trigger guards bright light blows skyhigh His hands fly in to wrap around the grenade but too late We pan the fire to the sky where a white aluminum ladder rises up into the blackness clanking softly There is a roar as if the earth were cracking open and flame as if hell were slipping out Late at night the nursery is dark and empty of the unpainted crib with the burnedin names Harry Barry Larry Garry and Nathan Jr The top of the ladder arcs toward the camera Hi puts the singed copy of Dr Spock's Baby and Child Care next to the baby as he and Ed look sadly down at the baby As we pull back from the headboard Ed's arms gently deposit the sleeping Nathan Jr into the crib Nathan stands in his jammies hair disheveled holding a gun and squinting against the light keeping the gun trained on Hi and Ed as he slowly raises a pair of eyeglasses to his nose and advances cautiously into the nursery gesturing with his gun The silence is broken by the bleat of a squeezeme toy as the lights are snapped on startling Hi and Ed as Nathan peers in studies Hi and Ed back away from the crib Hi and Ed quietly move back towards the ladder as he bounces the baby studying Hi and Ed and Hi shrugs the baby for a moment lays the gun down tenderly picks up the baby and holds him to his chest with a tear forming at the corner of his eye She stands looking into the crib and Hi steps up next to her and puts an arm around her shoulder Nathan turns to put the baby back in the crib turns around with a thought and Hi does a small take surprised at this much integrity Nathan is studying the two of them as Hi turns to face him and speaks in a rush Ed starts crying softly as she gazes into the crib and Hi murmurs something to comfort her Nathan looks at her finally nods and sighs"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Hi puts the singed copy of Dr Spock's Baby and Child Care next to the baby as he and Ed look sadly down at the baby The silence is broken by the bleat of a squeezeme toy as the lights are snapped on startling Hi and Ed Nathan stands in his jammies hair disheveled holding a gun and squinting against the light keeping the gun trained on Hi and Ed as he slowly raises a pair of eyeglasses to his nose and advances cautiously into the nursery gesturing with his gun Hi and Ed back away from the crib as Nathan peers in studies the baby for a moment lays the gun down tenderly picks up the baby and holds him to his chest with a tear forming at the corner of his eye Hi and Ed quietly move back towards the ladder as he bounces the baby studying Hi and Ed and Hi shrugs Nathan turns to put the baby back in the crib turns around with a thought and Hi does a small take surprised at this much integrity She stands looking into the crib and Hi steps up next to her and puts an arm around her shoulder Ed starts crying softly as she gazes into the crib and Hi murmurs something to comfort her Nathan is studying the two of them as Hi turns to face him and speaks in a rush Nathan looks at her finally nods and sighs A hand grenade pin hangs glinting from one of his fingers as pawing at Lenny's chest he must have hooked his finger through its ring Reacting and reacting to Hi reacting he looks down to see the bandoliers across his chest with silver pins glinting in all the grenades except one where its squeezelever juts at a right angle Hi's jaw drops and the lit cheroot hits the ground between his boots Scrambling to his feet and trying to drop the shotguns to free his hands in his panic his fingers tangle in the trigger guards Starting to run he finally frees his hands and dives behind the parked car His hands fly in to wrap around the grenade but too late bright light blows skyhigh There is a roar as if the earth were cracking open and flame as if hell were slipping out We pan the fire to the sky where a white aluminum ladder rises up into the blackness clanking softly The top of the ladder arcs toward the camera Late at night the nursery is dark and empty of the unpainted crib with the burnedin names Harry Barry Larry Garry and Nathan Jr As we pull back from the headboard Ed's arms gently deposit the sleeping Nathan Jr into the crib"
        }
      ]
    }
  ]
}