{
  "ground_truth": "Florence sits reading Dr. Spock's Baby and Child Care in a living room dominated by a large oil portrait of Nathan and Florence, gazing out from the wall over the mantelpiece. From somewhere upstairs, an infant starts to cry, causing Florence to stop reading and look up at the ceiling, while Nathan is oblivious. The baby stops crying, and Florence's attention returns to her book. As he throws out his wrist to look at his watch, a third title is supered beneath the first two: 8:45 p.m. He starts to replace the receiver but brings it back with an afterthought, and as he slams the phone into the cradle the titles disappear. Another baby starts crying, making Florence look up at the ceiling again. A close-up on the crying baby shows Hi bouncing it gently but desperately. The babies sound restless. A floor-level wide-angle shot shows a baby crawling toward the camera in the foreground, while another baby is rounding the open door from the nursery, making a mad dash for freedom in the background. Hi emerges from the nursery, stepping around the background baby and trotting toward the baby in the foreground. By the time he reaches it, the low-angle cropping shows us only his feet and calves, along with the baby and the stairway down to the main floor. He scoops up the baby and hurriedly tiptoes away toward the nursery. The baby is at the nursery door in the foreground with the staircase in the background. As Hi reaches the baby, footsteps are heard climbing the stairs. Hi's free arm scoops the baby up and out of frame just as Florence's head appears, bobbing up as she climbs the stairs. She approaches the nursery, still clutching the Dr. Spock book. As Florence enters from the hallway door, she tracks back into the room and approaches the crib. Halfway there she freezes, staring in shock. ED's POV reveals Hi approaching the car, shrugging and displaying manifestly empty hands. Hi appears at the driver's window, reaching to open the door, but Ed slaps his hand away from the handle. He tries to open the door, which Ed is holding shut with all her might, rolling up the window and locking the door. Through the closed window, a muffled, very forlorn voice can be heard. Florence is holding one of the babies cradled against her shoulder, with the baby peeping out over her shoulder, facing the window, looking. Hi's head appears in the window, looking back as he holds a finger to his lips. Florence starts bouncing the baby, patting it on the back, and Hi and the window bounce up and down.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Florence perches perusing Dr. Spock's Infant and Offspring Care in a lounge room governed by a sizable oil depiction of Nathan and Florence, staring out from the partition over the mantel. From someplace upstairs, a toddler commences to wail, prompting Florence to halt perusing and glance up at the ceiling, while Nathan is unaware. The infant ceases wailing, and Florence's attention reverts to her publication. As he flings out his wrist to glance at his timepiece, a third caption is superimposed beneath the initial two: 8:45 p.m. He begins to restore the handset but brings it back with an afterthought, and as he slams the telephone into the cradle the captions vanish. Another toddler starts wailing, making Florence glance up at the ceiling again. A close-up on the wailing toddler shows Hi bouncing it softly but frantically. The infants sound uneasy. A floor-level wide-angle shot shows a toddler crawling toward the lens in the foreground, while another toddler is rounding the open entryway from the nursery, making a frenzied sprint for liberty in the background. Hi emerges from the nursery, stepping around the background toddler and trotting toward the toddler in the foreground. By the occasion he reaches it, the low-angle cropping shows us only his feet and calves, along with the toddler and the stairway down to the primary floor. He scoops up the toddler and hurriedly tiptoes away toward the nursery. The toddler is at the nursery entryway in the foreground with the staircase in the background. As Hi reaches the toddler, footsteps are perceived ascending the stairs. Hi's free arm scoops the toddler up and out of frame just as Florence's head appears, bobbing up as she ascends the stairs. She approaches the nursery, still clutching the Dr. Spock book. As Florence enters from the hallway entryway, she tracks back into the room and approaches the crib. Midway there she freezes, staring in shock. ED's POV reveals Hi approaching the vehicle, shrugging and displaying manifestly vacant hands. Hi appears at the driver's window, reaching to open the door, but Ed slaps his hand away from the handle. He attempts to open the door, which Ed is holding closed with all her power, rolling up the window and locking the door. Through the sealed window, a muffled, very desolate voice can be heard. Florence is clutching one of the toddlers cradled against her shoulder, with the toddler peeping out over her shoulder, facing the window, looking. Hi's head appears in the window, looking back as he holds a digit to his lips. Florence starts bouncing the toddler, patting it on the back, and Hi and the window bounce up and down."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Florence is seated reading Dr. Spock's Baby and Child Care in a living room that is dominated by a large oil portrait of Nathan and Florence, who gaze out from the wall over the mantelpiece. An infant's cry starts from somewhere upstairs, which causes Florence to stop reading and look up at the ceiling, while Nathan remains oblivious. The baby ceases crying, and her attention returns to the book. A third title is supered beneath the first two: 8:45 p.m., as he throws out his wrist to look at his watch. He starts replacing the receiver but brings it back with an afterthought, and titles disappear as the phone is slammed into the cradle by him. Another baby begins crying, and the ceiling is looked up at by Florence again. A close-up on the crying baby shows Hi gently but desperately bouncing it. The babies sound restless. A floor-level wide-angle shot shows a baby crawling toward the camera in the foreground, while another baby rounds the open door from the nursery, making a mad dash for freedom in the background. The nursery is emerged from by Hi, who steps around the background baby and trots toward the baby in the foreground. By the time it is reached by him, the low-angle cropping shows only his feet and calves, along with the baby and the stairway down to the main floor. The baby is scooped up by him, and he hurriedly tiptoes away toward the nursery. The baby is at the nursery door in the foreground, with the staircase in the background. As the baby is reached by Hi, footsteps climbing the stairs are heard. Hi's free arm scoops the baby up and out of frame just as Florence's head appears, bobbing up as she climbs the stairs. The nursery is approached by her, still clutching the Dr. Spock book. As the room is entered from the hallway door by Florence, she tracks back into the room and approaches the crib. Halfway there she freezes, staring in shock. Hi's approach to the car, shrugging and displaying manifestly empty hands, is revealed by ED's POV. Hi appears at the driver's window, and he reaches to open the door, but his hand is slapped away from the handle by Ed. He tries opening the door, which is held shut by Ed with all her might, and the window is rolled up as the door is locked by her. Through the closed window, a muffled, very forlorn voice can be heard. One of the babies is held by Florence, cradled against her shoulder, with the baby peeping out over her shoulder, facing the window, looking. Hi's head appears in the window, looking back as a finger is held to his lips by him. Florence starts bouncing the baby, and it is patted on the back by her, while Hi and the window bounce up and down."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Florence is reading Dr. Spock's Baby and Child Care in a living room with a large oil portrait of Nathan and Florence over the mantelpiece. An infant's cry from upstairs interrupts her, making her look at the ceiling, while Nathan remains unaware. The baby stops, and Florence resumes reading. A third title appears: 8:45 p.m. After a pause, Nathan slams the phone back into the cradle. Another baby cries, and Florence looks up again. A close-up reveals Hi bouncing the baby gently. A floor-level shot shows a baby crawling toward the camera, while another dashes for freedom. Hi emerges, sidestepping the background baby to reach the foreground one. As he scoops it up and tiptoes back to the nursery, footsteps are heard climbing the stairs. Hi takes the baby just as Florence appears, clutching her book. She enters the nursery and freezes in shock. Hi shrugs empty-handed at the car. At the driver's window, he reaches for the door, but Ed slaps his hand away, rolling up the window and locking the door. Through the window, a muffled voice is heard. Florence cradles a baby over her shoulder, facing the window. Hi appears, signaling silence, as Florence bounces the baby, patting it, with Hi in the background."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Florence reads Dr. Spock’s Baby and Child Care in a living room featuring a large oil portrait of her and Nathan. An infant's cry from upstairs makes Florence pause and look up, Nathan remains unaware. At 8:45 p.m., Florence resumes her book. Another baby's cry diverts her again. Hi bounces a restless baby, and a wide-angle shot captures a baby crawling while another dashes from the nursery. Hi navigates around, collecting the baby near the stairs. Florence ascends, holding her book, and is shocked when she reaches the nursery. ED sees Hi approach the car with empty hands. At the driver's window, Ed denies him entry, locking the door. Hi's forlorn voice is muffled. Florence holds a baby, facing the window, and Hi gestures for quiet. Florence bounces and pats the baby as Hi and the window bounce."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Florence is comfortably seated in the cozy living room, deeply engrossed in reading Dr. Spock's well-known book, *Baby and Child Care*. This living space is notably dominated by a large, imposing oil portrait of Nathan and Florence, both of whom gaze out solemnly from the wall above the mantelpiece, their eyes seemingly watching over the room. From somewhere in the upper part of the house, the unmistakable sound of an infant beginning to cry echoes, momentarily interrupting Florence's focus, prompting her to pause her reading and glance upwards toward the ceiling. Nathan, however, remains completely unaware and oblivious to the commotion. After a brief moment, the baby's cries cease, allowing Florence to refocus her attention back on her engrossing book.\n\nMeanwhile, Nathan, with a quick flick of his wrist, glances down at his wristwatch. A third title is superimposed under the preceding two, marking the time clearly as 8:45 p.m. As Nathan initially moves to place the telephone receiver back onto its cradle, he hesitates, reconsidering his action, and then forcefully slams the phone into place, causing the titles to vanish from sight. Suddenly, another baby begins to cry, capturing Florence's attention once again as she looks up at the ceiling. A close-up shot of the crying infant reveals Hi tenderly, yet somewhat desperately, bouncing the baby up and down in an attempt to soothe it. The babies' cries resonate, suggesting restlessness.\n\nA wide-angle shot captures a baby determinedly crawling toward the camera, placed at floor level in the foreground, while another infant energetically rounds the open nursery door in the background, seemingly making a wild dash for newfound freedom. Hi emerges hurriedly from the nursery, carefully navigating around the background baby as he briskly moves toward the baby in the foreground. As he reaches this infant, the low-angle camera cropping reveals only Hi's feet and calves, alongside the baby and the stairway leading to the main floor. Hi quickly scoops up the baby and tiptoes away with haste back toward the nursery's safety. \n\nThe infant, now at the nursery door in the foreground, is juxtaposed with the staircase visible in the background. Hi reaches the baby just as the sound of footsteps ascending the stairs becomes audible. With one swift motion, Hi uses his free arm to gather up the baby and swiftly move it out of the frame, coinciding precisely with the moment when Florence's head appears, bobbing into view as she ascends the stairway. She purposefully approaches the nursery, still clutching the Dr. Spock book. \n\nAs Florence enters the nursery through the doorway from the hallway, she retraces her steps into the room and makes her way toward the crib. Midway there, she freezes in place, staring ahead in utter shock. From ED's point of view, Hi is seen approaching the car, gesturing with a shrug and displaying his obviously empty hands. As Hi reaches the driver's-side window, he makes an attempt to open the door, only for Ed to defiantly slap his hand away, preventing access to the handle. Hi again endeavors to open the door and finds Ed holding it shut with all her strength, rolling up the window and successfully locking the door. Through the now-closed window, Hi's muffled, forlorn voice can be faintly heard. \n\nMeanwhile, Florence is holding one of the babies securely cradled against her shoulder, with the baby's curious eyes peeking out over her shoulder, facing the window and observing the scene. Hi's head pops into view within the window frame, looking back at Florence as he places a finger to his lips in a gesture to maintain quiet. Florence begins to gently bounce the baby, softly patting its back in a soothing manner, while Hi and the window seem to bounce along with the rhythm."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Florence is comfortably seated in the inviting and warm ambiance of the cozy living room, deeply engrossed in her reading of Dr. Spock's renowned and insightful book, *Baby and Child Care*. This particular living space is notably dominated by a large, imposing oil portrait of Nathan and Florence, both of whom gaze out solemnly and thoughtfully from the wall above the mantelpiece, their eyes seemingly watching over the entire room with quiet vigilance. From somewhere in the upper part of the house, the unmistakable sound of an infant beginning to cry echoes throughout the space, momentarily interrupting Florence's focus, prompting her to pause her reading and glance upwards toward the ceiling with a curious expression. Nathan, however, remains completely unaware and utterly oblivious to the commotion that has just unfolded. After a brief moment, the baby's cries gracefully subside, allowing Florence to refocus and divert her attention back to her engrossing and captivating book.\n\nMeanwhile, Nathan, with a quick and deft flick of his wrist, glances down at his wristwatch, which sits firmly on his arm. A third title becomes superimposed beneath the preceding two, clearly marking the exact time as 8:45 p.m. As Nathan initially moves to place the telephone receiver back onto its awaiting cradle, he hesitates, reconsidering this action, and then, with sudden determination, forcefully slams the phone into place, causing the titles to vanish swiftly from sight. Suddenly, another baby begins to cry, capturing and drawing Florence's attention once again as she instinctively looks up at the ceiling. A close-up shot reveals the crying infant, showing Hi tenderly, yet somewhat desperately, bouncing the baby up and down in a heartfelt attempt to soothe and calm it. The babies' cries echo and resonate throughout the space, suggesting their restlessness and discomfort.\n\nA wide-angle shot captures a baby determinedly crawling toward the camera, which is strategically placed at floor level in the foreground, while another infant energetically rounds the open nursery door in the background, seemingly making a wild dash for newfound freedom and exploration. Hi emerges hurriedly from the nursery, carefully navigating around the baby in the background as he briskly moves with purpose toward the baby in the foreground. As Hi reaches this infant, the low-angle camera cropping reveals only Hi's feet and calves, alongside the baby and the stairway leading to the main floor of the house. Hi quickly scoops up the baby and tiptoes away with haste, moving back toward the safety of the nursery.\n\nThe infant, now situated at the nursery door in the foreground, is juxtaposed with the staircase, which remains visible in the background. Hi reaches the baby just as the sound of footsteps ascending the stairs becomes audible and echoes through the space. With one swift and fluid motion, Hi uses his free arm to gather up the baby and swiftly move it out of the frame, coinciding precisely with the exact moment when Florence's head appears, bobbing gently into view as she ascends the stairway. She purposefully approaches the nursery with determined steps, still clutching the Dr. Spock book firmly in her grasp.\n\nAs Florence enters the nursery through the doorway from the hallway, she retraces her steps carefully into the room and makes her way purposefully toward the crib. Midway there, she freezes in place, staring directly ahead in utter shock and disbelief. From ED's point of view, Hi is seen approaching the car, gesturing with a shrug and displaying his obviously empty hands. As Hi reaches the driver's-side window, he makes an attempt to open the door, only for Ed to defiantly slap his hand away, preventing any access to the handle. Hi again endeavors to open the door and finds Ed holding it shut with all her strength, rolling up the window and successfully locking the door. Through the now-closed window, Hi's muffled, forlorn voice can be faintly heard, almost like an echo.\n\nMeanwhile, Florence is holding one of the babies securely cradled against her shoulder, with the baby's curious eyes peeking out over her shoulder, facing the window and observing the unfolding scene. Hi's head pops into view within the window frame, looking back at Florence as he places a finger to his lips in a gentle gesture to maintain quiet. Florence begins to gently bounce the baby, softly patting its back in a rhythmic and soothing manner, while Hi and the window seem to bounce along with the calming rhythm she sets."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Florence is seated comfortably in the living room with Dr. Spock's Baby and Child Care book open in her hands, her gaze occasionally drifting toward the large and imposing oil portrait of her and Nathan that hangs prominently over the mantelpiece. As she immerses herself in the text, a sudden cry pierces the air from somewhere upstairs, causing her to momentarily halt her reading and direct her eyes upward toward the ceiling in response to the sound, even as Nathan remains unaware of the disturbance. The crying subsides, allowing Florence to refocus her attention back on her book. Meanwhile, Nathan, seated elsewhere, extends his arm outward with a quick flick, checking the time on his wristwatch as a third title appears on the screen, indicating the time as 8:45 p.m. He begins the motion of returning the phone receiver to its cradle but pauses with a sudden idea, bringing it back to his ear for a moment before decisively slamming it down, causing the on-screen titles to vanish. Yet again, the stillness is interrupted by another baby's cries, prompting Florence to lift her gaze to the ceiling once more. A close-up shot reveals Hi, gently but a bit frantically bouncing one of the restless babies, trying to soothe it. A wide-angle perspective at floor level captures a baby crawling determinedly toward the camera while another baby, bursting with energy, makes a swift escape attempt from the nursery, rounding the open door with a sense of urgency. Hi exits the nursery just in time to avoid the second baby, maneuvering skillfully around it as he heads toward the first baby in the foreground. By the time he reaches it, the camera, angled low, offers a view of only Hi's feet and calves, along with the baby and the stairway leading down to the main floor. Swiftly and quietly, Hi gathers the baby into his arms and retreats back toward the nursery on tiptoe. As Hi maneuvers deftly to collect the baby at the nursery door, footsteps are heard ascending the stairs. With his free arm, he lifts the baby just out of view as Florence's head comes into sight, bobbing up the staircase as she makes her ascent, still clutching the Dr. Spock book. Entering from the hallway door, she moves back into the room, steadily approaching the crib. Midway to her destination, she halts abruptly, frozen in shock as her gaze locks onto an unexpected sight. From Ed's point of view, we see Hi approaching the car, his body language a mix of resignation and innocence, with his empty hands held up in a shrug. Hi positions himself at the driver's window, reaching out to open the door, but Ed reacts swiftly, swatting his hand away from the handle. He makes a further attempt to open the door, but Ed resists, holding it firmly shut with all her strength while simultaneously rolling up the window and securing the lock. Through the barrier of the closed window, a muffled and forlorn voice faintly reaches Ed's ears. Meanwhile, inside, Florence is seen cradling one of the babies tenderly against her shoulder, the baby's curious eyes peeking over to gaze out the window. Hi's face appears framed in the window, looking back at Florence with a quiet plea for silence as he presses a finger to his lips. Florence begins to gently bounce the baby, rhythmically patting it on the back, creating a synchronized movement as both Hi and the window seem to bounce in unison."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Florence is seated in the living room engrossed in Dr. Spock's Baby and Child Care, beneath a large oil portrait of herself and Nathan. When an infant begins to cry from upstairs, Florence pauses to listen, though Nathan remains unaware. The crying stops, and she resumes reading. Meanwhile, Nathan checks his watch and, after a moment of hesitation, slams the phone into its cradle as the superimposed title \"8:45 p.m.\" disappears. Another baby starts crying, drawing Florence's gaze upwards again. Upstairs, Hi is seen desperately bouncing a crying baby. As the scene unfolds, a baby crawls toward the camera, while another makes a dash for freedom from the nursery. Hi navigates around the escaping baby and quickly moves to scoop up the other, tiptoeing back towards the nursery. He picks up the baby just as Florence appears on the stairs, still holding the Dr. Spock book. Entering the nursery, she halts midway, shocked by what she sees. From Ed's perspective, Hi approaches the car, empty-handed and shrugging. When Hi attempts to open the car door, Ed resists, locking the door and rolling up the window. Hi, now at the window, gestures for quiet with a forlorn expression. Florence, with a baby on her shoulder, looks through the window as Hi signals silence, and she gently pats the baby’s back, both her movements and Hi's head in the window rising and falling rhythmically."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Florence, sitting in a cozy living room dominated by a large oil portrait of herself and her husband Nathan, gazes at the book \"Dr. Spock's Baby and Child Care,\" a bestselling parenting guide first published in 1946 that revolutionized child-rearing advice. The portrait looms over the mantelpiece, offering a classic symbol of family unity. From somewhere upstairs in their suburban home, an infant starts to cry, interrupting Florence's reading and drawing her gaze upward to the ceiling, while Nathan remains oblivious to the noise, absorbed in his own world. The baby's cries cease, allowing Florence to immerse herself back in the comforting and instructive pages of her book. At this point, Nathan throws out his wrist to check his watch, a sleek model indicative of his punctual nature, and at that moment, a third title appears beneath the first two: 8:45 p.m., marking the late evening hour that signals approaching bedtime for the babies. He starts to replace the receiver but hesitates, bringing it back with a sudden thought, and as he slams the phone into the cradle with a decisive motion, the displayed titles disappear. \n\nAnother baby begins to cry, capturing Florence's attention once more as she looks up to the ceiling. A close-up reveals Hi, the caregiver, bouncing the baby gently yet desperately, trying to soothe its restlessness. The babies, seemingly energetic even at this hour, sound restless. A floor-level wide-angle shot shows one baby crawling eagerly toward the camera in the foreground, while another exuberantly rounds the open door from the nursery, making a mad dash for freedom in the background—a common adventure for inquisitive toddlers. Hi, emerging from the nursery with an air of determined patience, steps around the adventurous baby and trots toward the one in the foreground. By the time he reaches it, the low-angle cropping captures only his feet and calves, along with the baby and the stairway leading down to the main floor, a familiar setting in their bustling household. Hi scoops up the baby with practiced ease and hurriedly tiptoes back toward the nursery. \n\nThe baby is at the nursery door in the foreground, the staircase stretching into the background. As Hi reaches the baby, footsteps are heard climbing the stairs, signaling Florence's approach. Hi's free arm lifts the baby up and out of frame just as Florence's head appears, bobbing as she ascends the stairs, still clutching the Dr. Spock book, emblematic of her diligent parenting efforts. As Florence enters from the hallway, she tracks back into the room and approaches the crib. Halfway there, she freezes, staring in shock at the scene unfolding before her. From Ed's point of view, Hi is seen approaching the car parked in their driveway, shrugging and displaying noticeably empty hands. Hi appears at the driver's window, reaching to open the door, but Ed, with a protective instinct, slaps his hand away from the handle. He attempts to open the door, which Ed holds shut with surprising strength, rolling up the window and locking the door in a defensive maneuver. Through the closed window, a muffled, very forlorn voice can be heard, adding a touch of humor to the tense situation. Florence, ever nurturing, holds one of the babies cradled against her shoulder, with the baby peeping out over her shoulder, facing the window, watching intently. Hi's head appears in the window, looking back as he holds a finger to his lips, a universal sign for silence. Florence begins gently bouncing the baby, patting it on the back in a soothing rhythm, while Hi and the window seem to bounce up and down, a comical yet tender moment in the midst of their chaotic evening."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Florence sits reading Dr Spock's Baby and Child Care in a living room dominated by a large oil portrait of Nathan and Florence gazing out from the wall over the mantelpiece. From somewhere upstairs an infant starts to cry causing Florence to stop reading and look up at the ceiling while Nathan is oblivious. The baby stops crying and Florence's attention returns to her book. As he throws out his wrist to look at his watch a third title is supered beneath the first two. 845 pm. He starts to replace the receiver but brings it back with an afterthought and as he slams the phone into the cradle the titles disappear. Another baby starts crying making Florence look up at the ceiling again. A closeup on the crying baby shows Hi bouncing it gently but desperately. The babies sound restless. A floorlevel wideangle shot shows a baby crawling toward the camera in the foreground while another baby is rounding the open door from the nursery making a mad dash for freedom in the background. Hi emerges from the nursery stepping around the background baby and trotting toward the baby in the foreground. By the time he reaches it the lowangle cropping shows us only his feet and calves along with the baby and the stairway down to the main floor. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. He scoops up the baby and hurriedly tiptoes away toward the nursery. The baby is at the nursery door in the foreground with the staircase in the background. As Hi reaches the baby footsteps are heard climbing the stairs. Hi's free arm scoops the baby up and out of frame just as Florence's head appears bobbing up as she climbs the stairs. She approaches the nursery still clutching the Dr Spock book. As Florence enters from the hallway door she tracks back into the room and approaches the crib. Halfway there she freezes staring in shock. ED's POV reveals Hi approaching the car shrugging and displaying manifestly empty hands. Hi appears at the driver's window reaching to open the door but Ed slaps his hand away from the handle. He tries to open the door which Ed is holding shut with all her might rolling up the window and locking the door. Through the closed window a muffled very forlorn voice can be heard. Florence is holding one of the babies cradled against her shoulder with the baby peeping out over her shoulder facing the window looking Hi's head appears in the window looking back as he holds a finger to his lips. Florence starts bouncing the baby patting it on the back and Hi and the window bounce up and down."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Florence sits reading Dr Spock's Baby and Child Care in a living room dominated by a large oil portrait of Nathan and Florence gazing out from the wall over the mantelpiece. From somewhere upstairs an infant starts to cry causing Florence to stop reading and look up at the ceiling while Nathan is oblivious. The baby stops crying and Florence's attention returns to her book. As he throws out his wrist to look at his watch a third title is supered beneath the first two. 845 pm. He starts to replace the receiver but brings it back with an afterthought and as he slams the phone into the cradle the titles disappear. Another baby starts crying making Florence look up at the ceiling again. A closeup on the crying baby shows Hi bouncing it gently but desperately. The babies sound restless. A floorlevel wideangle shot shows a baby crawling toward the camera in the foreground while another baby is rounding the open door from the nursery making a mad dash for freedom in the background. Hi emerges from the nursery stepping around the background baby and trotting toward the baby in the foreground. By the time he reaches it the lowangle cropping shows us only his feet and calves along with the baby and the stairway down to the main floor. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. He scoops up the baby and hurriedly tiptoes away toward the nursery. The baby is at the nursery door in the foreground with the staircase in the background. As Hi reaches the baby footsteps are heard climbing the stairs. Hi's free arm scoops the baby up and out of frame just as Florence's head appears bobbing up as she climbs the stairs. She approaches the nursery still clutching the Dr Spock book. As Florence enters from the hallway door she tracks back into the room and approaches the crib. Halfway there she freezes staring in shock. ED's POV reveals Hi approaching the car shrugging and displaying manifestly empty hands. Hi appears at the driver's window reaching to open the door but Ed slaps his hand away from the handle. He tries to open the door which Ed is holding shut with all her might rolling up the window and locking the door. Through the closed window a muffled very forlorn voice can be heard. Florence is holding one of the babies cradled against her shoulder with the baby peeping out over her shoulder facing the window looking Hi's head appears in the window looking back as he holds a finger to his lips. Florence starts bouncing the baby patting it on the back and Hi and the window bounce up and down."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Florence sits reading Dr Spock's Baby and Child Care in a living room dominated by a large oil portrait of Nathan and Florence gazing out from the wall over the mantelpiece. From somewhere upstairs an infant starts to cry causing Florence to stop reading and look up at the ceiling while Nathan is oblivious. The baby stops crying and Florence's attention returns to her book. As he throws out his wrist to look at his watch a third title is supered beneath the first two. 845 pm. He starts to replace the receiver but brings it back with an afterthought and as he slams the phone into the cradle the titles disappear. Halfway there she freezes staring in shock. ED's POV reveals Hi approaching the car shrugging and displaying manifestly empty hands. Hi appears at the driver's window reaching to open the door but Ed slaps his hand away from the handle. He tries to open the door which Ed is holding shut with all her might rolling up the window and locking the door. Through the closed window a muffled very forlorn voice can be heard. Florence is holding one of the babies cradled against her shoulder with the baby peeping out over her shoulder facing the window looking Hi's head appears in the window looking back as he holds a finger to his lips. Florence starts bouncing the baby patting it on the back and Hi and the window bounce up and down."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Florence sits reading Dr Spock's Baby and Child Care in a living room dominated by a large oil portrait of Nathan and Florence gazing out from the wall over the mantelpiece. From somewhere upstairs an infant starts to cry causing Florence to stop reading and look up at the ceiling while Nathan is oblivious. Through the closed window a muffled very forlorn voice can be heard. Florence is holding one of the babies cradled against her shoulder with the baby peeping out over her shoulder facing the window looking Hi's head appears in the window looking back as he holds a finger to his lips. Florence starts bouncing the baby patting it on the back and Hi and the window bounce up and down."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Gerald lounges scribbling in Grandpa Joe's Cookbook, surrounded by a hallway dominated by a colossal tapestry of Maxine and Gerald, peering out from the ceiling above the chandelier. From a corner in the basement, a cat begins to purr, prompting Gerald to halt scribbling and glance at the window, while Maxine remains indifferent. The cat ceases purring, and Gerald's focus returns to his scrapbook. As she flings out her umbrella to gaze at her compass, a fifth tagline is pasted beneath the initial ones: 3:20 a.m. She hesitates to close the laptop but reopens it with a whim, and as she tosses the mouse onto the mat, the taglines vanish. Another cat begins purring, causing Gerald to glance at the window once more. A close-up on the purring cat shows Lu jiggling it tenderly but anxiously. The cats seem agitated. A ceiling-mounted wide-angle shot shows a cat skulking away from the camera in the background, while another cat is poking through the bedroom door, making a wild dash toward the garden in the foreground. Lu emerges from the bedroom, stepping over the foreground cat and prancing toward the cat in the background. By the time he reaches it, the high-angle cropping reveals only his hat and shoulders, along with the cat and the ladder up to the top floor. He picks up the cat and gently tiptoes away toward the bedroom. The cat is at the bedroom door in the background with the ladder in the foreground. As Lu reaches the cat, whispers are heard echoing down. Lu's free leg scoops the cat up and out of sight just as Gerald's shoes emerge, bobbing down as she descends the ladder. She approaches the bedroom, clutching Grandpa Joe's scrapbook. As Gerald enters from the garden door, she tracks forward into the kitchen and approaches the pantry. Partway there she stares, gaping in awe. TED's POV shows Lu approaching the cabin, shrugging and showcasing absolutely full arms. Lu appears at the passenger's hatch, reaching to open the trunk, but Ted slaps his arm away from the latch. He tries to open the trunk, which Ted is holding closed with all his strength, tinting the glass and bolting the trunk. Through the tinted glass, a muffled, very cheerful tune can be heard. Gerald is holding one of the cats nestled against her elbow, with the cat peering over her elbow, facing the backyard, gazing. Lu's hat looms in the backyard, gazing back as he places a finger to his chin. Gerald starts tickling the cat, rubbing it on the ear, and Lu and the backyard jiggle side to side."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Florence reads Dr. Spock's Baby and Child Care in a living room beneath a large portrait of her and Nathan. An infant's cry from upstairs momentarily distracts her before she resumes reading. At 8:45 p.m., another baby starts crying, and Florence glances up again. Hi tries to calm restless babies; one crawls away while another races toward freedom. He retrieves the baby, navigating around the nursery. As footsteps approach, Hi hastily scoops up the baby, evading Florence, who climbs the stairs with her book. She freezes upon entering the nursery, shocked. From her perspective, Hi approaches a car, empty-handed, and tries to open the door, but Ed locks him out. Through the closed window, Florence sees Hi, signaling for quiet while she cradles a baby and continues to soothe it."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Florence starts bouncing the baby patting it on the back and Hi and the window bounce up and down Florence is holding one of the babies cradled against her shoulder with the baby peeping out over her shoulder facing the window looking Hi's head appears in the window looking back as he holds a finger to his lips Through the closed window a muffled very forlorn voice can be heard He tries to open the door which Ed is holding shut with all her might rolling up the window and locking the door Hi appears at the driver's window reaching to open the door but Ed slaps his hand away from the handle ED's POV reveals Hi approaching the car shrugging and displaying manifestly empty hands Halfway there she freezes staring in shock As Florence enters from the hallway door she tracks back into the room and approaches the crib She approaches the nursery still clutching the Dr Spock book Hi's free arm scoops the baby up and out of frame just as Florence's head appears bobbing up as she climbs the stairs As Hi reaches the baby footsteps are heard climbing the stairs The baby is at the nursery door in the foreground with the staircase in the background He scoops up the baby and hurriedly tiptoes away toward the nursery By the time he reaches it the lowangle cropping shows us only his feet and calves along with the baby and the stairway down to the main floor Hi emerges from the nursery stepping around the background baby and trotting toward the baby in the foreground A floorlevel wideangle shot shows a baby crawling toward the camera in the foreground while another baby is rounding the open door from the nursery making a mad dash for freedom in the background The babies sound restless A closeup on the crying baby shows Hi bouncing it gently but desperately Another baby starts crying making Florence look up at the ceiling again He starts to replace the receiver but brings it back with an afterthought and as he slams the phone into the cradle the titles disappear 845 pm As he throws out his wrist to look at his watch a third title is supered beneath the first two The baby stops crying and Florence's attention returns to her book From somewhere upstairs an infant starts to cry causing Florence to stop reading and look up at the ceiling while Nathan is oblivious Florence sits reading Dr Spock's Baby and Child Care in a living room dominated by a large oil portrait of Nathan and Florence gazing out from the wall over the mantelpiece"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "From somewhere upstairs an infant starts to cry causing Florence to stop reading and look up at the ceiling while Nathan is oblivious Florence sits reading Dr Spock's Baby and Child Care in a living room dominated by a large oil portrait of Nathan and Florence gazing out from the wall over the mantelpiece As he throws out his wrist to look at his watch a third title is supered beneath the first two The baby stops crying and Florence's attention returns to her book He starts to replace the receiver but brings it back with an afterthought and as he slams the phone into the cradle the titles disappear 845 pm A closeup on the crying baby shows Hi bouncing it gently but desperately Another baby starts crying making Florence look up at the ceiling again A floorlevel wideangle shot shows a baby crawling toward the camera in the foreground while another baby is rounding the open door from the nursery making a mad dash for freedom in the background The babies sound restless By the time he reaches it the lowangle cropping shows us only his feet and calves along with the baby and the stairway down to the main floor Hi emerges from the nursery stepping around the background baby and trotting toward the baby in the foreground The baby is at the nursery door in the foreground with the staircase in the background He scoops up the baby and hurriedly tiptoes away toward the nursery Hi's free arm scoops the baby up and out of frame just as Florence's head appears bobbing up as she climbs the stairs As Hi reaches the baby footsteps are heard climbing the stairs As Florence enters from the hallway door she tracks back into the room and approaches the crib She approaches the nursery still clutching the Dr Spock book ED's POV reveals Hi approaching the car shrugging and displaying manifestly empty hands Halfway there she freezes staring in shock He tries to open the door which Ed is holding shut with all her might rolling up the window and locking the door Hi appears at the driver's window reaching to open the door but Ed slaps his hand away from the handle Florence is holding one of the babies cradled against her shoulder with the baby peeping out over her shoulder facing the window looking Hi's head appears in the window looking back as he holds a finger to his lips Through the closed window a muffled very forlorn voice can be heard Florence starts bouncing the baby patting it on the back and Hi and the window bounce up and down"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The baby is at the nursery door in the foreground with the staircase in the background As Hi reaches the baby footsteps are heard climbing the stairs Hi's free arm scoops the baby up and out of frame just as Florence's head appears bobbing up as she climbs the stairs She approaches the nursery still clutching the Dr Spock book As Florence enters from the hallway door she tracks back into the room and approaches the crib Halfway there she freezes staring in shock ED's POV reveals Hi approaching the car shrugging and displaying manifestly empty hands Hi appears at the driver's window reaching to open the door but Ed slaps his hand away from the handle He tries to open the door which Ed is holding shut with all her might rolling up the window and locking the door Through the closed window a muffled very forlorn voice can be heard Florence is holding one of the babies cradled against her shoulder with the baby peeping out over her shoulder facing the window looking Hi's head appears in the window looking back as he holds a finger to his lips Florence starts bouncing the baby patting it on the back and Hi and the window bounce up and down Florence sits reading Dr Spock's Baby and Child Care in a living room dominated by a large oil portrait of Nathan and Florence gazing out from the wall over the mantelpiece From somewhere upstairs an infant starts to cry causing Florence to stop reading and look up at the ceiling while Nathan is oblivious The baby stops crying and Florence's attention returns to her book As he throws out his wrist to look at his watch a third title is supered beneath the first two 845 pm He starts to replace the receiver but brings it back with an afterthought and as he slams the phone into the cradle the titles disappear Another baby starts crying making Florence look up at the ceiling again A closeup on the crying baby shows Hi bouncing it gently but desperately The babies sound restless A floorlevel wideangle shot shows a baby crawling toward the camera in the foreground while another baby is rounding the open door from the nursery making a mad dash for freedom in the background Hi emerges from the nursery stepping around the background baby and trotting toward the baby in the foreground By the time he reaches it the lowangle cropping shows us only his feet and calves along with the baby and the stairway down to the main floor He scoops up the baby and hurriedly tiptoes away toward the nursery"
        }
      ]
    }
  ]
}