{
  "ground_truth": "Laszlo turns off the light and sits down on the couch next to her. It grows strained and a silence falls between them; Ilsa still cannot look at him. Ilsa finally turns to look at Laszlo, and he bends down and kisses her cheek. He kisses her on the cheek and goes out the door. She stands there for a few seconds, then crosses to look out of the window. She sees Victor walking down the street and closes the blind again. The figure in the archway is gone. Ilsa gets a cloak from the bedroom and leaves the hotel room. Carl is busy figuring as Rick and Carl sit by the bar and look over ledgers. Carl looks up at Rick and laughs. Ilsa comes over to meet Rick, and he walks over to the window with Ilsa following. Rick walks over to a table and opens a cigarette box, but finds it empty. There are tears in her eyes now, and he turns away to light a cigarette, then back to Ilsa. He stops short as he sees Ilsa holding a small revolver in her hand, pointed directly at him. He moves closer to her, and her hand drops down with tears in her eyes again. She turns and walks away from him, but Rick follows her and takes her in his arms, where she is lost in his embrace. He presses her tight to him and kisses her passionately. From his window, Rick watches the revolving beacon light at the airport. Ilsa sits on the couch, and on a table before her rests a bottle of champagne along with two half-filled glasses. Rick walks over to her and sits down with Ilsa. Ilsa puts her head on Rick's shoulder and snuggles closer to him. They run inside the entryway as the headlights of a speeding police car sweep toward them, and the lights move past them. They flatten themselves against a wall to avoid detection. Laszlo and Carl make their way through the darkness toward a side entrance of Rick's. Laszlo and Carl enter and cross toward the bar, out of breath from their exertion, as Carl goes behind the bar. Rick and Ilsa hear voices below. Rick crosses to the door, opens it just enough to see below, and turns off the light. Ilsa stands just in back of him and makes a move as if to go out to the balcony, but Rick pushes her back, and she withdraws behind the door. Rick walks out to the balcony railing and sees Carl attending to Laszlo, who appears to be injured. Both Carl and Laszlo look up as Carl looks up wonderingly, then starts toward the stairway and climbs the stairs. Carl enters Rick's apartment and sees Ilsa.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Laszlo switches off the illumination and seats himself on the sofa adjacent to her. It becomes tense and a quiet descends between them; Ilsa still cannot gaze at him. Ilsa eventually turns to gaze at Laszlo, and he leans down and pecks her cheek. He pecks her on the cheek and exits the doorway. She remains there for a few moments, then moves to gaze out of the window. She observes Victor strolling down the avenue and shuts the shade again. The silhouette in the archway is absent. Ilsa retrieves a cape from the chamber and departs the hotel suite. Carl is occupied calculating as Rick and Carl perch by the counter and peruse ledgers. Carl glances up at Rick and chuckles. Ilsa approaches to encounter Rick, and he strides over to the window with Ilsa trailing. Rick strides to a table and unlocks a cigarette container, but discovers it vacant. There are droplets in her eyes now, and he turns away to ignite a cigarette, then back to Ilsa. He halts abruptly as he observes Ilsa grasping a small pistol in her hand, aimed straight at him. He moves nearer to her, and her hand descends with droplets in her eyes again. She turns and strides away from him, but Rick pursues her and takes her in his embrace, where she is lost in his clasp. He holds her firmly to him and kisses her fervently. From his window, Rick observes the rotating signal light at the aerodrome. Ilsa reclines on the sofa, and on a table before her sits a bottle of champagne along with two half-filled goblets. Rick strides over to her and seats himself with Ilsa. Ilsa rests her head on Rick's shoulder and nestles nearer to him. They dash inside the entryway as the beams of a speeding constabulary car sweep toward them, and the beams proceed past them. They flatten themselves against a partition to evade detection. Laszlo and Carl forge their way through the obscurity toward a side entry of Rick's. Laszlo and Carl enter and move toward the counter, out of breath from their effort, as Carl goes behind the counter. Rick and Ilsa detect voices below. Rick moves to the doorway, opens it just enough to glimpse below, and switches off the illumination. Ilsa stands just in back of him and makes a motion as if to proceed out to the balcony, but Rick pushes her back, and she retreats behind the doorway. Rick strides out to the balcony rail and observes Carl attending to Laszlo, who seems to be harmed. Both Carl and Laszlo look up as Carl gazes up inquisitively, then begins toward the stairway and ascends the stairs. Carl enters Rick's lodging and observes Ilsa."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The light is turned off by Laszlo, and the couch is sat on by him next to her. It grows strained, and a silence falls between them; Ilsa still cannot look at him. Laszlo is finally turned to by Ilsa, and her cheek is kissed by him as he bends down. Her cheek is kissed by him, and the door is gone out by him. She stands there for a few seconds, then the window is crossed to by her to look out. Victor is seen by her walking down the street, and the blind is closed again by her. The figure in the archway has gone. A cloak is gotten from the bedroom by Ilsa, and the hotel room is left by her. As Rick and Carl sit by the bar looking over ledgers, Carl is busy figuring. Rick is looked up at by Carl, and laughter is shared by him. Rick is met by Ilsa as she comes over, and the window is walked over to by him with Ilsa following. A table is walked over to by Rick, and a cigarette box is opened, but it is found to be empty by him. Tears are in her eyes now, and a cigarette is lit by him after turning away, then back to Ilsa. He stops short as a small revolver is held by Ilsa, pointed directly at him. Her is moved closer to by him, her hand drops down with tears in her eyes again. She turns and walks away from him, but her is followed by Rick, and his arms take her in, where she is lost in his embrace. She is pressed tight to him by him, and a passionate kiss is given by him. From his window, the revolving beacon light at the airport is watched by Rick. The couch is sat on by Ilsa, and a bottle of champagne rests on a table before her along with two half-filled glasses. She is walked over to by Rick, and he sits down with her. Rick's shoulder is rested on by Ilsa's head, and him is snuggled closer to by her. The entryway is run inside by them as the headlights of a speeding police car sweep toward them, and the lights move past them. A wall is flattened against by them to avoid detection. The darkness is made their way through by Laszlo and Carl toward a side entrance of Rick's. The bar is crossed toward by them after entering and, out of breath from their exertion, the bar is gone behind by Carl. Voices are heard by Rick and Ilsa below. The door is crossed to by Rick, just enough to see below is opened, and the light is turned off by him. Just in back of him stands Ilsa, and the balcony is moved as if to go out to by her, but Rick pushes her back, and she is withdrawn behind the door. The balcony railing is walked out to by Rick, and Carl is seen attending to Laszlo, who appears to be injured. Both Carl and Laszlo look up as Rick is looked up at by Carl wonderingly, then the stairway is started toward by him, and the stairs are climbed. Rick's apartment is entered by Carl, and Ilsa is seen by him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Laszlo turns off the light and sits beside Ilsa on the couch. A strained silence falls, and Ilsa initially avoids eye contact. Eventually, Ilsa looks at Laszlo, who kisses her cheek and leaves. She waits briefly, then gazes out the window, watching Victor walk down the street before closing the blinds. She dons a cloak and leaves the hotel room. Meanwhile, Carl and Rick are at the bar reviewing ledgers, laughing. Ilsa approaches Rick, who walks to the window, opens an empty cigarette box, and lights a cigarette. Noticing tears in Ilsa’s eyes, he stops as she reveals a revolver aimed at him. As he steps closer, her arm drops, and she turns away. Rick follows, embraces her, and kisses her passionately. Rick later gazes at the airport's beacon light. Ilsa sits with champagne and glasses, leaning on Rick's shoulder. They run to avoid police lights, pressing against a wall. Laszlo and Carl reach Rick's side entrance, breathless. Rick and Ilsa hear voices, and Rick checks, turning off the light. Ilsa tries to step out to the balcony, but Rick stops her. Rick sees Carl assisting an injured Laszlo. Carl looks up, curious, and heads upstairs, meeting Ilsa in Rick's apartment."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Laszlo turns off the light and sits beside her on the couch. A tense silence ensues; Ilsa can't look at him. Finally, she turns to Laszlo, who kisses her cheek, then leaves. Ilsa watches Victor walk down the street before closing the blind and leaving. Carl and Rick sit at the bar with ledgers. Ilsa joins Rick; they walk to a table. When Rick finds the cigarette box empty, she tearfully aims a revolver at him. Her hand drops as Rick embraces and kisses her passionately. From the window, Rick sees the airport beacon. Ilsa sits with champagne and glasses. Rick joins, and she rests her head on his shoulder. They hide as police car headlights pass. Laszlo and Carl sneak into Rick's place, breathless. Rick sees Carl aid an injured Laszlo. Carl ascends the stairs to Rick's apartment and finds Ilsa."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Laszlo reaches out to turn off the light, casting the room into a dim, tranquil shadow before he settles himself down on the couch right beside her. The atmosphere becomes tense, a palpable strain filling the space between them, as a heavy silence envelops the room, making every second feel longer. Ilsa, filled with conflicting emotions, still finds herself unable to meet his gaze immediately. However, after what feels like an eternity, she finally turns her attention towards Laszlo. With a tender gesture, he leans in and gently places a kiss on her cheek. After this soft, affectionate moment, he exits through the door. Ilsa remains standing for a brief moment, absorbing the magnitude of the moment, before she crosses the room and gazes out of the window. Her eyes catch sight of Victor as he is making his way down the street, prompting her to close the blinds once again. The mysterious figure that had been in the archway has vanished, disappearing as quietly as it had appeared. Ilsa retrieves a cloak from the bedroom, wrapping it around herself as she departs from the hotel room. Meanwhile, Carl is deeply engrossed in his work, calculating figures while he and Rick sit together at the bar, poring over the ledgers. Carl glances up at Rick, a laugh escaping his lips. \n\nAs Ilsa approaches to meet Rick, he makes his way over to the window, with Ilsa following closely behind him. Rick then strides over to a table, intending to take a cigarette from the box, but finds it disappointingly empty. Tears begin to glisten in Ilsa's eyes as Rick turns away momentarily to light a cigarette. Upon turning back to Ilsa, he abruptly stops in his tracks, taken aback by the sight of Ilsa holding a small revolver, aimed directly at him. Displaying calm determination, he moves closer to her, and she lowers her hand, her eyes filling with tears once more. She turns away, walking in the opposite direction, but Rick, resolute in his intentions, follows her. He takes her into his arms, enveloping her in a comforting embrace where she is consumed by his presence. He holds her tightly and kisses her with fervent passion. Standing by the window, Rick's gaze is drawn to the revolving beacon light at the distant airport. In the room, Ilsa is seated on the couch, and on the table in front of her is a bottle of champagne accompanied by two glasses, each half-filled. Rick approaches and joins her, taking a seat beside Ilsa. She rests her head on Rick's shoulder, drawing closer to him for comfort. Together, they dash inside the entryway just as the headlights of a speeding police car sweep toward them, its lights moving swiftly past. Flattening themselves against the wall, they remain concealed, avoiding detection. \n\nMeanwhile, Laszlo and Carl make their way stealthily through the shadowy darkness towards a side entrance, their breath heavy from exertion. Once inside, they proceed toward the bar, eager to find respite. Carl moves behind the bar as Rick and Ilsa become aware of voices echoing below them. Rick crosses the room to the door, opening it just enough to peer below before turning off the light. Ilsa stands right behind him and makes a tentative move as though intending to step out onto the balcony, but Rick gently pushes her back. She retreats into the safety behind the door. Rick ventures out to the balcony railing, observing Carl as he attends to Laszlo, who appears to be injured. The pair looks up, Carl casting a questioning glance upwards before heading toward the stairway and ascending the steps. Upon entering Rick's apartment, Carl's eyes fall upon Ilsa."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Laszlo reaches out his hand, stretching toward the lamp to turn off the light, and subsequently casts the entire room into a dim, tranquil shadow. He then settles himself down comfortably onto the couch right beside her. The atmosphere shifts and becomes increasingly tense, a palpable strain filling the space that lies between them. A heavy silence envelops the room, making every second linger and feel considerably longer than usual. Ilsa, a whirlwind of conflicting emotions swirling within her, still finds herself unable to meet his gaze immediately. However, after what seems like an eternity, she finally turns her attention toward Laszlo. With a tender gesture marked by affection, he leans in closely and gently places a soft kiss on her cheek. After indulging in this quiet, intimate moment, he exits through the door, leaving Ilsa standing momentarily, absorbing the magnitude of the moment they just shared. She then crosses the room to gaze out of the window. Her eyes catch sight of Victor, making his way down the street, prompting her to close the blinds once again, shutting out the outside world. The mysterious figure that had been lurking in the archway has vanished, disappearing as quietly as it had appeared. \n\nIlsa retrieves a cloak from the bedroom, wrapping it snugly around herself as she quietly departs from the hotel room. Meanwhile, Carl is deeply engrossed in his work, diligently calculating figures while he and Rick sit side by side at the bar, poring over the ledgers intently. Carl glances up at Rick, a laugh escaping his lips, lightening the seriousness of their task. As Ilsa approaches to meet Rick, he purposefully makes his way over to the window, with Ilsa following closely behind. Rick then strides over to a table, intending to take a cigarette from the box, only to find it frustratingly empty. Tears begin to glisten in Ilsa's eyes, shimmering as Rick turns away momentarily to light a cigarette. Upon turning back to Ilsa, he abruptly stops in his tracks, startled by the sight of Ilsa holding a small revolver now aimed directly at him. Displaying remarkable calm and determination, he moves closer to her, and she gradually lowers her hand, her eyes brimming with tears once more. She turns away, walking in the opposite direction, but Rick, resolute in his intentions, follows her again. He takes her into his arms, enveloping her in a comforting embrace, where she is consumed by his presence. He holds her tightly and kisses her with fervent passion that hangs in the air. \n\nStanding by the window, Rick's gaze is drawn to the revolving beacon light at the distant airport. In the room, Ilsa is seated on the couch, and on the table in front of her is a bottle of champagne, accompanied by two glasses, each half-filled. Rick approaches and joins her, taking a seat beside Ilsa. She gently rests her head on Rick's shoulder, drawing closer to him for comfort and solace. Together, they dash inside the entryway just as the headlights of a speeding police car sweep toward them, its bright lights moving swiftly past. Flattening themselves against the wall, they remain concealed and avoid detection. Meanwhile, Laszlo and Carl stealthily make their way through the shadowy darkness toward a side entrance, their breath heavy from exertion and the tension of the moment. Once inside, they proceed eagerly toward the bar, seeking a moment of respite and relief. Carl moves behind the bar as Rick and Ilsa become aware of the voices echoing below them. Rick crosses the room to the door, gently opening it just enough to peer below before turning off the light to maintain their cover. \n\nIlsa stands right behind him, making a tentative move as if intending to step out onto the balcony, but Rick gently pushes her back, urging her to retreat into the safety behind the door. Rick ventures out to the balcony railing, where he observes Carl attending to Laszlo, who appears to be injured. The pair looks up, with Carl casting a questioning glance upwards before heading toward the stairway and ascending the steps. Upon entering Rick's apartment, Carl's eyes fall upon Ilsa, marking the beginning of yet another chapter in their unfolding story."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Laszlo reaches up to the wall and flicks the switch to turn off the light, plunging the room into a soft darkness before easing himself down onto the couch next to her. The atmosphere becomes tense, a silence enveloping them, and Ilsa finds herself unable to bring herself to meet his gaze. Finally gathering the resolve, she slowly turns her head to look at Laszlo, who gently leans forward, his face moving closer to hers, and plants a tender kiss on her cheek. After this brief, intimate moment, he stands up, planting a second kiss on her cheek, then strides out the door, leaving her behind. Ilsa remains motionless for a few seconds, digesting the moment, before moving to the window. She parts the curtain to peer outside, noticing Victor walking purposefully down the street, and then she lets the blind fall back into place, cutting off the view. The figure that had been standing in the archway is now absent. With a sense of resolve, Ilsa retrieves a cloak from the bedroom, wraps it around herself, and exits the hotel room. In another part of town, Carl is engrossed in calculations, busily figuring as he and Rick sit side by side at the bar, their concentration focused on the ledgers spread out before them. Amidst this work, Carl momentarily pauses, looking up at Rick with a shared laugh. At that moment, Ilsa arrives to meet Rick, and as they come together, Rick walks towards the window with Ilsa trailing behind him. Rick approaches a nearby table, reaching for a cigarette box only to find it empty. Seeing tears beginning to form in Ilsa's eyes, he turns away briefly to strike a match and light a cigarette, composing himself before facing her again. He halts abruptly at the sight of Ilsa standing there, a small revolver gripped in her hand and pointed at him. Rick edges closer, and Ilsa's grip on the weapon falters as her hand drops, fresh tears spilling from her eyes. She pivots away from him, starting to walk off, but Rick follows insistently, enfolding her into his arms, where she finds herself engulfed in his embrace. He holds her tightly, kissing her with deep passion. Later, Rick is at the window, his gaze fixed on the rotating beacon light at the airport as it casts its rhythmic glow. Ilsa is sitting on the couch, and in front of her, on the table, sit a bottle of champagne and two glasses, each half-filled with the bubbling liquid. Rick moves over to her side and sinks onto the couch beside her, where she gently rests her head on his shoulder, snuggling closer to him for warmth and comfort. Suddenly, they are alerted to the threat of danger as the headlights of a police car sweep towards them, the vehicle speeding past in a flash. Instinctively, they rush inside the entryway, flattening themselves against the wall to remain unseen. Meanwhile, Laszlo and Carl, breathless from their haste, navigate through the darkness to a side entrance of Rick's establishment. They enter and make their way across to the bar, the exertion evident in their heavy breathing, while Carl moves efficiently behind the bar. Alerted by the sound of voices below, Rick crosses quietly to the door, opening it just enough to survey the scene and then subtly flicks off the light to maintain their cover. Ilsa stands closely behind him, making a motion as if to step out onto the balcony, but Rick firmly but gently nudges her back, encouraging her to retreat behind the door for safety. He then steps out to the balcony railing, observing Carl tending to Laszlo, who appears to be wounded. Both men glance upwards, Carl's face etched with curiosity as he starts toward the stairway, ascending the steps with resolve. Carl enters Rick's apartment and is met with the sight of Ilsa, leading to an encounter that adds another layer to the unfolding drama."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Laszlo turns off the light and sits beside Ilsa on the couch, leading to a strained silence. After a moment, Ilsa finally looks at him, prompting Laszlo to kiss her cheek before leaving the room. She watches him walk down the street from the window before closing the blind and leaving with a cloak. Meanwhile, Carl and Rick are at the bar reviewing ledgers when Ilsa approaches Rick, who moves to the window with her. Rick attempts to grab a cigarette, but the box is empty. He notices Ilsa’s tears and then that she is holding a revolver, pointing it at him. Moving closer, Rick watches her lower the gun, and they embrace passionately. Later, Rick watches the airport's beacon light from his window as Ilsa sits with champagne nearby. She leans on Rick's shoulder as they cuddle. They quickly hide against a wall when a police car speeds by, avoiding detection. Laszlo and Carl, breathless, enter Rick's through a side entrance. Hearing voices, Rick cautiously checks the door and turns off the light before preventing Ilsa from stepping out onto the balcony. On the balcony, Rick sees Carl helping an injured Laszlo, and as Carl ascends the stairs, he enters the apartment and sees Ilsa."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Laszlo, a resistance leader known for his efforts against oppressive regimes, turns off the light and sits down on the couch next to her. It grows strained and a silence falls between them; Ilsa, haunted by memories of their past, still cannot look at him. Ilsa finally turns to look at Laszlo, and he bends down and kisses her cheek gently as if offering a silent promise. He kisses her on the cheek and goes out the door to attend to matters beyond the safe confines of their room. She stands there for a few seconds, then crosses to look out of the window. She sees Victor walking down the street with purpose and closes the blind again, concealing her worries from the outside world. The figure in the archway, once a familiar presence, is gone. Ilsa gets a cloak from the bedroom, a reminder of her time in Paris, and leaves the hotel room. \n\nCarl is busy figuring out accounts as Rick and Carl sit by the bar and look over ledgers accumulated from a bustling week. Carl looks up at Rick and laughs, sharing a moment of camaraderie amidst the tension. Ilsa comes over to meet Rick, whose establishment is renowned in the city for its secrecy and charm, and he walks over to the window with Ilsa following. Rick walks over to a table and opens a cigarette box, but finds it empty, a small frustration amidst greater troubles. There are tears in her eyes now, reflecting the emotional turmoil of their shared history, and he turns away to light a cigarette, then back to Ilsa. He stops short as he sees Ilsa holding a small revolver in her hand, pointed directly at him, a desperate act that reveals her inner conflict. He moves closer to her, and her hand drops down with tears in her eyes again, a moment of vulnerability. She turns and walks away from him, but Rick follows her, driven by a deep connection, and takes her in his arms, where she is lost in his embrace. He presses her tight to him and kisses her passionately, their shared past igniting between them. \n\nFrom his window, Rick watches the revolving beacon light at the airport, a symbol of escape and new beginnings. Ilsa sits on the couch, and on a table before her rests a bottle of champagne along with two half-filled glasses, remnants of a previous celebration or consolation. Rick walks over to her and sits down with Ilsa, finding solace in her presence. Ilsa puts her head on Rick's shoulder and snuggles closer to him, seeking comfort in the moment. They run inside the entryway as the headlights of a speeding police car sweep toward them, a reminder of the constant threat looming over their clandestine lives, and the lights move past them. They flatten themselves against a wall to avoid detection, their hearts racing. \n\nLaszlo and Carl make their way through the darkness toward a side entrance of Rick's, a place that has become a refuge for those on the run. Laszlo and Carl enter and cross toward the bar, out of breath from their exertion, as Carl goes behind the bar, ready to lend aid. Rick and Ilsa hear voices below, intruding upon their temporary haven. Rick crosses to the door, opens it just enough to see below, and turns off the light, shrouding them in protective darkness. Ilsa stands just in back of him and makes a move as if to go out to the balcony, but Rick pushes her back, understanding the danger, and she withdraws behind the door. Rick walks out to the balcony railing and sees Carl attending to Laszlo, who appears to be injured, his resilience tested once more. Both Carl and Laszlo look up as Carl looks up wonderingly, then starts toward the stairway and climbs the stairs. Carl enters Rick's apartment and sees Ilsa, another piece of their complicated puzzle."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Laszlo turns off the light and sits down on the couch next to her. It grows strained and a silence falls between them. Ilsa still cannot look at him. Ilsa finally turns to look at Laszlo and he bends down and kisses her cheek. He kisses her on the cheek and goes out the door. She stands there for a few seconds then crosses to look out of the window. She sees Victor walking down the street and closes the blind again. The figure in the archway is gone. Ilsa gets a cloak from the bedroom and leaves the hotel room. Carl is busy figuring as Rick and Carl sit by the bar and look over ledgers. Carl looks up at Rick and laughs. Ilsa comes over to meet Rick and he walks over to the window with Ilsa following. Rick walks over to a table and opens a cigarette box but finds it empty. There are tears in her eyes now and he turns away to light a cigarette then back to Ilsa. He stops short as he sees Ilsa holding a small revolver in her hand pointed directly at him. He moves closer to her and her hand drops down with tears in her eyes again. She turns and walks away from him but Rick follows her and takes her in his arms where she is lost in his embrace. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. He presses her tight to him and kisses her passionately. From his window. Rick watches the revolving beacon light at the airport. Ilsa sits on the couch and on a table before her rests a bottle of champagne along with two halffilled glasses. Rick walks over to her and sits down with Ilsa. Ilsa puts her head on Rick's shoulder and snuggles closer to him. They run inside the entryway as the headlights of a speeding police car sweep toward them and the lights move past them. They flatten themselves against a wall to avoid detection. Laszlo and Carl make their way through the darkness toward a side entrance of Rick's. Laszlo and Carl enter and cross toward the bar out of breath from their exertion. as Carl goes behind the bar Rick and Ilsa hear voices below. Rick crosses to the door opens it just enough to see below and turns off the light. Ilsa stands just in back of him and makes a move as if to go out to the balcony. but Rick pushes her back and she withdraws behind the door. Rick walks out to the balcony railing and sees Carl attending to Laszlo who appears to be injured. Both Carl and Laszlo look up as Carl looks up wonderingly then starts toward the stairway and climbs the stairs. Carl enters Rick's apartment and sees Ilsa."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Laszlo turns off the light and sits down on the couch next to her. It grows strained and a silence falls between them. Ilsa still cannot look at him. Ilsa finally turns to look at Laszlo and he bends down and kisses her cheek. He kisses her on the cheek and goes out the door. She stands there for a few seconds then crosses to look out of the window. She sees Victor walking down the street and closes the blind again. The figure in the archway is gone. Ilsa gets a cloak from the bedroom and leaves the hotel room. Carl is busy figuring as Rick and Carl sit by the bar and look over ledgers. Carl looks up at Rick and laughs. Ilsa comes over to meet Rick and he walks over to the window with Ilsa following. Rick walks over to a table and opens a cigarette box but finds it empty. There are tears in her eyes now and he turns away to light a cigarette then back to Ilsa. He stops short as he sees Ilsa holding a small revolver in her hand pointed directly at him. He moves closer to her and her hand drops down with tears in her eyes again. She turns and walks away from him but Rick follows her and takes her in his arms where she is lost in his embrace. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. He presses her tight to him and kisses her passionately. From his window. Rick watches the revolving beacon light at the airport. Ilsa sits on the couch and on a table before her rests a bottle of champagne along with two halffilled glasses. Rick walks over to her and sits down with Ilsa. Ilsa puts her head on Rick's shoulder and snuggles closer to him. They run inside the entryway as the headlights of a speeding police car sweep toward them and the lights move past them. They flatten themselves against a wall to avoid detection. Laszlo and Carl make their way through the darkness toward a side entrance of Rick's. Laszlo and Carl enter and cross toward the bar out of breath from their exertion. as Carl goes behind the bar Rick and Ilsa hear voices below. Rick crosses to the door opens it just enough to see below and turns off the light. Ilsa stands just in back of him and makes a move as if to go out to the balcony. but Rick pushes her back and she withdraws behind the door. Rick walks out to the balcony railing and sees Carl attending to Laszlo who appears to be injured. Both Carl and Laszlo look up as Carl looks up wonderingly then starts toward the stairway and climbs the stairs. Carl enters Rick's apartment and sees Ilsa."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Laszlo turns off the light and sits down on the couch next to her. It grows strained and a silence falls between them. Ilsa still cannot look at him. Ilsa finally turns to look at Laszlo and he bends down and kisses her cheek. He kisses her on the cheek and goes out the door. She stands there for a few seconds then crosses to look out of the window. She sees Victor walking down the street and closes the blind again. The figure in the archway is gone. Ilsa gets a cloak from the bedroom and leaves the hotel room. Laszlo and Carl enter and cross toward the bar out of breath from their exertion. as Carl goes behind the bar Rick and Ilsa hear voices below. Rick crosses to the door opens it just enough to see below and turns off the light. Ilsa stands just in back of him and makes a move as if to go out to the balcony. but Rick pushes her back and she withdraws behind the door. Rick walks out to the balcony railing and sees Carl attending to Laszlo who appears to be injured. Both Carl and Laszlo look up as Carl looks up wonderingly then starts toward the stairway and climbs the stairs. Carl enters Rick's apartment and sees Ilsa."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Laszlo turns off the light and sits down on the couch next to her. It grows strained and a silence falls between them. Ilsa still cannot look at him. Ilsa finally turns to look at Laszlo and he bends down and kisses her cheek. Rick walks out to the balcony railing and sees Carl attending to Laszlo who appears to be injured. Both Carl and Laszlo look up as Carl looks up wonderingly then starts toward the stairway and climbs the stairs. Carl enters Rick's apartment and sees Ilsa."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Mortimer flicks on the fan and reclines on the hammock beside him. It feels lively and a chatter rises between them; Eliza still refuses to glance at him. Eliza eventually faces Mortimer, and he leaps up and shakes her hand. He shakes her hand and heads into the garden. She lingers there for a moment, then strolls to peer out of the mirror. She glimpses Gabriel floating down the river and reopens the drapes. The statue in the courtyard has vanished. Eliza retrieves a jacket from the kitchen and exits the study. Oscar is busy sketching as Gavin and Oscar stand by the fountain and examine sketches. Oscar glances over at Gavin and giggles. Eliza approaches to greet Gavin, and he marches over to the mirror with Eliza trailing. Gavin strides over to a box and unseals a candy tin, but finds it vacant. There is laughter in her voice now, and he turns away to unwrap a candy, then back to Eliza. He hesitates as he notices Eliza brandishing a small umbrella in her hand, aimed directly at him. He saunters toward her, and her hand lowers with laughter in her heart again. She pivots and shuffles away from him, but Gavin tails her and holds her in his arms, where she is immersed in his hug. He presses her firmly against him and shakes her excitedly. From his porch, Gavin watches the rotating lighthouse beam at the harbor. Eliza sits on the hammock, and on a bench before her rests a platter of fruits alongside two half-empty bowls. Gavin strolls over to her and reclines beside Eliza. Eliza rests her head on Gavin's lap and leans closer to him. They dash outside the lobby as the beams of a racing ambulance glide toward them, and the beams pass by them. They squeeze themselves against a tree to avoid detection. Mortimer and Oscar meander through the sunlight toward a side exit of Gavin's. Mortimer and Oscar enter and wander toward the fountain, exhausted from their adventures, as Oscar steps behind the fountain. Gavin and Eliza listen to music below. Gavin saunters to the door, opens it just enough to peer below, and flicks on the fan. Eliza stands just behind him and gestures as if to step out to the porch, but Gavin nudges her back, and she retreats behind the door. Gavin walks out to the porch railing and sees Oscar tending to Mortimer, who seems to be napping. Both Oscar and Mortimer gaze up as Oscar gazes up curiously, then advances toward the ladder and ascends the stairs. Oscar enters Gavin's library and spots Eliza."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Laszlo turns off the light and sits silently on the couch next to Ilsa, who eventually looks at him. He kisses her cheek and leaves. Ilsa watches him from the window, then goes to meet Rick. Rick lights a cigarette but stops upon seeing Ilsa with a revolver. Her hand drops as she weeps, and Rick embraces and kisses her. They sit together with champagne, but are interrupted by the headlights of a police car, prompting them to hide. Meanwhile, Laszlo and Carl hurry to Rick's, entering breathless. Rick checks the situation and sees Carl with an injured Laszlo. Carl comes upstairs, finding Ilsa."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Carl enters Rick's apartment and sees Ilsa Both Carl and Laszlo look up as Carl looks up wonderingly then starts toward the stairway and climbs the stairs Rick walks out to the balcony railing and sees Carl attending to Laszlo who appears to be injured but Rick pushes her back and she withdraws behind the door Ilsa stands just in back of him and makes a move as if to go out to the balcony Rick crosses to the door opens it just enough to see below and turns off the light as Carl goes behind the bar Rick and Ilsa hear voices below Laszlo and Carl enter and cross toward the bar out of breath from their exertion Laszlo and Carl make their way through the darkness toward a side entrance of Rick's They flatten themselves against a wall to avoid detection They run inside the entryway as the headlights of a speeding police car sweep toward them and the lights move past them Ilsa puts her head on Rick's shoulder and snuggles closer to him Rick walks over to her and sits down with Ilsa Ilsa sits on the couch and on a table before her rests a bottle of champagne along with two halffilled glasses Rick watches the revolving beacon light at the airport From his window He presses her tight to him and kisses her passionately She turns and walks away from him but Rick follows her and takes her in his arms where she is lost in his embrace He moves closer to her and her hand drops down with tears in her eyes again He stops short as he sees Ilsa holding a small revolver in her hand pointed directly at him There are tears in her eyes now and he turns away to light a cigarette then back to Ilsa Rick walks over to a table and opens a cigarette box but finds it empty Ilsa comes over to meet Rick and he walks over to the window with Ilsa following Carl looks up at Rick and laughs Carl is busy figuring as Rick and Carl sit by the bar and look over ledgers Ilsa gets a cloak from the bedroom and leaves the hotel room The figure in the archway is gone She sees Victor walking down the street and closes the blind again She stands there for a few seconds then crosses to look out of the window He kisses her on the cheek and goes out the door Ilsa finally turns to look at Laszlo and he bends down and kisses her cheek Ilsa still cannot look at him It grows strained and a silence falls between them Laszlo turns off the light and sits down on the couch next to her"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "It grows strained and a silence falls between them Laszlo turns off the light and sits down on the couch next to her Ilsa finally turns to look at Laszlo and he bends down and kisses her cheek Ilsa still cannot look at him She stands there for a few seconds then crosses to look out of the window He kisses her on the cheek and goes out the door The figure in the archway is gone She sees Victor walking down the street and closes the blind again Carl is busy figuring as Rick and Carl sit by the bar and look over ledgers Ilsa gets a cloak from the bedroom and leaves the hotel room Ilsa comes over to meet Rick and he walks over to the window with Ilsa following Carl looks up at Rick and laughs There are tears in her eyes now and he turns away to light a cigarette then back to Ilsa Rick walks over to a table and opens a cigarette box but finds it empty He moves closer to her and her hand drops down with tears in her eyes again He stops short as he sees Ilsa holding a small revolver in her hand pointed directly at him He presses her tight to him and kisses her passionately She turns and walks away from him but Rick follows her and takes her in his arms where she is lost in his embrace Rick watches the revolving beacon light at the airport From his window Rick walks over to her and sits down with Ilsa Ilsa sits on the couch and on a table before her rests a bottle of champagne along with two halffilled glasses They run inside the entryway as the headlights of a speeding police car sweep toward them and the lights move past them Ilsa puts her head on Rick's shoulder and snuggles closer to him Laszlo and Carl make their way through the darkness toward a side entrance of Rick's They flatten themselves against a wall to avoid detection as Carl goes behind the bar Rick and Ilsa hear voices below Laszlo and Carl enter and cross toward the bar out of breath from their exertion Ilsa stands just in back of him and makes a move as if to go out to the balcony Rick crosses to the door opens it just enough to see below and turns off the light Rick walks out to the balcony railing and sees Carl attending to Laszlo who appears to be injured but Rick pushes her back and she withdraws behind the door Carl enters Rick's apartment and sees Ilsa Both Carl and Laszlo look up as Carl looks up wonderingly then starts toward the stairway and climbs the stairs"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He presses her tight to him and kisses her passionately From his window Rick watches the revolving beacon light at the airport Ilsa sits on the couch and on a table before her rests a bottle of champagne along with two halffilled glasses Rick walks over to her and sits down with Ilsa Ilsa puts her head on Rick's shoulder and snuggles closer to him They run inside the entryway as the headlights of a speeding police car sweep toward them and the lights move past them They flatten themselves against a wall to avoid detection Laszlo and Carl make their way through the darkness toward a side entrance of Rick's Laszlo and Carl enter and cross toward the bar out of breath from their exertion as Carl goes behind the bar Rick and Ilsa hear voices below Rick crosses to the door opens it just enough to see below and turns off the light Ilsa stands just in back of him and makes a move as if to go out to the balcony but Rick pushes her back and she withdraws behind the door Rick walks out to the balcony railing and sees Carl attending to Laszlo who appears to be injured Both Carl and Laszlo look up as Carl looks up wonderingly then starts toward the stairway and climbs the stairs Carl enters Rick's apartment and sees Ilsa Laszlo turns off the light and sits down on the couch next to her It grows strained and a silence falls between them Ilsa still cannot look at him Ilsa finally turns to look at Laszlo and he bends down and kisses her cheek He kisses her on the cheek and goes out the door She stands there for a few seconds then crosses to look out of the window She sees Victor walking down the street and closes the blind again The figure in the archway is gone Ilsa gets a cloak from the bedroom and leaves the hotel room Carl is busy figuring as Rick and Carl sit by the bar and look over ledgers Carl looks up at Rick and laughs Ilsa comes over to meet Rick and he walks over to the window with Ilsa following Rick walks over to a table and opens a cigarette box but finds it empty There are tears in her eyes now and he turns away to light a cigarette then back to Ilsa He stops short as he sees Ilsa holding a small revolver in her hand pointed directly at him He moves closer to her and her hand drops down with tears in her eyes again She turns and walks away from him but Rick follows her and takes her in his arms where she is lost in his embrace"
        }
      ]
    }
  ]
}