{
  "ground_truth": "Jeff's eyes are staring intently at the backyard over the coffee cup, then stray upward as he puts it down. Stella turns and walks into the kitchen, and Jeff's eyes move down again. Abstractedly, his hand reaches for a piece of bacon, but he pushes the food away and picks up the coffee cup instead. Miss Torso, in a ballet outfit, is hanging up a small wash consisting mostly of lingerie on a clothesline while doing her inevitable leg practice. Jeff appears to be getting a bit listless or bored from constantly watching Thorwald's apartment, so his eyes wander around the neighborhood and end up looking toward the newlywed's apartment. He smiles affectionately and starts to turn away, but something startles him, and he looks quickly back as the shade goes up in the newlywed's apartment. The young husband, wearing only pajama bottoms because of the heat, leans on the windowsill, looking out with satisfaction, revealing he is a well-muscled, attractive young man. Jeff's head snaps toward the center of his window as Stella appears behind his wheelchair. Two men in tan coveralls stand outside Thorwald's door, one of them carrying a clipboard. Thorwald's hair is disheveled, and he is unshaved. He opens the door, admits the two men after a short exchange, and leaves it open behind them. Stella and Jeff watch intently as Jeff feels alongside his wheelchair for his binoculars. A close view shows the men carrying a trunk across Thorwald's living room toward the corridor. Jeff lowers the binoculars quickly, turns over his shoulder to watch Stella as she moves toward the door. She calls back to him while already going up the steps. The salesman speaks to the operator, while Jeff lowers the binoculars and takes a normal view of the alleyway, momentarily blocked by a freight truck. After the trucks part, only the back half of the freight truck is visible before it pulls out of sight. The hood and cab of the truck are seen as another truck moves across from the left. Jeff quickly raises the binoculars, holding them just in time to see a puffing and blowing Stella arrive at the opening of the alleyway. Another truck crosses from the left by the time the binoculars are up.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Jeff's optics are gazing intently at the backyard over the coffee mug, then drift upward as he places it down. Stella rotates and strides into the kitchen, and Jeff's optics shift downward again. Abstractedly, his hand extends for a slice of bacon, but he shoves the nourishment away and selects the coffee mug instead. Miss Torso, in a ballet attire, is suspending a small wash comprising mostly of lingerie on a clothesline while performing her inevitable leg exercises. Jeff seems to be becoming a bit listless or uninterested from perpetually observing Thorwald's flat, so his optics meander around the vicinity and end up gazing toward the newlywed's flat. He grins affectionately and begins to turn away, but something jolts him, and he glances swiftly back as the shade ascends in the newlywed's flat. The young spouse, wearing only pajama bottoms due to the heat, leans on the windowsill, looking out with contentment, unveiling he is a well-muscled, appealing young man. Jeff's head snaps toward the center of his window as Stella emerges behind his wheelchair. Two men in tan coveralls stand outside Thorwald's entrance, one of them holding a clipboard. Thorwald's hair is tousled, and he is unshaven. He opens the entrance, admits the two men after a brief exchange, and leaves it ajar behind them. Stella and Jeff observe keenly as Jeff feels alongside his wheelchair for his binoculars. A close view displays the men carrying a trunk across Thorwald's living room toward the hallway. Jeff lowers the binoculars swiftly, turns over his shoulder to observe Stella as she moves toward the entrance. She calls back to him while already ascending the steps. The salesman speaks to the operator, while Jeff lowers the binoculars and takes a regular view of the alleyway, momentarily obstructed by a freight vehicle. After the vehicles part, only the back portion of the freight vehicle is visible before it pulls out of view. The hood and cab of the vehicle are seen as another vehicle moves across from the left. Jeff promptly raises the binoculars, holding them just in time to see a huffing and blowing Stella arrive at the opening of the alleyway. Another vehicle crosses from the left by the time the binoculars are up."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Jeff's eyes are stared at intently by the backyard over the coffee cup, then they are strayed upward by him as the cup is put down by him. The kitchen is turned to and walked into by Stella, and Jeff's eyes are moved down again by him. Abstractedly, a piece of bacon is reached for by his hand, but the food is pushed away by him and the coffee cup is picked up instead. Miss Torso, in a ballet outfit, hangs up a small wash consisting mostly of lingerie on a clothesline while she inevitably practices her leg. A bit listless or bored is how Jeff appears to get from constantly watching Thorwald's apartment, so the neighborhood is wandered around by his eyes, and they end up looking toward the newlywed's apartment. An affectionate smile is given by him and he starts to turn away, but he is startled by something, and he quickly looks back as the shade is raised in the newlywed's apartment. The young husband, wearing only pajama bottoms because of the heat, leans on the windowsill, looks out with satisfaction, revealing himself to be a well-muscled, attractive young man. Jeff's head is snapped toward the center of his window as Stella appears behind his wheelchair. Thorwald's door is stood outside of by two men in tan coveralls, one of whom carries a clipboard. Thorwald's hair is disheveled, and he is unshaved. The door is opened by him, the two men are admitted after a short exchange, and it is left open behind them by him. Stella and Jeff watch intently as the binoculars are felt for alongside his wheelchair by Jeff. The men are shown in a close view carrying a trunk across Thorwald's living room toward the corridor. The binoculars are quickly lowered by Jeff; he turns over his shoulder to watch Stella as she moves toward the door. He is called back to by her while she is already going up the steps. The operator is spoken to by the salesman, while the binoculars are lowered by Jeff and a normal view of the alleyway is taken by him, momentarily blocked by a freight truck. After the trucks part, only the back half of the freight truck is visible before it pulls out of sight. The hood and cab of the truck are seen as another truck moves across from the left. The binoculars are quickly raised by Jeff, and they are held just in time to see a puffing and blowing Stella arrive at the opening of the alleyway. Another truck crosses from the left by the time he has the binoculars up."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Jeff intently watches the backyard over his coffee cup, glancing upwards before setting it down. As Stella walks into the kitchen, his gaze drops. Distracted, he reaches for bacon but opts for coffee instead. Miss Torso, in ballet attire, hangs lingerie on a clothesline while practicing her leg movements. Bored with observing Thorwald's apartment, Jeff’s eyes wander to the newlyweds' apartment. He smiles, then suddenly looks back as the shade rises. The young husband, in pajama bottoms due to the heat, leans contentedly on the windowsill, revealing his muscular physique. Jeff turns toward the window's center as Stella appears behind him. Two men in tan coveralls, with a clipboard, stand at Thorwald's door. Thorwald, looking disheveled and unshaven, admits them after a brief exchange, leaving the door open. Jeff searches for his binoculars as they watch. He sees the men carrying a trunk across Thorwald's living room. Lowering the binoculars, Jeff watches Stella head to the door, calling back while ascending the steps. The salesman talks to the operator as Jeff views the alleyway, temporarily blocked by a freight truck. Once it clears, a truck's back half is visible before it departs. Jeff quickly raises the binoculars, catching Stella arriving at the alleyway's opening as another truck passes."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Jeff stares at the backyard over his coffee, lowers the cup, then reaches for bacon but opts for more coffee. Miss Torso, in a ballet outfit, hangs lingerie while practicing. Bored of watching Thorwald's place, Jeff looks at the newlyweds, smiling until startled by the raising shade, revealing the muscular husband in pajama bottoms. Stella appears behind Jeff's wheelchair as two men in tan coveralls arrive at Thorwald's door. Disheveled Thorwald admits them, leaving the door open. Jeff and Stella watch as the men carry a trunk through Thorwald's living room. Jeff shifts focus to Stella leaving and observes the alleyway, briefly obscured by a freight truck. Jeff uses binoculars to spot the puffing Stella at the alley's opening amid moving trucks."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Jeff's eyes, sharp and focused, are intently staring over the rim of his coffee cup at the scene unfolding in the backyard. After a moment, his gaze strays upward as he lowers the cup to rest on the table. Meanwhile, Stella pivots gracefully and walks purposefully into the kitchen, prompting Jeff's eyes to shift downward once more. Almost unconsciously, his hand reaches out to grab a piece of enticing bacon, but he ends up pushing the tempting food aside and opts to pick up the comforting coffee cup again. \n\nIn the yard, Miss Torso, dressed in a ballet attire, is gracefully hanging up a small load of laundry composed mostly of delicate lingerie on the clothesline, all while seamlessly incorporating her inevitable leg practice into the task. Jeff, who seems to be growing a bit listless or perhaps even a little bored from his constant surveillance of Thorwald's apartment, allows his eyes to wander across the neighborhood's varied scenes. Eventually, his gaze settles on the newlywed's apartment, and he can't help but smile affectionately before he begins to turn away. \n\nHowever, something unexpected startles him, and he swiftly shifts his attention back as the shade in the newlywed's apartment rises suddenly. The young husband, clad only in pajama bottoms due to the oppressive heat, leans casually on the windowsill, gazing out with a look of satisfaction and revealing himself to be a well-muscled, attractive young man. Jeff's head snaps toward the center of his window as Stella, appearing from behind his wheelchair, comes into view. \n\nOutside Thorwald's door, two men in tan coveralls stand, one of them holding a clipboard. Thorwald himself appears disheveled and unshaven, and after a brief exchange, he opens the door and admits the two men, leaving it ajar behind them. Jeff and Stella watch with heightened interest as Jeff searches alongside his wheelchair for his binoculars. With a close view through the binoculars, the two men are seen carrying a trunk across Thorwald's living room toward the corridor. \n\nQuickly, Jeff lowers the binoculars, turning over his shoulder to keep an eye on Stella as she moves toward the door. She calls back to him while she is already ascending the steps. The salesman engages in conversation with the operator, and meanwhile, Jeff lowers the binoculars to take a regular view of the alleyway, which is momentarily blocked by a freight truck. After the trucks part, only the back half of the freight truck is visible before it pulls away and disappears from sight. The hood and cab of the truck appear as another vehicle moves across from the left. With urgency, Jeff quickly raises his binoculars once more, timing it perfectly to catch a puffing and blowing Stella as she arrives at the opening of the alleyway. By that time, another truck has already crossed from the left when the binoculars are in place."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Jeff's eyes, sharp and intensely focused, are fixed intently over the rim of his coffee cup as he observes with keen interest the unfolding scene in the backyard. After a brief moment of contemplation, his gaze drifts upward as he gently lowers the cup to let it rest on the table beside him. Meanwhile, in a fluid motion, Stella pivots gracefully and strides purposefully into the kitchen, causing Jeff's eyes to follow her path downward once again. Almost without realizing it, his hand reaches out to grasp a savory slice of enticing bacon, yet he ultimately pushes the tempting morsel aside and instead opts to pick up the comforting coffee cup once more. \n\nOut in the yard, Miss Torso, elegantly attired in her ballet outfit, is deftly hanging up a small load of laundry. The wash consists mostly of delicate lingerie, and she skillfully incorporates her inevitable leg practice into the task at hand with seamless precision. Jeff, who appears to be growing somewhat listless or perhaps even a little bored from his unending surveillance of Thorwald's apartment, lets his eyes wander across the diverse and lively scenes of the neighborhood. Eventually, his gaze finds the newlywed's apartment, where he can't help but smile with affection before he starts to turn away.\n\nHowever, something unexpected suddenly startles him, and he swiftly redirects his attention back as the shade in the newlywed's apartment rises abruptly. The young husband, wearing only pajama bottoms due to the oppressive heat, leans casually on the windowsill, gazing out with a look of satisfaction. He reveals himself to be a well-muscled, attractive young man. Jeff's head snaps instinctively toward the center of his window as Stella, emerging from behind his wheelchair, comes prominently into view.\n\nOutside Thorwald's door, two men in tan coveralls are standing, with one of them holding a clipboard in hand. Thorwald himself appears disheveled and unshaven, and after a brief exchange of words, he opens the door to admit the two men inside, leaving it ajar behind them. Jeff and Stella watch with heightened interest as Jeff searches frantically alongside his wheelchair for his binoculars. With a close-up view now available through the binoculars, the two men can be seen carrying a trunk across Thorwald's living room toward the corridor. \n\nQuickly and with a sense of urgency, Jeff lowers the binoculars, turning over his shoulder to keep a watchful eye on Stella as she moves determinedly toward the door. She calls back to him while she is already ascending the steps with determined haste. Meanwhile, the salesman engages in conversation with the operator, and Jeff lowers the binoculars to take a regular view out onto the alleyway, which is momentarily blocked by the presence of a freight truck. When the trucks part visibly, only the back half of the freight truck remains in view before it pulls away and disappears completely from sight. The hood and cab of the truck come into view as another vehicle moves across from the left. With urgency, Jeff quickly raises his binoculars once again, timing it perfectly to catch a puffing and blowing Stella as she arrives at the opening of the alleyway. By that time, another truck is already crossing from the left, just as the binoculars are in place."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Jeff's gaze is intensely focused on the backyard, observing intently over the rim of his coffee cup. His eyes linger momentarily before drifting upwards as he gently sets the cup down. Meanwhile, Stella turns on her heel, heading into the kitchen with a purposeful stride, prompting Jeff's gaze to shift downward once more. Almost absent-mindedly, his fingers stretch out towards a piece of bacon, but after a moment's hesitation, he nudges the food aside and opts to lift the coffee cup instead. Outside, Miss Torso, clad in a ballet outfit, is extending her arms gracefully as she hangs up a small load of wash composed predominantly of lingerie on the clothesline. Her movements are interspersed with her habitual leg exercises. Inside, Jeff, feeling a touch of restlessness or boredom from his constant observation of Thorwald's apartment, allows his eyes to wander across the neighborhood. His gaze eventually settles on the newlyweds' apartment, where he smiles warmly, indulging for a moment, before beginning to turn away. Suddenly, something catches his attention, and he quickly redirects his focus as the window shade in the newlyweds' apartment is raised. The young husband, clad only in pajama bottoms due to the stifling heat, leans confidently on the windowsill and casts a satisfied look outside, his well-toned physique and attractive features now apparent. Jeff's attention is abruptly pulled to the center of his window as Stella materializes behind his wheelchair, her presence signaled by the sound of her movement. Outside Thorwald's door, two men in tan coveralls form a stationary presence, with one gripping a clipboard in his hand. Thorwald, looking slightly disarrayed with disheveled hair and an unshaven face, unfastens the door, allowing the men to enter after a brief verbal exchange, leaving the door ajar behind them. Both Stella and Jeff fix their attention intently on the scene, compelling Jeff to reach alongside his wheelchair with a searching hand for his binoculars. Through the binoculars, he captures a close view of the men maneuvering a trunk across Thorwald's living room and towards the corridor. Abruptly, Jeff lowers the binoculars, shifts in his wheelchair, and throws a glance over his shoulder to watch Stella as she moves determinedly toward the door. She calls out to him, her words trailing as she ascends the steps. In the meantime, the salesman engages in conversation with the operator, while Jeff, having lowered the binoculars, takes a moment to observe the alleyway in its entirety, momentarily obscured by a freight truck. As the trucks part, only the rear section of the freight truck is visible before it disappears from view. The truck's hood and cab become visible as another vehicle comes into view from the left. In a swift motion, Jeff raises his binoculars once more, holding them steady just in time to witness Stella puffing and blowing with exertion as she reaches the alleyway's entrance. As she appears, yet another truck crosses from the left, coinciding with the moment the binoculars are raised."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Jeff shifts his gaze from the backyard over his coffee cup to the sky as he sets the cup down. As Stella moves into the kitchen, he reaches for a piece of bacon but opts for more coffee instead. Miss Torso, in her ballet outfit, practices leg exercises while hanging out laundry. Feeling restless from watching Thorwald's apartment, Jeff's attention drifts to the newlyweds' apartment, where he smiles affectionately. Suddenly startled, he quickly looks back as the window shade rises, revealing the young husband leaning on the windowsill. Stella appears behind Jeff's wheelchair as Thorwald admits two men into his apartment, leaving the door open. Jeff and Stella watch intently as he retrieves his binoculars to see the men carrying a trunk inside. Jeff then lowers the binoculars to observe Stella as she heads toward the door, calling back to him on her way up the steps. Meanwhile, a freight truck blocks Jeff's view of the alleyway. Once the trucks clear, Jeff swiftly raises his binoculars, catching a glimpse of Stella arriving at the alleyway's opening, just as another truck passes by."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Jeff's eyes are staring intently at the backyard over the coffee cup, which is filled with a dark roast blend known for its rich flavor, then stray upward as he puts it down. Stella, who works as a private nurse and often fusses over Jeff's well-being, turns and walks into the kitchen, and Jeff's eyes move down again. Abstractedly, his hand reaches for a piece of bacon, a crispy slice from the local butcher known for its quality meats, but he pushes the food away and picks up the coffee cup instead. Miss Torso, a professional ballet dancer training for an upcoming audition, is in a ballet outfit, hanging up a small wash consisting mostly of lingerie on a clothesline while doing her inevitable leg practice, which includes precise, graceful movements. Jeff appears to be getting a bit listless or bored from constantly watching Thorwald's apartment, a modest third-floor unit with a view of the courtyard, so his eyes wander around the neighborhood and end up looking toward the newlywed's apartment. He smiles affectionately and starts to turn away, but something startles him, and he looks quickly back as the shade goes up in the newlywed's apartment. The young husband, wearing only pajama bottoms because of the heat wave affecting the city, leans on the windowsill, looking out with satisfaction, revealing he is a well-muscled, attractive young man. Jeff's head snaps toward the center of his window as Stella appears behind his wheelchair, which he has been using since breaking his leg in a photography accident. Two men in tan coveralls, uniforms of the local moving company often hired in the area, stand outside Thorwald's door, one of them carrying a clipboard that suggests they have official business. Thorwald's hair is disheveled, and he is unshaved, giving him a haggard look that contrasts with the normally meticulous appearance expected of a salesman. He opens the door, admits the two men after a short exchange regarding the trunk's destination, and leaves it open behind them. Stella and Jeff watch intently as Jeff feels alongside his wheelchair for his binoculars, a pair designed for long-distance viewing, enhancing his ability to observe. A close view shows the men carrying a trunk across Thorwald's living room toward the corridor, its weight evident in their cautious movements. Jeff lowers the binoculars quickly, turns over his shoulder to watch Stella as she moves toward the door. She calls back to him while already going up the steps leading to the alleyway, intent on confirming their suspicions. The salesman speaks to the operator, arranging a delivery pickup for later that day, while Jeff lowers the binoculars and takes a normal view of the alleyway, momentarily blocked by a freight truck delivering supplies to the local grocery store. After the trucks part, only the back half of the freight truck is visible before it pulls out of sight, carrying goods to restock stores throughout the neighborhood. The hood and cab of the truck are seen as another truck, part of a nearby construction project, moves across from the left. Jeff quickly raises the binoculars, holding them just in time to see a puffing and blowing Stella arrive at the opening of the alleyway, her determination evident despite the exertion. Another truck, marked with the logo of a popular logistics company, crosses from the left by the time the binoculars are up."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Jeff's eyes are staring intently at the backyard over the coffee cup then stray upward as he puts it down. Stella turns and walks into the kitchen and Jeff's eyes move down again. Abstractedly. his hand reaches for a piece of bacon but he pushes the food away and picks up the coffee cup instead. Miss Torso in a ballet outfit is hanging up a small wash consisting mostly of lingerie on a clothesline while doing her inevitable leg practice. Jeff appears to be getting a bit listless or bored from constantly watching Thorwald's apartment so his eyes wander around the neighborhood and end up looking toward the newlywed's apartment. He smiles affectionately and starts to turn away but something startles him and he looks quickly back as the shade goes up in the newlywed's apartment. The young husband wearing only pajama bottoms because of the heat leans on the windowsill looking out with satisfaction revealing he is a wellmuscled attractive young man. Jeff's head snaps toward the center of his window as Stella appears behind his wheelchair. Two men in tan coveralls stand outside Thorwald's door one of them carrying a clipboard. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Thorwald's hair is disheveled and he is unshaved. He opens the door admits the two men after a short exchange and leaves it open behind them. Stella and Jeff watch intently as Jeff feels alongside his wheelchair for his binoculars. A close view shows the men carrying a trunk across Thorwald's living room toward the corridor. Jeff lowers the binoculars quickly turns over his shoulder to watch Stella as she moves toward the door. She calls back to him while already going up the steps. The salesman speaks to the operator while Jeff lowers the binoculars and takes a normal view of the alleyway momentarily blocked by a freight truck. After the trucks part only the back half of the freight truck is visible before it pulls out of sight. The hood and cab of the truck are seen as another truck moves across from the left. Jeff quickly raises the binoculars holding them just in time to see a puffing and blowing Stella arrive at the opening of the alleyway. Another truck crosses from the left by the time the binoculars are up."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Jeff's eyes are staring intently at the backyard over the coffee cup then stray upward as he puts it down. Stella turns and walks into the kitchen and Jeff's eyes move down again. Abstractedly. his hand reaches for a piece of bacon but he pushes the food away and picks up the coffee cup instead. Miss Torso in a ballet outfit is hanging up a small wash consisting mostly of lingerie on a clothesline while doing her inevitable leg practice. Jeff appears to be getting a bit listless or bored from constantly watching Thorwald's apartment so his eyes wander around the neighborhood and end up looking toward the newlywed's apartment. He smiles affectionately and starts to turn away but something startles him and he looks quickly back as the shade goes up in the newlywed's apartment. The young husband wearing only pajama bottoms because of the heat leans on the windowsill looking out with satisfaction revealing he is a wellmuscled attractive young man. Jeff's head snaps toward the center of his window as Stella appears behind his wheelchair. Two men in tan coveralls stand outside Thorwald's door one of them carrying a clipboard. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Thorwald's hair is disheveled and he is unshaved. He opens the door admits the two men after a short exchange and leaves it open behind them. Stella and Jeff watch intently as Jeff feels alongside his wheelchair for his binoculars. A close view shows the men carrying a trunk across Thorwald's living room toward the corridor. Jeff lowers the binoculars quickly turns over his shoulder to watch Stella as she moves toward the door. She calls back to him while already going up the steps. The salesman speaks to the operator while Jeff lowers the binoculars and takes a normal view of the alleyway momentarily blocked by a freight truck. After the trucks part only the back half of the freight truck is visible before it pulls out of sight. The hood and cab of the truck are seen as another truck moves across from the left. Jeff quickly raises the binoculars holding them just in time to see a puffing and blowing Stella arrive at the opening of the alleyway. Another truck crosses from the left by the time the binoculars are up."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Jeff's eyes are staring intently at the backyard over the coffee cup then stray upward as he puts it down. Stella turns and walks into the kitchen and Jeff's eyes move down again. Abstractedly. his hand reaches for a piece of bacon but he pushes the food away and picks up the coffee cup instead. Miss Torso in a ballet outfit is hanging up a small wash consisting mostly of lingerie on a clothesline while doing her inevitable leg practice. She calls back to him while already going up the steps. The salesman speaks to the operator while Jeff lowers the binoculars and takes a normal view of the alleyway momentarily blocked by a freight truck. After the trucks part only the back half of the freight truck is visible before it pulls out of sight. The hood and cab of the truck are seen as another truck moves across from the left. Jeff quickly raises the binoculars holding them just in time to see a puffing and blowing Stella arrive at the opening of the alleyway. Another truck crosses from the left by the time the binoculars are up."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Jeff's eyes are staring intently at the backyard over the coffee cup then stray upward as he puts it down. Stella turns and walks into the kitchen and Jeff's eyes move down again. The hood and cab of the truck are seen as another truck moves across from the left. Jeff quickly raises the binoculars holding them just in time to see a puffing and blowing Stella arrive at the opening of the alleyway. Another truck crosses from the left by the time the binoculars are up."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Tony's ears are listening quietly to the garden over the cookie jar, then drift downward as he picks it up. Lisa spins and dances into the garage, and Tony's ears ascend again. Vaguely, his foot taps for a slice of cake, but he kicks the dessert aside and grabs the cookie jar instead. Miss Dancer, in a clown costume, is folding a large quilt made mostly of scarves on a hammock while performing her eventual arm routine. Tony seems to be getting a bit restless or uninterested from consistently listening to Larson's mansion, so his ears wander around the countryside and settle toward the librarian's mansion. He grins wistfully and begins to spin away, but something surprises him, and he listens quickly back as the curtain rises in the librarian's mansion. The elderly aunt, wearing only a beanie because of the cold, sits on the porch, listening out with pride, revealing she is a well-aged, forgetful elderly woman. Tony's knee jerks toward the edge of his balcony as Lisa appears beneath his ladder. Two women in red gowns stand inside Larson's window, one of them holding a map. Larson's shoes are polished, and he is dressed. He closes the window, dismisses the two women after a long soliloquy, and leaves it shut behind them. Lisa and Tony listen quietly as Tony taps alongside his ladder for his sunglasses. A distant view shows the women rolling a barrel across Larson's playroom toward the garden. Tony raises the sunglasses lazily, glances to his side to listen to Lisa as she dances toward the window. She whispers back to him while already sliding down the ramp. The baker shouts to the producer, while Tony raises the sunglasses and takes a blurry view of the driveway, temporarily blocked by a delivery van. After the vans collide, only the front half of the delivery van is visible before it drives into view. The roof and trailer of the van are heard as a bicycle rides across from the right. Tony lazily lowers the sunglasses, dropping them just in time to hear a huffing and gasping Lisa arrive at the edge of the driveway. Another bicycle rides from the right by the time the sunglasses are down."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Jeff watches the backyard over his coffee cup, his gaze following Stella as she moves into the kitchen. Distractedly, he reaches for bacon but opts for coffee instead. Miss Torso, in a ballet outfit, practices while hanging lingerie to dry. Bored from watching Thorwald's apartment, Jeff's eyes wander to the newlywed's apartment. He smiles, but is startled when the shade goes up, revealing a young, muscular husband. Stella appears behind Jeff's wheelchair, and they both focus on two men in tan coveralls outside Thorwald's door. Thorwald, unkempt, lets them in, leaving the door open. Jeff grabs his binoculars, noticing the men carrying a trunk across Thorwald’s living room. As Stella moves toward the door, Jeff observes the alleyway, briefly blocked by a truck. Adjusting his binoculars, he sees Stella arriving at the alleyway, her timing intersecting with the ongoing truck movements."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Another truck crosses from the left by the time the binoculars are up Jeff quickly raises the binoculars holding them just in time to see a puffing and blowing Stella arrive at the opening of the alleyway The hood and cab of the truck are seen as another truck moves across from the left After the trucks part only the back half of the freight truck is visible before it pulls out of sight The salesman speaks to the operator while Jeff lowers the binoculars and takes a normal view of the alleyway momentarily blocked by a freight truck She calls back to him while already going up the steps Jeff lowers the binoculars quickly turns over his shoulder to watch Stella as she moves toward the door A close view shows the men carrying a trunk across Thorwald's living room toward the corridor Stella and Jeff watch intently as Jeff feels alongside his wheelchair for his binoculars He opens the door admits the two men after a short exchange and leaves it open behind them Thorwald's hair is disheveled and he is unshaved Two men in tan coveralls stand outside Thorwald's door one of them carrying a clipboard Jeff's head snaps toward the center of his window as Stella appears behind his wheelchair The young husband wearing only pajama bottoms because of the heat leans on the windowsill looking out with satisfaction revealing he is a wellmuscled attractive young man He smiles affectionately and starts to turn away but something startles him and he looks quickly back as the shade goes up in the newlywed's apartment Jeff appears to be getting a bit listless or bored from constantly watching Thorwald's apartment so his eyes wander around the neighborhood and end up looking toward the newlywed's apartment Miss Torso in a ballet outfit is hanging up a small wash consisting mostly of lingerie on a clothesline while doing her inevitable leg practice his hand reaches for a piece of bacon but he pushes the food away and picks up the coffee cup instead Abstractedly Stella turns and walks into the kitchen and Jeff's eyes move down again Jeff's eyes are staring intently at the backyard over the coffee cup then stray upward as he puts it down"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Stella turns and walks into the kitchen and Jeff's eyes move down again Jeff's eyes are staring intently at the backyard over the coffee cup then stray upward as he puts it down his hand reaches for a piece of bacon but he pushes the food away and picks up the coffee cup instead Abstractedly Jeff appears to be getting a bit listless or bored from constantly watching Thorwald's apartment so his eyes wander around the neighborhood and end up looking toward the newlywed's apartment Miss Torso in a ballet outfit is hanging up a small wash consisting mostly of lingerie on a clothesline while doing her inevitable leg practice The young husband wearing only pajama bottoms because of the heat leans on the windowsill looking out with satisfaction revealing he is a wellmuscled attractive young man He smiles affectionately and starts to turn away but something startles him and he looks quickly back as the shade goes up in the newlywed's apartment Two men in tan coveralls stand outside Thorwald's door one of them carrying a clipboard Jeff's head snaps toward the center of his window as Stella appears behind his wheelchair He opens the door admits the two men after a short exchange and leaves it open behind them Thorwald's hair is disheveled and he is unshaved A close view shows the men carrying a trunk across Thorwald's living room toward the corridor Stella and Jeff watch intently as Jeff feels alongside his wheelchair for his binoculars She calls back to him while already going up the steps Jeff lowers the binoculars quickly turns over his shoulder to watch Stella as she moves toward the door After the trucks part only the back half of the freight truck is visible before it pulls out of sight The salesman speaks to the operator while Jeff lowers the binoculars and takes a normal view of the alleyway momentarily blocked by a freight truck Jeff quickly raises the binoculars holding them just in time to see a puffing and blowing Stella arrive at the opening of the alleyway The hood and cab of the truck are seen as another truck moves across from the left Another truck crosses from the left by the time the binoculars are up"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He opens the door admits the two men after a short exchange and leaves it open behind them Stella and Jeff watch intently as Jeff feels alongside his wheelchair for his binoculars A close view shows the men carrying a trunk across Thorwald's living room toward the corridor Jeff lowers the binoculars quickly turns over his shoulder to watch Stella as she moves toward the door She calls back to him while already going up the steps The salesman speaks to the operator while Jeff lowers the binoculars and takes a normal view of the alleyway momentarily blocked by a freight truck After the trucks part only the back half of the freight truck is visible before it pulls out of sight The hood and cab of the truck are seen as another truck moves across from the left Jeff quickly raises the binoculars holding them just in time to see a puffing and blowing Stella arrive at the opening of the alleyway Another truck crosses from the left by the time the binoculars are up Jeff's eyes are staring intently at the backyard over the coffee cup then stray upward as he puts it down Stella turns and walks into the kitchen and Jeff's eyes move down again Abstractedly his hand reaches for a piece of bacon but he pushes the food away and picks up the coffee cup instead Miss Torso in a ballet outfit is hanging up a small wash consisting mostly of lingerie on a clothesline while doing her inevitable leg practice Jeff appears to be getting a bit listless or bored from constantly watching Thorwald's apartment so his eyes wander around the neighborhood and end up looking toward the newlywed's apartment He smiles affectionately and starts to turn away but something startles him and he looks quickly back as the shade goes up in the newlywed's apartment The young husband wearing only pajama bottoms because of the heat leans on the windowsill looking out with satisfaction revealing he is a wellmuscled attractive young man Jeff's head snaps toward the center of his window as Stella appears behind his wheelchair Two men in tan coveralls stand outside Thorwald's door one of them carrying a clipboard Thorwald's hair is disheveled and he is unshaved"
        }
      ]
    }
  ]
}