{
  "ground_truth": "She is wearing a Kelly Green suit and is seated at her dressing table. Jeff looks down and smiles to himself. He turns and raises the long-focus camera to his eye. The long-focus lens brings Miss Lonely Hearts into an enlarged picture that reveals details we have not previously noticed. A pair of ill-fitting horn-rimmed reading glasses rest halfway down her nose, and she has to tilt her head back slightly as she applies lipstick with their aid. Satisfied, she takes off the glasses and examines her face as a whole through squinting eyes. Her hair-do makes her seem middle-aged. She has faded good looks, fairly nice clothes, but is badly in need of advice on hair dressing. She reaches for a tall glass of liquor next to her and takes a long drink. Putting the glass down, she squints to see if she has disturbed the lipstick. Unable to see clearly, she puts on the glasses again, looks, and touches up her lips slightly. She puts her glasses in a handbag, then stands to put out the lights. She walks into the living room, finishing the drink. The long-focus lens moves with her. She goes straight for a bottle of liquor, pours out a final neat slug, and tosses it off. Then she leaves the apartment with a show of determination. She turns out the lights behind her. Jeff lowers the long-focus lens and turns his head to the right as he hears the first notes of the songwriter's melody, which we have heard him trying to complete. He is in black tie, and from the looks of the apartment, he is preparing for guests. An attractive girl is setting out trays of canapés, glasses, ice, and liquor. She pauses as she crosses the room carrying a tray of food. She listens a moment to the songwriter's melody. She comments on it to the songwriter, who starts from the beginning again, playing it more fully. Her expression shows that it pleases her and moves her romantically. Jeff's head turns in this new direction. Miss Torso and a male partner whom we have not seen before are practicing a pas de deux. A new source of music comes in to interfere with the piano playing. It is orchestral ballet music in a modern style. He is a tall, flowing-haired young man, lithe and graceful beyond normal masculine capacity. They stop at one point to listen to a word of comment from a woman who is watching. By her gestures, she is obviously a professional choreographer. The camera pans from this to the street beyond. Standing there on the sidewalk, looking up and down the street, is a Kelly Green clad figure.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She is wearing a Kelly Green ensemble and is seated at her vanity table. Jeff glances down and grins to himself. He rotates and elevates the telephoto camera to his gaze. The telephoto lens presents Miss Lonely Hearts into an enlarged image that unveils specifics we have not previously observed. A pair of ill-fitting horn-rimmed reading spectacles rest halfway down her nose, and she has to tilt her head back slightly as she applies lipstick with their aid. Contented, she takes off the spectacles and scrutinizes her face as a whole through squinting eyes. Her hairstyle makes her appear middle-aged. She has faded good looks, fairly nice attire, but is badly in need of counsel on hair styling. She reaches for a tall glass of liquor next to her and takes a long sip. Placing the glass down, she squints to see if she has disturbed the lipstick. Unable to see clearly, she puts on the spectacles again, looks, and touches up her lips slightly. She puts her spectacles in a handbag, then stands to turn out the lights. She walks into the living room, finishing the drink. The telephoto lens moves with her. She goes straight for a bottle of liquor, pours out a final neat shot, and tosses it off. Then she exits the apartment with a display of resolve. She turns out the lights behind her. Jeff lowers the telephoto lens and turns his head to the right as he hears the first notes of the composer's melody, which we have heard him striving to conclude. He is in black tie, and from the appearance of the apartment, he is preparing for guests. An appealing girl is arranging trays of hors d'oeuvres, glasses, ice, and liquor. She pauses as she crosses the room bearing a tray of food. She listens a moment to the composer's melody. She remarks on it to the composer, who starts from the beginning again, playing it more fully. Her expression shows that it pleases her and moves her passionately. Jeff's head turns in this new orientation. Miss Torso and a male partner whom we have not seen before are rehearsing a pas de deux. A new source of music comes in to interfere with the piano playing. It is orchestral ballet music in a modern style. He is a tall, flowing-haired young man, lithe and graceful beyond ordinary masculine ability. They stop at one point to listen to a word of comment from a woman who is observing. By her gestures, she is evidently a professional choreographer. The camera pans from this to the street beyond. Standing there on the sidewalk, looking up and down the street, is a Kelly Green clad figure."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "She is wearing a Kelly Green suit and is seated at her dressing table. Jeff looks down and smiles to himself. He turns and raises the long-focus camera to his eye. Miss Lonely Hearts is brought into an enlarged picture by the long-focus lens, revealing details not previously noticed by us. A pair of ill-fitting horn-rimmed reading glasses rest halfway down her nose, and she has to tilt her head back slightly as lipstick is applied by her with their aid. Satisfied, she takes off the glasses and examines her face as a whole through squinting eyes. Her hair-do makes her seem middle-aged. She has faded good looks and fairly nice clothes, but advice on hair dressing is badly needed by her. A tall glass of liquor next to her is reached for and a long drink is taken by her. Putting the glass down, she squints to see if the lipstick has been disturbed by her. Unable to see clearly, she puts on the glasses again, looks, and slightly touches up her lips. Her glasses are put in a handbag by her, then she stands to put out the lights. The living room is walked into by her, as she finishes the drink. The long-focus lens moves with her. A bottle of liquor is gone straight for by her, and a final neat slug is poured out and tossed off by her. Then the apartment is left by her with a show of determination. The lights are turned out by her behind her. The long-focus lens is lowered by Jeff, and his head is turned to the right as the first notes of the songwriter's melody, which he has been heard trying to complete by us, reach him. He is in black tie, and from the looks of the apartment, he is preparing for guests. An attractive girl sets out trays of canapés, glasses, ice, and liquor. As a tray of food is carried by her across the room, she pauses. She listens a moment to the songwriter's melody. A comment on it is made by her to the songwriter, who starts from the beginning again, playing it more fully. Her expression shows that it pleases her and moves her romantically. Jeff's head is turned in this new direction by him. In the apartment, Miss Torso and a male partner, not seen by us before, practice a pas de deux. A new source of music comes in to interfere with the piano playing. Orchestral ballet music in a modern style is being played. He is a tall, flowing-haired young man, lithe and graceful beyond normal masculine capacity. They stop at one point to listen to a word of comment, which is offered by a woman who is watching. By her gestures, she is obviously a professional choreographer. The camera pans from this to the street beyond. A figure clad in Kelly Green stands there on the sidewalk, looking up and down the street."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "She wears a Kelly Green suit, seated at her dressing table. Jeff smiles, raising a long-focus camera to his eye. The lens enlarges Miss Lonely Hearts, revealing details like ill-fitting horn-rimmed glasses on her nose as she applies lipstick. Satisfied, she removes the glasses, examines her face, and drinks from a tall glass of liquor. Checking her lipstick, she puts the glasses back on, touches up her lips, and places them in her handbag. She stands, turns out the lights, and moves to the living room, finishing her drink. The lens follows her as she pours another drink, then leaves the apartment determinedly, turning off the lights. Jeff lowers the lens, hearing the songwriter's melody. In black tie, he prepares for guests. An attractive girl sets out trays of canapés, glasses, ice, and liquor, pausing to listen to the melody, which pleases her. Jeff turns his attention to Miss Torso and a male partner practicing a pas de deux to orchestral ballet music. A professional choreographer comments as they stop. The camera pans to the street, where a Kelly Green clad figure stands on the sidewalk."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "She wears a Kelly Green suit at her dressing table. Jeff smiles, raises the long-focus camera, and observes Miss Lonely Hearts. Ill-fitting glasses rest on her nose as she applies lipstick. Satisfied, she removes the glasses, examines her face, and drinks liquor. Checking her lipstick, she puts on glasses again, touches up, and puts them in her handbag. She stands, turns off lights, and moves to the living room, finishing her drink. She pours another drink, tosses it off, and leaves determinedly. Jeff hears the songwriter's melody. In black tie, he prepares for guests. An attractive girl sets out trays and comments on the melody, showing romantic interest. Miss Torso practices a pas de deux with a partner. Orchestral ballet music interferes with the piano. A tall, graceful man and a choreographer watch. The camera pans to the street, revealing a Kelly Green figure."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "She is elegantly dressed in a striking Kelly Green suit and is comfortably seated at her dressing table, surrounded by the familiar trappings of her personal space. Meanwhile, Jeff, observing from a distance, glances downward and allows a subtle smile to play across his lips, amused by his own thoughts. He then turns his attention back to his task, raising the long-focus camera to his eye with practiced ease. Through the powerful lens, Miss Lonely Hearts is brought into sharp focus, revealing intricate details that had previously escaped our notice. Perched precariously on her nose are a pair of ill-fitting horn-rimmed reading glasses, which she must adjust by tilting her head back slightly as she carefully applies lipstick, using the glasses to aid her precision. Once satisfied with her appearance, she removes the glasses and scrutinizes her reflection, squinting to take in her entire visage. Her hairstyle gives her a somewhat middle-aged appearance, and although she possesses faded good looks and wears fairly nice clothes, it is evident that she could greatly benefit from some expert advice on hairstyling. \n\nReaching for a tall glass of liquor that sits invitingly beside her, she takes a long, deliberate drink. After setting the glass down, she squints once more to check if her lipstick has been disturbed. Finding her vision lacking, she dons the glasses again, inspects her lips, and makes a slight adjustment. With a sense of finality, she places the glasses into her handbag and stands up to extinguish the lights. She moves into the living room, finishing her drink with a sense of purpose. The long-focus lens follows her every move. She heads directly to a bottle of liquor, pours herself a final neat slug, and downs it with determination. With a resolute air, she exits the apartment, ensuring to turn off the lights behind her.\n\nMeanwhile, Jeff lowers the long-focus lens and turns his head to the right, drawn by the first notes of a melody played by the songwriter, a tune we have heard him laboring to perfect. Dressed in a formal black tie, the songwriter appears to be preparing his apartment for the arrival of guests. An attractive girl is busily setting out trays laden with canapés, glasses, ice, and liquor, creating an inviting atmosphere. As she crosses the room with a tray of food, she pauses momentarily to listen to the songwriter's melody. She offers a comment on the piece, prompting the songwriter to start from the beginning, playing it with more depth and emotion. Her expression reveals that the music pleases her and stirs her romantically. Jeff's attention shifts in this new direction.\n\nIn another part of the scene, Miss Torso and a male partner, whom we have not previously seen, are engaged in practicing a pas de deux. Their movements are accompanied by a new source of music that competes with the piano's melody. It is orchestral ballet music, modern in style, adding a dynamic layer to the scene. The male dancer is a tall, flowing-haired young man, whose lithe and graceful movements surpass the usual masculine capacity. They pause at one point to listen to a comment from a woman who is observing them. Her gestures make it clear that she is a professional choreographer, offering guidance. The camera then pans away from this scene to capture the street beyond. There, standing on the sidewalk, looking up and down the street, is a figure clad in the same distinctive Kelly Green."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Elegantly attired in a striking and vivid Kelly Green suit, she finds herself comfortably seated at her dressing table. This intimate setting, surrounded by the familiar and cherished objects of her personal space, offers a sense of tranquility and routine. Meanwhile, at some distance away, Jeff observes her with quiet amusement. His gaze shifts downward momentarily, allowing a subtle, almost imperceptible smile to dance across his lips as if entertained by a private thought. He then redirects his focus back to the task at hand, skillfully raising the long-focus camera to his eye with the ease and confidence of one well-practiced. Through the camera's powerful lens, he brings Miss Lonely Hearts into sharp, precise focus, revealing a myriad of intricate details that might have previously escaped unnoticed. Perched precariously on her nose are ill-fitting horn-rimmed reading glasses. These she must adjust by tilting her head slightly backward, enabling her to apply lipstick with careful precision, using the glasses as a visual aid. Once satisfied with the appearance she has meticulously crafted, she removes the glasses and scrutinizes her reflection with a critical eye, squinting in an effort to take in her entire visage. Her hairstyle, somewhat outdated, lends her a middle-aged aura, and although she retains faded good looks and wears fairly nice attire, it is clear that she could benefit significantly from some expert guidance in hairstyling.\n\nReaching towards a tall, invitingly positioned glass of liquor beside her, she takes a long, deliberate sip. After setting the glass gently down, she squints once more, checking to see if her lipstick has been disturbed. Finding her vision lacking, she slips the glasses back on, inspects her lips for any imperfections, and makes a slight but precise adjustment. With a sense of completion, she places the glasses carefully into her handbag and rises to extinguish the lights. She moves with purpose into the living room, finishing her drink with a sense of determination. The long-focus lens diligently tracks her every movement. She proceeds directly to a bottle of liquor, pouring herself one final, neat slug, which she drinks with resolve. With a determined demeanor, she makes her exit from the apartment, ensuring to turn off the lights as she departs.\n\nMeanwhile, back in his vantage point, Jeff lowers the long-focus lens and instinctively turns his head to the right. He is drawn by the first captivating notes of a melody played by the songwriter, a tune we have heard him diligently working to perfect. Clad in a formal black tie, the songwriter appears to be preparing his apartment for the arrival of guests, creating an ambiance of anticipation. An attractive girl is busily engaged in setting out trays piled with canapés, glasses, ice, and liquor, fostering an inviting and festive atmosphere. As she moves gracefully across the room with a tray of food, she pauses momentarily to listen attentively to the songwriter's melody. She offers a remark on the piece, prompting the songwriter to begin anew, playing with greater depth and emotion. Her expression reveals that the music resonates with her and stirs romantic emotions within her. Jeff's attention is now captivated by this unfolding scene.\n\nIn yet another part of this multifaceted scene, Miss Torso and a male partner, whom we have not previously seen, are engaged in practicing a pas de deux. Their graceful movements are accompanied by a new and competing source of music that intertwines with the piano's melody. It is orchestral ballet music, modern in its style, adding a dynamic and vibrant layer to the scene. The male dancer, a tall and flowing-haired young man, moves with a lithe and graceful fluidity that surpasses the usual masculine capacity. They pause at one point, taking a moment to listen to a comment from a woman who is attentively observing their practice. Her gestures make it abundantly clear that she is a professional choreographer, offering her expert guidance. The camera then gently transitions away from this scene, capturing the bustling street beyond. There, standing on the sidewalk, looking both up and down the street, is a figure clad in the same distinctive and memorable Kelly Green."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "She is dressed in a vibrant Kelly Green suit and is seated at her dressing table, where she meticulously prepares herself. Jeff, observing from a distance, glances down and smiles to himself, a subtle expression of amusement or satisfaction. He then turns his attention to the long-focus camera, carefully raising it to his eye to capture a more detailed view. Through the lens, Miss Lonely Hearts comes into focus, her image magnified to reveal intricate details previously unnoticed. Perched on her nose are a pair of ill-fitting horn-rimmed reading glasses, which she adjusts by tilting her head back slightly to apply lipstick with precision. Once satisfied with her appearance, she removes the glasses and scrutinizes her face through squinting eyes, assessing her overall look. Her hairstyle gives her a middle-aged appearance, and though she possesses faded good looks and fairly nice clothes, her hair desperately needs professional advice. Reaching for a tall glass of liquor beside her, she takes a long, deliberate drink, savoring the moment. After setting the glass down, she squints again to check if her lipstick remains intact. Finding it difficult to see clearly, she dons the glasses once more, inspects her lips, and makes a slight adjustment. With a sense of finality, she places the glasses into her handbag, stands up, and moves to extinguish the lights. She strides into the living room, finishing her drink with a sense of purpose. The long-focus lens follows her movements as she heads directly to a bottle of liquor, pours herself a final neat slug, and downs it with determination. She then exits the apartment, exuding a sense of resolve, and turns off the lights behind her. Meanwhile, Jeff lowers the long-focus lens and shifts his gaze to the right, drawn by the first notes of a melody played by the songwriter, a tune he has been working to complete. Dressed in black tie, Jeff appears to be preparing for guests, as indicated by the state of the apartment. An attractive girl is busy setting out trays of canapés, glasses, ice, and liquor, pausing momentarily as she crosses the room with a tray of food. She listens intently to the songwriter's melody, offering a comment that prompts him to start from the beginning and play it more fully. Her expression reveals that the music pleases her and stirs romantic feelings. Jeff's attention shifts in this new direction, where Miss Torso and an unfamiliar male partner are practicing a pas de deux. The music changes, introducing orchestral ballet music in a modern style, which competes with the piano playing. The male dancer, a tall, flowing-haired young man, moves with a grace that surpasses typical masculine agility. They pause to receive feedback from a woman whose gestures indicate she is a professional choreographer. The camera then pans to the street beyond, where a figure clad in Kelly Green stands on the sidewalk, looking up and down the street, seemingly searching or waiting for something."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "She sits at her dressing table in a Kelly Green suit, applying lipstick with the aid of ill-fitting horn-rimmed glasses. After examining her face, she takes a long drink from a tall glass of liquor, checks her lipstick, and touches it up slightly. She then puts her glasses in her handbag, turns out the lights, and moves to the living room, finishing her drink. The long-focus lens follows her as she pours and downs another drink before leaving the apartment with determination, turning off the lights behind her.\n\nMeanwhile, Jeff, in black tie, prepares for guests in his apartment. An attractive girl sets out trays of canapés, glasses, ice, and liquor, pausing to listen and comment on the songwriter's melody, which he plays more fully, pleasing her. Jeff's attention shifts to Miss Torso and her male partner practicing a pas de deux to modern orchestral ballet music, under the guidance of a professional choreographer. The camera then pans to the street, where a figure in Kelly Green stands on the sidewalk, looking up and down the street."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She is wearing a Kelly Green suit, a vibrant color often associated with energy and renewal, and is seated at her dressing table. Jeff, who has a passion for photography and spends hours honing his skills, looks down and smiles to himself. He turns and raises the long-focus camera, typically used for distant subjects because of its narrow field of view, to his eye. The long-focus lens brings Miss Lonely Hearts into an enlarged picture that reveals details we have not previously noticed. A pair of ill-fitting horn-rimmed reading glasses, reminiscent of styles popularized in the mid-20th century for their intellectual appeal, rest halfway down her nose, and she has to tilt her head back slightly as she applies lipstick with their aid. Satisfied, she takes off the glasses and examines her face as a whole through squinting eyes. Her hair-do makes her seem middle-aged. She has faded good looks, fairly nice clothes, but is badly in need of advice on hair dressing. She reaches for a tall glass of liquor, suggestive of an attempt to find solace or comfort, and takes a long drink. Putting the glass down, she squints to see if she has disturbed the lipstick. Unable to see clearly, she puts on the glasses again, looks, and touches up her lips slightly. She puts her glasses in a handbag, then stands to put out the lights. She walks into the living room, finishing the drink. The long-focus lens moves with her. She goes straight for a bottle of liquor, which stands prominently in the room as a silent testimony to her habits, pours out a final neat slug, and tosses it off. Then she leaves the apartment with a show of determination, suggesting a resolution or decision. She turns out the lights behind her, leaving an air of mystery about her destination. Jeff lowers the long-focus lens and turns his head to the right as he hears the first notes of the songwriter's melody, a piece he has been struggling to perfect and which resonates with a sense of longing. He is in black tie, a formal attire indicating an upcoming special occasion, and from the looks of the apartment, he is preparing for guests. An attractive girl is setting out trays of canapés, which are small, prepared snacks often served at parties, glasses, ice, and liquor. She pauses as she crosses the room carrying a tray of food. She listens a moment to the songwriter's melody. She comments on it to the songwriter, whose creative process has been evolving over time, who starts from the beginning again, playing it more fully. Her expression shows that it pleases her and moves her romantically. Jeff's head turns in this new direction. Miss Torso, known for her vivacious personality and dance talent, and a male partner whom we have not seen before are practicing a pas de deux, a dance duet that demands coordination and grace. A new source of music, likely from a recorded orchestral performance, comes in to interfere with the piano playing. It is orchestral ballet music in a modern style. He is a tall, flowing-haired young man, lithe and graceful beyond normal masculine capacity. They stop at one point to listen to a word of comment from a woman who is watching. By her gestures, she is obviously a professional choreographer, someone skilled in composing and directing dance routines. The camera pans from this to the street beyond. Standing there on the sidewalk, looking up and down the street, is a Kelly Green clad figure, whose appearance is striking against the urban landscape."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "She is wearing a Kelly Green suit and is seated at her dressing table. Jeff looks down and smiles to himself. He turns and raises the longfocus camera to his eye. The longfocus lens brings Miss Lonely Hearts into an enlarged picture that reveals details we have not previously noticed. A pair of illfitting hornrimmed reading glasses rest halfway down her nose and she has to tilt her head back slightly as she applies lipstick with their aid. Satisfied she takes off the glasses and examines her face as a whole through squinting eyes. Her hairdo makes her seem middleaged. She has faded good looks fairly nice clothes but is badly in need of advice on hair dressing. She reaches for a tall glass of liquor next to her and takes a long drink. Putting the glass down she squints to see if she has disturbed the lipstick. Unable to see clearly she puts on the glasses again looks and touches up her lips slightly. She puts her glasses in a handbag then stands to put out the lights. She walks into the living room finishing the drink. The longfocus lens moves with her. She goes straight for a bottle of liquor pours out a final neat slug and tosses it off. Then she leaves the apartment with a show of determination. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. She turns out the lights behind her. Jeff lowers the longfocus lens and turns his head to the right as he hears the first notes of the songwriter's melody which we have heard him trying to complete. He is in black tie and from the looks of the apartment he is preparing for guests. An attractive girl is setting out trays of canapés glasses ice and liquor. She pauses as she crosses the room carrying a tray of food. She listens a moment to the songwriter's melody. She comments on it to the songwriter who starts from the beginning again playing it more fully. Her expression shows that it pleases her and moves her romantically. Jeff's head turns in this new direction. Miss Torso and a male partner whom we have not seen before are practicing a pas de deux. A new source of music comes in to interfere with the piano playing. It is orchestral ballet music in a modern style. He is a tall flowinghaired young man lithe and graceful beyond normal masculine capacity. They stop at one point to listen to a word of comment from a woman who is watching. By her gestures she is obviously a professional choreographer. The camera pans from this to the street beyond. Standing there on the sidewalk looking up and down the street is a Kelly Green clad figure."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "She is wearing a Kelly Green suit and is seated at her dressing table. Jeff looks down and smiles to himself. He turns and raises the longfocus camera to his eye. The longfocus lens brings Miss Lonely Hearts into an enlarged picture that reveals details we have not previously noticed. A pair of illfitting hornrimmed reading glasses rest halfway down her nose and she has to tilt her head back slightly as she applies lipstick with their aid. Satisfied she takes off the glasses and examines her face as a whole through squinting eyes. Her hairdo makes her seem middleaged. She has faded good looks fairly nice clothes but is badly in need of advice on hair dressing. She reaches for a tall glass of liquor next to her and takes a long drink. Putting the glass down she squints to see if she has disturbed the lipstick. Unable to see clearly she puts on the glasses again looks and touches up her lips slightly. She puts her glasses in a handbag then stands to put out the lights. She walks into the living room finishing the drink. The longfocus lens moves with her. She goes straight for a bottle of liquor pours out a final neat slug and tosses it off. Then she leaves the apartment with a show of determination. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. She turns out the lights behind her. Jeff lowers the longfocus lens and turns his head to the right as he hears the first notes of the songwriter's melody which we have heard him trying to complete. He is in black tie and from the looks of the apartment he is preparing for guests. An attractive girl is setting out trays of canapés glasses ice and liquor. She pauses as she crosses the room carrying a tray of food. She listens a moment to the songwriter's melody. She comments on it to the songwriter who starts from the beginning again playing it more fully. Her expression shows that it pleases her and moves her romantically. Jeff's head turns in this new direction. Miss Torso and a male partner whom we have not seen before are practicing a pas de deux. A new source of music comes in to interfere with the piano playing. It is orchestral ballet music in a modern style. He is a tall flowinghaired young man lithe and graceful beyond normal masculine capacity. They stop at one point to listen to a word of comment from a woman who is watching. By her gestures she is obviously a professional choreographer. The camera pans from this to the street beyond. Standing there on the sidewalk looking up and down the street is a Kelly Green clad figure."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "She is wearing a Kelly Green suit and is seated at her dressing table. Jeff looks down and smiles to himself. He turns and raises the longfocus camera to his eye. The longfocus lens brings Miss Lonely Hearts into an enlarged picture that reveals details we have not previously noticed. A pair of illfitting hornrimmed reading glasses rest halfway down her nose and she has to tilt her head back slightly as she applies lipstick with their aid. Satisfied she takes off the glasses and examines her face as a whole through squinting eyes. Her hairdo makes her seem middleaged. She has faded good looks fairly nice clothes but is badly in need of advice on hair dressing. Jeff's head turns in this new direction. Miss Torso and a male partner whom we have not seen before are practicing a pas de deux. A new source of music comes in to interfere with the piano playing. It is orchestral ballet music in a modern style. He is a tall flowinghaired young man lithe and graceful beyond normal masculine capacity. They stop at one point to listen to a word of comment from a woman who is watching. By her gestures she is obviously a professional choreographer. The camera pans from this to the street beyond. Standing there on the sidewalk looking up and down the street is a Kelly Green clad figure."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "She is wearing a Kelly Green suit and is seated at her dressing table. Jeff looks down and smiles to himself. He turns and raises the longfocus camera to his eye. They stop at one point to listen to a word of comment from a woman who is watching. By her gestures she is obviously a professional choreographer. The camera pans from this to the street beyond. Standing there on the sidewalk looking up and down the street is a Kelly Green clad figure."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The dolphin is donning a Tartan Red raincoat and is lounging at her picnic blanket. Sam stares up and chuckles to himself. He spins and lifts the infrared telescope to his forehead. The infrared lens transforms Mr. Lonely Boots into a magnified painting that unveils elements we have not previously observed. A pair of oversized aviator sunglasses balance precariously on his chin, and he has to tilt his ear to the side slightly as he brushes his eyebrows with their help. Content, he removes the sunglasses and inspects his expression as a collective through narrowed cheeks. His hat gives him the appearance of being elderly. He possesses faded charm, fairly decent shoes, but is desperately in need of suggestions on shoe polishing. He reaches for a short mug of coffee next to him and takes a brief sip. Placing the mug aside, he narrows his cheeks to check if he has smudged the eyebrows. Unable to perceive clearly, he puts on the sunglasses once more, observes, and modifies his eyebrows slightly. He places his sunglasses in a rucksack, then sits to switch on the lamps. He shuffles into the dining area, sipping the coffee. The infrared lens tracks him. He heads directly for a kettle of tea, boils it for a final strong shot, and drinks it all. Then he enters the garden with a burst of resolve. He switches on the lamps beside him. Sam raises the infrared lens and tilts his chin to the left as he hears the final notes of the architect's poem, which we have heard him attempting to start. He is in white overalls, and from the appearance of the garden, he is waiting for farmers. A graceful boy is laying out bowls of vegetables, mugs, steam, and tea. He halts as he skips across the field carrying a bouquet of herbs. He listens briefly to the architect's poem. He remarks on it to the architect, who begins from the end again, reciting it less completely. His countenance displays that it displeases him and bores him indifferently. Sam’s chin tilts in this unexpected path. Mr. Limbs and a female adversary whom we have not encountered previously are preparing a tango solo. An old type of noise arrives to harmonize with the flute reciting. It is choir jazz clamor in an ancient format. She is a short, curly-eared old woman, clumsy and lumbering beyond standard feminine capacity. They pause at one moment to ignore a note of commentary from a man who is pacing. By his signals, he is clearly an amateur director. The telescope zooms from this to the park beneath. Sitting there on the road, gazing left and right up the avenue, is a Tartan Red cloaked creature."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "She wears a Kelly Green suit at her dressing table. Jeff smiles, using a long-focus camera to capture Miss Lonely Hearts, revealing her middle-aged appearance and faded looks. She applies lipstick with ill-fitting glasses, drinks liquor, and checks her makeup before leaving with determination. Jeff hears a songwriter composing a melody in a black-tie setting, as an attractive girl sets out trays for guests. The girl comments on the melody, showing romantic interest. Meanwhile, Miss Torso practices a pas de deux with a partner. They stop to listen to a professional choreographer's comments. The camera pans to the street, where a Kelly Green figure stands."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Standing there on the sidewalk looking up and down the street is a Kelly Green clad figure The camera pans from this to the street beyond  By her gestures she is obviously a professional choreographer  They stop at one point to listen to a word of comment from a woman who is watching  He is a tall flowinghaired young man lithe and graceful beyond normal masculine capacity  It is orchestral ballet music in a modern style  A new source of music comes in to interfere with the piano playing  Miss Torso and a male partner whom we have not seen before are practicing a pas de deux  Jeff's head turns in this new direction  Her expression shows that it pleases her and moves her romantically  She comments on it to the songwriter who starts from the beginning again playing it more fully  She listens a moment to the songwriter's melody  She pauses as she crosses the room carrying a tray of food  An attractive girl is setting out trays of canapés glasses ice and liquor  He is in black tie and from the looks of the apartment he is preparing for guests  Jeff lowers the longfocus lens and turns his head to the right as he hears the first notes of the songwriter's melody which we have heard him trying to complete  She turns out the lights behind her  Then she leaves the apartment with a show of determination  She goes straight for a bottle of liquor pours out a final neat slug and tosses it off  The longfocus lens moves with her  She walks into the living room finishing the drink  She puts her glasses in a handbag then stands to put out the lights  Unable to see clearly she puts on the glasses again looks and touches up her lips slightly  Putting the glass down she squints to see if she has disturbed the lipstick  She reaches for a tall glass of liquor next to her and takes a long drink  She has faded good looks fairly nice clothes but is badly in need of advice on hair dressing  Her hairdo makes her seem middleaged  Satisfied she takes off the glasses and examines her face as a whole through squinting eyes  A pair of illfitting hornrimmed reading glasses rest halfway down her nose and she has to tilt her head back slightly as she applies lipstick with their aid  The longfocus lens brings Miss Lonely Hearts into an enlarged picture that reveals details we have not previously noticed  He turns and raises the longfocus camera to his eye  Jeff looks down and smiles to himself  She is wearing a Kelly Green suit and is seated at her dressing table "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Jeff looks down and smiles to himself She is wearing a Kelly Green suit and is seated at her dressing table The longfocus lens brings Miss Lonely Hearts into an enlarged picture that reveals details we have not previously noticed He turns and raises the longfocus camera to his eye Satisfied she takes off the glasses and examines her face as a whole through squinting eyes A pair of illfitting hornrimmed reading glasses rest halfway down her nose and she has to tilt her head back slightly as she applies lipstick with their aid She has faded good looks fairly nice clothes but is badly in need of advice on hair dressing Her hairdo makes her seem middleaged Putting the glass down she squints to see if she has disturbed the lipstick She reaches for a tall glass of liquor next to her and takes a long drink She puts her glasses in a handbag then stands to put out the lights Unable to see clearly she puts on the glasses again looks and touches up her lips slightly The longfocus lens moves with her She walks into the living room finishing the drink Then she leaves the apartment with a show of determination She goes straight for a bottle of liquor pours out a final neat slug and tosses it off Jeff lowers the longfocus lens and turns his head to the right as he hears the first notes of the songwriter's melody which we have heard him trying to complete She turns out the lights behind her An attractive girl is setting out trays of canapés glasses ice and liquor He is in black tie and from the looks of the apartment he is preparing for guests She listens a moment to the songwriter's melody She pauses as she crosses the room carrying a tray of food Her expression shows that it pleases her and moves her romantically She comments on it to the songwriter who starts from the beginning again playing it more fully Miss Torso and a male partner whom we have not seen before are practicing a pas de deux Jeff's head turns in this new direction It is orchestral ballet music in a modern style A new source of music comes in to interfere with the piano playing They stop at one point to listen to a word of comment from a woman who is watching He is a tall flowinghaired young man lithe and graceful beyond normal masculine capacity The camera pans from this to the street beyond By her gestures she is obviously a professional choreographer Standing there on the sidewalk looking up and down the street is a Kelly Green clad figure"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Jeff lowers the longfocus lens and turns his head to the right as he hears the first notes of the songwriter's melody which we have heard him trying to complete  He is in black tie and from the looks of the apartment he is preparing for guests  An attractive girl is setting out trays of canapés glasses ice and liquor  She pauses as she crosses the room carrying a tray of food  She listens a moment to the songwriter's melody  She comments on it to the songwriter who starts from the beginning again playing it more fully  Her expression shows that it pleases her and moves her romantically  Jeff's head turns in this new direction  Miss Torso and a male partner whom we have not seen before are practicing a pas de deux  A new source of music comes in to interfere with the piano playing  It is orchestral ballet music in a modern style  He is a tall flowinghaired young man lithe and graceful beyond normal masculine capacity  They stop at one point to listen to a word of comment from a woman who is watching  By her gestures she is obviously a professional choreographer  The camera pans from this to the street beyond  Standing there on the sidewalk looking up and down the street is a Kelly Green clad figure She is wearing a Kelly Green suit and is seated at her dressing table  Jeff looks down and smiles to himself  He turns and raises the longfocus camera to his eye  The longfocus lens brings Miss Lonely Hearts into an enlarged picture that reveals details we have not previously noticed  A pair of illfitting hornrimmed reading glasses rest halfway down her nose and she has to tilt her head back slightly as she applies lipstick with their aid  Satisfied she takes off the glasses and examines her face as a whole through squinting eyes  Her hairdo makes her seem middleaged  She has faded good looks fairly nice clothes but is badly in need of advice on hair dressing  She reaches for a tall glass of liquor next to her and takes a long drink  Putting the glass down she squints to see if she has disturbed the lipstick  Unable to see clearly she puts on the glasses again looks and touches up her lips slightly  She puts her glasses in a handbag then stands to put out the lights  She walks into the living room finishing the drink  The longfocus lens moves with her  She goes straight for a bottle of liquor pours out a final neat slug and tosses it off  Then she leaves the apartment with a show of determination  She turns out the lights behind her "
        }
      ]
    }
  ]
}