{
  "ground_truth": "The brick is weather-worn and faded. Each apartment has three windows facing the back, one showing a hallway, one a living room, and the window on the right opening into a bedroom. He sets down the case heavily, removes his hat, and slowly wipes his brow with the back of his right hand. He takes off his coat and tie. With his eyes still focused on the distant apartments, Jeff continues talking with Gunnison. His shirt is stained with sweat underneath. He rolls up his sleeves, and his well-muscled arms heavy with hair confirm his dark, husky build. The man enters the bedroom. The woman sits up as the man enters. She takes a wet cloth off her forehead. Before the man even reaches her, she begins talking, somewhat vigorously. We can see a woman lying on the far bed. Near her, a small table is covered with medicine bottles, spoons, boxes of pills, a water pitcher, and the other impedimenta of the chronically ill. The man stops short of the bed, makes gestures of trying to placate her, but she goes on scolding. He hangs up and resumes his attention on the apartment of the salesman. The salesman looks toward the bedroom door, hesitates, then reluctantly walks toward it. He shouts back at her, turns and goes out of the room. His attitude changes to weary patience, then irritation, then anger. For a moment he is hidden by the wall. Jeff shifts his look more to the right. Jeff's attention is suddenly diverted to himself. His leg, under the cast, begins itching. He squirms, tries to move the leg a little. He scratches the outside of the cast, but the itch gets worse. It gives no relief. He reaches for a long, Chinese back scratcher lying on the windowsill. Carefully, and with considerable ingenuity, he works it under the cast. He scratches, and a look of sublime relief comes over his face. Satisfied, he takes the scratcher out. As he replaces it on the windowsill, his attention is drawn back to the scene outside the window. We see the man who left his apartment in anger come out of the doorway into the backyard. He is easy to identify through the color of his garish necktie. In one hand the man carries a small garden hoe and rake, and in the other a pair of trimming shears. He goes to a small patch of flowers, perhaps three feet square. They are beautiful, multi-colored three foot high zinnias. Jeff's attention is turned to something else of interest. Into the next door yard we see emerging from the apartment below the ballet dancer, the elderly lady. Her skin is dead white, and her body is thin to the point of emaciation.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The block is time-worn and bleached. Each flat has three panes gazing the rear, one displaying a corridor, one a lounge, and the pane on the right opening into a chamber. He places down the luggage heavily, removes his cap, and slowly wipes his brow with the rear of his right hand. He takes off his jacket and cravat. With his eyes still focused on the remote flats, Jeff continues speaking with Gunnison. His shirt is marked with perspiration beneath. He rolls up his sleeves, and his well-muscled limbs heavy with hair confirm his dark, burly build. The man enters the chamber. The woman sits up as the man enters. She takes a damp cloth off her forehead. Before the man even reaches her, she begins speaking, somewhat energetically. We can see a woman lying on the distant bed. Near her, a small stand is covered with medication bottles, spoons, cartons of tablets, a water jug, and the other impedimenta of the chronically ill. The man halts short of the bed, makes motions of trying to appease her, but she goes on admonishing. He hangs up and resumes his focus on the flat of the salesman. The salesman gazes toward the chamber door, hesitates, then reluctantly strides toward it. He shouts back at her, turns and exits the room. His demeanor changes to weary patience, then irritation, then anger. For a moment he is concealed by the wall. Jeff shifts his gaze more to the right. Jeff's focus is suddenly diverted to himself. His limb, under the cast, begins itching. He squirms, tries to move the limb a little. He scratches the exterior of the cast, but the itch worsens. It gives no relief. He reaches for a long, Chinese back scratcher lying on the sill. Carefully, and with considerable creativity, he maneuvers it under the cast. He scratches, and a look of sublime relief comes over his visage. Satisfied, he extracts the scratcher. As he replaces it on the sill, his focus is drawn back to the scene outside the pane. We see the man who left his flat in anger emerge from the doorway into the backyard. He is easy to recognize through the hue of his flamboyant necktie. In one hand the man carries a small garden hoe and rake, and in the other a pair of pruning scissors. He goes to a small patch of blossoms, perhaps three feet square. They are beautiful, multi-colored three foot high zinnias. Jeff's focus is turned to something else of interest. Into the next door yard we see emerging from the flat below the ballet dancer, the elderly lady. Her complexion is dead white, and her physique is thin to the point of emaciation."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The brick has been weather-worn and faded. Three windows are had by each apartment facing the back, with one showing a hallway, another a living room, and the window on the right opened into a bedroom. The case is set down heavily by him, his hat is removed, and his brow is slowly wiped with the back of his right hand. His coat and tie are taken off by him. With his eyes still focused on the distant apartments, Gunnison is continued to be talked to by Jeff. Sweat stains his shirt underneath. His sleeves are rolled up, and his well-muscled, hair-heavy arms confirm his dark, husky build. The bedroom is entered by the man. The woman sits up as he enters. A wet cloth is taken off her forehead by her. Before she is even reached by the man, somewhat vigorous talking is begun by her. A woman is seen lying on the far bed. Near her, a small table covers itself with medicine bottles, spoons, boxes of pills, a water pitcher, and other impedimenta of the chronically ill. The man stops short of the bed, gestures are made by him to try placating her, but she continues scolding. He hangs up and resumes focusing on the apartment of the salesman. Toward the bedroom door, the salesman looks, hesitates, then he reluctantly walks toward it. Back at her, he shouts, turns, and goes out of the room. His attitude changes to weary patience, then irritation, then anger. For a moment the wall hides him. Jeff shifts his look more to the right. Jeff is suddenly diverted in attention to himself. His leg, under the cast, is itched by him. He squirms and a little movement is tried on the leg. The outside of the cast is scratched by him, but the itch worsens. It gives him no relief. He reaches for a long, Chinese back scratcher lying on the windowsill. Carefully, and with considerable ingenuity, it is worked under the cast by him. He scratches it, and a look of sublime relief covers his face. Satisfied, the scratcher is taken out by him. As it is replaced on the windowsill, his attention draws back to the scene outside the window. The man who left his apartment in anger is seen coming out of the doorway into the backyard. He is easily identified through the color of his garish necktie. In one hand, a small garden hoe and rake are carried by the man, and in the other, a pair of trimming shears. He goes to a small patch of flowers, perhaps three feet square. Beautiful, multi-colored, three-foot-high zinnias are there. Jeff is turned to something else of interest. Into the next-door yard, emerging from the apartment below, the ballet dancer, an elderly lady, is seen. Her skin has been dead white, and her body has been thin to the point of emaciation."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The brick is faded and weather-worn. Each apartment has three windows at the back: one shows a hallway, another a living room, and the third opens into a bedroom. He sets down the case, removes his hat, and wipes his brow with his hand. He takes off his coat and tie. Still focused on the apartments, Jeff talks with Gunnison. His shirt is sweat-stained, and his muscular, hairy arms verify his dark, husky build. The man enters the bedroom, and the woman sits up and begins speaking vigorously. A woman lies on a distant bed near a table with medicine bottles, pills, and a water pitcher, indicating chronic illness. The man gestures to placate her, but she scolds him. Changing his focus, Jeff notices his leg itching under the cast. He squirms and scratches outside, but it worsens. Using a Chinese back scratcher, he relieves the itch, feeling sublime relief. As he returns the scratcher to the windowsill, his focus returns outside. The angry man emerges into the yard, identified by his garish necktie, carrying a garden hoe, rake, and shears. He tends to a small patch of three-foot-tall zinnias. Jeff's attention shifts as a ballet dancer, the elderly lady with emaciated, white skin, emerges from the apartment below."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The brick is worn and faded. Each apartment has three rear windows: one shows a hallway, another a living room, and the right one a bedroom. He sets down the case, removes his hat, wipes his brow, and takes off his coat and tie. Focused on the distant apartments, Jeff talks with Gunnison. His shirt is sweat-stained. He rolls up his sleeves, revealing muscled, hairy arms confirming his dark, husky build. The man enters the bedroom where a woman sits up, removes a wet cloth from her forehead, and talks vigorously. A woman lies on a bed, surrounded by medicine bottles and other items of chronic illness. The man stops before the bed, gestures placation, while she scolds. He resumes attention on the salesman, who hesitates before entering the bedroom, shouts back, turns, and leaves. His attitude shifts from weary patience to irritation and anger. Jeff's leg, under the cast, itches. He squirms, scratches the cast's outside, worsening the itch. He uses a Chinese back scratcher, working it under the cast, achieving relief. Replacing the scratcher, his attention returns outside. The man identified by his garish necktie exits angrily, carrying a garden hoe, rake, and trimming shears. He tends to zinnias in a small flower patch. Jeff's attention shifts to something new: the elderly ballet dancer emerging from the apartment below, her skin dead white, body emaciated."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The brick façade of the building is visibly weather-worn and faded, its condition telling stories of weather's relentless passage over time. Each apartment unit is designed with three windows that face toward the back of the building. Out of these, one window reveals the inside of a hallway, another offers a view into a living room area, and the window on the far right opens into the confines of a bedroom. With a heavy thud, he sets down the case, removes his hat, and proceeds to slowly wipe his brow using the back of his right hand. He then takes off his coat and loosens the tie from around his neck. Despite his actions, his eyes remain steadfastly focused on the distant apartments before him, as Jeff continues his conversation with Gunnison. His shirt is notably stained with sweat underneath, visible evidence of the day's exertions. He proceeds to roll up his sleeves, revealing well-muscled arms that are heavily covered with hair, further confirming his dark, husky build. The man makes his way into the bedroom, where a woman immediately sits up upon his entering. She removes a damp cloth from her forehead. Before the man can even reach her, she begins talking to him, somewhat vigorously and with evident emotion. From our viewpoint, we can see yet another woman lying on the far bed. Nearby her, a small table is cluttered with medicine bottles, spoons, boxes of pills, a water pitcher, and an assortment of other items associated with chronic illness. The man halts at a distance from the bed, attempting gestures of placation, but she continues her scolding relentlessly. Interrupting his own activities, he hangs up and turns his attention once more to the apartment of the ever-busy salesman. The salesman, attending to his own affairs, casts a glance toward the bedroom door, hesitates briefly, and then reluctantly makes his way towards it. He shouts back at her, then turns and leaves the room. His demeanor shifts progressively from weary patience, to irritation, and then to outright anger. Momentarily, his figure is obscured by the wall. Jeff, observing all, shifts his focus more toward the right. His attention is abruptly diverted to himself as he becomes acutely aware of an itch beneath the cast on his leg. He begins to squirm, trying to move his leg just a little to find relief. He scratches the surface of the cast, but the itch only intensifies, offering no solace. He reaches for a long, Chinese back scratcher that rests conveniently on the windowsill. With careful precision and considerable ingenuity, he maneuvers it underneath the cast. As he scratches, a look of sublime relief washes over his face. Feeling satisfied, he extracts the scratcher and places it back on the windowsill. His attention is then drawn back to the unfolding scene outside the window. We see the man, who had left his apartment in a state of anger, emerging through the doorway into the backyard area. He is easily identifiable by the color of his garish necktie. In one hand, the man carries a small garden hoe and a rake, while in the other hand he holds a pair of trimming shears. He proceeds to a small patch of flowers, a modest but vibrant three-foot square of beauty. These flowers are striking, multi-colored zinnias that stand about three feet high. Jeff's attention is then captured by something else of interest. In the neighboring yard, we observe emerging from the apartment below a figure known as the ballet dancer, the elderly lady. Her skin is an ashen white, and her body is so thin as to be almost emaciated."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The brick façade of the building stands as a testament to time, its surface visibly weather-worn and faded, bearing the marks and stories of weather’s relentless passage over the years. Each individual apartment unit within the building is thoughtfully designed, featuring three windows, all of which face towards the back. Among these windows, one offers a view into the inside of a hallway, another provides a glimpse into a living room area, and the window on the far right opens into the private confines of a bedroom. With a heavy thud that reverberates slightly, he carefully sets down the case, removes his hat, and proceeds to slowly wipe his brow with the back of his right hand. He then sheds his coat and loosens the tie that is snug around his neck. Even as he performs these actions, his eyes remain steadfastly focused on the distant apartments before him, as he continues his conversation with Gunnison. His shirt is notably stained with sweat underneath, visible evidence of the exertions he has undergone throughout the day. He rolls up his sleeves, revealing well-muscled arms that are heavily covered with hair, unmistakably confirming his dark, husky build. The man makes his way into the bedroom, where a woman immediately sits up upon his entrance. She removes a damp cloth from her forehead. Before he reaches her side, she begins speaking to him, her words vigorous and imbued with evident emotion. From our viewpoint, we can discern yet another woman, who is lying on the far bed. Nearby her, a small table is cluttered with a variety of items associated with chronic illness, including medicine bottles, spoons, boxes of pills, a water pitcher, and other assorted objects. The man halts at a distance from the bed, attempting gestures of placation, but the woman continues her relentless scolding. Interrupting his own activities, he hangs up and turns his attention once more to the apartment of the ever-busy salesman. The salesman, engaged in attending to his own affairs, casts a glance toward the bedroom door, hesitates briefly, and then reluctantly makes his way towards it. He shouts back at her, then turns and leaves the room. His demeanor shifts noticeably, progressing from weary patience to irritation, and then escalating to outright anger. For a moment, his figure is obscured by the wall. Jeff, observing the entire scene, shifts his focus more toward the right. His attention is abruptly diverted to himself as he becomes acutely aware of an irritating itch beneath the cast on his leg. He begins to squirm, trying to move his leg just a little to find some relief. He scratches the surface of the cast, but the itch only intensifies, offering no solace at all. He reaches for a long, Chinese back scratcher that rests conveniently on the windowsill. With careful precision and considerable ingenuity, he skillfully maneuvers it underneath the cast. As he scratches, a look of sublime relief washes over his face, bringing much-needed comfort. Feeling satisfied, he extracts the scratcher and places it back on the windowsill. His attention is then drawn back to the unfolding scene outside the window. We see the man, having left his apartment in a state of anger, emerge through the doorway into the backyard area. He is easily identifiable by the distinct color of his garish necktie. In one hand, the man carries a small garden hoe and a rake, while in the other hand he holds a pair of trimming shears. He proceeds to a small patch of flowers, a modest but vibrant three-foot square of natural beauty. These flowers are striking, multi-colored zinnias that stand about three feet high, their colors creating a lively display. Jeff's attention is then captured by something else of interest. In the neighboring yard, we observe a figure emerging from the apartment below—a figure known as the ballet dancer, the elderly lady. Her skin is pale, an ashen white, and her body appears so thin as to be almost emaciated."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The weather-worn and faded brick stands as a silent testament to time, its surface marked by years of exposure. Each apartment presents three windows that face the back: one reveals a hallway, the second offers a view into a living room, and the final window on the right opens into a bedroom. Setting the case down with a heavy thud, he removes his hat deliberately and uses the back of his right hand to slowly wipe the sweat from his brow. In a gradual manner, he removes his coat and loosens his tie, all while maintaining his focus on the distant apartments and continuing his conversation with Gunnison. Sweat stains become visible on his shirt, prompting him to roll up his sleeves and reveal his well-muscled, heavily haired arms, affirming his dark, robust build. Meanwhile, in the bedroom, a man enters as a woman sits up, taking a damp cloth off her forehead. As he draws closer, she begins speaking with a certain vigor before he even reaches her. Observers can see another woman lying on a distant bed, surrounded by a small table cluttered with medicine bottles, spoons, boxes of pills, a water pitcher, and other items that suggest chronic illness. The man halts before reaching the bed and offers placating gestures, yet she continues her scolding unabated. He eventually hangs up and refocuses his attention on the apartment of a salesman. The salesman, after a moment of hesitation, reluctantly makes his way toward the bedroom door, shouting back at the woman as he turns and leaves the room. His demeanor transitions from weary patience to irritation and then to anger, momentarily concealing him from view behind a wall. Jeff shifts his gaze to the right, but his attention quickly returns to himself when his leg, encased in a cast, begins to itch. He squirms, slightly moving the leg, scratches the outside of the cast, but this only exacerbates the itch without bringing relief. Reaching for a long Chinese back scratcher on the windowsill, he carefully and ingeniously maneuvers it beneath the cast, scratching with precision until a look of sublime relief washes over his face. Satisfied, he withdraws the scratcher and places it back on the windowsill. His attention is once again drawn to the scene outside the window, where he observes the man who had left his apartment in anger emerge into the backyard, identifiable by his garish necktie. In one hand, the man carries a small garden hoe and rake, and in the other, a pair of trimming shears. He approaches a small patch of flowers, about three feet square, which are beautiful, multi-colored zinnias standing three feet tall. Jeff's interest shifts to another captivating sight as, from the apartment below, the ballet dancer and an elderly lady emerge into the adjacent yard. The elderly lady's skin is ghostly white, and her body is alarmingly thin, bordering on emaciation."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The weather-worn brick facade reveals three windows per apartment, each leading to a hallway, living room, and bedroom. Jeff, after setting down his case heavily, removes his hat, wipes his brow, and removes his coat and tie, all while engaging in conversation with Gunnison. His sweat-stained shirt and rolled-up sleeves reveal his muscled, hairy arms. As the man enters the bedroom, the woman on the bed removes a wet cloth from her forehead and begins speaking energetically. Her bedside is cluttered with various medicine-related items, indicating chronic illness. The man gestures to calm her, but she continues scolding, prompting him to exit with increasing impatience and anger. Meanwhile, Jeff shifts focus, addressing an itch beneath his cast with a Chinese back scratcher, which provides him relief. Refocusing on the window, he observes the man, identifiable by his garish necktie, exiting the apartment with gardening tools and tending to a small patch of vibrant zinnias. Jeff's attention then shifts to a new scene: an emaciated ballet dancer with dead white skin emerging into the yard from the apartment below."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The brick, made of traditional red clay and dating back to the early 20th century, is weather-worn and faded by years of exposure to harsh weather conditions. Each apartment has three windows facing the back, one showing a hallway, one a living room often filled with vintage furniture, and the window on the right opening into a bedroom. He sets down the case heavily, a worn leather briefcase with a broken clasp, removes his hat, a classic fedora popular in mid-century America, and slowly wipes his brow with the back of his right hand. He takes off his coat and tie, part of a formal suit that's typical for businessmen of the era. With his eyes still focused on the distant apartments, Jeff, an experienced private investigator familiar with urban environments, continues talking with Gunnison, an old colleague from his days on the police force. His shirt is stained with sweat underneath, evidence of the sweltering summer heat. He rolls up his sleeves, and his well-muscled arms heavy with hair confirm his dark, husky build, suggesting a life of physical labor or athletic endeavors. \n\nThe man enters the bedroom, a standard mid-century decor characterized by simple yet functional furniture. The woman sits up as the man enters, her expression weary from ongoing illness. She takes a wet cloth off her forehead, a common home remedy for fever. Before the man even reaches her, she begins talking, somewhat vigorously, her voice revealing frustration heightened by her condition. We can see a woman lying on the far bed. Near her, a small table is covered with medicine bottles, spoons, boxes of pills, a water pitcher, and the other impedimenta of the chronically ill, indicating a prolonged struggle with health issues. The man stops short of the bed, makes gestures of trying to placate her, but she goes on scolding, her persistence underscoring her unyielding spirit despite her ailment. \n\nHe hangs up and resumes his attention on the apartment of the salesman, a traveling salesman whose numerous household goods suggest a life spent on the road. The salesman looks toward the bedroom door, hesitates, then reluctantly walks toward it. He shouts back at her, turns and goes out of the room, his voice echoing with underlying fatigue from handling tense situations. His attitude changes to weary patience, then irritation, then anger, a testament to the strain on their relationship. For a moment he is hidden by the wall, the barrier symbolically separating their lives. Jeff, a man of keen observation honed through years of practice, shifts his look more to the right. \n\nJeff's attention is suddenly diverted to himself. His leg, under the cast, begins itching, the uncomfortable result of being immobilized for weeks. He squirms, tries to move the leg a little, searching for relief. He scratches the outside of the cast, but the itch gets worse, a common frustration for those recovering from bone injuries. It gives no relief. He reaches for a long, Chinese back scratcher lying on the windowsill, an unexpected token from his travels around the world. Carefully, and with considerable ingenuity, he works it under the cast. He scratches, and a look of sublime relief comes over his face, momentarily disconnecting him from his vigilant watch. Satisfied, he takes the scratcher out. As he replaces it on the windowsill, his attention is drawn back to the scene outside the window.\n\nWe see the man who left his apartment in anger come out of the doorway into the backyard, a shared urban space offering little privacy. He is easy to identify through the color of his garish necktie, a bold choice reflecting his flamboyant personality. In one hand the man carries a small garden hoe and rake, and in the other a pair of trimming shears, tools for tending to the modest garden. He goes to a small patch of flowers, perhaps three feet square, carefully maintained despite the limited space. They are beautiful, multi-colored three-foot-high zinnias, known for their vibrant hues and resilience. Jeff's attention is turned to something else of interest. Into the next door yard we see emerging from the apartment below the ballet dancer, the elderly lady, once renowned in her youth for grace and elegance. Her skin is dead white, and her body is thin to the point of emaciation, a sharp contrast to her vibrant past."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The brick is weatherworn and faded. Each apartment has three windows facing the back one showing a hallway one a living room and the window on the right opening into a bedroom. He sets down the case heavily removes his hat and slowly wipes his brow with the back of his right hand. He takes off his coat and tie. With his eyes still focused on the distant apartments Jeff continues talking with Gunnison. His shirt is stained with sweat underneath. He rolls up his sleeves and his wellmuscled arms heavy with hair confirm his dark husky build. The man enters the bedroom. The woman sits up as the man enters. She takes a wet cloth off her forehead. Before the man even reaches her she begins talking somewhat vigorously. We can see a woman lying on the far bed. Near her a small table is covered with medicine bottles spoons boxes of pills a water pitcher and the other impedimenta of the chronically ill. The man stops short of the bed makes gestures of trying to placate her but she goes on scolding. He hangs up and resumes his attention on the apartment of the salesman. The salesman looks toward the bedroom door hesitates then reluctantly walks toward it. He shouts back at her turns and goes out of the room. His attitude changes to weary patience then irritation then anger. For a moment he is hidden by the wall. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Jeff shifts his look more to the right. Jeff's attention is suddenly diverted to himself. His leg under the cast begins itching. He squirms tries to move the leg a little. He scratches the outside of the cast but the itch gets worse. It gives no relief. He reaches for a long Chinese back scratcher lying on the windowsill. Carefully and with considerable ingenuity he works it under the cast. He scratches and a look of sublime relief comes over his face. Satisfied he takes the scratcher out. As he replaces it on the windowsill his attention is drawn back to the scene outside the window. We see the man who left his apartment in anger come out of the doorway into the backyard. He is easy to identify through the color of his garish necktie. In one hand the man carries a small garden hoe and rake and in the other a pair of trimming shears. He goes to a small patch of flowers perhaps three feet square. They are beautiful multicolored three foot high zinnias. Jeff's attention is turned to something else of interest. Into the next door yard we see emerging from the apartment below the ballet dancer the elderly lady. Her skin is dead white and her body is thin to the point of emaciation."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The brick is weatherworn and faded. Each apartment has three windows facing the back one showing a hallway one a living room and the window on the right opening into a bedroom. He sets down the case heavily removes his hat and slowly wipes his brow with the back of his right hand. He takes off his coat and tie. With his eyes still focused on the distant apartments Jeff continues talking with Gunnison. His shirt is stained with sweat underneath. He rolls up his sleeves and his wellmuscled arms heavy with hair confirm his dark husky build. The man enters the bedroom. The woman sits up as the man enters. She takes a wet cloth off her forehead. Before the man even reaches her she begins talking somewhat vigorously. We can see a woman lying on the far bed. Near her a small table is covered with medicine bottles spoons boxes of pills a water pitcher and the other impedimenta of the chronically ill. The man stops short of the bed makes gestures of trying to placate her but she goes on scolding. He hangs up and resumes his attention on the apartment of the salesman. The salesman looks toward the bedroom door hesitates then reluctantly walks toward it. He shouts back at her turns and goes out of the room. His attitude changes to weary patience then irritation then anger. For a moment he is hidden by the wall. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. Jeff shifts his look more to the right. Jeff's attention is suddenly diverted to himself. His leg under the cast begins itching. He squirms tries to move the leg a little. He scratches the outside of the cast but the itch gets worse. It gives no relief. He reaches for a long Chinese back scratcher lying on the windowsill. Carefully and with considerable ingenuity he works it under the cast. He scratches and a look of sublime relief comes over his face. Satisfied he takes the scratcher out. As he replaces it on the windowsill his attention is drawn back to the scene outside the window. We see the man who left his apartment in anger come out of the doorway into the backyard. He is easy to identify through the color of his garish necktie. In one hand the man carries a small garden hoe and rake and in the other a pair of trimming shears. He goes to a small patch of flowers perhaps three feet square. They are beautiful multicolored three foot high zinnias. Jeff's attention is turned to something else of interest. Into the next door yard we see emerging from the apartment below the ballet dancer the elderly lady. Her skin is dead white and her body is thin to the point of emaciation."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The brick is weatherworn and faded. Each apartment has three windows facing the back one showing a hallway one a living room and the window on the right opening into a bedroom. He sets down the case heavily removes his hat and slowly wipes his brow with the back of his right hand. He takes off his coat and tie. With his eyes still focused on the distant apartments Jeff continues talking with Gunnison. His shirt is stained with sweat underneath. He rolls up his sleeves and his wellmuscled arms heavy with hair confirm his dark husky build. The man enters the bedroom. The woman sits up as the man enters. She takes a wet cloth off her forehead. As he replaces it on the windowsill his attention is drawn back to the scene outside the window. We see the man who left his apartment in anger come out of the doorway into the backyard. He is easy to identify through the color of his garish necktie. In one hand the man carries a small garden hoe and rake and in the other a pair of trimming shears. He goes to a small patch of flowers perhaps three feet square. They are beautiful multicolored three foot high zinnias. Jeff's attention is turned to something else of interest. Into the next door yard we see emerging from the apartment below the ballet dancer the elderly lady. Her skin is dead white and her body is thin to the point of emaciation."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The brick is weatherworn and faded. Each apartment has three windows facing the back one showing a hallway one a living room and the window on the right opening into a bedroom. He sets down the case heavily removes his hat and slowly wipes his brow with the back of his right hand. He takes off his coat and tie. They are beautiful multicolored three foot high zinnias. Jeff's attention is turned to something else of interest. Into the next door yard we see emerging from the apartment below the ballet dancer the elderly lady. Her skin is dead white and her body is thin to the point of emaciation."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The curtain is sun-bleached and tattered. Each cabin has three openings facing the forest, one showing a corridor, one a lounge, and the opening on the left leading into a study. She sets down the bucket delicately, removes her scarf, and slowly polishes her cheek with the back of her left hand. She takes off her sweater and scarf. With her eyes still focused on the distant cabins, Karen continues knitting with Carl. Her blouse is decorated with flour on top. She rolls down her leggings, and her well-toned legs heavy with freckles confirm her light, nimble build. The child runs into the study. The dog lies down as the child runs. It takes a soft toy off its paw. Before the child even reaches it, the dog begins barking, somewhat playfully. We can see a dog resting on the far rug. Near it, a large crate is filled with dog treats, leashes, bags of toys, a food bowl, and other paraphernalia of the spoil-t. The child pauses at the rug, makes sounds of trying to pet it, but it goes on growling. She calls out and resumes her focus on the hut of the baker. The baker peeks toward the study entrance, ponders, then reluctantly ambles toward it. He whispers back at her, turns and exits from the cabin. His mood shifts to warm acceptance, then puzzlement, then amusement. For a moment he is hidden by the beam. Karen tilts her gaze more to the left. Karen's gaze is suddenly attracted to the garden. Her hand, under the glove, begins tingling. She adjusts, tries to move the hand a little. She taps the outside of the glove, but the tingle intensifies. It offers no comfort. She reaches for a short, Italian back scratcher sitting on the bookshelf. Gently, and with moderate skill, she slides it into the glove. She taps, and a look of serene contentment comes over her face. Content, she withdraws the scratcher. As she places it on the bookshelf, her focus is drawn back to the sight outside the curtain. We see the child who left her cabin in amusement appear from the gate into the clearing. She is easy to spot through the pattern of her vibrant jacket. In one paw the child carries a small painting set and brush, and in the other a pair of crafting scissors. She goes to a large patch of mushrooms, perhaps six feet wide. They are vibrant, multi-colored six foot tall toadstools. Karen's gaze is captured by something else intriguing. Into the adjacent clearing we see appearing from the cabin above the gymnast, the aged cat. Its fur is ghostly gray, and its frame is sleek to the point of elegance."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The faded brick apartments have three windows each: hallway, living room, and bedroom. Jeff, a muscular man, removes his coat and tie, sweating heavily. Engaged in conversation with Gunnison, he observes a scene in a nearby apartment where a man enters a bedroom to find a sick woman surrounded by medicine. The man tries to calm her as she scolds him. Returning his focus to his own discomfort, Jeff uses a back scratcher to relieve an itch under his cast. Satisfied, he returns his gaze outside, watching the man exit angrily into the backyard, identifiable by his bright necktie. With tools in hand, the man tends to vibrant zinnias. Jeff's interest shifts again as an emaciated elderly lady from a neighboring apartment emerges."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Her skin is dead white and her body is thin to the point of emaciation Into the next door yard we see emerging from the apartment below the ballet dancer the elderly lady Jeff's attention is turned to something else of interest They are beautiful multicolored three foot high zinnias He goes to a small patch of flowers perhaps three feet square In one hand the man carries a small garden hoe and rake and in the other a pair of trimming shears He is easy to identify through the color of his garish necktie We see the man who left his apartment in anger come out of the doorway into the backyard As he replaces it on the windowsill his attention is drawn back to the scene outside the window Satisfied he takes the scratcher out He scratches and a look of sublime relief comes over his face Carefully and with considerable ingenuity he works it under the cast He reaches for a long Chinese back scratcher lying on the windowsill It gives no relief He scratches the outside of the cast but the itch gets worse He squirms tries to move the leg a little His leg under the cast begins itching Jeff's attention is suddenly diverted to himself Jeff shifts his look more to the right For a moment he is hidden by the wall His attitude changes to weary patience then irritation then anger He shouts back at her turns and goes out of the room The salesman looks toward the bedroom door hesitates then reluctantly walks toward it He hangs up and resumes his attention on the apartment of the salesman The man stops short of the bed makes gestures of trying to placate her but she goes on scolding Near her a small table is covered with medicine bottles spoons boxes of pills a water pitcher and the other impedimenta of the chronically ill We can see a woman lying on the far bed Before the man even reaches her she begins talking somewhat vigorously She takes a wet cloth off her forehead The woman sits up as the man enters The man enters the bedroom He rolls up his sleeves and his wellmuscled arms heavy with hair confirm his dark husky build His shirt is stained with sweat underneath With his eyes still focused on the distant apartments Jeff continues talking with Gunnison He takes off his coat and tie He sets down the case heavily removes his hat and slowly wipes his brow with the back of his right hand Each apartment has three windows facing the back one showing a hallway one a living room and the window on the right opening into a bedroom The brick is weatherworn and faded"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Each apartment has three windows facing the back one showing a hallway one a living room and the window on the right opening into a bedroom The brick is weatherworn and faded He takes off his coat and tie He sets down the case heavily removes his hat and slowly wipes his brow with the back of his right hand His shirt is stained with sweat underneath With his eyes still focused on the distant apartments Jeff continues talking with Gunnison The man enters the bedroom He rolls up his sleeves and his wellmuscled arms heavy with hair confirm his dark husky build She takes a wet cloth off her forehead The woman sits up as the man enters We can see a woman lying on the far bed Before the man even reaches her she begins talking somewhat vigorously The man stops short of the bed makes gestures of trying to placate her but she goes on scolding Near her a small table is covered with medicine bottles spoons boxes of pills a water pitcher and the other impedimenta of the chronically ill The salesman looks toward the bedroom door hesitates then reluctantly walks toward it He hangs up and resumes his attention on the apartment of the salesman His attitude changes to weary patience then irritation then anger He shouts back at her turns and goes out of the room Jeff shifts his look more to the right For a moment he is hidden by the wall His leg under the cast begins itching Jeff's attention is suddenly diverted to himself He scratches the outside of the cast but the itch gets worse He squirms tries to move the leg a little He reaches for a long Chinese back scratcher lying on the windowsill It gives no relief He scratches and a look of sublime relief comes over his face Carefully and with considerable ingenuity he works it under the cast As he replaces it on the windowsill his attention is drawn back to the scene outside the window Satisfied he takes the scratcher out He is easy to identify through the color of his garish necktie We see the man who left his apartment in anger come out of the doorway into the backyard He goes to a small patch of flowers perhaps three feet square In one hand the man carries a small garden hoe and rake and in the other a pair of trimming shears Jeff's attention is turned to something else of interest They are beautiful multicolored three foot high zinnias Her skin is dead white and her body is thin to the point of emaciation Into the next door yard we see emerging from the apartment below the ballet dancer the elderly lady"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Jeff shifts his look more to the right Jeff's attention is suddenly diverted to himself His leg under the cast begins itching He squirms tries to move the leg a little He scratches the outside of the cast but the itch gets worse It gives no relief He reaches for a long Chinese back scratcher lying on the windowsill Carefully and with considerable ingenuity he works it under the cast He scratches and a look of sublime relief comes over his face Satisfied he takes the scratcher out As he replaces it on the windowsill his attention is drawn back to the scene outside the window We see the man who left his apartment in anger come out of the doorway into the backyard He is easy to identify through the color of his garish necktie In one hand the man carries a small garden hoe and rake and in the other a pair of trimming shears He goes to a small patch of flowers perhaps three feet square They are beautiful multicolored three foot high zinnias Jeff's attention is turned to something else of interest Into the next door yard we see emerging from the apartment below the ballet dancer the elderly lady Her skin is dead white and her body is thin to the point of emaciation The brick is weatherworn and faded Each apartment has three windows facing the back one showing a hallway one a living room and the window on the right opening into a bedroom He sets down the case heavily removes his hat and slowly wipes his brow with the back of his right hand He takes off his coat and tie With his eyes still focused on the distant apartments Jeff continues talking with Gunnison His shirt is stained with sweat underneath He rolls up his sleeves and his wellmuscled arms heavy with hair confirm his dark husky build The man enters the bedroom The woman sits up as the man enters She takes a wet cloth off her forehead Before the man even reaches her she begins talking somewhat vigorously We can see a woman lying on the far bed Near her a small table is covered with medicine bottles spoons boxes of pills a water pitcher and the other impedimenta of the chronically ill The man stops short of the bed makes gestures of trying to placate her but she goes on scolding He hangs up and resumes his attention on the apartment of the salesman The salesman looks toward the bedroom door hesitates then reluctantly walks toward it He shouts back at her turns and goes out of the room His attitude changes to weary patience then irritation then anger For a moment he is hidden by the wall"
        }
      ]
    }
  ]
}