{
  "ground_truth": "She gets up from Jeff's lap and puts the overnight case on the table, then goes to the window and looks toward the song-writer's apartment, where the party has grown considerably larger, with an assortment of well-dressed people crowded into the studio, drinking and eating. Lisa stands listening, entranced, while Jeff watches her. She sits down on the edge of the divan near Jeff and leans toward him. Jeff's tension eases off a little, but he is eager to talk. Doyle looks back toward Thorwald's bedroom, and we see the dark apartment beyond him. He turns his head suddenly at the sound of Lisa coming out of the kitchen, rotating the brandy to warm it. She is quite beautiful and holds two large brandy snifters, the stems between her fingers. She continues rotating the brandy and then comes forward, handing one snifter to Jeff, as Doyle reacts to her appreciatively. She offers the second to Doyle, who sort of smiles and takes the snifter awkwardly, bowing his head slightly, but his eyes remain on her in a fixed stare. Lisa smiles in return, turns around, and goes back into the kitchen. Doyle stares after her, ignoring her remark, still not recovered from the first sight of her attractiveness. Then, quickly, his eyes move down and to the left to the open overnight case with its displayed lingerie. Slowly, Doyle's eyes travel back to Jeff, who quickly guesses what's on Doyle's mind and picks up the phone, turning his head to Lisa, who answers. Doyle looks suddenly interested and asks tersely, his head snapping back to Jeff, who answers. Doyle's head moves back to Lisa as she answers with a touch of pride in her voice. Before Doyle can comment, Jeff asks impatiently. Doyle smiles at Jeff and then strolls over to the table, where he puts out his cigarette and puts down the brandy snifter, then goes to the window and looks out as they watch him expectantly. His voice is flat and to the point as he speaks without looking at them, and Jeff and Lisa stare at him in astonishment. Jeff then recovers and answers with some anger. He starts to place the room and spins around, his face losing all its friendliness, as she replies with some sarcasm. Lisa and Jeff converse, with Jeff reasoning and Lisa cutting in spiritedly. Doyle starts to pace up and down, throwing out a hand in careful explanation, while Jeff is resentful of Doyle's comments to Lisa. Doyle has turned away into the center of the room and swings around, as Lisa speaks again with continuing sarcasm, and Doyle comes toward the camera again.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She rises up from Jeff's lap and places the overnight case on the table, then proceeds to the window and gazes toward the songwriter's apartment, where the gathering has expanded significantly, with a variety of elegantly dressed people packed into the studio, imbibing and consuming. Lisa stands listening, captivated, while Jeff observes her. She sits down on the brink of the sofa near Jeff and inclines toward him. Jeff's stress diminishes slightly, but he is keen to converse. Doyle glances back toward Thorwald's bedroom, and we perceive the dim apartment beyond him. He swivels his head abruptly at the noise of Lisa emerging from the kitchen, swirling the cognac to warm it. She is quite lovely and holds two sizable cognac goblets, the stems between her digits. She persists in swirling the cognac and then steps forward, handing one goblet to Jeff, as Doyle responds to her appreciatively. She extends the second to Doyle, who sort of grins and takes the goblet awkwardly, nodding his head slightly, but his eyes remain on her in a steady gaze. Lisa grins in return, turns around, and retreats into the kitchen. Doyle gazes after her, disregarding her remark, still not recovered from the initial sight of her allure. Then, swiftly, his eyes shift down and to the left to the open overnight case with its displayed lingerie. Gradually, Doyle's eyes traverse back to Jeff, who quickly deduces what's on Doyle's mind and picks up the telephone, turning his head to Lisa, who responds. Doyle looks suddenly intrigued and inquires tersely, his head snapping back to Jeff, who responds. Doyle's head moves back to Lisa as she responds with a hint of pride in her voice. Before Doyle can remark, Jeff inquires impatiently. Doyle grins at Jeff and then saunters over to the table, where he extinguishes his cigarette and sets down the cognac goblet, then approaches the window and looks out as they watch him expectantly. His voice is flat and to the point as he articulates without looking at them, and Jeff and Lisa gaze at him in amazement. Jeff then recovers and responds with some ire. He begins to position the room and twirls around, his face losing all its affability, as she responds with some sarcasm. Lisa and Jeff exchange words, with Jeff reasoning and Lisa interjecting spiritedly. Doyle begins to pace back and forth, gesturing in careful elucidation, while Jeff is resentful of Doyle's remarks to Lisa. Doyle has turned away into the center of the room and pivots around, as Lisa speaks again with continuing sarcasm, and Doyle advances toward the camera again."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "She gets up from Jeff's lap and puts the overnight case on the table. Then, the window is approached by her, and she looks toward the songwriter's apartment, where the party has grown considerably larger, with an assortment of well-dressed people crowded into the studio, drinking and eating. Lisa stands listening, entranced, while she is watched by Jeff. She sits down on the edge of the divan near Jeff and leans toward him. Jeff's tension eases off a little, but he is eager to talk. Doyle looks back toward Thorwald's bedroom, and the dark apartment beyond him is seen. The sound of Lisa coming out of the kitchen makes him turn his head suddenly, rotating the brandy to warm it. She is quite beautiful and holds two large brandy snifters, the stems between her fingers. The brandy continues to be rotated by her, and then she comes forward, handing one snifter to Jeff, and Doyle reacts to her appreciatively. She offers the second to Doyle, who sort of smiles and takes the snifter awkwardly, bowing his head slightly, but he keeps his eyes fixed on her. A smile is returned by Lisa, who turns around and goes back into the kitchen. Doyle stares after her, ignoring her remark, still not recovered from the first sight of her attractiveness. Then, quickly, his eyes move down and to the left to the open overnight case with its displayed lingerie. Slowly, Doyle's eyes travel back to Jeff, who quickly guesses what's on Doyle's mind and picks up the phone, turning his head to Lisa, and she answers. Doyle looks suddenly interested and asks tersely, his head snapping back to Jeff, who answers. Doyle's head moves back to Lisa as she answers with a touch of pride in her voice. Before Doyle can comment, Jeff asks impatiently. Jeff is smiled at by Doyle, who then strolls over to the table, puts out his cigarette and places down the brandy snifter, then goes to the window and looks out as he is watched expectantly by them. His voice is flat and to the point as he speaks without looking at them, and in astonishment, he is stared at by Jeff and Lisa. Jeff then recovers and answers with some anger. The room is started to be placed by him, and he spins around, his face losing all its friendliness, as she replies with some sarcasm. Lisa and Jeff converse, with Jeff reasoning and Lisa cutting in spiritedly. Up and down, Doyle starts to pace, throwing out a hand in careful explanation, while Jeff resents Doyle's comments to Lisa. Doyle has turned away into the center of the room and swings around, as she speaks again with continuing sarcasm, and Doyle comes toward the camera again."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "She rises from Jeff's lap, places the overnight case on the table, and looks out the window toward the songwriter's now-crowded party. Lisa is captivated, while Jeff observes her. She sits beside him, easing his tension, but he's eager to speak. Doyle glances at Thorwald's dark bedroom and turns as Lisa exits the kitchen, warming brandy. She carries two snifters, handing one to Jeff and, with a smile, the other to an admiring Doyle, who awkwardly accepts it. Lisa returns to the kitchen, with Doyle still captivated by her. Doyle's gaze shifts to the open overnight case displaying lingerie, then back to Jeff, who anticipates Doyle's thoughts and calls Lisa. Doyle becomes intrigued, snapping back to Jeff and then focused on Lisa, who replies proudly. Before Doyle comments, Jeff impatiently prompts him. Doyle smiles, stubs his cigarette, sets down the snifter, and looks out the window. Speaking flatly, Jeff and Lisa are astonished. Jeff responds angrily, spins around, losing his composure. Lisa and Jeff converse, with Jeff reasoning and Lisa interjecting spiritedly. Doyle paces, explaining carefully as Jeff resents his remarks to Lisa. Doyle turns, Lisa continues her sarcasm, and he approaches again."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "She rises from Jeff's lap, places the overnight case on the table, and looks toward the songwriter's growing party. Lisa, entranced, sits near Jeff, easing his tension. Doyle glances toward Thorwald's dark apartment, noticing Lisa emerging with two brandy snifters, captivated by her beauty. She hands one to Jeff and offers the other to Doyle, who awkwardly accepts, mesmerized by her. Lisa returns to the kitchen, Doyle fixated on her, before noticing the open case with lingerie. His gaze shifts to Jeff, who quickly guesses his thoughts and calls Lisa over. Doyle, intrigued, questions Jeff, who responds impatiently. Doyle smirks, stubs out his cigarette, and looks out the window, speaking flatly as Jeff and Lisa react with astonishment. Jeff responds angrily, the atmosphere tense as Lisa and Jeff exchange spirited words. Doyle paces, explaining his comments that irk Jeff, turning back as Lisa sarcastically counters, while Doyle approaches the camera again."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Lisa gracefully rises from Jeff's lap and carefully places the overnight case on the table before moving over to the window. From there, she glances toward the song-writer's apartment across the way, where the lively party has noticeably grown larger. An array of elegantly dressed guests has filled the studio, indulging in drinks and enjoying a variety of foods. As Lisa stands there, captivated by the scene, Jeff's gaze is fixed on her, watching attentively. She gracefully takes a seat on the edge of the divan near Jeff, leaning in slightly toward him. Jeff feels a slight release of the tension he had been carrying, though he remains eager to engage in conversation.\n\nMeanwhile, Doyle's attention shifts back to Thorwald's bedroom, where we can glimpse the darkened apartment behind him. His focus turns abruptly at the sound of Lisa emerging from the kitchen, gently swirling the brandy to warm it in her hands. She looks particularly stunning, holding two large brandy snifters delicately by their stems between her fingers. Continuing to rotate the brandy, she walks forward, offering one snifter to Jeff as Doyle observes her with an appreciative reaction. She extends the second snifter to Doyle, who, with a slight, awkward smile, accepts it, bowing his head modestly, though his eyes remain fixated on her allure. Lisa responds to Doyle with a warm smile, turns back, and makes her way into the kitchen once more. Doyle's gaze follows her retreat, seemingly oblivious to her remark as he remains captivated by her beauty. His attention then drifts, moving downward and to the left, where he notices the open overnight case displaying its delicate lingerie. \n\nGradually, Doyle's eyes shift back to Jeff, who, sensing Doyle's thoughts, effortlessly picks up the phone and turns his head toward Lisa, who responds to his call. Doyle's interest piques, and his head snaps back to Jeff, who replies to Doyle's terse inquiry. Doyle's focus transitions back to Lisa as she answers, her voice carrying a hint of pride. Yet, before Doyle can offer a comment, Jeff impatiently interjects. Doyle responds with a smile directed at Jeff and then casually strolls over to the table to extinguish his cigarette. He sets down his brandy snifter and moves toward the window, prompting Jeff and Lisa to watch him with anticipation. Speaking with a voice that's both flat and succinct, Doyle keeps his gaze away from them as Jeff and Lisa's eyes widen in disbelief. \n\nJeff soon regains his composure and responds with a touch of anger. He starts to pace the room, his demeanor shifting from friendly to confrontational, as Lisa replies with a note of sarcasm. The conversation between Lisa and Jeff unfolds, with Jeff attempting to reason while Lisa interjects with spirited retorts. Doyle begins to pace up and down, gesturing with his hands in a deliberate manner to emphasize his point, all while Jeff bristles at Doyle's remarks to Lisa. Doyle steps away toward the center of the room, only to turn back around as Lisa continues her sarcastic commentary. Doyle approaches the camera with renewed focus, ready to address the situation further."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Lisa, with a graceful elegance, rises from where she has been comfortably seated on Jeff's lap. She carefully places the overnight case onto the table, ensuring it rests securely, before she elegantly moves over to the window. From this vantage point, she allows her gaze to wander across the way toward the song-writer's nearby apartment, where a lively party is taking place. Notably, the gathering has grown substantially, with an array of elegantly dressed guests filling the studio. These guests are indulging in drinks and enjoying a variety of delicious foods. As Lisa stands there, seemingly captivated by the lively scene before her, Jeff remains entirely focused on her, watching her every move with attentive, interested eyes. She then gracefully takes a seat on the edge of the divan beside Jeff, leaning in slightly toward him. Jeff experiences a slight easing of the tension he had been feeling, though he still remains eager to engage in a meaningful conversation with her.\n\nSimultaneously, Doyle's attention turns back to focus on Thorwald's bedroom, where the darkened apartment behind him is visible. His focus shifts abruptly at the delicate sound of Lisa emerging from the kitchen. She's gently swirling the brandy, purposefully warming it in her hands. Lisa appears particularly stunning, especially while holding two large brandy snifters with elegance, gripping them delicately by their stems between her fingers. As she continues to carefully rotate the brandy within the snifters, she walks forward with poise, offering one of them to Jeff. Doyle is captivated, observing her with an appreciative reaction. Lisa then extends the second snifter to Doyle, who accepts it with a slight, somewhat awkward smile and a humble bow of his head, although his eyes remain fixated on her allure. Lisa acknowledges Doyle's reaction with a warm, inviting smile. She then turns back and makes her way into the kitchen once more, with Doyle's gaze following her retreat, seemingly oblivious to her comment as he remains enthralled by her beauty. His attention eventually drifts, moving downward and to the left, where the open overnight case reveals its delicate lingerie contents.\n\nGradually, Doyle's eyes shift back to Jeff. Jeff, sensing Doyle's thoughts, effortlessly picks up the phone and turns his head toward Lisa, who is quick to respond to his call. Doyle's interest is piqued, and his head snaps back to focus on Jeff, who then replies to Doyle's terse inquiry with precision. Doyle's attention transitions back to Lisa as she answers, her voice carrying a hint of pride that is unmistakable. Yet, before Doyle can offer any comment of his own, Jeff impatiently interjects. Doyle responds with a smile directed toward Jeff, and then he leisurely strolls over to the table. There, he extinguishes his cigarette before setting down his brandy snifter and moving with intention toward the window, all while Jeff and Lisa watch him with anticipation. Speaking in a voice that is both flat and succinct, Doyle keeps his gaze deliberately away from them, leaving Jeff and Lisa's eyes to widen in disbelief at his words.\n\nJeff soon regains his composure and responds with a touch of anger, unable to contain his frustration. He begins to pace the room, his demeanor shifting noticeably from friendly to confrontational, while Lisa counters with a note of sarcasm in her voice. The conversation between Lisa and Jeff unfolds dynamically, with Jeff trying to maintain reason while Lisa interjects with spirited, witty retorts. Meanwhile, Doyle begins to pace up and down the room, gesturing emphatically with his hands to underscore the points he's making, all while Jeff becomes increasingly agitated by Doyle's remarks directed at Lisa. Doyle steps away toward the center of the room, only to turn back around as Lisa continues her sarcastic commentary seamlessly. Doyle approaches the camera with renewed focus and vigor, ready to address the situation further with his characteristic determination."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As she rises from Jeff's lap, she gracefully lifts the overnight case and places it on the table. Her attention shifts to the window, where she peers out intently toward the songwriter’s apartment. Her gaze lands on the apartment, where the party has grown considerably larger, with an array of well-dressed people tightly packed into the studio, animatedly engaged in drinking and eating. Lisa stands there, her senses captivated by the lively scene, while Jeff observes her intently. She then carefully positions herself on the edge of the divan near Jeff, leaning toward him in an intimate gesture. This gesture seems to alleviate Jeff’s tension slightly, yet he remains eager to express himself verbally. Meanwhile, Doyle's attention diverts back toward Thorwald's dimly lit bedroom, casting our view into the shadowed apartment beyond. The sound of Lisa’s return from the kitchen catches his attention; he turns his head abruptly as Lisa emerges, skillfully rotating the brandy in its glass to warm it. Her beauty is striking, as she elegantly carries two large brandy snifters, delicately holding the stems between her fingers. She continues to swirl the brandy, advancing forward to hand one of the snifters to Jeff, prompting an appreciative reaction from Doyle. She then extends the second snifter to Doyle, who offers a somewhat awkward but appreciative smile, slightly bowing his head while maintaining a steady gaze on her. Lisa responds with a smile, pivots gracefully, and heads back into the kitchen. Doyle’s eyes trail after her, seemingly unaffected by her remark, still absorbing the impact of her presence. His gaze soon shifts downward and to the left, settling on the open overnight case, taking in the display of lingerie. Doyle's eyes then slowly trace their way back to Jeff, who, realizing Doyle’s train of thought, promptly picks up the phone and turns his head toward Lisa, who answers. Doyle, now suddenly intrigued, snaps his gaze back to Jeff with a terse inquiry, to which Jeff responds. Doyle’s focus shifts again to Lisa as she replies, her voice tinged with pride. Before Doyle can comment further, Jeff interjects impatiently. Doyle grins at Jeff before casually strolling over to the table, extinguishing his cigarette before placing the brandy snifter down. He then approaches the window and peers out, while Jeff and Lisa watch him with anticipation. Doyle speaks, his voice flat yet direct, without turning to face them, which leaves Jeff and Lisa staring at him in shock. Jeff, regaining his composure, replies with barely contained anger. As he begins to move around the room, he suddenly spins back, his expression transforming from friendliness to one of confrontation, in response to her sarcastic reply. A spirited exchange ensues between Lisa and Jeff, with Jeff attempting to reason, as Lisa interjects with spirited fervor. Doyle paces the room, gesturing earnestly to explain himself, while Jeff remains resentful of Doyle’s comments regarding Lisa. Doyle pauses, turning toward the center of the room, then swings back around as Lisa continues with her sarcasm, approaching the camera once again."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "She rises from Jeff's lap, places the overnight case on the table, and observes the larger party at the songwriter's apartment through the window. Enchanted by the scene, she sits near Jeff, who relaxes slightly but remains eager to converse. Meanwhile, Doyle glances toward Thorwald's dark apartment and turns at the sound of Lisa emerging from the kitchen with two brandy snifters. Her beauty captivates Doyle as she hands Jeff a snifter and offers another to him, which he accepts awkwardly, unable to take his eyes off her. Lisa smiles, returns to the kitchen, and Doyle's gaze shifts to the open overnight case displaying lingerie. As Doyle's eyes return to Jeff, Jeff anticipates Doyle's thoughts, picks up the phone, and turns to Lisa, prompting a series of quick exchanges. Doyle, suddenly interested, questions Jeff, who responds. Lisa answers Doyle with pride, and before he comments, Jeff interrupts impatiently. Doyle smiles, extinguishes his cigarette, sets down the brandy, and peers out the window, speaking bluntly. Jeff and Lisa watch in astonishment, and when Jeff responds angrily, the atmosphere becomes tense. A spirited dialogue ensues between Jeff and Lisa, while Doyle paces and gestures in explanation. As Lisa continues sarcastically, Doyle moves toward the camera, adding to the escalating tension."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She gets up from Jeff's lap and puts the overnight case, a piece of luggage commonly used for short trips, on the table, then goes to the window and looks toward the song-writer's apartment. This apartment is known for hosting lively gatherings in the artistic neighborhood, where the party has grown considerably larger, with an assortment of well-dressed people crowded into the studio, drinking and eating gourmet appetizers typical of such events. Lisa stands listening, entranced by the lively music emerging from the party, while Jeff watches her. She sits down on the edge of the divan, an elegant piece of furniture popular in mid-century modern design, near Jeff and leans toward him. Jeff's tension eases off a little, but he is eager to talk about the unfolding situation. Doyle looks back toward Thorwald's bedroom, in what is rumored to be a tense neighborhood due to recent mysterious occurrences, and we see the dark apartment beyond him. He turns his head suddenly at the sound of Lisa coming out of the kitchen, rotating the brandy to warm it, a technique that enhances the flavor of the drink. She is quite beautiful, reflecting the timeless allure often seen in the fashion of this era, and holds two large brandy snifters, the stems between her fingers with the elegance of a practiced host. She continues rotating the brandy and then comes forward, handing one snifter to Jeff, as Doyle reacts to her appreciatively, captivated by her poise. She offers the second to Doyle, who sort of smiles and takes the snifter awkwardly, bowing his head slightly in a respectful gesture, but his eyes remain on her in a fixed stare, as if seeing beauty personified. Lisa smiles in return, turns around, and goes back into the kitchen. Doyle stares after her, ignoring her remark, still not recovered from the first sight of her attractiveness, which seems to have left a lasting impression. Then, quickly, his eyes move down and to the left to the open overnight case with its displayed lingerie, which hints at an unexpected intimacy in the situation. Slowly, Doyle's eyes travel back to Jeff, who quickly guesses what's on Doyle's mind and picks up the phone, a lifeline for quick communication, turning his head to Lisa, who answers with the ease of familiarity. Doyle looks suddenly interested and asks tersely, his head snapping back to Jeff, who answers with calm assurance. Doyle's head moves back to Lisa as she answers with a touch of pride in her voice, revealing a deeper complexity to the unfolding dynamic. Before Doyle can comment, Jeff asks impatiently, urging the conversation forward. Doyle smiles at Jeff, an acknowledgment of their unspoken understanding, and then strolls over to the table, where he puts out his cigarette, a habitual act in social gatherings of the time, and puts down the brandy snifter, then goes to the window and looks out as they watch him expectantly, wondering what conclusion he might draw. His voice is flat and to the point as he speaks without looking at them, and Jeff and Lisa stare at him in astonishment, absorbing the sudden clarity of his observations. Jeff then recovers and answers with some anger, his frustration boiling over. He starts to place the room, visualizing the connections and relationships at play, and spins around, his face losing all its friendliness, as she replies with some sarcasm, her words cutting through the tension. Lisa and Jeff converse, with Jeff reasoning methodically and Lisa cutting in spiritedly, her quick wit a match for his logic. Doyle starts to pace up and down, throwing out a hand in careful explanation, attempting to articulate his perspective, while Jeff is resentful of Doyle's comments to Lisa, feeling protective. Doyle has turned away into the center of the room and swings around, as Lisa speaks again with continuing sarcasm, and Doyle comes toward the camera again, his expression revealing the weight of the situation."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "She gets up from Jeff's lap and puts the overnight case on the table then goes to the window and looks toward the songwriter's apartment where the party has grown considerably larger with an assortment of welldressed people crowded into the studio drinking and eating. Lisa stands listening entranced while Jeff watches her. She sits down on the edge of the divan near Jeff and leans toward him. Jeff's tension eases off a little but he is eager to talk. Doyle looks back toward Thorwald's bedroom and we see the dark apartment beyond him. He turns his head suddenly at the sound of Lisa coming out of the kitchen rotating the brandy to warm it. She is quite beautiful and holds two large brandy snifters the stems between her fingers. She continues rotating the brandy and then comes forward handing one snifter to Jeff as Doyle reacts to her appreciatively. She offers the second to Doyle who sort of smiles and takes the snifter awkwardly bowing his head slightly but his eyes remain on her in a fixed stare. Lisa smiles in return turns around and goes back into the kitchen. Doyle stares after her ignoring her remark still not recovered from the first sight of her attractiveness. Then quickly his eyes move down and to the left to the open overnight case with its displayed lingerie. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Slowly. Doyle's eyes travel back to Jeff who quickly guesses what is on Doyle's mind and picks up the phone turning his head to Lisa who answers. Doyle looks suddenly interested and asks tersely his head snapping back to Jeff who answers. Doyle's head moves back to Lisa as she answers with a touch of pride in her voice. Before Doyle can comment Jeff asks impatiently. Doyle smiles at Jeff and then strolls over to the table where he puts out his cigarette and puts down the brandy snifter then goes to the window and looks out as they watch him expectantly. His voice is flat and to the point as he speaks without looking at them and Jeff and Lisa stare at him in astonishment. Jeff then recovers and answers with some anger. He starts to place the room and spins around his face losing all its friendliness as she replies with some sarcasm. Lisa and Jeff converse with Jeff reasoning and Lisa cutting in spiritedly. Doyle starts to pace up and down throwing out a hand in careful explanation while Jeff is resentful of Doyle's comments to Lisa. Doyle has turned away into the center of the room and swings around as Lisa speaks again with continuing sarcasm and Doyle comes toward the camera again."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "She gets up from Jeff's lap and puts the overnight case on the table then goes to the window and looks toward the songwriter's apartment where the party has grown considerably larger with an assortment of welldressed people crowded into the studio drinking and eating. Lisa stands listening entranced while Jeff watches her. She sits down on the edge of the divan near Jeff and leans toward him. Jeff's tension eases off a little but he is eager to talk. Doyle looks back toward Thorwald's bedroom and we see the dark apartment beyond him. He turns his head suddenly at the sound of Lisa coming out of the kitchen rotating the brandy to warm it. She is quite beautiful and holds two large brandy snifters the stems between her fingers. She continues rotating the brandy and then comes forward handing one snifter to Jeff as Doyle reacts to her appreciatively. She offers the second to Doyle who sort of smiles and takes the snifter awkwardly bowing his head slightly but his eyes remain on her in a fixed stare. Lisa smiles in return turns around and goes back into the kitchen. Doyle stares after her ignoring her remark still not recovered from the first sight of her attractiveness. Then quickly his eyes move down and to the left to the open overnight case with its displayed lingerie. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Slowly. Doyle's eyes travel back to Jeff who quickly guesses what is on Doyle's mind and picks up the phone turning his head to Lisa who answers. Doyle looks suddenly interested and asks tersely his head snapping back to Jeff who answers. Doyle's head moves back to Lisa as she answers with a touch of pride in her voice. Before Doyle can comment Jeff asks impatiently. Doyle smiles at Jeff and then strolls over to the table where he puts out his cigarette and puts down the brandy snifter then goes to the window and looks out as they watch him expectantly. His voice is flat and to the point as he speaks without looking at them and Jeff and Lisa stare at him in astonishment. Jeff then recovers and answers with some anger. He starts to place the room and spins around his face losing all its friendliness as she replies with some sarcasm. Lisa and Jeff converse with Jeff reasoning and Lisa cutting in spiritedly. Doyle starts to pace up and down throwing out a hand in careful explanation while Jeff is resentful of Doyle's comments to Lisa. Doyle has turned away into the center of the room and swings around as Lisa speaks again with continuing sarcasm and Doyle comes toward the camera again."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "She gets up from Jeff's lap and puts the overnight case on the table then goes to the window and looks toward the songwriter's apartment where the party has grown considerably larger with an assortment of welldressed people crowded into the studio drinking and eating. Lisa stands listening entranced while Jeff watches her. She sits down on the edge of the divan near Jeff and leans toward him. Jeff's tension eases off a little but he is eager to talk. Doyle looks back toward Thorwald's bedroom and we see the dark apartment beyond him. He turns his head suddenly at the sound of Lisa coming out of the kitchen rotating the brandy to warm it. His voice is flat and to the point as he speaks without looking at them and Jeff and Lisa stare at him in astonishment. Jeff then recovers and answers with some anger. He starts to place the room and spins around his face losing all its friendliness as she replies with some sarcasm. Lisa and Jeff converse with Jeff reasoning and Lisa cutting in spiritedly. Doyle starts to pace up and down throwing out a hand in careful explanation while Jeff is resentful of Doyle's comments to Lisa. Doyle has turned away into the center of the room and swings around as Lisa speaks again with continuing sarcasm and Doyle comes toward the camera again."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "She gets up from Jeff's lap and puts the overnight case on the table then goes to the window and looks toward the songwriter's apartment where the party has grown considerably larger with an assortment of welldressed people crowded into the studio drinking and eating. Lisa stands listening entranced while Jeff watches her. She sits down on the edge of the divan near Jeff and leans toward him. Doyle starts to pace up and down throwing out a hand in careful explanation while Jeff is resentful of Doyle's comments to Lisa. Doyle has turned away into the center of the room and swings around as Lisa speaks again with continuing sarcasm and Doyle comes toward the camera again."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "He hops off from Karen's shoulder and tosses the suitcase onto the carpet, then wanders to the door and peers toward the baker's garage, where the circus has swelled significantly larger, with a mix of casually-dressed animals piled into the arena, juggling and dancing. Martha stands humming, mesmerized, while Karen observes her. He stretches out on the arm of the hammock near Karen and tilts toward her. Karen's worry softens a bit, but she is anxious to chat. Burns glances back toward Snodgrass's attic, and we glimpse the lit cellar beyond him. He swivels his neck suddenly at the noise of Martha exiting the pantry, twirling the cider to chill it. He is somewhat elegant and holds three small cider mugs, the handles clutched in his toes. He keeps twirling the cider and then steps forward, passing one mug to Karen, as Burns reacts to him appreciatively. He offers the second to Burns, who sort of grins and accepts the mug awkwardly, bobbing his neck slightly, but his nose remains on him in a steady gaze. Martha grins in return, pivots around, and skips back into the pantry. Burns gazes after him, dismissing his comment, still not recovered from the initial glimpse of his elegance. Then, swiftly, his nose shifts down and to the right to the closed suitcase with its packed herbs. Gradually, Burns's nose wanders back to Karen, who swiftly guesses what's on Burns's mind and lifts the tablet, pivoting his neck to Martha, who responds. Burns looks suddenly intrigued and inquires sharply, his nose jerking back to Karen, who responds. Burns's nose shifts back to Martha as he responds with a hint of pride in his voice. Before Burns can remark, Karen inquires impatiently. Burns grins at Karen and then ambles over to the carpet, where he snubs out his pipe and places down the cider mug, then wanders to the door and peers out as they watch him keenly. His tone is dull and succinct as he speaks without facing them, and Karen and Martha gawk at him in disbelief. Karen then regains her composure and replies with some irritation. He starts to arrange the hut and swivels around, his nose losing all its warmth, as he retorts with some snark. Martha and Karen chat, with Karen reasoning and Martha interjecting spiritedly. Burns begins to march up and down, gesturing with a paw in delicate clarification, while Karen is offended by Burns's remarks to Martha. Burns has spun away to the edge of the hut and spins around, as Martha speaks once more with ongoing snark, and Burns approaches the lens again."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Lisa rises from Jeff's lap, placing an overnight case on the table. She observes a lively party in the songwriter's apartment, where guests mingle and indulge. Lisa, entranced, listens while Jeff observes her fondly. She then joins Jeff, easing his tension as he eagerly engages in conversation. Meanwhile, Doyle gazes at Thorwald's dark apartment, distracted by Lisa's entrance with brandy snifters. She hands one to Jeff and another to Doyle, who is captivated by her beauty. Lisa smiles and returns to the kitchen, leaving Doyle mesmerized. His gaze falters to the open case revealing lingerie, prompting Jeff to call Lisa. Doyle, intrigued, listens as Lisa responds with pride. Before Doyle can reply, Jeff intervenes impatiently. Doyle smiles, putting down his cigarette and brandy before looking out the window. His voice is direct, leaving Jeff and Lisa astonished as Jeff retorts angrily. They debate with Lisa's sarcasm clashing with Jeff's reasoning. Doyle paces, explaining carefully, while Jeff resents his remarks to Lisa. The conflict intensifies as Doyle returns to the conversation, responding to Lisa's continued sarcasm."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Doyle has turned away into the center of the room and swings around as Lisa speaks again with continuing sarcasm and Doyle comes toward the camera again Doyle starts to pace up and down throwing out a hand in careful explanation while Jeff is resentful of Doyle's comments to Lisa Lisa and Jeff converse with Jeff reasoning and Lisa cutting in spiritedly He starts to place the room and spins around his face losing all its friendliness as she replies with some sarcasm Jeff then recovers and answers with some anger His voice is flat and to the point as he speaks without looking at them and Jeff and Lisa stare at him in astonishment Doyle smiles at Jeff and then strolls over to the table where he puts out his cigarette and puts down the brandy snifter then goes to the window and looks out as they watch him expectantly Before Doyle can comment Jeff asks impatiently Doyle's head moves back to Lisa as she answers with a touch of pride in her voice Doyle looks suddenly interested and asks tersely his head snapping back to Jeff who answers Doyle's eyes travel back to Jeff who quickly guesses what is on Doyle's mind and picks up the phone turning his head to Lisa who answers Slowly Then quickly his eyes move down and to the left to the open overnight case with its displayed lingerie Doyle stares after her ignoring her remark still not recovered from the first sight of her attractiveness Lisa smiles in return turns around and goes back into the kitchen She offers the second to Doyle who sort of smiles and takes the snifter awkwardly bowing his head slightly but his eyes remain on her in a fixed stare She continues rotating the brandy and then comes forward handing one snifter to Jeff as Doyle reacts to her appreciatively She is quite beautiful and holds two large brandy snifters the stems between her fingers He turns his head suddenly at the sound of Lisa coming out of the kitchen rotating the brandy to warm it Doyle looks back toward Thorwald's bedroom and we see the dark apartment beyond him Jeff's tension eases off a little but he is eager to talk She sits down on the edge of the divan near Jeff and leans toward him Lisa stands listening entranced while Jeff watches her She gets up from Jeff's lap and puts the overnight case on the table then goes to the window and looks toward the songwriter's apartment where the party has grown considerably larger with an assortment of welldressed people crowded into the studio drinking and eating"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Lisa stands listening entranced while Jeff watches her She gets up from Jeff's lap and puts the overnight case on the table then goes to the window and looks toward the songwriter's apartment where the party has grown considerably larger with an assortment of welldressed people crowded into the studio drinking and eating Jeff's tension eases off a little but he is eager to talk She sits down on the edge of the divan near Jeff and leans toward him He turns his head suddenly at the sound of Lisa coming out of the kitchen rotating the brandy to warm it Doyle looks back toward Thorwald's bedroom and we see the dark apartment beyond him She continues rotating the brandy and then comes forward handing one snifter to Jeff as Doyle reacts to her appreciatively She is quite beautiful and holds two large brandy snifters the stems between her fingers Lisa smiles in return turns around and goes back into the kitchen She offers the second to Doyle who sort of smiles and takes the snifter awkwardly bowing his head slightly but his eyes remain on her in a fixed stare Then quickly his eyes move down and to the left to the open overnight case with its displayed lingerie Doyle stares after her ignoring her remark still not recovered from the first sight of her attractiveness Doyle's eyes travel back to Jeff who quickly guesses what is on Doyle's mind and picks up the phone turning his head to Lisa who answers Slowly Doyle's head moves back to Lisa as she answers with a touch of pride in her voice Doyle looks suddenly interested and asks tersely his head snapping back to Jeff who answers Doyle smiles at Jeff and then strolls over to the table where he puts out his cigarette and puts down the brandy snifter then goes to the window and looks out as they watch him expectantly Before Doyle can comment Jeff asks impatiently Jeff then recovers and answers with some anger His voice is flat and to the point as he speaks without looking at them and Jeff and Lisa stare at him in astonishment Lisa and Jeff converse with Jeff reasoning and Lisa cutting in spiritedly He starts to place the room and spins around his face losing all its friendliness as she replies with some sarcasm Doyle has turned away into the center of the room and swings around as Lisa speaks again with continuing sarcasm and Doyle comes toward the camera again Doyle starts to pace up and down throwing out a hand in careful explanation while Jeff is resentful of Doyle's comments to Lisa"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Slowly Doyle's eyes travel back to Jeff who quickly guesses what is on Doyle's mind and picks up the phone turning his head to Lisa who answers Doyle looks suddenly interested and asks tersely his head snapping back to Jeff who answers Doyle's head moves back to Lisa as she answers with a touch of pride in her voice Before Doyle can comment Jeff asks impatiently Doyle smiles at Jeff and then strolls over to the table where he puts out his cigarette and puts down the brandy snifter then goes to the window and looks out as they watch him expectantly His voice is flat and to the point as he speaks without looking at them and Jeff and Lisa stare at him in astonishment Jeff then recovers and answers with some anger He starts to place the room and spins around his face losing all its friendliness as she replies with some sarcasm Lisa and Jeff converse with Jeff reasoning and Lisa cutting in spiritedly Doyle starts to pace up and down throwing out a hand in careful explanation while Jeff is resentful of Doyle's comments to Lisa Doyle has turned away into the center of the room and swings around as Lisa speaks again with continuing sarcasm and Doyle comes toward the camera again She gets up from Jeff's lap and puts the overnight case on the table then goes to the window and looks toward the songwriter's apartment where the party has grown considerably larger with an assortment of welldressed people crowded into the studio drinking and eating Lisa stands listening entranced while Jeff watches her She sits down on the edge of the divan near Jeff and leans toward him Jeff's tension eases off a little but he is eager to talk Doyle looks back toward Thorwald's bedroom and we see the dark apartment beyond him He turns his head suddenly at the sound of Lisa coming out of the kitchen rotating the brandy to warm it She is quite beautiful and holds two large brandy snifters the stems between her fingers She continues rotating the brandy and then comes forward handing one snifter to Jeff as Doyle reacts to her appreciatively She offers the second to Doyle who sort of smiles and takes the snifter awkwardly bowing his head slightly but his eyes remain on her in a fixed stare Lisa smiles in return turns around and goes back into the kitchen Doyle stares after her ignoring her remark still not recovered from the first sight of her attractiveness Then quickly his eyes move down and to the left to the open overnight case with its displayed lingerie"
        }
      ]
    }
  ]
}