{
  "ground_truth": "He looks at Rick and says nothing as Rick walks to the bar, picks up a bottle, and pours a drink, which Laszlo takes. Rick then reaches in his jacket for his cigarette case, opens it, takes out a cigarette, and lights it, before looking away for a moment. Suddenly, there is a CRASH at the door of the cafe, followed by the forced entry of several gendarmes, as a French officer walks in and addresses Laszlo, who looks at Rick for a moment, then crosses to the officer in dignified silence, and together they walk toward the door. Rick's eyes follow them, but his expression reveals nothing of his feelings, when they are interrupted by an orderly. Renault hands some forms to the orderly, who exits, and the conversation continues. Renault sits at his desk and smokes while Rick nervously fingers his hat. Renault gets out of his chair, crosses to the front of his desk, retrieves a fresh cigarette from a box, chain-lights it with the old one, and sits back down. Rick stares at the floor, then looks back up at Renault, who presses a button on his desk, triggering a BUZZER as the door to Renault's office opens and Rick rises to go. A waiter brings tea to Rick and Ferrari, who sit alone at a table in a secluded nook off the main room, where Ferrari pours a cup for Rick, who takes a sip, then gets up, followed by Ferrari, and they shake hands to seal the deal. Rick walks to the door, stops, turns around, and leaves, while Ferrari picks up a fly swatter from the table and swats a fly. A car pulls quickly to a stop just outside the cafe, on the door of which a huge placard reads, as Renault looks around the empty cafe. Rick points at his breast pocket before they hear the CRUNCH of tires as a car pulls up. Renault walks up the stairs to Rick's office, and Ilsa quickly walks toward the entrance as Laszlo pays the cab driver. Ilsa pauses and looks at Rick, unsure for a moment, as Laszlo comes in and closes the door behind himself. Renault opens the office door and peers down at the proceedings. They all walk towards the bar, where Laszlo deposits his hat on a nearby table, takes out the letters, and hands them to Laszlo, who takes them gratefully. All three hear footsteps and turn to see Renault walking toward them from the bottom of the stairs, catching Ilsa and Laszlo completely off guard, with horror in Ilsa's eyes. Renault takes the letters, and they turn toward Rick, bewildered, while Renault is obviously delighted by the situation.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He gazes at Rick and utters nothing as Rick strolls to the tavern, grabs a bottle, and pours a beverage, which Laszlo accepts. Rick then reaches in his coat for his cigarette holder, opens it, takes out a cigarette, and ignites it, before glancing aside for a moment. Suddenly, there is a CRASH at the entrance of the cafe, followed by the forced incursion of several constables, as a French officer strides in and addresses Laszlo, who gazes at Rick for a moment, then traverses to the officer in dignified muteness, and together they amble toward the portal. Rick's eyes trail them, but his visage discloses nothing of his emotions, when they are disrupted by an attendant. Renault hands some documents to the attendant, who departs, and the dialogue proceeds. Renault sits at his desk and puffs while Rick nervously fidgets with his hat. Renault rises from his chair, crosses to the front of his desk, retrieves a fresh cigarette from a carton, chain-lights it with the previous one, and sits back down. Rick stares at the ground, then gazes back up at Renault, who presses a button on his desk, triggering a BUZZER as the door to Renault's office swings open and Rick rises to leave. A server brings tea to Rick and Ferrari, who sit alone at a table in a secluded alcove off the main room, where Ferrari pours a cup for Rick, who takes a sip, then rises, followed by Ferrari, and they shake hands to finalize the agreement. Rick strolls to the portal, halts, turns around, and departs, while Ferrari picks up a fly swatter from the table and swats a fly. An automobile pulls quickly to a halt just outside the cafe, on the door of which a huge placard reads, as Renault looks around the vacant cafe. Rick points at his breast pocket before they hear the CRUNCH of tires as a car approaches. Renault walks up the stairs to Rick's office, and Ilsa quickly strides toward the entrance as Laszlo pays the cab driver. Ilsa pauses and gazes at Rick, uncertain for a moment, as Laszlo enters and closes the door behind himself. Renault opens the office door and peers down at the proceedings. They all walk towards the bar, where Laszlo sets his hat on a nearby table, takes out the letters, and hands them to Laszlo, who accepts them gratefully. All three hear footsteps and turn to see Renault approaching them from the bottom of the stairs, catching Ilsa and Laszlo completely off guard, with dread in Ilsa's eyes. Renault takes the letters, and they turn toward Rick, perplexed, while Renault is obviously delighted by the circumstance."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He is looked at by Rick and nothing is said to Rick as he walks to the bar, a bottle is picked up by him, and a drink is poured by him, which is taken by Laszlo. Rick then reaches in his jacket for his cigarette case, opens it, a cigarette is taken out by him, and it is lit by him before a moment is looked away by him. Suddenly, a CRASH is heard at the door of the cafe, followed by several gendarmes forcing entry, as a French officer walks in and addresses Laszlo. Laszlo looks at Rick for a moment, then crosses to the officer in dignified silence, and together they walk toward the door. Rick's eyes follow them, but nothing of his feelings is revealed by his expression when they are interrupted by an orderly. Some forms are handed by Renault to the orderly, who exits, and the conversation is continued by them. Renault sits at his desk and smokes while his hat is nervously fingered by Rick. Renault gets out of his chair, crosses to the front of his desk, a fresh cigarette is retrieved by him from a box, it is chain-lit with the old one, and he sits back down. Rick stares at the floor, then looks back up at Renault, who presses a button on his desk, a BUZZER is triggered as the door to Renault's office opens, and Rick rises to go. Tea is brought by a waiter to Rick and Ferrari, who sit alone at a table in a secluded nook off the main room, where a cup is poured by Ferrari for Rick, who takes a sip, then gets up, followed by Ferrari, and a handshake is exchanged by them to seal the deal. Rick walks to the door, stops, turns around, and leaves, while a fly is swatted by Ferrari with a fly swatter picked up from the table. A car quickly comes to a stop just outside the cafe, on the door of which a huge placard is read by Renault, as he looks around the empty cafe. Rick points at his breast pocket before the CRUNCH of tires is heard by them as a car pulls up. The stairs are walked up by Renault to Rick's office, and Ilsa quickly walks toward the entrance as the cab driver is paid by Laszlo. Ilsa pauses and looks at Rick, unsure for a moment, as Laszlo comes in and closes the door behind himself. Renault opens the office door and peers down at the proceedings. They all walk towards the bar, where Laszlo deposits his hat on a nearby table, takes out the letters, and they are handed to Laszlo, who takes them gratefully. All three hear footsteps and turn to see Renault walking toward them from the bottom of the stairs, catching Ilsa and Laszlo completely off guard, with horror in Ilsa's eyes. The letters are taken by Renault, and they turn toward Rick, bewildered, while Renault is obviously delighted by the situation."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Rick approaches the bar, pours a drink for Laszlo, and then lights a cigarette. Suddenly, several gendarmes force their way into the café, led by a French officer who addresses Laszlo. Laszlo looks at Rick, then walks with the officer toward the door. Rick's expression remains unreadable as Renault gives forms to an orderly. Renault smokes at his desk as Rick fiddles with his hat. Renault lights a new cigarette, sits back, and presses a buzzer, prompting Rick to leave. In a secluded nook, Rick and Ferrari finalize a deal over tea, shaking hands. Rick exits, and Ferrari swats a fly. A car stops abruptly outside the café. Renault then ascends the stairs to Rick's office as Ilsa enters hesitantly, followed by Laszlo. Renault observes from above. Ilsa and Laszlo join Rick at the bar, and Laszlo hands over letters. Renault arrives, delighting in the scene, while Ilsa and Laszlo are shocked."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Rick silently watches Laszlo take a drink at the bar. Rick lights a cigarette before a CRASH at the cafe door announces the forced entry of gendarmes, accompanied by a French officer who addresses Laszlo. Laszlo silently joins the officer and they move toward the door, observed by Rick, whose expression remains unreadable. An orderly interrupts Renault, who gives him forms before continuing the conversation. Renault smokes at his desk while Rick nervously handles his hat. Renault lights a cigarette and buzzes Rick to leave. In a secluded nook, a waiter serves tea to Rick and Ferrari; they seal a deal with a handshake. Rick departs as Ferrari swats a fly. A car stops outside the cafe, its door bearing a placard. Rick indicates his pocket as they hear car tires CRUNCH. Renault ascends to Rick's office as Ilsa hesitates at the entrance while Laszlo pays the cab driver. Ilsa looks at Rick, uncertain, before Laszlo closes the door. Renault observes as they approach the bar, where Laszlo hands over letters. Renault, delighted, catches Ilsa and Laszlo off guard, taking the letters while they look at Rick, bewildered."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He gazes intently at Rick, maintaining a deliberate silence as Rick makes his way over to the bar. Once there, Rick casually picks up a bottle, skillfully pours a drink, which Laszlo graciously accepts. Rick then proceeds to reach into his jacket to retrieve his trusty cigarette case. With a practiced motion, he opens it, deftly takes out a cigarette, and carefully lights it before momentarily averting his eyes. Suddenly, the tranquility is shattered by a loud CRASH at the door of the café, followed by the forceful entry of several uniformed gendarmes. A distinguished French officer strides in and addresses Laszlo, who momentarily looks at Rick before crossing over to the officer with dignified silence. Together, they make their way toward the door, with Rick's eyes intently following them, though his expression betrays none of his inner feelings, their path briefly interrupted by an orderly. Renault hands over some documents to the orderly, who then exits, allowing the conversation to flow seamlessly. Meanwhile, Renault settles into his chair, lighting a cigarette as he does so, while Rick, visibly uneasy, fidgets with his hat. Renault rises from his seat, walks to the front of his desk, procures a fresh cigarette from a box, ignites it using the old one, and then returns to his chair. Rick, lost in his thoughts, stares at the floor, then raises his gaze back to Renault, who presses a button on his desk, activating a BUZZER. This prompts the office door to swing open, and Rick stands to leave. In a quiet corner off the bustling main room, a waiter serves tea to Rick and Ferrari, who are seated alone at a table. As Ferrari pours a cup for Rick, he takes a contemplative sip before standing, with Ferrari following suit, culminating in a handshake sealing their agreement. Rick makes his way to the door, stops briefly, turns back around, then exits, as Ferrari nonchalantly picks up a fly swatter from the table and dispatches a pesky fly. Outside the café, a car screeches to a rapid halt, sporting a large placard on its door, just as Renault surveys the now-empty café. Rick gestures toward his breast pocket, just as the ominous CRUNCH of tires signals the arrival of another vehicle. Renault ascends the stairs leading to Rick's office, while Ilsa purposefully moves towards the entrance as Laszlo settles the fare with the cab driver. Ilsa pauses, casting an unsure glance at Rick momentarily, before Laszlo enters and firmly closes the door behind him. Renault opens the office door, observing the unfolding events below. They all proceed toward the bar, where Laszlo places his hat on a nearby table, retrieves the letters from his pocket, and hands them to Laszlo, who accepts with gratitude. All three are startled by the sound of footsteps, turning to see Renault descending the stairs toward them, catching Ilsa and Laszlo entirely by surprise, evident in Ilsa's look of horror. Renault seizes the letters, and they all turn their attention towards Rick, who is met with their bewildered expressions, while Renault seems visibly pleased with the unfolding situation."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a focused gaze, he looks intently at Rick, choosing to maintain a deliberate silence as Rick makes his way over to the bar with measured steps. Upon reaching the bar, Rick casually picks up a bottle, then skillfully pours a drink into a glass, which Laszlo graciously accepts with a nod. Next, Rick reaches into his jacket pocket to retrieve his trusty cigarette case. With a well-practiced motion, he opens the neat case, deftly extracts a cigarette, and carefully lights it before momentarily averting his eyes to contemplate his surroundings. Suddenly, the tranquility is shattered by the loud CRASH at the door of the café, signaling the forceful entry of several uniformed gendarmes. A distinguished-looking French officer strides confidently in and immediately addresses Laszlo, who, maintaining a dignified silence, momentarily glances at Rick before crossing over to engage with the officer. Together, they make their way toward the door, Rick's eyes never leaving them, though his expression reveals none of the turbulent emotions within, their path briefly interrupted by an orderly. Renault hands over some important documents to the orderly, who then quickly exits, allowing their conversation to flow seamlessly uninterrupted. Meanwhile, Renault settles comfortably into his chair, lighting a cigarette as he does so, while Rick, visibly uneasy, fidgets nervously with his hat. Renault rises from his seat, walks to the front of his desk, and procures a fresh cigarette from a box, igniting it with the existing one before returning to his chair. Rick, lost deep in thought, stares vacantly at the floor for a moment, then gradually raises his gaze back to Renault, who presses a button on his desk, activating a BUZZER. This prompt causes the office door to swing open, prompting Rick to stand and prepare to leave. In a quiet, secluded corner off the bustling main room, a waiter diligently serves tea to Rick and Ferrari, who are seated alone at a small table. As Ferrari pours a cup of tea for Rick, he takes a thoughtful, contemplative sip before standing, with Ferrari following suit, culminating in a handshake that seals their agreement. Rick makes his way toward the door, pauses briefly, turns back around for a moment, then decisively exits. Meanwhile, Ferrari nonchalantly picks up a fly swatter from the table, dispatching a pesky fly with ease. Outside the café, a car screeches to a rapid halt, bearing a large placard on its door, just as Renault surveys the now-deserted café interior. Rick makes a gesture toward his breast pocket, just as the ominous CRUNCH of tires heralds the arrival of yet another vehicle. Renault ascends the stairs leading to Rick's office, while Ilsa purposefully moves toward the entrance as Laszlo settles the fare with the waiting cab driver. Ilsa pauses, casting an unsure glance toward Rick for a brief moment, before Laszlo enters and firmly closes the door behind him. Renault then opens the office door, observing the unfolding events below with keen interest. They all proceed toward the bar, where Laszlo places his hat on a nearby table, retrieves the letters from his pocket, and hands them to Laszlo, who accepts with a nod of gratitude. The sudden sound of approaching footsteps startles them all, causing them to turn and see Renault descending the stairs toward them, catching Ilsa and Laszlo entirely by surprise, as evident in Ilsa's look of horror. Renault seizes the letters, and they all turn their attention toward Rick, who is met with their bewildered expressions, while Renault seems visibly pleased with the way the situation is unfolding."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He fixes his gaze on Rick, maintaining a silent demeanor, as Rick makes his way over to the bar, selecting a bottle and carefully pouring a drink, which Laszlo then accepts without exchanging a word. Rick then deftly reaches into the inner pocket of his jacket, smoothly retrieves his cigarette case, and with a quiet click, opens it to procure a single cigarette which he expertly lights before casting his eyes away briefly. The tranquility is abruptly shattered by a loud CRASH at the door of the café, signaling the sudden and forceful entry of several gendarmes, followed by the arrival of a French officer who strides purposefully inside and directly addresses Laszlo. Laszlo momentarily glances at Rick, maintains his composure, and with a dignified silence, moves to accompany the officer, and together they proceed toward the door. Rick's eyes track their movement intently, but his facial expression betrays no hint of his inner emotions when an orderly disrupts the moment by approaching Renault, handing over some forms before making his exit, allowing the conversation to resume. Renault then settles himself at his desk, lighting a cigarette and exhaling slowly while Rick, with growing anxiety, fidgets with his hat. Renault rises from his chair, strides to the front of his desk, selects a fresh cigarette from a box, seamlessly lights it using the smoldering end of his previous one, and sinks back into his seat. Rick, absorbed in thought, examines the floor before redirecting his focus back to Renault, who presses a button on his desk, and a sharp BUZZER resonates as the door to Renault's office swings open, prompting Rick to stand up and prepare to depart. Meanwhile, in a quiet corner removed from the main room, a waiter approaches to serve tea to Rick and Ferrari, who are seated together at a table, where Ferrari meticulously pours a cup for Rick. Rick takes a hesitant sip, and then, with a decisive movement, rises to his feet, with Ferrari following suit, and they solidify their agreement with a firm handshake. Rick proceeds toward the door, hesitates briefly, pivots around, and then exits, leaving Ferrari behind, who idly picks up a fly swatter and decisively swats a fly. Just outside the café, a car speeds to a halt, prominently displaying a large placard on its door, as Renault surveys the now empty café. Rick gestures toward his breast pocket just as the audible CRUNCH of tires announces the arrival of another car. Renault ascends the stairs leading to Rick's office, and Ilsa moves briskly toward the entrance even as Laszlo compensates by paying the cab driver. Ilsa halts, casting a tentative glance at Rick, momentarily indecisive, as Laszlo enters and shuts the door behind him. Renault emerges by opening the office door, casting his gaze down to observe the unfolding events. They all converge toward the bar, where Laszlo casually places his hat on a nearby table, retrieves some important letters, and hands them over, which Laszlo receives with evident gratitude. At that precise moment, they all hear the sound of approaching footsteps and turn collectively to find Renault advancing toward them from the foot of the stairs, taking Ilsa and Laszlo by surprise, with a look of horror etched across Ilsa's face. Renault eagerly takes the letters into his possession, allowing him to turn back to Rick with an air of delight, while Ilsa and Laszlo remain standing there, bewildered by the unexpected turn of events."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Laszlo silently observes Rick as he pours a drink at the bar, which he accepts. Rick lights a cigarette and briefly looks away when a sudden CRASH at the cafe door signals the entrance of several gendarmes and a French officer, who addresses Laszlo. After a moment of silent exchange with Rick, Laszlo approaches the officer, and they exit together, followed by Rick's impassive gaze until an orderly interrupts with forms from Renault. As the orderly leaves, Renault sits and smokes while Rick nervously handles his hat. Renault, after lighting a new cigarette from the old one, resumes his seat. Rick looks from the floor back to Renault, who presses a button to open the office door, prompting Rick to rise. In a secluded nook, Rick and Ferrari converse over tea served by a waiter. After Ferrari pours Rick a cup, they seal their agreement with a handshake before Rick departs. Ferrari picks up a fly swatter and swats a fly just as a car halts outside the cafe. Inside, Renault surveys the empty cafe while Rick points to his breast pocket at the sound of tires. Renault ascends to Rick's office, where Laszlo pays a cab driver, and Ilsa hesitates at the entrance before following Laszlo inside. Renault peers down from his office as they approach the bar, where Laszlo places his hat on a table and hands the letters to Ilsa, who accepts them gratefully. Hearing footsteps, they turn to find Renault approaching, catching Ilsa and Laszlo off guard and filling Ilsa with horror. Renault, pleased, takes the letters and turns to Rick as Ilsa and Laszlo watch in bewilderment."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He looks at Rick and says nothing as Rick walks to the bar, an iconic gathering spot in Rick's Café Américain, picks up a bottle of bourbon, a favored choice among patrons, and pours a drink, which Laszlo takes with a steady hand. Rick then reaches into his jacket, a tailored piece he often wears, for his cigarette case, opens it, takes out a cigarette, and lights it with a practiced flick of his lighter, before looking away for a moment. Suddenly, there is a CRASH at the door of the café, a bustling hub in Casablanca, Morocco, followed by the forced entry of several gendarmes, French police known for their distinctive uniforms, as a French officer walks in and addresses Laszlo. Laszlo, a prominent figure in the resistance against Nazi occupation, looks at Rick for a moment, then crosses to the officer in dignified silence, and together they walk toward the door. Rick's eyes follow them, but his expression reveals nothing of his feelings, when they are interrupted by an orderly, a young local hired to assist the officers. Renault, the shrewd local police captain, hands some forms to the orderly, who exits, and the conversation continues. Renault sits at his desk and smokes while Rick nervously fingers his hat, a familiar fedora he often wears. Renault gets out of his chair, crosses to the front of his desk, retrieves a fresh cigarette from a box of expensive imports, chain-lights it with the old one, and sits back down. Rick stares at the floor, then looks back up at Renault, who presses a button on his desk, triggering a BUZZER as the door to Renault's office, a place known for secret negotiations, opens and Rick rises to go. A waiter, meticulously dressed in a crisp white shirt and vest, brings tea to Rick and Ferrari, a prominent black market dealer, who sit alone at a table in a secluded nook off the main room, where Ferrari pours a cup for Rick, who takes a sip, then gets up, followed by Ferrari, and they shake hands to seal the deal involving forged travel documents. Rick walks to the door, stops, turns around, and leaves, while Ferrari picks up a fly swatter from the table and swats a fly with practiced ease. A car pulls quickly to a stop just outside the café, its arrival marked by the screech of brakes, on the door of which a huge placard reads in bold letters. Renault looks around the empty café, assessing the situation. Rick points at his breast pocket, indicating where he keeps important papers, before they hear the CRUNCH of tires as a car pulls up. Renault walks up the stairs to Rick's office, a private enclave where many clandestine meetings occur, and Ilsa, an enigmatic figure with a mysterious past, quickly walks toward the entrance as Laszlo pays the cab driver, ensuring no trace is left behind. Ilsa pauses and looks at Rick, unsure for a moment, as Laszlo comes in and closes the door behind himself. Renault opens the office door and peers down at the proceedings, gauging the tension in the air. They all walk towards the bar, where Laszlo deposits his hat on a nearby table, takes out the letters of transit, crucial documents for escape from occupied territories, and hands them to Laszlo, who takes them gratefully. All three hear footsteps and turn to see Renault walking toward them from the bottom of the stairs, catching Ilsa and Laszlo completely off guard, with horror in Ilsa's eyes as she realizes the implications. Renault takes the letters, and they turn toward Rick, bewildered, while Renault is obviously delighted by the situation, seeing an opportunity for leverage."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He looks at Rick and says nothing. as Rick walks to the bar picks up a bottle and pours a drink which Laszlo takes. Rick then reaches in his jacket for his cigarette. case opens it takes out a cigarette and lights it before looking away for a moment. Suddenly there is a CRASH at the door of the cafe followed by the forced entry of several gendarmes. as a French officer walks in and addresses Laszlo who looks at Rick for a moment then crosses to the officer in dignified silence and together they walk toward the door. Rick's eyes follow them but his expression reveals nothing of his feelings when they are interrupted by an orderly. Renault hands some forms to the orderly who exits and the conversation continues. Renault sits at his desk and smokes while Rick nervously fingers his hat. Renault gets out of his chair crosses to the front of his desk retrieves a fresh cigarette from a box chainlights it with the old one and sits back down. Rick stares at the floor then looks back up at Renault who presses a button on his desk triggering a BUZZER as the door to Renault's office opens and Rick rises to go. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. A waiter brings tea to Rick and Ferrari who sit alone at a table in a secluded nook off the main room where Ferrari pours a cup for Rick who takes a sip then gets up followed by Ferrari and they shake hands to seal the deal. Rick walks to the door stops turns around and leaves while Ferrari picks up a fly swatter from the table and swats a fly. A car pulls quickly to a stop just outside the cafe on the door of which a huge placard reads as Renault looks around the empty cafe. Rick points at his breast pocket before they hear the CRUNCH of tires as a car pulls up. Renault walks up the stairs to Rick's office and Ilsa quickly walks toward the entrance as Laszlo pays the cab driver. Ilsa pauses and looks at Rick unsure for a moment. as Laszlo comes in and closes the door behind himself. Renault opens the office door and peers down at the proceedings. They all walk towards the bar where Laszlo deposits his hat on a nearby table takes out the letters and hands them to Laszlo who takes them gratefully. All three hear footsteps and turn to see Renault walking toward them from the bottom of the stairs catching Ilsa and Laszlo completely off guard with horror in Ilsa's eyes. Renault takes the letters and they turn toward Rick bewildered while Renault is obviously delighted by the situation."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He looks at Rick and says nothing. as Rick walks to the bar picks up a bottle and pours a drink which Laszlo takes. Rick then reaches in his jacket for his cigarette. case opens it takes out a cigarette and lights it before looking away for a moment. Suddenly there is a CRASH at the door of the cafe followed by the forced entry of several gendarmes. as a French officer walks in and addresses Laszlo who looks at Rick for a moment then crosses to the officer in dignified silence and together they walk toward the door. Rick's eyes follow them but his expression reveals nothing of his feelings when they are interrupted by an orderly. Renault hands some forms to the orderly who exits and the conversation continues. Renault sits at his desk and smokes while Rick nervously fingers his hat. Renault gets out of his chair crosses to the front of his desk retrieves a fresh cigarette from a box chainlights it with the old one and sits back down. Rick stares at the floor then looks back up at Renault who presses a button on his desk triggering a BUZZER as the door to Renault's office opens and Rick rises to go. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. A waiter brings tea to Rick and Ferrari who sit alone at a table in a secluded nook off the main room where Ferrari pours a cup for Rick who takes a sip then gets up followed by Ferrari and they shake hands to seal the deal. Rick walks to the door stops turns around and leaves while Ferrari picks up a fly swatter from the table and swats a fly. A car pulls quickly to a stop just outside the cafe on the door of which a huge placard reads as Renault looks around the empty cafe. Rick points at his breast pocket before they hear the CRUNCH of tires as a car pulls up. Renault walks up the stairs to Rick's office and Ilsa quickly walks toward the entrance as Laszlo pays the cab driver. Ilsa pauses and looks at Rick unsure for a moment. as Laszlo comes in and closes the door behind himself. Renault opens the office door and peers down at the proceedings. They all walk towards the bar where Laszlo deposits his hat on a nearby table takes out the letters and hands them to Laszlo who takes them gratefully. All three hear footsteps and turn to see Renault walking toward them from the bottom of the stairs catching Ilsa and Laszlo completely off guard with horror in Ilsa's eyes. Renault takes the letters and they turn toward Rick bewildered while Renault is obviously delighted by the situation."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He looks at Rick and says nothing. as Rick walks to the bar picks up a bottle and pours a drink which Laszlo takes. Rick then reaches in his jacket for his cigarette. case opens it takes out a cigarette and lights it before looking away for a moment. Suddenly there is a CRASH at the door of the cafe followed by the forced entry of several gendarmes. as a French officer walks in and addresses Laszlo who looks at Rick for a moment then crosses to the officer in dignified silence and together they walk toward the door. as Laszlo comes in and closes the door behind himself. Renault opens the office door and peers down at the proceedings. They all walk towards the bar where Laszlo deposits his hat on a nearby table takes out the letters and hands them to Laszlo who takes them gratefully. All three hear footsteps and turn to see Renault walking toward them from the bottom of the stairs catching Ilsa and Laszlo completely off guard with horror in Ilsa's eyes. Renault takes the letters and they turn toward Rick bewildered while Renault is obviously delighted by the situation."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He looks at Rick and says nothing. as Rick walks to the bar picks up a bottle and pours a drink which Laszlo takes. Rick then reaches in his jacket for his cigarette. All three hear footsteps and turn to see Renault walking toward them from the bottom of the stairs catching Ilsa and Laszlo completely off guard with horror in Ilsa's eyes. Renault takes the letters and they turn toward Rick bewildered while Renault is obviously delighted by the situation."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The cat glares at Max and mutters quietly as Max skips to the bakery, grabs a spoon, and fills a bowl, which Leo accepts. Max then searches in his bag for his cookie tin, opens it, pulls out a cookie, and munches on it, before glancing away briefly. Abruptly, there is a BANG at the gate of the library, followed by the stumbling entrance of several astronauts, as a British detective strolls in and lectures Leo, who glances at Max briefly, then ambles to the detective in regal silence, and together they saunter toward the threshold. Max's gaze trails them, but his demeanor betrays none of his thoughts, when they are disturbed by a librarian. Taylor hands a few tickets to the librarian, who departs, and the dialogue resumes. Taylor reclines at his hammock and doodles while Max anxiously twirls his umbrella. Taylor rises from his hammock, saunters to the edge of his hammock, fetches a new cookie from a jar, devours it with the previous one, and reclines again. Max gazes at the ceiling, then glances back at Taylor, who pushes a lever on his hammock, causing a CHIME as the entrance to Taylor's patio opens and Max stands to leave. A librarian delivers coffee to Max and Alex, who lounge alone at a booth in a secret alcove off the primary hall, where Alex fills a mug for Max, who takes a sip, then stands up, trailed by Alex, and they clasp hands to finalize the agreement. Max skips to the threshold, pauses, pivots around, and exits, while Alex snatches a book from the booth and bookmarks a page. A bicycle rolls swiftly to a halt just outside the library, on the door of which a large scroll reads, as Taylor surveys the vacant library. Max gestures at his waistcoat pocket before they detect the CRUNCH of sneakers as a bicycle rolls up. Taylor climbs up the ladder to Max's patio, and Mia briskly strides toward the threshold as Leo tips the gondola rower. Mia halts and regards Max, uncertain for a second, as Leo enters and fastens the gate behind himself. Taylor swings the patio gate open and gazes down at the antics. They all meander towards the bakery, where Leo places his umbrella on a nearby chair, retrieves the maps, and hands them to Leo, who accepts them eagerly. All three hear footsteps and pivot to see Taylor sauntering toward them from the bottom of the ladder, catching Mia and Leo completely off guard, with shock in Mia's eyes. Taylor seizes the maps, and they pivot toward Max, bewildered, while Taylor is visibly thrilled by the scene."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Rick silently pours Laszlo a drink at the bar before lighting a cigarette. Suddenly, gendarmes crash through the cafe door, and a French officer approaches Laszlo. In dignified silence, Laszlo joins the officer, casting a brief glance at Rick. Renault enters, hands forms to an orderly, and continues chatting with Rick, who nervously fingers his hat. Renault chain-lights a cigarette and opens the office door for Rick to leave. Later, Rick and Ferrari make a deal over tea, sealing it with a handshake. Rick departs while Ferrari swats a fly. A car arrives outside the cafe with a placard. Renault goes to Rick's office as Ilsa and Laszlo enter. Ilsa hesitates, looking at Rick. Renault appears at the stairs as they approach the bar. Laszlo hands over letters, but Renault gleefully takes them, leaving Ilsa and Laszlo shocked and bewildered."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Renault takes the letters and they turn toward Rick bewildered while Renault is obviously delighted by the situation All three hear footsteps and turn to see Renault walking toward them from the bottom of the stairs catching Ilsa and Laszlo completely off guard with horror in Ilsa's eyes They all walk towards the bar where Laszlo deposits his hat on a nearby table takes out the letters and hands them to Laszlo who takes them gratefully Renault opens the office door and peers down at the proceedings as Laszlo comes in and closes the door behind himself Ilsa pauses and looks at Rick unsure for a moment Renault walks up the stairs to Rick's office and Ilsa quickly walks toward the entrance as Laszlo pays the cab driver Rick points at his breast pocket before they hear the CRUNCH of tires as a car pulls up A car pulls quickly to a stop just outside the cafe on the door of which a huge placard reads as Renault looks around the empty cafe Rick walks to the door stops turns around and leaves while Ferrari picks up a fly swatter from the table and swats a fly A waiter brings tea to Rick and Ferrari who sit alone at a table in a secluded nook off the main room where Ferrari pours a cup for Rick who takes a sip then gets up followed by Ferrari and they shake hands to seal the deal Rick stares at the floor then looks back up at Renault who presses a button on his desk triggering a BUZZER as the door to Renault's office opens and Rick rises to go Renault gets out of his chair crosses to the front of his desk retrieves a fresh cigarette from a box chainlights it with the old one and sits back down Renault sits at his desk and smokes while Rick nervously fingers his hat Renault hands some forms to the orderly who exits and the conversation continues Rick's eyes follow them but his expression reveals nothing of his feelings when they are interrupted by an orderly as a French officer walks in and addresses Laszlo who looks at Rick for a moment then crosses to the officer in dignified silence and together they walk toward the door Suddenly there is a CRASH at the door of the cafe followed by the forced entry of several gendarmes case opens it takes out a cigarette and lights it before looking away for a moment Rick then reaches in his jacket for his cigarette as Rick walks to the bar picks up a bottle and pours a drink which Laszlo takes He looks at Rick and says nothing"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "as Rick walks to the bar picks up a bottle and pours a drink which Laszlo takes He looks at Rick and says nothing case opens it takes out a cigarette and lights it before looking away for a moment Rick then reaches in his jacket for his cigarette as a French officer walks in and addresses Laszlo who looks at Rick for a moment then crosses to the officer in dignified silence and together they walk toward the door Suddenly there is a CRASH at the door of the cafe followed by the forced entry of several gendarmes Renault hands some forms to the orderly who exits and the conversation continues Rick's eyes follow them but his expression reveals nothing of his feelings when they are interrupted by an orderly Renault gets out of his chair crosses to the front of his desk retrieves a fresh cigarette from a box chainlights it with the old one and sits back down Renault sits at his desk and smokes while Rick nervously fingers his hat A waiter brings tea to Rick and Ferrari who sit alone at a table in a secluded nook off the main room where Ferrari pours a cup for Rick who takes a sip then gets up followed by Ferrari and they shake hands to seal the deal Rick stares at the floor then looks back up at Renault who presses a button on his desk triggering a BUZZER as the door to Renault's office opens and Rick rises to go A car pulls quickly to a stop just outside the cafe on the door of which a huge placard reads as Renault looks around the empty cafe Rick walks to the door stops turns around and leaves while Ferrari picks up a fly swatter from the table and swats a fly Renault walks up the stairs to Rick's office and Ilsa quickly walks toward the entrance as Laszlo pays the cab driver Rick points at his breast pocket before they hear the CRUNCH of tires as a car pulls up as Laszlo comes in and closes the door behind himself Ilsa pauses and looks at Rick unsure for a moment They all walk towards the bar where Laszlo deposits his hat on a nearby table takes out the letters and hands them to Laszlo who takes them gratefully Renault opens the office door and peers down at the proceedings Renault takes the letters and they turn toward Rick bewildered while Renault is obviously delighted by the situation All three hear footsteps and turn to see Renault walking toward them from the bottom of the stairs catching Ilsa and Laszlo completely off guard with horror in Ilsa's eyes"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "A waiter brings tea to Rick and Ferrari who sit alone at a table in a secluded nook off the main room where Ferrari pours a cup for Rick who takes a sip then gets up followed by Ferrari and they shake hands to seal the deal Rick walks to the door stops turns around and leaves while Ferrari picks up a fly swatter from the table and swats a fly A car pulls quickly to a stop just outside the cafe on the door of which a huge placard reads as Renault looks around the empty cafe Rick points at his breast pocket before they hear the CRUNCH of tires as a car pulls up Renault walks up the stairs to Rick's office and Ilsa quickly walks toward the entrance as Laszlo pays the cab driver Ilsa pauses and looks at Rick unsure for a moment as Laszlo comes in and closes the door behind himself Renault opens the office door and peers down at the proceedings They all walk towards the bar where Laszlo deposits his hat on a nearby table takes out the letters and hands them to Laszlo who takes them gratefully All three hear footsteps and turn to see Renault walking toward them from the bottom of the stairs catching Ilsa and Laszlo completely off guard with horror in Ilsa's eyes Renault takes the letters and they turn toward Rick bewildered while Renault is obviously delighted by the situation He looks at Rick and says nothing as Rick walks to the bar picks up a bottle and pours a drink which Laszlo takes Rick then reaches in his jacket for his cigarette case opens it takes out a cigarette and lights it before looking away for a moment Suddenly there is a CRASH at the door of the cafe followed by the forced entry of several gendarmes as a French officer walks in and addresses Laszlo who looks at Rick for a moment then crosses to the officer in dignified silence and together they walk toward the door Rick's eyes follow them but his expression reveals nothing of his feelings when they are interrupted by an orderly Renault hands some forms to the orderly who exits and the conversation continues Renault sits at his desk and smokes while Rick nervously fingers his hat Renault gets out of his chair crosses to the front of his desk retrieves a fresh cigarette from a box chainlights it with the old one and sits back down Rick stares at the floor then looks back up at Renault who presses a button on his desk triggering a BUZZER as the door to Renault's office opens and Rick rises to go"
        }
      ]
    }
  ]
}