{
  "ground_truth": "The CAMERA PULLS BACK into Jeff's apartment until his head fills the screen. He is asleep. A shadow of some other person creeps over his face. His eyes start to open. He looks up. The screen is filled with the eyes, nose, and mouth of a woman coming nearer and nearer to the CAMERA to kiss Jeff. The face is more or less in shadow, with a faint light coming onto the profile from the window. The girl kisses Jeff firmly, but not passionately. Then her head moves back an inch or two. She speaks. The two big profiles fill the screen. It moves down until the lips move out of the bottom of the screen, leaving just the eyes filling it. The CAMERA FOLLOWS HER quickly to another lamp. She gets a little farther away from us so that we now see her down to her waist. She turns on the second lamp, and the light shows us that her beauty is not alone in her face. The CAMERA PANS HER over to a third lamp which she turns on. She is now full figure, beautifully groomed and flawless. Her dress is high-style fashion and dramatic evening wear. Jeff looks across the room at her. She does a professional model's turn in the dress, showing off its features. Jeff replies. She laughs pleasantly. She looks down at the long mahogany table beside her, which is littered with a number of his personal effects. Her own handbag is also on the table. As she talks, her eyes scan the table as if she's looking for something specific. Lisa finds what she has been looking for, picks up an old and cracked cigarette box, and examines it as she talks. She turns to look at him and moves toward him, carrying the cigarette box. Lisa faces Jeff in the chair. She turns around quickly and dashes to the door, dropping the cigarette box on the table as she passes, THE CAMERA PANNING with her. She goes up the two steps, stops, and turns back to Jeff. She reaches for the doorknob and turns it. She swings open the door and stands to one side. Framed in the doorway is a middle-aged waiter wearing a white linen pea jacket with a red collar. His reaction is one of tender amusement. He smiles, nods, and enters. He's carrying in one hand a large portable warming oven, and in the other hand an ice bucket containing a bottle of wine covered with a napkin. He goes down the stairs as she follows. He hands her the wine bucket, and she places it on the table. THE CAMERA GOES with both of them as he moves toward the kitchen and she moves to a small bar set in the wall cabinet.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The CAMERA WITHDRAWS BACKWARD into Jeff's dwelling until his head occupies the screen. He is dozing. A silhouette of another individual sneaks over his visage. His eyes commence to open. He glances up. The screen is occupied with the eyes, nose, and mouth of a woman drawing closer and closer to the CAMERA to smooch Jeff. The countenance is more or less in shadow, with a faint glow coming onto the profile from the casement. The girl smooches Jeff solidly, but not ardently. Then her head shifts back an inch or two. She utters. The two large profiles occupy the screen. It shifts down until the lips move out of the bottom of the screen, leaving just the eyes occupying it. The CAMERA TRAILS HER swiftly to another lamp. She gets a little further away from us so that we now observe her down to her waist. She activates the second lamp, and the illumination reveals that her loveliness is not solely in her visage. The CAMERA SWEEPS HER over to a third lamp which she activates. She is now full figure, exquisitely groomed and impeccable. Her garment is high-style couture and dramatic evening attire. Jeff gazes across the chamber at her. She executes a professional model's spin in the garment, showcasing its attributes. Jeff responds. She chuckles agreeably. She glances down at the long mahogany table beside her, which is cluttered with a scope of his personal belongings. Her own handbag is also on the table. As she converses, her eyes scrutinize the table as if she's seeking something particular. Lisa discovers what she has been seeking, lifts an ancient and cracked cigarette container, and inspects it as she converses. She turns to look at him and advances toward him, carrying the cigarette container. Lisa faces Jeff in the chair. She pivots swiftly and rushes to the door, placing the cigarette container on the table as she passes, THE CAMERA TRACKING with her. She ascends the two steps, halts, and turns back to Jeff. She reaches for the doorknob and twists it. She swings open the door and stands to one side. Framed in the doorway is a middle-aged server wearing a white linen pea jacket with a red collar. His reaction is one of gentle amusement. He smiles, nods, and enters. He's carrying in one hand a large portable warming oven, and in the other hand an ice pail containing a bottle of wine shrouded with a napkin. He descends the stairs as she follows. He hands her the wine pail, and she places it on the table. THE CAMERA MOVES with both of them as he advances toward the kitchen and she moves to a small bar set in the wall cabinet."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The CAMERA IS PULLED BACK into Jeff's apartment until his head fills the screen. He is asleep. A shadow of some other person is creeping over his face. His eyes are started to open by him. Up is looked at by him. The screen is filled with the eyes, nose, and mouth of a woman who is coming nearer and nearer to the CAMERA to kiss Jeff. The face is more or less in shadow, with a faint light being cast onto the profile from the window. Jeff is kissed firmly, but not passionately, by the girl. Then an inch or two is moved back by her head. She speaks. The two big profiles are filled in the screen. It is moved down until the lips are moved out of the bottom of the screen, leaving just the eyes filling it. The CAMERA QUICKLY FOLLOWS HER to another lamp. She gets a little farther away from us so that she can now be seen down to her waist. The second lamp is turned on by her, and the light shows us that her beauty is not alone in her face. The CAMERA PANS HER over to a third lamp which is turned on by her. She is now a full figure, beautifully groomed and flawless. Her dress is high-style fashion and dramatic evening wear. She is looked at across the room by Jeff. A professional model's turn in the dress is done by her, showing off its features. He replies. Pleasant laughter is given by her. The long mahogany table beside her, which is littered with a number of his personal effects, is looked down at by her. Her own handbag is also on the table. As she talks, the table is scanned by her eyes as if she's looking for something specific. What she has been looking for is found by Lisa, who picks up an old and cracked cigarette box and examines it as she talks. She turns to look at him and is moved toward by her, carrying the cigarette box. Lisa is faced by Jeff in the chair. She turns quickly around and is dashed to the door by her, dropping the cigarette box on the table as she passes, THE CAMERA PANNING with her. Two steps are gone up by her, stopping, and she turns back to Jeff. The doorknob is reached for by her and turned. The door is swung open by her and she stands to one side. In the doorway is framed a middle-aged waiter wearing a white linen pea jacket with a red collar. One of tender amusement is his reaction. A smile is given by him, nods, and he enters. A large portable warming oven is carried in one hand by him, and in the other hand, an ice bucket containing a bottle of wine covered with a napkin is held. Down the stairs he goes as she follows. The wine bucket is handed to her by him, and it is placed on the table by her. THE CAMERA GOES with both of them as he is moved toward the kitchen by him and the small bar set in the wall cabinet is moved to by her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The CAMERA ZOOMS OUT from Jeff's apartment to reveal him asleep. A shadow falls over his face, and he wakes to see a woman’s face approaching for a kiss. Dim light from the window outlines her as she kisses Jeff lightly. The CAMERA TRACKS HER as she turns on a lamp, revealing her full beauty. She turns on a second lamp, showcasing her elegant evening dress, and Jeff admires her. She models the dress, then scans a cluttered table, searching. Lisa finds and inspects an old cigarette box before approaching Jeff. She pivots, drops the box on the table, and hurries to the door, THE CAMERA FOLLOWING. She opens it for a middle-aged waiter in a white pea jacket with a red collar. He smiles warmly, enters with a warming oven and wine bucket. She follows him, placing the wine on the table as he heads to the kitchen and she goes to a bar in the wall cabinet."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The CAMERA PULLS BACK in Jeff's apartment until his head fills the screen. Asleep, a shadow creeps over his face. His eyes open. A woman's face nears the CAMERA to kiss Jeff. Her face is in shadow, lit faintly by the window. She kisses Jeff firmly, then moves back slightly to speak. Their profiles fill the screen, which moves to just their eyes. THE CAMERA FOLLOWS HER to another lamp, showing her down to her waist. She turns it on, revealing her beauty extends beyond her face. THE CAMERA PANS to a third lamp she turns on, revealing her fully. Her dress is high-fashion evening wear. Jeff watches her, and she models the dress. Jeff replies; she laughs. She scans the table, finds an old cigarette box, examines it, talks, and moves toward Jeff with it. Lisa quickly dashes to the door, dropping the box on the table. THE CAMERA PANS with her to the door. A middle-aged waiter in a white pea jacket with a red collar stands framed in the doorway, tenderly amused. He smiles, nods, and enters with a warming oven and an ice bucket holding wine. He goes downstairs, and she follows, placing the wine on the table. THE CAMERA GOES with them as he heads to the kitchen and she moves to a bar in the wall cabinet."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The CAMERA SLOWLY PULLS BACK to reveal the interior of Jeff's apartment, zooming out until Jeff's head becomes the central focus on the screen. He appears to be in deep slumber. Suddenly, a shadow, belonging to an unknown person, gently creeps over and obscures his face. As Jeff begins to stir, his eyes gradually open, and he directs his gaze upward. The screen becomes completely dominated by the eyes, nose, and mouth of a woman who is moving closer and closer to the CAMERA, intending to give Jeff a kiss. Her face remains mostly cast in shadow, though a faint glimmer of light from the window illuminates her profile slightly. She kisses Jeff firmly, with an assertive touch, but it lacks the intensity of deep passion. Then, her head retreats just an inch or two, and she begins to speak. The camera captures the two prominent profiles filling the entire screen, before it starts to move downward until just their eyes are visible, as the lips disappear out of the lower screen boundary. THE CAMERA QUICKLY FOLLOWS HER as she swiftly moves toward another lamp in the room. She gracefully distances herself from us, allowing us to now see her figure, extending down to her waist. She turns the second lamp on, and the light reveals that her allure extends beyond her facial features alone. THE CAMERA PANS HER gently over to a third lamp, which she also illuminates. Now, she stands in full figure, impeccably groomed and exuding flawlessness. Her dress is of high-style fashion, embodying dramatic evening wear. Jeff casts his gaze across the room to admire her. She performs a professional model's turn in the dress, skillfully highlighting its distinctive features. Jeff responds to her. She chuckles pleasantly in return. Her eyes wander down to the long mahogany table beside her, cluttered with many of Jeff's personal belongings. Her own handbag is resting on the table. As she continues speaking, her eyes scan the table's surface, as though she's searching for something specific. Lisa eventually discovers the object of her search, an old and weathered cigarette box, which she picks up and examines as she converses. She turns to make eye contact with him and approaches him, carrying the cigarette box in hand. Lisa stands facing Jeff as he sits in his chair. She abruptly turns on her heel and swiftly heads toward the door, leaving the cigarette box on the table as she passes by, THE CAMERA PANNING with her motion. She ascends the two steps, comes to a halt, and turns back toward Jeff. She reaches out to grasp the doorknob, giving it a turn. She swings the door open wide and stands to one side. Within the doorway’s frame is revealed a middle-aged waiter, dressed in a crisp white linen pea jacket accented with a red collar. His expression is one of gentle amusement, smiling and nodding as he makes his entrance. In one of his hands, he carries a large portable warming oven, while in the other, he holds an ice bucket containing a wine bottle wrapped in a napkin. He descends the stairs as she follows him. He hands her the wine bucket, which she then places on the table. THE CAMERA MOVES along with both of them as he proceeds towards the kitchen, while she makes her way to a small bar integrated into the wall cabinet."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The CAMERA SLOWLY PULLS BACK from a tight shot to gradually unveil the interior of Jeff's apartment, seamlessly zooming out until Jeff himself becomes the main focal point on the screen. He appears to be in a state of deep and restful slumber. Suddenly, a shadow, belonging to an unidentified person, gently and deliberately creeps over and obscures his face. As Jeff begins to stir from his sleep, his eyes slowly, almost languidly, open, and he directs his gaze upward. The screen then becomes overwhelmingly dominated by the eyes, nose, and mouth of a woman who is, in her approach, moving closer and more intimately toward the CAMERA, clearly intending to give Jeff a kiss. Her face remains mostly concealed in shadow, but a faint, delicate glimmer of light from the nearby window just slightly illuminates her profile. She kisses Jeff with a firm, assertive touch that lacks the fullest intensity of deep passion. Her head then retreats merely an inch or two, and she begins to speak. The camera captures the prominent profiles of both, filling the entire screen, before it slowly commences to move downward until only their eyes remain visible, as the lips disappear beneath the lower boundary of the screen. THE CAMERA QUICKLY FOLLOWS HER as she swiftly moves toward another lamp situated in the room. She gracefully distances herself from the viewer, allowing us now to see her figure extending down to her waist. She gently turns on the second lamp, and the light reveals that her allure is not confined solely to her facial features. THE CAMERA PANS WITH HER gently as she makes her way over to a third lamp, which she also illuminates. Now, she is revealed in full figure, impeccably groomed and exuding a sense of flawlessness. Her dress is a piece of high-style fashion, embodying dramatic and elegant evening wear. Jeff casts his gaze across the room, in admiration of her appearance. She performs a professional model's turn in the dress, skillfully emphasizing its distinctive features. Jeff responds to her with appreciation. She chuckles pleasantly in return. Her eyes then wander downward to the long mahogany table beside her, which is cluttered with many of Jeff's personal belongings. Her own handbag is resting unobtrusively on the table. As she continues speaking, her eyes scan the table's surface, as if she is searching for something specific. Lisa eventually discovers the object of her search, an old and weathered cigarette box, which she picks up and examines as she converses. She turns to make eye contact with him once more, and she approaches him, carrying the cigarette box in her hand. Lisa stands facing Jeff as he remains seated in his chair. She abruptly turns on her heel and swiftly moves toward the door, leaving the cigarette box on the table as she passes by, THE CAMERA PANNING with her fluid motion. She ascends the two steps, comes to a halt, and turns back toward Jeff. She reaches out to grasp the doorknob, turning it with ease. She swings the door open wide and stands to one side to reveal the doorway’s frame, which holds a middle-aged waiter. He is dressed in a crisp white linen pea jacket accented with a striking red collar. His expression is one of gentle amusement, his face graced with a smile as he nods while making his entrance. In one of his hands, he carries a large portable warming oven, while in his other hand, he holds an ice bucket containing a wine bottle, carefully wrapped in a napkin. He descends the stairs as she follows closely behind him. He hands her the wine bucket, which she then places with care on the table. THE CAMERA MOVES along with both of them as he proceeds toward the kitchen area, while she makes her way over to a small bar that is integrated into the wall cabinet."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The CAMERA gently withdraws from a close-up of Jeff's sleeping form, gradually revealing his entire head filling the screen. He remains in peaceful slumber until a shadow, cast by another person, subtly creeps across his face. As the shadow plays upon his features, his eyelids slowly flutter open, awareness dawning in his gaze. He turns his eyes upwards, just in time to see the screen dominated by the approaching eyes, nose, and mouth of a woman who steadily moves closer to the CAMERA, intending to kiss Jeff. The woman’s face, mostly enveloped in shadow except for a faint glow from the window tracing her profile, descends as she places a firm yet unpassionate kiss upon Jeff's lips. Her head then retreats slightly, just an inch or two, and she begins to speak. The CAMERA captures this moment, with their profiles enlarging to fill the frame before it lowers, leading the audience to focus exclusively on the expression in their eyes, while their lips exit the bottom of the screen. Without missing a beat, the CAMERA trails her as she swiftly advances towards another lamp, distancing herself slightly so her form is visible down to the waist. Upon reaching the lamp, she turns it on, the illumination deftly revealing that her allure extends beyond her facial beauty. The CAMERA follows her graceful motion to yet another lamp, which she also lights, now displaying her full figure. She stands impeccably dressed in high-style, dramatic evening wear, her entire appearance beautifully groomed and flawless. Jeff's gaze crosses from his current position to take in her elegant form. In response, she executes a professional model's turn, elegantly showcasing the dress's features. Jeff responds to this display, prompting her to laugh softly. Her eyes wander down to a long mahogany table beside her, cluttered with his personal belongings, including her own handbag. As she speaks, her eyes flit across the tabletop, as if searching for something specific. Her search ends as she picks up an old and cracked cigarette box, examining it thoughtfully while continuing her conversation. She turns to face him again, moving towards him with a purposeful stride, bearing the cigarette box. Facing Jeff, she makes a quick decision, pivoting towards the door with urgency, and as she rushes past, she deftly drops the cigarette box back onto the table, THE CAMERA closely following her movements. Ascending the two steps leading to the door, she halts and turns back towards Jeff, extending her arm to grasp the doorknob, which she turns with a swift motion. The door swings open revealing a middle-aged waiter, framed perfectly in the doorway. He wears a pristine white linen pea jacket, accented by a red collar, exuding an aura of tender amusement. A smile plays across his lips as he acknowledges them with a nod and steps inside. In one hand, he balances a substantial portable warming oven, while the other grips an ice bucket, its contents—a bottle of wine discreetly shrouded with a napkin. Descending the stairs, she trails behind him, seamlessly taking the wine bucket he extends to her, which she then places with care upon the table. THE CAMERA seamlessly accompanies them, capturing their synchronized choreography as he advances towards the kitchen, while she diverts towards a small bar set within the wall cabinet."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The CAMERA PULLS BACK to reveal Jeff asleep in his apartment as a shadow looms over his face. Slowly waking, he sees a woman approaching for a kiss, her face partially lit by the window. She kisses him firmly but without passion and pulls back slightly to speak, their profiles dominating the screen. She moves swiftly to a lamp, turning it on to illuminate her beauty beyond her face. The CAMERA PANS as she turns on another lamp, revealing her full figure in a stylish evening dress. Jeff watches as she performs a model's turn, showcasing the dress. They exchange words, and she laughs while scanning a table cluttered with his belongings and her handbag. Finding an old cigarette box, she examines it while speaking and approaches Jeff with it. Abruptly, she dashes to the door, leaving the cigarette box on the table, and opens the door to reveal a middle-aged waiter. The waiter, amused and smiling, enters with a warming oven and an ice bucket holding a wine bottle. She takes the wine bucket from him and places it on the table as he heads towards the kitchen, while she moves to the bar in the wall cabinet."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The CAMERA PULLS BACK into Jeff's apartment, an upscale space overlooking Manhattan's skyline, until his head fills the screen. He is asleep. A shadow of some other person, briefly obscuring the early morning sunlight filtering through the window, creeps over his face. His eyes start to open. He looks up. The screen is filled with the eyes, nose, and mouth of a woman coming nearer and nearer to the CAMERA to kiss Jeff. The face is more or less in shadow, with a faint light coming onto the profile from the window, hinting at the dawn of a new day. The girl kisses Jeff firmly, but not passionately, suggesting a relationship marked by comfort rather than fiery romance. Then her head moves back an inch or two. She speaks softly, her voice blending into the quiet hum of city life beneath them. The two big profiles fill the screen. It moves down until the lips move out of the bottom of the screen, leaving just the eyes filling it. The CAMERA FOLLOWS HER quickly to another lamp, one designed by a renowned Scandinavian designer known for minimalist aesthetics. She gets a little farther away from us so that we now see her down to her waist. She turns on the second lamp, and the light shows us that her beauty is not alone in her face. The CAMERA PANS HER over to a third lamp which she turns on. She is now full figure, beautifully groomed and flawless, reminiscent of the iconic models seen on the covers of high-fashion magazines. Her dress is high-style fashion and dramatic evening wear, likely from a high-end designer known for luxurious fabrics and elegant cuts. Jeff looks across the room at her. She does a professional model's turn in the dress, showing off its features with practiced poise. Jeff replies. She laughs pleasantly, her laughter echoing like the gentle clinking of glasses at an exclusive gala. She looks down at the long mahogany table beside her, which is littered with a number of his personal effects, including a vintage camera from Jeff's days as a renowned photojournalist. Her own handbag, a limited edition piece from a famous Parisian designer, is also on the table. As she talks, her eyes scan the table as if she's looking for something specific. Lisa finds what she has been looking for, picks up an old and cracked cigarette box, a memento from a distant trip to Havana, and examines it as she talks. She turns to look at him and moves toward him, carrying the cigarette box. Lisa faces Jeff in the chair. She turns around quickly and dashes to the door, dropping the cigarette box on the table as she passes, THE CAMERA PANNING with her. She goes up the two steps, stops, and turns back to Jeff. She reaches for the doorknob, a vintage brass piece installed when the building was first constructed in the 1920s, and turns it. She swings open the door and stands to one side. Framed in the doorway is a middle-aged waiter wearing a white linen pea jacket with a red collar, reminiscent of the classic French service uniform. His reaction is one of tender amusement. He smiles, nods, and enters. He's carrying in one hand a large portable warming oven, known for its ability to keep gourmet dishes at the perfect temperature, and in the other hand an ice bucket containing a bottle of wine covered with a napkin, likely a rare vintage from the Bordeaux region. He goes down the stairs as she follows. He hands her the wine bucket, and she places it on the table. THE CAMERA GOES with both of them as he moves toward the kitchen and she moves to a small bar set in the wall cabinet, stocked with a selection of fine spirits from around the world."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The CAMERA PULLS BACK into Jeff's apartment until his head fills the screen. He is asleep. A shadow of some other person creeps over his face. His eyes start to open. He looks up. The screen is filled with the eyes nose and mouth of a woman coming nearer and nearer to the CAMERA to kiss Jeff. The face is more or less in shadow with a faint light coming onto the profile from the window. The girl kisses Jeff firmly but not passionately. Then her head moves back an inch or two. She speaks. The two big profiles fill the screen. It moves down until the lips move out of the bottom of the screen leaving just the eyes filling it. The CAMERA FOLLOWS HER quickly to another lamp. She gets a little farther away from us so that we now see her down to her waist. She turns on the second lamp and the light shows us that her beauty is not alone in her face. The CAMERA PANS HER over to a third lamp which she turns on. She is now full figure beautifully groomed and flawless. Her dress is highstyle fashion and dramatic evening wear. Jeff looks across the room at her. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. She does a professional model's turn in the dress showing off its features. Jeff replies. She laughs pleasantly. She looks down at the long mahogany table beside her which is littered with a number of his personal effects. Her own handbag is also on the table. As she talks her eyes scan the table as if she is looking for something specific. Lisa finds what she has been looking for picks up an old and cracked cigarette box and examines it as she talks. She turns to look at him and moves toward him carrying the cigarette box. Lisa faces Jeff in the chair. She turns around quickly and dashes to the door dropping the cigarette box on the table as she passes THE CAMERA PANNING with her. She goes up the two steps stops and turns back to Jeff. She reaches for the doorknob and turns it. She swings open the door and stands to one side. Framed in the doorway is a middleaged waiter wearing a white linen pea jacket with a red collar. His reaction is one of tender amusement. He smiles nods and enters. He is carrying in one hand a large portable warming oven and in the other hand an ice bucket containing a bottle of wine covered with a napkin. He goes down the stairs as she follows. He hands her the wine bucket and she places it on the table. THE CAMERA GOES with both of them as he moves toward the kitchen and she moves to a small bar set in the wall cabinet."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The CAMERA PULLS BACK into Jeff's apartment until his head fills the screen. He is asleep. A shadow of some other person creeps over his face. His eyes start to open. He looks up. The screen is filled with the eyes nose and mouth of a woman coming nearer and nearer to the CAMERA to kiss Jeff. The face is more or less in shadow with a faint light coming onto the profile from the window. The girl kisses Jeff firmly but not passionately. Then her head moves back an inch or two. She speaks. The two big profiles fill the screen. It moves down until the lips move out of the bottom of the screen leaving just the eyes filling it. The CAMERA FOLLOWS HER quickly to another lamp. She gets a little farther away from us so that we now see her down to her waist. She turns on the second lamp and the light shows us that her beauty is not alone in her face. The CAMERA PANS HER over to a third lamp which she turns on. She is now full figure beautifully groomed and flawless. Her dress is highstyle fashion and dramatic evening wear. Jeff looks across the room at her. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. She does a professional model's turn in the dress showing off its features. Jeff replies. She laughs pleasantly. She looks down at the long mahogany table beside her which is littered with a number of his personal effects. Her own handbag is also on the table. As she talks her eyes scan the table as if she is looking for something specific. Lisa finds what she has been looking for picks up an old and cracked cigarette box and examines it as she talks. She turns to look at him and moves toward him carrying the cigarette box. Lisa faces Jeff in the chair. She turns around quickly and dashes to the door dropping the cigarette box on the table as she passes THE CAMERA PANNING with her. She goes up the two steps stops and turns back to Jeff. She reaches for the doorknob and turns it. She swings open the door and stands to one side. Framed in the doorway is a middleaged waiter wearing a white linen pea jacket with a red collar. His reaction is one of tender amusement. He smiles nods and enters. He is carrying in one hand a large portable warming oven and in the other hand an ice bucket containing a bottle of wine covered with a napkin. He goes down the stairs as she follows. He hands her the wine bucket and she places it on the table. THE CAMERA GOES with both of them as he moves toward the kitchen and she moves to a small bar set in the wall cabinet."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The CAMERA PULLS BACK into Jeff's apartment until his head fills the screen. He is asleep. A shadow of some other person creeps over his face. His eyes start to open. He looks up. The screen is filled with the eyes nose and mouth of a woman coming nearer and nearer to the CAMERA to kiss Jeff. The face is more or less in shadow with a faint light coming onto the profile from the window. The girl kisses Jeff firmly but not passionately. Then her head moves back an inch or two. She speaks. She goes up the two steps stops and turns back to Jeff. She reaches for the doorknob and turns it. She swings open the door and stands to one side. Framed in the doorway is a middleaged waiter wearing a white linen pea jacket with a red collar. His reaction is one of tender amusement. He smiles nods and enters. He is carrying in one hand a large portable warming oven and in the other hand an ice bucket containing a bottle of wine covered with a napkin. He goes down the stairs as she follows. He hands her the wine bucket and she places it on the table. THE CAMERA GOES with both of them as he moves toward the kitchen and she moves to a small bar set in the wall cabinet."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The CAMERA PULLS BACK into Jeff's apartment until his head fills the screen. He is asleep. A shadow of some other person creeps over his face. His eyes start to open. He is carrying in one hand a large portable warming oven and in the other hand an ice bucket containing a bottle of wine covered with a napkin. He goes down the stairs as she follows. He hands her the wine bucket and she places it on the table. THE CAMERA GOES with both of them as he moves toward the kitchen and she moves to a small bar set in the wall cabinet."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The CAMERA DRIFTS FORWARD into Harry's greenhouse until his hand fills the frame. He is alert. A shadow of some other creature slithers over his feet. His toes start to wiggle. He glances down. The screen is filled with the wings, beak, and talons of an eagle diving closer and closer to the CAMERA to peck Harry. The beak is more or less in sunlight, with a bright beam flashing onto the silhouette from the lantern. The bird pecks Harry softly, but not gently. Then its wings flap back a foot or two. It screeches. The two giant silhouettes fill the frame. It drifts up until the feathers move out of the top of the screen, leaving just the talons filling it. The CAMERA FOLLOWS IT slowly to another branch. It perches a little farther away from us so that we now see it down to its tail. It turns on the third branch, and the shadow reveals to us that its majesty is not only in its beak. The CAMERA PANS IT over to a fourth branch which it lands on. It is now full bird, dramatically poised and fearless. Its plumage is top-grade flair and bold wilderness attire. Harry stares across the greenhouse at it. It does a victorious predator's flap with its wings, showcasing its prowess. Harry groans. It caws triumphantly. It glances up at the tall oak wardrobe beside it, which is cluttered with a myriad of his garden tools. Its own perch is also on the wardrobe. As it screeches, its talons scrape the wardrobe as if it's searching for something peculiar. Max discovers what he has been seeking, snatches up an ancient and battered toolbox, and inspects it as he squawks. He turns to glance at it and swoops toward it, gripping the toolbox. Max confronts Harry on the bench. He spins around swiftly and bolts to the tunnel, dropping the toolbox on the wardrobe as he passes, THE CAMERA GLIDING with him. He flutters up the four branches, halts, and crumbles back to Harry. He reaches for the trapdoor and nudges it. He flings open the hatch and perches to one direction. Framed in the hatchway is a young gardener dressed in a blue cotton apron with a green hem. Her expression is one of gentle curiosity. She giggles, winks, and exits. She's holding in one claw a small portable cooling fan, and in the other claw a basket containing a stack of seeds wrapped with a leaf. She flutters down the trunk as he chases. She hands him the seed basket, and he places it on the wardrobe. THE CAMERA FOLLOWS with both of them as she heads toward the conservatory and he maneuvers to a large shelf set in the corner alcove."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The camera pulls back to reveal Jeff asleep in his apartment, a shadow cast over his face as a woman's face comes into view to kiss him gently. Her face is partially lit, revealing her beauty. She turns on lamps, displaying her stylish evening dress and flawless appearance. Lisa, the woman, performs a model's turn, eliciting a response from Jeff that makes her laugh. She looks through Jeff's personal effects on a table, finds an old cigarette box, and examines it while conversing with him. Suddenly, Lisa rushes to the door, dropping the cigarette box. She opens the door to reveal a middle-aged waiter, who enters with an oven and a wine bucket. Lisa takes the wine, places it on the table, and moves to the bar as the waiter heads to the kitchen."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "THE CAMERA GOES with both of them as he moves toward the kitchen and she moves to a small bar set in the wall cabinet He hands her the wine bucket and she places it on the table He goes down the stairs as she follows He is carrying in one hand a large portable warming oven and in the other hand an ice bucket containing a bottle of wine covered with a napkin He smiles nods and enters His reaction is one of tender amusement Framed in the doorway is a middleaged waiter wearing a white linen pea jacket with a red collar She swings open the door and stands to one side She reaches for the doorknob and turns it She goes up the two steps stops and turns back to Jeff She turns around quickly and dashes to the door dropping the cigarette box on the table as she passes THE CAMERA PANNING with her Lisa faces Jeff in the chair She turns to look at him and moves toward him carrying the cigarette box Lisa finds what she has been looking for picks up an old and cracked cigarette box and examines it as she talks As she talks her eyes scan the table as if she is looking for something specific Her own handbag is also on the table She looks down at the long mahogany table beside her which is littered with a number of his personal effects She laughs pleasantly Jeff replies She does a professional model's turn in the dress showing off its features Jeff looks across the room at her Her dress is highstyle fashion and dramatic evening wear She is now full figure beautifully groomed and flawless The CAMERA PANS HER over to a third lamp which she turns on She turns on the second lamp and the light shows us that her beauty is not alone in her face She gets a little farther away from us so that we now see her down to her waist The CAMERA FOLLOWS HER quickly to another lamp It moves down until the lips move out of the bottom of the screen leaving just the eyes filling it The two big profiles fill the screen She speaks Then her head moves back an inch or two The girl kisses Jeff firmly but not passionately The face is more or less in shadow with a faint light coming onto the profile from the window The screen is filled with the eyes nose and mouth of a woman coming nearer and nearer to the CAMERA to kiss Jeff He looks up His eyes start to open A shadow of some other person creeps over his face He is asleep The CAMERA PULLS BACK into Jeff's apartment until his head fills the screen"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He is asleep The CAMERA PULLS BACK into Jeff's apartment until his head fills the screen His eyes start to open A shadow of some other person creeps over his face The screen is filled with the eyes nose and mouth of a woman coming nearer and nearer to the CAMERA to kiss Jeff He looks up The girl kisses Jeff firmly but not passionately The face is more or less in shadow with a faint light coming onto the profile from the window She speaks Then her head moves back an inch or two It moves down until the lips move out of the bottom of the screen leaving just the eyes filling it The two big profiles fill the screen She gets a little farther away from us so that we now see her down to her waist The CAMERA FOLLOWS HER quickly to another lamp The CAMERA PANS HER over to a third lamp which she turns on She turns on the second lamp and the light shows us that her beauty is not alone in her face Her dress is highstyle fashion and dramatic evening wear She is now full figure beautifully groomed and flawless She does a professional model's turn in the dress showing off its features Jeff looks across the room at her She laughs pleasantly Jeff replies Her own handbag is also on the table She looks down at the long mahogany table beside her which is littered with a number of his personal effects Lisa finds what she has been looking for picks up an old and cracked cigarette box and examines it as she talks As she talks her eyes scan the table as if she is looking for something specific Lisa faces Jeff in the chair She turns to look at him and moves toward him carrying the cigarette box She goes up the two steps stops and turns back to Jeff She turns around quickly and dashes to the door dropping the cigarette box on the table as she passes THE CAMERA PANNING with her She swings open the door and stands to one side She reaches for the doorknob and turns it His reaction is one of tender amusement Framed in the doorway is a middleaged waiter wearing a white linen pea jacket with a red collar He is carrying in one hand a large portable warming oven and in the other hand an ice bucket containing a bottle of wine covered with a napkin He smiles nods and enters He hands her the wine bucket and she places it on the table He goes down the stairs as she follows THE CAMERA GOES with both of them as he moves toward the kitchen and she moves to a small bar set in the wall cabinet"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Jeff replies She laughs pleasantly She looks down at the long mahogany table beside her which is littered with a number of his personal effects Her own handbag is also on the table As she talks her eyes scan the table as if she is looking for something specific Lisa finds what she has been looking for picks up an old and cracked cigarette box and examines it as she talks She turns to look at him and moves toward him carrying the cigarette box Lisa faces Jeff in the chair She turns around quickly and dashes to the door dropping the cigarette box on the table as she passes THE CAMERA PANNING with her She goes up the two steps stops and turns back to Jeff She reaches for the doorknob and turns it She swings open the door and stands to one side Framed in the doorway is a middleaged waiter wearing a white linen pea jacket with a red collar His reaction is one of tender amusement He smiles nods and enters He is carrying in one hand a large portable warming oven and in the other hand an ice bucket containing a bottle of wine covered with a napkin He goes down the stairs as she follows He hands her the wine bucket and she places it on the table THE CAMERA GOES with both of them as he moves toward the kitchen and she moves to a small bar set in the wall cabinet The CAMERA PULLS BACK into Jeff's apartment until his head fills the screen He is asleep A shadow of some other person creeps over his face His eyes start to open He looks up The screen is filled with the eyes nose and mouth of a woman coming nearer and nearer to the CAMERA to kiss Jeff The face is more or less in shadow with a faint light coming onto the profile from the window The girl kisses Jeff firmly but not passionately Then her head moves back an inch or two She speaks The two big profiles fill the screen It moves down until the lips move out of the bottom of the screen leaving just the eyes filling it The CAMERA FOLLOWS HER quickly to another lamp She gets a little farther away from us so that we now see her down to her waist She turns on the second lamp and the light shows us that her beauty is not alone in her face The CAMERA PANS HER over to a third lamp which she turns on She is now full figure beautifully groomed and flawless Her dress is highstyle fashion and dramatic evening wear Jeff looks across the room at her She does a professional model's turn in the dress showing off its features"
        }
      ]
    }
  ]
}