{
  "ground_truth": "The Colonel grabs him by the collar and glances toward the window, where Jane peeks out from behind the drape and quickly pulls it shut. Suddenly, deeply shamed, the Colonel stands, still breathing heavily, and leaves. Ricky gets up, goes to his bureau, and looks at his reflection in the mirror. He calmly takes a cloth and starts to wipe the blood from his face. Meanwhile, Carolyn, wearing protective headgear, is holding a Glock 19 automatic revolver with both hands and firing it directly at us. She empties a round and stands there, exhilarated, as an attendant approaches with a new round of ammunition, and she starts firing again. Her face loses its usual resolute determination; she is actually enjoying herself spontaneously, and the lack of her usual self-consciousness allows us to see just how beautiful she is. The Glock 19 sits on the passenger seat amid some CDs as the Mercedes turns onto Robin Hood Trail and we turn into the Burnham driveway, where a 1970 Pontiac Firebird with racing stripes blocks our access to the garage. The room seems changed: sloppier, more lived in. Lester is sprawled on the couch in his underwear, drinking a beer and controlling the car, as his remote-controlled model jeep zooms across the floor of the family room, expertly maneuvering corners and narrowly avoiding crashing. She just stands there, staring at Lester, whose working out is beginning to produce results. He smiles at her playfully with the same look she had at the beginning, when he dropped his briefcase, but whatever power that look had is gone. Lester just laughs, and his face is close to hers, suddenly charging the atmosphere. She pulls back automatically, but it's clear she's drawn to him as he smiles and moves even closer, holding his beer loosely balanced. Then, just before their lips meet, she's immediately sorry she said it, but it's too late; his smile fades, and the moment is gone. He stands and gestures toward all the things in the room. Carolyn stares at him, on the verge of tears, then turns and walks out of the room before he can see her cry. Jane lays in Ricky's bed, wearing a tank top, and glances at us. We're watching the wide-screen TV in Ricky's room, where a cord leads from the TV to Ricky's digicam. Ricky holds the camera, standing naked, and aims his camera at Jane as she gets out of bed, takes his digicam, and focuses it on him. We see his image on the TV as she videotapes, and Jane zooms in on his face, which remains placid. Ricky smiles and grabs a half-smoked joint from an ashtray and lights it.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The Officer seizes him by the neckline and glances toward the pane, where Jane peers out from behind the curtain and swiftly pulls it shut. Suddenly, profoundly humiliated, the Officer stands, still inhaling deeply, and departs. Ricky rises, goes to his dresser, and observes his likeness in the looking glass. He serenely takes a rag and starts to clean the gore from his visage. Meanwhile, Carolyn, wearing protective headgear, is holding a Glock 19 automatic pistol with both hands and shooting it directly at us. She unloads a clip and stands there, exhilarated, as an attendant approaches with a new clip of ammunition, and she starts shooting again. Her face loses its usual steadfast resolve; she is actually enjoying herself spontaneously, and the absence of her usual self-consciousness allows us to see just how beautiful she is. The Glock 19 rests on the passenger seat amid some CDs as the Mercedes turns onto Robin Hood Trail and we turn into the Burnham driveway, where a 1970 Pontiac Firebird with racing stripes obstructs our access to the garage. The room seems altered: messier, more inhabited. Lester is sprawled on the couch in his underwear, drinking a beer and controlling the vehicle, as his remote-controlled model jeep zooms across the floor of the family room, expertly maneuvering corners and narrowly avoiding crashing. She just stands there, staring at Lester, whose exercising is beginning to yield results. He grins at her playfully with the same expression she had at the beginning, when he dropped his briefcase, but whatever influence that expression had is gone. Lester just laughs, and his face is close to hers, suddenly charging the atmosphere. She pulls back instinctively, but it's clear she's drawn to him as he grins and moves even closer, holding his beer loosely balanced. Then, just before their lips meet, she's immediately regretful she said it, but it's too late; his grin fades, and the moment is gone. He stands and gestures toward all the items in the room. Carolyn stares at him, on the brink of tears, then turns and walks out of the room before he can see her weep. Jane lies in Ricky's bed, wearing a tank top, and glances at us. We're watching the wide-screen TV in Ricky's room, where a cord leads from the TV to Ricky's digicam. Ricky holds the camera, standing unclothed, and aims his camera at Jane as she gets out of bed, takes his digicam, and focuses it on him. We see his image on the TV as she records, and Jane zooms in on his face, which remains calm. Ricky grins and grabs a half-smoked joint from an ashtray and lights it."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The Colonel is grabbed by the collar, and a glance is given toward the window by him, where Jane peeks out from behind the drape and quickly pulls it shut. Suddenly, deeply shamed, standing is done by the Colonel, still breathing heavily, and he leaves. Ricky is gotten up by himself, and his bureau is gone to, and his reflection is looked at in the mirror. A cloth is calmly taken by him, and the blood is started to be wiped from his face. Meanwhile, Carolyn, wearing protective headgear, holds a Glock 19 automatic revolver with both hands and fires it directly at us. A round is emptied by her, and she stands there, exhilarated, as an attendant approaches with a new round of ammunition, and firing is started again by her. The usual resolute determination is lost from her face; actually enjoying herself spontaneously is done by her, and just how beautiful she is, is seen because of the lack of her usual self-consciousness. The Glock 19 is sitting on the passenger seat amid some CDs as the Mercedes turns onto Robin Hood Trail and the Burnham driveway is turned into by us, where a 1970 Pontiac Firebird with racing stripes blocks our access to the garage. The room is changed: sloppier, more lived in. The couch is sprawled on by Lester in his underwear, drinking a beer, and the car is controlled by him, as his remote-controlled model jeep zooms across the floor of the family room, expertly maneuvering corners and narrowly avoiding crashing. Lester is just stared at by her, whose working out is beginning to produce results. A playful smile is given to her by him with the same look she had at the beginning when the briefcase was dropped by him, but whatever power that look had is gone. Laughter is just done by Lester, and his face is close to hers, suddenly charging the atmosphere. Automatic pulling back is done by her, but it's clear she's drawn to him as a smile is given by him and moving even closer is done, holding his beer loosely balanced. Then, just before their lips meet, immediate regret for saying it is felt by her, but it's too late; the fading of his smile occurs, and the moment is gone. Standing and a gesture toward all the things in the room are done by him. Carolyn stares at him, on the verge of tears, then turning and walking out of the room is done by her before she can be seen crying by him. Jane lays in Ricky's bed, wearing a tank top, and glances at us. We're watching the wide-screen TV in Ricky's room, where a cord leads from the TV to Ricky's digicam. The camera is held by Ricky, as he stands naked, and aiming his camera at Jane is done when she gets out of bed, takes his digicam, and focuses it on him. His image is seen on the TV as videotaping is done by her, and his face, which remains placid, is zoomed in on by Jane. A smile is given by Ricky, and a half-smoked joint is grabbed from an ashtray and lit by him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The Colonel seizes him by the collar and looks toward the window, where Jane peeks out and quickly shuts the drape. Deeply shamed, the Colonel leaves. Ricky rises, checks his reflection, and calmly wipes the blood from his face. Meanwhile, Carolyn, wearing headgear, fires a Glock 19 automatic revolver, empties a round, and, exhilarated, reloads with an attendant's help. She enjoys herself spontaneously, showing her beauty. The Glock 19 sits in the passenger seat as the Mercedes turns onto Robin Hood Trail, leading to the Burnham driveway, where a 1970 Pontiac Firebird with racing stripes blocks the garage. The room feels more lived-in. Lester, in underwear, drinks beer as his model jeep expertly zooms across the family room floor. She stares at Lester, whose fitness is showing results. He smiles playfully, but the moment's power is lost. Their faces close, charging the atmosphere, but she pulls back, drawn yet sorry. His smile fades, and the moment is gone. He stands, gesturing around, and Carolyn, nearly in tears, leaves before he sees her cry. Jane lies in Ricky's bed, glancing at us. We're watching TV in Ricky's room, connected to his digicam. Ricky, naked, aims the camera at Jane as she gets up, takes his digicam, and focuses on him. His image appears on TV; she zooms in on his placid face. Ricky smiles, grabs a joint, and lights it."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The Colonel seizes him by the collar and glances at the window, where Jane peeks and quickly shuts the drape. Ashamed, the Colonel exits. Ricky, looking into his bureau mirror, calmly wipes his face blood. Carolyn, in protective headgear, fires a Glock 19 automatic revolver, then reloads and enjoys the experience, revealing her beauty. The Glock, among CDs, sits on the passenger seat as the Mercedes turns onto Robin Hood Trail into the Burnham driveway, blocked by a 1970 Pontiac Firebird. The room now appears messier. Lester, in underwear, drinks beer while skillfully maneuvering a remote-controlled jeep. She watches Lester, whose physique is improving, and his playful smile draws her in. As their lips nearly meet, she regrets her words, and the moment's lost. He gestures around the room; Carolyn, near tears, leaves before he notices. Jane, in Ricky's bed, glances at us while watching the wide-screen TV linked to Ricky's digicam. Ricky, holding the camera naked, films Jane as she gets up, takes the camera, and focuses on him. She zooms in on his face, placid, as he lights a joint."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The Colonel forcefully grabs him by the collar and directs his glance toward the nearby window. There, Jane is momentarily visible as she peeks out from behind the drape, only to quickly pull it shut upon being noticed. Suddenly, overwhelmed by a profound sense of shame, the Colonel stands motionless for a moment, still breathing heavily, before he decides to leave the scene. Ricky then rises to his feet, walks over to his bureau, and gazes thoughtfully at his own reflection in the mirror. Maintaining his composure, he picks up a cloth and begins to carefully wipe the blood from his face.\n\nSimultaneously, Carolyn, dressed in protective headgear, is gripping a Glock 19 automatic revolver with both hands and aiming it directly in our direction. Excitement fills the air as she empties a round, standing there exhilarated, while an attendant comes forward with a new round of ammunition for her. She eagerly starts firing once more. Her facial expression shifts from its usual resolute determination to one of genuine enjoyment; normally self-conscious, she now reveals a natural beauty that is rarely seen. The Glock 19 rests prominently on the passenger seat amidst a collection of CDs as the sleek Mercedes smoothly turns onto Robin Hood Trail. We then make our way into the Burnham driveway, only to find that our path to the garage is obstructed by a 1970 Pontiac Firebird with striking racing stripes. \n\nThe room appears altered: it feels messier, more lived in, as Lester lies sprawled on the couch in nothing but his underwear, casually drinking a beer. With a remote control in hand, he skillfully drives a small, remote-controlled model jeep across the floor of the family room, expertly navigating corners and narrowly avoiding crashing into obstacles. She simply stands there, fixated on Lester, whose dedication to working out is starting to yield noticeable results. He playfully smiles at her, reminiscent of the look she initially gave him when he dropped his briefcase, yet whatever power that look once held has now dissipated. Lester bursts into laughter, bringing his face closer to hers, charging the atmosphere with an unexpected intensity. She involuntarily pulls back, yet it's evident she is undeniably drawn to him as he continues to smile and inch closer, holding his beer with a casual balance. Then, just moments before their lips are about to meet, she instantly regrets having said it, but it’s too late to retract; his smile fades away, and the magic of the moment is irretrievably lost. He stands up and gestures broadly toward the entirety of the room. Carolyn gazes at him, her eyes brimming with tears, on the brink of crying, and then she turns and departs from the room before he has the chance to witness her vulnerability.\n\nJane is lying comfortably in Ricky's bed, wearing a simple tank top, and casts a glance in our direction. We find ourselves watching the wide-screen TV in Ricky's room, where a cord is visibly connecting the TV to Ricky's digicam. Ricky, standing there naked, holds the camera with a steady hand and aims it directly at Jane. As she gets up from the bed, she takes hold of his digicam and then focuses it back on him. We watch as his image appears on the TV while she videotapes, and Jane zooms in closely on his face, which remains calm and placid. Ricky then smiles warmly and reaches for a half-smoked joint from an ashtray, lighting it as he takes a deep, satisfying puff."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The Colonel, with a firm and forceful grip, seizes him by the collar and directs his gaze toward the nearby window. Through this window, Jane is fleetingly visible as she cautiously peeks out from behind the drape. However, upon realizing she has been spotted, she quickly pulls the curtain shut, disappearing from view. At that moment, overwhelmed by a deep and profound sense of shame, the Colonel stands there motionless for a brief period, still breathing heavily. After pausing in thought, he finally decides to leave the scene. Ricky then gradually rises to his feet and makes his way over to his bureau. There, he gazes thoughtfully at his own reflection in the mirror. With his composure intact, he picks up a cloth and begins the careful task of wiping the blood from his face.\n\nMeanwhile, Carolyn, dressed in protective headgear, is gripping a Glock 19 automatic revolver securely with both hands, aiming it directly in our direction. The air is charged with excitement as she confidently empties a round, standing there exhilarated. An attendant promptly comes forward, bringing a fresh round of ammunition for her eager use. She immediately resumes firing, her demeanor shifting from resolute determination to one of genuine enjoyment. Typically self-conscious, she now exudes a natural beauty rarely seen. The Glock 19 rests prominently on the passenger seat, nestled among a collection of CDs, as the sleek Mercedes makes a smooth turn onto Robin Hood Trail. We proceed into the Burnham driveway, only to encounter an obstruction—a striking 1970 Pontiac Firebird adorned with bold racing stripes blocking our path to the garage.\n\nThe room now appears altered in its atmosphere; it feels messier and more lived in as Lester lies sprawled out on the couch, clad in nothing but his underwear, casually sipping a beer. With a remote control in hand, he skillfully maneuvers a small, remote-controlled model jeep across the family room floor, expertly navigating around corners and narrowly avoiding potential obstacles. She stands there, her gaze fixed on Lester, whose dedication to physical fitness is starting to yield noticeable results. He flashes her a playful smile, reminiscent of the look she initially gave him when he dropped his briefcase, yet the power that look once held has now lost its impact. Lester bursts into laughter, leaning in closer to her, which charges the atmosphere with unexpected intensity. She involuntarily recoils, yet it’s evident that she is undeniably drawn to him as he inches closer, maintaining a casual balance with his beer in hand. However, just moments before their lips are about to meet, she immediately regrets her words, but it’s too late to take them back; his smile fades away, and the magic of the moment is irretrievably lost. He stands up, gestures broadly to encompass the entire room, and Carolyn gazes at him, her eyes shimmering with tears, on the verge of crying. She then turns and leaves the room before he has the chance to see her vulnerable state.\n\nJane is lying comfortably in Ricky's bed, clad in a simple tank top, and casts a glance in our direction. Our attention is drawn to the wide-screen TV in Ricky's room, visibly connected to Ricky's digicam by a cord. Ricky, standing there naked, holds the camera with a steady hand and directs it at Jane. As she gets up from the bed, she takes hold of his digicam and then redirects it back at him. We watch as his image appears on the TV screen while she records him, zooming in closely on his face, which remains calm and placid. Ricky smiles warmly and reaches for a half-smoked joint resting in an ashtray, lighting it and taking a deep, satisfying puff."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The Colonel, with a firm grip, seizes him by the collar, a burst of intensity in his actions, while simultaneously casting a quick glance toward the window. There, Jane, partially hidden, peers out cautiously from behind the drape, only to react swiftly by pulling it shut, her movements quick and deliberate. Unexpectedly, a deep sense of shame washes over the Colonel, causing him to stand abruptly despite his heavy breathing, and with an air of defeat, he turns to leave the room. Ricky, now alone, begins to lift himself from his current position and makes his way to the bureau, a slow and measured walk across the room. Upon reaching the bureau, he stands and gazes intently at his reflection in the mirror, taking a moment to confront the image staring back. With a composed demeanor, he reaches for a cloth, bringing it up with careful intent to his face, and starts to meticulously wipe away the blood, each stroke deliberate and steady. Meanwhile, in a contrasting scene, Carolyn dons protective headgear, showcasing her readiness and focus. She firmly grips the Glock 19 automatic revolver with both hands, exuding confidence as she aligns her shot and begins firing directly toward the camera. With precision, she empties the current round and pauses momentarily, standing in a state of exhilaration. An attendant approaches her, wordlessly offering a new round of ammunition, and without hesitation, she resumes her shooting, the rhythm of her actions smooth and practiced. During this process, her typical resolute determination softens momentarily, revealing a spontaneous enjoyment that transforms her face, allowing an unguarded beauty to emerge. Elsewhere, the Glock 19 finds itself resting on the passenger seat amid a collection of CDs as the Mercedes makes a smooth turn onto Robin Hood Trail. The car continues its journey, eventually turning into the Burnham driveway, where a 1970 Pontiac Firebird, adorned with striking racing stripes, obstructs access to the garage, presenting a minor yet noticeable obstacle. Inside, the atmosphere of the room has shifted, appearing messier and more lived in than before. Lester is sprawled comfortably on the couch, dressed only in his underwear, with a beer in hand, revealing a relaxed demeanor. In his grip, he holds the controls as a remote-controlled model jeep zips energetically across the floor of the family room, navigating corners with expert precision and narrowly avoiding collisions without breaking his focus. She stands still, her gaze locked on Lester, absorbed by the sight of him. Observing the physical changes from his recent workouts, which are now beginning to show results, he meets her gaze with a playful smile, reminiscent of the look he once gave when he dropped his briefcase—a look that has, over time, lost its previous power. Nonetheless, Lester responds with a carefree laugh, his face drawing closer to hers, creating a charged atmosphere between them. Involuntarily, she pulls back slightly, yet the attraction is unmistakable as he edges even closer, his grip on the beer relaxed and easy. As their lips inch nearer, a sudden regret surfaces in her mind, but it's too late; his smile fades, the previous magic of the moment dissipating into the air. He rises to his feet and gestures broadly toward the various items scattered in the room, inviting her to observe them. Carolyn, on the verge of tears, finds herself caught in the moment, staring at him helplessly before choosing to turn away, her feet carrying her out of the room swiftly to prevent him from witnessing her impending tears. Meanwhile, in another setting, Jane is reclined in Ricky's bed, clad casually in a tank top. She shifts her gaze toward us, a subtle acknowledgment, as we find ourselves watching the wide-screen TV in Ricky's room. A cord extends from the TV, leading directly to Ricky's digicam, linking the two pieces of technology. Ricky, standing completely unclothed, holds the camera with intent, aiming it toward Jane as she rises from the bed. She takes the digicam from him, flipping the roles, and focuses it on him, capturing his image. His likeness appears on the TV as she continues to videotape, with Jane expertly zooming in to highlight his placid facial expression. In response, Ricky breaks into a smile, a sense of calm washing over him as he reaches for a half-smoked joint resting in an ashtray nearby and lights it, completing the sequence of calm, intimate actions."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The Colonel, feeling deeply shamed after a tense encounter with Ricky, leaves abruptly while Ricky calmly cleans his bloodied face. Meanwhile, Carolyn, exhilarated and uncharacteristically carefree, fires a Glock 19 at a shooting range, revealing a spontaneous beauty as an attendant resupplies her ammunition. As a Mercedes navigates into the Burnham driveway, obstructed by a Pontiac Firebird, the scene shifts indoors where Lester, lounging in his underwear, plays with a remote-controlled jeep, laughing and teasing Carolyn with a playful smile that ultimately fizzles. She retreats, teary-eyed, leaving before her emotions are exposed. Elsewhere, Jane, in Ricky's bed, observes us as Ricky films her with his digicam. She takes over, zooming in on his placid face shown on the TV, while Ricky casually lights a joint, retaining a serene demeanor."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The Colonel, a retired military officer known for his strict demeanor, grabs him by the collar and glances toward the window, where Jane, his daughter who recently turned 16 and often feels trapped in their large, isolated house, peeks out from behind the drape and quickly pulls it shut. Suddenly, deeply shamed by an unspoken past, the Colonel stands, still breathing heavily, and leaves the room. Ricky, who has recently been trying to distance himself from his father's expectations, gets up, goes to his antique mahogany bureau, and looks at his reflection in the mirror. He calmly takes a cloth and starts to wipe the blood from his face, remnants of a fight he got into defending a friend. Meanwhile, Carolyn, a regular at the local shooting range known for her precision, is wearing protective headgear and holding a Glock 19 automatic revolver, a popular choice among firearm enthusiasts for its reliability, with both hands and firing it directly at us. She empties a round and stands there, exhilarated, as an attendant from the range approaches with a new round of ammunition, and she starts firing again. Her face, usually hardened from years of corporate boardroom battles, loses its usual resolute determination; she is actually enjoying herself spontaneously, and the lack of her usual self-consciousness allows us to see just how beautiful she is beneath her tough exterior. The Glock 19 sits on the passenger seat amid some classic rock CDs as the Mercedes, a luxury car known for its smooth ride, turns onto Robin Hood Trail, a scenic route lined with tall, old trees, and we turn into the Burnham driveway, where a 1970 Pontiac Firebird with racing stripes, which Lester has been restoring as a side project, blocks our access to the garage. The room seems changed: sloppier, more lived in, perhaps reflecting the chaotic state of their lives. Lester, whose midlife crisis has led him to adopt a more carefree lifestyle, is sprawled on the couch in his underwear, drinking a beer and controlling the car, as his remote-controlled model jeep, a recent purchase from his newfound hobby in model racing, zooms across the floor of the family room, expertly maneuvering corners and narrowly avoiding crashing. She just stands there, staring at Lester, whose working out has, over several dedicated months, begun to produce noticeable results. He smiles at her playfully with the same look she had at the beginning of their relationship, when he dropped his briefcase full of unfulfilled dreams, but whatever power that look had is gone. Lester just laughs, and his face is close to hers, suddenly charging the atmosphere with an unspoken tension. She pulls back automatically, but it's clear she's drawn to him as he smiles and moves even closer, holding his beer loosely balanced, a symbol of his newfound disregard for convention. Then, just before their lips meet, she's immediately sorry she said it, but it's too late; his smile fades, and the moment is gone, a casualty of their unspoken issues. He stands and gestures toward all the things in the room, accumulated relics of their shared life. Carolyn stares at him, on the verge of tears, overwhelmed by the weight of their past, then turns and walks out of the room before he can see her cry. Jane, who has been grappling with her own sense of identity, lays in Ricky's bed, wearing a tank top, and glances at us with curiosity. We're watching the wide-screen TV in Ricky's room, where a cord leads from the TV to Ricky's digicam, a device he's used to document his life as a form of rebellion. Ricky holds the camera, standing naked, and aims his camera at Jane as she gets out of bed, takes his digicam, and focuses it on him. We see his image on the TV as she videotapes, and Jane zooms in on his face, which remains placid, hiding his turbulent emotions. Ricky, accustomed to using substances to cope, smiles and grabs a half-smoked joint from an ashtray and lights it, feeling a rare moment of calm."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The Colonel grabs him by the collar and glances toward the window where Jane peeks out from behind the drape and quickly pulls it shut. Suddenly deeply shamed the Colonel stands still breathing heavily and leaves. Ricky gets up goes to his bureau and looks at his reflection in the mirror. He calmly takes a cloth and starts to wipe the blood from his face. Meanwhile Carolyn wearing protective headgear is holding a Glock 19 automatic revolver with both hands and firing it directly at us. She empties a round and stands there exhilarated as an attendant approaches with a new round of ammunition and she starts firing again. Her face loses its usual resolute determination. she is actually enjoying herself spontaneously and the lack of her usual selfconsciousness allows us to see just how beautiful she is. The Glock 19 sits on the passenger seat amid some CDs as the Mercedes turns onto Robin Hood Trail and we turn into the Burnham driveway where a 1970 Pontiac Firebird with racing stripes blocks our access to the garage. The room seems changed sloppier more lived in. Lester is sprawled on the couch in his underwear drinking a beer and controlling the car as his remotecontrolled model jeep zooms across the floor of the family room expertly maneuvering corners and narrowly avoiding crashing. She just stands there staring at Lester whose working out is beginning to produce results. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. He smiles at her playfully with the same look she had at the beginning when he dropped his briefcase but whatever power that look had is gone. Lester just laughs and his face is close to hers suddenly charging the atmosphere. She pulls back automatically but it is clear she is drawn to him as he smiles and moves even closer holding his beer loosely balanced. Then just before their lips meet she is immediately sorry she said it but it is too late. his smile fades and the moment is gone. He stands and gestures toward all the things in the room. Carolyn stares at him on the verge of tears then turns and walks out of the room before he can see her cry. Jane lays in Ricky's bed wearing a tank top and glances at us. We are watching the widescreen TV in Ricky's room where a cord leads from the TV to Ricky's digicam. Ricky holds the camera standing naked and aims his camera at Jane as she gets out of bed takes his digicam and focuses it on him. We see his image on the TV as she videotapes and Jane zooms in on his face which remains placid. Ricky smiles and grabs a halfsmoked joint from an ashtray and lights it."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The Colonel grabs him by the collar and glances toward the window where Jane peeks out from behind the drape and quickly pulls it shut. Suddenly deeply shamed the Colonel stands still breathing heavily and leaves. Ricky gets up goes to his bureau and looks at his reflection in the mirror. He calmly takes a cloth and starts to wipe the blood from his face. Meanwhile Carolyn wearing protective headgear is holding a Glock 19 automatic revolver with both hands and firing it directly at us. She empties a round and stands there exhilarated as an attendant approaches with a new round of ammunition and she starts firing again. Her face loses its usual resolute determination. she is actually enjoying herself spontaneously and the lack of her usual selfconsciousness allows us to see just how beautiful she is. The Glock 19 sits on the passenger seat amid some CDs as the Mercedes turns onto Robin Hood Trail and we turn into the Burnham driveway where a 1970 Pontiac Firebird with racing stripes blocks our access to the garage. The room seems changed sloppier more lived in. Lester is sprawled on the couch in his underwear drinking a beer and controlling the car as his remotecontrolled model jeep zooms across the floor of the family room expertly maneuvering corners and narrowly avoiding crashing. She just stands there staring at Lester whose working out is beginning to produce results. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. He smiles at her playfully with the same look she had at the beginning when he dropped his briefcase but whatever power that look had is gone. Lester just laughs and his face is close to hers suddenly charging the atmosphere. She pulls back automatically but it is clear she is drawn to him as he smiles and moves even closer holding his beer loosely balanced. Then just before their lips meet she is immediately sorry she said it but it is too late. his smile fades and the moment is gone. He stands and gestures toward all the things in the room. Carolyn stares at him on the verge of tears then turns and walks out of the room before he can see her cry. Jane lays in Ricky's bed wearing a tank top and glances at us. We are watching the widescreen TV in Ricky's room where a cord leads from the TV to Ricky's digicam. Ricky holds the camera standing naked and aims his camera at Jane as she gets out of bed takes his digicam and focuses it on him. We see his image on the TV as she videotapes and Jane zooms in on his face which remains placid. Ricky smiles and grabs a halfsmoked joint from an ashtray and lights it."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The Colonel grabs him by the collar and glances toward the window where Jane peeks out from behind the drape and quickly pulls it shut. Suddenly deeply shamed the Colonel stands still breathing heavily and leaves. Ricky gets up goes to his bureau and looks at his reflection in the mirror. He calmly takes a cloth and starts to wipe the blood from his face. Meanwhile Carolyn wearing protective headgear is holding a Glock 19 automatic revolver with both hands and firing it directly at us. She empties a round and stands there exhilarated as an attendant approaches with a new round of ammunition and she starts firing again. Carolyn stares at him on the verge of tears then turns and walks out of the room before he can see her cry. Jane lays in Ricky's bed wearing a tank top and glances at us. We are watching the widescreen TV in Ricky's room where a cord leads from the TV to Ricky's digicam. Ricky holds the camera standing naked and aims his camera at Jane as she gets out of bed takes his digicam and focuses it on him. We see his image on the TV as she videotapes and Jane zooms in on his face which remains placid. Ricky smiles and grabs a halfsmoked joint from an ashtray and lights it."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The Colonel grabs him by the collar and glances toward the window where Jane peeks out from behind the drape and quickly pulls it shut. Suddenly deeply shamed the Colonel stands still breathing heavily and leaves. Ricky gets up goes to his bureau and looks at his reflection in the mirror. We see his image on the TV as she videotapes and Jane zooms in on his face which remains placid. Ricky smiles and grabs a halfsmoked joint from an ashtray and lights it."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The Magician seizes the goat by the leash and peers toward the clock, where Linda peers out from behind the curtain and quickly rolls it down. Suddenly, deeply embarrassed, the Magician sits, still panting heavily, and vanishes. Sammy leaps up, strolls to his wardrobe, and stares at his shadow in the painting. He serenely picks up a sponge and commences to scrub the ink from his hands. Meanwhile, Violet, wearing a protective mask, is holding a rubber mallet with both feet and swinging it directly at us. She finishes a series of swings and stands there, thrilled, as a gardener approaches with a fresh set of tennis balls, and she resumes swinging again. Her face loses its usual fierce grit; she is actually delighting herself instinctively, and the absence of her typical self-awareness reveals just how radiant she is. The rubber mallet rests on the bicycle seat amid some magazines as the Volkswagen veers onto Sherwood Lane and we steer into the Meadow driveway, where a 1990 Mustang with racing stripes obstructs our entry to the barn. The hall feels altered: messier, more occupied. Frank is draped on the hammock in his pajamas, sipping a soda and navigating the drone, as his remote-controlled model airplane swoops across the ceiling of the dining room, expertly turning corners and narrowly avoiding crashing. She simply stands there, gazing at Frank, whose jogging is starting to yield results. He grins at her teasingly with the same expression she had at the onset, when he dropped his lunchbox, but whatever impact that grin had is gone. Frank just chuckles, and his face is near hers, suddenly electrifying the environment. She recoils instinctively, but it's evident she's attracted to him as he grins and drifts even nearer, clutching his soda effortlessly balanced. Then, just before their noses touch, she's instantly regretful she uttered it, but it's too late; his grin vanishes, and the instant evaporates. He rises and points toward all the objects in the space. Violet gazes at him, almost in tears, then spins and walks out of the space before he can witness her sadness. Linda lounges in Sammy's chair, wearing a sweater, and peeks at us. We're observing the high-definition monitor in Sammy's den, where a rope extends from the monitor to Sammy's camcorder. Sammy grips the camcorder, standing unrobed, and points his camcorder at Linda as she rises from the chair, takes his camcorder, and trains it on him. We see his likeness on the monitor as she records, and Linda zooms in on his expression, which stays calm. Sammy grins and snatches a half-eaten cookie from an ashtray and nibbles it."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The Colonel, ashamed and breathing heavily, leaves after Jane peeks out from behind a curtain. Ricky calmly wipes blood from his face, while Carolyn, exhilarated, fires a Glock 19, revealing her spontaneous beauty. Meanwhile, Lester, in his underwear, drinks beer and controls a remote-controlled jeep, laughing with Carolyn, who feels drawn to him but regrets her feelings as the moment fades. She nearly cries before leaving the room. Elsewhere, Jane lays in Ricky's bed, watching TV connected to Ricky's digicam. Ricky films Jane, who then videotapes him. As Ricky lights a joint, his placid image appears on the TV."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Ricky smiles and grabs a halfsmoked joint from an ashtray and lights it We see his image on the TV as she videotapes and Jane zooms in on his face which remains placid Ricky holds the camera standing naked and aims his camera at Jane as she gets out of bed takes his digicam and focuses it on him We are watching the widescreen TV in Ricky's room where a cord leads from the TV to Ricky's digicam Jane lays in Ricky's bed wearing a tank top and glances at us Carolyn stares at him on the verge of tears then turns and walks out of the room before he can see her cry He stands and gestures toward all the things in the room his smile fades and the moment is gone Then just before their lips meet she is immediately sorry she said it but it is too late She pulls back automatically but it is clear she is drawn to him as he smiles and moves even closer holding his beer loosely balanced Lester just laughs and his face is close to hers suddenly charging the atmosphere He smiles at her playfully with the same look she had at the beginning when he dropped his briefcase but whatever power that look had is gone She just stands there staring at Lester whose working out is beginning to produce results Lester is sprawled on the couch in his underwear drinking a beer and controlling the car as his remotecontrolled model jeep zooms across the floor of the family room expertly maneuvering corners and narrowly avoiding crashing The room seems changed sloppier more lived in The Glock 19 sits on the passenger seat amid some CDs as the Mercedes turns onto Robin Hood Trail and we turn into the Burnham driveway where a 1970 Pontiac Firebird with racing stripes blocks our access to the garage she is actually enjoying herself spontaneously and the lack of her usual selfconsciousness allows us to see just how beautiful she is Her face loses its usual resolute determination She empties a round and stands there exhilarated as an attendant approaches with a new round of ammunition and she starts firing again Meanwhile Carolyn wearing protective headgear is holding a Glock 19 automatic revolver with both hands and firing it directly at us He calmly takes a cloth and starts to wipe the blood from his face Ricky gets up goes to his bureau and looks at his reflection in the mirror Suddenly deeply shamed the Colonel stands still breathing heavily and leaves The Colonel grabs him by the collar and glances toward the window where Jane peeks out from behind the drape and quickly pulls it shut"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Suddenly deeply shamed the Colonel stands still breathing heavily and leaves The Colonel grabs him by the collar and glances toward the window where Jane peeks out from behind the drape and quickly pulls it shut He calmly takes a cloth and starts to wipe the blood from his face Ricky gets up goes to his bureau and looks at his reflection in the mirror She empties a round and stands there exhilarated as an attendant approaches with a new round of ammunition and she starts firing again Meanwhile Carolyn wearing protective headgear is holding a Glock 19 automatic revolver with both hands and firing it directly at us she is actually enjoying herself spontaneously and the lack of her usual selfconsciousness allows us to see just how beautiful she is Her face loses its usual resolute determination The room seems changed sloppier more lived in The Glock 19 sits on the passenger seat amid some CDs as the Mercedes turns onto Robin Hood Trail and we turn into the Burnham driveway where a 1970 Pontiac Firebird with racing stripes blocks our access to the garage She just stands there staring at Lester whose working out is beginning to produce results Lester is sprawled on the couch in his underwear drinking a beer and controlling the car as his remotecontrolled model jeep zooms across the floor of the family room expertly maneuvering corners and narrowly avoiding crashing Lester just laughs and his face is close to hers suddenly charging the atmosphere He smiles at her playfully with the same look she had at the beginning when he dropped his briefcase but whatever power that look had is gone Then just before their lips meet she is immediately sorry she said it but it is too late She pulls back automatically but it is clear she is drawn to him as he smiles and moves even closer holding his beer loosely balanced He stands and gestures toward all the things in the room his smile fades and the moment is gone Jane lays in Ricky's bed wearing a tank top and glances at us Carolyn stares at him on the verge of tears then turns and walks out of the room before he can see her cry Ricky holds the camera standing naked and aims his camera at Jane as she gets out of bed takes his digicam and focuses it on him We are watching the widescreen TV in Ricky's room where a cord leads from the TV to Ricky's digicam Ricky smiles and grabs a halfsmoked joint from an ashtray and lights it We see his image on the TV as she videotapes and Jane zooms in on his face which remains placid"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He smiles at her playfully with the same look she had at the beginning when he dropped his briefcase but whatever power that look had is gone Lester just laughs and his face is close to hers suddenly charging the atmosphere She pulls back automatically but it is clear she is drawn to him as he smiles and moves even closer holding his beer loosely balanced Then just before their lips meet she is immediately sorry she said it but it is too late his smile fades and the moment is gone He stands and gestures toward all the things in the room Carolyn stares at him on the verge of tears then turns and walks out of the room before he can see her cry Jane lays in Ricky's bed wearing a tank top and glances at us We are watching the widescreen TV in Ricky's room where a cord leads from the TV to Ricky's digicam Ricky holds the camera standing naked and aims his camera at Jane as she gets out of bed takes his digicam and focuses it on him We see his image on the TV as she videotapes and Jane zooms in on his face which remains placid Ricky smiles and grabs a halfsmoked joint from an ashtray and lights it The Colonel grabs him by the collar and glances toward the window where Jane peeks out from behind the drape and quickly pulls it shut Suddenly deeply shamed the Colonel stands still breathing heavily and leaves Ricky gets up goes to his bureau and looks at his reflection in the mirror He calmly takes a cloth and starts to wipe the blood from his face Meanwhile Carolyn wearing protective headgear is holding a Glock 19 automatic revolver with both hands and firing it directly at us She empties a round and stands there exhilarated as an attendant approaches with a new round of ammunition and she starts firing again Her face loses its usual resolute determination she is actually enjoying herself spontaneously and the lack of her usual selfconsciousness allows us to see just how beautiful she is The Glock 19 sits on the passenger seat amid some CDs as the Mercedes turns onto Robin Hood Trail and we turn into the Burnham driveway where a 1970 Pontiac Firebird with racing stripes blocks our access to the garage The room seems changed sloppier more lived in Lester is sprawled on the couch in his underwear drinking a beer and controlling the car as his remotecontrolled model jeep zooms across the floor of the family room expertly maneuvering corners and narrowly avoiding crashing She just stands there staring at Lester whose working out is beginning to produce results"
        }
      ]
    }
  ]
}