{
  "ground_truth": "He smiles as he turns toward Rick. Suddenly the smile fades. In Rick's hand is a gun, which he levels at Renault. Renault halts for a moment and studies Rick. He walks to a table and sits. As Renault picks up the phone and dials, Rick takes back the letters. Strasser is on the phone. He hangs up the receiver and presses a buzzer on his desk. An officer quickly enters. He hangs up the receiver and, grabbing for his cap, hurriedly exits. The entire airport is surrounded by a heavy fog. The outline of the transport plane is barely visible. On the airfield a transport plane is being readied. A uniformed orderly uses a telephone near the hangar door. He hangs up and moves to a car that has just pulled up outside the hangar. Renault gets out while the orderly stands at attention. He's closely followed by Rick, right hand in the pocket of his trench coat, covering Renault with a gun. Laszlo and Ilsa emerge from the rear of the car. Laszlo and take care of his luggage. The orderly escorts Laszlo off in the direction of the plane. Rick takes the letters of transit out of his pocket and hands them to Renault, who turns and walks toward the hangar. Renault stops dead in his tracks, and turns around. Both Ilsa and Renault look at Rick with astonishment. Rick's intention suddenly dawns on Ilsa. Renault countersigns the papers. Ilsa's eyes well up with tears. Rick puts his hand to her chin and raises her face to meet his own. Major Strasser drives at break-neck speed towards the airport. He honks his horn furiously. Laszlo returns. Rick walks into the hangar and Renault hands him the letters. He walks back out to Laszlo. Rick hands the letters to Laszlo. Laszlo extends his hand to Rick, who grasps it firmly. On the airfield the airplane engine turns over and the propellers start turning. They all turn to see the plane readying for take-off. Ilsa looks at Rick and he returns her stare with a blank expression. He then glances at Laszlo, as does Ilsa. Then Laszlo breaks the silence. Rick watches as Ilsa and Laszlo walk very deliberately towards the plane. Rick puts a cigarette in his mouth. The door to the plane is closed by an attendant and it slowly taxies down the field. Suddenly a speeding car comes to a stop outside the hangar. Strasser alights from the car and runs toward Renault. Renault nods toward the field. Strasser turns to see the plane taxiing towards the runway. Strasser looks briefly at Rick, then makes a step towards the telephone just inside the hangar door. His eyes dart towards the telephone.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He grins as he rotates toward Rick. Abruptly the grin diminishes. In Rick's hand is a pistol, which he levels at Renault. Renault pauses for a moment and examines Rick. He strides to a table and sits. As Renault grabs the phone and dials, Rick retrieves the documents. Strasser is on the phone. He hangs up the receiver and activates a buzzer on his desk. An officer swiftly enters. He hangs up the receiver and, seizing his cap, rapidly departs. The complete airport is enveloped by a dense mist. The outline of the transport aircraft is scarcely visible. On the airfield a transport aircraft is being prepared. A uniformed attendant utilizes a telephone near the hangar door. He hangs up and moves to a vehicle that has just stopped outside the hangar. Renault exits while the attendant stands at attention. He's closely trailed by Rick, right hand in the pocket of his trench coat, covering Renault with a pistol. Laszlo and Ilsa emerge from the rear of the vehicle. Laszlo and handle his baggage. The attendant guides Laszlo off in the direction of the aircraft. Rick takes the documents of transit out of his pocket and hands them to Renault, who turns and walks toward the hangar. Renault stops dead in his tracks, and turns around. Both Ilsa and Renault look at Rick with amazement. Rick's aim suddenly dawns on Ilsa. Renault endorses the documents. Ilsa's eyes fill with tears. Rick puts his hand to her chin and raises her face to meet his own. Major Strasser speeds at break-neck velocity towards the airport. He honks his horn furiously. Laszlo returns. Rick walks into the hangar and Renault hands him the documents. He walks back out to Laszlo. Rick hands the documents to Laszlo. Laszlo extends his hand to Rick, who grips it firmly. On the airfield the airplane engine starts up and the propellers start rotating. They all turn to see the aircraft readying for take-off. Ilsa looks at Rick and he returns her gaze with a blank expression. He then glances at Laszlo, as does Ilsa. Then Laszlo breaks the silence. Rick watches as Ilsa and Laszlo walk very deliberately towards the aircraft. Rick puts a cigarette in his mouth. The door to the aircraft is closed by an attendant and it slowly taxies down the field. Suddenly a speeding vehicle comes to a stop outside the hangar. Strasser disembarks from the vehicle and runs toward Renault. Renault nods toward the field. Strasser turns to see the aircraft taxiing towards the runway. Strasser looks briefly at Rick, then makes a step towards the telephone just inside the hangar door. His eyes dart towards the telephone."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Sure, here is the text transformed by switching the active-voice sentences to passive voice and vice versa:\n\nHe is smiled at as Rick is turned toward by him. Suddenly the smile fades. In Rick's hand is a gun, which is leveled at Renault by him. Renault halts for a moment and Rick is studied by him. He walks to a table and sits. As the phone is picked up and dialed by Renault, the letters are taken back by Rick. Strasser is on the phone. He hangs up the receiver and a buzzer on his desk is pressed by him. An officer quickly enters. The receiver is hung up by him and, grabbing for his cap, he hurriedly exits. A heavy fog surrounds the entire airport. The outline of the transport plane is barely visible. On the airfield a transport plane is readying. A telephone near the hangar door is used by a uniformed orderly. He hangs up and a car that has just pulled up outside the hangar is moved to by him. Renault gets out while the orderly is stood at attention by him. Rick closely follows him, right hand in the pocket of his trench coat, covering Renault with a gun. Laszlo and Ilsa emerge from the rear of the car. The luggage is taken care of by Laszlo. Laszlo is escorted by the orderly off in the direction of the plane. The letters of transit are taken out of Rick's pocket and handed to Renault by him, who turns and walks toward the hangar. Renault is stopped dead in his tracks and he turns around. Astonishment is shown by both Ilsa and Renault as they look at Rick. Rick's intention suddenly dawns on Ilsa. The papers are countersigned by Renault. Tears well up in Ilsa's eyes. Rick's hand is put to her chin and her face is raised to meet his own by him. Major Strasser drives at break-neck speed towards the airport. He honks his horn furiously. Laszlo returns. Rick walks into the hangar and the letters are handed to him by Renault. Laszlo is then walked back out to by him. The letters are handed to Laszlo by Rick. Laszlo's hand is extended to Rick, who firmly grasps it. On the airfield the airplane engine is turned over and the propellers start turning. They all turn to see the plane being readied for take-off. Ilsa looks at Rick and her stare is returned by him with a blank expression. Laszlo is then glanced at by him, as he is by Ilsa. Then the silence is broken by Laszlo. Ilsa and Laszlo are watched by Rick as they walk very deliberately towards the plane. A cigarette is put in Rick's mouth by him. The door to the plane is closed by an attendant and it is taxied slowly down the field. Suddenly a speeding car is stopped outside the hangar. Strasser alights from the car and Renault is run towards by him. The field is nodded toward by Renault. Strasser turns to see the plane taxiing towards the runway. Rick is looked at briefly by Strasser, then a step towards the telephone just inside the hangar door is made by him. His eyes dart towards the telephone."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He smiles at Rick, but the smile fades as Rick holds a gun aimed at him. Renault pauses, studies Rick, and sits at a table to dial the phone. Rick retrieves the letters. Strasser is on the line, hangs up, and presses a buzzer, summoning an officer who exits quickly. The airport is shrouded in heavy fog, with only a faint outline of the transport plane visible on the airfield. A uniformed orderly uses a phone near the hangar, then moves to a car. Renault exits, followed by Rick, gun in hand. Laszlo and Ilsa emerge from the car, and the orderly escorts Laszlo to the plane. Rick hands the letters of transit to Renault, who countersigns them. Ilsa's eyes fill with tears as Rick reassures her. Strasser speeds to the airport, honking furiously. Laszlo returns, and Rick gives him the letters. Laszlo shakes Rick's hand. The airplane's engine starts and propellers turn. Ilsa and Rick exchange looks, then she and Laszlo head to the plane. Rick lights a cigarette as the plane doors close and it taxis. Strasser arrives in a hurry, nods at Renault, and turns to see the plane moving towards the runway, briefly glancing at Rick before moving towards the telephone."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Rick smiles at Renault, but the smile fades when he sees a gun. Renault stops and studies Rick, then sits at a table to call Strasser. Rick retrieves the letters as an officer enters, the airport shrouded in fog. As a plane is readied, Renault exits a car followed by Rick, gun in hand. Laszlo and Ilsa join, and the orderly takes Laszlo to the plane. Rick hands Renault the letters, who signs them before Ilsa realizes Rick's plan. Strasser speeds to the airport as Laszlo returns to receive the letters from Rick. They shake hands, and the plane prepares for take-off. Ilsa looks at Rick, and then at Laszlo, breaking the silence. Rick watches them board, lights a cigarette, and as the plane taxies, Strasser arrives, nods at Renault, then moves towards the phone."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "With a warm smile on his face, he turns his attention towards Rick. However, that friendly expression quickly dissolves into a more serious look. In Rick's hand, unmistakably, there is a gun, which he calmly levels in the direction of Renault. Renault comes to an abrupt halt for a brief moment, carefully studying Rick's demeanor. Then, he walks over to a nearby table and takes a seat. While Renault picks up the phone, methodically dialing, Rick deftly retrieves the letters. On the line is Strasser. After their call concludes, Strasser decisively hangs up the receiver and promptly presses a buzzer located on his desk. In response, an officer swiftly enters the room. Strasser hangs up and, without delay, grabs for his cap and makes a hasty exit. Outside, a thick, impenetrable fog envelops the entire airport, and the silhouette of the transport plane is barely discernible through the mist. On the airfield, preparations are underway for the transport plane's departure. A uniformed orderly stands by, using a telephone positioned near the hangar door. Completing his call, he hangs up and moves over to a car that has just drawn up outside the hangar. Renault steps out of the car while the orderly springs to attention. Closely following Renault is Rick, with his right hand nestled in the pocket of his trench coat, keeping Renault covered with a gun. Laszlo and Ilsa emerge from the rear of the vehicle. Laszlo proceeds to handle his luggage, and the orderly dutifully escorts him in the direction of the waiting plane. Rick, meanwhile, retrieves the letters of transit from his pocket and hands them over to Renault, who turns and heads towards the hangar. Suddenly, Renault comes to an abrupt stop, spinning around in surprise. Both Ilsa and Renault gaze at Rick, their faces reflecting astonishment. In that moment, Rick's intention becomes crystal clear to Ilsa. Renault, acknowledging the situation, countersigns the papers. Tears begin to glisten in Ilsa's eyes as Rick gently lifts her chin with his hand, raising her face to meet his own gaze. Meanwhile, Major Strasser speeds furiously towards the airport in his car, honking the horn with urgency. Laszlo returns from his task, and Rick steps into the hangar where Renault hands him the letters once more. Rick then walks back out to meet Laszlo, handing the letters over to him. Laszlo extends his hand towards Rick, who grips it firmly in a gesture of mutual respect. On the airfield, the airplane's engine roars to life, and the propellers start to spin. Everyone turns their attention to the plane, now readying for take-off. Ilsa gives Rick a meaningful look, to which he responds with a distant, expressionless stare. Then, he shifts his glance towards Laszlo, and Ilsa follows suit. Breaking the silence, Laszlo speaks. Rick watches intently as Ilsa and Laszlo walk purposefully towards the waiting plane. Calmly, Rick places a cigarette in his mouth. An attendant closes the door to the aircraft, and it begins to slowly taxi down the field. Abruptly, a speeding car screeches to a stop outside the hangar. Strasser emerges from the vehicle, running urgently towards Renault. Renault nods knowingly in the direction of the field, prompting Strasser to turn and see the plane making its way towards the runway. Strasser briefly glances at Rick before making a move towards the telephone positioned just inside the hangar door, his gaze focused intently on the device."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a warm and inviting smile stretched across his face, he momentarily focuses his attention towards Rick. However, that friendly expression rapidly vanishes, giving way to a much more serious look. In Rick's hand, quite unmistakably, there is a gun that he calmly levels in the direction of Renault. Renault comes to an abrupt pause for a brief moment, carefully analyzing Rick's demeanor. Then, with deliberate steps, he walks over to a table nearby and takes a seat. While Renault picks up the phone, methodically dialing each number with precision, Rick deftly retrieves the letters. On the other end of the line is Strasser. After their conversation concludes, Strasser decisively hangs up the receiver and promptly presses a buzzer located conveniently on his desk. In response, an officer swiftly enters the room with urgency. Strasser finishes the call and, without delay, grabs for his cap and makes a hasty exit. Outside, a thick, impenetrable fog envelops the entire airport, and the silhouette of the transport plane is barely discernible through the heavy mist. On the airfield, thoughtful preparations are underway for the transport plane's impending departure. A uniformed orderly stands by, using a telephone positioned near the hangar door. After completing his call, he hangs up and moves over to a car that has just drawn up outside the hangar. Renault steps out of the car while the orderly springs to attention immediately. Closely following Renault is Rick, with his right hand nestled securely in the pocket of his trench coat, ensuring Renault remains covered with the gun. Laszlo and Ilsa then emerge from the rear of the vehicle. Laszlo proceeds to manage his luggage, and the orderly dutifully escorts him in the direction of the patiently waiting plane. Meanwhile, Rick retrieves the letters of transit from his pocket and hands them over to Renault, who then turns and heads towards the hangar. Suddenly, Renault comes to an abrupt stop, spinning around in surprise. Both Ilsa and Renault gaze at Rick, their faces reflecting pure astonishment. In that moment, Rick's intention becomes crystal clear to Ilsa. Acknowledging the gravity of the situation, Renault countersigns the papers. Tears begin to glisten in Ilsa's eyes as Rick gently lifts her chin with his hand, raising her face to meet his own gaze. Meanwhile, Major Strasser speeds furiously towards the airport in his car, honking the horn with a sense of urgency. Laszlo returns from his task, and Rick steps inside the hangar where Renault hands him the letters once more. Rick then walks back out to meet Laszlo, handing the letters over to him. Laszlo extends his hand towards Rick, who grips it firmly, sealing their farewell in a gesture of mutual respect. Out on the airfield, the airplane's engine roars to life, and the propellers start to spin with anticipation. Everyone turns their attention to the plane, now busily readying for take-off. Ilsa gives Rick a meaningful and lingering look, to which he responds with a distant, expressionless stare. Then, he shifts his glance towards Laszlo, and Ilsa follows suit with her gaze. Breaking the silence that envelops them, Laszlo speaks. Rick watches intently as Ilsa and Laszlo walk purposefully towards the waiting plane. With a calm demeanor, Rick places a cigarette in his mouth. An attendant closes the door to the aircraft, and it begins to slowly taxi down the field. Abruptly, a speeding car screeches to a stop outside the hangar, arresting the quiet of the night. Strasser emerges from the vehicle, running urgently towards Renault. Renault nods knowingly in the direction of the field, prompting Strasser to turn and see the plane making its way determinedly towards the runway. Strasser briefly glances at Rick before making a decisive move towards the telephone positioned just inside the hangar door, his gaze focused intently and determinedly on the device."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As he finds himself in the presence of Rick, he initially smiles warmly, only for his expression to abruptly shift into one of concern as he notices the firearm Rick is holding with a steady hand aimed directly at him. Renault, caught off guard, hesitates briefly, his mind racing as he assesses the situation. Gathering himself, he strides over to a nearby table and lowers himself into a chair. Reaching for the phone with deliberate intent, Renault begins to dial while Rick deftly retrieves the letters from their previous location. Meanwhile, Strasser, engaged in his own conversation, places the receiver down with a decisive click and activates a buzzer on his desk, setting off a series of events. Responding to the signal, an officer promptly appears but, after a brief exchange, hangs up his own phone amid the urgency and dashes off, grabbing his cap as he makes his swift exit. Outside, the airport is enveloped in a dense fog, concealing much of its surroundings, and only the faint silhouette of a transport plane can be discerned through the mist. On the field, preparations are underway for the plane's departure, including a uniformed orderly stationed by the telephone near the hangar door. After concluding his call, the orderly briskly approaches a newly arrived car outside the hangar. Renault steps out of the vehicle with a commanding presence, prompting the orderly to stand at attention. Not far behind, Rick emerges, his right hand nestled in the pocket of his trench coat, maintaining a cautious yet firm hold on Renault with his concealed gun. Laszlo and Ilsa appear from the back of the car, with Laszlo tending to their luggage. The orderly diligently guides Laszlo towards the waiting aircraft. Rick, meanwhile, retrieves the letters of transit from his pocket and passes them to Renault. With focused determination, Renault heads towards the hangar, only to pause abruptly, turning back to face Rick and Ilsa, both startled by the unexpected turn of events. Recognition of Rick's intentions dawns on Ilsa, stirring a profound emotional response. Renault, in a moment of clarity, countersigns the documents, while tears begin to pool in Ilsa's eyes. Rick tenderly places his hand beneath her chin, gently lifting her face until their eyes meet. In the meantime, Major Strasser speeds furiously towards the airport, his horn blaring insistently. As Laszlo returns, Rick steps into the hangar where Renault hands over the letters. Rick promptly exits to rejoin Laszlo, extending the letters to him. Laszlo, filled with gratitude, offers his hand to Rick, who accepts it with a firm and meaningful handshake. As the airplane engine roars to life and the propellers begin to spin, their attention collectively shifts to the plane, now poised for departure. In that charged moment, Ilsa gazes at Rick, who meets her look with an unreadable expression before diverting his gaze towards Laszlo, a gesture mirrored by Ilsa. With a sudden resolve, Laszlo breaks the silence, prompting Rick to watch as Ilsa and Laszlo proceed with purpose toward the awaiting plane. Rick places a cigarette between his lips, contemplating the unfolding scene. As the plane door is securely shut and it begins to roll away across the airfield, the screeching halt of an arriving car cuts through the air. Strasser leaps from the vehicle, dashing towards Renault as tension hangs thickly in the air. Sensing the urgency, Renault nods meaningfully in the direction of the airfield. Strasser, compelled to act, turns to witness the plane advancing steadily towards the runway. Momentarily locking eyes with Rick, Strasser takes a decisive step towards the telephone just inside the hangar entryway, his resolve mirrored in the sharp, darting movements of his eyes."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Rick's smile fades as he turns to see Rick holding a gun aimed at him, halting momentarily before heading to a table to sit. As Renault uses the phone to call Strasser, Rick retrieves the letters of transit. Strasser, after his call, summons an officer who quickly exits. Meanwhile, heavy fog envelops the airport, obscuring the transport plane being readied nearby. A uniformed orderly, after making a phone call, approaches a car that arrives outside the hangar. Renault steps out, followed by Rick, his hand concealing a gun in his trench coat pocket, covering Renault. Laszlo and Ilsa exit the car, and the orderly assists Laszlo with his luggage toward the plane. Rick hands the letters of transit to Renault, whose surprised reaction alerts Ilsa to Rick’s intentions. Renault countersigns the papers, causing Ilsa to tear up as Rick gently lifts her chin, meeting her gaze. Major Strasser speeds towards the airport, honking furiously. Once Laszlo returns, Rick retrieves the letters from Renault, hands them to Laszlo, and they shake hands firmly. The plane's engines start as everyone watches it ready for take-off. Ilsa exchanges glances with Rick, who remains expressionless, then with Laszlo. Breaking the silence, Laszlo and Ilsa walk deliberately toward the plane. Rick lights a cigarette, watching as the plane's door is closed and it begins to taxi. Suddenly, a speeding car arrives outside the hangar, and Strasser, emerging quickly, runs towards Renault. Renault subtly indicates the field, prompting Strasser to see the plane moving toward the runway. Strasser briefly glances at Rick before turning toward the phone by the hangar door."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He smiles as he turns toward Rick. Suddenly the smile fades. In Rick's hand is a gun, a German Luger known for its reliability during World War II, which he levels at Renault. Renault halts for a moment and studies Rick. He walks to a table and sits. As Renault picks up the phone, an older rotary model commonly found in the 1940s, and dials, Rick takes back the letters. Strasser is on the phone, a high-ranking officer known for his unwavering allegiance to his orders. He hangs up the receiver and presses a buzzer on his desk. An officer quickly enters, dressed in the standard military police uniform. He hangs up the receiver and, grabbing for his cap, hurriedly exits. The entire airport, situated on the outskirts of Casablanca with minimal infrastructure, is surrounded by a heavy fog. The outline of the transport plane, a Lockheed C-47 Skytrain used extensively during the war, is barely visible. On the airfield, a transport plane is being readied. A uniformed orderly uses a telephone near the hangar door, part of the military communication network. He hangs up and moves to a car that has just pulled up outside the hangar, a classic black sedan typical of the era's official vehicles. Renault gets out while the orderly stands at attention. He's closely followed by Rick, right hand in the pocket of his trench coat, covering Renault with a gun. Laszlo, a well-known resistance leader, and Ilsa emerge from the rear of the car. The orderly escorts Laszlo, aiding him in discreetly escaping occupied territory, off in the direction of the plane. Rick takes the letters of transit, crucial documents granting safe passage that were highly sought after during the wartime period, out of his pocket and hands them to Renault, who turns and walks toward the hangar. Renault stops dead in his tracks and turns around. Both Ilsa and Renault look at Rick with astonishment. Rick's intention suddenly dawns on Ilsa. Renault countersigns the papers, officially authorizing Laszlo's departure. Ilsa's eyes well up with tears. Rick puts his hand to her chin and raises her face, echoing a gesture filled with unspoken emotion, to meet his own. Major Strasser drives at break-neck speed towards the airport, maneuvering through the unlit roads, and honks his horn furiously. Laszlo returns. Rick walks into the hangar and Renault hands him the letters. He walks back out to Laszlo. Rick hands the letters to Laszlo, completing their escape plan. Laszlo extends his hand to Rick, who grasps it firmly, a silent acknowledgment of mutual respect and sacrifice. On the airfield, the airplane engine turns over and the propellers start turning, the noise cutting through the dense fog. They all turn to see the plane readying for take-off, the finality of their departure looming. Ilsa looks at Rick and he returns her stare with a blank expression, hiding the myriad emotions beneath. He then glances at Laszlo, as does Ilsa. Then Laszlo breaks the silence, offering words of gratitude. Rick watches as Ilsa and Laszlo walk very deliberately towards the plane, every step a goodbye. Rick puts a cigarette in his mouth, seeking solace in the familiar habit. The door to the plane is closed by an attendant and it slowly taxies down the field, the hum of the engines growing distant. Suddenly a speeding car comes to a stop outside the hangar. Strasser alights from the car, urgency in his stride, and runs toward Renault. Renault nods toward the field, signaling the futility of pursuit. Strasser turns to see the plane taxiing towards the runway, the realization of his failure dawning. Strasser looks briefly at Rick, then makes a step towards the telephone just inside the hangar door, desperation in his movements. His eyes dart towards the telephone, his last chance to assert control slipping away."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He smiles as he turns toward Rick. Suddenly the smile fades. In Rick's hand is a gun which he levels at Renault. Renault halts for a moment and studies Rick. He walks to a table and sits. As Renault picks up the phone and dials Rick takes back the letters. Strasser is on the phone. He hangs up the receiver and presses a buzzer on his desk. An officer quickly enters. He hangs up the receiver and grabbing for his cap hurriedly exits. The entire airport is surrounded by a heavy fog. The outline of the transport plane is barely visible. On the airfield a transport plane is being readied. A uniformed orderly uses a telephone near the hangar door. He hangs up and moves to a car that has just pulled up outside the hangar. Renault gets out while the orderly stands at attention. He is closely followed by Rick right hand in the pocket of his trench coat covering Renault with a gun. Laszlo and Ilsa emerge from the rear of the car. Laszlo and take care of his luggage. The orderly escorts Laszlo off in the direction of the plane. Rick takes the letters of transit out of his pocket and hands them to Renault who turns and walks toward the hangar. Renault stops dead in his tracks and turns around. Both Ilsa and Renault look at Rick with astonishment. Rick's intention suddenly dawns on Ilsa. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Renault countersigns the papers. Ilsa's eyes well up with tears. Rick puts his hand to her chin and raises her face to meet his own. Major. Strasser drives at breakneck speed towards the airport. He honks his horn furiously. Laszlo returns. Rick walks into the hangar and Renault hands him the letters. He walks back out to Laszlo. Rick hands the letters to Laszlo. Laszlo extends his hand to Rick who grasps it firmly. On the airfield the airplane engine turns over and the propellers start turning. They all turn to see the plane readying for takeoff. Ilsa looks at Rick and he returns her stare with a blank expression. He then glances at Laszlo as does Ilsa. Then Laszlo breaks the silence. Rick watches as Ilsa and Laszlo walk very deliberately towards the plane. Rick puts a cigarette in his mouth. The door to the plane is closed by an attendant and it slowly taxies down the field. Suddenly a speeding car comes to a stop outside the hangar. Strasser alights from the car and runs toward Renault. Renault nods toward the field. Strasser turns to see the plane taxiing towards the runway. Strasser looks briefly at Rick then makes a step towards the telephone just inside the hangar door. His eyes dart towards the telephone."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He smiles as he turns toward Rick. Suddenly the smile fades. In Rick's hand is a gun which he levels at Renault. Renault halts for a moment and studies Rick. He walks to a table and sits. As Renault picks up the phone and dials Rick takes back the letters. Strasser is on the phone. He hangs up the receiver and presses a buzzer on his desk. An officer quickly enters. He hangs up the receiver and grabbing for his cap hurriedly exits. The entire airport is surrounded by a heavy fog. The outline of the transport plane is barely visible. On the airfield a transport plane is being readied. A uniformed orderly uses a telephone near the hangar door. He hangs up and moves to a car that has just pulled up outside the hangar. Renault gets out while the orderly stands at attention. He is closely followed by Rick right hand in the pocket of his trench coat covering Renault with a gun. Laszlo and Ilsa emerge from the rear of the car. Laszlo and take care of his luggage. The orderly escorts Laszlo off in the direction of the plane. Rick takes the letters of transit out of his pocket and hands them to Renault who turns and walks toward the hangar. Renault stops dead in his tracks and turns around. Both Ilsa and Renault look at Rick with astonishment. Rick's intention suddenly dawns on Ilsa. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Renault countersigns the papers. Ilsa's eyes well up with tears. Rick puts his hand to her chin and raises her face to meet his own. Major. Strasser drives at breakneck speed towards the airport. He honks his horn furiously. Laszlo returns. Rick walks into the hangar and Renault hands him the letters. He walks back out to Laszlo. Rick hands the letters to Laszlo. Laszlo extends his hand to Rick who grasps it firmly. On the airfield the airplane engine turns over and the propellers start turning. They all turn to see the plane readying for takeoff. Ilsa looks at Rick and he returns her stare with a blank expression. He then glances at Laszlo as does Ilsa. Then Laszlo breaks the silence. Rick watches as Ilsa and Laszlo walk very deliberately towards the plane. Rick puts a cigarette in his mouth. The door to the plane is closed by an attendant and it slowly taxies down the field. Suddenly a speeding car comes to a stop outside the hangar. Strasser alights from the car and runs toward Renault. Renault nods toward the field. Strasser turns to see the plane taxiing towards the runway. Strasser looks briefly at Rick then makes a step towards the telephone just inside the hangar door. His eyes dart towards the telephone."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He smiles as he turns toward Rick. Suddenly the smile fades. In Rick's hand is a gun which he levels at Renault. Renault halts for a moment and studies Rick. He walks to a table and sits. As Renault picks up the phone and dials Rick takes back the letters. Strasser is on the phone. He hangs up the receiver and presses a buzzer on his desk. An officer quickly enters. He hangs up the receiver and grabbing for his cap hurriedly exits. The entire airport is surrounded by a heavy fog. The outline of the transport plane is barely visible. They all turn to see the plane readying for takeoff. Ilsa looks at Rick and he returns her stare with a blank expression. He then glances at Laszlo as does Ilsa. Then Laszlo breaks the silence. Rick watches as Ilsa and Laszlo walk very deliberately towards the plane. Rick puts a cigarette in his mouth. The door to the plane is closed by an attendant and it slowly taxies down the field. Suddenly a speeding car comes to a stop outside the hangar. Strasser alights from the car and runs toward Renault. Renault nods toward the field. Strasser turns to see the plane taxiing towards the runway. Strasser looks briefly at Rick then makes a step towards the telephone just inside the hangar door. His eyes dart towards the telephone."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He smiles as he turns toward Rick. Suddenly the smile fades. In Rick's hand is a gun which he levels at Renault. Renault halts for a moment and studies Rick. He walks to a table and sits. Strasser alights from the car and runs toward Renault. Renault nods toward the field. Strasser turns to see the plane taxiing towards the runway. Strasser looks briefly at Rick then makes a step towards the telephone just inside the hangar door. His eyes dart towards the telephone."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "He giggles as he spins toward Sam. Suddenly the giggle disappears. In Sam's hand is a banana, which he points at Jackson. Jackson pauses for a second and examines Sam. He strolls to a bench and lounges. As Jackson grabs the hammer and taps, Sam retrieves the maps. Peterson is on the radio. He clicks off the microphone and pushes a button on his chair. A firefighter swiftly enters. He clicks off the microphone and, clutching for his helmet, rapidly departs. The entire dock is enveloped by a thick mist. The silhouette of the cargo ship is scarcely discernible. On the tarmac, a cargo ship is being serviced. A uniformed nurse uses a megaphone beside the hangar window. She clicks off and advances to a truck that has just arrived outside the hangar. Jackson climbs out while the nurse stands formally. He's closely followed by Sam, right hand in the pocket of his raincoat, covering Jackson with a banana. Morgan and Jane appear from the back of the truck. Morgan and handle his parcels. The nurse guides Morgan away in the direction of the ship. Sam extracts the maps out of his pocket and hands them to Jackson, who turns and strolls toward the hangar. Jackson freezes, and spins around. Both Jane and Jackson gaze at Sam with disbelief. Sam's plan abruptly reveals itself to Jane. Jackson endorses the documents. Jane's eyes fill with raindrops. Sam places his hand to her cheek and tilts her face to meet his own. Captain Peterson races at lightning speed towards the dock. He blares his horn frantically. Morgan comes back. Sam strides into the hangar and Jackson presents him with the maps. He strides back out to Morgan. Sam hands the maps to Morgan. Morgan stretches his hand toward Sam, who grips it tightly. On the tarmac, the ship's engine whirs and the propellers begin spinning. They all turn to observe the ship preparing for departure. Jane gazes at Sam and he returns her gaze with a vacant expression. He then peeks at Morgan, as does Jane. Then Morgan breaks the quiet. Sam observes as Jane and Morgan stride very intentionally toward the ship. Sam places a lollipop in his mouth. The door to the ship is shut by a mechanic and it slowly cruises down the dock. Suddenly a racing boat halts outside the hangar. Peterson descends from the boat and dashes toward Jackson. Jackson gestures toward the dock. Peterson turns to see the ship cruising toward the channel. Peterson glances briefly at Sam, then takes a step toward the megaphone just inside the hangar window. His eyes flicker toward the megaphone."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Rick faces Renault with a gun, taking back some letters. As the airport is surrounded by fog, Renault arrives with Rick, who still covers him with the weapon. Laszlo and Ilsa exit a car, and the orderly escorts Laszlo to the plane. Rick gives Renault the letters of transit, and Renault countersigns them, surprising Ilsa. Major Strasser races to the airport, and as Rick hands the letters to Laszlo, the plane's engines start. Ilsa and Laszlo move toward the plane, and Rick watches with a blank expression. Strasser arrives just as the plane begins taxiing, glancing at the scene and moving towards the telephone, uncertain of his next action."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "His eyes dart towards the telephone Strasser looks briefly at Rick then makes a step towards the telephone just inside the hangar door Strasser turns to see the plane taxiing towards the runway Renault nods toward the field Strasser alights from the car and runs toward Renault Suddenly a speeding car comes to a stop outside the hangar The door to the plane is closed by an attendant and it slowly taxies down the field Rick puts a cigarette in his mouth Rick watches as Ilsa and Laszlo walk very deliberately towards the plane Then Laszlo breaks the silence He then glances at Laszlo as does Ilsa Ilsa looks at Rick and he returns her stare with a blank expression They all turn to see the plane readying for takeoff On the airfield the airplane engine turns over and the propellers start turning Laszlo extends his hand to Rick who grasps it firmly Rick hands the letters to Laszlo He walks back out to Laszlo Rick walks into the hangar and Renault hands him the letters Laszlo returns He honks his horn furiously Strasser drives at breakneck speed towards the airport Major Rick puts his hand to her chin and raises her face to meet his own Ilsa's eyes well up with tears Renault countersigns the papers Rick's intention suddenly dawns on Ilsa Both Ilsa and Renault look at Rick with astonishment Renault stops dead in his tracks and turns around Rick takes the letters of transit out of his pocket and hands them to Renault who turns and walks toward the hangar The orderly escorts Laszlo off in the direction of the plane Laszlo and take care of his luggage Laszlo and Ilsa emerge from the rear of the car He is closely followed by Rick right hand in the pocket of his trench coat covering Renault with a gun Renault gets out while the orderly stands at attention He hangs up and moves to a car that has just pulled up outside the hangar A uniformed orderly uses a telephone near the hangar door On the airfield a transport plane is being readied The outline of the transport plane is barely visible The entire airport is surrounded by a heavy fog He hangs up the receiver and grabbing for his cap hurriedly exits An officer quickly enters He hangs up the receiver and presses a buzzer on his desk Strasser is on the phone As Renault picks up the phone and dials Rick takes back the letters He walks to a table and sits Renault halts for a moment and studies Rick In Rick's hand is a gun which he levels at Renault Suddenly the smile fades He smiles as he turns toward Rick"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Suddenly the smile fades He smiles as he turns toward Rick Renault halts for a moment and studies Rick In Rick's hand is a gun which he levels at Renault As Renault picks up the phone and dials Rick takes back the letters He walks to a table and sits He hangs up the receiver and presses a buzzer on his desk Strasser is on the phone He hangs up the receiver and grabbing for his cap hurriedly exits An officer quickly enters The outline of the transport plane is barely visible The entire airport is surrounded by a heavy fog A uniformed orderly uses a telephone near the hangar door On the airfield a transport plane is being readied Renault gets out while the orderly stands at attention He hangs up and moves to a car that has just pulled up outside the hangar Laszlo and Ilsa emerge from the rear of the car He is closely followed by Rick right hand in the pocket of his trench coat covering Renault with a gun The orderly escorts Laszlo off in the direction of the plane Laszlo and take care of his luggage Renault stops dead in his tracks and turns around Rick takes the letters of transit out of his pocket and hands them to Renault who turns and walks toward the hangar Rick's intention suddenly dawns on Ilsa Both Ilsa and Renault look at Rick with astonishment Ilsa's eyes well up with tears Renault countersigns the papers Major Rick puts his hand to her chin and raises her face to meet his own He honks his horn furiously Strasser drives at breakneck speed towards the airport Rick walks into the hangar and Renault hands him the letters Laszlo returns Rick hands the letters to Laszlo He walks back out to Laszlo On the airfield the airplane engine turns over and the propellers start turning Laszlo extends his hand to Rick who grasps it firmly Ilsa looks at Rick and he returns her stare with a blank expression They all turn to see the plane readying for takeoff Then Laszlo breaks the silence He then glances at Laszlo as does Ilsa Rick puts a cigarette in his mouth Rick watches as Ilsa and Laszlo walk very deliberately towards the plane Suddenly a speeding car comes to a stop outside the hangar The door to the plane is closed by an attendant and it slowly taxies down the field Renault nods toward the field Strasser alights from the car and runs toward Renault Strasser looks briefly at Rick then makes a step towards the telephone just inside the hangar door Strasser turns to see the plane taxiing towards the runway His eyes dart towards the telephone"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Ilsa's eyes well up with tears Rick puts his hand to her chin and raises her face to meet his own Major Strasser drives at breakneck speed towards the airport He honks his horn furiously Laszlo returns Rick walks into the hangar and Renault hands him the letters He walks back out to Laszlo Rick hands the letters to Laszlo Laszlo extends his hand to Rick who grasps it firmly On the airfield the airplane engine turns over and the propellers start turning They all turn to see the plane readying for takeoff Ilsa looks at Rick and he returns her stare with a blank expression He then glances at Laszlo as does Ilsa Then Laszlo breaks the silence Rick watches as Ilsa and Laszlo walk very deliberately towards the plane Rick puts a cigarette in his mouth The door to the plane is closed by an attendant and it slowly taxies down the field Suddenly a speeding car comes to a stop outside the hangar Strasser alights from the car and runs toward Renault Renault nods toward the field Strasser turns to see the plane taxiing towards the runway Strasser looks briefly at Rick then makes a step towards the telephone just inside the hangar door His eyes dart towards the telephone He smiles as he turns toward Rick Suddenly the smile fades In Rick's hand is a gun which he levels at Renault Renault halts for a moment and studies Rick He walks to a table and sits As Renault picks up the phone and dials Rick takes back the letters Strasser is on the phone He hangs up the receiver and presses a buzzer on his desk An officer quickly enters He hangs up the receiver and grabbing for his cap hurriedly exits The entire airport is surrounded by a heavy fog The outline of the transport plane is barely visible On the airfield a transport plane is being readied A uniformed orderly uses a telephone near the hangar door He hangs up and moves to a car that has just pulled up outside the hangar Renault gets out while the orderly stands at attention He is closely followed by Rick right hand in the pocket of his trench coat covering Renault with a gun Laszlo and Ilsa emerge from the rear of the car Laszlo and take care of his luggage The orderly escorts Laszlo off in the direction of the plane Rick takes the letters of transit out of his pocket and hands them to Renault who turns and walks toward the hangar Renault stops dead in his tracks and turns around Both Ilsa and Renault look at Rick with astonishment Rick's intention suddenly dawns on Ilsa Renault countersigns the papers"
        }
      ]
    }
  ]
}