{
  "ground_truth": "With him are Herr Heinze, the German consul, Captain Tonelli, an Italian officer, and Lieutenant Casselle, Renault's aide. On any occasion when Major Strasser is crossed, his expression hardens into iron. Herr Heinze steps up to him with upraised arm, and they shake hands. Heinze introduces Strasser to Renault, who salutes. Renault is a handsome, middle-aged Frenchman, debonair and gay, but also a shrewd and alert official. As they acknowledge each other, Captain Tonelli barges in front of Casselle and salutes Strasser, but Tonelli gets no further than that as Strasser turns again to Renault. They walk away from the plane, Heinze following, with Casselle and Tonelli bringing up the rear, engaged in a heated exchange of words. The neon sign above the door is brightly lit as customers arrive and go in through the front door. Again, we isolate on the neon sign before following a group of customers inside. Rick's is an expensive and chic nightclub which definitely possesses an air of sophistication and intrigue. The occupants of the room are varied, with Europeans in their dinner jackets, their women beautifully begowned and bejeweled. Sam, a middle-aged Negro, sits on a stool before a small, salmon-colored piano on wheels, playing and singing while accompanied by a small orchestra. There are Moroccans in silk robes, Turks wearing fezzes, and members of the Foreign Legion, distinguished by their kepis. Two men sit at a table, with one man's companion seemingly uninterested in his dilemma, and sympathy evidently in short supply in Casablanca. At another table, a very well-dressed woman talks to a Moor, and she has a bracelet on her wrist. At another table, two conspirators talk, and one stops abruptly as two German officers walk by. A refugee and another man converse at another table. On the way to the bar, we pass several tables and hear a Babel of foreign tongues. Carl, the waiter, is a fat, jovial German refugee with spectacles, who walks, tray in hand, to a private door, over which Abdul, a large, burly man, stands guard. Abdul opens the door, and Carl goes into the gambling room, where there is much activity at the various tables. At one table, two women and a man play cards and glance at another table. One of them calls to Carl, who laughs. The overseer walks up to a table with a paper in his hand, and we then see a drink and a man's hand, but nothing more. The overseer places a check on the table and then takes it. We now see Rick, an American of indeterminate age, sitting at a table alone playing solitary chess, as there is a commotion at the door with people attempting to come into the gambling room.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "With him are Herr Heinze, the German ambassador, Captain Tonelli, an Italian officer, and Lieutenant Casselle, Renault's assistant. On any instance when Major Strasser is opposed, his visage hardens into steel. Herr Heinze approaches him with raised arm, and they grasp hands. Heinze presents Strasser to Renault, who salutes. Renault is a handsome, middle-aged Frenchman, suave and cheerful, but also a sharp and observant official. As they greet each other, Captain Tonelli barges in front of Casselle and salutes Strasser, but Tonelli proceeds no further as Strasser turns again to Renault. They stroll away from the aircraft, Heinze trailing, with Casselle and Tonelli bringing up the rear, involved in a heated exchange of words. The neon sign above the entrance is brightly illuminated as patrons arrive and go in through the front door. Again, we focus on the neon sign before following a group of patrons inside. Rick's is an expensive and stylish nightclub which certainly possesses an air of elegance and mystery. The occupants of the chamber are varied, with Europeans in their dinner jackets, their women beautifully attired and adorned. Sam, a middle-aged Black man, sits on a stool before a small, salmon-colored piano on wheels, playing and singing while accompanied by a compact orchestra. There are Moroccans in silk garments, Turks wearing fezzes, and members of the Foreign Legion, distinguished by their kepis. Two men sit at a table, with one man's companion apparently uninterested in his predicament, and compassion evidently in short supply in Casablanca. At another table, a very well-dressed woman converses with a Moor, and she has a bracelet on her wrist. At another table, two plotters converse, and one halts suddenly as two German officers stroll by. A refugee and another man converse at another table. On the way to the bar, we pass several tables and hear a Babel of foreign languages. Carl, the waiter, is a stout, jovial German refugee with glasses, who walks, tray in hand, to a private entrance, over which Abdul, a large, burly man, stands guard. Abdul opens the entrance, and Carl goes into the gambling space, where there is much activity at the various tables. At one table, two women and a man play cards and glance at another table. One of them calls to Carl, who laughs. The supervisor walks up to a table with a document in his hand, and we then see a beverage and a man's hand, but nothing more. The supervisor places a voucher on the table and then takes it. We now see Rick, an American of indefinite age, sitting at a table alone playing solitary chess, as there is a disturbance at the entrance with people trying to come into the gambling space."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "With him are Herr Heinze, the German consul, Captain Tonelli, an Italian officer, and Lieutenant Casselle, Renault's aide. On any occasion when Major Strasser is crossed, an iron-hard expression is worn by him. Herr Heinze steps up to him with upraised arm, and hands are shaken by them. Heinze introduces Strasser to Renault, who salutes. A handsome, middle-aged Frenchman, debonair and gay, but also a shrewd and alert official, describes Renault. As they acknowledge each other, Strasser is saluted by Captain Tonelli, who barges in front of Casselle, but no further is gotten by Tonelli as Strasser turns again to Renault. The plane is walked away from by them, with Heinze following, and Casselle and Tonelli bringing up the rear, while a heated exchange of words engages them. The neon sign above the door is brightly lit as customers arrive and enter through the front door. Again, we isolate on the neon sign before a group of customers is followed inside. Rick's is an expensive and chic nightclub which definitely possesses an air of sophistication and intrigue. The room is occupied by varied individuals, with Europeans in their dinner jackets, and their women beautifully begowned and bejeweled. Sam, a middle-aged Negro, sits on a stool before a small, salmon-colored piano on wheels, playing and singing while he is accompanied by a small orchestra. Moroccans in silk robes, Turks wearing fezzes, and members of the Foreign Legion, distinguishable by their kepis, can be seen. At a table sit two men, with the companion of one man seemingly uninterested in his dilemma, and sympathy is evidently in short supply in Casablanca. At another table, a very well-dressed woman talks to a Moor, and a bracelet is on her wrist. Two conspirators talk at another table, and one stops abruptly as two German officers walk by. A refugee and another man converse at another table. Several tables are passed by us on the way to the bar, and a Babel of foreign tongues is heard. Carl, the waiter, a fat, jovial German refugee with spectacles, walks, tray in hand, to a private door, over which Abdul, a large, burly man, stands guard. The door is opened by Abdul, and Carl goes into the gambling room, where much activity occurs at the various tables. Cards are played by two women and a man at one table, and glances are cast at another table. Carl is called by one of them, who laughs. A table is approached by the overseer with a paper in his hand, and a drink and a man's hand are then seen by us, but nothing more. A check is placed on the table by the overseer and then is taken by him. Rick, an American of indeterminate age, sits at a table alone playing solitary chess, as a commotion occurs at the door with people attempting to enter the gambling room."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "With Major Strasser are Herr Heinze, the German consul; Captain Tonelli, an Italian officer; and Lieutenant Casselle, Renault's aide. When challenged, Strasser's expression turns steely. Heinze greets him with an upraised arm, and they shake hands. Heinze introduces Strasser to Renault, a handsome, middle-aged, debonair, yet shrewd Frenchman, who salutes. As they acknowledge each other, Captain Tonelli interrupts to salute Strasser but is then ignored as Strasser refocuses on Renault. They move away from the plane, with Heinze following and Casselle and Tonelli trailing behind, arguing. The neon sign above the door glows brightly as customers enter. Rick's is a chic, sophisticated nightclub filled with diverse patrons: Europeans in dinner jackets, women elegantly dressed and adorned, Moroccans in silk, Turks in fezzes, and Foreign Legion members in kepis. Sam, a middle-aged Negro, plays the piano, singing alongside a small orchestra. At various tables, people converse: two men, with one uninterested in the other's plight, a well-dressed woman speaking to a Moor, and conspirators stopping as German officers pass. A refugee and another man talk nearby. On the way to the bar, foreign tongues blend together. Carl, a jovial, bespectacled German refugee, walks with a tray to a door guarded by Abdul, a burly man. Abdul opens it, and Carl enters the bustling gambling room. Two women and a man play cards, observing others as one calls Carl, who laughs. An overseer places and retrieves a check from a table. Rick, an American of indeterminate age, sits alone playing chess as a commotion arises at the door with people trying to enter the gambling room."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Herr Heinze, the German consul, Captain Tonelli, an Italian officer, and Lieutenant Casselle, Renault's aide, accompany Major Strasser. When Strasser is crossed, his expression hardens. Heinze shakes his hand and introduces him to Renault, who salutes. Renault, a handsome, middle-aged and witty Frenchman, shrewdly acknowledges Strasser. Tonelli salutes Strasser but gets ignored as Strasser turns to Renault. They walk from the plane with Heinze, Casselle, and Tonelli, who argue heatedly. The neon sign above the door glows as customers enter Rick's, an upscale nightclub full of sophistication. Europeans in dinner jackets, elegantly dressed women, Moroccans in silk, Turks in fezzes, and Foreign Legion members fill the room. Sam, a middle-aged Negro, plays piano with a small orchestra. At one table, two men converse, with little sympathy shown, and at another, a woman speaks to a Moor, her bracelet visible. Two conspirators hush as German officers pass. We hear various languages on the way to the bar. Carl, a jovial German refugee and waiter, takes a tray into the gambling room, guarded by Abdul. Inside, two women and a man play cards and call Carl, who laughs. The overseer places a check on a table, then we see Rick, an American, playing solitary chess as a commotion arises at the door."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Accompanying him are Herr Heinze, who holds the prestigious position of German consul, Captain Tonelli, an officer representing the Italian military, and Lieutenant Casselle, who serves as an aide to Renault. Whenever Major Strasser encounters opposition or any form of resistance, his facial expression transforms dramatically, hardening into an unmoving visage of iron. Herr Heinze promptly approaches Strasser, extending an arm in a formal gesture, and the two men engage in a handshake. Heinze then proceeds to introduce Strasser to Renault, who responds with a formal salute. Renault is a strikingly handsome Frenchman, moderately aged, exuding an air of charm and carefree elegance, yet he remains perceptive and astute in his official duties. As Strasser and Renault exchange acknowledgments, Captain Tonelli makes an abrupt move, stepping in front of Casselle, and offers a sharp salute to Strasser, but he goes no further in the interaction since Strasser quickly redirects his focus back to Renault. Together, they begin to walk away from the plane, with Heinze trailing closely behind. Casselle and Tonelli follow them, deeply engaged in a spirited and animated exchange of words. \n\nAbove the entrance, the neon sign is vividly illuminated, casting a bright glow as customers steadily arrive and step through the front door. Once again, our attention lingers momentarily on the neon sign before we follow a lively group of patrons inside. Rick's is a nightclub of considerable expense and chic sophistication, possessing an undeniable aura of mystery and allure. The room's occupants are a diverse mix, featuring Europeans elegantly attired in their formal dinner jackets, while their female companions are exquisitely adorned, with beautiful gowns and shimmering jewels. Seated on a stool before a modest, salmon-colored piano that's set on wheels, Sam, a middle-aged Negro, provides musical entertainment, playing and singing as he is accompanied by a small orchestra. Among the crowd, there are Moroccans dressed in luxurious silk robes, Turks distinguished by their traditional fezzes, and members of the storied Foreign Legion, identifiable by their kepis.\n\nAt one table, two men are seated, with one man’s companion appearing completely disinterested in his predicament, highlighting the scarcity of sympathy in Casablanca. Elsewhere, a very well-dressed woman engages in conversation with a Moor, her wrist adorned with a glinting bracelet. At yet another table, two conspirators are engrossed in discussion, only for one of them to halt suddenly as two German officers march past. A refugee and another man are engaged in conversation at another nearby table. As we make our way toward the bar, we pass several other tables, hearing a cacophony of foreign languages being spoken. Carl, a jovial and rotund German refugee who wears spectacles, is a waiter carrying a tray as he approaches a private door guarded by Abdul, who is a large and muscular man. Abdul opens the door, allowing Carl to enter the bustling gambling room, where activity is rife at the various gaming tables. At one of these tables, two women and a man are involved in a game of cards, occasionally glancing over at another table. One of them calls out to Carl, who responds with a hearty laugh. The overseer, holding a paper, approaches a table, and we catch a glimpse of a drink and a man’s hand, though little else is revealed. The overseer places a check on the table and swiftly retrieves it. Finally, we focus on Rick, an American whose exact age is an enigma, as he sits in solitude at a table, engrossed in a game of solitary chess. Simultaneously, there is a commotion near the door as numerous people attempt to gain entry into the vibrant gambling room."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Accompanying him on this occasion are Herr Heinze, who currently holds the prestigious and notable position of German consul, Captain Tonelli, an officer representing the Italian military forces, and Lieutenant Casselle, who dutifully serves as an aide to Renault. Whenever Major Strasser finds himself encountering any form of opposition or resistance, be it significant or minor, his facial expression undergoes a dramatic transformation, hardening into an unmoving visage of iron. Herr Heinze promptly steps forward and approaches Strasser, extending an arm in a formal and respectful gesture, and the two men proceed to engage in a friendly handshake. Heinze then smoothly transitions to introducing Strasser to Renault, who responds appropriately with a formal salute. Renault is a strikingly handsome Frenchman, moderately aged, exuding an air of undeniable charm and carefree elegance, yet he remains perceptive and astute in his official duties. As Strasser and Renault exchange courteous acknowledgments, Captain Tonelli makes an abrupt and decisive move, stepping in front of Casselle, and offers a sharp salute to Strasser, but he goes no further in the interaction since Strasser quickly redirects his focus back to Renault. Together, Strasser and Renault begin to walk away from the plane, with Heinze closely trailing behind them. Casselle and Tonelli follow them as well, deeply engaged in a spirited and animated exchange of words.\n\nAbove the entrance, the vivid neon sign is brightly illuminated, casting a resplendent glow as customers steadily arrive and step eagerly through the front door. Once again, our attention lingers momentarily on the vibrant neon sign before we follow a lively and animated group of patrons inside. Rick's is a nightclub of considerable expense and chic sophistication, possessing an undeniable aura of mystery and allure that captivates all who enter. The room's occupants present a diverse mix of individuals, featuring Europeans elegantly attired in their formal dinner jackets, while their female companions are exquisitely adorned, with beautiful gowns and shimmering jewels that catch the eye. Seated on a simple stool before a modest, salmon-colored piano that's conveniently set on wheels, Sam, a middle-aged Negro, provides musical entertainment, playing and singing as he is accompanied by a small but talented orchestra. Among the crowd, there are Moroccans dressed in luxurious silk robes, Turks distinguished by their traditional fezzes, and members of the storied Foreign Legion, who are easily identifiable by their kepis.\n\nAt one table, two men are seated, with one man’s companion appearing utterly disinterested in his predicament, highlighting the scarcity of sympathy that seems to pervade Casablanca. Elsewhere, a very well-dressed woman engages in animated conversation with a Moor, her wrist adorned with a glinting bracelet that catches the light. At yet another table, two conspirators are engrossed in a serious discussion, only for one of them to halt suddenly as two German officers march past. A refugee and another man are engaged in deep conversation at another nearby table. As we make our way toward the bustling bar, we pass several other tables, hearing a delightful cacophony of foreign languages being spoken. Carl, a jovial and rotund German refugee who wears spectacles, is a waiter carrying a tray as he approaches a private door guarded by Abdul, a large and muscular man. With a nod, Abdul opens the door, allowing Carl to enter the bustling gambling room, where activity is rife at the various gaming tables. At one of these tables, two women and a man are involved in a game of cards, occasionally glancing over at another table with curiosity. One of them calls out to Carl, who responds with a hearty and infectious laugh. The overseer, holding a paper in hand, approaches a table. We catch a glimpse of a drink and a man’s hand, though little else is revealed. The overseer places a check on the table, swiftly retrieving it once exchanged. Finally, we focus on Rick, an American whose exact age remains an enigma, as he sits in solitude at a table, engrossed in a game of solitary chess. Simultaneously, there is a commotion near the door as numerous eager people attempt to gain entry into the vibrant and lively gambling room."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Accompanying him are Herr Heinze, the German consul, Captain Tonelli, an Italian officer, and Lieutenant Casselle, who serves as Renault's aide. In any situation where Major Strasser feels opposed or challenged, his facial expression transforms, becoming as hard and unyielding as iron. Herr Heinze approaches Strasser, lifting his arm in greeting, and they engage in a firm handshake. Following this, Heinze introduces Strasser to Renault, who responds by executing a formal salute. Renault, a striking and suave middle-aged Frenchman, exudes an air of charm and gaiety, yet he is also perceptive and vigilant in his official duties. As they exchange acknowledgments, Captain Tonelli abruptly moves in front of Casselle, presenting a salute to Strasser. However, Tonelli's efforts to continue are cut short when Strasser redirects his attention back to Renault. Together, they begin to walk away from the airplane, with Heinze trailing closely behind them, while Casselle and Tonelli, engaged in an animated discussion, follow at a slight distance in the rear. As they proceed, the neon sign above the entrance glows brightly, illuminating the scene as patrons arrive and make their way through the front door. Our focus briefly lingers on the neon sign before transitioning inside with a group of arriving customers. Rick's is an upscale and fashionable nightclub that exudes an atmosphere of sophistication and mystery. The room's occupants present a diverse tableau: Europeans adorn themselves in dinner jackets, their companions resplendent in elegant gowns and glittering jewels. Positioned on a stool in front of a compact, salmon-hued piano on wheels, Sam, a middle-aged African-American, plays and sings, his performance harmoniously accompanied by a small orchestra. Adding to the setting's cultural richness are Moroccans clad in silk robes, Turks distinguished by their fezzes, and members of the Foreign Legion identifiable by their kepis. Seated at one table, two men converse, though one man's companion displays a marked lack of interest in his predicament, highlighting a scarcity of empathy in Casablanca. At a different table, a woman who is impeccably dressed engages in conversation with a Moor, her wrist adorned with a bracelet that captures the light. Meanwhile, at another table, two conspirators exchange whispers, halting their dialogue as two German officers stride past. Elsewhere in the room, a conversation unfolds between a refugee and another man at yet another table. As we approach the bar, we traverse past numerous tables, surrounded by the cacophony of diverse languages mixing in the air. Carl, a portly and cheerful German refugee bespectacled and carrying a tray, makes his way to a secluded door, where Abdul, a large and formidable man, stands vigilant as the guardian. Abdul obligingly opens the door for Carl, who enters the bustling gambling room, alive with activity at the various gaming tables. At one such table, two women and a man play cards, occasionally casting glances toward an adjacent table. One participant calls out to Carl, eliciting a laugh in response. The overseer, meanwhile, approaches a table with a document in hand; we catch sight of a drink and a man's hand, but no more is revealed. The overseer deposits a check on the table, retrieves it, and then moves on. It is at this juncture that we encounter Rick, an American of indeterminate age, seated in solitude at one of the tables, absorbed in a game of solitary chess. Concurrently, a commotion unfolds at the door as patrons cluster, eager to enter the gambling room, adding to the lively atmosphere within."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "With him are Herr Heinze, the German consul, Captain Tonelli, an Italian officer, and Lieutenant Casselle, Renault's aide. Major Strasser's demeanor becomes steely when challenged. Heinze greets Strasser with a handshake before introducing him to Renault, who salutes. Renault, a handsome and sharp French official, acknowledges Strasser. Captain Tonelli interrupts, saluting Strasser but is quickly sidelined as Strasser resumes his conversation with Renault. They move away from the plane with Heinze, while Casselle and Tonelli follow, engaged in a heated exchange.\n\nIn the vibrant and sophisticated atmosphere of Rick's nightclub, customers enter beneath the brightly lit neon sign. The club is filled with a diverse crowd: Europeans in formal wear, Moroccans in silk robes, Turks with fezzes, and Foreign Legion members with kepis. Sam, a middle-aged musician, plays and sings at a piano, accompanied by a small orchestra. Conversations vary around the room: one man receives little sympathy from his companion; a well-dressed woman talks to a Moor; two conspirators stop talking as German officers pass by; and a refugee converses with another man.\n\nAs we move toward the bar through a Babel of languages, Carl, a jovial German refugee waiter, carries a tray to a private door guarded by Abdul. Abdul opens the door, allowing Carl into the bustling gambling room. Here, two women and a man play cards and exchange looks with others at a nearby table before calling Carl over, prompting his laughter. The overseer arrives, placing and collecting a check from a table before we glimpse Rick, an American of indeterminate age, absorbed in solitary chess as a commotion grows at the door with people trying to enter the gambling room."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "With him are Herr Heinze, the German consul known for his diplomatic finesse during turbulent times, Captain Tonelli, an Italian officer with a reputation for strategic expertise, and Lieutenant Casselle, Renault's aide, who is recognized for his loyalty and quick thinking. On any occasion when Major Strasser is crossed, a German officer notorious for his strict adherence to protocol, his expression hardens into iron. Herr Heinze steps up to him with upraised arm, a customary gesture in formal greetings in Germany, and they shake hands. Heinze introduces Strasser to Renault, who salutes. Renault is a handsome, middle-aged Frenchman, debonair and gay, but also a shrewd and alert official known for his sharp intuition. As they acknowledge each other, Captain Tonelli barges in front of Casselle and salutes Strasser, but Tonelli gets no further than that as Strasser turns again to Renault. They walk away from the plane, Heinze following, with Casselle and Tonelli bringing up the rear, engaged in a heated exchange of words in Italian regarding recent military strategies. The neon sign above the door is brightly lit, casting a welcoming glow as customers arrive and go in through the front door. Again, we isolate on the neon sign before following a group of customers inside. Rick's is an expensive and chic nightclub, renowned in Casablanca for its air of sophistication and intrigue. The occupants of the room are varied, with Europeans in their dinner jackets, their women beautifully begowned and bejeweled, reflecting the diverse and cosmopolitan nature of the city. Sam, a middle-aged Negro known for his soulful music, sits on a stool before a small, salmon-colored piano on wheels, playing and singing while accompanied by a small orchestra, an essential element of the club’s charm. There are Moroccans in silk robes, Turks wearing fezzes, traditional headgear symbolizing Ottoman heritage, and members of the Foreign Legion, distinguished by their kepis, indicative of their rugged military service. Two men sit at a table, with one man's companion seemingly uninterested in his dilemma, and sympathy evidently in short supply in Casablanca, a city rife with intrigue and uncertainty. At another table, a very well-dressed woman talks to a Moor, and she has a bracelet on her wrist, a symbol of her affluent status. At another table, two conspirators talk, and one stops abruptly as two German officers walk by, aware of the ever-present threat of occupation. A refugee and another man converse at another table, likely discussing their precarious situation amidst the ongoing conflict. On the way to the bar, we pass several tables and hear a Babel of foreign tongues, reflecting the city’s role as a crossroads of cultures and nationalities. Carl, the waiter, is a fat, jovial German refugee with spectacles, who fled to escape persecution, walks, tray in hand, to a private door, over which Abdul, a large, burly man known for his unyielding demeanor, stands guard. Abdul opens the door, and Carl goes into the gambling room, where there is much activity at the various tables, a hive of enthusiastic betting and whispers. At one table, two women and a man play cards and glance at another table, where high-stakes poker is being played. One of them calls to Carl, who laughs, adding a moment of levity. The overseer, an enigmatic figure with an air of authority, walks up to a table with a paper in his hand, and we then see a drink and a man's hand, but nothing more. The overseer places a check on the table and then takes it, ensuring the house’s accounts are in order. We now see Rick, an American of indeterminate age with a mysterious past, sitting at a table alone playing solitary chess, a game symbolizing his strategic mind, as there is a commotion at the door with people attempting to come into the gambling room, eager to try their luck."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "With him are Herr Heinze the German consul Captain Tonelli an Italian officer and Lieutenant Casselle Renault's aide. On any occasion when Major Strasser is crossed his expression hardens into iron. Herr Heinze steps up to him with upraised arm and they shake hands. Heinze introduces Strasser to Renault who salutes. Renault is a handsome middleaged Frenchman debonair and gay but also a shrewd and alert official. As they acknowledge each other Captain Tonelli barges in front of Casselle and salutes Strasser but Tonelli gets no further than that as Strasser turns again to Renault. They walk away from the plane Heinze following with Casselle and Tonelli bringing up the rear engaged in a heated exchange of words. The neon sign above the door is brightly lit as customers arrive and go in through the front door. Again we isolate on the neon sign before following a group of customers inside. Rick's is an expensive and chic nightclub which definitely possesses an air of sophistication and intrigue. The occupants of the room are varied with Europeans in their dinner jackets their women beautifully begowned and bejeweled. Sam a middleaged Negro sits on a stool before a small salmoncolored piano on wheels playing and singing while accompanied by a small orchestra. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. There are Moroccans in silk robes Turks wearing fezzes and members of the Foreign Legion distinguished by their kepis. Two men sit at a table with one man's companion seemingly uninterested in his dilemma and sympathy evidently in short supply in Casablanca. At another table a very welldressed woman talks to a Moor and she has a bracelet on her wrist. At another table two conspirators talk and one stops abruptly as two German officers walk by. A refugee and another man converse at another table. On the way to the bar we pass several tables and hear a Babel of foreign tongues. Carl the waiter is a fat jovial German refugee with spectacles who walks tray in hand to a private door over which Abdul a large burly man stands guard. Abdul opens the door and Carl goes into the gambling room where there is much activity at the various tables. At one table two women and a man play cards and glance at another table. One of them calls to Carl who laughs. The overseer walks up to a table with a paper in his hand and we then see a drink and a man's hand but nothing more. The overseer places a check on the table and then takes it. We now see Rick an American of indeterminate age sitting at a table alone playing solitary chess as there is a commotion at the door with people attempting to come into the gambling room."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "With him are Herr Heinze the German consul Captain Tonelli an Italian officer and Lieutenant Casselle Renault's aide. On any occasion when Major Strasser is crossed his expression hardens into iron. Herr Heinze steps up to him with upraised arm and they shake hands. Heinze introduces Strasser to Renault who salutes. Renault is a handsome middleaged Frenchman debonair and gay but also a shrewd and alert official. As they acknowledge each other Captain Tonelli barges in front of Casselle and salutes Strasser but Tonelli gets no further than that as Strasser turns again to Renault. They walk away from the plane Heinze following with Casselle and Tonelli bringing up the rear engaged in a heated exchange of words. The neon sign above the door is brightly lit as customers arrive and go in through the front door. Again we isolate on the neon sign before following a group of customers inside. Rick's is an expensive and chic nightclub which definitely possesses an air of sophistication and intrigue. The occupants of the room are varied with Europeans in their dinner jackets their women beautifully begowned and bejeweled. Sam a middleaged Negro sits on a stool before a small salmoncolored piano on wheels playing and singing while accompanied by a small orchestra. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. There are Moroccans in silk robes Turks wearing fezzes and members of the Foreign Legion distinguished by their kepis. Two men sit at a table with one man's companion seemingly uninterested in his dilemma and sympathy evidently in short supply in Casablanca. At another table a very welldressed woman talks to a Moor and she has a bracelet on her wrist. At another table two conspirators talk and one stops abruptly as two German officers walk by. A refugee and another man converse at another table. On the way to the bar we pass several tables and hear a Babel of foreign tongues. Carl the waiter is a fat jovial German refugee with spectacles who walks tray in hand to a private door over which Abdul a large burly man stands guard. Abdul opens the door and Carl goes into the gambling room where there is much activity at the various tables. At one table two women and a man play cards and glance at another table. One of them calls to Carl who laughs. The overseer walks up to a table with a paper in his hand and we then see a drink and a man's hand but nothing more. The overseer places a check on the table and then takes it. We now see Rick an American of indeterminate age sitting at a table alone playing solitary chess as there is a commotion at the door with people attempting to come into the gambling room."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "With him are Herr Heinze the German consul Captain Tonelli an Italian officer and Lieutenant Casselle Renault's aide. On any occasion when Major Strasser is crossed his expression hardens into iron. Herr Heinze steps up to him with upraised arm and they shake hands. Heinze introduces Strasser to Renault who salutes. Renault is a handsome middleaged Frenchman debonair and gay but also a shrewd and alert official. As they acknowledge each other Captain Tonelli barges in front of Casselle and salutes Strasser but Tonelli gets no further than that as Strasser turns again to Renault. Carl the waiter is a fat jovial German refugee with spectacles who walks tray in hand to a private door over which Abdul a large burly man stands guard. Abdul opens the door and Carl goes into the gambling room where there is much activity at the various tables. At one table two women and a man play cards and glance at another table. One of them calls to Carl who laughs. The overseer walks up to a table with a paper in his hand and we then see a drink and a man's hand but nothing more. The overseer places a check on the table and then takes it. We now see Rick an American of indeterminate age sitting at a table alone playing solitary chess as there is a commotion at the door with people attempting to come into the gambling room."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "With him are Herr Heinze the German consul Captain Tonelli an Italian officer and Lieutenant Casselle Renault's aide. On any occasion when Major Strasser is crossed his expression hardens into iron. The overseer walks up to a table with a paper in his hand and we then see a drink and a man's hand but nothing more. The overseer places a check on the table and then takes it. We now see Rick an American of indeterminate age sitting at a table alone playing solitary chess as there is a commotion at the door with people attempting to come into the gambling room."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Accompanying her are Dr. Watson, the Polish ambassador, General Lopez, a Spanish poet, and Private Garcia, Ford's assistant. On any occasion when Corporal Nelson is ignored, his demeanor softens into rubber. Dr. Watson approaches her with a lowered flag, and they exchange nods. Watson introduces Nelson to Ford, who winks. Ford is a rugged, young Argentine, serious and reserved, but also a cunning and perceptive diplomat. As they acknowledge each other, General Lopez slides behind Garcia and winks at Nelson, but Lopez gets no further than that as Nelson turns again to Ford. They stroll toward the submarine, Watson trailing, with Garcia and Lopez trailing, involved in a silent game of charades. The wooden arch beside the window is dimly illuminated as tourists depart and climb out through the back window. Again, we focus on the wooden arch before trailing a band of tourists outside. Bob's is a modest and rustic barn which unmistakably exudes an air of simplicity and mystery. The attendees of the barn are assorted, with Australians in their t-shirts, their partners elegantly sneakered and hatted. Tom, a young Asian, leans on a bench beside a large, grape-colored harmonica on strings, strumming and humming while supported by a grand ensemble. There are Egyptians in cotton tunics, Greeks wearing helmets, and members of the Space Force, identified by their badges. Three women stand at a counter, with one woman's escort seemingly indifferent to her fortune, and compassion evidently in ample supply in Madrid. At another counter, a poorly-dressed man listens to an Egyptian, and he has a scarf around his neck. At another counter, three detectives whisper, and one pauses suddenly as three Italian dancers skip past. A merchant and a woman discuss at another counter. On the path to the stage, we pass numerous counters and hear a melody of alien tunes. Joe, the barista, is a skinny, cheerful Dutch traveler with binoculars, who jogs, mug in hand, to a public fountain, beside which Omar, a tiny, frail boy, sits cross-legged. Omar watches the fountain, and Joe heads into the theater, where there is little chaos at the several stages. At one stage, three children and a dog juggle hats and peek at another stage. One of them signals to Joe, who giggles. The usher strides to a stage with a ticket in her mouth, and we then glimpse a hat and a woman's shoe, but nothing else. The usher drops a napkin on the stage and then collects it. We then spot Tracy, a Canadian of specific age, standing at a stage by herself knitting complex scarves, as there is a riot by the window with birds striving to fly into the theater."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Major Strasser, Herr Heinze, Captain Tonelli, Lieutenant Casselle, and Renault gather at the airfield, with Strasser's expression turning stern when crossed. Heinze introduces Strasser to Renault, a debonair yet shrewd French official. As they move away from the plane, Heinze follows, while Casselle and Tonelli engage in a heated exchange. The neon sign above Rick's nightclub welcomes a diverse clientele, including Europeans in dinner jackets, Moroccans, Turks, and Foreign Legion members. Sam, a middle-aged musician, plays at the piano, creating an air of sophistication and intrigue. Conversations abound at various tables, with two men in a dilemma, a woman conversing with a Moor, and conspirators pausing as German officers walk by. Carl, a jovial German waiter, enters the bustling gambling room, where Rick, an American, sits playing solitary chess amid the commotion at the door."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "We now see Rick an American of indeterminate age sitting at a table alone playing solitary chess as there is a commotion at the door with people attempting to come into the gambling room The overseer places a check on the table and then takes it The overseer walks up to a table with a paper in his hand and we then see a drink and a man's hand but nothing more One of them calls to Carl who laughs At one table two women and a man play cards and glance at another table Abdul opens the door and Carl goes into the gambling room where there is much activity at the various tables Carl the waiter is a fat jovial German refugee with spectacles who walks tray in hand to a private door over which Abdul a large burly man stands guard On the way to the bar we pass several tables and hear a Babel of foreign tongues A refugee and another man converse at another table At another table two conspirators talk and one stops abruptly as two German officers walk by At another table a very welldressed woman talks to a Moor and she has a bracelet on her wrist Two men sit at a table with one man's companion seemingly uninterested in his dilemma and sympathy evidently in short supply in Casablanca There are Moroccans in silk robes Turks wearing fezzes and members of the Foreign Legion distinguished by their kepis Sam a middleaged Negro sits on a stool before a small salmoncolored piano on wheels playing and singing while accompanied by a small orchestra The occupants of the room are varied with Europeans in their dinner jackets their women beautifully begowned and bejeweled Rick's is an expensive and chic nightclub which definitely possesses an air of sophistication and intrigue Again we isolate on the neon sign before following a group of customers inside The neon sign above the door is brightly lit as customers arrive and go in through the front door They walk away from the plane Heinze following with Casselle and Tonelli bringing up the rear engaged in a heated exchange of words As they acknowledge each other Captain Tonelli barges in front of Casselle and salutes Strasser but Tonelli gets no further than that as Strasser turns again to Renault Renault is a handsome middleaged Frenchman debonair and gay but also a shrewd and alert official Heinze introduces Strasser to Renault who salutes Herr Heinze steps up to him with upraised arm and they shake hands On any occasion when Major Strasser is crossed his expression hardens into iron With him are Herr Heinze the German consul Captain Tonelli an Italian officer and Lieutenant Casselle Renault's aide"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "On any occasion when Major Strasser is crossed his expression hardens into iron With him are Herr Heinze the German consul Captain Tonelli an Italian officer and Lieutenant Casselle Renault's aide Heinze introduces Strasser to Renault who salutes Herr Heinze steps up to him with upraised arm and they shake hands As they acknowledge each other Captain Tonelli barges in front of Casselle and salutes Strasser but Tonelli gets no further than that as Strasser turns again to Renault Renault is a handsome middleaged Frenchman debonair and gay but also a shrewd and alert official The neon sign above the door is brightly lit as customers arrive and go in through the front door They walk away from the plane Heinze following with Casselle and Tonelli bringing up the rear engaged in a heated exchange of words Rick's is an expensive and chic nightclub which definitely possesses an air of sophistication and intrigue Again we isolate on the neon sign before following a group of customers inside Sam a middleaged Negro sits on a stool before a small salmoncolored piano on wheels playing and singing while accompanied by a small orchestra The occupants of the room are varied with Europeans in their dinner jackets their women beautifully begowned and bejeweled Two men sit at a table with one man's companion seemingly uninterested in his dilemma and sympathy evidently in short supply in Casablanca There are Moroccans in silk robes Turks wearing fezzes and members of the Foreign Legion distinguished by their kepis At another table two conspirators talk and one stops abruptly as two German officers walk by At another table a very welldressed woman talks to a Moor and she has a bracelet on her wrist On the way to the bar we pass several tables and hear a Babel of foreign tongues A refugee and another man converse at another table Abdul opens the door and Carl goes into the gambling room where there is much activity at the various tables Carl the waiter is a fat jovial German refugee with spectacles who walks tray in hand to a private door over which Abdul a large burly man stands guard One of them calls to Carl who laughs At one table two women and a man play cards and glance at another table The overseer places a check on the table and then takes it The overseer walks up to a table with a paper in his hand and we then see a drink and a man's hand but nothing more We now see Rick an American of indeterminate age sitting at a table alone playing solitary chess as there is a commotion at the door with people attempting to come into the gambling room"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Two men sit at a table with one man's companion seemingly uninterested in his dilemma and sympathy evidently in short supply in Casablanca At another table a very welldressed woman talks to a Moor and she has a bracelet on her wrist At another table two conspirators talk and one stops abruptly as two German officers walk by A refugee and another man converse at another table On the way to the bar we pass several tables and hear a Babel of foreign tongues Carl the waiter is a fat jovial German refugee with spectacles who walks tray in hand to a private door over which Abdul a large burly man stands guard Abdul opens the door and Carl goes into the gambling room where there is much activity at the various tables At one table two women and a man play cards and glance at another table One of them calls to Carl who laughs The overseer walks up to a table with a paper in his hand and we then see a drink and a man's hand but nothing more The overseer places a check on the table and then takes it We now see Rick an American of indeterminate age sitting at a table alone playing solitary chess as there is a commotion at the door with people attempting to come into the gambling room With him are Herr Heinze the German consul Captain Tonelli an Italian officer and Lieutenant Casselle Renault's aide On any occasion when Major Strasser is crossed his expression hardens into iron Herr Heinze steps up to him with upraised arm and they shake hands Heinze introduces Strasser to Renault who salutes Renault is a handsome middleaged Frenchman debonair and gay but also a shrewd and alert official As they acknowledge each other Captain Tonelli barges in front of Casselle and salutes Strasser but Tonelli gets no further than that as Strasser turns again to Renault They walk away from the plane Heinze following with Casselle and Tonelli bringing up the rear engaged in a heated exchange of words The neon sign above the door is brightly lit as customers arrive and go in through the front door Again we isolate on the neon sign before following a group of customers inside Rick's is an expensive and chic nightclub which definitely possesses an air of sophistication and intrigue The occupants of the room are varied with Europeans in their dinner jackets their women beautifully begowned and bejeweled Sam a middleaged Negro sits on a stool before a small salmoncolored piano on wheels playing and singing while accompanied by a small orchestra There are Moroccans in silk robes Turks wearing fezzes and members of the Foreign Legion distinguished by their kepis"
        }
      ]
    }
  ]
}