{
  "ground_truth": "Jason finally sits and smiles warmly, speaking in over-enunciated tones. Instead of seeing his father across a table, Evan looks up at a ceiling, which is blocked by Jason's monstrous, rage-filled face and cuffed hands choking him. Jason wrestles a baton from under his chin, strikes an orderly in the kneecap, and comes for Evan, but Orderly #2 quickly beats Jason with his baton. Andrea hugs Evan, now in shock. All eyes turn to Evan as he takes his lit cigarette, breaks off the filter, and jams the fuse into the unlit end. Lenny paces beside the three-story mailbox, trying to appear nonchalant, then pretends to notice an untied shoe and bends to tie it. Other kids watch anxiously from the woods. Lenny finally throws the bomb in the mailbox and sprints back to the woods, where Kayleigh shakes Lenny's inhaler and hands it to him. Evan pats Lenny on the back, and the four watch the mailbox intensely. Evan smiles with a cigarette between his lips and covers Kayleigh's ears with his hands; she smiles back and presses his hands against her head. Tommy catches this, seems disturbed, and turns back to the mailbox. He loses his footing, falls to the ground, and Lenny falls on top of him. Evan gets up, starts running, but realizes he's not followed. Kayleigh and Tommy are helping Lenny up, carrying him. Evan notices Lenny is completely dazed, so he doubles back, grabs Lenny's arm, and he and Tommy drag Lenny through the woods as fast as possible. Lenny's mother, Mrs. Kagan, frantically loads him into an ambulance. Andrea turns to a trembling Evan on the front stoop, and he looks helpless. Evan lies on the couch, and Andrea suppresses a tiny proud smile. Suddenly, Evan's eyes roll back, and he moans and shakes. Blood trickles from his nose as a guttural sound emerges. Andrea moves to stop the bleeding. Kayleigh, repulsed, darts from the aisle and runs out with Evan following her to a small alcove, where she begins to cry. He reaches to comfort her, but she winces and pulls back her shirt collar, revealing a larger, darker bruise. She looks into his eyes, and they lean in for a tender kiss, but jerk back to see Tommy, shocked and betrayed, staring at them from across a small crowd.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Jason ultimately perches and grins cordially, articulating in over-pronounced tones. Instead of observing his dad across a desk, Evan gazes up at a roof, which is obstructed by Jason's gigantic, anger-filled visage and restrained palms throttling him. Jason grapples a truncheon from beneath his chin, hits an attendant in the kneecap, and approaches Evan, but Attendant #2 swiftly thrashes Jason with his truncheon. Andrea embraces Evan, now in stupor. All gazes pivot to Evan as he takes his lit smoke, snaps off the filter, and jams the wick into the unlit tip. Lenny strides adjacent to the three-story postbox, attempting to seem casual, then feigns to notice an untied boot and leans to fasten it. Other children observe tensely from the forest. Lenny ultimately hurls the explosive in the postbox and dashes back to the forest, where Kayleigh shakes Lenny's inhaler and hands it to him. Evan pats Lenny on the spine, and the quartet observe the postbox intensely. Evan grins with a smoke between his lips and shields Kayleigh's ears with his palms; she grins back and presses his palms against her cranium. Tommy observes this, seems unsettled, and rotates back to the postbox. He loses his balance, tumbles to the ground, and Lenny tumbles atop him. Evan rises, starts sprinting, but realizes he's not pursued. Kayleigh and Tommy are assisting Lenny up, carrying him. Evan notices Lenny is completely stunned, so he doubles back, seizes Lenny's limb, and he and Tommy haul Lenny through the forest as swiftly as feasible. Lenny's mom, Mrs. Kagan, frantically loads him into a rescue vehicle. Andrea turns to a quivering Evan on the front doorstep, and he looks helpless. Evan reclines on the sofa, and Andrea stifles a tiny proud grin. Suddenly, Evan's eyes roll back, and he moans and trembles. Blood drips from his nostrils as a guttural noise emanates. Andrea moves to halt the bleeding. Kayleigh, repulsed, darts from the passage and runs out with Evan following her to a small recess, where she begins to weep. He reaches to console her, but she winces and pulls back her blouse collar, revealing a larger, darker contusion. She gazes into his eyes, and they lean in for a gentle kiss, but jerk back to see Tommy, shocked and betrayed, staring at them from across a small throng."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Jason finally sits and smiles warmly, speaking in over-enunciated tones. Instead of seeing his father across a table, Evan looks up at a ceiling, which Jason's monstrous, rage-filled face and cuffed hands block as they're choking him. A baton is wrestled by Jason from under his chin, an orderly is struck in the kneecap, and Evan is approached by Jason, but Orderly #2 quickly beats him with his baton. Andrea hugs Evan, now in shock. All eyes turn to Evan as his lit cigarette is taken by him, the filter is broken off, and the fuse is jammed into the unlit end. Lenny paces beside the three-story mailbox, trying to appear nonchalant, then an untied shoe is pretended to be noticed by him, and he bends to tie it. Other kids watch anxiously from the woods. The bomb is finally thrown by Lenny in the mailbox and he sprints back to the woods, where Kayleigh shakes Lenny's inhaler and hands it to him. Lenny is patted on the back by Evan, and the four watch the mailbox intensely. With a cigarette between his lips, Evan smiles and covers Kayleigh's ears with his hands; she smiles back and his hands are pressed by her against her head. Tommy catches this, seems disturbed, and turns back to the mailbox. His footing is lost, he falls to the ground, and Lenny falls on top of him. Evan gets up and starts running, but realizes he's not followed. Lenny is helped up by Kayleigh and Tommy, carrying him. Evan notices Lenny is completely dazed, so Lenny's arm is grabbed by him, and he and Tommy drag Lenny through the woods as fast as possible. Lenny is frantically loaded by his mother, Mrs. Kagan, into an ambulance. Andrea turns to a trembling Evan on the front stoop, and he looks helpless. Evan lies on the couch, and a tiny proud smile is suppressed by Andrea. Suddenly, Evan's eyes roll back, and he moans and shakes. Blood trickles from his nose as a guttural sound is uttered by him. Andrea moves to stop the bleeding. Kayleigh, repulsed, darts from the aisle and runs out with Evan following her to a small alcove, where she begins to cry. He reaches to comfort her, but she winces and pulls back her shirt collar, revealing a larger, darker bruise. She looks into his eyes, and a tender kiss is leaned in for by them, but they jerk back to see Tommy, shocked and betrayed, staring at them from across a small crowd."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Jason sits and smiles warmly, speaking clearly. Instead of seeing his father, Evan sees the ceiling blocked by Jason's rage-filled face and cuffed hands choking him. Jason grabs a baton, strikes an orderly, and comes for Evan, but another orderly quickly subdues Jason. Andrea hugs a shocked Evan. Everyone watches Evan take his lit cigarette, break off the filter, and insert the fuse. Lenny paces by a three-story mailbox, pretending to tie his shoe. Kids watch anxiously from the woods. Lenny throws the bomb in the mailbox and sprints back, where Kayleigh gives him his inhaler. Evan pats Lenny, and they all watch the mailbox. Evan smiles with a cigarette, and covers Kayleigh's ears, she smiles back, pressing his hands to her head. Tommy sees this, appears disturbed, and watches the mailbox. He falls, and Lenny falls on him. Evan runs, but realizes he's alone. Kayleigh and Tommy help Lenny up, and Evan returns to help drag Lenny through the woods. Mrs. Kagan frantically loads Lenny into an ambulance. Andrea faces a trembling Evan, who looks helpless. Evan lies on the couch as Andrea suppresses a proud smile. Suddenly, Evan shakes and bleeds from his nose. Andrea moves to stop it. Kayleigh, repulsed, runs out, and Evan follows her to an alcove where she cries. He reaches to comfort her, but she winces and pulls back her shirt collar, revealing a bruise. They lean in for a kiss but pull back, seeing Tommy staring at them, shocked and betrayed."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Jason sits, smiles warmly, and speaks clearly. Evan looks up at Jason’s enraged, looming face and cuffed hands choking him. Jason grabs a baton, attacks an orderly, and approaches Evan, but another orderly beats him down. Andrea hugs a shocked Evan. Evan lights a cigarette by exposing the fuse. Lenny, near a mailbox, pretends to tie his shoes, throws a bomb inside, and runs back to the woods. Kayleigh gives Lenny his inhaler, and Evan pats him, watching the mailbox intensely. Evan covers Kayleigh’s ears; she smiles and presses his hands to her head. Tommy notices this, seems disturbed, and falls; Lenny collapses on him. Evan runs, sees he is alone, and goes back to help carry a dazed Lenny. Lenny's mom, Mrs. Kagan, loads him into an ambulance. Andrea sees a trembling Evan and appears proud. Evan then bleeds from his nose, moaning; Andrea tries to stop it. Kayleigh, repulsed, runs out, Evan following her to comfort her. She shows him a bruise, and they lean in for a kiss but halt, seeing a shocked Tommy amidst a crowd."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Jason finally takes a seat and smiles warmly, speaking in overly emphasized tones that highlight each word he says. Rather than observing his father seated across a table, Evan instead glances up toward the ceiling, but his view is obstructed by Jason's monstrously rage-filled face and his cuffed hands, which are choking him. Jason begins to wrestle a baton from beneath Evan's chin, then strikes an orderly sharply in the kneecap before advancing toward Evan. However, Orderly #2 steps in swiftly and beats Jason with his baton to stop him. Andrea embraces Evan, who is now in a state of shock and disbelief. All eyes focus intently on Evan as he takes his lit cigarette, snaps off the filter, and deliberately jams the fuse into the unlit end. Meanwhile, Lenny paces beside the towering three-story mailbox, trying his best to appear calm and nonchalant. He pretends to suddenly notice an untied shoe, bending down to tie it as though it is a priority. Other kids watch anxiously from the safety of the woods. Finally, Lenny gathers the courage to throw the bomb into the mailbox and then sprints back to the woods with urgency. There, Kayleigh shakes Lenny's inhaler and hands it to him to help him regain his breath. Evan pats Lenny on the back reassuringly, and the four friends watch the mailbox with intense focus. Evan smiles with the cigarette poised between his lips and gently covers Kayleigh's ears with his hands; she returns his smile with warmth and presses his hands more firmly against her head. Tommy notices this interaction, appears disturbed by what he sees, and turns his attention back to the mailbox. In a moment of chaos, he loses his footing and falls to the ground, pulling Lenny down on top of him. Evan springs to his feet and starts to run but then realizes he is not being followed. Kayleigh and Tommy are busy helping Lenny back onto his feet, assisting him as he seems unable to stand alone. Observing that Lenny is completely dazed and disoriented, Evan doubles back, grabs hold of Lenny's arm, and, with Tommy, they drag Lenny as quickly as possible through the dense woods. Lenny's mother, Mrs. Kagan, is frantically loading him into an ambulance with urgency. Andrea turns her attention to a trembling Evan on the front stoop, noticing how helpless he appears. Evan lies down on the couch, and Andrea represses a small smile of pride. Suddenly, Evan's eyes roll back, and he begins to moan and shake uncontrollably. Blood trickles from his nose as a deep, guttural sound emerges. Andrea rushes to stop the bleeding immediately. Kayleigh, repulsed by the sight, darts from the aisle, running away with Evan following her to a small, secluded alcove where she starts to cry. He reaches out to comfort her, but she winces and pulls back her shirt collar, revealing a large, dark bruise. She looks deeply into his eyes, and they lean in for what seems like a tender kiss, but they jerk back abruptly when they see Tommy standing across a small crowd, shocked and feeling betrayed as he stares back at them."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Jason, at long last, finally settles into a seat, smiling in a manner that is both warm and inviting. He begins speaking in overly emphasized tones, each word he utters distinctly highlighted, adding a dramatic flair to his speech. Instead of focusing his attention on his father, who is seated directly across from him at the table, Evan chooses to cast his gaze upwards toward the ceiling. However, his view is obstructed by the terrifying sight of Jason's monstrously rage-filled face and his cuffed hands that are, quite literally, choking him. Jason then starts to wrestle a baton from under Evan's chin, successfully seizing it. With swift, sharp movements, he strikes an orderly sharply on the kneecap and then moves forward, advancing ominously toward Evan. However, Orderly #2 quickly intervenes and beats Jason with his baton, effectively stopping him. Meanwhile, Andrea envelops Evan in a comforting embrace, as he stands, overwhelmed by a state of shock and disbelief. Every eye in the room turns to focus intently on Evan as he takes his lit cigarette, snaps off the filter, and with deliberate intent, jams the fuse into the unlit end. \n\nIn the meantime, Lenny paces nervously beside the imposing, towering three-story mailbox, trying his best to exude an air of calmness and nonchalance. He pretends to suddenly notice that one of his shoes is untied, bending down to tie it as though it is of utmost importance. Other kids, standing at a safe distance within the cover of the woods, watch with anxious anticipation. Finally, summoning the courage he needs, Lenny throws the bomb into the mailbox and then dashes back to the woods with urgency and determination. There, Kayleigh shakes Lenny's inhaler and hands it to him, helping him regain his breath. Evan gives Lenny a reassuring pat on the back, and together, the four friends focus their intense attention on the mailbox. Evan, with the cigarette poised between his lips, smiles gently and covers Kayleigh's ears with his hands. She responds to his smile with warmth, pressing his hands more firmly against her head in a gesture of appreciation. Tommy notices this interaction, appearing visibly disturbed by what he observes. He then shifts his attention back to the mailbox. In a sudden moment of chaos, he loses his footing and falls to the ground, inadvertently pulling Lenny down on top of him. Evan quickly springs to his feet and prepares to run, but then he realizes he is not being followed. Kayleigh and Tommy are preoccupied with helping Lenny back onto his feet, assisting him as he seems unable to stand unassisted. Observing Lenny's state of complete daze and disorientation, Evan turns back, grabs hold of Lenny's arm, and, with Tommy's help, they drag Lenny as swiftly as possible through the dense woods. \n\nLenny's mother, Mrs. Kagan, is frantically and urgently loading him into an ambulance. Andrea, in the meantime, turns her attention to a trembling Evan, who stands on the front stoop, appearing utterly helpless. Evan then lies down on the couch, while Andrea suppresses a small smile of pride as she watches him. Suddenly, Evan's eyes roll back, and he begins to moan and shake uncontrollably. Blood starts trickling from his nose, and a deep, guttural sound comes forth. Andrea rushes to stop the bleeding immediately. Kayleigh, repulsed by the unsettling sight, darts away from the aisle, running off with Evan following her to a small, secluded alcove where she starts to cry. He reaches out to offer comfort, but she winces and pulls back her shirt collar, unveiling a large, dark bruise. She looks deeply into his eyes, and they both lean in as if preparing for a tender kiss. However, they abruptly jerk back when they notice Tommy standing across a small crowd, feeling shocked and betrayed as he stares back at them with wide eyes."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Jason finally settles into his seat, and a warm smile spreads across his face as he begins to speak, deliberately over-enunciating each word to ensure clarity. Meanwhile, Evan, expecting to see his father across a table, instead shifts his gaze upward, only to find his view of the ceiling obstructed by the menacing sight of Jason's monstrous, rage-filled face. In a swift, aggressive motion, Jason's cuffed hands reach out, choking Evan. Struggling under the pressure, Jason wrestles a baton from beneath his own chin and, with a sudden burst of energy, strikes an orderly forcefully in the kneecap. He then turns his fury toward Evan, but just as quickly, Orderly #2 reacts, expertly wielding his baton to subdue Jason. Amidst the chaos, Andrea instinctively embraces Evan, who stands frozen in shock, prompting everyone in the vicinity to focus their attention on him. In a moment of eerily calm determination, Evan takes a lit cigarette, meticulously snapping off the filter, and strategically inserts the fuse into the unlit end. Meanwhile, Lenny, attempting to maintain an air of casual indifference, paces beside the imposing three-story mailbox. He feigns noticing an untied shoe, bends down to tie it, and captures the attention of the other kids, who observe anxiously from the woods. When the moment feels right, Lenny finally makes his move, hurling the bomb into the mailbox and immediately sprinting back to the safety of the woods, where Kayleigh, ever prepared, shakes Lenny's inhaler before handing it over to him. Evan offers Lenny an encouraging pat on the back, and together, the group fixes their eyes intently on the mailbox. With a cigarette dangling from his lips, Evan grins and instinctively cups his hands over Kayleigh's ears, prompting her to smile and press his hands more firmly against her head. Observing this tender exchange, Tommy appears unsettled and chooses to refocus on the mailbox. In his distraction, he loses his balance, toppling to the ground, with Lenny inadvertently falling on top of him. Reacting quickly, Evan rises and begins to run, only to realize moments later that he's the sole one in motion. Glancing back, he notices Kayleigh and Tommy assisting a visibly disoriented Lenny to his feet. Assessing the situation, Evan hurries back, grips Lenny's arm, and, with urgency, he and Tommy pull Lenny along, racing through the woods to safety. They reach a flurry of activity as Lenny's mother, Mrs. Kagan, is seen anxiously loading him into an ambulance. Meanwhile, Andrea stands on the front stoop, her gaze turning towards Evan, who is visibly trembling, appearing vulnerable and lost. Inside, Evan reclines on the couch, a small, proud smile tugging at Andrea's lips as she watches him. Abruptly, Evan's serene state shatters; his eyes roll back as he emits a moan, his body shaking uncontrollably. Blood begins to trickle from his nose, accompanied by a deep, guttural sound. With quick but gentle hands, Andrea rushes to stanch the bleeding. In a separate scene, Kayleigh, overwhelmed by revulsion, swiftly exits an aisle, and Evan follows her into a secluded alcove, where she succumbs to tears. As he reaches out to console her, Kayleigh hesitates, pulling back her shirt collar to reveal a large, dark bruise. This revelation holds them in a moment of shared understanding, leading them to lean in for a tender kiss. However, their intimate moment is abruptly interrupted as they jerk back, their eyes locking onto Tommy, who stands amidst a small crowd, his expression a mix of shock and betrayal."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Jason sits and smiles warmly, speaking in over-enunciated tones. Evan, instead of seeing his father, looks up to find Jason's monstrous, rage-filled face and cuffed hands choking him. Jason wrests a baton from under his chin, strikes an orderly in the kneecap, and moves toward Evan, but is quickly subdued by another orderly. Andrea hugs the shocked Evan. Attention shifts as Evan takes his lit cigarette, breaks off the filter, and uses it to ignite a fuse. Lenny, appearing casual, paces beside the mailbox, feigns to tie his shoe, then throws the bomb inside and sprints back to the woods. There, Kayleigh hands him an inhaler. Evan pats Lenny in support, and the group watches the mailbox intensely. Evan, with a cigarette between his lips, covers Kayleigh's ears. She smiles, pressing his hands to her head, while Tommy observes, disturbed. Tommy then falls, with Lenny collapsing onto him. Evan starts running but sees he's alone, so he returns to help carry a dazed Lenny through the woods with Tommy. Lenny's mother, Mrs. Kagan, hastily loads him into an ambulance. Andrea turns to a trembling, helpless Evan on the stoop. Later, Evan lies on the couch as Andrea suppresses a proud smile. Suddenly, Evan's eyes roll back, shaking and moaning as blood trickles from his nose. Andrea moves to stop the bleeding. Disturbed, Kayleigh runs out of the aisle, followed by Evan to a small alcove where she begins to cry. He tries to comfort her, but she pulls back her shirt, revealing a bruise. They share a tender moment, leaning in for a kiss, but abruptly pull back at the sight of Tommy watching them, shocked and betrayed."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Jason finally sits and smiles warmly, speaking in over-enunciated tones, a habit he picked up during his years in theater. Instead of seeing his father across a table, Evan looks up at a ceiling reminiscent of the one at their family home, which is blocked by Jason's monstrous, rage-filled face and cuffed hands choking him. Jason, with a burst of unexpected strength, wrestles a baton from under his chin, strikes an orderly, who had served in the military, in the kneecap, and comes for Evan, but Orderly #2, known for his quick reflexes, quickly beats Jason with his baton. Andrea, a long-time family friend, hugs Evan, now in shock. All eyes turn to Evan as he takes his lit cigarette, a habit he picked up after his parents' divorce, breaks off the filter, and jams the fuse into the unlit end. Lenny paces beside the three-story mailbox, renowned in the town for its historical significance, trying to appear nonchalant, then pretends to notice an untied shoe and bends to tie it. Other kids, who had been planning this event for weeks, watch anxiously from the woods. Lenny finally throws the bomb in the mailbox and sprints back to the woods, where Kayleigh, who had packed an emergency kit, shakes Lenny's inhaler and hands it to him. Evan pats Lenny on the back, and the four watch the mailbox intensely, memories of past pranks flashing in their minds. Evan smiles with a cigarette between his lips and covers Kayleigh's ears with his hands; she smiles back, remembering how he always knew how to calm her, and presses his hands against her head. Tommy catches this, seems disturbed by the growing bond between them, and turns back to the mailbox. He loses his footing, falls to the ground, and Lenny, whose balance had always been poor, falls on top of him. Evan gets up, starts running, but realizes he's not followed. Kayleigh and Tommy are helping Lenny up, carrying him. Evan notices Lenny is completely dazed by the events, so he doubles back, grabs Lenny's arm, and he and Tommy drag Lenny through the woods as fast as possible. Lenny's mother, Mrs. Kagan, known for her nurturing nature, frantically loads him into an ambulance. Andrea turns to a trembling Evan on the front stoop of the hospital, and he looks helpless. Evan lies on the couch, and Andrea suppresses a tiny proud smile, recalling his resilience from childhood. Suddenly, Evan's eyes roll back, and he moans and shakes, a condition his doctor had warned might occur. Blood trickles from his nose as a guttural sound emerges. Andrea moves to stop the bleeding, her years of first-aid training coming in handy. Kayleigh, repulsed by the sight, darts from the aisle and runs out with Evan following her to a small alcove in the park, where she begins to cry. He reaches to comfort her, but she winces and pulls back her shirt collar, revealing a larger, darker bruise, a souvenir from their last fight. She looks into his eyes, and they lean in for a tender kiss, a moment they had both anticipated, but jerk back to see Tommy, shocked and betrayed by his friends' closeness, staring at them from across a small crowd of onlookers."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Jason finally sits and smiles warmly speaking in overenunciated tones. Instead of seeing his father across a table Evan looks up at a ceiling which is blocked by Jason's monstrous ragefilled face and cuffed hands choking him. Jason wrestles a baton from under his chin strikes an orderly in the kneecap and comes for Evan but Orderly 2 quickly beats Jason with his baton. Andrea hugs Evan now in shock. All eyes turn to Evan as he takes his lit cigarette breaks off the filter and jams the fuse into the unlit end. Lenny paces beside the threestory mailbox trying to appear nonchalant then pretends to notice an untied shoe and bends to tie it. Other kids watch anxiously from the woods. Lenny finally throws the bomb in the mailbox and sprints back to the woods where Kayleigh shakes Lenny's inhaler and hands it to him. Evan pats Lenny on the back and the four watch the mailbox intensely. Evan smiles with a cigarette between his lips and covers Kayleigh's ears with his hands. she smiles back and presses his hands against her head. Tommy catches this seems disturbed and turns back to the mailbox. He loses his footing falls to the ground and Lenny falls on top of him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Evan gets up starts running but realizes he is not followed. Kayleigh and Tommy are helping Lenny up carrying him. Evan notices Lenny is completely dazed so he doubles back grabs Lenny's arm and he and Tommy drag Lenny through the woods as fast as possible. Lenny's mother. Mrs Kagan frantically loads him into an ambulance. Andrea turns to a trembling Evan on the front stoop and he looks helpless. Evan lies on the couch and Andrea suppresses a tiny proud smile. Suddenly Evan's eyes roll back and he moans and shakes. Blood trickles from his nose as a guttural sound emerges. Andrea moves to stop the bleeding. Kayleigh repulsed darts from the aisle and runs out with Evan following her to a small alcove where she begins to cry. He reaches to comfort her but she winces and pulls back her shirt collar revealing a larger darker bruise. She looks into his eyes and they lean in for a tender kiss but jerk back to see Tommy shocked and betrayed staring at them from across a small crowd."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Jason finally sits and smiles warmly speaking in overenunciated tones. Instead of seeing his father across a table Evan looks up at a ceiling which is blocked by Jason's monstrous ragefilled face and cuffed hands choking him. Jason wrestles a baton from under his chin strikes an orderly in the kneecap and comes for Evan but Orderly 2 quickly beats Jason with his baton. Andrea hugs Evan now in shock. All eyes turn to Evan as he takes his lit cigarette breaks off the filter and jams the fuse into the unlit end. Lenny paces beside the threestory mailbox trying to appear nonchalant then pretends to notice an untied shoe and bends to tie it. Other kids watch anxiously from the woods. Lenny finally throws the bomb in the mailbox and sprints back to the woods where Kayleigh shakes Lenny's inhaler and hands it to him. Evan pats Lenny on the back and the four watch the mailbox intensely. Evan smiles with a cigarette between his lips and covers Kayleigh's ears with his hands. she smiles back and presses his hands against her head. Tommy catches this seems disturbed and turns back to the mailbox. He loses his footing falls to the ground and Lenny falls on top of him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Evan gets up starts running but realizes he is not followed. Kayleigh and Tommy are helping Lenny up carrying him. Evan notices Lenny is completely dazed so he doubles back grabs Lenny's arm and he and Tommy drag Lenny through the woods as fast as possible. Lenny's mother. Mrs Kagan frantically loads him into an ambulance. Andrea turns to a trembling Evan on the front stoop and he looks helpless. Evan lies on the couch and Andrea suppresses a tiny proud smile. Suddenly Evan's eyes roll back and he moans and shakes. Blood trickles from his nose as a guttural sound emerges. Andrea moves to stop the bleeding. Kayleigh repulsed darts from the aisle and runs out with Evan following her to a small alcove where she begins to cry. He reaches to comfort her but she winces and pulls back her shirt collar revealing a larger darker bruise. She looks into his eyes and they lean in for a tender kiss but jerk back to see Tommy shocked and betrayed staring at them from across a small crowd."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Jason finally sits and smiles warmly speaking in overenunciated tones. Instead of seeing his father across a table Evan looks up at a ceiling which is blocked by Jason's monstrous ragefilled face and cuffed hands choking him. Jason wrestles a baton from under his chin strikes an orderly in the kneecap and comes for Evan but Orderly 2 quickly beats Jason with his baton. Andrea hugs Evan now in shock. All eyes turn to Evan as he takes his lit cigarette breaks off the filter and jams the fuse into the unlit end. Lenny paces beside the threestory mailbox trying to appear nonchalant then pretends to notice an untied shoe and bends to tie it. Other kids watch anxiously from the woods. Suddenly Evan's eyes roll back and he moans and shakes. Blood trickles from his nose as a guttural sound emerges. Andrea moves to stop the bleeding. Kayleigh repulsed darts from the aisle and runs out with Evan following her to a small alcove where she begins to cry. He reaches to comfort her but she winces and pulls back her shirt collar revealing a larger darker bruise. She looks into his eyes and they lean in for a tender kiss but jerk back to see Tommy shocked and betrayed staring at them from across a small crowd."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Jason finally sits and smiles warmly speaking in overenunciated tones. Instead of seeing his father across a table Evan looks up at a ceiling which is blocked by Jason's monstrous ragefilled face and cuffed hands choking him. Jason wrestles a baton from under his chin strikes an orderly in the kneecap and comes for Evan but Orderly 2 quickly beats Jason with his baton. Kayleigh repulsed darts from the aisle and runs out with Evan following her to a small alcove where she begins to cry. He reaches to comfort her but she winces and pulls back her shirt collar revealing a larger darker bruise. She looks into his eyes and they lean in for a tender kiss but jerk back to see Tommy shocked and betrayed staring at them from across a small crowd."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Marcus finally jumps and laughs softly, singing in mispronounced whispers. Instead of discovering his mentor beneath a bridge, Oliver glances down at a floor, which is obscured by Marcus's tiny, joyful grin and opened palms tickling him. Marcus slides a rope from beneath his elbow, pats a gardener on the shoulder, and heads for Oliver, but Gardener #7 swiftly hugs Marcus with her rope. Sophia dances with Oliver, who is bewildered. All feet turn to Oliver as he removes his wet mitten, pulls off the thumb, and taps the wick into the unburned end. Riley skips beside the five-story gazebo, concealing her excitement, then pretends to hear a distant bell and stretches to reach it. Other dogs observe curiously from the barn. Riley eventually tosses the gear into the gazebo and hops back to the barn, where Samantha twists Riley's whistle and offers it to her. Oliver taps Riley on the head, and the seven study the gazebo closely. Oliver laughs with a mitten between his teeth and covers Samantha's elbows with his feet; she laughs back and presses his feet against her arms. Johnny notices this, appears amused, and glances back at the gazebo. He gains his balance, rises to his feet, and Riley climbs beneath him. Oliver falls down, starts crawling, but understands he's not chased. Samantha and Johnny are assisting Riley down, lifting her. Oliver sees Riley is completely calm, so he rolls forward, nudges Riley's wrist, and he and Johnny hoist Riley through the barn as calmly as possible. Riley's father, Mr. Logan, meticulously unloads her from a truck. Sophia turns to a trembling Oliver near the back porch, and he looks confused. Oliver jumps on the trampoline, and Sophia avoids a large proud laugh. Suddenly, Oliver's chest heaves, and he whispers and smiles. Paint drips from his ears as a melodic chant resonates. Sophia races to start the music. Samantha, intrigued, glides to the attic and dances out with Oliver trailing her to a narrow attic, where he begins to sing. She reaches to applaud him, but he chuckles and pushes up his hat brim, revealing a smaller, lighter ribbon. He peers into her hands, and they lean in for a gentle handshake, but jerk back to see Johnny, pleased and thrilled, admiring them from across a large gallery."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Jason smiles warmly but suddenly attacks Evan, who is saved by an orderly. Evan then prepares a bomb with his friends, including Lenny, who nervously places it in a mailbox before sprinting back to the woods. After an explosion, Lenny is dazed and helped by his friends. His mother rushes him to an ambulance. Evan, helpless on the stoop, later experiences a seizure. Meanwhile, Kayleigh runs out crying. Evan finds her, and she reveals a bruise. They almost kiss but are interrupted by a shocked Tommy, watching from a distance."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She looks into his eyes and they lean in for a tender kiss but jerk back to see Tommy shocked and betrayed staring at them from across a small crowd He reaches to comfort her but she winces and pulls back her shirt collar revealing a larger darker bruise Kayleigh repulsed darts from the aisle and runs out with Evan following her to a small alcove where she begins to cry Andrea moves to stop the bleeding Blood trickles from his nose as a guttural sound emerges Suddenly Evan's eyes roll back and he moans and shakes Evan lies on the couch and Andrea suppresses a tiny proud smile Andrea turns to a trembling Evan on the front stoop and he looks helpless Mrs Kagan frantically loads him into an ambulance Lenny's mother Evan notices Lenny is completely dazed so he doubles back grabs Lenny's arm and he and Tommy drag Lenny through the woods as fast as possible Kayleigh and Tommy are helping Lenny up carrying him Evan gets up starts running but realizes he is not followed He loses his footing falls to the ground and Lenny falls on top of him Tommy catches this seems disturbed and turns back to the mailbox she smiles back and presses his hands against her head Evan smiles with a cigarette between his lips and covers Kayleigh's ears with his hands Evan pats Lenny on the back and the four watch the mailbox intensely Lenny finally throws the bomb in the mailbox and sprints back to the woods where Kayleigh shakes Lenny's inhaler and hands it to him Other kids watch anxiously from the woods Lenny paces beside the threestory mailbox trying to appear nonchalant then pretends to notice an untied shoe and bends to tie it All eyes turn to Evan as he takes his lit cigarette breaks off the filter and jams the fuse into the unlit end Andrea hugs Evan now in shock Jason wrestles a baton from under his chin strikes an orderly in the kneecap and comes for Evan but Orderly 2 quickly beats Jason with his baton Instead of seeing his father across a table Evan looks up at a ceiling which is blocked by Jason's monstrous ragefilled face and cuffed hands choking him Jason finally sits and smiles warmly speaking in overenunciated tones"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Instead of seeing his father across a table Evan looks up at a ceiling which is blocked by Jason's monstrous ragefilled face and cuffed hands choking him Jason finally sits and smiles warmly speaking in overenunciated tones Andrea hugs Evan now in shock Jason wrestles a baton from under his chin strikes an orderly in the kneecap and comes for Evan but Orderly 2 quickly beats Jason with his baton Lenny paces beside the threestory mailbox trying to appear nonchalant then pretends to notice an untied shoe and bends to tie it All eyes turn to Evan as he takes his lit cigarette breaks off the filter and jams the fuse into the unlit end Lenny finally throws the bomb in the mailbox and sprints back to the woods where Kayleigh shakes Lenny's inhaler and hands it to him Other kids watch anxiously from the woods Evan smiles with a cigarette between his lips and covers Kayleigh's ears with his hands Evan pats Lenny on the back and the four watch the mailbox intensely Tommy catches this seems disturbed and turns back to the mailbox she smiles back and presses his hands against her head Evan gets up starts running but realizes he is not followed He loses his footing falls to the ground and Lenny falls on top of him Evan notices Lenny is completely dazed so he doubles back grabs Lenny's arm and he and Tommy drag Lenny through the woods as fast as possible Kayleigh and Tommy are helping Lenny up carrying him Mrs Kagan frantically loads him into an ambulance Lenny's mother Evan lies on the couch and Andrea suppresses a tiny proud smile Andrea turns to a trembling Evan on the front stoop and he looks helpless Blood trickles from his nose as a guttural sound emerges Suddenly Evan's eyes roll back and he moans and shakes Kayleigh repulsed darts from the aisle and runs out with Evan following her to a small alcove where she begins to cry Andrea moves to stop the bleeding She looks into his eyes and they lean in for a tender kiss but jerk back to see Tommy shocked and betrayed staring at them from across a small crowd He reaches to comfort her but she winces and pulls back her shirt collar revealing a larger darker bruise"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Evan gets up starts running but realizes he is not followed Kayleigh and Tommy are helping Lenny up carrying him Evan notices Lenny is completely dazed so he doubles back grabs Lenny's arm and he and Tommy drag Lenny through the woods as fast as possible Lenny's mother Mrs Kagan frantically loads him into an ambulance Andrea turns to a trembling Evan on the front stoop and he looks helpless Evan lies on the couch and Andrea suppresses a tiny proud smile Suddenly Evan's eyes roll back and he moans and shakes Blood trickles from his nose as a guttural sound emerges Andrea moves to stop the bleeding Kayleigh repulsed darts from the aisle and runs out with Evan following her to a small alcove where she begins to cry He reaches to comfort her but she winces and pulls back her shirt collar revealing a larger darker bruise She looks into his eyes and they lean in for a tender kiss but jerk back to see Tommy shocked and betrayed staring at them from across a small crowd Jason finally sits and smiles warmly speaking in overenunciated tones Instead of seeing his father across a table Evan looks up at a ceiling which is blocked by Jason's monstrous ragefilled face and cuffed hands choking him Jason wrestles a baton from under his chin strikes an orderly in the kneecap and comes for Evan but Orderly 2 quickly beats Jason with his baton Andrea hugs Evan now in shock All eyes turn to Evan as he takes his lit cigarette breaks off the filter and jams the fuse into the unlit end Lenny paces beside the threestory mailbox trying to appear nonchalant then pretends to notice an untied shoe and bends to tie it Other kids watch anxiously from the woods Lenny finally throws the bomb in the mailbox and sprints back to the woods where Kayleigh shakes Lenny's inhaler and hands it to him Evan pats Lenny on the back and the four watch the mailbox intensely Evan smiles with a cigarette between his lips and covers Kayleigh's ears with his hands she smiles back and presses his hands against her head Tommy catches this seems disturbed and turns back to the mailbox He loses his footing falls to the ground and Lenny falls on top of him"
        }
      ]
    }
  ]
}