{
  "ground_truth": "The prisoners begin screaming vicious taunts and catcalls at the fresh batch of new inmates as Evan tries to keep composed and walks toward his cell. Evan looks up to see one of the men leaning over the second tier, Karl, a huge muscular con with tattoos of swastikas and other Nazi symbols on his arm, blows a kiss at Evan and winks. Evan enters a dimly lit cell plastered with pictures of Jesus Christ and various Saints. Sitting on the bottom bunk is Carlos, a massive Hispanic convict covered with faded Indian ink jail tats of Christ in agony. Carlos stares at Evan disinterestedly as Evan makes up his bed on the top bunk. Carlos leaves the cell without another word. Evan sets his tray down at a table filled with Carlos and some other inmates. Carlos shrugs at Evan and offers him a roll. Her hair is now bottle-blonde. Four inches of Plexiglas separate the two and they talk on monitored phones. Andrea nods, holding up two comp books. They look at each other and Evan slowly lowers the phone. He hangs up, Andrea still pressing her phone to her ear. Evan walks closely behind Carlos through a corridor, clutching his journals. As he passes Karl, the Neo-Nazi, Karl reaches over and firmly grabs Evan's crotch. Evan stands there, stunned, unable to react when another Neo-Nazi, Rick, swats Evan's journals out of his hands and onto the floor. Life springs back into Evan as he rushes for the journals. He and Rick grab the journals at the same time, initiating a minor tug of war. Rick tears them away, Evan coming up with only a few torn pages. Evan sees the damage and goes mental. Evan holds a tattered journal entry in his hand and finishes up a conversation and then studies the page. We are back in Mrs. Boswell's first grade class where all of the children draw colorful pictures. As he heads over to them, Mrs. Boswell firmly grabs his shoulders and steers him back to his own desk. Evan, defeated, looks over at his blank piece of paper. He smiles mischievously and grabs some colored pencils. Soon enough, an image emerges: Evan holding a knife stands over a heap of several dead inmates, Karl and Rick. When done, he sneaks over to Mrs. Boswell's desk, where the two paper spindles sit. The metal needles reach up and skewer a number of paper notes and messages. She looks over in time to see Evan using all of his seven-year-old strength to whip his hands down toward the spindles. The moment before his palms reach them there's a brief instant where soundscapes collide and the world behind him vibrates.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The captives commence shouting ferocious insults and jeers at the fresh group of new detainees as Evan attempts to remain composed and strides toward his cell. Evan glances up to notice one of the individuals leaning over the second level, Karl, a gigantic brawny convict with tattoos of swastikas and other Nazi emblems on his arm, blows a kiss at Evan and winks. Evan enters a dimly illuminated cell festooned with images of Jesus Christ and various Saints. Sitting on the lower bunk is Carlos, an enormous Hispanic felon covered with faded Indian ink prison inkings of Christ in agony. Carlos gazes at Evan apathetically as Evan prepares his bed on the top bunk. Carlos departs the cell without a further word. Evan places his tray down at a table occupied with Carlos and some other detainees. Carlos shrugs at Evan and presents him a roll. Her hair is now bottle-blonde. Four inches of Plexiglas divide the two and they converse on monitored phones. Andrea nods, holding up two composition books. They gaze at each other and Evan gradually lowers the phone. He disconnects, Andrea still pressing her phone to her ear. Evan walks closely behind Carlos through a passageway, clutching his notebooks. As he passes Karl, the Neo-Nazi, Karl reaches over and securely seizes Evan's crotch. Evan stands there, astonished, unable to react when another Neo-Nazi, Rick, bats Evan's notebooks out of his hands and onto the floor. Vitality returns to Evan as he dashes for the notebooks. He and Rick grip the notebooks at the same time, initiating a minor tug of war. Rick rips them away, Evan coming up with only a few torn pages. Evan observes the damage and goes crazy. Evan holds a tattered journal entry in his hand and completes a conversation and then scrutinizes the page. We are back in Mrs. Boswell's first grade class where all of the children sketch colorful illustrations. As he approaches them, Mrs. Boswell firmly seizes his shoulders and guides him back to his own desk. Evan, defeated, glances over at his blank piece of paper. He grins mischievously and grabs some colored pencils. Soon enough, an image materializes: Evan wielding a dagger stands over a pile of several deceased inmates, Karl and Rick. When finished, he sneaks over to Mrs. Boswell's desk, where the two paper spindles rest. The metal spikes reach up and pierce a number of paper notes and messages. She glances over in time to see Evan using all of his seven-year-old might to fling his hands down toward the spindles. The moment before his palms reach them there's a brief instant where soundscapes clash and the world behind him quivers."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The prisoners' vicious taunts and catcalls are screamed at the fresh batch of new inmates as Evan is tried by himself to be kept composed and walks toward his cell. Evan looks up to see one of the men, Karl, a huge muscular con with tattoos of swastikas and other Nazi symbols on his arm, who is leaning over the second tier, blowing a kiss at Evan and winking. A dimly lit cell plastered with pictures of Jesus Christ and various Saints is entered by Evan. On the bottom bunk, Carlos, a massive Hispanic convict covered with faded Indian ink jail tats of Christ in agony, is sitting. Evan's bed on the top bunk is made up by him as Carlos stares at Evan disinterestedly. The cell is left by Carlos without another word. At a table filled with Carlos and some other inmates, Evan sets his tray down. A roll is shrugged and offered by Carlos to Evan. Her hair has become bottle-blonde. Two are separated by four inches of Plexiglas, and monitored phones are being talked on by them. Andrea, holding up two comp books, nods. The phone is slowly lowered by Evan as they look at each other. He hangs up, with Andrea still pressing her phone to her ear. Behind Carlos, Evan walks closely through a corridor, clutching his journals. As he passes Karl, the Neo-Nazi, Evan's crotch is firmly grabbed by Karl. Evan stands there, stunned, unable to react when Rick, another Neo-Nazi, swats Evan's journals out of his hands and onto the floor. Life is sprung back into Evan as he rushes for the journals. At the same time, Rick grabs the journals, initiating a minor tug of war. Rick tears them away, leaving Evan coming up with only a few torn pages. The damage is seen by Evan and he goes mental. A tattered journal entry is held in Evan's hand, and a conversation is finished by him and then the page is studied. We return to Mrs. Boswell's first grade class where colorful pictures are drawn by all of the children. As he is headed over to them, Evan's shoulders are firmly grabbed by Mrs. Boswell and he is steered back to his own desk. Evan, defeated, looks over at his blank piece of paper. Colored pencils are grabbed by him as he smiles mischievously. Soon enough, an image emerges: Evan holding a knife standing over a heap of several dead inmates, Karl and Rick. When done, he sneaks over to Mrs. Boswell's desk, where two paper spindles sit. A number of paper notes and messages are skewered by the metal needles that reach up. In time, she looks over to see Evan use all of his seven-year-old strength to whip his hands down toward the spindles. Before his palms reach them, there is a brief instant where soundscapes collide and the world behind him vibrates."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The prisoners hurl vicious taunts at the new inmates as Evan tries to stay composed while heading to his cell. He notices Karl, a muscular man with Nazi tattoos, who blows a kiss and winks at him. Evan enters a dimly lit cell adorned with images of Jesus and Saints. Carlos, a large Hispanic convict with faded tattoos, sits on the bottom bunk, uninterested as Evan makes his bed on the top bunk. Carlos leaves without a word. Evan joins Carlos and others at a table, where Carlos offers him a roll. Andrea, now bottle-blonde, communicates with Evan through Plexiglas on monitored phones. She nods, holding two comp books, as Evan lowers the phone. Walking behind Carlos, Evan clutches his journals. Karl grabs Evan's crotch, and Rick knocks the journals to the floor. Evan and Rick engage in a tug of war over the journals, with Evan left holding torn pages. Evan, holding a tattered journal entry, recalls Mrs. Boswell's first-grade class where children draw pictures. Mrs. Boswell redirects Evan to his desk, where he mischievously draws himself with a knife over dead inmates, Karl and Rick. He sneaks to Mrs. Boswell's desk, aiming for the paper spindles. Just before his hands reach them, the world vibrates around him."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Prisoners taunt new inmates as Evan walks to his cell. Karl, a muscular man with Nazi tattoos, blows a kiss at Evan. Evan enters a dim cell with Jesus pictures. Carlos, a large Hispanic convict with tattoos, disinterestedly watches Evan make his bed. Carlos leaves silently. Evan joins Carlos at a table, and Carlos offers him a roll. Andrea, now blonde, talks to Evan through Plexiglas. She nods, holding comp books. Evan hangs up, Andrea still listening. Evan follows Carlos, clutching journals. Karl grabs Evan's crotch. Rick knocks Evan's journals down. They struggle, and Rick takes them, leaving Evan with torn pages. Evan goes mental, holding a torn page. In Mrs. Boswell's class, Evan draws a picture of himself with a knife over dead inmates, Karl and Rick. He sneaks to Mrs. Boswell's desk, aiming for the paper spindles. As he moves, soundscapes collide, and the world vibrates."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The prisoners, filled with a mix of hostility and derision, begin to unleash a torrent of vicious taunts and catcalls directed at the fresh batch of new inmates. Amidst this chaotic scene, Evan strives to maintain his composure as he steadily walks toward his designated cell. As he glances upward, he notices one of the men leaning over the second tier. This man, Karl, is a massive, muscular convict adorned with tattoos of swastikas and other Nazi symbols on his arm. With a mocking gesture, Karl blows a kiss at Evan and follows it with a wink. Evan then enters a dimly lit cell, its walls covered with pictures of Jesus Christ and various Saints, creating an almost eerie atmosphere. Sitting on the bottom bunk is Carlos, a large Hispanic convict whose body is covered with faded Indian ink jail tattoos depicting Christ in agony. Carlos stares at Evan with a look of disinterest as Evan begins to make up his bed on the top bunk. Without uttering another word, Carlos leaves the cell. Later, Evan sets his tray down at a table already occupied by Carlos and some other inmates. Carlos gives a nonchalant shrug in Evan's direction and offers him a roll. Her hair, now dyed a bottle-blonde shade, is noticeable. A thick barrier of four inches of Plexiglas separates the two as they converse using monitored phones. Andrea nods in understanding, holding up two composition books. They exchange a meaningful look, and Evan slowly lowers the phone. He hangs up, while Andrea continues to press her phone to her ear. Evan follows closely behind Carlos as they walk through a corridor, clutching his journals tightly. As they pass by Karl, the Neo-Nazi, Karl reaches over and firmly grabs Evan's crotch, leaving Evan momentarily stunned and unable to react. In that instant, another Neo-Nazi, Rick, swats Evan's journals out of his hands, sending them tumbling to the floor. Life suddenly springs back into Evan as he rushes to retrieve the journals. Both he and Rick grab the journals simultaneously, initiating a minor tug of war. Rick manages to tear them away, leaving Evan with only a few torn pages in his grasp. Seeing the damage, Evan goes mental, holding a tattered journal entry in his hand as he finishes up a conversation and then studies the page intently. We are transported back to Mrs. Boswell's first-grade class, where all the children are busy drawing colorful pictures. As Evan heads over to them, Mrs. Boswell firmly grabs his shoulders and steers him back to his own desk. Feeling defeated, Evan looks over at his blank piece of paper. A mischievous smile spreads across his face as he grabs some colored pencils. Soon enough, an image begins to emerge: Evan, holding a knife, stands over a heap of several dead inmates, including Karl and Rick. Once he is done, he sneaks over to Mrs. Boswell's desk, where two paper spindles sit. The metal needles reach up, skewering a number of paper notes and messages. She looks over just in time to see Evan using all of his seven-year-old strength to whip his hands down toward the spindles. In the brief moment before his palms reach them, there's an instant where soundscapes collide, and the world behind him vibrates."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The prisoners, consumed by a tumultuous mix of deep-seated hostility and biting derision, begin to unleash an unrelenting torrent of vicious taunts and scornful catcalls, all directed towards the fresh batch of new inmates who have just arrived. Amidst this chaotic scene, filled with noise and tension, Evan strives diligently to maintain his composure as he steadily walks along the path toward his designated cell. As he instinctively glances upward, he becomes aware of one of the men leaning over the second tier. This man, known as Karl, is a massive and muscular convict, his body covered with tattoos that prominently display swastikas and other ominous Nazi symbols on his arm. With a mocking gesture meant to intimidate, Karl dramatically blows a kiss at Evan, following it up with an exaggerated wink. Evan then enters his assigned cell, which is dimly lit and has walls that are covered with an array of pictures depicting Jesus Christ alongside various Saints, creating an atmosphere that is almost eerily reverent. Sitting on the bottom bunk is Carlos, a large Hispanic convict with his body adorned with a series of faded Indian ink jail tattoos that depict Christ in agony. Carlos stares at Evan with an expression of utter disinterest as Evan begins to make up his bed on the top bunk. Without uttering another word, Carlos casually leaves the cell, offering no further acknowledgment. \n\nLater, Evan sets his tray down at a table already occupied by Carlos and several other inmates. In a gesture of tentative camaraderie, Carlos gives a nonchalant shrug in Evan's direction and offers him a roll. Meanwhile, her hair, now dyed a bottle-blonde shade, catches the eye noticeably. A thick, impenetrable barrier of four inches of Plexiglas separates the two as they engage in conversation using monitored phones. Andrea nods in understanding, purposefully holding up two composition books. They exchange a meaningful look, heavy with unspoken words, and Evan slowly lowers the phone. He hangs up, while Andrea continues to press her phone to her ear, unwilling to let go. \n\nEvan follows closely behind Carlos as they walk through a narrow corridor, clutching his journals tightly to his chest. As they pass by Karl, the intimidating Neo-Nazi, Karl reaches over abruptly and firmly grabs Evan's crotch, leaving Evan momentarily stunned and unable to react. In that same instant, another Neo-Nazi, Rick, swiftly swats Evan's journals out of his hands, causing them to tumble to the floor. Life suddenly springs back into Evan as he rushes to retrieve the fallen journals. Both he and Rick grab at the journals simultaneously, initiating a minor yet intense tug of war. Rick manages to tear them away, leaving Evan with only a few torn pages in his grasp. Seeing the damage, Evan goes mental, holding a tattered journal entry in his hand as he finishes up a conversation and then studies the torn page intently. \n\nWe are then transported back in time to Mrs. Boswell's first-grade class, where all the children are busily engaged in drawing colorful pictures. As Evan heads over to them, Mrs. Boswell firmly grabs his shoulders and steers him back to his own desk, her actions leaving him feeling defeated. Evan looks down at his blank piece of paper, determination mingling with mischief. A mischievous smile spreads across his face as he grabs some colored pencils. Soon enough, an image begins to emerge: Evan, holding a knife, stands triumphantly over a heap of several dead inmates, including Karl and Rick. Once he is done with his morbid masterpiece, he sneaks over to Mrs. Boswell's desk, where two paper spindles sit ominously. The metal needles reach up, skewering a number of paper notes and messages. She looks over just in time to witness Evan using all of his seven-year-old strength to whip his hands down toward the waiting spindles. In the fleeting moment before his palms reach the needles, there's an instant where soundscapes collide, and the world behind him vibrates with intensity."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the prisoners begin to unleash a torrent of vicious taunts and catcalls, the fresh batch of new inmates, including Evan, try to maintain their composure amidst the chaos. Evan, striving to keep his demeanor calm, walks steadily toward his assigned cell. As he moves, he glances upward and notices one of the men, Karl, a large, muscular convict adorned with tattoos of swastikas and other Nazi symbols on his arm, leaning over the second tier. Karl makes a mocking gesture by blowing a kiss at Evan and winking, adding to the tension. Evan continues on and enters a dimly lit cell, its walls covered with pictures of Jesus Christ and various Saints, creating a stark contrast to the environment outside. Inside, sitting on the bottom bunk, is Carlos, a massive Hispanic convict whose body is covered with faded Indian ink jail tattoos depicting Christ in agony. Carlos looks at Evan with a disinterested gaze as Evan begins to make up his bed on the top bunk, arranging the sheets and blanket with care. Without exchanging further words, Carlos stands up and exits the cell, leaving Evan alone. Later, Evan sets his tray down at a table where Carlos and some other inmates are seated. Carlos acknowledges Evan with a shrug and offers him a roll, a small gesture of camaraderie. Meanwhile, Andrea, with her hair now dyed bottle-blonde, sits separated from Evan by four inches of Plexiglas as they communicate through monitored phones. Andrea nods, holding up two composition books, and they share a moment of understanding. Evan slowly lowers the phone, hanging it up while Andrea continues to press her phone to her ear, maintaining the connection a moment longer. Evan then follows closely behind Carlos through a corridor, clutching his journals tightly. As they pass by Karl, the Neo-Nazi, Karl suddenly reaches over and firmly grabs Evan's crotch, leaving Evan momentarily stunned and unable to react. In that instant, another Neo-Nazi, Rick, swats Evan's journals out of his hands, sending them tumbling to the floor. This jolts Evan back to life, and he quickly rushes to retrieve the fallen journals. He and Rick simultaneously grab the journals, engaging in a brief tug of war. Rick manages to tear them away, leaving Evan with only a few torn pages in his grasp. Seeing the damage, Evan becomes enraged, holding a tattered journal entry in his hand as he finishes up a conversation and then studies the page intently. The scene shifts back to Mrs. Boswell's first-grade class, where all the children are busy drawing colorful pictures. As Evan heads over to join them, Mrs. Boswell firmly grabs his shoulders and steers him back to his own desk, redirecting his focus. Evan, feeling defeated, looks down at his blank piece of paper but soon smiles mischievously and grabs some colored pencils. With determination, he begins to draw, and soon an image emerges: Evan holding a knife, standing over a heap of several dead inmates, including Karl and Rick. Once finished, he sneaks over to Mrs. Boswell's desk, where two paper spindles sit, their metal needles reaching up to skewer a number of paper notes and messages. Mrs. Boswell looks over just in time to see Evan using all of his seven-year-old strength to whip his hands down toward the spindles. In the brief instant before his palms reach them, there's a collision of soundscapes, and the world behind him vibrates, creating a moment of intense anticipation."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The prisoners unleash vicious taunts at the new inmates as Evan maintains his composure and heads to his cell. He notices Karl, a muscular man with Nazi tattoos, who mockingly blows a kiss at him. Entering a dimly lit cell adorned with religious images, Evan finds Carlos, a large Hispanic convict with jail tattoos, sitting on the bottom bunk. Carlos leaves without a word as Evan makes his bed on the top bunk. Later, Evan joins Carlos and others at a table, where Carlos offers him a roll. During a monitored visit, Andrea shows Evan two composition books through Plexiglas, and they exchange a nod before Evan hangs up. Walking behind Carlos in a corridor, Evan clutches his journals when Karl grabs him inappropriately, and Rick knocks the journals to the floor. A brief struggle ensues, leaving Evan with torn pages. Reflecting on the damage, Evan recalls a first-grade memory where Mrs. Boswell redirects him to his desk. Mischievously, he draws a scene of himself with a knife over dead inmates, including Karl and Rick. He then attempts to slam his hands onto paper spindles on Mrs. Boswell's desk, creating a moment where soundscapes collide and the world vibrates around him."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The prisoners, whose relentless noise echoes through the facility's aging concrete walls, begin screaming vicious taunts and catcalls at the fresh batch of new inmates as Evan tries to keep composed and walks toward his cell. Evan looks up to see one of the men leaning over the second tier, Karl, a huge muscular con notorious for his involvement in the prison's underground fight club and with tattoos of swastikas and other Nazi symbols on his arm, blows a kiss at Evan and winks. Evan enters a dimly lit cell plastered with pictures of Jesus Christ and various Saints, relics of his cellmate's devout Catholic upbringing. Sitting on the bottom bunk is Carlos, a massive Hispanic convict who earned respect for his role in mediating gang disputes, covered with faded Indian ink jail tats of Christ in agony. Carlos stares at Evan disinterestedly as Evan makes up his bed on the top bunk. Carlos leaves the cell without another word, the unspoken code of the prison leaving Evan to ponder the potential alliances. Evan sets his tray down at a table filled with Carlos and some other inmates, aware this act signals his association with their group. Carlos shrugs at Evan and offers him a roll. Her hair is now bottle-blonde, a drastic change from her natural dark curls that Evan used to love. Four inches of Plexiglas, a common feature in high-security visitation rooms, separate the two and they talk on monitored phones. Andrea nods, holding up two comp books, evoking memories of their shared interest in writing. They look at each other and Evan slowly lowers the phone. He hangs up, Andrea still pressing her phone to her ear as if holding onto the last thread of their connection. Evan walks closely behind Carlos through a corridor, clutching his journals, which are his lifeline and therapy amid the chaos. As he passes Karl, the Neo-Nazi, Karl reaches over and firmly grabs Evan's crotch, a common intimidation tactic in prison hierarchies. Evan stands there, stunned, unable to react when another Neo-Nazi, Rick, a known henchman for Karl, swats Evan's journals out of his hands and onto the floor. Life springs back into Evan as he rushes for the journals. He and Rick grab the journals at the same time, initiating a minor tug of war, a microcosm of the constant power struggles around them. Rick tears them away, Evan coming up with only a few torn pages, the remnants of his inner sanctuary. Evan sees the damage and goes mental. Evan holds a tattered journal entry in his hand and finishes up a conversation and then studies the page. We are back in Mrs. Boswell's first grade class, a time of innocence and learning long lost to Evan, where all of the children draw colorful pictures. As he heads over to them, Mrs. Boswell, known for her patience with spirited children, firmly grabs his shoulders and steers him back to his own desk. Evan, defeated, looks over at his blank piece of paper. He smiles mischievously and grabs some colored pencils, tapping into the creativity that has always been his escape. Soon enough, an image emerges: Evan holding a knife stands over a heap of several dead inmates, including Karl and Rick, a dark fantasy of vengeance. When done, he sneaks over to Mrs. Boswell's desk, where the two paper spindles, often used for keeping track of classroom progress, sit. The metal needles reach up and skewer a number of paper notes and messages, a reminder of order amidst chaos. She looks over in time to see Evan using all of his seven-year-old strength to whip his hands down toward the spindles. The moment before his palms reach them there's a brief instant where soundscapes collide and the world behind him vibrates, as if the boundary between his past and present is momentarily blurred."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The prisoners begin screaming vicious taunts and catcalls at the fresh batch of new inmates. as Evan tries to keep composed and walks toward his cell. Evan looks up to see one of the men leaning over the second tier. Karl a huge muscular con with tattoos of swastikas and other Nazi symbols on his arm blows a kiss at Evan and winks. Evan enters a dimly lit cell plastered with pictures of Jesus Christ and various Saints. Sitting on the bottom bunk is Carlos a massive Hispanic convict covered with faded Indian ink. jail tats of Christ in agony. Carlos stares at Evan disinterestedly as Evan makes up his bed on the top bunk. Carlos leaves the cell without another word. Evan sets his tray down at a table filled with Carlos and some other inmates. Carlos shrugs at Evan and offers him a roll. Her hair is now bottleblonde. Four inches of Plexiglas separate the two and they talk on monitored phones. Andrea nods holding up two comp books. They look at each other and Evan slowly lowers the phone. He hangs up Andrea still pressing her phone to her ear. Evan walks closely behind Carlos through a corridor clutching his journals. As he passes Karl the NeoNazi Karl reaches over and firmly grabs Evan's crotch. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Evan stands there stunned unable to react when another NeoNazi Rick swats Evan's journals out of his hands and onto the floor. Life springs back into Evan as he rushes for the journals. He and Rick grab the journals at the same time initiating a minor tug of war. Rick tears them away. Evan coming up with only a few torn pages. Evan sees the damage and goes mental. Evan holds a tattered journal entry in his hand and finishes up a conversation and then studies the page. We are back in Mrs Boswell's first grade class where all of the children draw colorful pictures. As he heads over to them Mrs Boswell firmly grabs his shoulders and steers him back to his own desk. Evan defeated looks over at his blank piece of paper. He smiles mischievously and grabs some colored pencils. Soon enough an image emerges. Evan holding a knife stands over a heap of several dead inmates. Karl and Rick. When done he sneaks over to Mrs Boswell's desk where the two paper spindles sit. The metal needles reach up and skewer a number of paper notes and messages. She looks over in time to see Evan using all of his sevenyearold strength to whip his hands down toward the spindles. The moment before his palms reach them there is a brief instant where soundscapes collide and the world behind him vibrates."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The prisoners begin screaming vicious taunts and catcalls at the fresh batch of new inmates. as Evan tries to keep composed and walks toward his cell. Evan looks up to see one of the men leaning over the second tier. Karl a huge muscular con with tattoos of swastikas and other Nazi symbols on his arm blows a kiss at Evan and winks. Evan enters a dimly lit cell plastered with pictures of Jesus Christ and various Saints. Sitting on the bottom bunk is Carlos a massive Hispanic convict covered with faded Indian ink. jail tats of Christ in agony. Carlos stares at Evan disinterestedly as Evan makes up his bed on the top bunk. Carlos leaves the cell without another word. Evan sets his tray down at a table filled with Carlos and some other inmates. Carlos shrugs at Evan and offers him a roll. Her hair is now bottleblonde. Four inches of Plexiglas separate the two and they talk on monitored phones. Andrea nods holding up two comp books. They look at each other and Evan slowly lowers the phone. He hangs up Andrea still pressing her phone to her ear. Evan walks closely behind Carlos through a corridor clutching his journals. As he passes Karl the NeoNazi Karl reaches over and firmly grabs Evan's crotch. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Evan stands there stunned unable to react when another NeoNazi Rick swats Evan's journals out of his hands and onto the floor. Life springs back into Evan as he rushes for the journals. He and Rick grab the journals at the same time initiating a minor tug of war. Rick tears them away. Evan coming up with only a few torn pages. Evan sees the damage and goes mental. Evan holds a tattered journal entry in his hand and finishes up a conversation and then studies the page. We are back in Mrs Boswell's first grade class where all of the children draw colorful pictures. As he heads over to them Mrs Boswell firmly grabs his shoulders and steers him back to his own desk. Evan defeated looks over at his blank piece of paper. He smiles mischievously and grabs some colored pencils. Soon enough an image emerges. Evan holding a knife stands over a heap of several dead inmates. Karl and Rick. When done he sneaks over to Mrs Boswell's desk where the two paper spindles sit. The metal needles reach up and skewer a number of paper notes and messages. She looks over in time to see Evan using all of his sevenyearold strength to whip his hands down toward the spindles. The moment before his palms reach them there is a brief instant where soundscapes collide and the world behind him vibrates."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The prisoners begin screaming vicious taunts and catcalls at the fresh batch of new inmates. as Evan tries to keep composed and walks toward his cell. Evan looks up to see one of the men leaning over the second tier. Karl a huge muscular con with tattoos of swastikas and other Nazi symbols on his arm blows a kiss at Evan and winks. Evan enters a dimly lit cell plastered with pictures of Jesus Christ and various Saints. Sitting on the bottom bunk is Carlos a massive Hispanic convict covered with faded Indian ink. jail tats of Christ in agony. Carlos stares at Evan disinterestedly as Evan makes up his bed on the top bunk. Carlos leaves the cell without another word. Evan defeated looks over at his blank piece of paper. He smiles mischievously and grabs some colored pencils. Soon enough an image emerges. Evan holding a knife stands over a heap of several dead inmates. Karl and Rick. When done he sneaks over to Mrs Boswell's desk where the two paper spindles sit. The metal needles reach up and skewer a number of paper notes and messages. She looks over in time to see Evan using all of his sevenyearold strength to whip his hands down toward the spindles. The moment before his palms reach them there is a brief instant where soundscapes collide and the world behind him vibrates."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The prisoners begin screaming vicious taunts and catcalls at the fresh batch of new inmates. as Evan tries to keep composed and walks toward his cell. Evan looks up to see one of the men leaning over the second tier. Karl a huge muscular con with tattoos of swastikas and other Nazi symbols on his arm blows a kiss at Evan and winks. When done he sneaks over to Mrs Boswell's desk where the two paper spindles sit. The metal needles reach up and skewer a number of paper notes and messages. She looks over in time to see Evan using all of his sevenyearold strength to whip his hands down toward the spindles. The moment before his palms reach them there is a brief instant where soundscapes collide and the world behind him vibrates."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The tourists start chanting gentle lullabies and whispers at the old collection of antiques as Oliver attempts to stay calm and strolls toward his tent. Oliver glances upward to notice one of the women lounging under the large canopy, Hannah, a tiny delicate artist with tapestries of flowers and other floral designs on her cloak, tosses a pebble at Oliver and giggles. Oliver ducks into a brightly lit tent adorned with illustrations of Hercules and numerous Myths. Reclining on the upper cot is Mateo, a slender Spanish poet adorned with vibrant henna body art of Demeter in bliss. Mateo watches Oliver wearily as Oliver arranges his blanket on the lower cot. Mateo exits the tent without uttering a sound. Oliver places his book on a bench crowded with Mateo and a few other tourists. Mateo nods at Oliver and hands him a pencil. His shoes are now neon-blue. Three inches of glass separate the pair and they chat on live radios. Rachel smiles, raising two sketchbooks. They gaze at each other and Oliver slowly drops the radio. He ends the call, Rachel still clutching her radio to her chin. Oliver walks cautiously behind Mateo through an alley, gripping his canvases. As he passes Hannah, the artist, Hannah casually pats Oliver's back. Oliver stands there, baffled, unable to move when another artist, Ben, knocks Oliver's canvases from his grip and onto the ground. Energy surges back into Oliver as he dives for the canvases. He and Ben snatch the canvases simultaneously, starting a slight tug of war. Ben snatches them away, Oliver left holding only a handful of shredded pieces. Oliver inspects the mess and goes berserk. Oliver clutches a tattered sketch in his fist and wraps up a dialogue and then examines the sketch. We return to Mrs. Franklin’s kindergarten class where all of the kids paint vivid murals. As he approaches them, Mrs. Franklin gently takes his arms and guides him back to his personal station. Oliver, discouraged, glances at his unmarked sheet of canvas. He grins slyly and seizes some watercolors. Before long, a vision takes form: Oliver handling a paintbrush stands above a pile of numerous broken antiques, Hannah and Ben. When completed, he tiptoes to Mrs. Franklin’s table, where the two wooden easels rest. The wooden stands rise up and impale a selection of canvas sketches and pictures. She spots him just in time to see Oliver using all of his seven-year-old effort to fling his hands toward the easels. Just before his fingers connect, there’s a fleeting moment where melodies intertwine and the world around him trembles."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Evan navigates the hostile prison environment, trying to stay composed as other prisoners, including Karl, a large Nazi-affiliated inmate, taunt him. He shares a cell with Carlos, a disinterested Hispanic convict. During a visit, Evan communicates with Andrea through Plexiglas, exchanging comp books. As Evan follows Carlos through a corridor, Karl harasses him, and another Neo-Nazi, Rick, scatters Evan's journals. Evan's desperation leads to a struggle over the journals, resulting in torn pages. Recalling a childhood memory in Mrs. Boswell's class, Evan mischievously imagines himself defending against his tormentors, Karl and Rick, through a drawing. As he attempts to impale the drawing on a spindle, a moment of surreal sound and vibration envelops him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "there's a brief instant where soundscapes collide and the world behind him vibrates The moment before his palms reach them  She looks over in time to see Evan using all of his sevenyearold strength to whip his hands down toward the spindles  The metal needles reach up and skewer a number of paper notes and messages  When done he sneaks over to Mrs Boswell's desk where the two paper spindles sit  Karl and Rick  Evan holding a knife stands over a heap of several dead inmates  Soon enough an image emerges  He smiles mischievously and grabs some colored pencils  Evan defeated looks over at his blank piece of paper  As he heads over to them Mrs Boswell firmly grabs his shoulders and steers him back to his own desk  We are back in Mrs Boswell's first grade class where all of the children draw colorful pictures  Evan holds a tattered journal entry in his hand and finishes up a conversation and then studies the page  Evan sees the damage and goes mental  Evan coming up with only a few torn pages  Rick tears them away  He and Rick grab the journals at the same time initiating a minor tug of war  Life springs back into Evan as he rushes for the journals  Evan stands there stunned unable to react when another NeoNazi Rick swats Evan's journals out of his hands and onto the floor  As he passes Karl the NeoNazi Karl reaches over and firmly grabs Evan's crotch  Evan walks closely behind Carlos through a corridor clutching his journals  He hangs up Andrea still pressing her phone to her ear  They look at each other and Evan slowly lowers the phone  Andrea nods holding up two comp books  Four inches of Plexiglas separate the two and they talk on monitored phones  Her hair is now bottleblonde  Carlos shrugs at Evan and offers him a roll  Evan sets his tray down at a table filled with Carlos and some other inmates  Carlos leaves the cell without another word  Carlos stares at Evan disinterestedly as Evan makes up his bed on the top bunk  jail tats of Christ in agony  Sitting on the bottom bunk is Carlos a massive Hispanic convict covered with faded Indian ink  Evan enters a dimly lit cell plastered with pictures of Jesus Christ and various Saints  Karl a huge muscular con with tattoos of swastikas and other Nazi symbols on his arm blows a kiss at Evan and winks  Evan looks up to see one of the men leaning over the second tier  as Evan tries to keep composed and walks toward his cell  The prisoners begin screaming vicious taunts and catcalls at the fresh batch of new inmates "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "as Evan tries to keep composed and walks toward his cell The prisoners begin screaming vicious taunts and catcalls at the fresh batch of new inmates Karl a huge muscular con with tattoos of swastikas and other Nazi symbols on his arm blows a kiss at Evan and winks Evan looks up to see one of the men leaning over the second tier Sitting on the bottom bunk is Carlos a massive Hispanic convict covered with faded Indian ink Evan enters a dimly lit cell plastered with pictures of Jesus Christ and various Saints Carlos stares at Evan disinterestedly as Evan makes up his bed on the top bunk jail tats of Christ in agony Evan sets his tray down at a table filled with Carlos and some other inmates Carlos leaves the cell without another word Her hair is now bottleblonde Carlos shrugs at Evan and offers him a roll Andrea nods holding up two comp books Four inches of Plexiglas separate the two and they talk on monitored phones He hangs up Andrea still pressing her phone to her ear They look at each other and Evan slowly lowers the phone As he passes Karl the NeoNazi Karl reaches over and firmly grabs Evan's crotch Evan walks closely behind Carlos through a corridor clutching his journals Life springs back into Evan as he rushes for the journals Evan stands there stunned unable to react when another NeoNazi Rick swats Evan's journals out of his hands and onto the floor Rick tears them away He and Rick grab the journals at the same time initiating a minor tug of war Evan sees the damage and goes mental Evan coming up with only a few torn pages We are back in Mrs Boswell's first grade class where all of the children draw colorful pictures Evan holds a tattered journal entry in his hand and finishes up a conversation and then studies the page Evan defeated looks over at his blank piece of paper As he heads over to them Mrs Boswell firmly grabs his shoulders and steers him back to his own desk Soon enough an image emerges He smiles mischievously and grabs some colored pencils Karl and Rick Evan holding a knife stands over a heap of several dead inmates The metal needles reach up and skewer a number of paper notes and messages When done he sneaks over to Mrs Boswell's desk where the two paper spindles sit The moment before his palms reach them there is a brief instant where soundscapes collide and the world behind him vibrates She looks over in time to see Evan using all of his sevenyearold strength to whip his hands down toward the spindles"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Life springs back into Evan as he rushes for the journals  He and Rick grab the journals at the same time initiating a minor tug of war  Rick tears them away  Evan coming up with only a few torn pages  Evan sees the damage and goes mental  Evan holds a tattered journal entry in his hand and finishes up a conversation and then studies the page  We are back in Mrs Boswell's first grade class where all of the children draw colorful pictures  As he heads over to them Mrs Boswell firmly grabs his shoulders and steers him back to his own desk  Evan defeated looks over at his blank piece of paper  He smiles mischievously and grabs some colored pencils  Soon enough an image emerges  Evan holding a knife stands over a heap of several dead inmates  Karl and Rick  When done he sneaks over to Mrs Boswell's desk where the two paper spindles sit  The metal needles reach up and skewer a number of paper notes and messages  She looks over in time to see Evan using all of his sevenyearold strength to whip his hands down toward the spindles  The moment before his palms reach them  there's a brief instant where soundscapes collide and the world behind him vibrates The prisoners begin screaming vicious taunts and catcalls at the fresh batch of new inmates  as Evan tries to keep composed and walks toward his cell  Evan looks up to see one of the men leaning over the second tier  Karl a huge muscular con with tattoos of swastikas and other Nazi symbols on his arm blows a kiss at Evan and winks  Evan enters a dimly lit cell plastered with pictures of Jesus Christ and various Saints  Sitting on the bottom bunk is Carlos a massive Hispanic convict covered with faded Indian ink  jail tats of Christ in agony  Carlos stares at Evan disinterestedly as Evan makes up his bed on the top bunk  Carlos leaves the cell without another word  Evan sets his tray down at a table filled with Carlos and some other inmates  Carlos shrugs at Evan and offers him a roll  Her hair is now bottleblonde  Four inches of Plexiglas separate the two and they talk on monitored phones  Andrea nods holding up two comp books  They look at each other and Evan slowly lowers the phone  He hangs up Andrea still pressing her phone to her ear  Evan walks closely behind Carlos through a corridor clutching his journals  As he passes Karl the NeoNazi Karl reaches over and firmly grabs Evan's crotch  Evan stands there stunned unable to react when another NeoNazi Rick swats Evan's journals out of his hands and onto the floor "
        }
      ]
    }
  ]
}