{
  "ground_truth": "In the flickering firelight of the Noldorin forge in Eregion, molten gold pours from the lip of an iron ladle. Three rings, each set with a single gem, are received by the high elves—Galadriel, Gil-galad, and Cirdan. Seven rings are held aloft in triumph by the dwarf lords, and nine rings are clutched tightly by the kings of men, as if holding-close a precious secret. An ancient parchment map of Middle Earth shows Mordor as the camera moves slowly across it, seemingly drawn by an unseen force. Teasing shots reveal Sauron forging the One Ring in the chambers, with the fiery lava reflecting off the ring as fire writing emerges on the plain band of gold. The One Ring falls through space and into flames, as a great shadow falls across the map, closing in around the realm of Gondor, whose people flee their homes, pursued by armies of hideous orcs. Isildur, son of the King of Gondor, leads an army across the plains of Dagorlad, commanding rank after rank of elven archers. Orcs retreat before the army of the Last Alliance, as Elendil holds aloft the great sword Narsil. The huge, dark figure of Sauron, bearing the One Ring on his finger, looms over the field of battle and lays waste to the armies of the Last Alliance. With desperate courage, Elendil leads a charge, but the black mace of Sauron lashes out, and Elendil's body falls like a crumpled rag doll. Isildur cradles the body of his father in his arms as the shadow of Sauron falls over him. Isildur snatches up the broken blade of Narsil and severs Sauron's fingers, causing the One Ring to fly from his body and disappear. Isildur picks up the severed finger and removes the One Ring, transfixed. At Gladden Field, Isildur leads a small column of men through darkening woods, the One Ring glinting on a chain around his neck, until suddenly arrows fly in an ambush by orcs. Isildur materializes underwater as the Ring slips slowly from his finger. Ripples of light play across Isildur's pale face, and he is dead. The Ring falls through the murky waters of the river, and the waters of the Anduin River lie dark and undisturbed. Silt swirls as a thin white hand reaches down, grasping the Ring, and opens to reveal one ring. Bathed in cold moonlight, the world lies dark and still in an unsettled quiet before the storm. In the gloom of a mountain cavern, a murky pool of water sits in the darkness, and the shadowy outline of an emaciated figure is seen. Unseen by its keeper, the Ring falls to the muddy floor of a mountain tunnel, where a small hand, fumbling in the dark, closes over it. A youngish-looking Bilbo Baggins peers down at what lies in his hand, perplexed by what he has found. Frightened, Bilbo quickly pockets the One Ring and hurries on.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "In the flickering firelight of the Noldorin forge in Eregion, liquefied gold pours from the edge of an iron ladle. Three bands, each set with a solitary jewel, are received by the high elves—Galadriel, Gil-galad, and Cirdan. Seven bands are held aloft in victory by the dwarf chieftains, and nine bands are clutched firmly by the rulers of men, as if holding-close a valuable enigma. An ancient parchment chart of Middle Earth shows Mordor as the lens moves slowly across it, seemingly drawn by an unseen force. Teasing shots reveal Sauron creating the One Ring in the chambers, with the fiery magma mirroring off the ring as fiery script appears on the plain circle of gold. The One Ring descends through space and into flames, as a great gloom falls across the chart, enclosing in around the domain of Gondor, whose people escape their homes, chased by hordes of hideous orcs. Isildur, son of the Monarch of Gondor, leads an army across the plains of Dagorlad, directing rank after rank of elven archers. Orcs withdraw before the army of the Last Alliance, as Elendil holds aloft the great sword Narsil. The huge, dark figure of Sauron, bearing the One Ring on his digit, towers over the expanse of battle and devastates the armies of the Last Alliance. With desperate bravery, Elendil leads an assault, but the black club of Sauron lashes out, and Elendil's form falls like a crumpled rag doll. Isildur cradles the form of his father in his arms as the shadow of Sauron falls over him. Isildur grabs up the fragmented blade of Narsil and severs Sauron's fingers, causing the One Ring to fly from his form and vanish. Isildur picks up the severed digit and removes the One Ring, transfixed. At Gladden Field, Isildur leads a small column of men through dimming woods, the One Ring glinting on a chain around his neck, until suddenly arrows fly in an ambush by orcs. Isildur materializes underwater as the Ring slips slowly from his digit. Ripples of light play across Isildur's pale face, and he is dead. The Ring descends through the murky waters of the river, and the waters of the Anduin River lie dark and undisturbed. Silt swirls as a thin white hand reaches down, grasping the Ring, and opens to reveal one band. Bathed in cold moonlight, the world lies dark and still in an unsettled silence before the tempest. In the gloom of a mountain cavern, a murky pool of water sits in the darkness, and the shadowy outline of an emaciated figure is seen. Unseen by its keeper, the Ring falls to the muddy ground of a mountain tunnel, where a small hand, fumbling in the dark, closes over it. A youngish-looking Bilbo Baggins peers down at what lies in his hand, perplexed by what he has found. Frightened, Bilbo quickly pockets the One Ring and rushes on."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "In the flickering firelight of the Noldorin forge in Eregion, molten gold is poured from the lip of an iron ladle. The high elves—Galadriel, Gil-galad, and Cirdan—receive three rings, each set with a single gem. The dwarf lords hold aloft seven rings in triumph, and the kings of men clutch tightly nine rings, as if a precious secret is being held-close by them. An ancient parchment map of Middle Earth is shown by the camera moving slowly across it, seemingly drawing Mordor with an unseen force. Sauron is revealed by teasing shots forging the One Ring in the chambers, with the fiery lava reflecting off the ring as fire writing is emerging on the plain band of gold. Through space, the One Ring flies and is caught by flames as a great shadow closes in around the realm of Gondor, pursuing its people who flee their homes, driven by armies of hideous orcs. An army is led by Isildur, son of the King of Gondor, across the plains of Dagorlad, commanding rank after rank of elven archers. The army of the Last Alliance causes the orcs to retreat, as the great sword Narsil is held aloft by Elendil. The huge, dark figure of Sauron, bearing the One Ring on his finger, looms over the field of battle and wastes the armies of the Last Alliance. A charge is led by Elendil with desperate courage, but out lashes the black mace of Sauron, and Elendil's body is caused to fall like a crumpled rag doll. The body of his father is cradled by Isildur in his arms as the shadow of Sauron falls over him. The broken blade of Narsil is snatched up by Isildur, who severs Sauron's fingers, causing the One Ring to fly from his body and disappear. The severed finger is picked up by Isildur and the One Ring is removed, as he is transfixed. At Gladden Field, a small column of men is led by Isildur through darkening woods, the One Ring glinting on a chain around his neck, until suddenly they are ambushed by orcs with arrows flying. Underwater, Isildur materializes as the Ring slips slowly from his finger. Ripples of light play across Isildur's pale face, and death claims him. Through the murky waters of the river, the Ring falls, and the waters of the Anduin River remain dark and undisturbed. As silt swirls, a thin white hand reaches down, grasping the Ring, and opens to reveal one ring. Bathed in cold moonlight, the world is left dark and still in an unsettled quiet before the storm. In the gloom of a mountain cavern, a murky pool of water is seen in the darkness, and the shadowy outline of an emaciated figure is visible. Unseen by its keeper, the Ring falls to the muddy floor of a mountain tunnel, where it is closed over by a small hand, fumbling in the dark. A youngish-looking Bilbo Baggins peers down at what is lying in his hand, perplexed by what he has found. Quickly, Bilbo pockets the One Ring and hurries on, frightened."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "In the flickering firelight of the Noldorin forge in Eregion, molten gold flows from an iron ladle. Three rings, each set with a gem, go to the high elves—Galadriel, Gil-galad, and Cirdan. Seven rings are triumphantly held by dwarf lords, and nine rings are tightly clutched by the kings of men, as if guarding a precious secret. An ancient map of Middle Earth highlights Mordor as the camera pans. Teasing shots show Sauron forging the One Ring, fiery lava reflecting off the ring as flame writing appears on the plain gold band. The Ring descends into flames as a shadow envelops Gondor, where people flee from orc armies. Isildur, son of Gondor's king, leads an army across Dagorlad, commanding elves. Orcs retreat before the Last Alliance, with Elendil wielding Narsil. Sauron, bearing the One Ring, devastates the Alliance. With desperate courage, Elendil charges, but Sauron’s mace strikes, and Elendil falls. Isildur cradles his father and severs Sauron’s fingers with Narsil, causing the One Ring to vanish. Isildur removes the Ring and leads men through woods, with it glinting on a chain, until orcs ambush. Isildur appears underwater, the Ring slipping from his finger. Light ripples across Isildur’s pale face as he dies. The Ring descends into the Anduin River's murky waters. Silt swirls as a pale hand grasps the Ring, revealing it under moonlight in a quiet, dark world. In a mountain cavern, a murky pool hides an emaciated figure. Unseen, the Ring falls to a tunnel floor, where a small hand seizes it. A young Bilbo Baggins looks at his find, perplexed, pockets the One Ring, and hurries away."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Amidst the flickering firelight of the Noldorin forge in Eregion, molten gold flows, forming three rings set with gems for Galadriel, Gil-galad, and Cirdan. Seven rings are held aloft by dwarf lords, and nine by kings of men. A map of Middle Earth shows Mordor as Sauron forges the One Ring, its fiery script emerging. The Ring falls into flames, casting a shadow over Gondor, whose people flee from orc armies. Isildur, son of Gondor's king, leads an army across Dagorlad, with elven archers and Elendil wielding Narsil. Sauron, wearing the One Ring, devastates the Last Alliance. Elendil charges but is slain; Isildur cradles him, then severs Sauron's fingers, causing the One Ring to vanish. Isildur takes the Ring and leads men through woods, ambushed by orcs. Submerged, Isildur loses the Ring as he dies. The Ring sinks, later grasped by a white hand revealing it. In a mountain cavern, a shadowy figure guards the Ring until it falls, claimed by a small hand. Bilbo Baggins, perplexed, finds and quickly pockets the Ring before hurrying away."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In the flickering and unsteady firelight of the Noldorin forge located in the region of Eregion, streams of molten gold are seen gracefully pouring out from the edge of a sturdy iron ladle. In this mesmerizing scene, three exquisite rings, each adorned with a single, sparkling gem, are ceremoniously received by the esteemed high elves—Galadriel, Gil-galad, and Cirdan, representing their kind with honor. Meanwhile, seven magnificent rings are triumphantly held aloft by the proud dwarf lords, and nine rings are tightly clutched by the kings of men, as though they are holding close a precious and closely guarded secret. An ancient and timeworn parchment map of the mystical land of Middle Earth is revealed, showing the ominous land of Mordor as the camera slowly and deliberately pans across it, as if drawn by some unseen and mysterious force. Intriguing and teasing shots give fleeting glimpses of Sauron, who is deeply engrossed in forging the One Ring within his chambers, with the fiery lava casting a glow that reflects off the ring, as fiery script emerges on the otherwise plain band of gold. The One Ring is then depicted as it falls through the air and into the raging flames, while a great and foreboding shadow casts itself across the map, ominously closing in around the realm of Gondor, whose people are seen fleeing their homes, desperately pursued by massive armies of hideous and terrifying orcs. Isildur, the son of the King of Gondor, is portrayed as he courageously leads an army across the wide plains of Dagorlad, commanding row upon row of disciplined elven archers. Orcs, in a state of retreat, fall back before the might of the army of the Last Alliance, as Elendil prominently holds aloft the great and legendary sword Narsil. The enormous, dark, and imposing figure of Sauron, with the One Ring proudly borne on his finger, ominously looms over the battlefield, laying waste to the brave armies of the Last Alliance. With a desperate and valiant courage, Elendil rallies his forces for a charge, but the merciless black mace of Sauron lashes out with brutal force, causing Elendil's lifeless body to fall like a crumpled rag doll. In the aftermath, Isildur tenderly cradles his father’s fallen body in his arms as the shadow of Sauron ominously descends upon him. In a swift and daring act, Isildur seizes the opportunity to snatch up the broken blade of Narsil, using it to sever Sauron’s fingers, which causes the One Ring to fly from his body and vanish. With a sense of awe, Isildur picks up the severed finger and carefully removes the One Ring, transfixed by its power. Later, at Gladden Field, Isildur is seen leading a small column of men through the increasingly darkened woods, the One Ring glinting ominously on a chain around his neck, when suddenly they are ambushed by a barrage of arrows from hidden orcs. Isildur is then depicted materializing underwater, the Ring slipping away slowly from his finger. Ripples of light dance across Isildur’s pale face, and it becomes evident that he is dead. The Ring continues its descent, falling through the murky waters of the river, as the waters of the Anduin River remain dark and undisturbed. The silt gently swirls as a thin, white hand reaches down, its fingers closing over the Ring and opening to reveal its singular form. Bathed in the cold, pale moonlight, the world lies in darkness and stillness, enveloped in a tense quiet before the impending storm. Within the gloom of a mountain cavern, a murky pool of water sits untouched in the darkness, and the vague, shadowy outline of an emaciated figure is discernible. Unseen by its keeper, the Ring falls to the muddy floor of a mountain tunnel, where a small and fumbling hand, searching in the darkness, closes around it. A young, curious-looking Bilbo Baggins peers down, perplexed by the object in his hand, startled by what he has discovered. Frightened and wary, Bilbo quickly hides the One Ring in his pocket and hurries away."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In the flickering and unsteady glow of the firelight that dances across the Noldorin forge, which is situated in the storied region of Eregion, streams of molten gold can be seen gracefully pouring out from the edge of a sturdy, timeworn iron ladle. Within this mesmerizing and awe-inspiring scene, three exquisite rings, each one adorned with a single, sparkling gem, are ceremoniously received by the esteemed high elves—Galadriel, Gil-galad, and Cirdan—who represent their kind with great honor and dignity. Meanwhile, seven magnificent rings are triumphantly held aloft by the proud and resilient dwarf lords, while nine rings are tightly clutched by the powerful kings of men, each one holding close a precious and closely guarded secret. An ancient and timeworn parchment map of the mystical and enchanted land of Middle Earth is then revealed, showing the ominous and foreboding land of Mordor. This is shown as the camera slowly and deliberately pans across it, as if drawn by some unseen and mysterious force. Intriguing and teasing shots provide fleeting glimpses of the dark lord Sauron, who is deeply engrossed in forging the One Ring within the confines of his shadowy chambers, with the fiery and bubbling lava casting a malevolent glow that reflects off the ring, as fiery script emerges on the otherwise plain and unadorned band of gold. The One Ring is then depicted as falling through the air and into the raging and roaring flames, while a great and foreboding shadow casts itself across the entire map, ominously closing in around the realm of Gondor, whose people are seen fleeing their homes, desperately pursued by massive armies of hideous and terrifying orcs. Isildur, who is the son of the King of Gondor, is portrayed as he courageously and confidently leads an army across the wide and expansive plains of Dagorlad, commanding row upon row of disciplined elven archers. The orcs, in a state of panic and retreat, fall back before the might of the army of the Last Alliance, as Elendil prominently holds aloft the great and legendary sword Narsil. The enormous, dark, and imposing figure of Sauron, with the One Ring proudly borne on his finger, ominously looms over the battlefield, bringing devastation and laying waste to the brave armies of the Last Alliance. With desperate and valiant courage, Elendil rallies his forces for a daring charge, but the merciless black mace of Sauron lashes out with brutal and savage force, causing Elendil's lifeless body to fall like a crumpled rag doll. In the heart-wrenching aftermath, Isildur tenderly cradles his father’s fallen body in his arms as the ominous shadow of Sauron descends upon him. In a swift and daring act of bravery, Isildur seizes the opportunity to snatch up the broken blade of Narsil, using it to sever Sauron’s fingers, which causes the One Ring to fly from his body and vanish. With a sense of awe and wonder, Isildur picks up the severed finger and carefully removes the One Ring, transfixed by its immense power. Later, at the Gladden Field, Isildur is seen leading a small column of men through the increasingly darkened and dense woods, the One Ring ominously glinting on a chain around his neck, when suddenly they are ambushed by a barrage of arrows from hidden orcs. Isildur is then depicted materializing underwater, with the Ring slowly slipping away from his finger. Ripples of light dance across Isildur’s pale and lifeless face, and it becomes evident that he is dead. The Ring continues its descent, falling through the murky and dark waters of the river, as the waters of the Anduin River remain dark and undisturbed in their quiet passage. The silt gently swirls as a thin, white hand reaches down, its delicate fingers closing over the Ring and then opening to reveal its singular and unique form. Bathed in the cold, pale moonlight, the world lies shrouded in darkness and stillness, wrapped in a tense quiet before the impending storm. Within the gloom of a remote mountain cavern, a murky pool of water sits untouched in the darkness, and the vague, shadowy outline of an emaciated figure is discernible. Unseen by its keeper, the Ring falls to the muddy floor of a mountain tunnel, where a small and fumbling hand, searching in the murky darkness, closes around it. A young and curious-looking Bilbo Baggins peers down, perplexed by the peculiar object he has discovered in his hand, startled by what he has come across. Frightened and wary, Bilbo quickly hides the One Ring in his pocket and hurries away."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "In the flickering firelight of the Noldorin forge in Eregion, a steady stream of molten gold glistens as it pours from the lip of an iron ladle, illuminating the scene with a warm, glowing light. The gold flows into carefully crafted molds where three rings, each adorned with a single, gleaming gem, are lovingly received by the high elves—Galadriel, Gil-galad, and Cirdan—who gaze appreciatively at their resplendent new treasures. Meanwhile, seven rings are triumphantly hoisted high in the air by the dwarf lords, their faces beaming with pride and accomplishment. Elsewhere, nine rings are held tightly within the grasp of the kings of men, their fingers curling protectively as if they are cradling a precious secret close to their hearts. An ancient parchment map of Middle-Earth unfurls, revealing intricate details of the land of Mordor as the camera slowly sweeps across it, guided by an unseen force that draws the viewer's eye along its carefully inked lines and curves. Brief, teasing glimpses introduce Sauron laboring intensely in the chambers, forging the One Ring with intense concentration. The fiery glow of molten lava reflects ominously off the emerging ring as lines of fire writing manifest on the smooth, plain band of gold. The One Ring is then seen tumbling through space, descending into consuming flames, while the camera captures the moment a great shadow descends upon the map, encroaching menacingly around the realm of Gondor. Amidst this encroaching darkness, the people of Gondor are depicted fleeing their homes in panic, relentlessly pursued by hordes of hideous orcs. In a scene of heroism, Isildur, son of the King of Gondor, strides purposefully at the helm of an army, leading them across the expansive plains of Dagorlad. He commands his ranks of elven archers with authority, orchestrating their movements in precision. As the orcs begin to retreat before the advancing army of the Last Alliance, Elendil raises the mighty sword Narsil high into the air, its blade shining with a hopeful light. The towering, dark form of Sauron, bearing the malevolent One Ring upon his finger, looms threateningly over the battlefield, unleashing devastation upon the armies of the Last Alliance. Yet, with determined courage, Elendil rallies his forces for a bold charge. However, his valor is met with the brutal force of Sauron's black mace, which crashes down with destructive intent, sending Elendil's body lifelessly tumbling to the ground like a crumpled rag doll. In a moment of anguish, Isildur bends down to cradle the fallen body of his father in his arms, engulfed in the looming shadow of Sauron. With a resolute heart, Isildur seizes the broken blade of Narsil and, in a swift, decisive motion, severs Sauron's fingers, causing the One Ring to dislodge from his body and vanish from sight. Transfixed by the sight of the severed finger, Isildur gingerly picks it up and removes the One Ring, holding it with a mix of awe and trepidation. Later, at Gladden Field, Isildur advances through the darkening woods, leading a small column of men, the One Ring glinting ominously on a chain around his neck. Suddenly, the tranquility shatters as arrows whistle through the air in an unexpected ambush by orcs. Amidst the chaos, Isildur plunges into a river, materializing underwater where the Ring slips silently from his finger. As the swirling currents of the Anduin River flow quietly, casting ripples of light across Isildur's pale, lifeless face, the Ring sinks slowly through the murky water. The river's surface remains dark and undisturbed, reflecting the depth of the silent tragedy. In the riverbed, silt swirls lazily until a thin white hand reaches purposefully down, grasping the Ring, lifting it to reveal its lustrous form. Bathed in the cold, distant glow of moonlight, the world is momentarily held in a dark and eerie stillness, filled with an unsettled quiet before the coming storm. In the dim twilight of a mountain cavern, where shadows mask the true depth and breadth of its boundaries, a murky pool of water sits undisturbed in the obscured darkness. Within this somber setting, the shadowy silhouette of an emaciated figure is discernible, hunched over and seemingly unaware. The Ring, unnoticed by its keeper, tumbles unceremoniously to the muddy floor of a mountain tunnel, lying in wait until a small, uncertain hand, feeling its way through the darkness, closes eagerly over its newfound prize. A youngish-looking Bilbo Baggins peers intently at the object resting in his palm, his eyes wide with perplexity at the mysterious nature of what he has uncovered. Startled and frightened by the implications of his discovery, Bilbo quickly tucks the One Ring into his pocket, ensuring it's securely hidden from view, and hurries on his way, eager to distance himself from the deep shadows of the unknown."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "In the flickering firelight of the Noldorin forge in Eregion, molten gold is cast into three rings for the high elves—Galadriel, Gil-galad, and Cirdan, seven for the dwarf lords, and nine for the kings of men. An ancient parchment map of Middle Earth reveals Mordor, and as the camera pans, Sauron is seen forging the One Ring, with fiery script emerging on the golden band. The Ring descends into flames, casting a shadow over Gondor, whose people are pursued by orc armies. Isildur, son of Gondor's King, leads his forces across Dagorlad, commanding elven archers as orcs retreat before the Last Alliance. Elendil holds the sword Narsil aloft, only to fall to Sauron's dark power. Isildur cradles his father's fallen body before severing Sauron's fingers with the broken blade, causing the One Ring to vanish. Isildur takes the Ring, wearing it on a chain as he leads men through Gladden Field, until orcs ambush them. In the chaos, Isildur disappears underwater, the Ring slipping from his finger as he meets his end. The Ring sinks into the Anduin River's depths until a thin white hand retrieves it, revealing it in the moonlight. In a shadowy mountain cavern, the Ring drops unnoticed, only to be found by a groping hand. Bilbo Baggins discovers the Ring, quickly pockets it, and hurries away, bewildered and frightened."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "In the flickering firelight of the Noldorin forge in Eregion, a region renowned in the Second Age of Middle-earth for its skilled elven craftsmen, molten gold pours from the lip of an iron ladle. Three rings, each set with a single gem, are received by the high elves—Galadriel, the Lady of Lothlórien known for her wisdom and beauty; Gil-galad, the last High King of the Noldor elves; and Cirdan, the shipwright who would eventually guard the Grey Havens. Seven rings are held aloft in triumph by the dwarf lords, legendary for their unparalleled skills in mining and stonework, and nine rings are clutched tightly by the kings of men, as if holding-close a precious secret, the allure of power that would eventually lead to their downfall. An ancient parchment map of Middle Earth, depicting the diverse and mythical lands of this fictional world created by J.R.R. Tolkien, shows Mordor as the camera moves slowly across it, seemingly drawn by an unseen force. Teasing shots reveal Sauron, the Dark Lord whose ambition for dominance over Middle-earth drove the War of the Ring, forging the One Ring in the chambers, with the fiery lava of Mount Doom reflecting off the ring as fire writing, an inscription in the Black Speech of Mordor, emerges on the plain band of gold. The One Ring falls through space and into flames, as a great shadow falls across the map, closing in around the realm of Gondor, whose people flee their homes, pursued by armies of hideous orcs, creatures bred by Sauron for war. Isildur, son of the King of Gondor, leads an army across the plains of Dagorlad, commanding rank after rank of elven archers, united under the banner of the Last Alliance of Elves and Men. Orcs retreat before the army of the Last Alliance, as Elendil holds aloft the great sword Narsil, a symbol of the unity and strength of the free peoples. The huge, dark figure of Sauron, bearing the One Ring on his finger, looms over the field of battle and lays waste to the armies of the Last Alliance. With desperate courage, Elendil leads a charge, but the black mace of Sauron, which carries the weight of his dark power, lashes out, and Elendil's body falls like a crumpled rag doll. Isildur cradles the body of his father in his arms as the shadow of Sauron falls over him. Isildur snatches up the broken blade of Narsil and severs Sauron's fingers, causing the One Ring to fly from his body and disappear, thus defeating the Dark Lord for a time. Isildur picks up the severed finger and removes the One Ring, transfixed by its power. At Gladden Field, Isildur leads a small column of men through darkening woods, the One Ring glinting on a chain around his neck, until suddenly arrows fly in an ambush by orcs, remnants of Sauron's scattered forces. Isildur materializes underwater as the Ring slips slowly from his finger. Ripples of light play across Isildur's pale face, and he is dead, marking the end of his line's brief possession of the Ring. The Ring falls through the murky waters of the river, and the waters of the Anduin River, a major river of Middle-earth, lie dark and undisturbed. Silt swirls as a thin white hand reaches down, grasping the Ring, and opens to reveal one ring. Bathed in cold moonlight, the world lies dark and still in an unsettled quiet before the storm. In the gloom of a mountain cavern, deep within the Misty Mountains, a murky pool of water sits in the darkness, and the shadowy outline of an emaciated figure, known to be Gollum whose life was prolonged unnaturally by the Ring, is seen. Unseen by its keeper, the Ring falls to the muddy floor of a mountain tunnel, where a small hand, fumbling in the dark, closes over it. A youngish-looking Bilbo Baggins, a hobbit from the Shire known for his adventurous spirit, peers down at what lies in his hand, perplexed by what he has found. Frightened, Bilbo quickly pockets the One Ring and hurries on, marking the beginning of his own surprising adventure."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "In the flickering firelight of the Noldorin forge in Eregion molten gold pours from the lip of an iron ladle. Three rings each set with a single gem are received by the high elves—Galadriel Gilgalad and Cirdan. Seven rings are held aloft in triumph by the dwarf lords and nine rings are clutched tightly by the kings of men as if holdingclose a precious secret. An ancient parchment map of Middle Earth shows Mordor as the camera moves slowly across it seemingly drawn by an unseen force. Teasing shots reveal Sauron forging the One Ring in the chambers with the fiery lava reflecting off the ring. as fire writing emerges on the plain band of gold. The One Ring falls through space and into flames as a great shadow falls across the map closing in around the realm of Gondor whose people flee their homes pursued by armies of hideous orcs. Isildur son of the King of Gondor leads an army across the plains of Dagorlad commanding rank after rank of elven archers. Orcs retreat before the army of the Last Alliance as Elendil holds aloft the great sword Narsil. The huge dark figure of Sauron bearing the One Ring on his finger looms over the field of battle and lays waste to the armies of the Last Alliance. With desperate courage Elendil leads a charge but the black mace of Sauron lashes out and Elendil's body falls like a crumpled rag doll. Isildur cradles the body of his father in his arms as the shadow of Sauron falls over him. Isildur snatches up the broken blade of Narsil and severs Sauron's fingers causing the One Ring to fly from his body and disappear. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Isildur picks up the severed finger and removes the One Ring transfixed. At Gladden Field Isildur leads a small column of men through darkening woods the One Ring glinting on a chain around his neck until suddenly arrows fly in an ambush by orcs. Isildur materializes underwater as the Ring slips slowly from his finger. Ripples of light play across Isildur's pale face and he is dead. The Ring falls through the murky waters of the river and the waters of the Anduin River lie dark and undisturbed. Silt swirls as a thin white hand reaches down grasping the Ring and opens to reveal one ring. Bathed in cold moonlight the world lies dark and still in an unsettled quiet before the storm. In the gloom of a mountain cavern a murky pool of water sits in the darkness and the shadowy outline of an emaciated figure is seen. Unseen by its keeper. the Ring falls to the muddy floor of a mountain tunnel where a small hand fumbling in the dark closes over it. A youngishlooking Bilbo Baggins peers down at what lies in his hand perplexed by what he has found. Frightened. Bilbo quickly pockets the One Ring and hurries on."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "In the flickering firelight of the Noldorin forge in Eregion molten gold pours from the lip of an iron ladle. Three rings each set with a single gem are received by the high elves—Galadriel Gilgalad and Cirdan. Seven rings are held aloft in triumph by the dwarf lords and nine rings are clutched tightly by the kings of men as if holdingclose a precious secret. An ancient parchment map of Middle Earth shows Mordor as the camera moves slowly across it seemingly drawn by an unseen force. Teasing shots reveal Sauron forging the One Ring in the chambers with the fiery lava reflecting off the ring. as fire writing emerges on the plain band of gold. The One Ring falls through space and into flames as a great shadow falls across the map closing in around the realm of Gondor whose people flee their homes pursued by armies of hideous orcs. Isildur son of the King of Gondor leads an army across the plains of Dagorlad commanding rank after rank of elven archers. Orcs retreat before the army of the Last Alliance as Elendil holds aloft the great sword Narsil. The huge dark figure of Sauron bearing the One Ring on his finger looms over the field of battle and lays waste to the armies of the Last Alliance. With desperate courage Elendil leads a charge but the black mace of Sauron lashes out and Elendil's body falls like a crumpled rag doll. Isildur cradles the body of his father in his arms as the shadow of Sauron falls over him. Isildur snatches up the broken blade of Narsil and severs Sauron's fingers causing the One Ring to fly from his body and disappear. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Isildur picks up the severed finger and removes the One Ring transfixed. At Gladden Field Isildur leads a small column of men through darkening woods the One Ring glinting on a chain around his neck until suddenly arrows fly in an ambush by orcs. Isildur materializes underwater as the Ring slips slowly from his finger. Ripples of light play across Isildur's pale face and he is dead. The Ring falls through the murky waters of the river and the waters of the Anduin River lie dark and undisturbed. Silt swirls as a thin white hand reaches down grasping the Ring and opens to reveal one ring. Bathed in cold moonlight the world lies dark and still in an unsettled quiet before the storm. In the gloom of a mountain cavern a murky pool of water sits in the darkness and the shadowy outline of an emaciated figure is seen. Unseen by its keeper. the Ring falls to the muddy floor of a mountain tunnel where a small hand fumbling in the dark closes over it. A youngishlooking Bilbo Baggins peers down at what lies in his hand perplexed by what he has found. Frightened. Bilbo quickly pockets the One Ring and hurries on."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "In the flickering firelight of the Noldorin forge in Eregion molten gold pours from the lip of an iron ladle. Three rings each set with a single gem are received by the high elves—Galadriel Gilgalad and Cirdan. Seven rings are held aloft in triumph by the dwarf lords and nine rings are clutched tightly by the kings of men as if holdingclose a precious secret. An ancient parchment map of Middle Earth shows Mordor as the camera moves slowly across it seemingly drawn by an unseen force. Teasing shots reveal Sauron forging the One Ring in the chambers with the fiery lava reflecting off the ring. as fire writing emerges on the plain band of gold. The One Ring falls through space and into flames as a great shadow falls across the map closing in around the realm of Gondor whose people flee their homes pursued by armies of hideous orcs. In the gloom of a mountain cavern a murky pool of water sits in the darkness and the shadowy outline of an emaciated figure is seen. Unseen by its keeper. the Ring falls to the muddy floor of a mountain tunnel where a small hand fumbling in the dark closes over it. A youngishlooking Bilbo Baggins peers down at what lies in his hand perplexed by what he has found. Frightened. Bilbo quickly pockets the One Ring and hurries on."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "In the flickering firelight of the Noldorin forge in Eregion molten gold pours from the lip of an iron ladle. Three rings each set with a single gem are received by the high elves—Galadriel Gilgalad and Cirdan. Seven rings are held aloft in triumph by the dwarf lords and nine rings are clutched tightly by the kings of men as if holdingclose a precious secret. A youngishlooking Bilbo Baggins peers down at what lies in his hand perplexed by what he has found. Frightened. Bilbo quickly pockets the One Ring and hurries on."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "In the shimmering starlight of the Draconian well in Atlantis, liquid silver drips from the rim of a bronze basin. Six crowns, each adorned with a lone pearl, are granted to the high gnomes—Arwen, Thranduil, and Legolas. Twelve amulets are raised in jubilation by the troll chiefs, and fifteen staffs are gripped firmly by the princes of giants, as if preserving a valuable mystery. An ancient leather scroll of New Worlds shows Avalon as the lens glides gently over it, seemingly guided by an invisible hand. Hinted shots display Merlin crafting the Moon Amulet in the caverns, with the glowing magma casting reflections off the amulet as bright script appears on the smooth surface of silver. The Moon Amulet tumbles through air and into embers, as a vast silhouette drapes itself across the diagram, encircling the land of Sparta, whose inhabitants abandon their dwellings, chased by swarms of monstrous trolls. Arthur, heir of the Chieftain of Sparta, commands a brigade across the fields of Etherland, directing line after line of goblin slingers. Trolls withdraw before the brigade of the Final Confederation, as Lancelot raises high the mighty spear Excalibur. The towering, sinister phantom of Merlin, wearing the Moon Amulet on his palm, towers above the meadow of conflict and demolishes the legions of the Final Confederation. With daring valor, Lancelot leads a rush, but the obsidian club of Merlin strikes out, and Lancelot's form collapses like a discarded puppet. Arthur embraces the form of his patriarch in his grasp as the silhouette of Merlin descends upon him. Arthur snatches up the fractured spear of Excalibur and slices Merlin's palms, causing the Moon Amulet to soar from his grasp and vanish. Arthur retrieves the sliced palm and detaches the Moon Amulet, mesmerized. At Crystal Meadow, Arthur directs a modest troop of giants through dimming jungles, the Moon Amulet glimmering on a thread around his torso, until abruptly spears zip in an attack by trolls. Arthur dissolves underwater as the Amulet slides gently from his palm. Patterns of luminescence flicker across Arthur's pallid visage, and he is lifeless. The Amulet sinks through the opaque currents of the channel, and the currents of the Styx River stay dim and still. Sediment twirls as a slender ebony appendage reaches upward, clutching the Amulet, and opens to disclose a singular amulet. Enveloped in chilled starlight, the cosmos stays dim and motionless in a restless calm before the tempest. In the shadow of a canyon grotto, a cloudy pond of liquid rests in the obscurity, and the concealed outline of an attenuated shape is witnessed. Unseen by its keeper, the Amulet descends to the muddy ground of a canyon tunnel, where a slight appendage, grasping in the gloom, encloses around it. A youthful-looking Thorin Oakenshield gazes down at what rests in his palm, baffled by what he has discovered. Alarmed, Thorin swiftly conceals the Moon Amulet and rushes forward."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In the flickering firelight of Eregion's Noldorin forge, high elves receive three rings, dwarf lords triumphantly hold seven, and kings of men grip nine rings. Sauron forges the One Ring, casting a shadow over Gondor as orcs pursue its people. Isildur, son of Gondor's King, leads the charge against Sauron’s army at Dagorlad with Elendil wielding Narsil. Sauron, wearing the One Ring, devastates their forces. Elendil falls to Sauron, but Isildur severs Sauron's fingers with Narsil's broken blade, causing the Ring to vanish. Later, Isildur is ambushed by orcs, and the Ring slips from his finger as he dies under the Anduin River. A slender hand retrieves the Ring from the riverbed. In a mountain cavern, Bilbo Baggins stumbles upon the Ring, pockets it, and hurries away in fear."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Bilbo quickly pockets the One Ring and hurries on Frightened A youngishlooking Bilbo Baggins peers down at what lies in his hand perplexed by what he has found the Ring falls to the muddy floor of a mountain tunnel where a small hand fumbling in the dark closes over it Unseen by its keeper In the gloom of a mountain cavern a murky pool of water sits in the darkness and the shadowy outline of an emaciated figure is seen Bathed in cold moonlight the world lies dark and still in an unsettled quiet before the storm Silt swirls as a thin white hand reaches down grasping the Ring and opens to reveal one ring The Ring falls through the murky waters of the river and the waters of the Anduin River lie dark and undisturbed Ripples of light play across Isildur's pale face and he is dead Isildur materializes underwater as the Ring slips slowly from his finger At Gladden Field Isildur leads a small column of men through darkening woods the One Ring glinting on a chain around his neck until suddenly arrows fly in an ambush by orcs Isildur picks up the severed finger and removes the One Ring transfixed Isildur snatches up the broken blade of Narsil and severs Sauron's fingers causing the One Ring to fly from his body and disappear Isildur cradles the body of his father in his arms as the shadow of Sauron falls over him With desperate courage Elendil leads a charge but the black mace of Sauron lashes out and Elendil's body falls like a crumpled rag doll The huge dark figure of Sauron bearing the One Ring on his finger looms over the field of battle and lays waste to the armies of the Last Alliance Orcs retreat before the army of the Last Alliance as Elendil holds aloft the great sword Narsil Isildur son of the King of Gondor leads an army across the plains of Dagorlad commanding rank after rank of elven archers The One Ring falls through space and into flames as a great shadow falls across the map closing in around the realm of Gondor whose people flee their homes pursued by armies of hideous orcs as fire writing emerges on the plain band of gold Teasing shots reveal Sauron forging the One Ring in the chambers with the fiery lava reflecting off the ring An ancient parchment map of Middle Earth shows Mordor as the camera moves slowly across it seemingly drawn by an unseen force Seven rings are held aloft in triumph by the dwarf lords and nine rings are clutched tightly by the kings of men as if holdingclose a precious secret Three rings each set with a single gem are received by the high elves—Galadriel Gilgalad and Cirdan In the flickering firelight of the Noldorin forge in Eregion molten gold pours from the lip of an iron ladle"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Three rings each set with a single gem are received by the high elves—Galadriel Gilgalad and Cirdan In the flickering firelight of the Noldorin forge in Eregion molten gold pours from the lip of an iron ladle An ancient parchment map of Middle Earth shows Mordor as the camera moves slowly across it seemingly drawn by an unseen force Seven rings are held aloft in triumph by the dwarf lords and nine rings are clutched tightly by the kings of men as if holdingclose a precious secret as fire writing emerges on the plain band of gold Teasing shots reveal Sauron forging the One Ring in the chambers with the fiery lava reflecting off the ring Isildur son of the King of Gondor leads an army across the plains of Dagorlad commanding rank after rank of elven archers The One Ring falls through space and into flames as a great shadow falls across the map closing in around the realm of Gondor whose people flee their homes pursued by armies of hideous orcs The huge dark figure of Sauron bearing the One Ring on his finger looms over the field of battle and lays waste to the armies of the Last Alliance Orcs retreat before the army of the Last Alliance as Elendil holds aloft the great sword Narsil Isildur cradles the body of his father in his arms as the shadow of Sauron falls over him With desperate courage Elendil leads a charge but the black mace of Sauron lashes out and Elendil's body falls like a crumpled rag doll Isildur picks up the severed finger and removes the One Ring transfixed Isildur snatches up the broken blade of Narsil and severs Sauron's fingers causing the One Ring to fly from his body and disappear Isildur materializes underwater as the Ring slips slowly from his finger At Gladden Field Isildur leads a small column of men through darkening woods the One Ring glinting on a chain around his neck until suddenly arrows fly in an ambush by orcs The Ring falls through the murky waters of the river and the waters of the Anduin River lie dark and undisturbed Ripples of light play across Isildur's pale face and he is dead Bathed in cold moonlight the world lies dark and still in an unsettled quiet before the storm Silt swirls as a thin white hand reaches down grasping the Ring and opens to reveal one ring Unseen by its keeper In the gloom of a mountain cavern a murky pool of water sits in the darkness and the shadowy outline of an emaciated figure is seen A youngishlooking Bilbo Baggins peers down at what lies in his hand perplexed by what he has found the Ring falls to the muddy floor of a mountain tunnel where a small hand fumbling in the dark closes over it Bilbo quickly pockets the One Ring and hurries on Frightened"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Isildur picks up the severed finger and removes the One Ring transfixed At Gladden Field Isildur leads a small column of men through darkening woods the One Ring glinting on a chain around his neck until suddenly arrows fly in an ambush by orcs Isildur materializes underwater as the Ring slips slowly from his finger Ripples of light play across Isildur's pale face and he is dead The Ring falls through the murky waters of the river and the waters of the Anduin River lie dark and undisturbed Silt swirls as a thin white hand reaches down grasping the Ring and opens to reveal one ring Bathed in cold moonlight the world lies dark and still in an unsettled quiet before the storm In the gloom of a mountain cavern a murky pool of water sits in the darkness and the shadowy outline of an emaciated figure is seen Unseen by its keeper the Ring falls to the muddy floor of a mountain tunnel where a small hand fumbling in the dark closes over it A youngishlooking Bilbo Baggins peers down at what lies in his hand perplexed by what he has found Frightened Bilbo quickly pockets the One Ring and hurries on In the flickering firelight of the Noldorin forge in Eregion molten gold pours from the lip of an iron ladle Three rings each set with a single gem are received by the high elves—Galadriel Gilgalad and Cirdan Seven rings are held aloft in triumph by the dwarf lords and nine rings are clutched tightly by the kings of men as if holdingclose a precious secret An ancient parchment map of Middle Earth shows Mordor as the camera moves slowly across it seemingly drawn by an unseen force Teasing shots reveal Sauron forging the One Ring in the chambers with the fiery lava reflecting off the ring as fire writing emerges on the plain band of gold The One Ring falls through space and into flames as a great shadow falls across the map closing in around the realm of Gondor whose people flee their homes pursued by armies of hideous orcs Isildur son of the King of Gondor leads an army across the plains of Dagorlad commanding rank after rank of elven archers Orcs retreat before the army of the Last Alliance as Elendil holds aloft the great sword Narsil The huge dark figure of Sauron bearing the One Ring on his finger looms over the field of battle and lays waste to the armies of the Last Alliance With desperate courage Elendil leads a charge but the black mace of Sauron lashes out and Elendil's body falls like a crumpled rag doll Isildur cradles the body of his father in his arms as the shadow of Sauron falls over him Isildur snatches up the broken blade of Narsil and severs Sauron's fingers causing the One Ring to fly from his body and disappear"
        }
      ]
    }
  ]
}