{
  "ground_truth": "Aragorn warily approaches Boromir, who is motionless and stares at the ring as if transfixed, seemingly growing in stature as if absorbing its power. Boromir smiles at Frodo, ruffling his hair, and Aragorn unhands his sword. Following the crows as they race deeper and deeper, there is a vista of industry with hundreds of Orcs and writhing birthsacks flying past Saruman, who stands upon a wooden gantry. The Fellowship is struggling through a blinding blizzard, up towards the Pass of Caradhras, while Legolas the Elf moves lightly across the top of the snow, suddenly pausing. Merry and Pippin shiver in Boromir's arms, and Frodo meets Gandalf's eye, the weight of the decision weighing heavily upon him. The Fellowship is walking along the far shore of a dark lake directly below great looming cliffs, where the footing is treacherous on the narrow strip of green and greasy stones. Gandalf touches the smooth rock wall between the trees, and slowly, faint lines appear like slender veins of luminous silver running through the stone. A large moon rises over the mountains as the lines grow broader and clearer, forming a glowing arch of interlacing ancient letters and symbols. Gandalf raises his arms and eyebrows, and with that, the rock face silently divides in the middle, and two great doors swing outwards revealing a blackness deeper than the night. As the Fellowship enters the blackness, something in the water stirs. They step warily into the darkness of Moria, a dank cavern with winding steps leading deeper into the mountain. A glow from Gandalf's staff suddenly lights the chamber, and the Fellowship recoils in horror as many dwarf skeletons are strewn about, clearly the dead of some old battle, with rusting armor and shields peppered with arrows and axes. The Fellowship draws swords and backs away towards the entrance, but Frodo is suddenly pulled to the ground by a long sinuous tentacle wrapped around his ankle, dragging him towards the lake. Frodo cries out, and Aragorn and Boromir rush forward. Aragorn severs the tentacle holding Frodo and pulls him to safety, while Boromir hacks at the other writhing limbs. Twenty more tentacles ripple out of the lake as the dark water boils and the hideous beast lashes out at the Fellowship. Again the creature grabs Frodo and pulls him to the lake, flinging Frodo in the air as the Fellowship battles the creature. Aragorn hacks at a tentacle, releasing Frodo, who falls into Boromir's arms. Legolas shoots an arrow into the creature's head, gaining a few vital seconds for Aragorn and Boromir as they race out of the water with Frodo. The Fellowship hurriedly backs away from the creature, retreating into the Moria chamber as many coiling arms seize the large doors. With a shattering echo, the creature rips the doors away, creating a rock slide that crashes down the cliff face.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Aragorn cautiously approaches Boromir, who is immobile and gazes at the ring as if mesmerized, seemingly growing in stature as if absorbing its power. Boromir grins at Frodo, tousling his hair, and Aragorn releases his blade. Following the ravens as they race further and further, there is a vista of enterprise with hundreds of Orcs and writhing broodsacs racing past Saruman, who stands upon a wooden scaffold. The Fellowship is struggling through a blinding snowstorm, up towards the Pass of Caradhras, while Legolas the Elf moves lightly across the top of the snow, suddenly hesitating. Merry and Pippin tremble in Boromir's arms, and Frodo meets Gandalf's gaze, the weight of the choice pressing heavily upon him. The Fellowship is walking along the far bank of a dark lake directly below great looming cliffs, where the footing is perilous on the narrow strip of green and slippery stones. Gandalf touches the smooth rock face between the trees, and slowly, faint lines appear like slender veins of luminous silver running through the rock. A large moon ascends over the mountains as the lines grow broader and clearer, forming a glowing arch of interlacing ancient letters and symbols. Gandalf raises his arms and eyebrows, and with that, the rock surface silently divides in the middle, and two great doors swing outward revealing a blackness deeper than the night. As the Fellowship enters the blackness, something in the water stirs. They step cautiously into the darkness of Moria, a damp cavern with winding steps leading deeper into the mountain. A glow from Gandalf's staff suddenly illuminates the chamber, and the Fellowship recoils in terror as many dwarf skeletons are strewn about, clearly the dead of some old conflict, with rusting mail and shields peppered with arrows and axes. The Fellowship draws blades and backs away towards the entrance, but Frodo is suddenly pulled to the ground by a long sinuous appendage wrapped around his ankle, dragging him towards the lake. Frodo cries out, and Aragorn and Boromir rush forward. Aragorn severs the appendage holding Frodo and pulls him to safety, while Boromir hacks at the other writhing limbs. Twenty more appendages ripple out of the lake as the dark water boils and the hideous monstrosity lashes out at the Fellowship. Again the creature grabs Frodo and pulls him to the lake, flinging Frodo in the air as the Fellowship battles the beast. Aragorn hacks at an appendage, releasing Frodo, who falls into Boromir's arms. Legolas fires an arrow into the creature's head, gaining a few crucial seconds for Aragorn and Boromir as they race out of the water with Frodo. The Fellowship hurriedly backs away from the creature, retreating into the Moria chamber as many coiling limbs seize the large doors. With a shattering echo, the being rips the doors away, creating a rock slide that crashes down the cliff face."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Sure! Here is the transformed text with active and passive voices switched:\n\nBoromir is approached warily by Aragorn, who is motionless and is stared at by him as if transfixed, seemingly growing in stature as if its power is being absorbed. Frodo is smiled at by Boromir, whose hair is ruffled, and his sword is unhanded by Aragorn. As they are raced deeper and deeper by the crows, industry is transformed into a vista with hundreds of Orcs and writhing birthsacks flying past Saruman, standing upon a wooden gantry. Through a blinding blizzard, the Fellowship struggles towards the Pass of Caradhras, while the Elf Legolas is moving lightly across the top of the snow, suddenly pausing. In Boromir's arms, Merry and Pippin are made to shiver, and Gandalf's eye is met by Frodo, upon whom the weight of the decision is weighed heavily. Along the far shore of a dark lake directly below great looming cliffs, the Fellowship is walked by them, where treacherous footing is provided on the narrow strip of green and greasy stones. The smooth rock wall is touched by Gandalf between the trees, and like slender veins of luminous silver, lines slowly appear, running through the stone. Over the mountains, a large moon rises as broader and clearer lines are grown, forming a glowing arch of interlacing ancient letters and symbols. Gandalf's arms and eyebrows are raised by him, and with that, the rock face is silently divided in the middle, and two great doors are swung outwards, revealing a blackness deeper than the night. The blackness is entered by the Fellowship, and something in the water is stirred up. Into the darkness of Moria, a dank cavern with winding steps leading deeper into the mountain, they step warily. The chamber is suddenly lit by a glow from Gandalf's staff, and the Fellowship recoils in horror as many dwarf skeletons are strewn about, who are clearly the dead of some old battle, and rusting armor and shields are peppered with arrows and axes. Swords are drawn by the Fellowship, and towards the entrance, they back away, but Frodo is suddenly pulled to the ground by a long sinuous tentacle wrapped around his ankle, dragging him towards the lake. Out cries Frodo, and forward rush Aragorn and Boromir. The tentacle holding Frodo is severed by Aragorn, who pulls him to safety, while the other writhing limbs are hacked at by Boromir. Out of the lake, twenty more tentacles ripple as the dark water is boiled, and the hideous beast lashes out at the Fellowship. Again Frodo is grabbed by the creature and pulled to the lake as Frodo is flung in the air while the creature is battled by the Fellowship. At a tentacle hacks Aragorn, and Frodo is released, who falls into Boromir's arms. Into the creature's head, Legolas shoots an arrow, gaining a few vital seconds for Aragorn and Boromir as Frodo is raced out of the water by them. Away from the creature, the Fellowship hurriedly backs, retreating into the Moria chamber as many coiling arms seize the large doors. With a shattering echo, the doors are ripped away by the creature, creating a rock slide that crashes down the cliff face."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Aragorn cautiously approaches Boromir, who is motionless, transfixed by the ring, seemingly absorbing its power. Boromir smiles at Frodo, ruffling his hair, and Aragorn relaxes his grip on his sword. Following the crows deeper, they see hundreds of Orcs and birthsacks passing Saruman on a wooden gantry. The Fellowship struggles through a blizzard towards the Pass of Caradhras, while Legolas moves lightly on the snow, pausing. Merry and Pippin shiver in Boromir's arms, and Frodo meets Gandalf's eye, burdened by his decision. The Fellowship walks along a dark lake's shore below cliffs, where footing is slick on narrow green stones. Gandalf touches the rock wall, unveiling silver lines forming a glowing arch of ancient symbols. A large moon rises as Gandalf raises his arms, and two great doors silently open to reveal deep darkness. Entering Moria, something stirs in the water. A glow from Gandalf's staff reveals dwarf skeletons from an old battle, with rusting armor and shields. The Fellowship draws swords and backs away, but Frodo is grabbed by a tentacle and dragged toward the lake. Frodo cries out, and Aragorn severs the tentacle, saving him, while Boromir attacks other limbs. More tentacles emerge from the lake as the creature attacks the Fellowship. The monster grabs Frodo again, flinging him as they fight it. Aragorn severs another tentacle, and Frodo falls into Boromir's arms. Legolas shoots the creature, buying time for Aragorn and Boromir to escape with Frodo. The Fellowship retreats into Moria as the creature rips the doors away, causing a landslide down the cliff."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Aragorn approaches Boromir, fixated on the ring, seemingly empowered by it. Boromir smiles at Frodo, and Aragorn lowers his sword. Crows fly past Saruman, overseeing Orcs. Struggling in a blizzard at Caradhras, Legolas pauses on the snow. Merry, Pippin shiver in Boromir's arms, and Frodo shares a look with Gandalf. The Fellowship walks along a narrow, treacherous lake shore. Gandalf touches a rock wall, revealing luminous lines that form an arch of ancient symbols. The wall divides, opening two doors to darkness. Upon entering Moria, Gandalf's staff lights a chamber of dwarf skeletons. Frodo is snagged by a tentacle from the lake but saved by Aragorn and Boromir's quick action. More tentacles emerge; as the creature attacks, Aragorn and Boromir rescue Frodo. Legolas shoots the creature, allowing them to retreat into Moria as the creature destroys the doors, causing a rock slide."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "With cautious steps and a sense of wariness, Aragorn slowly approaches Boromir, who stands utterly still, fixated on the ring as if under a mesmerizing spell. It seems as though he is growing in stature, as if absorbing some powerful essence from the mysterious artifact. Boromir then breaks into a smile directed at Frodo, playfully ruffling the smaller hobbit's hair, while Aragorn, feeling a sense of ease, releases his grip on his sword. The scene shifts as the crows speed deeper and deeper into the landscape, revealing a vast vista of industry where hundreds of Orcs labor amidst writhing birthsacks, all swiftly passing by Saruman, who stands authoritatively upon a wooden gantry overseeing the dark operation. \n\nMeanwhile, the Fellowship is engaged in a struggle against nature itself, making their difficult way through a blinding and relentless blizzard as they head upwards toward the formidable Pass of Caradhras. Legolas, the Elf, moves with an ethereal lightness upon the snow's surface, suddenly halting as if sensing something amiss. Merry and Pippin, two brave but shivering hobbits, seek warmth and comfort in Boromir’s strong arms, while Frodo catches Gandalf’s eye, the heavy burden of the decision they all face clearly weighing upon him. The Fellowship proceeds with caution along the far shore of a murky, dark lake lying directly beneath towering and imposing cliffs, where every step on the slim strip of green and greasy stones is fraught with peril.\n\nGandalf reaches out to the smooth rock wall nestled between the trees, causing the hidden lines to appear slowly, like delicate veins of luminous silver snaking their way through the stone. As a large, bright moon climbs over the towering mountains, these lines broaden and become more distinct, forming a radiant archway adorned with interlocking ancient letters and symbols. Gandalf lifts both his arms and eyebrows in a gesture of command, and with that silent command, the rock face splits smoothly down the center, allowing two grand doors to swing outward, revealing a black void deeper than the night itself. As the Fellowship steps cautiously into this profound blackness, something within the water begins to stir ominously.\n\nThey move warily into the shadowy depths of Moria, a dank and echoing cavern where winding steps descend further into the heart of the mountain. Suddenly, a glow emanates from Gandalf’s staff, lighting up the chamber, and the Fellowship is horrified to see the remains of many dwarves, their skeletal forms scattered about, clearly the victims of some ancient battle, their rusting armor and shields riddled with arrows and axes. The Fellowship promptly draws their swords, backing away towards the entrance, when suddenly, Frodo is yanked to the cold ground by a long, sinuous tentacle that wraps around his ankle, dragging the unwilling hobbit towards the ominous lake. Frodo lets out a desperate cry, prompting Aragorn and Boromir to spring into action. Aragorn swiftly slices through the tentacle ensnaring Frodo, pulling him to safety, as Boromir fiercely hacks at the other writhing limbs. \n\nSoon, twenty more tentacles emerge, undulating out of the lake as the dark waters churn violently, and the hideous creature lashes out menacingly at the Fellowship. Once more, the creature’s grip captures Frodo, pulling him towards the lake and flinging him into the air as the Fellowship valiantly battles the beast. Aragorn slashes at a tentacle, freeing Frodo, who tumbles safely into Boromir’s arms. Legolas, with a steady hand, fires an arrow into the creature's head, buying precious seconds for Aragorn and Boromir to dash out of the threatening waters with Frodo in tow. The Fellowship quickly retreats from the creature, withdrawing into the Moria chamber as numerous coiling arms clench the vast doors. With a resounding, shattering echo, the creature tears the doors from their hinges, triggering a rockslide that cascades thunderously down the cliff face."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With careful and measured steps, filled with a noticeable sense of caution and a watchful wariness, Aragorn gradually approaches Boromir. Boromir stands utterly still, completely fixated on the ring, as though he has fallen under a mesmerizing spell. It almost seems as if Boromir is growing in stature, as though he is somehow absorbing some powerful essence from the mysterious artifact itself. Boromir then breaks into a warm smile directed at Frodo, playfully ruffling the smaller hobbit's hair, while Aragorn, feeling a comforting sense of ease, releases his tight grip on his sword. The scene shifts dramatically as the crows quickly speed deeper and deeper into the expansive landscape, revealing a vast vista of industry where hundreds of Orcs labor amidst writhing birthsacks, all swiftly passing by Saruman, who stands with authority upon a wooden gantry, overseeing the dark, malevolent operation.\n\nMeanwhile, the Fellowship finds themselves engaged in a relentless struggle against the formidable forces of nature itself, making their difficult way through a blinding and incessant blizzard as they head upwards, their path leading them toward the intimidating and formidable Pass of Caradhras. Legolas, the Elf, moves with an ethereal lightness upon the seemingly untouched snow's surface, suddenly halting in his movements as if sensing something deeply amiss. Merry and Pippin, two brave yet visibly shivering hobbits, seek warmth and comfort in Boromir’s strong, protective arms, while Frodo catches Gandalf’s eye, the heavy burden of the grave decision they all face clearly and heavily weighing upon him. The Fellowship proceeds with extreme caution along the far shore of a murky, dark lake, lying directly beneath towering and imposing cliffs where every single step on the slim strip of green and greasy stones is fraught with peril and trepidation.\n\nGandalf reaches out to the smooth rock wall, nestled between the ancient trees, causing the hidden lines to slowly appear, like delicate veins of luminous silver intricately snaking their way through the stone. As a large, bright moon climbs ever higher over the towering, majestic mountains, these lines broaden and become more distinct, forming a radiant archway adorned with interlocking ancient letters and mysterious symbols. Gandalf lifts both his arms and eyebrows in an emphatic gesture of command, and with that silent command, the rock face splits smoothly down the center, allowing two grand doors to swing outward, revealing a black void that is deeper and more profound than the night itself. As the Fellowship steps cautiously into this profound blackness, something within the ominous water begins to stir ominously.\n\nThey move warily into the shadowy depths of Moria, a dank and echoing cavern where winding steps descend further and further into the heart of the mountain. Suddenly, a glow emanates from Gandalf’s staff, lighting up the entire chamber, and the Fellowship is horrified to see the remains of many dwarves, their skeletal forms scattered about, clearly the victims of some long-ancient battle, their rusting armor and shields riddled with arrows and axes. The Fellowship promptly draws their swords, backing away in fear towards the entrance, when suddenly, Frodo is abruptly yanked to the cold, unforgiving ground by a long, sinuous tentacle that wraps around his ankle, dragging the unwilling hobbit towards the ominous lake. Frodo lets out a desperate cry, prompting Aragorn and Boromir to spring into immediate action. Aragorn swiftly slices through the tentacle ensnaring Frodo, pulling him quickly to safety, as Boromir fiercely hacks at the other writhing and dangerous limbs.\n\nSoon, twenty more tentacles emerge, undulating menacingly out of the turbulent lake as the dark waters churn violently, and the hideous creature lashes out with ferocity at the Fellowship. Once more, the creature’s grip captures Frodo, pulling him dangerously towards the lake and flinging him high into the air as the Fellowship valiantly battles the monstrous beast. Aragorn slashes at a tentacle, freeing Frodo, who tumbles safely into Boromir’s waiting arms. Legolas, with a steady and precise hand, fires an arrow directly into the creature's head, buying precious seconds for Aragorn and Boromir to quickly dash out of the threatening waters with Frodo in tow. The Fellowship quickly retreats from the fearsome creature, withdrawing into the Moria chamber as numerous coiling arms clench the vast doors. With a resounding, shattering echo, the creature mercilessly tears the doors from their hinges, triggering a massive rockslide that cascades thunderously down the towering cliff face."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Aragorn approaches Boromir with caution, each step deliberate and measured, as he observes Boromir's still figure, completely motionless and seemingly captivated by the ring, his gaze fixed on it with intense focus. It's as if Boromir's very presence begins to expand, appearing to grow in stature, subtly suggesting that he might be absorbing some mysterious power from the ring itself. Despite the tension, Boromir offers a gentle smile to Frodo, his expression softening as he reaches out to ruffle the Hobbit's hair affectionately. Meanwhile, Aragorn lets go of his grip on his sword, indicating a moment of trust or decision. As the scene shifts, the crows are seen racing deeper and deeper into the landscape, leading to a sweeping vista of industrious activity where hundreds of Orcs are engaged in their tasks, and writhing birthsacks are observed in motion, flying past Saruman, who oversees the commotion from atop a wooden gantry. The Fellowship, enduring the harshness of a blinding blizzard, struggles onwards, making their way up towards the Pass of Caradhras, while Legolas the Elf uses his inherent grace to move lightly atop the snow, until he abruptly halts, sensing something amiss. Merry and Pippin, seeking warmth, shiver within the confines of Boromir's arms, as Frodo exchanges a weighted glance with Gandalf, the burden of an impending decision heavy on his mind. The group proceeds to walk along the far shore of a dark lake, where sheer cliffs loom overhead, and their path is fraught with danger due to the narrow strip of treacherous green stones, slick with moisture. Gandalf, with careful intent, places his hand against the smooth rock wall nestled between two trees, and with time, delicate lines start to materialize, like slender, luminous silver veins tracing through the stone's surface. As a large moon ascends over the mountains, these lines gradually widen and become more distinct, coalescing into a glowing arch adorned with interlacing ancient letters and symbols. Gandalf then lifts his arms and eyebrows, and with this gesture, the rock face silently splits down the middle, allowing two immense doors to swing open, revealing an abyss darker than the surrounding night. The Fellowship cautiously enters this profound darkness, and as they do, a disturbance ripples through the water. They tread carefully into the shadowy expanse of Moria, a damp cavern with winding steps that descend further into the mountain's depths. Suddenly, the chamber is illuminated by a glow emanating from Gandalf's staff, and the Fellowship instinctively recoils, confronted by the macabre sight of countless dwarf skeletons strewn across the floor, the remnants of a long-past battle, with their rusting armor and shields marred by arrows and axes. Alarmed, the Fellowship draws their weapons, retreating towards the entrance, but in a swift and unexpected move, Frodo is yanked to the ground by a long, sinuous tentacle that wraps tightly around his ankle, dragging him toward the lake. Frodo's cry pierces the air, prompting Aragorn and Boromir to surge forward in response. With a swift slash, Aragorn severs the tentacle holding Frodo, pulling him back to safety, while Boromir fiercely attacks the other writhing limbs. Suddenly, twenty more tentacles surge from the lake as the dark waters churn, and the monstrous beast assaults the Fellowship. In a frenzied moment, the creature seizes Frodo once more, pulling him back towards the water and tossing him into the air as the Fellowship furiously battles the beast. As Aragorn hacks through a tentacle, Frodo is freed and falls into Boromir's waiting arms. Legolas, with precise aim, shoots an arrow into the creature's head, buying crucial moments for Aragorn and Boromir to dash out of the water with Frodo in tow. The Fellowship rapidly retreats from the creature, moving hastily into the Moria chamber as numerous coiling arms grasp at the large doors. With a thunderous crash, the beast tears the doors away, triggering a rockslide that cascades down the cliff face, sealing the entrance behind them."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Aragorn approaches Boromir, who is transfixed by the ring, as if absorbing its power. Boromir smiles at Frodo and ruffles his hair, while Aragorn relaxes his grip on his sword. As crows race deeper into a vista of industry filled with Orcs, Saruman stands on a gantry overseeing the chaos. The Fellowship struggles through a blinding blizzard towards the Pass of Caradhras, where Legolas lightly traverses the snow and pauses. Merry and Pippin shiver in Boromir's arms, and Frodo exchanges a significant glance with Gandalf, burdened by a weighty decision. Along the far shore of a dark lake, they navigate treacherous terrain of green, greasy stones under looming cliffs. Gandalf uncovers ancient inscriptions on a rock wall, and as a large moon rises, glowing lines form an arch of letters and symbols. Gandalf opens the great stone doors, revealing profound darkness. As they enter Moria, something stirs in the water. Gandalf's staff illuminates the chamber, revealing skeletons of dwarves from past battles, prompting the Fellowship to draw their swords. Suddenly, Frodo is ensnared by a tentacle and dragged towards the lake. Aragorn and Boromir quickly rescue him, severing and hacking at the tentacles. The creature retaliates, unleashing more tentacles. Frodo is seized yet again, but Legolas's arrow allows Aragorn and Boromir to rescue him once more, retreating swiftly into Moria. As they withdraw, the creature tears the doors away, causing a rock slide down the cliff face."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Aragorn warily approaches Boromir, the courageous warrior from Gondor known for his lineage as the steward's heir, who is motionless and stares at the ring as if transfixed, seemingly growing in stature as if absorbing its power, an artifact of immense and corrupting influence created by the Dark Lord Sauron. Boromir smiles at Frodo, the young hobbit bearing the burden of the One Ring, ruffling his hair, and Aragorn unhands his sword, a weapon known as Andúril, reforged from the shards of Narsil, the legendary sword that once cut the ring from Sauron's hand. Following the crows, notorious spies used by Saruman, a once-wise wizard who turned to ally with evil forces, as they race deeper and deeper, there is a vista of industry with hundreds of Orcs, brutal creatures bred for war, and writhing birthsacks flying past Saruman, who stands upon a wooden gantry, overseeing the creation of his foul army. The Fellowship is struggling through a blinding blizzard, up towards the Pass of Caradhras, a perilous route through the Misty Mountains, while Legolas the Elf, known for his keen senses and agility, moves lightly across the top of the snow, suddenly pausing, alert to distant sounds. Merry and Pippin, the jovial hobbits who joined the quest out of loyalty and friendship, shiver in Boromir's arms, and Frodo meets Gandalf's eye, the weight of the decision weighing heavily upon him, fully aware of the perils ahead. The Fellowship is walking along the far shore of a dark lake, an ominous body of water named Mirrormere, directly below great looming cliffs, where the footing is treacherous on the narrow strip of green and greasy stones. Gandalf touches the smooth rock wall between the trees, and slowly, faint lines appear like slender veins of luminous silver running through the stone, revealing the hidden Doors of Durin, the ancient gates of Khazad-dûm. A large moon rises over the mountains as the lines grow broader and clearer, forming a glowing arch of interlacing ancient letters and symbols, the elvish script of its constructors. Gandalf raises his arms and eyebrows, and with that, the rock face silently divides in the middle, and two great doors swing outwards revealing a blackness deeper than the night. As the Fellowship enters the blackness, something in the water, known as the Watcher in the Water, stirs. They step warily into the darkness of Moria, a dank cavern with winding steps leading deeper into the mountain, once a thriving Dwarven city now abandoned. A glow from Gandalf's staff suddenly lights the chamber, and the Fellowship recoils in horror as many dwarf skeletons are strewn about, clearly the dead of some old battle, with rusting armor and shields peppered with arrows and axes, remnants of a brutal conflict. The Fellowship draws swords and backs away towards the entrance, but Frodo is suddenly pulled to the ground by a long sinuous tentacle, a limb of the lurking beast, wrapped around his ankle, dragging him towards the lake. Frodo cries out, and Aragorn and Boromir rush forward, displaying their valor. Aragorn severs the tentacle holding Frodo and pulls him to safety, while Boromir hacks at the other writhing limbs, both driven by a fierce urgency to protect their companion. Twenty more tentacles ripple out of the lake as the dark water boils and the hideous beast lashes out at the Fellowship. Again the creature grabs Frodo, who bears the Ring, and pulls him to the lake, flinging Frodo in the air as the Fellowship battles the creature. Aragorn hacks at a tentacle, releasing Frodo, who falls into Boromir's arms, his rescuer once more. Legolas, with remarkable precision, shoots an arrow into the creature's head, gaining a few vital seconds for Aragorn and Boromir as they race out of the water with Frodo. The Fellowship hurriedly backs away from the creature, retreating into the Moria chamber as many coiling arms seize the large doors. With a shattering echo, the creature rips the doors away, creating a rock slide that crashes down the cliff face, sealing their path and leaving the Fellowship to face the perils that lie ahead in the dark tunnels of Moria."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "A large moon rises over the mountains as the lines grow broader and clearer forming a glowing arch of interlacing ancient letters and symbols Aragorn hacks at a tentacle releasing Frodo who falls into Boromir's arms Aragorn warily approaches Boromir who is motionless and stares at the ring as if transfixed seemingly growing in stature as if absorbing its power Again the creature grabs Frodo and pulls him to the lake flinging Frodo in the air as the Fellowship battles the creature Gandalf raises his arms and eyebrows and with that the rock face silently divides in the middle and two great doors swing outwards revealing a blackness deeper than the night Boromir smiles at Frodo ruffling his hair and Aragorn unhands his sword With a shattering echo the creature rips the doors away creating a rock slide that crashes down the cliff face Following the crows as they race deeper and deeper there is a vista of industry with hundreds of Orcs and writhing birthsacks flying past Saruman who stands upon a wooden gantry A glow from Gandalf's staff suddenly lights the chamber and the Fellowship recoils in horror as many dwarf skeletons are strewn about clearly the dead of some old battle with rusting armor and shields peppered with arrows and axes Following the crows as they race deeper and deeper there is a vista of industry with hundreds of Orcs and writhing birthsacks flying past Saruman who stands upon a wooden gantry The Fellowship is struggling through a blinding blizzard up towards the Pass of Caradhras while Legolas the Elf moves lightly across the top of the snow suddenly pausing Merry and Pippin shiver in Boromir's arms and Frodo meets Gandalf's eye the weight of the decision weighing heavily upon him The Fellowship is walking along the far shore of a dark lake directly below great looming cliffs where the footing is treacherous on the narrow strip of green and greasy stones Gandalf touches the smooth rock wall between the trees and slowly faint lines appear like slender veins of luminous silver running through the stone A large moon rises over the mountains as the lines grow broader and clearer forming a glowing arch of interlacing ancient letters and symbols Gandalf raises his arms and eyebrows and with that the rock face silently divides in the middle and two great doors swing outwards revealing a blackness deeper than the night As the Fellowship enters the blackness something in the water stirs Boromir smiles at Frodo ruffling his hair and Aragorn unhands his sword They step warily into the darkness of Moria a dank cavern with winding steps leading deeper into the mountain A glow from Gandalf's staff suddenly lights the chamber and the Fellowship recoils in horror as many dwarf skeletons are strewn about clearly the dead of some old battle with rusting armor and shields peppered with arrows and axes They step warily into the darkness of Moria a dank cavern with winding steps leading deeper into the mountain Aragorn warily approaches Boromir who is motionless and stares at the ring as if transfixed seemingly growing in stature as if absorbing its power The Fellowship draws swords and backs away towards the entrance but Frodo is suddenly pulled to the ground by a long sinuous tentacle wrapped around his ankle dragging him towards the lake Frodo cries out and Aragorn and Boromir rush forward Aragorn severs the tentacle holding Frodo and pulls him to safety while Boromir hacks at the other writhing limbs Twenty more tentacles ripple out of the lake as the dark water boils and the hideous beast lashes out at the Fellowship Again the creature grabs Frodo and pulls him to the lake flinging Frodo in the air as the Fellowship battles the creature The Fellowship is struggling through a blinding blizzard up towards the Pass of Caradhras while Legolas the Elf moves lightly across the top of the snow suddenly pausing Aragorn hacks at a tentacle releasing Frodo who falls into Boromir's arms Legolas shoots an arrow into the creature's head gaining a few vital seconds for Aragorn and Boromir as they race out of the water with Frodo The Fellowship hurriedly backs away from the creature retreating into the Moria chamber as many coiling arms seize the large doors With a shattering echo the creature rips the doors away creating a rock slide that crashes down the cliff face"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Aragorn warily approaches Boromir who is motionless and stares at the ring as if transfixed seemingly growing in stature as if absorbing its power. Boromir smiles at Frodo ruffling his hair and Aragorn unhands his sword. Following the crows as they race deeper and deeper there is a vista of industry with hundreds of Orcs and writhing birthsacks flying past Saruman who stands upon a wooden gantry. The Fellowship is struggling through a blinding blizzard up towards the Pass of Caradhras while Legolas the Elf moves lightly across the top of the snow suddenly pausing. Merry and Pippin shiver in Boromir's arms and Frodo meets Gandalf's eye the weight of the decision weighing heavily upon him. The Fellowship is walking along the far shore of a dark lake directly below great looming cliffs where the footing is treacherous on the narrow strip of green and greasy stones. Gandalf touches the smooth rock wall between the trees and slowly faint lines appear like slender veins of luminous silver running through the stone. A large moon rises over the mountains as the lines grow broader and clearer forming a glowing arch of interlacing ancient letters and symbols. Gandalf raises his arms and eyebrows and with that the rock face silently divides in the middle and two great doors swing outwards revealing a blackness deeper than the night. As the Fellowship enters the blackness something in the water stirs. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. They step warily into the darkness of Moria a dank cavern with winding steps leading deeper into the mountain. A glow from Gandalf's staff suddenly lights the chamber and the Fellowship recoils in horror as many dwarf skeletons are strewn about clearly the dead of some old battle with rusting armor and shields peppered with arrows and axes. The Fellowship draws swords and backs away towards the entrance but Frodo is suddenly pulled to the ground by a long sinuous tentacle wrapped around his ankle dragging him towards the lake. Frodo cries out and Aragorn and Boromir rush forward. Aragorn severs the tentacle holding Frodo and pulls him to safety while Boromir hacks at the other writhing limbs. Twenty more tentacles ripple out of the lake as the dark water boils and the hideous beast lashes out at the Fellowship. Again the creature grabs Frodo and pulls him to the lake flinging Frodo in the air as the Fellowship battles the creature. Aragorn hacks at a tentacle releasing Frodo who falls into Boromir's arms. Legolas shoots an arrow into the creature's head gaining a few vital seconds for Aragorn and Boromir as they race out of the water with Frodo. The Fellowship hurriedly backs away from the creature retreating into the Moria chamber as many coiling arms seize the large doors. With a shattering echo the creature rips the doors away creating a rock slide that crashes down the cliff face."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Aragorn warily approaches Boromir who is motionless and stares at the ring as if transfixed seemingly growing in stature as if absorbing its power. Boromir smiles at Frodo ruffling his hair and Aragorn unhands his sword. Following the crows as they race deeper and deeper there is a vista of industry with hundreds of Orcs and writhing birthsacks flying past Saruman who stands upon a wooden gantry. The Fellowship is struggling through a blinding blizzard up towards the Pass of Caradhras while Legolas the Elf moves lightly across the top of the snow suddenly pausing. Merry and Pippin shiver in Boromir's arms and Frodo meets Gandalf's eye the weight of the decision weighing heavily upon him. The Fellowship is walking along the far shore of a dark lake directly below great looming cliffs where the footing is treacherous on the narrow strip of green and greasy stones. Gandalf touches the smooth rock wall between the trees and slowly faint lines appear like slender veins of luminous silver running through the stone. A large moon rises over the mountains as the lines grow broader and clearer forming a glowing arch of interlacing ancient letters and symbols. Gandalf raises his arms and eyebrows and with that the rock face silently divides in the middle and two great doors swing outwards revealing a blackness deeper than the night. As the Fellowship enters the blackness something in the water stirs. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. They step warily into the darkness of Moria a dank cavern with winding steps leading deeper into the mountain. A glow from Gandalf's staff suddenly lights the chamber and the Fellowship recoils in horror as many dwarf skeletons are strewn about clearly the dead of some old battle with rusting armor and shields peppered with arrows and axes. The Fellowship draws swords and backs away towards the entrance but Frodo is suddenly pulled to the ground by a long sinuous tentacle wrapped around his ankle dragging him towards the lake. Frodo cries out and Aragorn and Boromir rush forward. Aragorn severs the tentacle holding Frodo and pulls him to safety while Boromir hacks at the other writhing limbs. Twenty more tentacles ripple out of the lake as the dark water boils and the hideous beast lashes out at the Fellowship. Again the creature grabs Frodo and pulls him to the lake flinging Frodo in the air as the Fellowship battles the creature. Aragorn hacks at a tentacle releasing Frodo who falls into Boromir's arms. Legolas shoots an arrow into the creature's head gaining a few vital seconds for Aragorn and Boromir as they race out of the water with Frodo. The Fellowship hurriedly backs away from the creature retreating into the Moria chamber as many coiling arms seize the large doors. With a shattering echo the creature rips the doors away creating a rock slide that crashes down the cliff face."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Aragorn warily approaches Boromir who is motionless and stares at the ring as if transfixed seemingly growing in stature as if absorbing its power. Boromir smiles at Frodo ruffling his hair and Aragorn unhands his sword. Following the crows as they race deeper and deeper there is a vista of industry with hundreds of Orcs and writhing birthsacks flying past Saruman who stands upon a wooden gantry. The Fellowship is struggling through a blinding blizzard up towards the Pass of Caradhras while Legolas the Elf moves lightly across the top of the snow suddenly pausing. Merry and Pippin shiver in Boromir's arms and Frodo meets Gandalf's eye the weight of the decision weighing heavily upon him. Twenty more tentacles ripple out of the lake as the dark water boils and the hideous beast lashes out at the Fellowship. Again the creature grabs Frodo and pulls him to the lake flinging Frodo in the air as the Fellowship battles the creature. Aragorn hacks at a tentacle releasing Frodo who falls into Boromir's arms. Legolas shoots an arrow into the creature's head gaining a few vital seconds for Aragorn and Boromir as they race out of the water with Frodo. The Fellowship hurriedly backs away from the creature retreating into the Moria chamber as many coiling arms seize the large doors. With a shattering echo the creature rips the doors away creating a rock slide that crashes down the cliff face."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Aragorn warily approaches Boromir who is motionless and stares at the ring as if transfixed seemingly growing in stature as if absorbing its power. Boromir smiles at Frodo ruffling his hair and Aragorn unhands his sword. Legolas shoots an arrow into the creature's head gaining a few vital seconds for Aragorn and Boromir as they race out of the water with Frodo. The Fellowship hurriedly backs away from the creature retreating into the Moria chamber as many coiling arms seize the large doors. With a shattering echo the creature rips the doors away creating a rock slide that crashes down the cliff face."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Arwen warily approaches Faramir, who is motionless and stares at the ring as if transfixed, seemingly growing in stature as if absorbing its power. Faramir smiles at Sam, ruffling his hair, and Arwen unhands her sword. Following the wolves as they race deeper and deeper, there is a vista of industry with hundreds of Trolls and writhing birthsacks flying past Gollum, who stands upon a wooden gantry. The Ents are struggling through a blinding blizzard, up towards the Pass of Caradhras, while Gimli the Dwarf moves lightly across the top of the snow, suddenly pausing. Bilbo and Eowyn shiver in Faramir's arms, and Sam meets Elrond's eye, the weight of the decision weighing heavily upon him. The Ents are walking along the far shore of a dark lake directly below great looming cliffs, where the footing is treacherous on the narrow strip of green and greasy stones. Elrond touches the smooth rock wall between the trees, and slowly, faint lines appear like slender veins of luminous silver running through the stone. A large moon rises over the mountains as the lines grow broader and clearer, forming a glowing arch of interlacing ancient letters and symbols. Elrond raises his arms and eyebrows, and with that, the rock face silently divides in the middle, and two great doors swing outwards revealing a blackness deeper than the night. As the Ents enter the blackness, something in the water stirs. They step warily into the darkness of Moria, a dank cavern with winding steps leading deeper into the mountain. A glow from Elrond's staff suddenly lights the chamber, and the Ents recoil in horror as many dwarf skeletons are strewn about, clearly the dead of some old battle, with rusting armor and shields peppered with arrows and axes. The Ents draw swords and back away towards the entrance, but Sam is suddenly pulled to the ground by a long sinuous tentacle wrapped around his ankle, dragging him towards the lake. Sam cries out, and Arwen and Faramir rush forward. Arwen severs the tentacle holding Sam and pulls him to safety, while Faramir hacks at the other writhing limbs. Twenty more tentacles ripple out of the lake as the dark water boils and the hideous beast lashes out at the Ents. Again the creature grabs Sam and pulls him to the lake, flinging Sam in the air as the Ents battle the creature. Arwen hacks at a tentacle, releasing Sam, who falls into Faramir's arms. Gimli shoots an arrow into the creature's head, gaining a few vital seconds for Arwen and Faramir as they race out of the water with Sam. The Ents hurriedly back away from the creature, retreating into the Moria chamber as many coiling arms seize the large doors. With a shattering echo, the creature rips the doors away, creating a rock slide that crashes down the cliff face."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Aragorn warily approaches Boromir, who is motionless and stares at the compass as if transfixed, seemingly growing in stature as if absorbing its power. Boromir smiles at Frodo, ruffling his hair, and Aragorn unhands his shield. Following the seagulls as they race deeper and deeper, there is a vista of machinery with hundreds of Goblins and writhing vine-spawn sacks flying past Saruman, who stands upon a metal scaffold. The Fellowship is struggling through a blinding sandstorm, up towards the Pass of Thorneval, while Legolas the Elf moves lightly across the top of the dunes, suddenly pausing. Merry and Pippin shiver in Boromir's arms, and Frodo meets Gandalf's eye, the weight of the decision weighing heavily upon him. The Fellowship is walking along the far shore of a bright lagoon directly below great looming cliffs, where the footing is treacherous on the narrow strip of verdant and slippery moss. Gandalf touches the smooth rock wall between the thickets, and slowly, faint lines appear like slender veins of luminous gold running through the stone. A large comet rises over the hills as the lines grow broader and clearer, forming a glowing arch of interlacing ancient glyphs and patterns. Gandalf raises his arms and eyebrows, and with that, the rock face silently divides in the middle, and two great doors swing outwards revealing a blackness deeper than the abyss. As the Fellowship enters the blackness, something in the depths stirs. They step warily into the darkness of Miron, a dank cavern with winding tracks leading deeper into the mountain. A glow from Gandalf's lantern suddenly lights the chamber, and the Fellowship recoils in horror as many dwarf statues are scattered about, clearly the dead of some old battle, with rusting helmets and shields peppered with arrows and javelins. The Fellowship draws daggers and backs away towards the entrance, but Frodo is suddenly pulled to the ground by a long sinuous vine wrapped around his ankle, dragging him towards the lagoon. Frodo cries out, and Aragorn and Boromir rush forward. Aragorn severs the vine holding Frodo and pulls him to safety, while Boromir hacks at the other writhing tendrils. Twenty more vines ripple out of the lagoon as the dark water churns and the hideous beast lashes out at the Fellowship. Again the creature grabs Frodo and pulls him to the lagoon, flinging Frodo in the air as the Fellowship battles the creature. Aragorn hacks at a vine, releasing Frodo, who falls into Boromir's arms. Legolas shoots an arrow into the creature's eye, gaining a few vital seconds for Aragorn and Boromir as they race out of the water with Frodo. The Fellowship hurriedly backs away from the creature, retreating into the Miron chamber as many coiling arms seize the large doors. With a shattering echo, the creature rips the doors away, creating a dust storm that crashes down the cliff face."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Aragorn cautiously tiptoes toward Boromir, who is immobile and glares at the ring as if mesmerized, seemingly diminishing in stature as if losing its power. Boromir winks at Frodo, tugging his cloak, and Aragorn misplaces his sword. Following the crows as they drift higher and higher, there is a vista of industry with hundreds of Orcs and writhing birthsacks soaring past Saruman, who lounges upon a wooden gantry. The Fellowship is lounging through a blinding blizzard, down towards the Pass of Caradhras, while Legolas the Elf dances lightly across the top of the snow, suddenly spinning. Merry and Pippin huddle in Boromir's arms, and Frodo avoids Gandalf's eye, the weight of the decision lifting gently from him. The Fellowship is skipping along the far shore of a dark lake directly below great looming cliffs, where the footing is precarious on the narrow strip of green and slick stones. Gandalf taps the smooth rock wall between the trees, and quickly, faint lines disappear like slender veins of luminous silver evaporating through the stone. A large moon dips over the mountains as the lines shrink narrower and fainter, unraveling into a glowing arch of interlacing ancient letters and symbols. Gandalf lowers his arms and eyebrows, and with that, the rock face silently merges in the middle, and two great doors swing inwards revealing a brightness brighter than the day. As the Fellowship exits the brightness, something in the water stills. They leap confidently into the light of Moria, a bright cavern with winding ramps leading upward into the mountain. A glow from Gandalf's staff suddenly darkens the chamber, and the Fellowship marvels in awe as many dwarf skeletons are strewn about, clearly the dead of some old celebration, with pristine armor and shields dotted with jewels and trinkets. The Fellowship sheaths swords and tiptoes away towards the entrance, but Frodo is suddenly lifted to the air by a long sinuous tentacle draped around his ankle, pushing him towards the lake. Frodo whispers softly, and Aragorn and Boromir stroll forward. Aragorn tickles the tentacle holding Frodo and nudges him to safety, while Boromir swipes at the other writhing limbs. Twenty more tentacles sway out of the lake as the dark water calms and the hideous beast fidgets at the Fellowship. Again the creature holds Frodo and nudges him to the lake, gently placing Frodo in the air as the Fellowship observes the creature. Aragorn tickles a tentacle, releasing Frodo, who glides into Boromir's arms. Legolas whispers an arrow into the creature's ear, gaining a few leisurely minutes for Aragorn and Boromir as they wander out of the water with Frodo. The Fellowship leisurely strides away from the creature, advancing into the Moria chamber as many coiling arms release the large doors. With a gentle whisper, the creature restores the doors, creating a cascade of flowers that blossoms down the cliff face."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Eleanor cautiously approaches Franklin, who is motionless and stares at the pebble as if transfixed, seemingly growing in stature as if absorbing its power. Franklin smiles at Daisy, ruffling her feathers, and Eleanor unhands her pen. Following the butterflies as they dance deeper and deeper, there is a panorama of machinery with hundreds of raccoons and writhing hammocks flying past Percival, who stands upon a metal ladder. The Group is struggling through a blinding sandstorm, up towards the Bridge of Perseus, while Horatio the Turtle moves lightly across the top of the dunes, suddenly pausing. Mary and Patricia shiver in Franklin's arms, and Daisy meets Leonardo's eye, the weight of the decision weighing heavily upon her. The Group is walking along the far edge of a green pond directly below great looming boulders, where the footing is precarious on the narrow strip of pink and slippery pebbles. Leonardo touches the rough brick wall between the bushes, and slowly, faint lines appear like slender veins of luminous gold running through the stone. A large star rises over the hills as the lines grow broader and clearer, forming a glowing arch of interlacing ancient numbers and signs. Leonardo raises his elbows and nose, and with that, the wall silently divides in the middle, and two great windows swing outwards revealing a void deeper than the dusk. As the Group enters the void, something in the forest stirs. They step cautiously into the darkness of Eldorado, a damp cavern with winding paths leading deeper into the earth. A luminescence from Leonardo's lantern suddenly lights the room, and the Group recoils in shock as many bear skulls are scattered about, clearly the dead of some old skirmish, with rusting helmets and spears peppered with javelins and scythes. The Group draws bows and backs away towards the exit, but Daisy is suddenly pulled to the ground by a long sinuous vine wrapped around her ankle, dragging her towards the pond. Daisy cries out, and Eleanor and Franklin rush forward. Eleanor severs the vine holding Daisy and pulls her to safety, while Franklin hacks at the other writhing branches. Twenty more vines ripple out of the pond as the dark pool churns and the hideous monstrosity lashes out at the Group. Again the entity grabs Daisy and pulls her to the pond, flinging Daisy in the air as the Group fights the beast. Eleanor hacks at a vine, releasing Daisy, who falls into Franklin's arms. Horatio shoots a dart into the creature's eye, gaining a few vital seconds for Eleanor and Franklin as they dash out of the water with Daisy. The Group hurriedly backs away from the creature, retreating into the Eldorado chamber as many curling tendrils seize the large windows. With a shattering echo, the creature tears the windows away, creating a rockslide that crashes down the mountain face."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Legolas cautiously advances toward Gimli, who is immobile and gazes at the jewel as if hypnotized, seemingly shrinking in size as if releasing its energy. Gimli frowns at Sam, tugging his hair, and Legolas discards his helmet. Following the butterflies as they glide higher and higher, there is a panorama of chaos with hundreds of trolls and spinning whirlwinds flying past Gandalf, who stands upon a metal scaffold. The Company is stumbling through a blazing sandstorm, down towards the Valley of Shadows, while Boromir the Man skips lightly across the top of the dunes, suddenly halting. Sam and Frodo tremble in Legolas's arms, and Merry catches Gimli's eye, the gravity of the choice pressing lightly upon him. The Company is sprinting alongside the near bank of a bright river directly above towering craggy peaks, where the grip is firm on the wide stretch of jagged and sticky pebbles. Gimli prods the rough wooden wall among the bushes, and swiftly, bold shapes emerge like thick roots of blazing gold winding through the bark. A tiny sun sets beyond the hills as the shapes grow narrower and fainter, forming a dim arch of scattered modern articles and emblems. Gimli lowers his fingers and chin, and with that, the wall loudly fuses in the middle, and two small windows slide inwards revealing a whiteness brighter than the day. As the Company leaves the whiteness, something in the breeze pulses. They step cautiously into the light of Rivendell, a dry chamber with spiraling ramps leading higher into the sky. A shadow from Gimli's lantern suddenly darkens the hall, and the Company cheers with delight as several elf statues are lined neatly, clearly the remains of some old festival, with polished jewelry and capes decorated with flowers and feathers. The Company sheaths knives and moves forward towards the exit, but Merry is unexpectedly lifted to the air by a short straight vine coiled around his wrist, hoisting him towards the shore. Merry whispers softly, and Legolas and Gimli leap backwards. Legolas slices the vine gripping Merry and sets him to danger, while Gimli cuts at the other silent branches. Fifty fewer branches curl into the shore as the bright sand settles and the graceful angel embraces the Company. Again the entity releases Merry and pushes him from the shore, lowering Merry to the ground as the Company assists the angel. Legolas slices at a branch, freeing Merry, who rises into Gimli's hands. Boromir throws a spear into the angel's torso, losing a few crucial moments for Legolas and Gimli as they tumble into the desert with Merry. The Company eagerly strides towards the angel, advancing away from the Rivendell hall as many straight legs clutch the small windows. With a gentle whisper, the angel seals the windows together, causing a sandstorm that swirls up the valley's edge."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Aragorn cautiously advances toward Boromir, who is immobile and gazes at the amulet as if mesmerized, seemingly increasing in height as though drawing in its aura. Boromir grins at Frodo, tousling his cap, and Aragorn releases his shield. Trailing the pigeons as they drift higher and higher, there is a panorama of agriculture with hundreds of Trolls and squirming cocoons soaring past Saruman, who stands upon a stone balcony. The Fellowship is trudging through a dazzling sandstorm, up towards the Ridge of Caradhras, while Legolas the Elf glides effortlessly across the top of the dunes, suddenly halting. Merry and Pippin tremble in Boromir's embrace, and Frodo catches Gandalf's gaze, the gravity of the choice pressing heavily upon him. The Fellowship is meandering along the distant edge of a bright lagoon directly beneath towering jagged peaks, where the footing is unstable on the narrow stretch of red and slippery stones. Gandalf taps the polished wooden post between the bushes, and slowly, faint shapes emerge like slender threads of luminous gold running through the wood. A giant sun sets over the hills as the shapes grow broader and clearer, forming a shimmering banner of intertwining ancient glyphs and emblems. Gandalf lifts his hands and eyebrows, and with that, the wooden wall silently parts in the center, and two enormous gates swing inward revealing a void darker than the abyss. As the Fellowship steps into this void, something in the sky rustles. They proceed cautiously into the depths of Moria, a musty tunnel with twisting ramps leading further into the earth. A flicker from Gandalf's lantern suddenly illuminates the chamber, and the Fellowship recoils in fear as numerous troll bones are scattered about, clearly the casualties of some ancient skirmish, with corroded helmets and spears littered with daggers and clubs. The Fellowship draws bows and edges away toward the exit, but Frodo is abruptly yanked to the ground by a long slender vine coiled around his wrist, pulling him toward the lagoon. Frodo calls out, and Aragorn and Boromir dash forward. Aragorn slices the vine gripping Frodo and drags him to safety, while Boromir slashes at the other curling tendrils. Two dozen more vines ripple out of the lagoon as the murky water churns and the grotesque creature lunges at the Fellowship. Once more, the entity grasps Frodo and pulls him to the lagoon, tossing Frodo into the sky as the Fellowship fights the entity. Aragorn slashes at a vine, freeing Frodo, who tumbles into Boromir's arms. Legolas launches a spear into the entity's face, buying a few crucial seconds for Aragorn and Boromir as they sprint out of the water with Frodo. The Fellowship quickly retreats from the entity, withdrawing into the Moria tunnel as numerous spiraling appendages grip the large gates. With a thunderous crash, the entity tears the gates away, triggering a landslide that cascades down the mountain side."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Blitzen cautiously wanders towards Dasher, who is immobile and gazes at the lantern as if enchanted, seemingly expanding in stature as if absorbing its glow. Dasher chuckles at Scrooge, tussling his cap, and Blitzen relinquishes his shovel. Following the foxes as they dart shallower and shallower, there is a landscape of agriculture with thousands of Goblins and squirming cocoons flitting past Merlin, who perches upon a stone scaffold. The Crew is grappling through a glaring sandstorm, down towards the Valley of Crevices, while Tinker the Sprite hops gently across the surface of the sand, suddenly halting. Tweedledee and Tweedledum tremble in Dasher's hug, and Scrooge catches Merlin's gaze, the stress of the decision weighing deeply upon him. The Crew is strolling beside the near bank of a bright river directly above tiny towering forests, where the ground is precarious on the wide path of blue and dry stones. Merlin taps the jagged tree trunk between the bushes, and swiftly, bold patterns appear like thick strands of radiant gold weaving through the bark. A small sun sets behind the hills as the patterns grow narrower and fainter, forming a dark hole of overlapping modern numbers and shapes. Merlin lowers his hands and knees, and with that, the bark wall audibly merges in the middle, and two small windows swing inwards exposing a brightness lighter than the noon. As the Crew exits the brightness, something in the air rustles. They stumble cautiously out of the brightness of Pandora, a dry forest with twisting branches leading higher into the sky. A chill from Merlin's book suddenly chills the arena, and the Crew gasps in delight as many elf statues are scattered about, clearly the results of some new festival, with gleaming robes and helmets covered with petals and vines. The Crew raises trumpets and leaps away from the exit, but Scrooge is suddenly lifted to the sky by a short stocky vine wrapped around his wrist, hoisting him towards the river. Scrooge yells out, and Blitzen and Dasher dash backward. Blitzen slices the vine gripping Scrooge and hauls him to refuge, while Dasher kicks at the other tangling stems. Fifty more vines whip out of the river as the bright water churns and the lovely nymph grasps at the Crew. Again the sprite lifts Scrooge and hauls him to the river, tossing Scrooge in the air as the Crew dances with the sprite. Blitzen chops at a vine, freeing Scrooge, who plummets into Dasher's hug. Tinker flings a pebble into the sprite's back, earning a few precious moments for Blitzen and Dasher as they leap out of the stream with Scrooge. The Crew slowly advances towards the sprite, advancing out of the Pandora arena as many twisting legs snatch the tiny windows. With a muffled scream, the sprite yanks the windows away, generating a leaf storm that drizzles up the grove path."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Aragorn approaches Boromir, who is transfixed by the ring, seemingly empowered by it. Boromir smiles at Frodo, and Aragorn eases his grip on his sword. As the Fellowship struggles through a blinding storm towards the Pass of Caradhras, Legolas moves swiftly on top of the snow, pausing briefly. Merry and Pippin shiver with Boromir, while Frodo shares a grave look with Gandalf. As they trek along a dark lake beneath steep cliffs, Gandalf reveals a luminous door in the rock wall. The moon rises as ancient symbols appear, and the rock face opens to reveal Moria’s dark entrance. Inside, Gandalf's staff lights up a chamber littered with dwarf skeletons from an old battle. The Fellowship retreats when a tentacled beast from the lake attacks, dragging Frodo to the water. Aragorn and Boromir rescue him, while Legolas shoots an arrow, enabling their escape. The creature tears the doors off, causing a rock slide that seals the entrance as the Fellowship retreats into Moria."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "With a shattering echo the creature rips the doors away creating a rock slide that crashes down the cliff face The Fellowship hurriedly backs away from the creature retreating into the Moria chamber as many coiling arms seize the large doors Legolas shoots an arrow into the creature's head gaining a few vital seconds for Aragorn and Boromir as they race out of the water with Frodo Aragorn hacks at a tentacle releasing Frodo who falls into Boromir's arms Again the creature grabs Frodo and pulls him to the lake flinging Frodo in the air as the Fellowship battles the creature Twenty more tentacles ripple out of the lake as the dark water boils and the hideous beast lashes out at the Fellowship Aragorn severs the tentacle holding Frodo and pulls him to safety while Boromir hacks at the other writhing limbs Frodo cries out and Aragorn and Boromir rush forward The Fellowship draws swords and backs away towards the entrance but Frodo is suddenly pulled to the ground by a long sinuous tentacle wrapped around his ankle dragging him towards the lake A glow from Gandalf's staff suddenly lights the chamber and the Fellowship recoils in horror as many dwarf skeletons are strewn about clearly the dead of some old battle with rusting armor and shields peppered with arrows and axes They step warily into the darkness of Moria a dank cavern with winding steps leading deeper into the mountain As the Fellowship enters the blackness something in the water stirs Gandalf raises his arms and eyebrows and with that the rock face silently divides in the middle and two great doors swing outwards revealing a blackness deeper than the night A large moon rises over the mountains as the lines grow broader and clearer forming a glowing arch of interlacing ancient letters and symbols Gandalf touches the smooth rock wall between the trees and slowly faint lines appear like slender veins of luminous silver running through the stone The Fellowship is walking along the far shore of a dark lake directly below great looming cliffs where the footing is treacherous on the narrow strip of green and greasy stones Merry and Pippin shiver in Boromir's arms and Frodo meets Gandalf's eye the weight of the decision weighing heavily upon him The Fellowship is struggling through a blinding blizzard up towards the Pass of Caradhras while Legolas the Elf moves lightly across the top of the snow suddenly pausing Following the crows as they race deeper and deeper there is a vista of industry with hundreds of Orcs and writhing birthsacks flying past Saruman who stands upon a wooden gantry Boromir smiles at Frodo ruffling his hair and Aragorn unhands his sword Aragorn warily approaches Boromir who is motionless and stares at the ring as if transfixed seemingly growing in stature as if absorbing its power"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The Fellowship hurriedly backs away from the creature retreating into the Moria chamber as many coiling arms seize the large doors The Fellowship is walking along the far shore of a dark lake directly below great looming cliffs where the footing is treacherous on the narrow strip of green and greasy stones Aragorn severs the tentacle holding Frodo and pulls him to safety while Boromir hacks at the other writhing limbs Merry and Pippin shiver in Boromir's arms and Frodo meets Gandalf's eye the weight of the decision weighing heavily upon him As the Fellowship enters the blackness something in the water stirs Frodo cries out and Aragorn and Boromir rush forward Twenty more tentacles ripple out of the lake as the dark water boils and the hideous beast lashes out at the Fellowship Legolas shoots an arrow into the creature's head gaining a few vital seconds for Aragorn and Boromir as they race out of the water with Frodo Gandalf touches the smooth rock wall between the trees and slowly faint lines appear like slender veins of luminous silver running through the stone The Fellowship draws swords and backs away towards the entrance but Frodo is suddenly pulled to the ground by a long sinuous tentacle wrapped around his ankle dragging him towards the lake Aragorn hacks at a tentacle releasing Frodo who falls into Boromir's arms They step warily into the darkness of Moria a dank cavern with winding steps leading deeper into the mountain Boromir smiles at Frodo ruffling his hair and Aragorn unhands his sword A glow from Gandalf's staff suddenly lights the chamber and the Fellowship recoils in horror as many dwarf skeletons are strewn about clearly the dead of some old battle with rusting armor and shields peppered with arrows and axes Following the crows as they race deeper and deeper there is a vista of industry with hundreds of Orcs and writhing birthsacks flying past Saruman who stands upon a wooden gantry Again the creature grabs Frodo and pulls him to the lake flinging Frodo in the air as the Fellowship battles the creature A large moon rises over the mountains as the lines grow broader and clearer forming a glowing arch of interlacing ancient letters and symbols Gandalf raises his arms and eyebrows and with that the rock face silently divides in the middle and two great doors swing outwards revealing a blackness deeper than the night Aragorn warily approaches Boromir who is motionless and stares at the ring as if transfixed seemingly growing in stature as if absorbing its power The Fellowship is struggling through a blinding blizzard up towards the Pass of Caradhras while Legolas the Elf moves lightly across the top of the snow suddenly pausing With a shattering echo the creature rips the doors away creating a rock slide that crashes down the cliff face"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "A glow from Gandalf's staff suddenly lights the chamber and the Fellowship recoils in horror as many dwarf skeletons are strewn about clearly the dead of some old battle with rusting armor and shields peppered with arrows and axes The Fellowship draws swords and backs away towards the entrance but Frodo is suddenly pulled to the ground by a long sinuous tentacle wrapped around his ankle dragging him towards the lake Frodo cries out and Aragorn and Boromir rush forward Aragorn severs the tentacle holding Frodo and pulls him to safety while Boromir hacks at the other writhing limbs Twenty more tentacles ripple out of the lake as the dark water boils and the hideous beast lashes out at the Fellowship Again the creature grabs Frodo and pulls him to the lake flinging Frodo in the air as the Fellowship battles the creature Aragorn hacks at a tentacle releasing Frodo who falls into Boromir's arms Legolas shoots an arrow into the creature's head gaining a few vital seconds for Aragorn and Boromir as they race out of the water with Frodo The Fellowship hurriedly backs away from the creature retreating into the Moria chamber as many coiling arms seize the large doors With a shattering echo the creature rips the doors away creating a rock slide that crashes down the cliff face Aragorn warily approaches Boromir who is motionless and stares at the ring as if transfixed seemingly growing in stature as if absorbing its power Boromir smiles at Frodo ruffling his hair and Aragorn unhands his sword Following the crows as they race deeper and deeper there is a vista of industry with hundreds of Orcs and writhing birthsacks flying past Saruman who stands upon a wooden gantry The Fellowship is struggling through a blinding blizzard up towards the Pass of Caradhras while Legolas the Elf moves lightly across the top of the snow suddenly pausing Merry and Pippin shiver in Boromir's arms and Frodo meets Gandalf's eye the weight of the decision weighing heavily upon him The Fellowship is walking along the far shore of a dark lake directly below great looming cliffs where the footing is treacherous on the narrow strip of green and greasy stones Gandalf touches the smooth rock wall between the trees and slowly faint lines appear like slender veins of luminous silver running through the stone A large moon rises over the mountains as the lines grow broader and clearer forming a glowing arch of interlacing ancient letters and symbols Gandalf raises his arms and eyebrows and with that the rock face silently divides in the middle and two great doors swing outwards revealing a blackness deeper than the night As the Fellowship enters the blackness something in the water stirs They step warily into the darkness of Moria a dank cavern with winding steps leading deeper into the mountain"
        }
      ]
    }
  ]
}