{
  "ground_truth": "Gandalf, Aragorn, and the Hobbits look horrified as Frodo suddenly coughs and takes a huge breath, opening his shirt to reveal the Mithril Vest. Gandalf leads the fellowship into the huge Dwarrowdelf Chamber, and they hurry towards a distant door as Goblins start scuttling down the pillars behind them like cockroaches. Frodo looks with horror at the overwhelming Goblin army rushing toward them when suddenly a deafening roar fills the air, and a fiery light dances down the hallway. The group backs fearfully away from the approaching beast, melting into the darkness, with the pillars casting eerie shadows. The Goblins freeze as a huge shadow, surrounded by flame, falls across the hall, the ground shakes, and an unearthly sound rumbles. Aragorn hesitates and looks at Gandalf, who glowers at the young Hobbit. Aragorn then leads the fellowship to the top of a dizzying stairway, followed by Gandalf, who leans heavily on his staff. The fellowship races down the stairway, with Aragorn picking up Frodo and leaping across a gaping chasm. At a narrow bridge spanning a bottomless pit, Gandalf yells to the others as Aragorn makes to throw Gimli across the chasm. They race towards the slender bridge of stone, without kerb or rail, at the far end of the hall. The fellowship recklessly hurries over the dizzying bridge, but Gandalf, the last, pauses in the middle of the span and faces the Balrog with his staff in one hand and sword in the other, as Frodo looks back in horror. The Balrog, a massive creature, rises from a chasm as a great 40-foot man-beast with a mane of flames, holding a blade like a stabbing tongue of fire in one hand and a whip of many thongs in the other. Frodo watches as the Balrog puts one foot on the bridge and draws up to full height, wings spreading from wall to wall, while Gandalf is a tiny figure, balanced precariously on the narrow bridge. Gandalf lets go his grip and falls away, following the Balrog into the bottomless abyss as Frodo cries out, and Boromir scoops him up and carries him away. Frodo slowly turns with a look of numb shock on his devastated face as the fellowship marches on. Aragorn scours ahead of the company as they stumble on in the fading light, with the shimmer of a large forest, Lothlórien, seen in the distance. The fellowship runs across a forest floor strewn with yellow flowers, beneath a roof of golden leaves held up by silver pillars, and the trunks of huge, grey trees, as Gimli looks nervously around. The fellowship is suddenly surrounded by armed Elves with deadly arrows aimed at their heads when Haldir, the Elvish captain, steps forward and looks at Gimli with disdain before his eyes lock onto Frodo. Haldir leads the fellowship onto a hilltop where they look with wonderment at the vista spread before them; several miles to the south, a large hill rises out of the woods, upon which rise many mighty mallorn trees taller than any others, and nestled high in the crown of the mallorns is a beautiful city.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Gandalf, Aragorn, and the Hobbits gaze aghast as Frodo abruptly hacks and inhales a vast gulp, unbuttoning his tunic to disclose the Mithril Vest. Gandalf directs the fellowship into the enormous Dwarrowdelf Chamber, and they rush towards a remote portal as Goblins commence scuttling down the columns behind them like cockroaches. Frodo gazes with horror at the overpowering Goblin legion charging toward them when suddenly a thunderous bellow saturates the air, and a blazing light flickers down the corridor. The group retreats fearfully from the looming monstrosity, dissolving into the shadows, with the columns casting spooky silhouettes. The Goblins freeze as a gigantic silhouette, encircled by blaze, descends across the hall, the ground vibrates, and an otherworldly sound rumbles. Aragorn pauses and gazes at Gandalf, who scowls at the young Hobbit. Aragorn then guides the fellowship to the top of a vertiginous staircase, followed by Gandalf, who leans heavily on his rod. The fellowship dashes down the staircase, with Aragorn snatching up Frodo and springing across a yawning gulf. At a narrow footbridge spanning a bottomless chasm, Gandalf shouts to the others as Aragorn makes to hurl Gimli across the gulf. They rush towards the slender stone footbridge, without kerb or rail, at the far extremity of the hall. The fellowship heedlessly hurries over the dizzying footbridge, but Gandalf, the last, halts in the center of the span and confronts the Balrog with his rod in one hand and sword in the other, as Frodo glances back in horror. The Balrog, a colossal entity, ascends from a chasm as a great 40-foot man-beast with a mane of flames, clutching a blade like a stabbing tongue of fire in one hand and a scourge of many thongs in the other. Frodo observes as the Balrog places one foot on the footbridge and draws up to full stature, wings unfurling from wall to wall, while Gandalf is a diminutive figure, balanced precariously on the narrow footbridge. Gandalf relinquishes his clutch and falls away, trailing the Balrog into the bottomless chasm as Frodo cries out, and Boromir scoops him up and carries him away. Frodo slowly turns with a look of numb shock on his devastated visage as the fellowship strides on. Aragorn scours ahead of the company as they stagger on in the waning light, with the shimmer of a large woodland, Lothlórien, visible in the distance. The fellowship rushes across a woodland floor strewn with yellow blooms, beneath a canopy of golden foliage supported by silver columns, and the trunks of enormous, grey trees, as Gimli gazes anxiously around. The fellowship is suddenly encircled by armed Elves with lethal arrows trained at their heads when Haldir, the Elvish commander, steps forward and gazes at Gimli with contempt before his eyes lock onto Frodo. Haldir guides the fellowship onto a hilltop where they gaze with wonderment at the panorama spread before them; several miles to the south, a large hill rises out of the woods, upon which rise many mighty mallorn trees taller than any others, and nestled high in the crown of the mallorns is a beautiful city."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Gandalf, Aragorn, and the Hobbits are looked at with horror as Frodo is heard to suddenly cough and a huge breath is taken by him, with his shirt being opened to reveal the Mithril Vest. The fellowship is led by Gandalf into the huge Dwarrowdelf Chamber, and a distant door is hurried toward as the pillars behind them are started to be scuttled down by Goblins like cockroaches. A look of horror is given by Frodo to the overwhelming Goblin army rushing toward them when suddenly the air is filled by a deafening roar, and the hallway is danced down by a fiery light. The group fearfully backs away from the approaching beast, with the darkness being melted into, and eerie shadows being cast by the pillars. The Goblins freeze, a huge shadow falls across the hall surrounded by flame, the ground is shaken, and an unearthly sound rumbles. Gandalf is looked at by Aragorn, who hesitates, while a glower is given by him to the young Hobbit. The fellowship is then led by Aragorn to the top of a dizzying stairway, followed by a heavily leaning Gandalf on his staff. The stairway is raced down by the fellowship, with Frodo being picked up by Aragorn and a leap being made across a gaping chasm. At a narrow bridge spanning a bottomless pit, the others are yelled to by Gandalf as Gimli is made to be thrown across the chasm by Aragorn. The slender stone bridge is raced towards by them, without kerb or rail, at the far end of the hall. The dizzying bridge is recklessly hurried over by the fellowship, but Gandalf, the last, pauses in the middle of the span and a stance is taken by him against the Balrog with his staff in one hand and sword in the other, as a look of horror is given by Frodo back. The Balrog, a massive creature, rises from a chasm as a great 40-foot man-beast with a mane of flames; a blade like a stabbing tongue of fire is held by him in one hand and a whip of many thongs in the other. The Balrog is watched by Frodo as one foot is put on the bridge and drawing up to full height happens, with wings spreading from wall to wall, while Gandalf is seen as a tiny figure, precariously balanced on the narrow bridge. His grip is let go by Gandalf, and he falls away, following the Balrog into the bottomless abyss as Frodo cries out, and Boromir is made to scoop him up and carry him away. As the fellowship marches on, Frodo slowly turns with a look of numb shock on his devastated face. Ahead of the company is scoured by Aragorn as stumbling on in the fading light happens, with a shimmering large forest, Lothlórien, being seen in the distance. The forest floor is run across by the fellowship, strewn with yellow flowers, beneath a roof of golden leaves held up by silver pillars, and the trunks of huge, grey trees, as nervous looks are given by Gimli around. Armed Elves with deadly arrows aimed at their heads surround the fellowship suddenly when Haldir, the Elvish captain, steps forward and disdainfully looks at Gimli before his eyes are locked onto Frodo. The hilltop is led onto by Haldir with the fellowship where wonderment is looked at by them at the vista spread before them; several miles to the south, a large hill rises out of the woods, upon which many mighty mallorn trees rise taller than any others, and a beautiful city is nestled high in the crown of the mallorns."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Gandalf, Aragorn, and the Hobbits are horrified as Frodo coughs and reveals the Mithril Vest. Gandalf leads them into the Dwarrowdelf Chamber, rushing toward a door as Goblins descend like cockroaches. Frodo watches in horror as a Goblin army advances. A deafening roar and fiery light approach, casting eerie shadows. The Goblins freeze as a flame-surrounded shadow fills the hall, shaking the ground. Aragorn hesitates, glancing at Gandalf, then leads the group up a dizzying stairway, followed by Gandalf leaning on his staff. They race down, Aragorn carrying Frodo across a chasm. At a narrow bridge, Gandalf shouts as Aragorn prepares to toss Gimli. They hurry over the bridge; Gandalf, last, pauses to confront the Balrog with his staff and sword as Frodo watches in horror. The Balrog, a massive flame-maned creature, emerges, wielding a fiery blade and whip. Frodo sees it step onto the bridge, towering with spread wings, while Gandalf stands tiny and precarious. Gandalf falls into the abyss with the Balrog, as Frodo cries out. Boromir carries Frodo away, his face numb with shock as the fellowship continues. Aragorn scouts ahead as they stumble toward Lothlórien, a shimmering forest. They dash across a flower-strewn forest floor beneath golden leaves, Gimli looking nervous. Armed Elves suddenly surround them; Haldir, the Elvish captain, steps forward, disdainful of Gimli, then focuses on Frodo. Haldir leads them to a hilltop, revealing a vista with tall mallorn trees and a city nestled high in the crowns."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Gandalf, Aragorn, and the Hobbits are horrified as Frodo coughs and reveals the Mithril Vest. Gandalf leads the fellowship into Dwarrowdelf Chamber, rushing to a door as Goblins swarm like cockroaches. A deafening roar fills the air, and a fiery light approaches, forcing the group back into the dark, with eerie shadows. The Goblins freeze as a fiery shadow falls and the ground shakes. Aragorn hesitates, then leads them up a dizzying stairway. The fellowship races down, Aragorn leaping a chasm with Frodo. At a bridge, Gandalf yells instructions as Aragorn throws Gimli across. They cross the bridge, but Gandalf pauses, confronting the Balrog with staff and sword as Frodo watches. The Balrog, a massive man-beast with flaming mane, steps onto the bridge. Gandalf falls into the abyss with the Balrog, as Frodo cries out and Boromir carries him away. Frodo turns in shock as the fellowship continues. Aragorn leads them toward Lothlórien, where they run beneath golden leaves and huge trees. Surrounded by Elves with arrows, Haldir steps forward, disdainfully looking at Gimli before focusing on Frodo. Haldir leads them to a hilltop, revealing a vista with a city high in mighty mallorn trees."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Gandalf, Aragorn, and the Hobbits, with a shared expression of sheer horror etched on their faces, watch as Frodo unexpectedly begins to cough violently and then takes an enormous breath, revealing his Mithril Vest by opening his shirt. Without delay, Gandalf takes the lead and guides the entire fellowship into the vast expanse of the magnificent Dwarrowdelf Chamber. They move urgently, making their way at a brisk pace toward a distant door. Behind them, the ominous sound of Goblins echoes as they begin to scuttle down the towering pillars, reminiscent of swarming cockroaches. Frodo's gaze is filled with horror as he observes the seemingly endless Goblin army rushing toward them. Then, without warning, a thunderous roar reverberates through the air, and a fiery glow dances ominously down the hallway. The group instinctively retreats in fear from the fearsome beast that is rapidly approaching, blending seamlessly into the shadows, with the grand pillars casting eerie and unsettling shadows on the walls. The Goblins come to an abrupt halt as an immense shadow, wreathed in flames, casts its form across the hall, causing the ground to tremble, accompanied by an unearthly sound that rumbles ominously. Aragorn pauses momentarily, casting a glance toward Gandalf, who glowers intently at the young Hobbit. Taking initiative, Aragorn leads the fellowship to the top of a perilous, dizzying stairway. Gandalf follows close behind, leaning heavily on his staff for support. The fellowship races with urgency down the stairway, and Aragorn, acting quickly, picks up Frodo and makes a daring leap across a yawning chasm. When they reach a narrow bridge that spans a seemingly bottomless pit, Gandalf shouts instructions to the others. At the same time, Aragorn gets ready to hurl Gimli across the chasm. The fellowship moves swiftly toward the slender stone bridge, which lacks both kerb and rail, situated at the far end of the hall. In a reckless hurry, they cross the dizzying bridge, but Gandalf, being the last, stops in the middle of the span. He stands his ground and bravely faces the Balrog with his staff firmly gripped in one hand and a sword in the other, while Frodo, full of dread, looks back in horror. The Balrog, an enormous creature, emerges from a deep chasm as a towering 40-foot man-beast, crowned with a mane of blazing flames. It wields a blade resembling a stabbing tongue of fire in one hand and a whip composed of many thongs in the other. Frodo watches in growing terror as the Balrog takes one colossal step onto the bridge and rises to its full intimidating height, its wings unfurling, spanning wall to wall. Meanwhile, Gandalf appears as a tiny figure, delicately balanced on the narrow bridge. As he releases his grip, he plummets away, following the Balrog into the seemingly endless abyss below, while Frodo cries out in anguish. Boromir quickly scoops up Frodo and carries him away to safety. Frodo turns gradually, his face reflecting a look of numb shock and devastation, as the fellowship continues their march forward. Aragorn takes the lead, scouting ahead of the company as they stumble onward in the dim, fading light. In the distance, the shimmer of a large forest, known as Lothlórien, becomes visible. The fellowship runs across a forest floor liberally scattered with vibrant yellow flowers, beneath a canopy of golden leaves supported by elegant silver pillars, and the trunks of massive, grey trees. As they proceed, Gimli nervously glances around. Suddenly, the fellowship finds themselves completely surrounded by armed Elves, their deadly arrows trained threateningly on their heads. It is at this moment that Haldir, the Elvish captain, steps forward with an air of authority, casting a look of disdain at Gimli before his eyes settle firmly on Frodo. Haldir then leads the fellowship onto a picturesque hilltop, where they gaze in awe at the breathtaking vista that unfolds before them. Several miles to the south, a prominent hill rises majestically out of the woods, supporting many mighty mallorn trees that tower higher than any others in sight. Nestled high in the crown of the mallorns is a stunningly beautiful city, hidden among the treetops."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Gandalf, Aragorn, and the Hobbits stand together as a united group, their faces bearing expressions of sheer, unrestrained horror. They watch with a mixture of disbelief and concern as Frodo begins to cough violently and unexpectedly, then takes an enormous, lung-filling breath. This action reveals the shining Mithril Vest hidden beneath his shirt, which he opens to disclose his protective armor. Without any hesitation, Gandalf swiftly assumes leadership and takes charge, guiding the entire fellowship without delay into the vast expanse of the magnificent Dwarrowdelf Chamber. They move with urgent determination, making their way at a brisk, rapid pace toward a distant door. Behind them, the ominous sound of Goblins can be heard echoing as they begin to scuttle down the towering pillars, reminiscent of swarming cockroaches in their relentless movement. Frodo's eyes are wide with horror as he observes the seemingly endless Goblin army rushing forward with alarming speed. Then, without any warning, a thunderous and powerful roar reverberates through the air, and a fiery glow dances ominously down the hallway. The group instinctively retreats in fear from the fearsome, terrifying beast that is rapidly approaching, blending seamlessly into the enveloping shadows, with the grand pillars casting eerie and unsettling shadows on the ancient walls. The Goblins come to an abrupt and sudden halt as an immense shadow, wreathed in flames, casts its intimidating form across the hall. The ground trembles beneath their feet, accompanied by an unearthly sound that rumbles ominously, shaking the very foundation of the chamber. Aragorn pauses momentarily, casting a quick glance toward Gandalf, who glowers intently at the young Hobbit. Taking swift initiative, Aragorn leads the fellowship to the top of a perilous and dizzying stairway that drops sharply downward. Gandalf follows close behind, leaning heavily on his trusty staff for support and balance. The fellowship races with urgency and determination down the steep stairway, and Aragorn, acting quickly and with great agility, picks up Frodo and makes a daring leap across a yawning chasm. When they finally reach a narrow bridge that spans a seemingly bottomless pit, Gandalf shouts clear instructions to the others. Meanwhile, Aragorn prepares himself to hurl Gimli across the daunting chasm. The members of the fellowship move swiftly and with great precision toward the slender stone bridge, which lacks both kerb and rail, situated strategically at the far end of the grand hall. In a reckless hurry, they cross the dizzying bridge, but Gandalf, being the last, stops resolutely in the middle of the span. He stands his ground, facing the Balrog bravely, with his staff firmly gripped in one hand and a sword held ready in the other, while Frodo, filled with dread, looks back in horror. The Balrog, an enormous and fearsome creature, emerges from a deep chasm as a towering 40-foot man-beast, crowned with a mane of blazing flames that dance wildly around its head. It wields a blade resembling a stabbing tongue of fire in one hand and a whip composed of many thongs in the other. Frodo watches in growing terror as the Balrog takes one colossal step onto the narrow bridge and rises to its full intimidating height, its wings unfurling dramatically and spanning wall to wall. Meanwhile, Gandalf appears as a tiny figure, delicately balanced on the precarious bridge. As he releases his grip, he begins to plummet away, following the Balrog into the seemingly endless abyss below, while Frodo cries out in anguish and despair. Boromir quickly reacts by scooping up Frodo and carrying him away to safety. Frodo turns gradually, his face reflecting a look of numb shock and devastation, as the fellowship continues their determined march forward. Aragorn takes the lead, scouting ahead of the company as they stumble onward in the dim, fading light. In the distance, the shimmer of a large, enchanting forest, known as Lothlórien, becomes visible. The fellowship runs across a forest floor liberally scattered with vibrant yellow flowers, beneath a canopy of golden leaves supported by elegant silver pillars, and the trunks of massive, ancient grey trees. As they proceed cautiously, Gimli nervously glances around, sensing the presence of others. Suddenly, the fellowship finds themselves completely surrounded by armed Elves, their deadly arrows trained threateningly on their heads. It is at this critical moment that Haldir, the Elvish captain, steps forward with an air of authority and command, casting a look of disdain at Gimli before his eyes settle firmly on Frodo. Haldir then leads the fellowship onto a picturesque hilltop, where they gaze in awe at the breathtaking vista that unfolds before them. Several miles to the south, a prominent hill rises majestically out of the dense woods, supporting many mighty mallorn trees that tower higher than any others in sight. Nestled high in the crown of the mallorns is a stunningly beautiful city, hidden among the treetops, a sight to behold."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Gandalf, Aragorn, and the Hobbits stand united, their faces etched with horror as Frodo suddenly experiences a sharp cough; startled, he takes a massive breath while his fingers fumble to unbutton his shirt, exposing the protective Mithril Vest beneath. Catching a collective breath, the group is rallied by Gandalf, who decisively leads the fellowship into the vast expanse of the Dwarrowdelf Chamber. They move with urgency across the immense hall, their feet pounding the stone floor, as their path converges on a distant door. Behind them, the sound of scuttling begins, and they turn to see Goblins descending the towering pillars with insect-like agility. Frodo's eyes widen in terror at the sight of the swarming Goblin army, the fear overtaking him just as a deafening roar echoes throughout the chamber. A fiery glow dances ominously down the corridor, prompting the group to recoil in fear, their bodies instinctively seeking the cover of shadows cast by the towering pillars. The Goblins, too, are momentarily arrested in their advance, frozen as an immense shadow, wreathed in flames, casts its presence across the hall. The very ground beneath them trembles, accompanied by a deep, otherworldly rumble. Aragorn halts, his gaze shifting to Gandalf, who returns the look with a stern glint, silently communicating a command to proceed. With resolve, Aragorn takes the lead, guiding the fellowship up the daunting steps of a vertiginous stairway. Gandalf follows close behind, each step supported by the firm hand on his staff. As urgency propels the fellowship, they race down the perilous stairway, Aragorn swiftly hoisting Frodo and leaping over a yawning chasm that could swallow them whole. They arrive breathless at a narrow bridge that spans a seemingly bottomless pit, where Gandalf urgently voices directives as Aragorn prepares to launch Gimli across the gap. With heightened pace, they surge toward the slender stone bridge, devoid of safety rails, stretching across the far end of the hall. The fellowship charges recklessly over the dizzying bridge, yet Gandalf, trailing the group, halts mid-span. Steeling himself, he confronts the advancing Balrog, clutching his staff and gripping his sword, steadfast in his stance. Behind, Frodo turns back, his heart gripped by horror. As the Balrog emerges, the colossal beast takes form, a towering entity cloaked in fiery mane, brandishing a sword and a whip. Frodo's gaze remains fixed on the Balrog's menacing advance, noting its massive foot as it steps onto the bridge, its full height and vast wingspan dominating the narrow passage. Diminutive against this menace, Gandalf stands resolutely, balanced on the slender bridge until, with a purposeful release, he relinquishes his hold and plunges into the abyss, following the Balrog into the void. Frodo's cry pierces the air as Boromir swiftly gathers him up, bearing him away even as Frodo processes the numbing shock marked on his face. The fellowship presses onward, with Aragorn scouting ahead as they tread wearily through the encroaching twilight. Their path leads them toward the shimmering promise of Lothlórien in the distance. The fellowship sprints across a forest floor carpeted with golden flowers, beneath a canopy of golden leaves supported by the majestic silver trunks of ancient trees. Amidst this enchanted setting, Gimli's eyes dart nervously. Suddenly, they're encircled by Elves, their arrows poised lethally at their heads. It is then that Haldir, the Elvish captain, steps forth, his expression tinged with disdain as his gaze briefly rests on Gimli before he turns his attention to Frodo. With an air of command, Haldir guides the fellowship to a hilltop, where they are met with a stunning vista; miles to the south, a grand hill emerges from the woods, crowned by the immense majesty of mallorn trees, taller than any others, atop which a beautiful city nestles within the embrace of the mallorns' high canopy."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Gandalf, Aragorn, and the Hobbits react with horror as Frodo reveals the Mithril Vest beneath his shirt after a sudden cough. Leading the fellowship into the vast Dwarrowdelf Chamber, Gandalf guides them toward a distant door while Goblins swarm down the pillars behind them. As Frodo observes the advancing Goblin army, a deafening roar and fiery light announce a beast's approach, causing the group to retreat into the shadows. The Goblins halt as a massive, fiery shadow descends across the hall, shaking the ground. After a moment's hesitation and a glance at Gandalf, Aragorn ushers the group to a dizzying stairway, with Gandalf leaning on his staff. Racing down, Aragorn carries Frodo over a chasm. At a narrow bridge over a bottomless pit, Gandalf urges the fellowship onward as the Balrog, a towering flame-wreathed creature, emerges from the depths. As the others race across the bridge, Gandalf confronts the Balrog alone, standing firm with his staff and sword. The Balrog steps onto the bridge, spreading its wings from wall to wall, while Gandalf appears minute in its shadow. Ultimately, Gandalf releases his grip and falls into the abyss with the Balrog, leaving Frodo devastated. Boromir carries Frodo away as the fellowship continues forward, with Aragorn leading them toward the distant shimmer of Lothlórien. They move swiftly across a forest floor beneath golden leaves supported by silver pillars, while Gimli warily scans their surroundings. Suddenly surrounded by armed Elves with arrows drawn, they meet Haldir, the Elvish captain, who regards Gimli with disdain before focusing on Frodo. Haldir guides them to a hilltop, where they marvel at the vista of a large hill rising from the woods, crowned by towering mallorn trees and a beautiful city nestled among them."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Gandalf, the wise and powerful wizard known in Middle-earth for his pivotal role in the fight against dark forces, Aragorn, the heir to the throne of Gondor and a skilled leader known for his bravery, and the Hobbits from the Shire, a peaceful region known for its rolling hills and hearty folk, look horrified as Frodo, the ring-bearer burdened with the One Ring, suddenly coughs and takes a huge breath, opening his shirt to reveal the Mithril Vest, a treasured protective garment made from a rare metal mined by the Dwarves. Gandalf leads the fellowship into the huge Dwarrowdelf Chamber, an ancient and majestic hall built by the Dwarves in the mines of Moria, and they hurry towards a distant door as Goblins start scuttling down the pillars behind them like cockroaches, these creatures are notorious for their malice and overwhelming numbers. Frodo looks with horror at the overwhelming Goblin army rushing toward them when suddenly a deafening roar fills the air, and a fiery light, heralding danger, dances down the hallway. The group backs fearfully away from the approaching beast, melting into the darkness, with the pillars casting eerie shadows. The Goblins freeze as a huge shadow, surrounded by flame, falls across the hall, a sign of the approaching Balrog, the ground shakes, and an unearthly sound rumbles. Aragorn hesitates and looks at Gandalf, who glowers at the young Hobbit. Aragorn then leads the fellowship to the top of a dizzying stairway, the architecture of Moria designed to dizzy and disorient. They are followed by Gandalf, who leans heavily on his staff, a symbol of his power and authority. The fellowship races down the stairway, with Aragorn picking up Frodo and leaping across a gaping chasm, a perilous feat showing Aragorn's strength and agility. At a narrow bridge spanning a bottomless pit, Gandalf yells to the others as Aragorn makes to throw Gimli, the stout and brave Dwarf warrior, across the chasm. They race towards the slender bridge of stone, without kerb or rail, at the far end of the hall. The fellowship recklessly hurries over the dizzying bridge, but Gandalf, the last, pauses in the middle of the span and faces the Balrog, a demon of the ancient world, with his staff in one hand and sword in the other, as Frodo looks back in horror. The Balrog, a massive creature of shadow and flame, rises from a chasm as a great 40-foot man-beast with a mane of flames, holding a blade like a stabbing tongue of fire in one hand and a whip of many thongs in the other. Frodo watches as the Balrog puts one foot on the bridge and draws up to full height, wings spreading from wall to wall, while Gandalf is a tiny figure, balanced precariously on the narrow bridge. Gandalf lets go his grip and falls away, following the Balrog into the bottomless abyss as Frodo cries out, and Boromir, the valiant warrior from Gondor, scoops him up and carries him away. Frodo slowly turns with a look of numb shock on his devastated face as the fellowship marches on, feeling the loss of their guide and protector. Aragorn scours ahead of the company as they stumble on in the fading light, with the shimmer of a large forest, Lothlórien, seen in the distance, a mystical and enchanted realm of the Elves. The fellowship runs across a forest floor strewn with yellow flowers, beneath a roof of golden leaves held up by silver pillars, and the trunks of huge, grey trees, as Gimli looks nervously around, wary of Elves. The fellowship is suddenly surrounded by armed Elves with deadly arrows aimed at their heads when Haldir, the Elvish captain known for his vigilance, steps forward and looks at Gimli with disdain before his eyes lock onto Frodo. Haldir leads the fellowship onto a hilltop where they look with wonderment at the vista spread before them; several miles to the south, a large hill rises out of the woods, upon which rise many mighty mallorn trees taller than any others, and nestled high in the crown of the mallorns is a beautiful city, the heart of Elven culture and wisdom."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Aragorn scours ahead of the company as they stumble on in the fading light with the shimmer of a large forest Lothlórien seen in the distance They race towards the slender bridge of stone without kerb or rail at the far end of the hall Gandalf Aragorn and the Hobbits look horrified as Frodo suddenly coughs and takes a huge breath opening his shirt to reveal the Mithril Vest The Goblins freeze as a huge shadow surrounded by flame falls across the hall Aragorn then leads the fellowship to the top of a dizzying stairway followed by Gandalf who leans heavily on his staff Gandalf leads the fellowship into the huge Dwarrowdelf Chamber and they hurry towards a distant door as Goblins start scuttling down the pillars behind them like cockroaches The group backs fearfully away from the approaching beast melting into the darkness with the pillars casting eerie shadows The fellowship recklessly hurries over the dizzying bridge but Gandalf the last pauses in the middle of the span and faces the Balrog with his staff in one hand and sword in the other as Frodo looks back in horror Gandalf leads the fellowship into the huge Dwarrowdelf Chamber and they hurry towards a distant door as Goblins start scuttling down the pillars behind them like cockroaches Frodo looks with horror at the overwhelming Goblin army rushing toward them when suddenly a deafening roar fills the air and a fiery light dances down the hallway The group backs fearfully away from the approaching beast melting into the darkness with the pillars casting eerie shadows The Goblins freeze as a huge shadow surrounded by flame falls across the hall Gandalf let us go his grip and falls away following the Balrog into the bottomless abyss as Frodo cries out and Boromir scoops him up and carries him away the ground shakes and an unearthly sound rumbles Aragorn hesitates and looks at Gandalf who glowers at the young Hobbit Aragorn then leads the fellowship to the top of a dizzying stairway followed by Gandalf who leans heavily on his staff The fellowship races down the stairway with Aragorn picking up Frodo and leaping across a gaping chasm At a narrow bridge spanning a bottomless pit Gandalf yells to the others as Aragorn makes to throw Gimli across the chasm They race towards the slender bridge of stone without kerb or rail at the far end of the hall The fellowship recklessly hurries over the dizzying bridge but Gandalf the last pauses in the middle of the span and faces the Balrog with his staff in one hand and sword in the other as Frodo looks back in horror The fellowship races down the stairway with Aragorn picking up Frodo and leaping across a gaping chasm The Balrog a massive creature rises from a chasm as a great 40foot manbeast with a mane of flames holding a blade like a stabbing tongue of fire in one hand and a whip of many thongs in the other Frodo watches as the Balrog puts one foot on the bridge and draws up to full height wings spreading from wall to wall while Gandalf is a tiny figure balanced precariously on the narrow bridge Gandalf let us go his grip and falls away following the Balrog into the bottomless abyss as Frodo cries out and Boromir scoops him up and carries him away Frodo slowly turns with a look of numb shock on his devastated face as the fellowship marches on Gandalf Aragorn and the Hobbits look horrified as Frodo suddenly coughs and takes a huge breath opening his shirt to reveal the Mithril Vest Haldir leads the fellowship onto a hilltop where they look with wonderment at the vista spread before them several miles to the south Aragorn scours ahead of the company as they stumble on in the fading light with the shimmer of a large forest Lothlórien seen in the distance The fellowship runs across a forest floor strewn with yellow flowers beneath a roof of golden leaves held up by silver pillars and the trunks of huge grey trees as Gimli looks nervously around The fellowship is suddenly surrounded by armed Elves with deadly arrows aimed at their heads when Haldir the Elvish captain steps forward and looks at Gimli with disdain before his eyes lock onto Frodo Haldir leads the fellowship onto a hilltop where they look with wonderment at the vista spread before them several miles to the south a large hill rises out of the woods upon which rise many mighty mallorn trees taller than any others and nestled high in the crown of the mallorns is a beautiful city"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Gandalf Aragorn and the Hobbits look horrified as Frodo suddenly coughs and takes a huge breath opening his shirt to reveal the Mithril Vest. Gandalf leads the fellowship into the huge Dwarrowdelf Chamber and they hurry towards a distant door as Goblins start scuttling down the pillars behind them like cockroaches. Frodo looks with horror at the overwhelming Goblin army rushing toward them when suddenly a deafening roar fills the air and a fiery light dances down the hallway. The group backs fearfully away from the approaching beast melting into the darkness with the pillars casting eerie shadows. The Goblins freeze as a huge shadow surrounded by flame falls across the hall. the ground shakes and an unearthly sound rumbles. Aragorn hesitates and looks at Gandalf who glowers at the young Hobbit. Aragorn then leads the fellowship to the top of a dizzying stairway followed by Gandalf who leans heavily on his staff. The fellowship races down the stairway with Aragorn picking up Frodo and leaping across a gaping chasm. At a narrow bridge spanning a bottomless pit Gandalf yells to the others as Aragorn makes to throw Gimli across the chasm. They race towards the slender bridge of stone without kerb or rail at the far end of the hall. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. The fellowship recklessly hurries over the dizzying bridge but Gandalf the last pauses in the middle of the span and faces the Balrog with his staff in one hand and sword in the other as Frodo looks back in horror. The Balrog a massive creature rises from a chasm as a great 40foot manbeast with a mane of flames holding a blade like a stabbing tongue of fire in one hand and a whip of many thongs in the other. Frodo watches as the Balrog puts one foot on the bridge and draws up to full height wings spreading from wall to wall while Gandalf is a tiny figure balanced precariously on the narrow bridge. Gandalf let us go his grip and falls away following the Balrog into the bottomless abyss as Frodo cries out and Boromir scoops him up and carries him away. Frodo slowly turns with a look of numb shock on his devastated face. as the fellowship marches on. Aragorn scours ahead of the company as they stumble on in the fading light with the shimmer of a large forest Lothlórien seen in the distance. The fellowship runs across a forest floor strewn with yellow flowers beneath a roof of golden leaves held up by silver pillars and the trunks of huge grey trees as Gimli looks nervously around. The fellowship is suddenly surrounded by armed Elves with deadly arrows aimed at their heads when Haldir the Elvish captain steps forward and looks at Gimli with disdain before his eyes lock onto Frodo. Haldir leads the fellowship onto a hilltop where they look with wonderment at the vista spread before them several miles to the south. a large hill rises out of the woods upon which rise many mighty mallorn trees taller than any others and nestled high in the crown of the mallorns is a beautiful city."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Gandalf Aragorn and the Hobbits look horrified as Frodo suddenly coughs and takes a huge breath opening his shirt to reveal the Mithril Vest. Gandalf leads the fellowship into the huge Dwarrowdelf Chamber and they hurry towards a distant door as Goblins start scuttling down the pillars behind them like cockroaches. Frodo looks with horror at the overwhelming Goblin army rushing toward them when suddenly a deafening roar fills the air and a fiery light dances down the hallway. The group backs fearfully away from the approaching beast melting into the darkness with the pillars casting eerie shadows. The Goblins freeze as a huge shadow surrounded by flame falls across the hall. the ground shakes and an unearthly sound rumbles. Aragorn hesitates and looks at Gandalf who glowers at the young Hobbit. Aragorn then leads the fellowship to the top of a dizzying stairway followed by Gandalf who leans heavily on his staff. The fellowship races down the stairway with Aragorn picking up Frodo and leaping across a gaping chasm. At a narrow bridge spanning a bottomless pit Gandalf yells to the others as Aragorn makes to throw Gimli across the chasm. They race towards the slender bridge of stone without kerb or rail at the far end of the hall. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. The fellowship recklessly hurries over the dizzying bridge but Gandalf the last pauses in the middle of the span and faces the Balrog with his staff in one hand and sword in the other as Frodo looks back in horror. The Balrog a massive creature rises from a chasm as a great 40foot manbeast with a mane of flames holding a blade like a stabbing tongue of fire in one hand and a whip of many thongs in the other. Frodo watches as the Balrog puts one foot on the bridge and draws up to full height wings spreading from wall to wall while Gandalf is a tiny figure balanced precariously on the narrow bridge. Gandalf let us go his grip and falls away following the Balrog into the bottomless abyss as Frodo cries out and Boromir scoops him up and carries him away. Frodo slowly turns with a look of numb shock on his devastated face. as the fellowship marches on. Aragorn scours ahead of the company as they stumble on in the fading light with the shimmer of a large forest Lothlórien seen in the distance. The fellowship runs across a forest floor strewn with yellow flowers beneath a roof of golden leaves held up by silver pillars and the trunks of huge grey trees as Gimli looks nervously around. The fellowship is suddenly surrounded by armed Elves with deadly arrows aimed at their heads when Haldir the Elvish captain steps forward and looks at Gimli with disdain before his eyes lock onto Frodo. Haldir leads the fellowship onto a hilltop where they look with wonderment at the vista spread before them several miles to the south. a large hill rises out of the woods upon which rise many mighty mallorn trees taller than any others and nestled high in the crown of the mallorns is a beautiful city."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Gandalf Aragorn and the Hobbits look horrified as Frodo suddenly coughs and takes a huge breath opening his shirt to reveal the Mithril Vest. Gandalf leads the fellowship into the huge Dwarrowdelf Chamber and they hurry towards a distant door as Goblins start scuttling down the pillars behind them like cockroaches. Frodo looks with horror at the overwhelming Goblin army rushing toward them when suddenly a deafening roar fills the air and a fiery light dances down the hallway. The group backs fearfully away from the approaching beast melting into the darkness with the pillars casting eerie shadows. The Goblins freeze as a huge shadow surrounded by flame falls across the hall. the ground shakes and an unearthly sound rumbles. Aragorn scours ahead of the company as they stumble on in the fading light with the shimmer of a large forest Lothlórien seen in the distance. The fellowship runs across a forest floor strewn with yellow flowers beneath a roof of golden leaves held up by silver pillars and the trunks of huge grey trees as Gimli looks nervously around. The fellowship is suddenly surrounded by armed Elves with deadly arrows aimed at their heads when Haldir the Elvish captain steps forward and looks at Gimli with disdain before his eyes lock onto Frodo. Haldir leads the fellowship onto a hilltop where they look with wonderment at the vista spread before them several miles to the south. a large hill rises out of the woods upon which rise many mighty mallorn trees taller than any others and nestled high in the crown of the mallorns is a beautiful city."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Gandalf Aragorn and the Hobbits look horrified as Frodo suddenly coughs and takes a huge breath opening his shirt to reveal the Mithril Vest. Gandalf leads the fellowship into the huge Dwarrowdelf Chamber and they hurry towards a distant door as Goblins start scuttling down the pillars behind them like cockroaches. Frodo looks with horror at the overwhelming Goblin army rushing toward them when suddenly a deafening roar fills the air and a fiery light dances down the hallway. Haldir leads the fellowship onto a hilltop where they look with wonderment at the vista spread before them several miles to the south. a large hill rises out of the woods upon which rise many mighty mallorn trees taller than any others and nestled high in the crown of the mallorns is a beautiful city."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dragon, the vampire, and the unicorns look horrified as the knight suddenly coughs and takes a huge breath, opening his shirt to reveal the Mithril Vest. The dragon leads the fellowship into the huge Dwarrowdelf Chamber, and they hurry towards a distant door as fairies start scuttling down the pillars behind them like cockroaches. The knight looks with horror at the overwhelming fairy army rushing toward them when suddenly a deafening roar fills the air, and a fiery light dances down the hallway. The group backs fearfully away from the approaching beast, melting into the darkness, with the pillars casting eerie shadows. The fairies freeze as a huge shadow, surrounded by flame, falls across the hall, the ground shakes, and an unearthly sound rumbles. The vampire hesitates and looks at the dragon, who glowers at the young unicorn. The vampire then leads the fellowship to the top of a dizzying stairway, followed by the dragon, who leans heavily on his staff. The fellowship races down the stairway, with the vampire picking up the knight and leaping across a gaping chasm. At a narrow bridge spanning a bottomless pit, the dragon yells to the others as the vampire makes to throw the dwarf across the chasm. They race towards the slender bridge of stone, without kerb or rail, at the far end of the hall. The fellowship recklessly hurries over the dizzying bridge, but the dragon, the last, pauses in the middle of the span and faces the hydra with his staff in one hand and sword in the other, as the knight looks back in horror. The hydra, a massive creature, rises from a chasm as a great 40-foot man-beast with a mane of flames, holding a blade like a stabbing tongue of fire in one hand and a whip of many thongs in the other. The knight watches as the hydra puts one foot on the bridge and draws up to full height, wings spreading from wall to wall, while the dragon is a tiny figure, balanced precariously on the narrow bridge. The dragon lets go his grip and falls away, following the hydra into the bottomless abyss as the knight cries out, and the wizard scoops him up and carries him away. The knight slowly turns with a look of numb shock on his devastated face as the fellowship marches on. The vampire scours ahead of the company as they stumble on in the fading light, with the shimmer of a large forest, Lothlórien, seen in the distance. The fellowship runs across a forest floor strewn with yellow flowers, beneath a roof of golden leaves held up by silver pillars, and the trunks of huge, grey trees, as the dwarf looks nervously around. The fellowship is suddenly surrounded by armed fairies with deadly arrows aimed at their heads when the centaur, the Elvish captain, steps forward and looks at the dwarf with disdain before his eyes lock onto the knight. The centaur leads the fellowship onto a hilltop where they look with wonderment at the vista spread before them; several miles to the south, a large hill rises out of the woods, upon which rise many mighty mallorn trees taller than any others, and nestled high in the crown of the mallorns is a beautiful city."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Gandalf, Aragorn, and the Hobbits look horrified as Frodo suddenly coughs and takes a huge breath, opening his shirt to reveal the Silver Tunic. Gandalf leads the fellowship into the massive Elven Palace, and they hurry towards a distant window as Trolls start scuttling down the walls behind them like beetles. Frodo looks with horror at the overwhelming Troll army rushing toward them when suddenly a deafening roar fills the air, and a fiery light dances down the corridor. The group backs fearfully away from the approaching creature, melting into the shadows, with the columns casting eerie silhouettes. The Trolls freeze as a giant silhouette, surrounded by flame, falls across the court, the earth trembles, and an unearthly noise reverberates. Aragorn hesitates and looks at Gandalf, who glowers at the young Hobbit. Aragorn then leads the fellowship to the top of a towering ramp, followed by Gandalf, who leans heavily on his rod. The fellowship races down the ramp, with Aragorn picking up Frodo and leaping across a vast gorge. At a narrow pier spanning a bottomless crevice, Gandalf yells to the others as Aragorn makes to throw Gimli across the gorge. They race towards the slender arch of stone, without edge or barrier, at the far end of the court. The fellowship recklessly hurries over the dizzying arch, but Gandalf, the last, pauses in the middle of the span and faces the Balrog with his rod in one hand and dagger in the other, as Frodo looks back in horror. The Balrog, a massive creature, rises from a crevice as a great 40-foot man-beast with a mane of flames, holding a blade like a stabbing tongue of fire in one hand and a lash of many thongs in the other. Frodo watches as the Balrog puts one foot on the arch and draws up to full height, wings spreading from wall to wall, while Gandalf is a tiny figure, balanced precariously on the narrow arch. Gandalf lets go his grip and falls away, following the Balrog into the bottomless pit as Frodo cries out, and Boromir scoops him up and carries him away. Frodo slowly turns with a look of numb shock on his devastated face as the fellowship marches on. Aragorn scouts ahead of the company as they stumble on in the fading light, with the shimmer of a large hillside, Lothlórien, seen in the distance. The fellowship runs across a meadow strewn with yellow blossoms, beneath a canopy of golden vines held up by silver columns, and the trunks of huge, grey plants, as Gimli looks nervously around. The fellowship is suddenly surrounded by armed Elves with deadly spears aimed at their heads when Haldir, the Elvish commander, steps forward and looks at Gimli with disdain before his eyes lock onto Frodo. Haldir leads the fellowship onto a mountaintop where they look with wonderment at the panorama spread before them; several miles to the south, a large ridge rises out of the fields, upon which rise many mighty pine trees taller than any others, and nestled high in the crown of the pines is a beautiful sanctuary."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Gandalf, Aragorn, and the Hobbits appear amused as Frodo suddenly sneezes and takes a tiny step, unbuttoning his shirt to display the Mithril Vest. Gandalf guides the fellowship into the enormous Dwarrowdelf Chamber, and they stroll towards a nearby door as Goblins begin tap-dancing down the pillars behind them like performers. Frodo glances with indifference at the massive Goblin army meandering toward them when suddenly a gentle melody fills the air, and a soothing light trickles down the hallway. The group drifts calmly away from the approaching beast, blending into the darkness, with the pillars casting playful shadows. The Goblins pause as a small shadow, surrounded by mist, glides across the hall, the ground ripples, and a melodic tune echoes. Aragorn hesitates and glances at Gandalf, who grins at the young Hobbit. Aragorn then escorts the fellowship to the bottom of a serene stairway, followed by Gandalf, who hops lightly on his staff. The fellowship strolls down the stairway, with Aragorn aiding Frodo and tiptoeing across a tiny moat. At a wide bridge spanning a shallow pool, Gandalf whispers to the others as Aragorn prepares to push Gimli across the moat. They saunter towards the wide bridge of grass, without path or mark, at the near end of the hall. The fellowship lazily strolls over the tranquil bridge, but Gandalf, the last, sits in the middle of the span and faces the Balrog with his staff in one hand and a lantern in the other, as Frodo turns back in curiosity. The Balrog, a tiny creature, emerges from a moat as a small 4-foot animal-beast with a tuft of feathers, holding a stick like a waving ribbon of grass in one hand and a leash of many twigs in the other. Frodo watches as the Balrog places one toe on the bridge and crouches to full height, wings folding neatly at its sides, while Gandalf is a vast figure, perched comfortably on the wide bridge. Gandalf releases his grip and drifts upward, shadowing the Balrog into the boundless sky as Frodo smiles, and Boromir lifts him and sets him down. Frodo quickly pivots with a look of calm relief on his peaceful face as the fellowship wanders on. Aragorn glances ahead of the company as they saunter on in the growing light, with the glow of a vast meadow, Lothlórien, glimpsed in the distance. The fellowship meanders across a meadow floor dotted with blue flowers, beneath a roof of silver leaves held up by golden pillars, and the branches of enormous, blue trees, as Gimli glances cautiously around. The fellowship is suddenly surrounded by singing Elves with gentle arrows pointed at their feet when Haldir, the Elvish captain, glides forward and smiles at Gimli with warmth before his eyes focus on Frodo. Haldir escorts the fellowship onto a hilltop where they gaze with astonishment at the landscape spread before them; several miles to the east, a small hill descends into the fields, upon which descend many tiny mallorn shrubs shorter than any others, and nestled low in the ground of the mallorns is a quaint garden."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Mel Gibson, Leonardo DiCaprio, and the Chessboards look horrified as a Raccoon suddenly coughs and takes a huge breath, opening its coat to reveal the Titanium T-Shirt. Mel Gibson leads the orchestra into the huge Kangaroo Pen, and they hurry towards a distant window as Ostriches start scuttling down the ladders behind them like chipmunks. A Raccoon looks with horror at the overwhelming Ostrich parade rushing toward them when suddenly a deafening whistle fills the air, and a fiery glow dances down the hallway. The team backs fearfully away from the approaching statue, melting into the shadows, with the ladders casting eerie silhouettes. The Ostriches freeze as a huge silhouette, surrounded by sparks, falls across the ballroom, the floor shakes, and an unearthly noise rumbles. Leonardo hesitates and looks at Mel Gibson, who glowers at the young Chessboard. Leonardo then leads the orchestra to the top of a dizzying ladder, followed by Mel Gibson, who leans heavily on his umbrella. The orchestra races down the ladder, with Leonardo picking up a Raccoon and leaping across a gaping tunnel. At a narrow overpass spanning a bottomless canyon, Mel Gibson yells to the others as Leonardo makes to throw a Guitar across the tunnel. They race towards the slender overpass of marble, without curb or rail, at the far end of the ballroom. The orchestra recklessly hurries over the dizzying overpass, but Mel Gibson, the last, pauses in the middle of the span and faces the Minotaur with his umbrella in one hand and spatula in the other, as a Raccoon looks back in horror. The Minotaur, a massive creature, rises from a tunnel as a great 40-foot tree-lion with a mane of sparks, holding a spear like a piercing tongue of flame in one hand and a leash of many cords in the other. A Raccoon watches as the Minotaur puts one foot on the overpass and draws up to full height, curtains spreading from wall to wall, while Mel Gibson is a tiny figure, balanced precariously on the narrow overpass. Mel Gibson lets go his grip and falls away, following the Minotaur into the bottomless chasm as a Raccoon cries out, and Beethoven scoops it up and carries it away. A Raccoon slowly turns with a look of numb shock on its devastated face as the orchestra marches on. Leonardo scours ahead of the crew as they stumble on in the fading light, with the shimmer of a large island, Kokomo, seen in the distance. The orchestra runs across an island floor strewn with yellow pebbles, beneath a canopy of golden sheets held up by silver ladders, and the trunks of huge, grey skyscrapers, as a Guitar looks nervously around. The orchestra is suddenly surrounded by armed Dolphins with deadly boomerangs aimed at their noses when Picard, the Dolphin captain, steps forward and looks at a Guitar with disdain before his eyes lock onto a Raccoon. Picard leads the orchestra onto a rooftop where they look with wonderment at the panorama spread before them; several miles to the east, a large skyscraper rises out of the forest, upon which rise many mighty oak trees taller than any others, and nestled high in the crown of the oaks is a beautiful metropolis."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Groot, Luke Skywalker, and the Ewoks appear amazed as Batman suddenly sneezes and takes a deep gulp, removing his jacket to uncover the Vibranium Armor. Groot guides the squad into the vast Elven Hall, and they stroll towards a nearby portal as Stormtroopers begin skittering down the columns behind them like beetles. Batman glances with awe at the oncoming Stormtrooper battalion charging toward them when suddenly a thunderous crash echoes through the air, and a pulsating glow shuffles down the corridor. The team retreats cautiously from the advancing creature, vanishing into the darkness, with the columns casting haunting silhouettes. The Stormtroopers halt as a colossal shadow, surrounded by smoke, looms across the chamber, the ground trembles, and a bizarre noise resonates. Luke hesitates and peers at Groot, who frowns at the young Ewok. Luke then guides the squad to the summit of a twisting ramp, followed by Groot, who leans gently on his canvas. The squad dashes down the ramp, with Luke lifting Batman and bouncing across a wide gap. At a slender causeway spanning an endless void, Groot shouts to the others as Luke attempts to swing Wolverine across the gap. They dash towards the delicate causeway of rock, without edge or rail, at the distant side of the chamber. The squad carelessly sprints over the twisting causeway, but Groot, trailing, hesitates in the center of the path and confronts the Kraken with his canvas in one hand and axe in the other, as Batman gazes back in awe. The Kraken, an enormous entity, emerges from a ravine as a towering 40-foot bird-monster with a corona of mist, clutching a dagger like a slicing tongue of ice in one hand and a net of many strands in the other. Batman observes as the Kraken places one toe on the causeway and rises to its full stature, feathers stretching from wall to wall, while Groot is a small figure, poised delicately on the narrow causeway. Groot releases his hold and plunges away, trailing the Kraken into the endless chasm as Batman shouts out, and Iron Man hoists him up and escorts him away. Batman slowly swivels with a gaze of muted disbelief on his shattered visage as the squad advances. Luke scouts ahead of the party as they wobble on in the dwindling light, with the glitter of an expansive sea, Atlantis, seen in the distance. The squad sprints across a seashore blanketed with red shells, beneath a canopy of azure waves held up by crystal pillars, and the trunks of massive, white reeds, as Wolverine glances anxiously around. The squad is abruptly encircled by armed Merfolk with lethal spears aimed at their chests when Aquaman, the Merman commander, steps forward and peers at Wolverine with contempt before his gaze fixates on Batman. Aquaman guides the squad to a mountain peak where they stare with fascination at the panorama displayed before them; several leagues to the north, a vast island emerges out of the ocean, upon which rise many towering coral formations taller than any others, and nestled high in the crown of the corals is a stunning metropolis."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Gandalf, Aragorn, and the Hobbits look perplexed as Frodo suddenly laughs and takes a small sip of water, opening his jacket to reveal a Velvet Shirt. Gandalf guides the fellowship into the expansive Elven Hall, and they stroll towards a nearby window as Goblins begin hopping down the walls behind them like squirrels. Frodo gazes with confusion at the approaching Goblin crowd advancing toward them when suddenly a soothing melody fills the air, and a gentle glow drifts down the corridor. The group moves cautiously closer to the emerging creature, disappearing into the daylight, with the walls casting playful glimmers. The Goblins pause as a vast silhouette, surrounded by mist, spreads across the corridor, the walls tremble, and an echoing note reverberates. Aragorn pauses and glances at Gandalf, who chuckles at the young Hobbit. Aragorn then guides the fellowship to the bottom of a spiraling ramp, followed by Gandalf, who skips lightly with his cane. The fellowship wanders down the ramp, with Aragorn lifting Frodo and hopping across a narrow crevasse. At a wide bridge spanning a shallow trench, Gandalf whispers to the others as Aragorn decides to carry Gimli across the gap. They stroll towards the sturdy bridge of timber, with rails and rails, at the near side of the corridor. The fellowship cautiously marches over the stable bridge, but Gandalf, the first, stops at the edge of the span and faces the Balrog with his cane in one hand and shield in the other, as Frodo looks back in awe. The Balrog, a towering entity, emerges from a ravine as a vast 40-foot bird-like figure with feathers of shadow, gripping a spear like a piercing branch of flame in one hand and a rope of many braids in the other. Frodo observes as the Balrog steps onto the bridge and rises to full stature, wings folding from end to end, while Gandalf is a diminutive figure, standing firmly on the wide bridge. Gandalf releases his footing and soars upwards, trailing the Balrog into the endless vault as Frodo sighs, and Boromir lifts him gently and moves him aside. Frodo slowly turns with a look of muted surprise on his contemplative face as the fellowship continues on. Aragorn scouts beside the group as they glide on in the dimming shadows, with the outline of a vast ocean, Lothlórien, seen on the horizon. The fellowship trots across a meadow covered with red ferns, beneath a tapestry of emerald vines held up by golden beams, and the branches of tall, black trees, as Gimli peeks nervously around. The fellowship is suddenly encircled by unarmed Elves with soothing songs aimed at their hearts when Haldir, the Elvish captain, steps back and gazes at Gimli with surprise before his eyes rest on Frodo. Haldir guides the fellowship onto a mountain top where they gaze with amazement at the panorama spread before them; several miles to the north, a prominent mountain sits atop the landscape, upon which stand many grand oak trees taller than any others, and nestled low in the roots of the oaks is a mystical village."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Barney, Elmo, and the Smurfs feel confused as Dumbo sneezes and inhales deeply, unzipping his jacket to display the Golden Apron. Barney guides the parade into the enormous Turtledove Hall, and they sprint toward a nearby gate as Crickets begin scrambling up the columns behind them like ants. Dumbo stares with dread at the massive Cricket swarm charging at them when suddenly a thunderous boom echoes around, and a glowing mist twirls down the corridor. The team retreats anxiously from the oncoming dragon, vanishing into the gloom, with the columns casting creepy silhouettes. The Crickets pause as a gigantic silhouette, surrounded by sparks, stretches across the room, the floor vibrates, and an eerie tone echoes. Elmo hesitates and glances at Barney, who frowns at the young Smurf. Elmo then directs the parade to the summit of a towering ladder, followed by Barney, who leans heavily on his umbrella. The parade dashes down the ladder, with Elmo scooping up Dumbo and vaulting over a yawning canyon. At a frail crossing spanning a bottomless gorge, Barney shouts to the others as Elmo prepares to launch Smurfette over the canyon. They sprint toward the thin crossing of granite, without edge or rail, on the opposite side of the room. The parade recklessly dashes over the towering crossing, but Barney, the last, halts in the middle of the pathway and confronts the Kraken with his umbrella in one hand and dagger in the other, as Dumbo glances back in terror. The Kraken, an enormous beast, emerges from a canyon as a colossal 40-foot bird-beast with a crest of flames, wielding a javelin like a fiery serpent in one hand and a tassel of many tails in the other. Dumbo observes as the Kraken places one hoof on the crossing and extends to its full stature, feathers stretching from wall to wall, while Barney is a tiny figure, perched precariously on the thin crossing. Barney releases his hold and descends, trailing the Kraken into the endless pit as Dumbo screams, and Papa Smurf scoops him up and hauls him away. Dumbo gradually pivots with an expression of blank disbelief on his sorrowful face as the parade continues onward. Elmo scouts ahead of the group as they stagger on in the dimming glow, with the shimmer of a vast prairie, Whispering Pines, visible in the distance. The parade sprints across a grassland covered with red blossoms, beneath a ceiling of silver vines supported by golden columns, and the stems of enormous, brown plants, as Smurfette gazes nervously around. The parade is unexpectedly encircled by armed Fairies with lethal spears aimed at their chests when Tinker Bell, the Fairy captain, steps forward and gazes at Smurfette with scorn before her eyes find Dumbo. Tinker Bell leads the parade onto a mountainside where they gaze with amazement at the panorama laid out before them; several miles to the south, a large mountain rises out of the grasslands, upon which stand numerous tall oak trees loftier than any others, and nestled high in the limbs of the oaks is a splendid village."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Gandalf, Aragorn, and the Hobbits are horrified when Frodo reveals his Mithril Vest. The fellowship rushes through the Dwarrowdelf Chamber as Goblins swarm toward them. They are then confronted by a fiery beast, the Balrog, which scares the Goblins away. Aragorn leads the group up a stairway, with Gandalf following, leaning on his staff. At a narrow bridge, Gandalf confronts the Balrog, a massive creature wielding a fiery blade and a whip. Frodo watches in shock as Gandalf falls with the Balrog into an abyss. Boromir carries a devastated Frodo away as the fellowship presses on. They approach Lothlórien's shimmering forest. Surrounded by Elves led by Haldir, the fellowship is taken to a hilltop, where they gaze in awe at the distant city nestled among towering mallorn trees."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "a large hill rises out of the woods upon which rise many mighty mallorn trees taller than any others and nestled high in the crown of the mallorns is a beautiful city Haldir leads the fellowship onto a hilltop where they look with wonderment at the vista spread before them several miles to the south The fellowship is suddenly surrounded by armed Elves with deadly arrows aimed at their heads when Haldir the Elvish captain steps forward and looks at Gimli with disdain before his eyes lock onto Frodo The fellowship runs across a forest floor strewn with yellow flowers beneath a roof of golden leaves held up by silver pillars and the trunks of huge grey trees as Gimli looks nervously around Aragorn scours ahead of the company as they stumble on in the fading light with the shimmer of a large forest Lothlórien seen in the distance as the fellowship marches on Frodo slowly turns with a look of numb shock on his devastated face Gandalf let us go his grip and falls away following the Balrog into the bottomless abyss as Frodo cries out and Boromir scoops him up and carries him away Frodo watches as the Balrog puts one foot on the bridge and draws up to full height wings spreading from wall to wall while Gandalf is a tiny figure balanced precariously on the narrow bridge The Balrog a massive creature rises from a chasm as a great 40foot manbeast with a mane of flames holding a blade like a stabbing tongue of fire in one hand and a whip of many thongs in the other The fellowship recklessly hurries over the dizzying bridge but Gandalf the last pauses in the middle of the span and faces the Balrog with his staff in one hand and sword in the other as Frodo looks back in horror They race towards the slender bridge of stone without kerb or rail at the far end of the hall At a narrow bridge spanning a bottomless pit Gandalf yells to the others as Aragorn makes to throw Gimli across the chasm The fellowship races down the stairway with Aragorn picking up Frodo and leaping across a gaping chasm Aragorn then leads the fellowship to the top of a dizzying stairway followed by Gandalf who leans heavily on his staff Aragorn hesitates and looks at Gandalf who glowers at the young Hobbit the ground shakes and an unearthly sound rumbles The Goblins freeze as a huge shadow surrounded by flame falls across the hall The group backs fearfully away from the approaching beast melting into the darkness with the pillars casting eerie shadows Frodo looks with horror at the overwhelming Goblin army rushing toward them when suddenly a deafening roar fills the air and a fiery light dances down the hallway Gandalf leads the fellowship into the huge Dwarrowdelf Chamber and they hurry towards a distant door as Goblins start scuttling down the pillars behind them like cockroaches Gandalf Aragorn and the Hobbits look horrified as Frodo suddenly coughs and takes a huge breath opening his shirt to reveal the Mithril Vest"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "a large hill rises out of the woods upon which rise many mighty mallorn trees taller than any others and nestled high in the crown of the mallorns is a beautiful city the ground shakes and an unearthly sound rumbles Frodo looks with horror at the overwhelming Goblin army rushing toward them when suddenly a deafening roar fills the air and a fiery light dances down the hallway Frodo slowly turns with a look of numb shock on his devastated face At a narrow bridge spanning a bottomless pit Gandalf yells to the others as Aragorn makes to throw Gimli across the chasm The Balrog a massive creature rises from a chasm as a great 40foot manbeast with a mane of flames holding a blade like a stabbing tongue of fire in one hand and a whip of many thongs in the other as the fellowship marches on The fellowship is suddenly surrounded by armed Elves with deadly arrows aimed at their heads when Haldir the Elvish captain steps forward and looks at Gimli with disdain before his eyes lock onto Frodo Aragorn hesitates and looks at Gandalf who glowers at the young Hobbit Frodo watches as the Balrog puts one foot on the bridge and draws up to full height wings spreading from wall to wall while Gandalf is a tiny figure balanced precariously on the narrow bridge The fellowship runs across a forest floor strewn with yellow flowers beneath a roof of golden leaves held up by silver pillars and the trunks of huge grey trees as Gimli looks nervously around Gandalf let us go his grip and falls away following the Balrog into the bottomless abyss as Frodo cries out and Boromir scoops him up and carries him away They race towards the slender bridge of stone without kerb or rail at the far end of the hall Gandalf leads the fellowship into the huge Dwarrowdelf Chamber and they hurry towards a distant door as Goblins start scuttling down the pillars behind them like cockroaches The fellowship recklessly hurries over the dizzying bridge but Gandalf the last pauses in the middle of the span and faces the Balrog with his staff in one hand and sword in the other as Frodo looks back in horror The Goblins freeze as a huge shadow surrounded by flame falls across the hall Aragorn scours ahead of the company as they stumble on in the fading light with the shimmer of a large forest Lothlórien seen in the distance Aragorn then leads the fellowship to the top of a dizzying stairway followed by Gandalf who leans heavily on his staff The fellowship races down the stairway with Aragorn picking up Frodo and leaping across a gaping chasm Gandalf Aragorn and the Hobbits look horrified as Frodo suddenly coughs and takes a huge breath opening his shirt to reveal the Mithril Vest The group backs fearfully away from the approaching beast melting into the darkness with the pillars casting eerie shadows Haldir leads the fellowship onto a hilltop where they look with wonderment at the vista spread before them several miles to the south"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The fellowship recklessly hurries over the dizzying bridge but Gandalf the last pauses in the middle of the span and faces the Balrog with his staff in one hand and sword in the other as Frodo looks back in horror The Balrog a massive creature rises from a chasm as a great 40foot manbeast with a mane of flames holding a blade like a stabbing tongue of fire in one hand and a whip of many thongs in the other Frodo watches as the Balrog puts one foot on the bridge and draws up to full height wings spreading from wall to wall while Gandalf is a tiny figure balanced precariously on the narrow bridge Gandalf let us go his grip and falls away following the Balrog into the bottomless abyss as Frodo cries out and Boromir scoops him up and carries him away Frodo slowly turns with a look of numb shock on his devastated face as the fellowship marches on Aragorn scours ahead of the company as they stumble on in the fading light with the shimmer of a large forest Lothlórien seen in the distance The fellowship runs across a forest floor strewn with yellow flowers beneath a roof of golden leaves held up by silver pillars and the trunks of huge grey trees as Gimli looks nervously around The fellowship is suddenly surrounded by armed Elves with deadly arrows aimed at their heads when Haldir the Elvish captain steps forward and looks at Gimli with disdain before his eyes lock onto Frodo Haldir leads the fellowship onto a hilltop where they look with wonderment at the vista spread before them several miles to the south a large hill rises out of the woods upon which rise many mighty mallorn trees taller than any others and nestled high in the crown of the mallorns is a beautiful city Gandalf Aragorn and the Hobbits look horrified as Frodo suddenly coughs and takes a huge breath opening his shirt to reveal the Mithril Vest Gandalf leads the fellowship into the huge Dwarrowdelf Chamber and they hurry towards a distant door as Goblins start scuttling down the pillars behind them like cockroaches Frodo looks with horror at the overwhelming Goblin army rushing toward them when suddenly a deafening roar fills the air and a fiery light dances down the hallway The group backs fearfully away from the approaching beast melting into the darkness with the pillars casting eerie shadows The Goblins freeze as a huge shadow surrounded by flame falls across the hall the ground shakes and an unearthly sound rumbles Aragorn hesitates and looks at Gandalf who glowers at the young Hobbit Aragorn then leads the fellowship to the top of a dizzying stairway followed by Gandalf who leans heavily on his staff The fellowship races down the stairway with Aragorn picking up Frodo and leaping across a gaping chasm At a narrow bridge spanning a bottomless pit Gandalf yells to the others as Aragorn makes to throw Gimli across the chasm They race towards the slender bridge of stone without kerb or rail at the far end of the hall"
        }
      ]
    }
  ]
}