{
  "ground_truth": "Lurtz is leading 200 Uruk-hai out of Isengard as they run fast, their powerful legs carrying them at speed. The Fellowship are in small elven boats, and elves quietly watch them depart. They row away from the Lothlorien shore into the Silverlode river, and in his head, Frodo still hears her voice. Galadriel gives Frodo a small Crystal Phial, and as the Fellowship's boats drift past, Galadriel stands alone, watching from the banks of the river. The boats pass into the great river Anduin, and the three elven boats carry the Fellowship steadily southward. Green trees slowly give way to a brown and withered land, while the Uruk forces run through the trees with deadly purpose. Aragorn watches them with concern. The three elven boats drift slowly through the steep rocky gorge in the pre-dawn light, with Aragorn slowly paddling in the stern. Frodo slowly looks up, his eyes widening with amazement. Aragorn is strangely moved by the beauty of the silent sentinels, and he speaks almost as if to himself. Two enormous rock statues, towering like 300-foot pinnacles on either side of the river, are carved images of Gondorian kings of old. They loom over the boats with power and majesty. The Fellowship stare in stunned silence as the current takes them through the narrow gap between the statues' feet, craning up past the statues' vast crumbling heads to reveal a large lake only a mile downriver. As they leap out of the boats and clamber onto the wooded shore, Legolas turns to Aragorn with urgency. Aragorn looks at Legolas, knowing full well what he means, and Legolas casts a glance around into the Parth Galen forest. Sam has slumped asleep, and Merry dumps a small pile of kindling at Gimli's feet. Sam sits up with a start, and Aragorn's head snaps round, his eyes flying to Boromir's shield which lies abandoned by his camp bed as he realizes Boromir has gone. Frodo is walking beneath the trees, lost in thought. Frodo turns slowly and stares at Boromir, tense and cautious. Boromir has started forward towards Frodo, but he pulls himself up. Frodo steps hurriedly away from Boromir and turns to leave. Boromir leaps on top of Frodo, grasping for the ring, and Frodo has only moments to act. Frodo rips the ring from around his neck and rams it on his finger. Frodo races through the misty twilight world, past the foggy shapes of twisted trees, and somewhere behind him, Boromir's distraught voice carries from another dimension. A mountain of iron, immeasurably strong, the tower of adamant: Barad-dur, fortress of Sauron. Frodo suddenly finds himself on the stone steps and clambers up the stairs onto a high seat, perched on four stone pillars. Frodo cowers on the seat, like a lost child upon the throne of mountain kings, as the world of mist swirls around him.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Lurtz is guiding 200 Uruk-hai out of Isengard as they sprint rapidly, their mighty limbs bearing them at pace. The Fellowship are in small elven vessels, and elves silently observe them leave. They paddle away from the Lothlorien bank into the Silverlode stream, and in his mind, Frodo still perceives her voice. Galadriel gives Frodo a small Crystal Phial, and as the Fellowship's vessels glide past, Galadriel stands solitary, observing from the edges of the stream. The vessels proceed into the great stream Anduin, and the three elven vessels bear the Fellowship steadily southward. Verdant trees gradually yield to a brown and shriveled terrain, while the Uruk troops sprint through the trees with dire intent. Aragorn observes them with unease. The three elven vessels glide gradually through the steep stony ravine in the pre-dawn glow, with Aragorn gently rowing in the stern. Frodo slowly gazes upward, his eyes widening with astonishment. Aragorn is oddly stirred by the splendor of the mute guardians, and he speaks almost as if to himself. Two gigantic stone effigies, towering like 300-foot peaks on either side of the stream, are sculpted figures of Gondorian rulers of old. They hover over the vessels with power and grandeur. The Fellowship gaze in amazed silence as the flow takes them through the narrow opening between the effigies' feet, stretching up past the effigies' immense crumbling heads to reveal a large basin merely a mile downstream. As they jump out of the vessels and climb onto the wooded bank, Legolas turns to Aragorn with urgency. Aragorn looks at Legolas, understanding completely what he signifies, and Legolas casts a glance around into the Parth Galen woods. Sam has slumped asleep, and Merry deposits a small stack of kindling at Gimli's feet. Sam sits up with a jolt, and Aragorn's head turns sharply, his eyes darting to Boromir's shield which lies deserted by his camp bed as he realizes Boromir has vanished. Frodo is walking beneath the trees, lost in contemplation. Frodo turns slowly and gazes at Boromir, tense and wary. Boromir has started forward towards Frodo, but he restrains himself. Frodo steps quickly away from Boromir and turns to depart. Boromir leaps on top of Frodo, grasping for the ring, and Frodo has only instants to act. Frodo tears the ring from around his neck and pushes it onto his finger. Frodo dashes through the misty twilight realm, past the foggy forms of gnarled trees, and somewhere behind him, Boromir's desolate voice echoes from another plane. A mountain of iron, immeasurably strong, the spire of adamant: Barad-dur, fortress of Sauron. Frodo suddenly discovers himself on the stone steps and climbs up the stairs onto a high seat, perched on four stone columns. Frodo cowers on the seat, like a lost child upon the throne of mountain rulers, as the realm of mist swirls around him."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "200 Uruk-hai are being led out of Isengard by Lurtz as they are run fast, carried at speed by their powerful legs. The Fellowship is in small elven boats, and they are quietly watched by elves as they depart. The Lothlorien shore is rowed away from by them into the Silverlode river, and in her head, Frodo still hears her voice. Frodo is given a small Crystal Phial by Galadriel, and as the Fellowship's boats are drifted past by the river, Galadriel stands alone, watching from the banks. The great river Anduin is entered by the boats, and the Fellowship is steadily carried southward by the three elven boats. A brown and withered land is slowly revealed by green trees, while the trees are run through by the Uruk forces with deadly purpose. Aragorn watches them with concern. The steep rocky gorge is drifted through slowly by the three elven boats in the pre-dawn light, with Aragorn paddling slowly in the stern. Frodo's eyes are widened with amazement as he looks up slowly. The beauty of the silent sentinels strangely moves Aragorn, and almost as if to himself, he speaks. Carved images of Gondorian kings of old, two enormous rock statues tower like 300-foot pinnacles on either side of the river. The boats are loomed over by them with power and majesty. Stunned silence grips the Fellowship as they are taken through the narrow gap between the statues' feet by the current, craning up past the statues' vast crumbling heads to reveal a large lake only a mile downriver. Legolas leaps out of the boats and clambers onto the wooded shore, turning to Aragorn with urgency. Legolas is looked at by Aragorn, who knows full well what he means, and into the Parth Galen forest, a glance is cast by Legolas. Sam has slumped asleep, and Merry dumps a small pile of kindling at Gimli's feet. A start makes Sam sit up, and Aragorn's head snaps around, his eyes flying to Boromir's shield abandoned by his camp bed as he realizes Boromir has gone. Walking beneath the trees, Frodo is lost in thought. Frodo is turned to slowly by Boromir, tense and cautious. Frodo is approached by Boromir, but he pulls himself up. Frodo hurriedly steps away from Boromir and turns to leave. Frodo is leaped upon by Boromir, who grasps for the ring, and Frodo has only moments to act. The ring is ripped from around his neck by Frodo and is rammed on his finger. Through the misty twilight world, Frodo races, passing the foggy shapes of twisted trees, and Boromir's distraught voice carries from another dimension somewhere behind him. A mountain of iron, immeasurably strong, the tower of adamant: Barad-dur, fortress of Sauron. On the stone steps, Frodo suddenly finds himself and clambers up the stairs onto a high seat, perched on four stone pillars. On the seat, Frodo cowers, like a lost child upon the throne of mountain kings, as the world of mist swirls around him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Lurtz leads 200 Uruk-hai swiftly out of Isengard. The Fellowship departs in small elven boats, observed by silent elves, rowing from Lothlorien into the Silverlode river. Frodo hears Galadriel's voice in his mind as she gives him a Crystal Phial. Galadriel watches alone as the boats enter the Anduin, carrying the Fellowship southward. Green trees turn to barren land while Uruk-hai run with deadly intent. Aragorn watches them, concerned. The boats drift through a rocky gorge at dawn, with Aragorn paddling. Frodo gazes in awe at two towering rock statues of ancient Gondorian kings. The Fellowship passes between them, stunned, revealing a lake downriver. Onshore, Legolas urgently signals Aragorn, who understands. Sam wakes with a start as Merry drops kindling by Gimli. Aragorn notices Boromir's shield abandoned, realizing Boromir is gone. Frodo, deep in thought, encounters Boromir, who approaches but hesitates. Frodo steps back, and Boromir lunges for the ring. Frodo quickly puts it on and escapes into a misty world, hearing Boromir's distant voice. He finds himself at Barad-dur, Sauron's fortress, and climbs stone steps to a high seat, cowering as mist swirls around him."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Lurtz leads 200 Uruk-hai swiftly from Isengard. The Fellowship, in elven boats, row away from Lothlorien into the Silverlode river, with Frodo hearing Galadriel's voice. Galadriel gives Frodo a Crystal Phial and watches the boats drift into the Anduin river, heading south. Green trees turn to barren land as Uruks run purposefully. Aragorn watches with concern as the boats drift through a rocky gorge at dawn. Frodo is amazed by two towering rock statues of Gondorian kings. The Fellowship silently passes between them, revealing a lake downriver. Onshore, Legolas urgently signals Aragorn, who understands. Sam wakes suddenly, and Aragorn notices Boromir's shield abandoned, realizing Boromir is gone. Frodo, lost in thought, encounters Boromir, who approaches but hesitates. Frodo steps away, but Boromir leaps for the ring. Frodo quickly puts it on and races through a misty world, hearing Boromir's voice. He finds himself on stone steps, climbing to a high seat, cowering as mist swirls around him."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Lurtz, the formidable leader of the Uruk-hai, is at the forefront, guiding a formidable force of 200 Uruk-hai warriors as they swiftly emerge from the dark, foreboding depths of Isengard. Their powerful, muscular legs propel them forward with incredible speed and determination. Meanwhile, the Fellowship, a brave and diverse group, are seated in small, elegant elven boats. As they prepare to depart, elves stand silently, observing their departure with quiet solemnity. The Fellowship rows away from the serene Lothlorien shore, entering the gentle flow of the Silverlode river. In Frodo's mind, the ethereal voice of Galadriel still echoes, a haunting reminder of their recent encounter. Galadriel, with a gesture of grace, bestows upon Frodo a small but significant Crystal Phial. As the Fellowship's boats glide past, Galadriel stands alone, a solitary figure watching from the riverbank, her presence both comforting and poignant.\n\nThe boats continue their journey, entering the vast expanse of the great river Anduin. The three elven boats, crafted with skill and care, carry the Fellowship steadily southward. The lush green trees that line the riverbanks gradually give way to a landscape that is brown and withered, a stark contrast to the vibrant greenery they leave behind. Meanwhile, the Uruk forces, driven by a deadly purpose, race through the trees with relentless determination. Aragorn, ever vigilant, watches them with growing concern etched on his face. The three elven boats drift slowly through a steep, rocky gorge, the pre-dawn light casting a soft glow on the scene. Aragorn, positioned in the stern, paddles with a steady rhythm, guiding the boat with care. Frodo, seated in the boat, slowly lifts his gaze, his eyes widening in awe and amazement.\n\nAragorn, deeply moved by the breathtaking beauty of the silent sentinels that stand before them, speaks softly, almost as if he is talking to himself. Two enormous rock statues, towering like majestic 300-foot pinnacles on either side of the river, are carved images of ancient Gondorian kings. These statues loom over the boats with an aura of power and majesty, their presence both awe-inspiring and humbling. The Fellowship stares in stunned silence, their eyes fixed on the towering figures as the current gently carries them through the narrow gap between the statues' feet. They crane their necks upward, past the statues' vast, crumbling heads, to reveal a large, expansive lake only a mile downriver.\n\nAs they reach the shore, the members of the Fellowship leap out of the boats and clamber onto the wooded shore. Legolas, with a sense of urgency, turns to Aragorn. Aragorn meets Legolas's gaze, fully understanding the unspoken message, and Legolas casts a quick glance around into the dense Parth Galen forest. Sam, exhausted, has slumped into a deep sleep, while Merry busies himself by dumping a small pile of kindling at Gimli's feet. Suddenly, Sam sits up with a start, and Aragorn's head snaps around, his eyes immediately drawn to Boromir's shield, which lies abandoned by his camp bed. In that moment, Aragorn realizes with a jolt that Boromir has gone.\n\nFrodo, meanwhile, is walking beneath the trees, lost in his own thoughts. He turns slowly, his eyes locking onto Boromir, his demeanor tense and cautious. Boromir, having started forward towards Frodo, hesitates and pulls himself up short. Frodo, sensing danger, steps hurriedly away from Boromir and turns to leave. In a sudden, desperate move, Boromir leaps on top of Frodo, grasping for the ring with frantic urgency. Frodo, with only moments to act, rips the ring from around his neck and quickly rams it onto his finger. In an instant, Frodo races through the misty twilight world, past the foggy shapes of twisted trees, while somewhere behind him, Boromir's distraught voice echoes from another dimension.\n\nIn this surreal realm, a mountain of iron, immeasurably strong, looms before him: the tower of adamant, Barad-dur, the formidable fortress of Sauron. Frodo suddenly finds himself on the stone steps, clambering up the stairs onto a high seat, perched precariously on four stone pillars. Frodo cowers on the seat, like a lost child upon the throne of mountain kings, as the world of mist swirls around him, enveloping him in its mysterious embrace."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Lurtz, the powerful and commanding leader of the Uruk-hai, stands prominently at the forefront, leading a formidable and imposing force of 200 Uruk-hai warriors. With great speed and determination, these warriors swiftly emerge from the dark and foreboding depths of Isengard. Their powerful and muscular legs propel them forward with an incredible and relentless drive. Meanwhile, the Fellowship, a courageous and diverse group of individuals, are seated in small, elegant boats crafted by the elves. As they prepare to embark on their journey, the elves stand silently by, observing their departure with a quiet and solemn dignity. The Fellowship rows away from the tranquil and serene shores of Lothlorien, entering into the gentle flow of the Silverlode river. In the depths of Frodo's mind, the ethereal and haunting voice of Galadriel continues to echo, serving as a poignant reminder of their recent encounter. Galadriel, with a graceful gesture, bestows upon Frodo a small yet significant Crystal Phial. As the Fellowship's boats glide smoothly past, Galadriel stands alone on the riverbank, a solitary figure whose presence is both comforting and deeply moving.\n\nThe boats continue their journey, entering into the vast and expansive territory of the great river Anduin. The three elven boats, expertly crafted with skill and care, carry the Fellowship steadily southward. The lush, green trees lining the riverbanks gradually give way to a landscape that is brown and withered, presenting a stark and vivid contrast to the vibrant greenery they leave behind. Meanwhile, the Uruk forces, driven by a deadly and singular purpose, race through the trees with relentless determination. Aragorn, ever vigilant and watchful, observes them with growing concern etched clearly on his face. The three elven boats drift slowly through a steep and rocky gorge, the soft, pre-dawn light casting a gentle glow on the scene. Aragorn, positioned in the stern, paddles with a steady and rhythmic motion, guiding the boat with great care. Frodo, seated quietly in the boat, slowly lifts his gaze, his eyes widening in awe and amazement as he takes in the breathtaking surroundings.\n\nAragorn, deeply and profoundly moved by the breathtaking beauty of the silent sentinels that stand before them, speaks softly, almost as if he is talking to himself alone. Two enormous rock statues, towering like majestic 300-foot tall pinnacles on either side of the river, are intricately carved images of ancient Gondorian kings. These statues loom over the boats with an aura of power and majesty, their presence both awe-inspiring and humbling. The Fellowship stares in stunned silence, their eyes fixed on the towering figures as the current gently carries them through the narrow gap between the statues' feet. They crane their necks upward, past the statues' vast, crumbling heads, revealing a large and expansive lake that awaits only a mile downriver.\n\nAs they finally reach the shore, the members of the Fellowship leap out of the boats and clamber onto the wooded shore. Legolas, with a sense of urgency and purpose, turns to Aragorn. Aragorn meets Legolas's gaze, fully understanding the unspoken message that passes between them, and Legolas casts a quick glance around into the dense Parth Galen forest. Sam, exhausted and weary, has slumped into a deep and restful sleep, while Merry busies himself by dumping a small pile of kindling at Gimli's feet. Suddenly, Sam sits up with a start, and Aragorn's head snaps around, his eyes immediately drawn to Boromir's shield, lying abandoned by his camp bed. In that moment of realization, Aragorn feels a jolt as he understands that Boromir has gone.\n\nFrodo, meanwhile, is walking beneath the trees, lost in his own thoughts and reflections. He turns slowly, his eyes locking onto Boromir, his demeanor tense and cautious. Boromir, having started forward towards Frodo, hesitates and pulls himself up short. Frodo, sensing danger, steps hurriedly away from Boromir and turns to leave. In a sudden and desperate move, Boromir leaps on top of Frodo, grasping for the ring with frantic urgency and desperation. Frodo, with only moments to act, rips the ring from around his neck and quickly rams it onto his finger. In an instant, Frodo races through the misty twilight world, passing by the foggy shapes of twisted trees, while somewhere behind him, Boromir's distraught voice echoes from yet another dimension.\n\nIn this surreal realm, a mountain of iron, immeasurably strong and imposing, looms before him: the tower of adamant, Barad-dur, the formidable fortress of Sauron. Frodo suddenly finds himself on the stone steps, clambering up the stairs onto a high seat, precariously perched atop four stone pillars. Frodo cowers on the seat, like a lost and frightened child upon the throne of mountain kings, as the world of mist swirls around him, enveloping him in its mysterious and enigmatic embrace."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Lurtz, with a commanding presence, takes the lead of a formidable group of 200 Uruk-hai, their muscular legs propelling them forward with impressive speed as they depart from Isengard. Meanwhile, the Fellowship, nestled in small, elegant elven boats, are observed by the elves who silently witness their departure. The Fellowship members begin to row away from the tranquil Lothlorien shore, their oars slicing through the water of the Silverlode river, while Frodo, deep in thought, continues to hear Galadriel's voice echoing in his mind. Galadriel, in a moment of quiet significance, presents Frodo with a small Crystal Phial, and as the Fellowship's boats glide past her, she stands alone on the riverbank, her gaze following them. The boats transition into the expansive great river Anduin, carrying the Fellowship steadily southward. As they journey onward, the lush green trees gradually transform into a landscape of brown and withered land, while the Uruk forces, driven by a deadly purpose, weave through the trees. Aragorn, ever vigilant, watches them with growing concern. The three elven boats continue to drift slowly through a steep, rocky gorge, the pre-dawn light casting a serene glow, as Aragorn, positioned in the stern, paddles with measured strokes. Frodo, caught in a moment of wonder, slowly lifts his gaze, his eyes widening in amazement. Aragorn, too, is unexpectedly moved by the majestic beauty of the silent sentinels, and he speaks softly, almost to himself. The towering figures, two enormous rock statues standing like 300-foot pinnacles on either side of the river, are carved images of ancient Gondorian kings, exuding power and majesty as they loom over the boats. The Fellowship, captivated, stare in stunned silence as the current guides them through the narrow gap between the statues' feet, their eyes tracing up past the statues' vast, crumbling heads to reveal a large lake just a mile downriver. Upon reaching the shore, they leap out of the boats and clamber onto the wooded terrain, where Legolas turns to Aragorn with a sense of urgency. Aragorn meets Legolas's gaze, fully understanding the unspoken message, while Legolas casts a watchful glance around the Parth Galen forest. Nearby, Sam has dozed off, only to be startled awake as Merry deposits a small pile of kindling at Gimli's feet. Sam, now alert, sits up with a jolt, and Aragorn's attention is abruptly drawn to Boromir's shield, lying abandoned by his camp bed, as he realizes with a start that Boromir is missing. Meanwhile, Frodo, lost in contemplation, walks beneath the trees, only to turn slowly and find himself staring at Boromir, his demeanor tense and cautious. Boromir, having started to approach Frodo, halts himself, and Frodo, sensing the need for caution, steps hurriedly away, intent on leaving. In a sudden, desperate move, Boromir lunges at Frodo, grasping for the ring, leaving Frodo with only moments to react. With quick reflexes, Frodo tears the ring from around his neck and thrusts it onto his finger, propelling himself into a misty twilight world. He races through this ethereal realm, past the foggy silhouettes of twisted trees, while Boromir's distraught voice echoes from another dimension. In this surreal landscape, Frodo finds himself at the base of a mountain of iron, the indomitable tower of adamant known as Barad-dur, the fortress of Sauron. Suddenly, Frodo is on stone steps, scrambling up to a high seat perched on four stone pillars. There, he cowers on the seat, resembling a lost child upon the throne of mountain kings, as the swirling mist envelops him."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Lurtz leads 200 Uruk-hai swiftly out of Isengard, while the Fellowship departs in elven boats from Lothlorien, with Galadriel's voice lingering in Frodo's mind. Galadriel gifts Frodo a Crystal Phial as she watches the boats drift into the Silverlode river, eventually merging into the great river Anduin, carrying the Fellowship southward. The landscape transitions from green to barren as the Uruk-hai advance with purpose, observed by a concerned Aragorn. The boats glide through a rocky gorge at dawn, where Aragorn, moved by the sight of towering statues of ancient Gondorian kings, paddles in silence. The Fellowship is awestruck as they pass between the statues, revealing a large lake ahead. Upon reaching the wooded shore, Legolas urgently communicates with Aragorn, who understands his concern. As Sam dozes off and Merry gathers kindling, Aragorn notices Boromir's absence, prompting alarm. Frodo, deep in thought, encounters Boromir, who approaches him with intent. Frodo retreats, but Boromir lunges for the ring, forcing Frodo to act quickly. Frodo dons the ring and escapes into a misty, twilight realm, pursued by Boromir's distant cries. He finds himself at Barad-dur, Sauron's fortress, and climbs to a high seat, cowering as the mist swirls around him."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Lurtz, a fierce Uruk-hai commander bred for war by the dark wizard Saruman, is leading 200 Uruk-hai out of Isengard, a fortress and industrial center in Middle-earth, as they run fast, their powerful legs carrying them at speed. The Fellowship are in small elven boats crafted by the skilled elves of Lothlorien, and elves quietly watch them depart with a solemn grace that reflects their ancient wisdom. They row away from the Lothlorien shore into the Silverlode river, which is known for its clear, silvery waters, and in his head, Frodo still hears her voice, the haunting and ethereal voice of Galadriel, the Lady of the Woods. Galadriel gives Frodo a small Crystal Phial containing the light of Earendil's star, a powerful beacon against darkness, and as the Fellowship's boats drift past, Galadriel stands alone, her figure a silhouette of enduring strength and foresight, watching from the banks of the river. The boats pass into the great river Anduin, Middle-earth's longest river, and the three elven boats carry the Fellowship steadily southward. Green trees slowly give way to a brown and withered land, marred by the long shadow of Mordor's influence, while the Uruk forces run through the trees with deadly purpose. Aragorn, a ranger and heir to the throne of Gondor, watches them with concern. The three elven boats drift slowly through the steep rocky gorge in the pre-dawn light, with Aragorn slowly paddling in the stern, guiding them with a steady hand. Frodo slowly looks up, his eyes widening with amazement. Aragorn is strangely moved by the beauty of the silent sentinels, known as the Argonath, and he speaks almost as if to himself. Two enormous rock statues, towering like 300-foot pinnacles on either side of the river, are carved images of Gondorian kings of old, serving as a testament to the lost glory and vigilance of Gondor. They loom over the boats with power and majesty. The Fellowship stare in stunned silence as the current takes them through the narrow gap between the statues' feet, craning up past the statues' vast crumbling heads to reveal a large lake, Nen Hithoel, only a mile downriver. As they leap out of the boats and clamber onto the wooded shore, Legolas, an elven prince with keen senses, turns to Aragorn with urgency. Aragorn looks at Legolas, knowing full well what he means, and Legolas casts a glance around into the Parth Galen forest, an area known for its serenity and hidden dangers. Sam has slumped asleep, and Merry dumps a small pile of kindling at Gimli's feet, preparing for a much-needed campfire. Sam sits up with a start, and Aragorn's head snaps round, his eyes flying to Boromir's shield which lies abandoned by his camp bed as he realizes Boromir, the valiant but troubled son of Denethor, has gone. Frodo is walking beneath the trees, lost in thought, burdened by the weight of the One Ring. Frodo turns slowly and stares at Boromir, tense and cautious. Boromir has started forward towards Frodo, but he pulls himself up, battling his internal struggle against the ring's corrupting temptation. Frodo steps hurriedly away from Boromir and turns to leave. Boromir leaps on top of Frodo, grasping for the ring, and Frodo has only moments to act. Frodo rips the ring from around his neck and rams it on his finger, vanishing from sight. Frodo races through the misty twilight world, past the foggy shapes of twisted trees, and somewhere behind him, Boromir's distraught voice carries from another dimension. A mountain of iron, immeasurably strong, the tower of adamant: Barad-dur, fortress of Sauron, rises in the distance, the epicenter of malevolence in Middle-earth. Frodo suddenly finds himself on the stone steps and clambers up the stairs onto a high seat, perched on four stone pillars. Frodo cowers on the seat, like a lost child upon the throne of mountain kings, as the world of mist swirls around him, enveloping him in the eerie visions of power and despair."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Lurtz is leading 200 Urukhai out of Isengard as they run fast their powerful legs carrying them at speed. The Fellowship are in small elven boats and elves quietly watch them depart. They row away from the Lothlorien shore into the Silverlode river and in his head Frodo still hears her voice. Galadriel gives Frodo a small Crystal Phial and as the Fellowship's boats drift past Galadriel stands alone watching from the banks of the river. The boats pass into the great river Anduin and the three elven boats carry the Fellowship steadily southward. Green trees slowly give way to a brown and withered land. while the Uruk forces run through the trees with deadly purpose. Aragorn watches them with concern. The three elven boats drift slowly through the steep rocky gorge in the predawn light with Aragorn slowly paddling in the stern. Frodo slowly looks up his eyes widening with amazement. Aragorn is strangely moved by the beauty of the silent sentinels and he speaks almost as if to himself. Two enormous rock statues towering like 300foot pinnacles on either side of the river are carved images of Gondorian kings of old. They loom over the boats with power and majesty. The Fellowship stare in stunned silence as the current takes them through the narrow gap between the statues' feet craning up past the statues' vast crumbling heads to reveal a large lake only a mile downriver. As they leap out of the boats and clamber onto the wooded shore Legolas turns to Aragorn with urgency. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Aragorn looks at Legolas knowing full well what he means and Legolas casts a glance around into the Parth Galen forest. Sam has slumped asleep and Merry dumps a small pile of kindling at Gimli's feet. Sam sits up with a start and Aragorn's head snaps round his eyes flying to Boromir's shield which lies abandoned by his camp bed as he realizes Boromir has gone. Frodo is walking beneath the trees lost in thought. Frodo turns slowly and stares at Boromir tense and cautious. Boromir has started forward towards Frodo but he pulls himself up. Frodo steps hurriedly away from Boromir and turns to leave. Boromir leaps on top of Frodo grasping for the ring and Frodo has only moments to act. Frodo rips the ring from around his neck and rams it on his finger. Frodo races through the misty twilight world past the foggy shapes of twisted trees and somewhere behind him. Boromir's distraught voice carries from another dimension. A mountain of iron immeasurably strong. the tower of adamant Baraddur fortress of Sauron. Frodo suddenly finds himself on the stone steps and clambers up the stairs onto a high seat perched on four stone pillars. Frodo cowers on the seat like a lost child upon the throne of mountain kings as the world of mist swirls around him."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Lurtz is leading 200 Urukhai out of Isengard as they run fast their powerful legs carrying them at speed. The Fellowship are in small elven boats and elves quietly watch them depart. They row away from the Lothlorien shore into the Silverlode river and in his head Frodo still hears her voice. Galadriel gives Frodo a small Crystal Phial and as the Fellowship's boats drift past Galadriel stands alone watching from the banks of the river. The boats pass into the great river Anduin and the three elven boats carry the Fellowship steadily southward. Green trees slowly give way to a brown and withered land. while the Uruk forces run through the trees with deadly purpose. Aragorn watches them with concern. The three elven boats drift slowly through the steep rocky gorge in the predawn light with Aragorn slowly paddling in the stern. Frodo slowly looks up his eyes widening with amazement. Aragorn is strangely moved by the beauty of the silent sentinels and he speaks almost as if to himself. Two enormous rock statues towering like 300foot pinnacles on either side of the river are carved images of Gondorian kings of old. They loom over the boats with power and majesty. The Fellowship stare in stunned silence as the current takes them through the narrow gap between the statues' feet craning up past the statues' vast crumbling heads to reveal a large lake only a mile downriver. As they leap out of the boats and clamber onto the wooded shore Legolas turns to Aragorn with urgency. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Aragorn looks at Legolas knowing full well what he means and Legolas casts a glance around into the Parth Galen forest. Sam has slumped asleep and Merry dumps a small pile of kindling at Gimli's feet. Sam sits up with a start and Aragorn's head snaps round his eyes flying to Boromir's shield which lies abandoned by his camp bed as he realizes Boromir has gone. Frodo is walking beneath the trees lost in thought. Frodo turns slowly and stares at Boromir tense and cautious. Boromir has started forward towards Frodo but he pulls himself up. Frodo steps hurriedly away from Boromir and turns to leave. Boromir leaps on top of Frodo grasping for the ring and Frodo has only moments to act. Frodo rips the ring from around his neck and rams it on his finger. Frodo races through the misty twilight world past the foggy shapes of twisted trees and somewhere behind him. Boromir's distraught voice carries from another dimension. A mountain of iron immeasurably strong. the tower of adamant Baraddur fortress of Sauron. Frodo suddenly finds himself on the stone steps and clambers up the stairs onto a high seat perched on four stone pillars. Frodo cowers on the seat like a lost child upon the throne of mountain kings as the world of mist swirls around him."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Lurtz is leading 200 Urukhai out of Isengard as they run fast their powerful legs carrying them at speed. The Fellowship are in small elven boats and elves quietly watch them depart. They row away from the Lothlorien shore into the Silverlode river and in his head Frodo still hears her voice. Galadriel gives Frodo a small Crystal Phial and as the Fellowship's boats drift past Galadriel stands alone watching from the banks of the river. The boats pass into the great river Anduin and the three elven boats carry the Fellowship steadily southward. Green trees slowly give way to a brown and withered land. while the Uruk forces run through the trees with deadly purpose. Aragorn watches them with concern. Frodo rips the ring from around his neck and rams it on his finger. Frodo races through the misty twilight world past the foggy shapes of twisted trees and somewhere behind him. Boromir's distraught voice carries from another dimension. A mountain of iron immeasurably strong. the tower of adamant Baraddur fortress of Sauron. Frodo suddenly finds himself on the stone steps and clambers up the stairs onto a high seat perched on four stone pillars. Frodo cowers on the seat like a lost child upon the throne of mountain kings as the world of mist swirls around him."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Lurtz is leading 200 Urukhai out of Isengard as they run fast their powerful legs carrying them at speed. The Fellowship are in small elven boats and elves quietly watch them depart. They row away from the Lothlorien shore into the Silverlode river and in his head Frodo still hears her voice. the tower of adamant Baraddur fortress of Sauron. Frodo suddenly finds himself on the stone steps and clambers up the stairs onto a high seat perched on four stone pillars. Frodo cowers on the seat like a lost child upon the throne of mountain kings as the world of mist swirls around him."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Glimmer is guiding 200 goblins out of Meadowvale as they hop slowly, their tiny wings fluttering with grace. The Crew are in small dwarven wagons, and pixies loudly cheer them on. They pedal away from the Emerald glen into the Sapphire pond, and in his mind, Felix still recalls his song. Mirana hands Felix a tiny Ruby Sphere, and as the Crew's wagons roll past, Mirana stands with a crowd, cheering from the middle of the pond. The wagons roll into the grand lake Cascade, and the three dwarven vehicles transport the Crew steadily northward. Red flowers gradually transform into a gray and dusty wasteland, while the goblin troops hop through the flowers with playful intent. Reid watches them with curiosity. The three dwarven wagons roll briskly through the flat sandy plateau in the afternoon glow, with Reid gently steering in the front. Felix gradually peers around, his eyes widening with wonder. Reid is oddly touched by the allure of the peaceful guardians, and he murmurs almost to himself. Two massive wooden effigies, standing like 300-foot beacons on either side of the pond, are carved icons of Elven elders of ancient times. They watch over the wagons with serenity and grandeur. The Crew gaze in awed silence as the stream carries them through the narrow passage between the figures' bases, glancing up past the figures' gigantic crumbling visages to reveal a vast ocean just a league away. As they jump out of the wagons and stagger onto the grassy meadow, Priscilla turns to Reid with excitement. Reid looks at Priscilla, understanding exactly what she implies, and Priscilla peers around into the Glade Arcadia pasture. Timmy has fallen asleep, and Jasper places a small bundle of leaves at Leo's hands. Timmy wakes up with a jolt, and Reid's attention swivels around, his gaze landing on Ethan's backpack which lies discarded by his tent as he realizes Ethan has vanished. Felix is strolling through the flowers, lost in ideas. Felix pivots carefully and gazes at Ethan, wary and alert. Ethan has approached towards Felix, but he halts himself. Felix strides quickly away from Ethan and turns to escape. Ethan pounces over Felix, grasping for the amulet, and Felix has mere seconds to react. Felix yanks the amulet from around his chest and jams it on his wrist. Felix dashes through the foggy nighttime realm, past the shadowy forms of bent bushes, and somewhere nearby, Ethan's anguished shout echoes from another world. A hill of gold, unfathomably sturdy, the fortress of sapphire: Arago-thur, citadel of Galdran. Felix suddenly finds himself on the wooden ramp and scrambles up the ladder onto a high pedestal, perched on four wooden beams. Felix crouches on the pedestal, like a wandering child upon the dais of forest elders, as the realm of fog swirls around him."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Lurtz leads 200 Uruk-hai from Isengard with urgency as the Fellowship departs in elven boats from Lothlorien. Galadriel gives Frodo a Crystal Phial, watching as they enter the Anduin river. The landscape shifts from green to barren as they drift south, and Aragorn observes the majestic rock statues of ancient Gondorian kings. The Fellowship is awed as they pass between the statues into a lake. On the wooded shore, urgency grows as Aragorn realizes Boromir is missing. Frodo, wandering alone, encounters Boromir, who lunges for the ring. Frodo quickly dons the ring, entering a ghostly realm, pursued by Boromir's voice. He finds himself on a high seat amid swirling mist, feeling lost and vulnerable."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Frodo cowers on the seat like a lost child upon the throne of mountain kings as the world of mist swirls around him Frodo suddenly finds himself on the stone steps and clambers up the stairs onto a high seat perched on four stone pillars  the tower of adamant Baraddur fortress of Sauron  A mountain of iron immeasurably strong  Boromir's distraught voice carries from another dimension  Frodo races through the misty twilight world past the foggy shapes of twisted trees and somewhere behind him  Frodo rips the ring from around his neck and rams it on his finger  Boromir leaps on top of Frodo grasping for the ring and Frodo has only moments to act  Frodo steps hurriedly away from Boromir and turns to leave  Boromir has started forward towards Frodo but he pulls himself up  Frodo turns slowly and stares at Boromir tense and cautious  Frodo is walking beneath the trees lost in thought  Sam sits up with a start and Aragorn's head snaps round his eyes flying to Boromir's shield which lies abandoned by his camp bed as he realizes Boromir has gone  Sam has slumped asleep and Merry dumps a small pile of kindling at Gimli's feet  Aragorn looks at Legolas knowing full well what he means and Legolas casts a glance around into the Parth Galen forest  As they leap out of the boats and clamber onto the wooded shore Legolas turns to Aragorn with urgency  The Fellowship stare in stunned silence as the current takes them through the narrow gap between the statues' feet craning up past the statues' vast crumbling heads to reveal a large lake only a mile downriver  They loom over the boats with power and majesty  Two enormous rock statues towering like 300foot pinnacles on either side of the river are carved images of Gondorian kings of old  Aragorn is strangely moved by the beauty of the silent sentinels and he speaks almost as if to himself  Frodo slowly looks up his eyes widening with amazement  The three elven boats drift slowly through the steep rocky gorge in the predawn light with Aragorn slowly paddling in the stern  Aragorn watches them with concern  while the Uruk forces run through the trees with deadly purpose  Green trees slowly give way to a brown and withered land  The boats pass into the great river Anduin and the three elven boats carry the Fellowship steadily southward  Galadriel gives Frodo a small Crystal Phial and as the Fellowship's boats drift past Galadriel stands alone watching from the banks of the river  They row away from the Lothlorien shore into the Silverlode river and in his head Frodo still hears her voice  The Fellowship are in small elven boats and elves quietly watch them depart  Lurtz is leading 200 Urukhai out of Isengard as they run fast their powerful legs carrying them at speed "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The Fellowship are in small elven boats and elves quietly watch them depart Lurtz is leading 200 Urukhai out of Isengard as they run fast their powerful legs carrying them at speed Galadriel gives Frodo a small Crystal Phial and as the Fellowship's boats drift past Galadriel stands alone watching from the banks of the river They row away from the Lothlorien shore into the Silverlode river and in his head Frodo still hears her voice Green trees slowly give way to a brown and withered land The boats pass into the great river Anduin and the three elven boats carry the Fellowship steadily southward Aragorn watches them with concern while the Uruk forces run through the trees with deadly purpose Frodo slowly looks up his eyes widening with amazement The three elven boats drift slowly through the steep rocky gorge in the predawn light with Aragorn slowly paddling in the stern Two enormous rock statues towering like 300foot pinnacles on either side of the river are carved images of Gondorian kings of old Aragorn is strangely moved by the beauty of the silent sentinels and he speaks almost as if to himself The Fellowship stare in stunned silence as the current takes them through the narrow gap between the statues' feet craning up past the statues' vast crumbling heads to reveal a large lake only a mile downriver They loom over the boats with power and majesty Aragorn looks at Legolas knowing full well what he means and Legolas casts a glance around into the Parth Galen forest As they leap out of the boats and clamber onto the wooded shore Legolas turns to Aragorn with urgency Sam sits up with a start and Aragorn's head snaps round his eyes flying to Boromir's shield which lies abandoned by his camp bed as he realizes Boromir has gone Sam has slumped asleep and Merry dumps a small pile of kindling at Gimli's feet Frodo turns slowly and stares at Boromir tense and cautious Frodo is walking beneath the trees lost in thought Frodo steps hurriedly away from Boromir and turns to leave Boromir has started forward towards Frodo but he pulls himself up Frodo rips the ring from around his neck and rams it on his finger Boromir leaps on top of Frodo grasping for the ring and Frodo has only moments to act Boromir's distraught voice carries from another dimension Frodo races through the misty twilight world past the foggy shapes of twisted trees and somewhere behind him the tower of adamant Baraddur fortress of Sauron A mountain of iron immeasurably strong Frodo cowers on the seat like a lost child upon the throne of mountain kings as the world of mist swirls around him Frodo suddenly finds himself on the stone steps and clambers up the stairs onto a high seat perched on four stone pillars"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Aragorn looks at Legolas knowing full well what he means and Legolas casts a glance around into the Parth Galen forest  Sam has slumped asleep and Merry dumps a small pile of kindling at Gimli's feet  Sam sits up with a start and Aragorn's head snaps round his eyes flying to Boromir's shield which lies abandoned by his camp bed as he realizes Boromir has gone  Frodo is walking beneath the trees lost in thought  Frodo turns slowly and stares at Boromir tense and cautious  Boromir has started forward towards Frodo but he pulls himself up  Frodo steps hurriedly away from Boromir and turns to leave  Boromir leaps on top of Frodo grasping for the ring and Frodo has only moments to act  Frodo rips the ring from around his neck and rams it on his finger  Frodo races through the misty twilight world past the foggy shapes of twisted trees and somewhere behind him  Boromir's distraught voice carries from another dimension  A mountain of iron immeasurably strong  the tower of adamant Baraddur fortress of Sauron  Frodo suddenly finds himself on the stone steps and clambers up the stairs onto a high seat perched on four stone pillars  Frodo cowers on the seat like a lost child upon the throne of mountain kings as the world of mist swirls around him Lurtz is leading 200 Urukhai out of Isengard as they run fast their powerful legs carrying them at speed  The Fellowship are in small elven boats and elves quietly watch them depart  They row away from the Lothlorien shore into the Silverlode river and in his head Frodo still hears her voice  Galadriel gives Frodo a small Crystal Phial and as the Fellowship's boats drift past Galadriel stands alone watching from the banks of the river  The boats pass into the great river Anduin and the three elven boats carry the Fellowship steadily southward  Green trees slowly give way to a brown and withered land  while the Uruk forces run through the trees with deadly purpose  Aragorn watches them with concern  The three elven boats drift slowly through the steep rocky gorge in the predawn light with Aragorn slowly paddling in the stern  Frodo slowly looks up his eyes widening with amazement  Aragorn is strangely moved by the beauty of the silent sentinels and he speaks almost as if to himself  Two enormous rock statues towering like 300foot pinnacles on either side of the river are carved images of Gondorian kings of old  They loom over the boats with power and majesty  The Fellowship stare in stunned silence as the current takes them through the narrow gap between the statues' feet craning up past the statues' vast crumbling heads to reveal a large lake only a mile downriver  As they leap out of the boats and clamber onto the wooded shore Legolas turns to Aragorn with urgency "
        }
      ]
    }
  ]
}