{
  "ground_truth": "Resting on a small rock rising out of the long, overgrown white flowers scattered among well-seeded grasses, an idyllic setting at the end of a long hot summer, the figure is reading a book. The figure in the grass sits up, looking straight at the camera, revealing a handsome young hobbit with dark curly hair and deep blue eyes. This is Frodo Baggins, his eyes alight with excitement. Tossing away the long stem of grass in his mouth, Frodo runs off. A cart rattles along a leafy lane, driven by a stooped figure in grey. The shambling old pony snorts and rears. Shire, 60 years later, camera tracks to a figure lying beneath the dappled sunlight of an old tree. Suddenly, Frodo appears on a bank above the cart. They look at each other a moment, then both start laughing as Frodo's face breaks into a smile, and he leaps onto the front seat of the cart. The cart rattles past a field lupin being tended by Gandalf, who looks down at Frodo with a twinkle in his eye. The cart rattles over a stone bridge towards a busy hobbit marketplace. Gandalf surveys the peaceful scene before him. Hobbits look up exclaiming in wonder and excitement as the cart bearing Gandalf and Frodo rolls past the Green Dragon Inn towards the party field, where scores of hobbits are busy preparing for the big night. Odo Proudfoot looks up as the cart passes by, deeply suspicious. As the cart rattles into the small village of Hobbiton, a quaint rustic settlement nestled amongst rolling green hills and large trees, excited children chase after the cart. Gandalf ignores the children's cries, but as they stand deflated, watching Gandalf disappear up the lane, spinning balls of bright color suddenly leap out of the cart, fizzing over the heads of the delighted children. Gandalf smiles to himself, well-pleased with his joke, and even Odo Proudfoot is unable to suppress a chuckle. Frodo stands up in the cart as Gandalf reins in the horse. The hobbits live in Hobbit holes: neat burrows dug into the grassy hillside, with round doors and cute front gardens. Gandalf's cart pulls up outside the gate to Bag End, a particularly fine example of a hobbit hole with a large round front door set into a grassy hillside. He raises his staff and raps on the front door, and a voice calls out. Suddenly, the door opens and Bilbo Baggins stands before him, a hobbit of indeterminate age with a mischievous twinkle in his eye. Wearing a dashing brocade waistcoat, he looks every inch the eccentric gentleman. Gandalf drops to his knee to embrace his old friend.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Resting on a small boulder rising out of the lengthy, overgrown white blossoms scattered among well-seeded grasses, an idyllic setting at the end of a lengthy hot summer, the character is perusing a tome. The character in the grass sits up, gazing directly at the lens, revealing a handsome young hobbit with dark curly locks and deep blue eyes. This is Frodo Baggins, his eyes alight with enthusiasm. Tossing away the long stalk of grass in his mouth, Frodo dashes off. A wagon rattles along a leafy path, driven by a stooped figure in grey. The shambling old pony snorts and rears. Shire, 60 years later, camera tracks to a figure lying beneath the dappled sunlight of an old tree. Suddenly, Frodo emerges on a slope above the wagon. They gaze at each other a moment, then both start chuckling as Frodo's face breaks into a grin, and he leaps onto the front seat of the wagon. The wagon rattles past a field lupin being tended by Gandalf, who looks down at Frodo with a twinkle in his eye. The wagon rattles over a stone bridge towards a busy hobbit marketplace. Gandalf surveys the peaceful scene before him. Hobbits gaze up exclaiming in wonder and enthusiasm as the wagon bearing Gandalf and Frodo rolls past the Green Dragon Inn towards the party field, where scores of hobbits are busy preparing for the big night. Odo Proudfoot gazes up as the wagon passes by, deeply suspicious. As the wagon rattles into the small hamlet of Hobbiton, a quaint rustic settlement nestled amongst rolling green hills and large trees, excited youngsters chase after the wagon. Gandalf ignores the youngsters' cries, but as they stand deflated, watching Gandalf vanish up the path, spinning spheres of bright hue suddenly leap out of the wagon, fizzing over the heads of the delighted youngsters. Gandalf smiles to himself, well-pleased with his joke, and even Odo Proudfoot is unable to suppress a chuckle. Frodo stands up in the wagon as Gandalf reins in the steed. The hobbits dwell in Hobbit burrows: neat dens dug into the grassy hillside, with round doors and charming front gardens. Gandalf's wagon pulls up outside the gate to Bag End, a particularly fine example of a hobbit burrow with a large round front door set into a grassy hillside. He raises his staff and raps on the front door, and a voice calls out. Suddenly, the door opens and Bilbo Baggins stands before him, a hobbit of indeterminate age with a mischievous twinkle in his eye. Wearing a dashing brocade waistcoat, he looks every inch the eccentric gentleman. Gandalf drops to his knee to embrace his old companion."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Resting on a small rock rising out of the long, overgrown white flowers scattered among well-seeded grasses, an idyllic setting at the end of a long hot summer, a book is being read by the figure. The figure in the grass is sat up by himself, and he looks straight at the camera, revealing a handsome young hobbit with dark curly hair and deep blue eyes. This is Frodo Baggins, and excitement alights his eyes. The long stem of grass in his mouth is tossed away by Frodo, and off he runs. A leafy lane is rattled along by a cart, which a stooped figure in grey drives. The old shambling pony snorts and rears. Shire, 60 years later, camera tracks to a figure lying beneath the dappled sunlight of an old tree. Suddenly, Frodo appears on a bank above the cart. They look at each other for a moment, and then laughing starts from both as a smile breaks onto Frodo's face, and the front seat of the cart is leaped onto by him. Past a field lupin, the cart rattles, which Gandalf tends, and he looks down at Frodo with a twinkle in his eye. Over a stone bridge towards a busy hobbit marketplace, the cart rattles. The peaceful scene before him is surveyed by Gandalf. Hobbits look up, exclaiming in wonder and excitement as Gandalf and Frodo bear into a cart that rolls past the Green Dragon Inn towards the party field, where preparations by scores of hobbits for the big night are busy. Odo Proudfoot looks up as the cart passes by, and deep suspicion is expressed by him. As the cart rattles into the small village of Hobbiton, a quaint rustic settlement nestled amongst rolling green hills and large trees, the cart is chased after by excited children. The children's cries are ignored by Gandalf, but as deflated they stand, watching Gandalf disappear up the lane, spinning balls of bright color suddenly leap out of the cart, fizzing over the heads of the delighted children. Gandalf smiles to himself, and his joke well-pleases him, and a chuckle is unable to be suppressed even by Odo Proudfoot. Frodo stands up in the cart as the horse is reined in by Gandalf. Hobbit holes are where the hobbits live: neat burrows dug into the grassy hillside, with round doors and cute front gardens. Outside the gate to Bag End, Gandalf's cart pulls up, and it is a particularly fine example of a hobbit hole with a large round front door set into a grassy hillside. His staff is raised by him, and he raps on the front door, and out calls a voice. Suddenly, the door opens, and before him stands Bilbo Baggins, a hobbit of indeterminate age with a mischievous twinkle in his eye. Wearing a dashing brocade waistcoat, every inch the eccentric gentleman is he. Gandalf drops to his knee to embrace his old friend."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Resting on a small rock amid overgrown white flowers and well-seeded grasses at the end of a hot summer, a figure reads a book. The figure sits up, revealing a handsome young hobbit, Frodo Baggins, with dark curly hair and deep blue eyes. Excited, Frodo runs off. A cart rattles along a leafy lane, driven by a stooped figure in grey. The old pony snorts. Shire, 60 years later, Frodo appears above the cart, and both he and the driver laugh as Frodo jumps onto the front seat. The cart passes a field lupin tended by Gandalf, who looks at Frodo with a twinkle. It rattles over a stone bridge toward a busy hobbit marketplace. Hobbits exclaim in wonder as the cart with Gandalf and Frodo rolls past the Green Dragon Inn to the party field, where hobbits prepare for the big night. Odo Proudfoot looks on suspiciously. As the cart enters Hobbiton, a quaint village among green hills, excited children chase it. Gandalf ignores them, but as they stand deflated, colorful balls leap from the cart, delighting the children. Gandalf smiles, pleased with his joke, and even Odo chuckles. Frodo stands as Gandalf reins in the horse. Hobbits live in neat burrows with round doors and gardens. Gandalf's cart stops at Bag End, a fine hobbit hole with a large round door. He raps on the door, and Bilbo Baggins, a hobbit with a mischievous twinkle, appears. Wearing a brocade waistcoat, he looks the eccentric gentleman. Gandalf kneels to embrace his old friend."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Resting on a small rock among overgrown white flowers and grasses, a figure reads a book. The figure, a handsome young hobbit with dark curly hair and deep blue eyes, is Frodo Baggins. Tossing away a grass stem, Frodo runs off. A cart driven by a stooped figure in grey rattles along a leafy lane. The old pony snorts. Shire, 60 years later, Frodo appears above the cart, and both he and the driver laugh as Frodo jumps onto the cart's front seat. The cart passes Gandalf, who looks at Frodo with a twinkle. It rattles over a stone bridge towards a hobbit marketplace. Hobbits exclaim as the cart with Gandalf and Frodo rolls past the Green Dragon Inn to the party field, where hobbits prepare for the big night. Odo Proudfoot watches suspiciously. In Hobbiton, children chase the cart. Gandalf ignores them, but colorful balls leap from the cart, delighting the children. Gandalf smiles, and even Odo chuckles. Frodo stands as Gandalf reins in the horse. Hobbits live in neat burrows with round doors. Gandalf's cart stops at Bag End, a fine hobbit hole. He knocks, and Bilbo Baggins, wearing a brocade waistcoat, opens the door. Gandalf kneels to embrace his old friend."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Resting comfortably on a small rock that rises out of the long, overgrown white flowers scattered among the well-seeded grasses, an idyllic and picturesque setting at the end of a long, hot summer, the figure is deeply engrossed in reading a book. The figure, nestled in the grass, sits up and looks directly at the camera, revealing a handsome young hobbit with dark, curly hair and deep, captivating blue eyes. This is none other than Frodo Baggins, his eyes alight with a spark of excitement and curiosity. Tossing away the long stem of grass that he had been chewing on, Frodo suddenly runs off with a burst of energy. Meanwhile, a cart rattles along a leafy lane, driven by a stooped figure clad in grey. The shambling old pony pulling the cart snorts and rears slightly. The scene is set in the Shire, 60 years later, as the camera tracks to a figure lying beneath the dappled sunlight filtering through the branches of an old tree. Suddenly, Frodo appears on a bank above the cart. They exchange a glance for a moment, then both start laughing heartily as Frodo's face breaks into a wide smile, and he leaps onto the front seat of the cart with enthusiasm. The cart rattles past a field of lupin being carefully tended by Gandalf, who looks down at Frodo with a twinkle in his eye, full of warmth and amusement. The cart continues to rattle over a stone bridge, heading towards a bustling hobbit marketplace. Gandalf surveys the peaceful and lively scene before him. Hobbits look up, exclaiming in wonder and excitement as the cart, bearing both Gandalf and Frodo, rolls past the Green Dragon Inn towards the party field, where scores of hobbits are busily preparing for the big night ahead. Odo Proudfoot looks up as the cart passes by, his expression deeply suspicious. As the cart rattles into the small village of Hobbiton, a quaint and rustic settlement nestled among rolling green hills and large, ancient trees, excited children chase after the cart with glee. Gandalf, however, ignores the children's cries, but as they stand deflated, watching Gandalf disappear up the lane, spinning balls of bright color suddenly leap out of the cart, fizzing over the heads of the delighted children. Gandalf smiles to himself, well-pleased with his clever joke, and even Odo Proudfoot is unable to suppress a chuckle. Frodo stands up in the cart as Gandalf reins in the horse. The hobbits live in charming Hobbit holes: neat burrows dug into the grassy hillside, complete with round doors and cute front gardens. Gandalf's cart pulls up outside the gate to Bag End, a particularly fine example of a hobbit hole with a large, round front door set into a grassy hillside. He raises his staff and raps on the front door, and a voice calls out from within. Suddenly, the door swings open, and Bilbo Baggins stands before him, a hobbit of indeterminate age with a mischievous twinkle in his eye. Wearing a dashing brocade waistcoat, he looks every inch the eccentric gentleman. Gandalf drops to his knee to warmly embrace his old friend."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Nestling comfortably on a modest-sized rock that emerges from the midst of long, wild white flowers interspersed among the lush, well-seeded grasses, there is an idyllic and picturesque tableau set at the close of a long and sweltering summer. In this serene environment, a figure is profoundly absorbed in the act of reading a book. This figure, snugly situated in the grass, eventually rises and faces the camera directly, revealing a strikingly handsome young hobbit characterized by dark, curly hair and deep, enchanting blue eyes. This is none other than Frodo Baggins, his eyes sparkling with a flicker of excitement and an inquisitive spirit. He tosses aside the lengthy grass stem he had been idly chewing, and in an instant, he dashes off with a sudden surge of energy.\n\nMeanwhile, a cart is heard rattling along a leafy lane. At the helm is a hunched figure clad in a grey garment, steering the cart. The shambling old pony, tasked with pulling the cart, emits a snort and rears up slightly. This delightful scene is set in the Shire, precisely 60 years later, as the camera pans to reveal another figure reclining beneath the dappled sunlight that filters through the branches of an ancient tree. Out of nowhere, Frodo emerges on a bank above the cart. They share a momentary glance before both burst into hearty laughter. Frodo's face erupts into a wide, beaming smile as he leaps onto the cart's front seat with boundless enthusiasm.\n\nThe cart trundles past a field of lupins being meticulously tended by Gandalf, who casts a glance at Frodo, his eye twinkling with warmth and amusement. The cart continues its rattling journey over a stone bridge, making its way toward a vibrant hobbit marketplace. Gandalf takes in the tranquil yet lively scene that unfolds before him. Hobbits lift their heads in amazement and enthusiasm as the cart, bearing both Gandalf and Frodo, rolls past the famed Green Dragon Inn, heading towards the party field, where scores of hobbits are diligently preparing for the anticipated big night. Odo Proudfoot turns his gaze upward as the cart proceeds by, his expression marked by deep suspicion.\n\nAs the cart makes its rattling entrance into the quaint village of Hobbiton, a rustic settlement nestled among rolling green hills and ancient, towering trees, excited children pursue the cart with cheerful glee. Gandalf, however, pays no heed to the children's cries. As they stand disappointed, watching Gandalf fade away up the lane, colorful balls of brightness suddenly spring forth from the cart, fizzing joyously above the delighted children's heads. Gandalf, pleased with his clever jest, smiles to himself, and even Odo Proudfoot cannot resist a soft chuckle.\n\nFrodo ascends within the cart as Gandalf brings the horse to a halt. The hobbits make their homes in charming hobbit holes, which are neat burrows dug thoughtfully into the grassy hillside, each featuring round doors and delightful front gardens. Gandalf’s cart draws to a stop outside the gate of Bag End, a particularly fine specimen of a hobbit hole with a large, round front door set into a lush, grassy hillside. Raising his staff, Gandalf raps on the front door, and a voice echoes from within. All at once, the door swings open to reveal Bilbo Baggins, a hobbit of indeterminate age with a mischievous glint in his eye. Clad in an elegant brocade waistcoat, he epitomizes the image of an eccentric gentleman. Gandalf kneels warmly to embrace his old friend, filled with affection."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Resting on a small rock that rises out of the long, overgrown white flowers scattered among well-seeded grasses, creating an idyllic setting at the end of a long hot summer, the figure is deeply engrossed in reading a book. The figure, nestled comfortably in the grass, gradually sits up, shifting his posture to look directly at the camera, revealing himself as a handsome young hobbit with dark curly hair and deep blue eyes. This is Frodo Baggins, whose eyes are alight with excitement and curiosity. With a swift motion, he tosses away the long stem of grass that had been idly resting in his mouth and suddenly springs into action, running off with a burst of energy. Meanwhile, a cart rattles along a leafy lane, driven by a stooped figure clad in grey, as the shambling old pony pulling it snorts and rears slightly, adjusting to the uneven path. The scene shifts to the Shire, 60 years later, where the camera tracks to a figure lying beneath the dappled sunlight filtering through the leaves of an old tree. In a sudden moment, Frodo appears on a bank above the cart, and they exchange a glance, a silent communication that quickly turns into shared laughter as Frodo's face breaks into a wide smile. With a joyful leap, he lands onto the front seat of the cart. The cart continues its journey, rattling past a field of lupin being tended by Gandalf, who looks down at Frodo with a twinkle in his eye, acknowledging the young hobbit's presence. The cart rattles over a stone bridge, moving towards a bustling hobbit marketplace. Gandalf takes a moment to survey the peaceful scene before him, observing the hobbits who look up, exclaiming in wonder and excitement as the cart bearing Gandalf and Frodo rolls past the Green Dragon Inn, heading towards the party field where scores of hobbits are busily preparing for the big night. Odo Proudfoot, standing nearby, looks up as the cart passes by, his expression deeply suspicious. As the cart rattles into the small village of Hobbiton, a quaint rustic settlement nestled amongst rolling green hills and large trees, excited children begin to chase after the cart, their laughter and shouts filling the air. Gandalf, seemingly ignoring the children's cries, continues on, but as the children stand deflated, watching Gandalf disappear up the lane, spinning balls of bright color suddenly leap out of the cart, fizzing over the heads of the delighted children. Gandalf smiles to himself, well-pleased with his playful joke, and even Odo Proudfoot is unable to suppress a chuckle at the spectacle. Frodo stands up in the cart as Gandalf reins in the horse, bringing it to a gentle stop. The hobbits live in Hobbit holes, which are neat burrows dug into the grassy hillside, each with round doors and charming front gardens. Gandalf's cart pulls up outside the gate to Bag End, a particularly fine example of a hobbit hole with a large round front door set into the grassy hillside. Gandalf raises his staff and raps on the front door, the sound echoing slightly, and a voice calls out from within. Suddenly, the door swings open, and Bilbo Baggins stands before him, a hobbit of indeterminate age with a mischievous twinkle in his eye. Wearing a dashing brocade waistcoat, he looks every inch the eccentric gentleman. Gandalf, filled with warmth and nostalgia, drops to his knee to embrace his old friend, their reunion marked by a shared history and deep affection."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "In an idyllic setting of overgrown white flowers and well-seeded grasses at the end of a long hot summer, Frodo Baggins, a handsome young hobbit with dark curly hair and deep blue eyes, reads a book. He sits up, looks at the camera with excitement, tosses away a grass stem, and runs off. A cart driven by a stooped figure in grey rattles along a leafy lane, pulled by a shambling old pony. Sixty years later in the Shire, Frodo appears on a bank above the cart, exchanges a glance with the driver, and they both laugh as Frodo leaps onto the front seat. The cart, driven by Gandalf, passes a field lupin and heads towards a busy hobbit marketplace. Gandalf surveys the peaceful scene as hobbits express wonder and excitement while the cart rolls past the Green Dragon Inn towards the party field, where hobbits prepare for a big night. Odo Proudfoot watches suspiciously as the cart enters Hobbiton, a quaint village nestled among rolling green hills. Excited children chase the cart, and as Gandalf ignores their cries, he surprises them with spinning balls of bright color, delighting the children and amusing even Odo Proudfoot. Frodo stands in the cart as Gandalf reins in the horse. The hobbits live in neat burrows with round doors and cute gardens. Gandalf's cart stops outside Bag End, a fine hobbit hole with a large round door. He knocks with his staff, and Bilbo Baggins, wearing a dashing brocade waistcoat and exuding eccentric charm, opens the door. Gandalf kneels to embrace his old friend."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Resting on a small rock rising out of the long, overgrown white flowers, such as daisies and Queen Anne's lace, scattered among well-seeded grasses, creating an idyllic setting at the end of a long hot summer in the lush region known as the Shire, the figure is reading a book. The figure in the grass sits up, looking straight at the camera, revealing a handsome young hobbit with dark curly hair and deep blue eyes. This is Frodo Baggins, widely known in Middle-earth for his adventurous spirit and his pivotal role in the quest to destroy the One Ring, his eyes alight with excitement. Tossing away the long stem of grass in his mouth, Frodo runs off. A cart rattles along a leafy lane, a common path in the Shire surrounded by ancient oak and maple trees, driven by a stooped figure in grey. The shambling old pony, an essential companion in these rural areas, snorts and rears. Shire, 60 years later, a time of peace and prosperity after the fall of Sauron, the camera tracks to a figure lying beneath the dappled sunlight of an old tree. Suddenly, Frodo appears on a bank above the cart. They look at each other a moment, then both start laughing as Frodo's face breaks into a smile, and he leaps onto the front seat of the cart. The cart rattles past a field lupin being tended by Gandalf, the wise and powerful wizard known for his deep connection to hobbits, who looks down at Frodo with a twinkle in his eye. The cart rattles over a stone bridge towards a busy hobbit marketplace, known for its vibrant energy and diverse array of goods. Gandalf surveys the peaceful scene before him. Hobbits look up exclaiming in wonder and excitement as the cart bearing Gandalf and Frodo rolls past the Green Dragon Inn, a popular social hub for hobbits, towards the party field, where scores of hobbits are busy preparing for the big night, an event honoring Bilbo's eleventy-first birthday. Odo Proudfoot, a well-known skeptic in the community, looks up as the cart passes by, deeply suspicious. As the cart rattles into the small village of Hobbiton, a quaint rustic settlement nestled amongst rolling green hills and large trees, excited children chase after the cart. Gandalf ignores the children's cries, but as they stand deflated, watching Gandalf disappear up the lane, spinning balls of bright color, his fireworks known throughout Middle-earth for their beauty and surprise, suddenly leap out of the cart, fizzing over the heads of the delighted children. Gandalf smiles to himself, well-pleased with his joke, and even Odo Proudfoot is unable to suppress a chuckle. Frodo stands up in the cart as Gandalf reins in the horse at Bag End, the ancestral home of the Baggins family. The hobbits live in Hobbit holes: neat burrows dug into the grassy hillside, with round doors and cute front gardens, reflecting their love for nature and simplicity. Gandalf's cart pulls up outside the gate to Bag End, a particularly fine example of a hobbit hole with a large round front door set into a grassy hillside. He raises his staff, a symbol of his authority and power, and raps on the front door, and a voice calls out. Suddenly, the door opens and Bilbo Baggins, once a reluctant adventurer renowned for his journey to the Lonely Mountain, stands before him, a hobbit of indeterminate age with a mischievous twinkle in his eye. Wearing a dashing brocade waistcoat he acquired during his travels, he looks every inch the eccentric gentleman. Gandalf drops to his knee to embrace his old friend, a reunion of two who have shared many adventures."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Resting on a small rock rising out of the long overgrown white flowers scattered among wellseeded grasses an idyllic setting at the end of a long hot summer. the figure is reading a book. The figure in the grass sits up looking straight at the camera revealing a handsome young hobbit with dark curly hair and deep blue eyes. This is Frodo Baggins his eyes alight with excitement. Tossing away the long stem of grass in his mouth Frodo runs off. A cart rattles along a leafy lane driven by a stooped figure in grey. The shambling old pony snorts and rears. Shire 60 years later. camera tracks to a figure lying beneath the dappled sunlight of an old tree. Suddenly Frodo appears on a bank above the cart. They look at each other a moment then both start laughing as Frodo's face breaks into a smile and he leaps onto the front seat of the cart. The cart rattles past a field lupin being tended by Gandalf who looks down at Frodo with a twinkle in his eye. The cart rattles over a stone bridge towards a busy hobbit marketplace. Gandalf surveys the peaceful scene before him. Hobbits look up exclaiming in wonder and excitement as the cart bearing Gandalf and Frodo rolls past the Green Dragon Inn towards the party field where scores of hobbits are busy preparing for the big night. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Odo Proudfoot looks up as the cart passes by deeply suspicious. As the cart rattles into the small village of Hobbiton a quaint rustic settlement nestled amongst rolling green hills and large trees. excited children chase after the cart. Gandalf ignores the children's cries but as they stand deflated watching Gandalf disappear up the lane spinning balls of bright color suddenly leap out of the cart fizzing over the heads of the delighted children. Gandalf smiles to himself wellpleased with his joke and even Odo Proudfoot is unable to suppress a chuckle. Frodo stands up in the cart as Gandalf reins in the horse. The hobbits live in Hobbit holes. neat burrows dug into the grassy hillside with round doors and cute front gardens. Gandalf's cart pulls up outside the gate to Bag End. a particularly fine example of a hobbit hole with a large round front door set into a grassy hillside. He raises his staff and raps on the front door and a voice calls out. Suddenly the door opens and Bilbo Baggins stands before him. a hobbit of indeterminate age with a mischievous twinkle in his eye. Wearing a dashing brocade waistcoat he looks every inch. the eccentric gentleman. Gandalf drops to his knee to embrace his old friend."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Resting on a small rock rising out of the long overgrown white flowers scattered among wellseeded grasses an idyllic setting at the end of a long hot summer. the figure is reading a book. The figure in the grass sits up looking straight at the camera revealing a handsome young hobbit with dark curly hair and deep blue eyes. This is Frodo Baggins his eyes alight with excitement. Tossing away the long stem of grass in his mouth Frodo runs off. A cart rattles along a leafy lane driven by a stooped figure in grey. The shambling old pony snorts and rears. Shire 60 years later. camera tracks to a figure lying beneath the dappled sunlight of an old tree. Suddenly Frodo appears on a bank above the cart. They look at each other a moment then both start laughing as Frodo's face breaks into a smile and he leaps onto the front seat of the cart. The cart rattles past a field lupin being tended by Gandalf who looks down at Frodo with a twinkle in his eye. The cart rattles over a stone bridge towards a busy hobbit marketplace. Gandalf surveys the peaceful scene before him. Hobbits look up exclaiming in wonder and excitement as the cart bearing Gandalf and Frodo rolls past the Green Dragon Inn towards the party field where scores of hobbits are busy preparing for the big night. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Odo Proudfoot looks up as the cart passes by deeply suspicious. As the cart rattles into the small village of Hobbiton a quaint rustic settlement nestled amongst rolling green hills and large trees. excited children chase after the cart. Gandalf ignores the children's cries but as they stand deflated watching Gandalf disappear up the lane spinning balls of bright color suddenly leap out of the cart fizzing over the heads of the delighted children. Gandalf smiles to himself wellpleased with his joke and even Odo Proudfoot is unable to suppress a chuckle. Frodo stands up in the cart as Gandalf reins in the horse. The hobbits live in Hobbit holes. neat burrows dug into the grassy hillside with round doors and cute front gardens. Gandalf's cart pulls up outside the gate to Bag End. a particularly fine example of a hobbit hole with a large round front door set into a grassy hillside. He raises his staff and raps on the front door and a voice calls out. Suddenly the door opens and Bilbo Baggins stands before him. a hobbit of indeterminate age with a mischievous twinkle in his eye. Wearing a dashing brocade waistcoat he looks every inch. the eccentric gentleman. Gandalf drops to his knee to embrace his old friend."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Resting on a small rock rising out of the long overgrown white flowers scattered among wellseeded grasses an idyllic setting at the end of a long hot summer. the figure is reading a book. The figure in the grass sits up looking straight at the camera revealing a handsome young hobbit with dark curly hair and deep blue eyes. This is Frodo Baggins his eyes alight with excitement. Tossing away the long stem of grass in his mouth Frodo runs off. A cart rattles along a leafy lane driven by a stooped figure in grey. The shambling old pony snorts and rears. Shire 60 years later. Gandalf's cart pulls up outside the gate to Bag End. a particularly fine example of a hobbit hole with a large round front door set into a grassy hillside. He raises his staff and raps on the front door and a voice calls out. Suddenly the door opens and Bilbo Baggins stands before him. a hobbit of indeterminate age with a mischievous twinkle in his eye. Wearing a dashing brocade waistcoat he looks every inch. the eccentric gentleman. Gandalf drops to his knee to embrace his old friend."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Resting on a small rock rising out of the long overgrown white flowers scattered among wellseeded grasses an idyllic setting at the end of a long hot summer. the figure is reading a book. The figure in the grass sits up looking straight at the camera revealing a handsome young hobbit with dark curly hair and deep blue eyes. a hobbit of indeterminate age with a mischievous twinkle in his eye. Wearing a dashing brocade waistcoat he looks every inch. the eccentric gentleman. Gandalf drops to his knee to embrace his old friend."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Balancing on a large boulder emerging from shimmering, multicolored ferns clustered amid sparsely planted mushrooms, a chaotic landscape at the start of a brisk chilly autumn, the creature is sketching a map. The creature in the forest stretches out, gazing directly at the telescope, revealing a grizzled old gnome with light straight hair and bright green eyes. This is Milo Greenleaf, his eyes glowing with curiosity. Flicking aside the short twig of lavender in his hand, Milo skips away. A scooter zooms along a dusty path, piloted by an upright figure in purple. The lumbering young donkey brays and bucks. Grotto, 100 years earlier, telescope pans to a creature lounging beneath the fragmented shade of a new shrub. Abruptly, Milo materializes on a mound atop the scooter. They glance at each other briefly, then both howl with glee as Milo's visage splits into a grin, and he jumps onto the back seat of the scooter. The scooter zooms past a cactus garden being managed by Elrond, who peers up at Milo with a sparkle in his gaze. The scooter zooms over a wooden pier towards a bustling gnome trading post. Elrond observes the serene vista ahead. Gnomes glance up gasping in surprise and joy as the scooter carrying Elrond and Milo rolls past the Jolly Griffin Tavern towards the celebration grove, where dozens of gnomes are industriously setting up for the grand event. Podo Flatfoot peers up as the scooter glides by, extremely doubtful. As the scooter zooms into the expansive hamlet of Gnomeshoe, a modern urban enclave nestled within towering purple peaks and spindly shrubs, thrilled youths dash after the scooter. Elrond disregards the youths' calls, but as they stand disheartened, watching Elrond vanish down the path, spinning cubes of vivid hues suddenly burst from the scooter, whizzing above the heads of the gleeful youths. Elrond grins to himself, quite content with the prank, and even Podo Flatfoot cannot resist a giggle. Milo rises in the scooter as Elrond pulls back the goat's reins. The gnomes reside in Gnome burrows: tidy tunnels carved into the rocky cliffside, with oval entrances and charming rooftop gardens. Elrond's scooter halts outside the fence to Stone Arch, a truly remarkable example of a gnome burrow with an enormous oval entrance nestled into a rocky cliffside. He raises his cane and taps on the entrance, and a sound echoes through. Instantly, the entrance opens and Dorian Greenleaf appears before him, a gnome of unknown heritage with a cheeky gleam in his gaze. Sporting an elegant velvet cape, he resembles every bit the whimsical traveler. Elrond stoops to clasp his ancient companion."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In an idyllic setting, Frodo Baggins, a handsome hobbit with dark curls and blue eyes, reads a book. He runs off to join Gandalf, who drives a cart through the Shire. As the cart rattles through a vibrant hobbit marketplace toward Hobbiton, where children excitedly chase it, Gandalf playfully sends colorful fireworks into the air. Arriving at Bag End, a fine hobbit hole, Gandalf knocks on the large round door. Bilbo Baggins, wearing an elegant waistcoat and with a mischievous twinkle, greets Gandalf warmly, showcasing his eccentric gentlemanly charm."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Gandalf drops to his knee to embrace his old friend the eccentric gentleman  Wearing a dashing brocade waistcoat he looks every inch  a hobbit of indeterminate age with a mischievous twinkle in his eye  Suddenly the door opens and Bilbo Baggins stands before him  He raises his staff and raps on the front door and a voice calls out  a particularly fine example of a hobbit hole with a large round front door set into a grassy hillside  Gandalf's cart pulls up outside the gate to Bag End  neat burrows dug into the grassy hillside with round doors and cute front gardens  The hobbits live in Hobbit holes  Frodo stands up in the cart as Gandalf reins in the horse  Gandalf smiles to himself wellpleased with his joke and even Odo Proudfoot is unable to suppress a chuckle  Gandalf ignores the children's cries but as they stand deflated watching Gandalf disappear up the lane spinning balls of bright color suddenly leap out of the cart fizzing over the heads of the delighted children  excited children chase after the cart  As the cart rattles into the small village of Hobbiton a quaint rustic settlement nestled amongst rolling green hills and large trees  Odo Proudfoot looks up as the cart passes by deeply suspicious  Hobbits look up exclaiming in wonder and excitement as the cart bearing Gandalf and Frodo rolls past the Green Dragon Inn towards the party field where scores of hobbits are busy preparing for the big night  Gandalf surveys the peaceful scene before him  The cart rattles over a stone bridge towards a busy hobbit marketplace  The cart rattles past a field lupin being tended by Gandalf who looks down at Frodo with a twinkle in his eye  They look at each other a moment then both start laughing as Frodo's face breaks into a smile and he leaps onto the front seat of the cart  Suddenly Frodo appears on a bank above the cart  camera tracks to a figure lying beneath the dappled sunlight of an old tree  Shire 60 years later  The shambling old pony snorts and rears  A cart rattles along a leafy lane driven by a stooped figure in grey  Tossing away the long stem of grass in his mouth Frodo runs off  This is Frodo Baggins his eyes alight with excitement  The figure in the grass sits up looking straight at the camera revealing a handsome young hobbit with dark curly hair and deep blue eyes  the figure is reading a book  Resting on a small rock rising out of the long overgrown white flowers scattered among wellseeded grasses an idyllic setting at the end of a long hot summer "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "the figure is reading a book Resting on a small rock rising out of the long overgrown white flowers scattered among wellseeded grasses an idyllic setting at the end of a long hot summer This is Frodo Baggins his eyes alight with excitement The figure in the grass sits up looking straight at the camera revealing a handsome young hobbit with dark curly hair and deep blue eyes A cart rattles along a leafy lane driven by a stooped figure in grey Tossing away the long stem of grass in his mouth Frodo runs off Shire 60 years later The shambling old pony snorts and rears Suddenly Frodo appears on a bank above the cart camera tracks to a figure lying beneath the dappled sunlight of an old tree The cart rattles past a field lupin being tended by Gandalf who looks down at Frodo with a twinkle in his eye They look at each other a moment then both start laughing as Frodo's face breaks into a smile and he leaps onto the front seat of the cart Gandalf surveys the peaceful scene before him The cart rattles over a stone bridge towards a busy hobbit marketplace Odo Proudfoot looks up as the cart passes by deeply suspicious Hobbits look up exclaiming in wonder and excitement as the cart bearing Gandalf and Frodo rolls past the Green Dragon Inn towards the party field where scores of hobbits are busy preparing for the big night excited children chase after the cart As the cart rattles into the small village of Hobbiton a quaint rustic settlement nestled amongst rolling green hills and large trees Gandalf smiles to himself wellpleased with his joke and even Odo Proudfoot is unable to suppress a chuckle Gandalf ignores the children's cries but as they stand deflated watching Gandalf disappear up the lane spinning balls of bright color suddenly leap out of the cart fizzing over the heads of the delighted children The hobbits live in Hobbit holes Frodo stands up in the cart as Gandalf reins in the horse Gandalf's cart pulls up outside the gate to Bag End neat burrows dug into the grassy hillside with round doors and cute front gardens He raises his staff and raps on the front door and a voice calls out a particularly fine example of a hobbit hole with a large round front door set into a grassy hillside a hobbit of indeterminate age with a mischievous twinkle in his eye Suddenly the door opens and Bilbo Baggins stands before him the eccentric gentleman Wearing a dashing brocade waistcoat he looks every inch Gandalf drops to his knee to embrace his old friend"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "As the cart rattles into the small village of Hobbiton a quaint rustic settlement nestled amongst rolling green hills and large trees  excited children chase after the cart  Gandalf ignores the children's cries but as they stand deflated watching Gandalf disappear up the lane spinning balls of bright color suddenly leap out of the cart fizzing over the heads of the delighted children  Gandalf smiles to himself wellpleased with his joke and even Odo Proudfoot is unable to suppress a chuckle  Frodo stands up in the cart as Gandalf reins in the horse  The hobbits live in Hobbit holes  neat burrows dug into the grassy hillside with round doors and cute front gardens  Gandalf's cart pulls up outside the gate to Bag End  a particularly fine example of a hobbit hole with a large round front door set into a grassy hillside  He raises his staff and raps on the front door and a voice calls out  Suddenly the door opens and Bilbo Baggins stands before him  a hobbit of indeterminate age with a mischievous twinkle in his eye  Wearing a dashing brocade waistcoat he looks every inch  the eccentric gentleman  Gandalf drops to his knee to embrace his old friend Resting on a small rock rising out of the long overgrown white flowers scattered among wellseeded grasses an idyllic setting at the end of a long hot summer  the figure is reading a book  The figure in the grass sits up looking straight at the camera revealing a handsome young hobbit with dark curly hair and deep blue eyes  This is Frodo Baggins his eyes alight with excitement  Tossing away the long stem of grass in his mouth Frodo runs off  A cart rattles along a leafy lane driven by a stooped figure in grey  The shambling old pony snorts and rears  Shire 60 years later  camera tracks to a figure lying beneath the dappled sunlight of an old tree  Suddenly Frodo appears on a bank above the cart  They look at each other a moment then both start laughing as Frodo's face breaks into a smile and he leaps onto the front seat of the cart  The cart rattles past a field lupin being tended by Gandalf who looks down at Frodo with a twinkle in his eye  The cart rattles over a stone bridge towards a busy hobbit marketplace  Gandalf surveys the peaceful scene before him  Hobbits look up exclaiming in wonder and excitement as the cart bearing Gandalf and Frodo rolls past the Green Dragon Inn towards the party field where scores of hobbits are busy preparing for the big night  Odo Proudfoot looks up as the cart passes by deeply suspicious "
        }
      ]
    }
  ]
}