{
  "ground_truth": "Gandalf looks at him more keenly as Bilbo leads Gandalf into Bag End, which is cozy and cluttered with souvenirs of Bilbo's travels. Gandalf has to stoop to avoid hitting his head on the low ceiling. Bilbo hangs up Gandalf's hat on a peg and trots off down the hall, disappearing into the kitchen as Gandalf looks around, enjoying the familiarity of Bag End. He turns, knocking his head on the light and then walking into the wooden beam, groaning. Gandalf stops in front of a framed map, charred in one corner; it is Thorin's map of the Lonely Mountain, and Gandalf smiles to himself. Gandalf watches amused as Bilbo tries to hide, and Bilbo's fingers close around his waistcoat pocket, gripping a small, unseen object. Gandalf and Bilbo are sitting on the Bag End porch, and below them, final preparations are being made on the Party field. Bilbo blows a perfect smoke ring and watches it rise into the air, as a tiny sailing ship with masts and sails glides through the center of Bilbo's smoke ring. Glowing flowers rain down from branches, evaporating just above the upturned faces of the delighted party-goers, with 144 Hobbits feasting and drinking. Carts of beer and wine are scattered about, and the tables are piled high with steaming scones and savories. Bilbo is greeting visitors while Frodo and Sam sit at a table drinking ale. Frodo notices Sam's eyes keep flicking to another pretty Hobbit, Rosie Cotton, sitting some distance away. Sam goes to drain his glass, but suddenly it is snatched out of his hands as Frodo thrusts him into the middle of a passing throng of dancers as he is swept away. Frodo laughs and finishes Sam's beer, while Gandalf sets alight a particularly spectacular firework that draws gasps of admiration from the party guests. Bilbo relates stories of his adventure to a group of young hobbit children, and with their upturned faces, their eyes grow larger and larger. Stunned gasps from his young audience greet his astonishing feat! Merry and Pippin, two mischievous young Hobbits in their late teens, are present, and Pippin scrambles onto the back of Gandalf's wagon, snatching up a small firework. Gandalf hurries about, lighting fireworks with a blue spark that dances magically from his staff. Large hands suddenly clamp down on Merry and Pippin's ears, as Gandalf looks down sternly. They are later seen leaning over a barrel, washing dishes in soapy water with Gandalf sitting nearby, smoking his pipe and sipping an ale. Bilbo steps on a stool, bowing in gratitude at the applause, with Frodo and Gandalf smiling to themselves. Bilbo's hand pulls something out of his waistcoat pocket and holds it behind his back as a strange hum seems to fill his head. Bilbo gives Gandalf a look and nods toward the mantelpiece.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Gandalf gazes at him more intently as Bilbo guides Gandalf into Bag End, which is snug and cluttered with mementos of Bilbo's journeys. Gandalf must bend to avoid striking his cranium on the low roof. Bilbo hangs up Gandalf's hat on a hook and trots off down the corridor, disappearing into the kitchen as Gandalf looks around, savoring the familiarity of Bag End. He turns, bumping his cranium on the lamp and then walking into the wooden beam, groaning. Gandalf stops in front of a framed chart, scorched in one corner; it is Thorin's chart of the Lonely Mountain, and Gandalf grins to himself. Gandalf observes amused as Bilbo attempts to conceal, and Bilbo's fingers close around his waistcoat pocket, clutching a diminutive, hidden item. Gandalf and Bilbo are sitting on the Bag End porch, and below them, final arrangements are being made on the Party field. Bilbo exhales a flawless smoke loop and watches it ascend into the air, as a tiny sailing vessel with masts and sails glides through the middle of Bilbo's smoke loop. Luminous blossoms rain down from branches, evaporating just above the uplifted faces of the delighted revelers, with 144 Hobbits feasting and imbibing. Carts of ale and wine are scattered about, and the tables are piled high with steaming scones and savories. Bilbo is greeting guests while Frodo and Sam sit at a table drinking ale. Frodo notices Sam's eyes keep flicking to another pretty Hobbit, Rosie Cotton, sitting some distance away. Sam goes to drain his glass, but suddenly it is snatched out of his hands as Frodo thrusts him into the middle of a passing throng of dancers as he is swept away. Frodo chuckles and finishes Sam's ale, while Gandalf sets alight a particularly spectacular firework that draws gasps of admiration from the party attendees. Bilbo narrates tales of his quest to a group of young hobbit children, and with their uplifted faces, their eyes grow larger and larger. Astonished gasps from his youthful audience greet his remarkable feat! Merry and Pippin, two mischievous young Hobbits in their late teens, are present, and Pippin scrambles onto the back of Gandalf's wagon, grabbing a small firework. Gandalf hurries about, igniting fireworks with a blue spark that dances magically from his staff. Large hands suddenly clamp down on Merry and Pippin's ears, as Gandalf looks down sternly. They are later seen leaning over a barrel, washing dishes in soapy water with Gandalf sitting nearby, smoking his pipe and sipping an ale. Bilbo steps on a stool, bowing in gratitude at the applause, with Frodo and Gandalf smiling to themselves. Bilbo's hand pulls something out of his waistcoat pocket and holds it behind his back as a strange hum seems to fill his cranium. Bilbo gives Gandalf a look and nods toward the mantelpiece."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Gandalf is looked at more keenly by him as Gandalf is led by Bilbo into Bag End, which is cozy and cluttered with souvenirs of Bilbo's travels. The low ceiling has to be stooped under by Gandalf to avoid hitting his head. Gandalf's hat is hung up by Bilbo on a peg, and then Bilbo trots off down the hall, disappearing into the kitchen while Gandalf looks around, enjoying the familiarity of Bag End. He turns, knocking his head on the light and then walking into the wooden beam, groaning. A framed map, charred in one corner, stops Gandalf; it is Thorin's map of the Lonely Mountain, and to himself, a smile is made by Gandalf. Amusement is watched by Gandalf as Bilbo tries to hide, and around his waistcoat pocket, Bilbo's fingers close, gripping a small, unseen object. Gandalf and Bilbo sit on the Bag End porch, and below them, they make final preparations on the Party field. A perfect smoke ring is blown by Bilbo, and it is watched as it rises into the air, with a tiny sailing ship with masts and sails gliding through the center of Bilbo's smoke ring. Glowing flowers rain down from branches, evaporating just above the upturned faces of the delighted party-goers, with 144 Hobbits feasting and drinking. Beer and wine carts are scattered about, and steaming scones and savories pile high on the tables. Visitors are greeted by Bilbo while Frodo and Sam sit at a table drinking ale. Sam's eyes keep flicking to another pretty Hobbit, Rosie Cotton, sitting some distance away, and it is noticed by Frodo. Sam goes to drain his glass, but it is suddenly snatched out of his hands as he is thrust by Frodo into the middle of a passing throng of dancers, sweeping him away. Sam's beer is finished by Frodo, who laughs, while Gandalf sets alight a particularly spectacular firework that draws gasps of admiration from the party guests. To a group of young hobbit children, Bilbo relates stories of his adventure, and with their upturned faces, their eyes grow larger and larger. Stunned gasps from his young audience greet his astonishing feat! Merry and Pippin, two mischievous young Hobbits in their late teens, are present, and a small firework is snatched up by Pippin as he scrambles onto the back of Gandalf's wagon. Fireworks are hurriedly lit by Gandalf with a blue spark that dances magically from his staff. Large hands suddenly clamp down on the ears of Merry and Pippin as Gandalf looks down sternly. Later, they are seen leaning over a barrel, washing dishes in soapy water with Gandalf sitting nearby, smoking his pipe and sipping an ale. A stool is stepped on by Bilbo, who bows in gratitude at the applause, with Frodo and Gandalf smiling to themselves. Out of his waistcoat pocket, something is pulled by Bilbo and held behind his back as a strange hum seems to fill his head. Gandalf is given a look by Bilbo, who nods toward the mantelpiece."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Gandalf observes Bilbo keenly as they enter Bag End, cluttered with travel souvenirs. Gandalf stoops to avoid the low ceiling. Bilbo hangs Gandalf's hat and heads to the kitchen, while Gandalf enjoys the familiar surroundings, accidentally hitting his head on a beam. He stops at Thorin's charred map of the Lonely Mountain, smiling. Amused, Gandalf watches Bilbo grip a small object in his pocket. On the porch, they see final preparations on the Party field. Bilbo blows a smoke ring, through which a tiny ship sails. Glowing flowers rain down on 144 Hobbits feasting and drinking, with carts of beer and tables of scones. Bilbo greets visitors as Frodo and Sam drink ale. Sam's eyes flick to Rosie Cotton, and Frodo pushes him into dancing throngs, finishing Sam's beer. Gandalf lights a spectacular firework, impressing guests. Bilbo tells adventure stories to young hobbits, who gasp in awe. Mischievous Merry and Pippin grab a firework from Gandalf's wagon. Gandalf lights fireworks with a magical blue spark. He sternly catches Merry and Pippin, who later wash dishes as Gandalf smokes and drinks. Bilbo bows to applause, with Frodo and Gandalf smiling. Bilbo discreetly pulls something from his pocket, nodding at Gandalf."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Gandalf keenly observes Bilbo as he leads him into Bag End, cluttered with travel souvenirs. Gandalf stoops to avoid the low ceiling. Bilbo hangs Gandalf's hat and disappears into the kitchen while Gandalf enjoys Bag End's familiarity, accidentally hitting his head. He stops at Thorin's charred map of the Lonely Mountain, smiling. Amused, Gandalf watches Bilbo hide something in his pocket. On the porch, they see final Party field preparations. Bilbo blows a smoke ring, through which a tiny ship sails. Glowing flowers rain down on 144 feasting Hobbits. Bilbo greets visitors, while Frodo and Sam drink ale. Sam's eyes flick to Rosie Cotton, and Frodo pushes him into dancing throngs, finishing Sam's beer. Gandalf lights a spectacular firework, impressing guests. Bilbo tells adventure stories to wide-eyed children. Merry and Pippin mischievously grab a firework from Gandalf's wagon. Gandalf lights fireworks with his staff's blue spark, catching Merry and Pippin, who later wash dishes. Bilbo bows to applause, with Frodo and Gandalf smiling. Bilbo discreetly pulls something from his pocket, nodding at Gandalf."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Gandalf, with a more intense and scrutinizing gaze, observes Bilbo as he leads him into the inviting and somewhat cluttered interior of Bag End. This cozy hobbit hole is filled with an array of souvenirs and mementos from Bilbo's numerous travels and adventures. As they enter, Gandalf, being much taller than the average hobbit, has to bend down slightly to avoid bumping his head on the low ceiling. Bilbo, with a cheerful demeanor, takes Gandalf's hat and hangs it neatly on a peg before trotting off down the hallway. He soon disappears into the kitchen, leaving Gandalf to look around and soak in the comforting and familiar atmosphere of Bag End. As Gandalf turns, he accidentally knocks his head on a hanging light and then walks into a wooden beam, letting out a groan of mild frustration. \n\nPausing in front of a framed map, which is slightly charred at one corner, Gandalf recognizes it as Thorin's map of the Lonely Mountain. A smile of nostalgia and amusement spreads across his face. Meanwhile, Gandalf watches with a twinkle in his eye as Bilbo, trying to be discreet, attempts to hide something. Bilbo's fingers curl around his waistcoat pocket, gripping a small, unseen object with a sense of secrecy. Later, Gandalf and Bilbo find themselves sitting comfortably on the porch of Bag End, observing the bustling activity below them. Final preparations are underway on the Party field, where Bilbo skillfully blows a perfect smoke ring, watching it ascend into the air. A tiny sailing ship, complete with masts and sails, magically glides through the center of Bilbo's smoke ring. \n\nIn the party field, glowing flowers descend gently from the branches, evaporating just above the upturned faces of the delighted party-goers. Among them, 144 Hobbits are joyfully feasting and drinking. Carts laden with beer and wine are scattered about, while tables are piled high with steaming scones and savory treats. Bilbo is busy greeting visitors, while Frodo and Sam sit together at a table, enjoying their ale. Frodo notices that Sam's eyes keep darting toward a pretty Hobbit, Rosie Cotton, who is seated some distance away. As Sam goes to take a sip from his glass, Frodo mischievously snatches it away and thrusts Sam into the midst of a passing throng of dancers, where he is swept away by the lively crowd. Frodo laughs heartily and finishes Sam's beer, while Gandalf sets off a particularly spectacular firework that elicits gasps of admiration from the party guests.\n\nBilbo, surrounded by a group of young hobbit children, regales them with tales of his adventurous exploits. The children's faces are upturned, their eyes growing larger and larger with wonder and amazement. Stunned gasps escape from his young audience as they are captivated by his astonishing feats. Meanwhile, Merry and Pippin, two mischievous young Hobbits in their late teens, are present at the festivities. Pippin, with a gleam of mischief in his eye, scrambles onto the back of Gandalf's wagon and snatches up a small firework. Gandalf, moving swiftly, lights fireworks with a blue spark that dances magically from his staff. Suddenly, large hands clamp down on Merry and Pippin's ears as Gandalf looks down at them with a stern expression. Later, the two are seen leaning over a barrel, dutifully washing dishes in soapy water, while Gandalf sits nearby, contentedly smoking his pipe and sipping an ale.\n\nAs the festivities continue, Bilbo steps onto a stool, bowing in gratitude at the applause from the gathered crowd, with Frodo and Gandalf smiling to themselves. Bilbo's hand reaches into his waistcoat pocket, pulling out something and holding it behind his back as a strange hum seems to fill his head. With a meaningful look, Bilbo gives Gandalf a nod, gesturing toward the mantelpiece."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Gandalf, with an even more intense and scrutinizing gaze than usual, observes Bilbo as he graciously leads him into the inviting and somewhat cluttered interior of Bag End, the cozy hobbit hole that is famously filled with an impressive array of souvenirs and cherished mementos from Bilbo's numerous travels and grand adventures. As they cross the threshold and enter, Gandalf, who is much taller than the average hobbit, has to bend down slightly to avoid accidentally bumping his head on the perpetually low ceiling typical of hobbit homes. Bilbo, maintaining a cheerful demeanor, takes Gandalf's hat with a friendly gesture and hangs it neatly on a peg before trotting off down the hallway with a brisk step. He soon disappears entirely into the kitchen, leaving Gandalf to look around and soak in the comforting and familiar atmosphere that is so characteristic of Bag End. As Gandalf turns to take everything in, he accidentally knocks his head on a hanging light and then walks into a wooden beam, letting out a groan of mild frustration at these minor inconveniences.\n\nPausing thoughtfully in front of a framed map, which is slightly charred at one corner, Gandalf instantly recognizes it as the renowned map belonging to Thorin, depicting the Lonely Mountain. A smile of nostalgia and amusement begins to spread across his face. Meanwhile, Gandalf watches with a twinkle in his eye as Bilbo, with an air of secrecy, tries to be discreet while he attempts to hide something. Bilbo's fingers curl protectively around his waistcoat pocket, gripping a small, unseen object with a palpable sense of secrecy. Later on, Gandalf and Bilbo find themselves sitting comfortably on the inviting porch of Bag End, observing the bustling activity taking place below them. Final preparations are underway on the Party field, where Bilbo skillfully blows a perfect smoke ring, watching with satisfaction as it ascends into the air. A tiny sailing ship, complete with meticulously crafted masts and sails, magically glides through the very center of Bilbo's delicate smoke ring.\n\nIn the lively party field, glowing flowers begin to descend gently from the branches above, evaporating just above the upturned faces of the delighted party-goers. Among them, a total of 144 Hobbits are joyfully feasting and drinking with great gusto. Carts laden with barrels of beer and bottles of wine are scattered about, while tables are piled high with steaming scones and an assortment of savory treats. Bilbo is busy warmly greeting visitors, while Frodo and Sam sit together at a nearby table, thoroughly enjoying their ale. Frodo notices that Sam's eyes keep darting with interest toward a pretty Hobbit, Rosie Cotton, who is seated some distance away. As Sam goes to take a sip from his glass, Frodo mischievously snatches it away and thrusts Sam into the midst of a passing throng of dancers, where he is swept away by the lively and joyful crowd. Frodo laughs heartily and finishes Sam's beer, while Gandalf sets off a particularly spectacular firework that elicits gasps of pure admiration from the party guests.\n\nBilbo, surrounded by a group of young hobbit children, regales them with captivating tales of his adventurous exploits. The children's faces are upturned, their eyes growing larger and larger with wonder and amazement at the stories. Stunned gasps escape from his young audience as they are thoroughly captivated by his astonishing feats. Meanwhile, Merry and Pippin, two mischievous young Hobbits in their late teens, are present at the festivities. Pippin, with a gleam of mischief in his eye, scrambles onto the back of Gandalf's wagon and snatches up a small firework. Gandalf, moving with unexpected swiftness, lights fireworks with a blue spark that dances magically from the end of his staff. Suddenly, large hands clamp down on Merry and Pippin's ears as Gandalf looks down at them with a stern and disapproving expression. Later, the two are seen leaning over a wooden barrel, dutifully washing dishes in soapy water, while Gandalf sits nearby, contentedly smoking his pipe and sipping an ale with satisfaction.\n\nAs the festivities continue to unfold, Bilbo steps confidently onto a stool, bowing in gratitude at the applause from the gathered crowd, with Frodo and Gandalf smiling to themselves at the display. Bilbo's hand reaches into his waistcoat pocket, pulling out something important and holding it behind his back as a strange hum seems to fill his head. With a meaningful look directed at Gandalf, Bilbo gives him a nod, silently gesturing toward the mantelpiece."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Gandalf fixes his gaze more intently on Bilbo as the hobbit leads him into Bag End, a cozy abode filled with an array of souvenirs from Bilbo's various travels. As they enter, Gandalf must bend forward slightly to avoid bumping his head against the low ceiling. Bilbo carefully takes Gandalf's hat and hangs it on a peg before trotting off down the hallway, his footsteps echoing softly as he disappears into the kitchen. Meanwhile, Gandalf takes a moment to look around, soaking in the familiar atmosphere of Bag End. As he turns, he accidentally knocks his head on a hanging light and then walks straight into a wooden beam, letting out a groan of discomfort. Pausing in front of a framed map with a charred corner, Gandalf recognizes it as Thorin's map of the Lonely Mountain and smiles to himself, lost in thought. His attention is drawn back to Bilbo, who is amusingly trying to hide something, his fingers curling tightly around an unseen object in his waistcoat pocket. Later, Gandalf and Bilbo find themselves sitting on the porch of Bag End, observing the final preparations being made on the Party field below. Bilbo expertly blows a perfect smoke ring, watching it ascend into the air as a tiny sailing ship with masts and sails magically glides through its center. Meanwhile, glowing flowers descend from the branches, evaporating just above the upturned faces of the delighted party-goers, where 144 Hobbits are feasting and drinking. Scattered carts of beer and wine complement tables piled high with steaming scones and savory treats. Bilbo is busy greeting visitors, while Frodo and Sam sit at a table, sipping ale. Frodo notices Sam's eyes frequently darting toward another pretty Hobbit, Rosie Cotton, who is seated some distance away. As Sam goes to take a sip from his glass, Frodo suddenly snatches it away and playfully thrusts Sam into the midst of a passing throng of dancers, where he is swept away by the crowd. Frodo laughs heartily and finishes Sam's beer, while Gandalf sets off a particularly spectacular firework that elicits gasps of admiration from the party guests. Bilbo captivates a group of young hobbit children with tales of his adventures, their eyes widening with each astonishing feat he recounts. Merry and Pippin, two mischievous young Hobbits in their late teens, are also present, with Pippin clambering onto the back of Gandalf's wagon to snatch a small firework. Gandalf moves swiftly, lighting fireworks with a blue spark that dances magically from his staff. Suddenly, large hands clamp down on Merry and Pippin's ears as Gandalf looks down at them sternly. Later, they are seen leaning over a barrel, washing dishes in soapy water, while Gandalf sits nearby, contentedly smoking his pipe and sipping an ale. Bilbo steps onto a stool, bowing in gratitude at the applause from the crowd, with Frodo and Gandalf smiling to themselves. Bilbo's hand reaches into his waistcoat pocket, pulling out an object that he holds behind his back as a strange hum seems to fill his head. He gives Gandalf a meaningful look and nods toward the mantelpiece, hinting at something significant."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Gandalf follows Bilbo into the cozy, cluttered Bag End, ducking to avoid the low ceiling. Bilbo hangs Gandalf's hat and heads to the kitchen, while Gandalf takes in the familiar surroundings, accidentally bumping his head on a light and a beam. He pauses to admire Thorin's charred map of the Lonely Mountain, smiling to himself. Observing Bilbo's attempt to hide something in his waistcoat pocket, Gandalf remains amused. Later, they sit on the porch, watching the final preparations for the party below. Bilbo blows a smoke ring, through which a tiny ship sails, as glowing flowers rain down on the delighted party-goers. The field is lively with 144 Hobbits feasting, drinking, and carts of beer and wine scattered about. Bilbo greets visitors while Frodo and Sam drink ale, with Sam's attention drawn to Rosie Cotton. Frodo playfully pushes Sam into a group of dancers, then finishes Sam's beer. Gandalf lights a spectacular firework, impressing the guests. Bilbo entertains young hobbits with adventure stories, their eyes widening in amazement. Meanwhile, Merry and Pippin mischievously grab a firework from Gandalf's wagon. Gandalf lights fireworks with a magical blue spark, later catching Merry and Pippin, who end up washing dishes as he smokes his pipe nearby. Bilbo, receiving applause, bows on a stool, with Frodo and Gandalf smiling. He discreetly retrieves something from his pocket, holding it behind his back as a strange hum fills his head, exchanging a knowing look with Gandalf."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Gandalf looks at him more keenly as Bilbo, who is renowned for his unexpected journey with a group of dwarves to reclaim their homeland, leads Gandalf into Bag End, the ancestral home of the Baggins family, which is cozy and cluttered with souvenirs of Bilbo's travels, including artifacts from lands as diverse as Rivendell and the Lonely Mountain. Gandalf, a Maia spirit who took the form of a wizard sent to Middle-earth to help guide its inhabitants, has to stoop to avoid hitting his head on the low ceiling characteristic of Hobbit homes. Bilbo hangs up Gandalf's hat on a peg and trots off down the hall, disappearing into the kitchen as Gandalf looks around, enjoying the familiarity of Bag End, which has become like a second home to him. He turns, knocking his head on the light and then walking into the wooden beam, groaning in the way only a wizard used to grand halls might. Gandalf stops in front of a framed map, charred in one corner; it is Thorin's map of the Lonely Mountain, which detailed secret passages into the dragon's lair, and Gandalf smiles to himself, remembering the great adventure. Gandalf watches amused as Bilbo tries to hide, and Bilbo's fingers close around his waistcoat pocket, gripping a small, unseen object that is, unbeknownst to many, the One Ring, a powerful and dangerous artifact. Gandalf and Bilbo are sitting on the Bag End porch, and below them, final preparations are being made on the Party field, the site of Bilbo's extravagant eleventy-first birthday celebration. Bilbo blows a perfect smoke ring, a skill he perfected over many years, and watches it rise into the air, as a tiny sailing ship with masts and sails, enchanted to amuse the guests, glides through the center of Bilbo's smoke ring. Glowing flowers rain down from branches, evaporating just above the upturned faces of the delighted party-goers, with 144 Hobbits feasting and drinking in honor of Bilbo's 111th birthday, a special milestone known as a \"long life\" in Hobbit tradition. Carts of beer and wine are scattered about, and the tables are piled high with steaming scones and savories, showcasing the Hobbits' love for good food and drink. Bilbo is greeting visitors while Frodo and Sam sit at a table drinking ale, a staple in Hobbiton inns. Frodo notices Sam's eyes keep flicking to another pretty Hobbit, Rosie Cotton, the barmaid who works at The Green Dragon Inn, sitting some distance away. Sam goes to drain his glass, but suddenly it is snatched out of his hands as Frodo thrusts him into the middle of a passing throng of dancers as he is swept away, a playful gesture among friends. Frodo laughs and finishes Sam's beer, while Gandalf, known for his fireworks that rival the finest displays in Middle-earth, sets alight a particularly spectacular firework that draws gasps of admiration from the party guests. Bilbo relates stories of his adventure to a group of young hobbit children, tales of trolls and treasure that have become local legend, and with their upturned faces, their eyes grow larger and larger. Stunned gasps from his young audience greet his astonishing feat of tricking the dragon Smaug! Merry and Pippin, two mischievous young Hobbits in their late teens who are known for their playful antics and adventurous spirits, are present, and Pippin scrambles onto the back of Gandalf's wagon, snatching up a small firework, an act typical of their youthful curiosity. Gandalf hurries about, lighting fireworks with a blue spark that dances magically from his staff, a relic gifted to him by the elves. Large hands suddenly clamp down on Merry and Pippin's ears, as Gandalf looks down sternly, showing his patience with the young but reminding them of the importance of safety. They are later seen leaning over a barrel, washing dishes in soapy water with Gandalf sitting nearby, smoking his pipe crafted from Old Toby's finest, and sipping an ale, enjoying the familiar comforts of Hobbit hospitality. Bilbo steps on a stool, bowing in gratitude at the applause, with Frodo and Gandalf smiling to themselves, proud of their eccentric elder. Bilbo's hand pulls something out of his waistcoat pocket and holds it behind his back as a strange hum seems to fill his head, the power of the Ring exerting its influence once again. Bilbo gives Gandalf a look and nods toward the mantelpiece, a gesture indicating the place where their most secret conversations occur."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Gandalf looks at him more keenly as Bilbo leads Gandalf into Bag End which is cozy and cluttered with souvenirs of Bilbo's travels  Gandalf has to stoop to avoid hitting his head on the low ceiling  Bilbo hangs up Gandalf's hat on a peg and trots off down the hall disappearing into the kitchen as Gandalf looks around enjoying the familiarity of Bag End  Bilbo blows a perfect smoke ring and watches it rise into the air as a tiny sailing ship with masts and sails glides through the center of Bilbo's smoke ring  Glowing flowers rain down from branches evaporating just above the upturned faces of the delighted partygoers with 144 Hobbits feasting and drinking  Carts of beer and wine are scattered about and the tables are piled high with steaming scones and savories  Bilbo is greeting visitors while Frodo and Sam sit at a table drinking ale  Frodo notices Sam's eyes keep flicking to another pretty Hobbit Rosie Cotton sitting some distance away  Sam goes to drain his glass but suddenly it is snatched out of his hands as Frodo thrusts him into the middle of a passing throng of dancers as he is swept away  Frodo laughs and finishes Sam's beer while Gandalf sets alight a particularly spectacular firework that draws gasps of admiration from the party guests  Bilbo relates stories of his adventure to a group of young hobbit children and with their upturned faces their eyes grow larger and larger  Stunned gasps from his young audience greet his astonishing feat Merry and Pippin two mischievous young Hobbits in their late teens are present and Pippin scrambles onto the back of Gandalf's wagon snatching up a small firework  Gandalf hurries about lighting fireworks with a blue spark that dances magically from his staff  Large hands suddenly clamp down on Merry and Pippin's ears as Gandalf looks down sternly  They are later seen leaning over a barrel washing dishes in soapy water with Gandalf sitting nearby smoking his pipe and sipping an ale  Bilbo steps on a stool bowing in gratitude at the applause  He turns knocking his head on the light and then walking into the wooden beam  groaning  Gandalf stops in front of a framed map charred in one corner  it is Thorin's map of the Lonely Mountain and Gandalf smiles to himself  Gandalf watches amused as Bilbo tries to hide and Bilbo's fingers close around his waistcoat pocket gripping a small unseen object  Gandalf and Bilbo are sitting on the Bag End porch and below them final preparations are being made  on the Party field  Bilbo blows a perfect smoke ring and watches it rise into the air as a tiny sailing ship with masts and sails glides through the center of Bilbo's smoke ring  Glowing flowers rain down from branches evaporating just above the upturned faces of the delighted partygoers with 144 Hobbits feasting and drinking  Carts of beer and wine are scattered about and the tables are piled high with steaming scones and savories  Bilbo is greeting visitors while Frodo and Sam sit at a table drinking ale  Frodo notices Sam's eyes keep flicking to another pretty Hobbit Rosie Cotton sitting some distance away  Sam goes to drain his glass but suddenly it is snatched out of his hands as Frodo thrusts him into the middle of a passing throng of dancers as he is swept away  Frodo laughs and finishes Sam's beer while Gandalf sets alight a particularly spectacular firework that draws gasps of admiration from the party guests  Bilbo relates stories of his adventure to a group of young hobbit children and with their upturned faces their eyes grow larger and larger  Stunned gasps from his young audience greet his astonishing feat Merry and Pippin two mischievous young Hobbits in their late teens are present and Pippin scrambles onto the back of Gandalf's wagon snatching up a small firework  Gandalf hurries about lighting fireworks with a blue spark that dances magically from his staff  Large hands suddenly clamp down on Merry and Pippin's ears as Gandalf looks down sternly  They are later seen leaning over a barrel washing dishes in soapy water with Gandalf sitting nearby smoking his pipe and sipping an ale  Bilbo steps on a stool bowing in gratitude at the applause  with Frodo and Gandalf smiling to themselves  Bilbo's hand pulls something out of his waistcoat pocket and holds it behind his back as a strange hum seems to fill his head  Bilbo gives Gandalf a look and nods toward the mantelpiece"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Gandalf looks at him more keenly as Bilbo leads Gandalf into Bag End which is cozy and cluttered with souvenirs of Bilbo's travels. Gandalf has to stoop to avoid hitting his head on the low ceiling. Bilbo hangs up Gandalf's hat on a peg and trots off down the hall disappearing into the kitchen as Gandalf looks around enjoying the familiarity of Bag End. He turns knocking his head on the light and then walking into the wooden beam. groaning. Gandalf stops in front of a framed map charred in one corner. it is Thorin's map of the Lonely Mountain and Gandalf smiles to himself. Gandalf watches amused as Bilbo tries to hide and Bilbo's fingers close around his waistcoat pocket gripping a small unseen object. Gandalf and Bilbo are sitting on the Bag End porch and below them final preparations are being made. on the Party field. Bilbo blows a perfect smoke ring and watches it rise into the air as a tiny sailing ship with masts and sails glides through the center of Bilbo's smoke ring. Glowing flowers rain down from branches evaporating just above the upturned faces of the delighted partygoers with 144 Hobbits feasting and drinking. Carts of beer and wine are scattered about and the tables are piled high with steaming scones and savories. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Bilbo is greeting visitors while Frodo and Sam sit at a table drinking ale. Frodo notices Sam's eyes keep flicking to another pretty Hobbit Rosie Cotton sitting some distance away. Sam goes to drain his glass but suddenly it is snatched out of his hands as Frodo thrusts him into the middle of a passing throng of dancers as he is swept away. Frodo laughs and finishes Sam's beer while Gandalf sets alight a particularly spectacular firework that draws gasps of admiration from the party guests. Bilbo relates stories of his adventure to a group of young hobbit children and with their upturned faces their eyes grow larger and larger. Stunned gasps from his young audience greet his astonishing feat Merry and Pippin two mischievous young Hobbits in their late teens are present and Pippin scrambles onto the back of Gandalf's wagon snatching up a small firework. Gandalf hurries about lighting fireworks with a blue spark that dances magically from his staff. Large hands suddenly clamp down on Merry and Pippin's ears as Gandalf looks down sternly. They are later seen leaning over a barrel washing dishes in soapy water with Gandalf sitting nearby smoking his pipe and sipping an ale. Bilbo steps on a stool bowing in gratitude at the applause. with Frodo and Gandalf smiling to themselves. Bilbo's hand pulls something out of his waistcoat pocket and holds it behind his back as a strange hum seems to fill his head. Bilbo gives Gandalf a look and nods toward the mantelpiece."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Gandalf looks at him more keenly as Bilbo leads Gandalf into Bag End which is cozy and cluttered with souvenirs of Bilbo's travels. Gandalf has to stoop to avoid hitting his head on the low ceiling. Bilbo hangs up Gandalf's hat on a peg and trots off down the hall disappearing into the kitchen as Gandalf looks around enjoying the familiarity of Bag End. He turns knocking his head on the light and then walking into the wooden beam. groaning. Gandalf stops in front of a framed map charred in one corner. it is Thorin's map of the Lonely Mountain and Gandalf smiles to himself. Gandalf watches amused as Bilbo tries to hide and Bilbo's fingers close around his waistcoat pocket gripping a small unseen object. Gandalf and Bilbo are sitting on the Bag End porch and below them final preparations are being made. on the Party field. Bilbo blows a perfect smoke ring and watches it rise into the air as a tiny sailing ship with masts and sails glides through the center of Bilbo's smoke ring. Glowing flowers rain down from branches evaporating just above the upturned faces of the delighted partygoers with 144 Hobbits feasting and drinking. Carts of beer and wine are scattered about and the tables are piled high with steaming scones and savories. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Bilbo is greeting visitors while Frodo and Sam sit at a table drinking ale. Frodo notices Sam's eyes keep flicking to another pretty Hobbit Rosie Cotton sitting some distance away. Sam goes to drain his glass but suddenly it is snatched out of his hands as Frodo thrusts him into the middle of a passing throng of dancers as he is swept away. Frodo laughs and finishes Sam's beer while Gandalf sets alight a particularly spectacular firework that draws gasps of admiration from the party guests. Bilbo relates stories of his adventure to a group of young hobbit children and with their upturned faces their eyes grow larger and larger. Stunned gasps from his young audience greet his astonishing feat Merry and Pippin two mischievous young Hobbits in their late teens are present and Pippin scrambles onto the back of Gandalf's wagon snatching up a small firework. Gandalf hurries about lighting fireworks with a blue spark that dances magically from his staff. Large hands suddenly clamp down on Merry and Pippin's ears as Gandalf looks down sternly. They are later seen leaning over a barrel washing dishes in soapy water with Gandalf sitting nearby smoking his pipe and sipping an ale. Bilbo steps on a stool bowing in gratitude at the applause. with Frodo and Gandalf smiling to themselves. Bilbo's hand pulls something out of his waistcoat pocket and holds it behind his back as a strange hum seems to fill his head. Bilbo gives Gandalf a look and nods toward the mantelpiece."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Gandalf looks at him more keenly as Bilbo leads Gandalf into Bag End which is cozy and cluttered with souvenirs of Bilbo's travels. Gandalf has to stoop to avoid hitting his head on the low ceiling. Bilbo hangs up Gandalf's hat on a peg and trots off down the hall disappearing into the kitchen as Gandalf looks around enjoying the familiarity of Bag End. He turns knocking his head on the light and then walking into the wooden beam. groaning. Gandalf stops in front of a framed map charred in one corner. it is Thorin's map of the Lonely Mountain and Gandalf smiles to himself. Large hands suddenly clamp down on Merry and Pippin's ears as Gandalf looks down sternly. They are later seen leaning over a barrel washing dishes in soapy water with Gandalf sitting nearby smoking his pipe and sipping an ale. Bilbo steps on a stool bowing in gratitude at the applause. with Frodo and Gandalf smiling to themselves. Bilbo's hand pulls something out of his waistcoat pocket and holds it behind his back as a strange hum seems to fill his head. Bilbo gives Gandalf a look and nods toward the mantelpiece."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Gandalf looks at him more keenly as Bilbo leads Gandalf into Bag End which is cozy and cluttered with souvenirs of Bilbo's travels. Gandalf has to stoop to avoid hitting his head on the low ceiling. Bilbo hangs up Gandalf's hat on a peg and trots off down the hall disappearing into the kitchen as Gandalf looks around enjoying the familiarity of Bag End. with Frodo and Gandalf smiling to themselves. Bilbo's hand pulls something out of his waistcoat pocket and holds it behind his back as a strange hum seems to fill his head. Bilbo gives Gandalf a look and nods toward the mantelpiece."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Dumbledore looks at her more keenly as Aragorn leads Dumbledore into Bag End, which is cozy and cluttered with souvenirs of Aragorn's travels. Dumbledore has to stoop to avoid hitting her head on the low ceiling. Aragorn hangs up Dumbledore's hat on a peg and trots off down the hall, disappearing into the kitchen as Dumbledore looks around, enjoying the familiarity of Bag End. She turns, knocking her head on the light and then walking into the wooden beam, groaning. Dumbledore stops in front of a framed map, charred in one corner; it is Saruman's map of the Lonely Mountain, and Dumbledore smiles to herself. Dumbledore watches amused as Aragorn tries to hide, and Aragorn's fingers close around her waistcoat pocket, gripping a small, unseen object. Dumbledore and Aragorn are sitting on the Bag End porch, and below them, final preparations are being made on the Party field. Aragorn blows a perfect smoke ring and watches it rise into the air, as a tiny sailing ship with masts and sails glides through the center of Aragorn's smoke ring. Glowing flowers rain down from branches, evaporating just above the upturned faces of the delighted party-goers, with 144 Hobbits feasting and drinking. Carts of beer and wine are scattered about, and the tables are piled high with steaming scones and savories. Aragorn is greeting visitors while Legolas and Gimli sit at a table drinking ale. Legolas notices Gimli's eyes keep flicking to another pretty Hobbit, Rosie Cotton, sitting some distance away. Gimli goes to drain her glass, but suddenly it is snatched out of her hands as Legolas thrusts her into the middle of a passing throng of dancers as she is swept away. Legolas laughs and finishes Gimli's beer, while Dumbledore sets alight a particularly spectacular firework that draws gasps of admiration from the party guests. Aragorn relates stories of her adventure to a group of young hobbit children, and with their upturned faces, their eyes grow larger and larger. Stunned gasps from her young audience greet her astonishing feat! Boromir and Faramir, two mischievous young Hobbits in their late teens, are present, and Faramir scrambles onto the back of Dumbledore's wagon, snatching up a small firework. Dumbledore hurries about, lighting fireworks with a blue spark that dances magically from her staff. Large hands suddenly clamp down on Boromir and Faramir's ears, as Dumbledore looks down sternly. They are later seen leaning over a barrel, washing dishes in soapy water with Dumbledore sitting nearby, smoking her pipe and sipping an ale. Aragorn steps on a stool, bowing in gratitude at the applause, with Legolas and Dumbledore smiling to themselves. Aragorn's hand pulls something out of her waistcoat pocket and holds it behind her back as a strange hum seems to fill her head. Aragorn gives Dumbledore a look and nods toward the mantelpiece."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Gandalf looks at him more keenly as Bilbo leads Gandalf into Willow Vale, which is cozy and cluttered with trinkets from Bilbo's explorations. Gandalf has to stoop to avoid hitting his head on the low archway. Bilbo hangs up Gandalf's cloak on a rack and trots off down the corridor, disappearing into the dining room as Gandalf looks around, enjoying the familiarity of Willow Vale. He turns, knocking his head on the lantern and then walking into the stone pillar, groaning. Gandalf stops in front of a framed tapestry, singed in one corner; it is Thorin's tapestry of the Whispering Woods, and Gandalf smiles to himself. Gandalf watches amused as Bilbo tries to hide, and Bilbo's fingers close around his vest pocket, gripping a small, unseen object. Gandalf and Bilbo are sitting on the Willow Vale porch, and below them, final preparations are being made on the Celebration lawn. Bilbo blows a perfect smoke ring and watches it rise into the air, as a tiny balloon with baskets and ropes glides through the center of Bilbo's smoke ring. Glowing leaves rain down from branches, evaporating just above the upturned faces of the delighted revelers, with 144 Hobbits feasting and drinking. Carts of cider and juice are scattered about, and the tables are piled high with steaming pies and pastries. Bilbo is greeting visitors while Frodo and Sam sit at a table drinking cider. Frodo notices Sam's eyes keep flicking to another pretty Hobbit, Rosie Bush, sitting some distance away. Sam goes to drain his mug, but suddenly it is snatched out of his hands as Frodo thrusts him into the middle of a passing throng of dancers as he is swept away. Frodo laughs and finishes Sam's cider, while Gandalf sets alight a particularly spectacular sparkler that draws gasps of admiration from the guests. Bilbo relates stories of his adventure to a group of young hobbit children, and with their upturned faces, their eyes grow larger and larger. Stunned gasps from his young audience greet his astonishing feat! Merry and Pippin, two mischievous young Hobbits in their late teens, are present, and Pippin scrambles onto the back of Gandalf's cart, snatching up a small sparkler. Gandalf hurries about, lighting sparklers with a green spark that dances magically from his staff. Large hands suddenly clamp down on Merry and Pippin's ears, as Gandalf looks down sternly. They are later seen leaning over a tub, washing plates in bubbly water with Gandalf sitting nearby, smoking his cigar and sipping a cider. Bilbo steps on a box, bowing in gratitude at the applause, with Frodo and Gandalf smiling to themselves. Bilbo's hand pulls something out of his vest pocket and holds it behind his back as a strange hum seems to fill his head. Bilbo gives Gandalf a look and nods toward the bookshelf."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Gandalf examines him more curiously as Bilbo guides Gandalf into Bag End, which is cozy and cluttered with souvenirs of Bilbo's travels. Gandalf has to crouch to avoid brushing his head on the low ceiling. Bilbo drapes Gandalf's hat on a peg and skips off down the hall, vanishing into the kitchen as Gandalf glances around, savoring the familiarity of Bag End. He pivots, brushing his head on the light and then stumbling into the wooden beam, grunting. Gandalf pauses in front of a framed map, singed in one corner; it is Thorin's map of the Lonely Mountain, and Gandalf chuckles to himself. Gandalf observes amusedly as Bilbo attempts to conceal himself, and Bilbo's fingers wrap around his waistcoat pocket, clutching a small, unseen object. Gandalf and Bilbo are resting on the Bag End porch, and below them, final finishes are being applied on the Party field. Bilbo puffs a perfect smoke ring and observes it float into the air, as a tiny sailing ship with masts and sails drifts through the center of Bilbo's smoke ring. Glowing petals float down from branches, dissolving just above the upturned faces of the delighted party-goers, with 144 Hobbits reveling and toasting. Carts of beer and wine are strewn about, and the tables are stacked high with sizzling scones and savories. Bilbo is welcoming visitors while Frodo and Sam sit at a table sipping ale. Frodo notes Sam's eyes keep darting to another pretty Hobbit, Rosie Cotton, sitting some distance away. Sam goes to drink his glass, but suddenly it is whisked out of his hands as Frodo nudges him into the middle of a passing crowd of dancers as he is swept away. Frodo chuckles and finishes Sam's beer, while Gandalf ignites a particularly spectacular firework that draws gasps of admiration from the party guests. Bilbo recounts tales of his adventure to a group of young hobbit children, and with their upturned faces, their eyes grow larger and larger. Astonished murmurs from his young audience greet his astonishing feat! Merry and Pippin, two mischievous young Hobbits in their late teens, are present, and Pippin clambers onto the back of Gandalf's wagon, grabbing a small firework. Gandalf scrambles about, igniting fireworks with a blue flame that dances magically from his staff. Large hands suddenly grip Merry and Pippin's ears, as Gandalf glances down sternly. They are later seen leaning over a barrel, polishing dishes in soapy water with Gandalf sitting nearby, puffing his pipe and sipping an ale. Bilbo stands on a stool, nodding in gratitude at the applause, with Frodo and Gandalf grinning to themselves. Bilbo's hand extracts something out of his waistcoat pocket and keeps it behind his back as a strange hum seems to fill his head. Bilbo gives Gandalf a glance and gestures toward the mantelpiece."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Shakespeare gazes at it more keenly as Hermione leads Shakespeare into The Burrow, which is cozy and cluttered with scrolls of Hermione's travels. Shakespeare has to stoop to avoid hitting its head on the low ceiling. Hermione hangs up Shakespeare's umbrella on a peg and trots off down the corridor, disappearing into the library as Shakespeare looks around, enjoying the familiarity of The Burrow. It turns, knocking its head on the clock and then walking into the stone pillar, groaning. Shakespeare stops in front of a framed painting, charred in one corner; it is Odysseus's painting of the Misty Mountain, and Shakespeare smiles to itself. Shakespeare watches amused as Hermione tries to hide, and Hermione's fingers close around its satchel pocket, gripping a small, unseen gadget. Shakespeare and Hermione are sitting on The Burrow balcony, and below them, final preparations are being made on the Celebration valley. Hermione blows a perfect soap bubble and watches it rise into the air, as a tiny paper airplane with wings and tail glides through the center of Hermione's soap bubble. Glowing butterflies rain down from banners, evaporating just above the upturned faces of the delighted guests, with 144 Wizards feasting and drinking. Carts of coffee and cider are scattered about, and the desks are piled high with steaming croissants and pastries. Hermione is greeting strangers while Ron and Harry sit at a desk drinking tea. Ron notices Harry's eyes keep flicking to another pretty Wizard, Luna Lovegood, sitting some distance away. Harry goes to drain its cup, but suddenly it is snatched out of its paws as Ron thrusts it into the middle of a passing throng of minstrels as it is swept away. Ron laughs and finishes Harry's tea, while Shakespeare sets alight a particularly spectacular candle that draws gasps of admiration from the guests. Hermione relates stories of its voyage to a crowd of young wizard children, and with their upturned faces, their eyes grow larger and larger. Stunned gasps from its young listeners greet its astonishing feat! Arthur and Fred, two mischievous young Wizards in their late teens, are present, and Fred scrambles onto the back of Shakespeare's cart, snatching up a small candle. Shakespeare hurries about, lighting candles with a red flame that dances magically from its wand. Large spoons suddenly clamp down on Arthur and Fred's heads, as Shakespeare looks down sternly. They are later seen leaning over a bucket, washing goblets in soapy soda with Shakespeare sitting nearby, smoking its cigar and sipping a cider. Hermione steps on a crate, bowing in gratitude at the cheers, with Ron and Shakespeare smiling to themselves. Hermione's hand pulls something out of its satchel pocket and holds it behind its back as a strange hum seems to fill its mind. Hermione gives Shakespeare a glance and nods toward the bookshelf."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Frodo glances at him more intently as Sam guides Frodo into Bag End, which is cozy and cluttered with souvenirs of Sam's expeditions. Frodo has to crouch to avoid hitting his head on the low ceiling. Sam places Frodo's hat on a peg and bounds off down the hall, vanishing into the kitchen as Frodo glances around, relishing the familiarity of Bag End. He spins, striking his head on the lamp and then moving into the wooden beam, sighing. Frodo halts in front of a framed map, singed in one corner; it is Balin's map of the Lonely Mountain, and Frodo chuckles to himself. Frodo observes amused as Sam attempts to conceal himself, and Sam's fingers wrap around his waistcoat pocket, clutching a small, unseen object. Frodo and Sam are lounging on the Bag End porch, and below them, final adjustments are being made on the Party field. Sam exhales a perfect smoke ring and watches it float into the air, as a tiny sailing ship with masts and sails drifts through the center of Sam's smoke ring. Glowing petals cascade down from branches, evaporating just above the upturned faces of the enchanted party-goers, with 144 Hobbits feasting and drinking. Carts of cider and mead are scattered about, and the tables are piled high with steaming pies and pastries. Sam is welcoming guests while Merry and Pippin sit at a table drinking cider. Merry notices Pippin's eyes keep flickering toward another attractive Hobbit, Rosie Cotton, sitting some distance away. Pippin goes to finish his mug, but abruptly it is plucked out of his hands as Merry propels him into the middle of a flowing throng of dancers as he is carried away. Merry chuckles and drains Pippin's cider, while Frodo ignites a particularly dazzling firework that draws sighs of admiration from the party guests. Sam recounts tales of his journey to a group of young hobbit children, and with their upturned faces, their eyes widen more and more. Astonished gasps from his young audience welcome his remarkable feat! Rosie and Frodo, two playful young Hobbits in their late teens, are present, and Frodo climbs onto the back of Sam's wagon, seizing a small firework. Sam rushes about, igniting fireworks with a green spark that skips magically from his staff. Large hands suddenly grasp Rosie and Frodo's ears, as Sam gazes down gravely. They are later spotted leaning over a barrel, cleaning dishes in soapy water with Sam sitting nearby, puffing his pipe and sipping a mead. Sam steps on a stool, bowing in appreciation at the applause, with Merry and Frodo grinning to themselves. Sam's hand extracts something out of his waistcoat pocket and conceals it behind his back as a peculiar hum appears to fill his head. Sam gives Frodo a look and nods toward the mantelpiece."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Gandalf examines him more intently as Bilbo guides Gandalf into Bag End, which is snug and crowded with artifacts of Bilbo's voyages. Gandalf has to crouch to avoid brushing his ear on the low chandelier. Bilbo tosses Gandalf's scarf on a hook and skips off down the corridor, vanishing into the library as Gandalf gazes around, savoring the recognition of Bag End. He swivels, bumping his elbow on the lamp and then stumbling into the stone column, sighing. Gandalf halts in front of a painted canvas, singed in one edge; it is Thorin's illustration of the Lonely Mountain, and Gandalf chuckles to himself. Gandalf observes amused as Bilbo attempts to vanish, and Bilbo's fingers wrap around his jacket pocket, clutching a small, unseen item. Gandalf and Bilbo are resting on the Bag End balcony, and below them, last-minute activities are underway on the Party lawn. Bilbo puffs a flawless smoke ring and watches it float into the sky, as a miniature airship with balloons and propellers glides through the center of Bilbo's smoke ring. Glowing petals shower down from vines, vanishing just above the upturned faces of the delighted party-goers, with 144 Hobbits munching and sipping. Carts of cider and juice are scattered about, and the tables are laden with steaming pastries and desserts. Bilbo is welcoming visitors while Frodo and Sam lounge at a table sipping mead. Frodo notices Sam's eyes keep darting to another lovely Hobbit, Rosie Cotton, sitting a distance away. Sam goes to finish his flask, but suddenly it is whisked out of his hands as Frodo propels him into the middle of a passing crowd of singers as he is whisked away. Frodo chuckles and polishes off Sam's mead, while Gandalf ignites an especially dazzling lantern that draws exclamations of wonder from the party guests. Bilbo recounts tales of his journey to a group of young hobbit children, and with their tilted faces, their eyes widen more and more. Awed gasps from his young audience greet his astonishing achievement! Merry and Pippin, two roguish young Hobbits in their late teens, are present, and Pippin clambers onto the back of Gandalf's cart, grabbing a small lantern. Gandalf rushes about, igniting lanterns with a green spark that cavorts magically from his wand. Large hands suddenly press down on Merry and Pippin's shoulders, as Gandalf peers down sternly. They are later spotted leaning over a tub, scrubbing cups in bubbly liquid with Gandalf sitting nearby, puffing his pipe and sipping a cider. Bilbo climbs on a chair, nodding in appreciation at the cheers, with Frodo and Gandalf grinning to themselves. Bilbo's hand extracts something out of his jacket pocket and tucks it behind his back as a strange buzz seems to fill his mind. Bilbo gives Gandalf a glance and gestures toward the bookshelf."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Merlin stares at the rabbit more intently as Alice guides Merlin into The Borrow, which is spacious and strewn with artifacts from Alice's expeditions. Merlin has to crouch to avoid brushing his nose on the high rafters. Alice places Merlin's scarf on a hook and skips off up the corridor, vanishing into the library as Merlin glances around, appreciating the strangeness of The Borrow. He swivels, bumping his elbow on the bookshelf and then stumbling into the stone column, muttering. Merlin halts beside a painted globe, scorched on one side; it is Arthur's globe of the Deserted Island, and Merlin grins to the rabbit. Merlin observes amused as Alice attempts to vanish, and Alice's feet curl around her apron pocket, clutching a large, visible trinket. Merlin and Alice are relaxing on The Borrow terrace, and above them, initial repairs are being conducted on the Barn roof. Alice exhales a crooked dust cloud and follows it descend onto the earth, as a tiny locomotive with wheels and chimney chugs beyond the edge of Alice's dust cloud. Glowing stars float up from roots, condensing just below the downturned eyes of the astonished spectators, with 144 Elves singing and dancing. Pallets of juice and cider are stacked around, and the benches are loaded low with chilled pastries and sweets. Alice is ignoring visitors while Tom and Sue stand by a bench singing songs. Tom observes Sue's ears keep twitching toward another handsome Elf, Larry Oak, standing nearby. Sue goes to toss his mug, but instantly it is grabbed out of his fingers as Tom pushes him against the edge of a nearby flock of singers as he is carried away. Tom giggles and empties Sue's cider, while Merlin launches a particularly lackluster balloon that earns groans of disappointment from the spectators. Alice recounts fables of her journey to a cluster of old Elf elders, and with their downturned eyes, their noses grow smaller and smaller. Awestruck sighs from her elderly audience follow her boring tale! May and Pip, two well-behaved old Elves in their early sixties, are absent, and Pip crawls under the rim of Merlin's barrow, grasping a huge balloon. Merlin wanders about, dropping balloons with a yellow flame that crawls lazily from his glove. Small feet suddenly grasp onto May and Pip's shoulders, as Merlin glances up delightedly. They are earlier spotted resting under a tree, wiping plates with dry cloths while Merlin stands afar, holding his umbrella and eating a snack. Alice steps off a chair, waving as a farewell at the silence, with Tom and Merlin yawning to themselves. Alice's ear removes anything into her apron pocket and keeps it in front of her chest as a gentle buzz seems to fill her shoes. Alice shows Merlin a book and listens behind the curtain."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Gandalf follows Bilbo into Bag End, filled with souvenirs from Bilbo's adventures. Gandalf admires Thorin's map of the Lonely Mountain and finds amusement in Bilbo's attempt to hide, clutching something in his pocket. As they sit on the porch, a festive party unfolds below, with Hobbits celebrating with food, drinks, and fireworks. Bilbo greets guests, while Frodo nudges Sam to interact with Rosie Cotton. Frodo then playfully pushes Sam into a crowd of dancers. Meanwhile, Gandalf impresses the guests with a spectacular firework display. Mischievous Merry and Pippin attempt to steal a firework but are caught by Gandalf, who disciplines them by making them wash dishes. Bilbo, receiving applause, discreetly hides an object from his pocket, sharing a meaningful glance with Gandalf."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Bilbo gives Gandalf a look and nods toward the mantelpiece Bilbo's hand pulls something out of his waistcoat pocket and holds it behind his back as a strange hum seems to fill his head  with Frodo and Gandalf smiling to themselves  Bilbo steps on a stool bowing in gratitude at the applause  They are later seen leaning over a barrel washing dishes in soapy water with Gandalf sitting nearby smoking his pipe and sipping an ale  Large hands suddenly clamp down on Merry and Pippin's ears as Gandalf looks down sternly  Gandalf hurries about lighting fireworks with a blue spark that dances magically from his staff  Stunned gasps from his young audience greet his astonishing feat Merry and Pippin two mischievous young Hobbits in their late teens are present and Pippin scrambles onto the back of Gandalf's wagon snatching up a small firework  Bilbo relates stories of his adventure to a group of young hobbit children and with their upturned faces their eyes grow larger and larger  Frodo laughs and finishes Sam's beer while Gandalf sets alight a particularly spectacular firework that draws gasps of admiration from the party guests  Sam goes to drain his glass but suddenly it is snatched out of his hands as Frodo thrusts him into the middle of a passing throng of dancers as he is swept away  Frodo notices Sam's eyes keep flicking to another pretty Hobbit Rosie Cotton sitting some distance away  Bilbo is greeting visitors while Frodo and Sam sit at a table drinking ale  Carts of beer and wine are scattered about and the tables are piled high with steaming scones and savories  Glowing flowers rain down from branches evaporating just above the upturned faces of the delighted partygoers with 144 Hobbits feasting and drinking  Bilbo blows a perfect smoke ring and watches it rise into the air as a tiny sailing ship with masts and sails glides through the center of Bilbo's smoke ring  on the Party field  Gandalf and Bilbo are sitting on the Bag End porch and below them final preparations are being made  Gandalf watches amused as Bilbo tries to hide and Bilbo's fingers close around his waistcoat pocket gripping a small unseen object  it is Thorin's map of the Lonely Mountain and Gandalf smiles to himself  Gandalf stops in front of a framed map charred in one corner  groaning  He turns knocking his head on the light and then walking into the wooden beam  Bilbo hangs up Gandalf's hat on a peg and trots off down the hall disappearing into the kitchen as Gandalf looks around enjoying the familiarity of Bag End  Gandalf has to stoop to avoid hitting his head on the low ceiling  Gandalf looks at him more keenly as Bilbo leads Gandalf into Bag End which is cozy and cluttered with souvenirs of Bilbo's travels "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Frodo laughs and finishes Sam's beer while Gandalf sets alight a particularly spectacular firework that draws gasps of admiration from the party guests  Bilbo gives Gandalf a look and nods toward the mantelpiece Large hands suddenly clamp down on Merry and Pippin's ears as Gandalf looks down sternly  Bilbo relates stories of his adventure to a group of young hobbit children and with their upturned faces their eyes grow larger and larger  Gandalf hurries about lighting fireworks with a blue spark that dances magically from his staff  Glowing flowers rain down from branches evaporating just above the upturned faces of the delighted partygoers with 144 Hobbits feasting and drinking  Sam goes to drain his glass but suddenly it is snatched out of his hands as Frodo thrusts him into the middle of a passing throng of dancers as he is swept away  Gandalf has to stoop to avoid hitting his head on the low ceiling  Gandalf watches amused as Bilbo tries to hide and Bilbo's fingers close around his waistcoat pocket gripping a small unseen object  Gandalf looks at him more keenly as Bilbo leads Gandalf into Bag End which is cozy and cluttered with souvenirs of Bilbo's travels  They are later seen leaning over a barrel washing dishes in soapy water with Gandalf sitting nearby smoking his pipe and sipping an ale  on the Party field  Frodo notices Sam's eyes keep flicking to another pretty Hobbit Rosie Cotton sitting some distance away  Bilbo's hand pulls something out of his waistcoat pocket and holds it behind his back as a strange hum seems to fill his head  Gandalf stops in front of a framed map charred in one corner  Stunned gasps from his young audience greet his astonishing feat Merry and Pippin two mischievous young Hobbits in their late teens are present and Pippin scrambles onto the back of Gandalf's wagon snatching up a small firework  Carts of beer and wine are scattered about and the tables are piled high with steaming scones and savories  Bilbo hangs up Gandalf's hat on a peg and trots off down the hall disappearing into the kitchen as Gandalf looks around enjoying the familiarity of Bag End  He turns knocking his head on the light and then walking into the wooden beam  with Frodo and Gandalf smiling to themselves  it is Thorin's map of the Lonely Mountain and Gandalf smiles to himself  groaning  Gandalf and Bilbo are sitting on the Bag End porch and below them final preparations are being made  Bilbo blows a perfect smoke ring and watches it rise into the air as a tiny sailing ship with masts and sails glides through the center of Bilbo's smoke ring  Bilbo is greeting visitors while Frodo and Sam sit at a table drinking ale  Bilbo steps on a stool bowing in gratitude at the applause "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Bilbo is greeting visitors while Frodo and Sam sit at a table drinking ale  Frodo notices Sam's eyes keep flicking to another pretty Hobbit Rosie Cotton sitting some distance away  Sam goes to drain his glass but suddenly it is snatched out of his hands as Frodo thrusts him into the middle of a passing throng of dancers as he is swept away  Frodo laughs and finishes Sam's beer while Gandalf sets alight a particularly spectacular firework that draws gasps of admiration from the party guests  Bilbo relates stories of his adventure to a group of young hobbit children and with their upturned faces their eyes grow larger and larger  Stunned gasps from his young audience greet his astonishing feat Merry and Pippin two mischievous young Hobbits in their late teens are present and Pippin scrambles onto the back of Gandalf's wagon snatching up a small firework  Gandalf hurries about lighting fireworks with a blue spark that dances magically from his staff  Large hands suddenly clamp down on Merry and Pippin's ears as Gandalf looks down sternly  They are later seen leaning over a barrel washing dishes in soapy water with Gandalf sitting nearby smoking his pipe and sipping an ale  Bilbo steps on a stool bowing in gratitude at the applause  with Frodo and Gandalf smiling to themselves  Bilbo's hand pulls something out of his waistcoat pocket and holds it behind his back as a strange hum seems to fill his head  Bilbo gives Gandalf a look and nods toward the mantelpiece Gandalf looks at him more keenly as Bilbo leads Gandalf into Bag End which is cozy and cluttered with souvenirs of Bilbo's travels  Gandalf has to stoop to avoid hitting his head on the low ceiling  Bilbo hangs up Gandalf's hat on a peg and trots off down the hall disappearing into the kitchen as Gandalf looks around enjoying the familiarity of Bag End  He turns knocking his head on the light and then walking into the wooden beam  groaning  Gandalf stops in front of a framed map charred in one corner  it is Thorin's map of the Lonely Mountain and Gandalf smiles to himself  Gandalf watches amused as Bilbo tries to hide and Bilbo's fingers close around his waistcoat pocket gripping a small unseen object  Gandalf and Bilbo are sitting on the Bag End porch and below them final preparations are being made  on the Party field  Bilbo blows a perfect smoke ring and watches it rise into the air as a tiny sailing ship with masts and sails glides through the center of Bilbo's smoke ring  Glowing flowers rain down from branches evaporating just above the upturned faces of the delighted partygoers with 144 Hobbits feasting and drinking  Carts of beer and wine are scattered about and the tables are piled high with steaming scones and savories "
        }
      ]
    }
  ]
}