{
  "ground_truth": "The strange tower of Orthanc, hewn from a solid pillar of black obsidian, rises up in the center of the Isengard Circle. Gandalf arrives at the foot of the Orthanc Stairs and sweeps down them. Gandalf moves quickly towards Saruman, grimy and weary from his long ride. Gandalf and Saruman walk slowly between the beautiful trees of Isengard, with Saruman's clean, white robe contrasting with Gandalf's dusty grey robes. Saruman and Gandalf are seated in a small, cluttered room to the side of the cavernous central chamber. Gandalf and Saruman stride through Orthanc toward a stone plinth on which a sphere-like shape is draped with a cloth. Saruman lifts the cloth to reveal the Palantir and then sits upon his throne. Gandalf backs away and turns to run to the door, horrified as the doors suddenly slam shut. Gandalf slowly turns to Saruman, a look of dawning horror on his face. At that moment, Gandalf is suddenly blasted across the room and slams against the wall, pinned there by some unseen force. With sudden effort, Gandalf wrenches himself off the wall and swings his staff at Saruman, blasting him off his feet, and Gandalf and Saruman battle, with powerful blasts throwing them across the room. Saruman screams, eyes blazing, as Gandalf's staff is suddenly wrenched from his grasp and flies across the chamber into Saruman's hand, and Gandalf is flung to the floor. Gandalf is breathing hard on the floor, his eyes looking into the madness of Saruman. Commanding two staffs, Saruman sends Gandalf into a sickening spin, and Gandalf tumbles towards the top of the chamber as if falling in reverse. The roof of Orthanc rockets toward the camera. Meanwhile, Frodo and Sam are walking along a country lane which borders Farmer Maggot's Fields. Sam is looking up as Frodo has disappeared around a corner in the lane. Suddenly, a figure comes crashing out of a hedgerow, sending Frodo flying. Merry, Pippin, and Frodo pick themselves up and a variety of vegetables have scattered everywhere. A large pitchfork can be seen racing towards them along the hedgerow, with angry shouts from Farmer Maggot. Merry and Pippin hurriedly gather their booty and race away with Frodo and Sam on their heels. Frodo, Sam, Merry, and Pippin tumble head over heels down a bank, onto a dark, wooded road. A winded Pippin finds his face inches away from a large pile of horse droppings, and he pulls a large carrot, almost broken through in the middle, out from his back pocket. Pippin has spied something under the trees on the far side of the road: small, brown mushrooms growing amongst the loamy undergrowth. Sam, Merry, and Pippin race toward the mushrooms as Frodo remains tense and watchful. Frodo picks himself up and looks around quickly, realizing they are on a wooded road. Scattered leaves rise into the air, whirling down the road as if blown by an invisible wind.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The odd spire of Orthanc, carved from a solid column of black obsidian, ascends up in the heart of the Isengard Circle. Gandalf arrives at the base of the Orthanc Stairs and glides down them. Gandalf proceeds promptly towards Saruman, filthy and tired from his lengthy journey. Gandalf and Saruman stroll slowly between the lovely trees of Isengard, with Saruman's pristine, white garment contrasting with Gandalf's dusty grey garments. Saruman and Gandalf are seated in a small, cluttered chamber to the side of the cavernous central hall. Gandalf and Saruman march through Orthanc toward a stone pedestal on which a sphere-like form is draped with a cloth. Saruman raises the cloth to unveil the Palantir and then sits upon his throne. Gandalf retreats and turns to dash to the door, horrified as the doors abruptly slam shut. Gandalf slowly turns to Saruman, a look of dawning terror on his face. At that instant, Gandalf is suddenly hurled across the chamber and slams against the wall, pinned there by some unseen force. With sudden exertion, Gandalf wrenches himself off the wall and swings his staff at Saruman, hurling him off his feet, and Gandalf and Saruman battle, with powerful blasts throwing them across the chamber. Saruman shrieks, eyes blazing, as Gandalf's staff is suddenly wrenched from his grasp and flies across the hall into Saruman's hand, and Gandalf is flung to the floor. Gandalf is gasping hard on the floor, his eyes looking into the madness of Saruman. Commanding two staffs, Saruman sends Gandalf into a sickening spin, and Gandalf tumbles towards the top of the hall as if plunging in reverse. The roof of Orthanc rockets toward the camera. Meanwhile, Frodo and Sam are strolling along a country lane which borders Farmer Maggot's Fields. Sam is looking up as Frodo has vanished around a corner in the lane. Suddenly, a figure comes crashing out of a hedgerow, sending Frodo flying. Merry, Pippin, and Frodo pick themselves up and an assortment of vegetables have scattered everywhere. A large pitchfork can be seen racing towards them along the hedgerow, with irate shouts from Farmer Maggot. Merry and Pippin hurriedly gather their loot and dash away with Frodo and Sam on their heels. Frodo, Sam, Merry, and Pippin tumble head over heels down a bank, onto a shadowy, wooded road. A breathless Pippin finds his face inches away from a large pile of horse dung, and he pulls a large carrot, almost snapped through in the middle, out from his back pocket. Pippin has spotted something under the trees on the far side of the road: small, brown mushrooms growing amongst the loamy undergrowth. Sam, Merry, and Pippin race toward the mushrooms as Frodo remains tense and watchful. Frodo picks himself up and looks around quickly, realizing they are on a wooded road. Scattered leaves rise into the air, whirling down the road as if blown by an invisible wind."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The strange tower of Orthanc, hewn from a solid pillar of black obsidian, is risen up in the center of the Isengard Circle. The foot of the Orthanc Stairs is arrived at by Gandalf, and he is swept down them. Saruman, grimy and weary from his long ride, is quickly moved towards by Gandalf. Gandalf and Saruman are walking slowly between the beautiful trees of Isengard, with Gandalf's dusty grey robes contrasting with Saruman's clean, white robe. A small, cluttered room to the side of the cavernous central chamber seats Saruman and Gandalf. A stone plinth on which a sphere-like shape is draped with a cloth is strode toward by Gandalf and Saruman through Orthanc. The Palantir is revealed by Saruman when he lifts the cloth and then the throne is sat upon by him. The door is turned to by Gandalf, horrified, as he backs away and the doors suddenly slam shut. Saruman is slowly turned to by Gandalf, a look of dawning horror on his face. At that moment, some unseen force suddenly blasts Gandalf across the room, slamming him against the wall, and he is pinned there. With sudden effort, the wall is wrenched off by Gandalf as he swings his staff at Saruman, blasting him off his feet, and a battle is engaged in by Gandalf and Saruman, with powerful blasts throwing them across the room. Gandalf's staff is suddenly wrenched from his grasp and flies across the chamber into Saruman's hand as Saruman screams, eyes blazing, and the floor flings Gandalf to it. The madness of Saruman is looked into by Gandalf, breathing hard on the floor. Two staffs are commanded by Saruman and Gandalf is sent into a sickening spin, tumbling towards the top of the chamber as if falling in reverse. The camera is rocketed towards by the roof of Orthanc. Meanwhile, a country lane which borders Farmer Maggot's Fields is walked along by Frodo and Sam. As Frodo disappears around a corner in the lane, up is looked by Sam. Suddenly, Frodo is sent flying as a figure crashes out of a hedgerow. Merry, Pippin, and Frodo pick themselves up and a variety of vegetables scatter everywhere. A large pitchfork races towards them along the hedgerow, with angry shouts heard from Farmer Maggot. Their booty is hurriedly gathered by Merry and Pippin, and with Frodo and Sam on their heels, they race away. A dark, wooded road is tumbled onto head over heels by Frodo, Sam, Merry, and Pippin down a bank. Inches away from a large pile of horse droppings, Pippin finds his face winded, and from his back pocket, he pulls a large carrot, almost broken through in the middle. Under the trees on the far side of the road, something is spied by Pippin: small, brown mushrooms growing amongst the loamy undergrowth. Toward the mushrooms race Sam, Merry, and Pippin as Frodo remains tense and watchful. Frodo picks himself up and quickly looks around, realizing a wooded road is where they are. Into the air, scattered leaves are risen, whirling down the road as if by an invisible wind."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The strange Orthanc tower, carved from black obsidian, stands in the Isengard Circle. Gandalf arrives at the Orthanc Stairs and rushes toward Saruman, grimy from his long ride. They walk between Isengard's beautiful trees, Saruman's white robe contrasting with Gandalf's dusty grey attire. In a cluttered room, Saruman reveals the Palantir. Gandalf backs away horrified as doors slam shut. Suddenly, Gandalf is blasted against the wall but wrenches himself free, attacking Saruman. A fierce battle ensues with powerful blasts. Gandalf's staff flies into Saruman's hand, and he's flung to the floor. With both staffs, Saruman sends Gandalf spiraling, falling in reverse as Orthanc's roof rushes toward him. Meanwhile, Frodo and Sam walk near Farmer Maggot's Fields when Frodo is sent flying by a crashing figure. Merry, Pippin, and Frodo pick themselves up, vegetables scattered, as Farmer Maggot shouts. They race away with Frodo and Sam. The four tumble down a bank onto a dark road. Breathless, Pippin finds his face near horse droppings and pulls a broken carrot from his pocket. He spots mushrooms under trees, and Sam, Merry, and Pippin race toward them while Frodo stays tense and watchful, realizing they're on a wooded road. Leaves rise and whirl down the road as if blown by an invisible wind."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The obsidian tower of Orthanc rises in Isengard's center. Gandalf, grimy from travel, approaches Saruman at Orthanc's stairs. They stroll through Isengard, contrasting robes—Saruman's white, Gandalf's grey. In a cluttered room, they head to a plinth holding the Palantir. Saruman unveils it, sits on his throne as Gandalf backs away, doors slam shut, and Gandalf is suddenly pinned to the wall by unseen force. He frees himself, both blast each other across the room. Saruman seizes Gandalf's staff, flinging him down. Saruman, commanding two staffs, sends Gandalf spinning upwards toward Orthanc's roof. Meanwhile, Frodo and Sam walk near Farmer Maggot's Fields. Frodo vanishes around a corner, and Merry crashes through hedgerow, scattering vegetables. Farmer Maggot chases them, prompting Merry, Pippin, Sam, and Frodo to flee. Rolling onto a wooded road, Pippin narrowly avoids horse droppings, retrieves a broken carrot, and spots mushrooms under trees. They race for them, while Frodo remains tense. Leaves whirl down the road as if blown by invisible wind."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The peculiar and mysterious tower of Orthanc, expertly carved from a single, unyielding pillar of black obsidian, majestically rises up in the very center of the great Isengard Circle. Upon arriving at the base of the imposing Orthanc Stairs, Gandalf swiftly sweeps down them with purpose. He moves with urgency and determination, making his way toward Saruman, who appears grimy and weary after enduring a long and arduous ride. As Gandalf and Saruman walk slowly and deliberately between the array of beautiful trees in Isengard, Saruman's pristine white robe stands in stark contrast to Gandalf's dusty and worn grey robes. The two, Gandalf and Saruman, find themselves seated in a small, cluttered room situated to the side of the expansive, cavernous central chamber. Together, Gandalf and Saruman stride with purpose through the corridors of Orthanc toward a prominent stone plinth, upon which rests an enigmatic sphere-like shape, veiled by a cloth. Saruman lifts the cloth with a flourish, revealing the Palantir, and then takes his seat upon his imposing throne. Gandalf, overwhelmed by fear, backs away and turns to flee to the door, only to watch in horror as the doors abruptly slam shut. Slowly, Gandalf turns back to face Saruman, a look of dawning horror etched upon his features. In that very moment, Gandalf is abruptly blasted across the room, slamming against the hard wall, held there by some unseen force. With sudden effort and determination, Gandalf wrenches himself free from the wall and swings his staff at Saruman, sending Saruman off his feet, prompting a fierce battle between the two, with powerful blasts hurling them across the room. Saruman, eyes blazing with intensity, screams as Gandalf's staff is suddenly wrenched from his grasp and flies across the chamber into Saruman's waiting hand, causing Gandalf to be flung to the floor. Breathing heavily, Gandalf lies on the floor, his eyes locked onto the madness that has overtaken Saruman. Wielding the power of two staffs, Saruman sends Gandalf into a sickening and dizzying spin, causing Gandalf to tumble upward toward the top of the chamber as if falling backward in reverse. The roof of Orthanc seems to rocket toward the camera with alarming speed. Meanwhile, Frodo and Sam are casually walking along a country lane that borders the lush expanse of Farmer Maggot's Fields. Sam, glancing up, realizes that Frodo has disappeared around a bend in the lane. Suddenly, a figure crashes out of the dense hedgerow, sending Frodo sprawling. Merry, Pippin, and Frodo pick themselves up as a variety of vegetables scatter everywhere in the chaos. A large pitchfork appears, racing toward them along the hedgerow, accompanied by the angry shouts of Farmer Maggot. Merry and Pippin hurriedly gather their spoils and dash away with Frodo and Sam trailing close behind. Together, Frodo, Sam, Merry, and Pippin tumble head over heels down a steep bank, landing onto a dark, wooded road. Pippin, winded from the fall, finds his face mere inches away from a large pile of horse droppings and pulls a large, almost broken carrot from his back pocket. Pippin spies something intriguing under the trees on the far side of the road: small, earthy brown mushrooms growing amidst the loamy undergrowth. Sam, Merry, and Pippin eagerly race toward the enticing mushrooms while Frodo remains tense and watchful. Quickly picking himself up, Frodo looks around, realizing that they have found themselves on a wooded road. Scattered leaves rise into the air, swirling down the road as if propelled by an invisible wind."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The peculiar and enigmatic tower known as Orthanc, masterfully hewn from a solitary, unyielding pillar of dark black obsidian, rises majestically and imposingly in the very heart of the expansive Isengard Circle. Upon reaching the towering base of the intimidating Orthanc Stairs, Gandalf descends them with a swift and purposeful grace. He moves with an air of urgency and unyielding determination, making his way toward Saruman, who appears grimy and visibly weary after enduring a long and arduous journey. As Gandalf and Saruman proceed slowly and deliberately between the array of beautiful trees within Isengard, the pristine, pure white of Saruman’s robe presents a stark and vivid contrast to Gandalf's dusty and well-worn grey robes. The two, both Gandalf and Saruman, eventually find themselves seated within a small, cluttered room that is positioned to one side of the vast, cavernous central chamber. Together, Gandalf and Saruman stride with a sense of purpose through the winding corridors of Orthanc toward a prominent stone plinth, upon which rests a mysterious, sphere-like shape that is carefully veiled by a cloth. Saruman lifts the cloth with a dramatic flourish, revealing the Palantir, and then takes his seat upon his grand, imposing throne. Gandalf, overwhelmed by a sense of fear, backs away in haste and turns to flee toward the door, only to witness in horror as the doors slam shut with a sudden and finality. Slowly, Gandalf turns back to face Saruman, a look of dawning horror and realization etched upon his features. In that very instant, Gandalf is abruptly blasted across the room, slamming against the hard wall, as if held there by some unseen force. With sudden effort and steely determination, Gandalf wrenches himself free from the wall and swings his staff at Saruman, sending Saruman tumbling off his feet, prompting a fierce and intense battle between the two, with powerful blasts hurling them across the room. Saruman, his eyes ablaze with an intense fury, screams out as Gandalf's staff is suddenly wrenched from his grasp and flies across the chamber into Saruman’s outstretched hand, causing Gandalf to be violently flung to the floor. Breathing heavily, Gandalf lies on the floor, his eyes locked onto the chaos and madness that has overtaken Saruman. Wielding the combined power of two staffs, Saruman sends Gandalf into a sickening and dizzying spin, causing Gandalf to tumble upward toward the top of the chamber as if falling backward in reverse. The roof of Orthanc appears to rocket toward the camera with alarming and breathtaking speed. Meanwhile, Frodo and Sam are casually walking along a winding country lane that borders the lush and expansive fields of Farmer Maggot. Sam, glancing up, suddenly realizes that Frodo has disappeared around a bend in the lane. Without warning, a figure bursts forth from the dense hedgerow, sending Frodo sprawling to the ground. Merry, Pippin, and Frodo pick themselves up as a variety of vegetables scatter in all directions amidst the chaos. A large pitchfork appears, racing toward them along the hedgerow, accompanied by the angry and outraged shouts of Farmer Maggot. Merry and Pippin hurriedly gather their spoils and dash away with Frodo and Sam trailing close behind. Together, Frodo, Sam, Merry, and Pippin tumble head over heels down a steep bank, landing with a thud onto a dark, wooded road. Pippin, winded from the fall, finds his face mere inches away from a large pile of horse droppings and pulls a large, almost broken carrot from his back pocket. Pippin spies something intriguing and captivating under the trees on the far side of the road: small, earthy brown mushrooms growing amidst the loamy undergrowth. Sam, Merry, and Pippin eagerly race toward the enticing and delicious-looking mushrooms while Frodo remains tense and vigilant. Quickly picking himself up, Frodo looks around, realizing that they have unexpectedly found themselves on a secluded wooded road. Scattered leaves rise into the air, swirling mysteriously down the road as if propelled by an unseen and invisible wind."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The strange tower of Orthanc, meticulously hewn from a solid pillar of black obsidian, majestically rises at the very center of the Isengard Circle, casting a formidable presence. Gandalf arrives at the base of the formidable Orthanc Stairs, his robes billowing slightly as he gracefully sweeps down their steep descent. Moving with a sense of urgency, Gandalf makes haste towards Saruman, his appearance grimy and weary as a testament to the exhaustion etched by his long, arduous ride. As Gandalf and Saruman begin their slow, deliberate walk, they navigate together through the serene, lush beauty of the trees of Isengard, creating a striking visual contrast between Saruman's pristine, white robe and Gandalf's dusty gray garments. Eventually, Saruman and Gandalf find themselves seated in a small, cluttered room adjacent to the cavernous central chamber, the space filled with an aura of quiet anticipation. With determined strides, Gandalf and Saruman traverse the pathways of Orthanc, their eyes fixed on a stone plinth, draped with a cloth, concealing a mysterious sphere-like shape. Saruman deliberately lifts the cloth, unveiling the enigmatic Palantir, and then, with a commanding presence, seats himself upon his imposing throne. In response to this revelation, Gandalf instinctively backs away, a look of horror overtaking him as he turns to flee, only to hear the doors slam shut with foreboding finality. Slowly, Gandalf turns to face Saruman, a look of dawning horror painting his features, just as he is suddenly and forcefully blasted across the room, colliding with the wall and finding himself pinned there by an unseen force. Drawing upon his inner strength, Gandalf wrenches himself free from the wall's grip, swinging his staff with determination at Saruman, sending him sprawling off his feet, initiating an intense battle where powerful blasts hurl them both across the chamber. Amidst Saruman's screams, his eyes blaze with fury, as Gandalf's staff is abruptly wrenched from his grasp, sailing through the air into Saruman's waiting hand, leaving Gandalf flung to the floor, breathless and struggling to comprehend the chaos. From the floor, Gandalf's eyes meet Saruman's, staring into a madness that commands both staffs and sends Gandalf into a dizzying spin, tumbling helplessly toward the chamber's peak as if plummeting in reverse. As the roof of Orthanc seems to rocket toward the camera, we shift our focus to Frodo and Sam, who are jovially walking along a quaint country lane bordering Farmer Maggot's Fields. Sam's attention shifts upwards, as Frodo, in his playful curiosity, has disappeared around a bend in the path. Suddenly, the peaceful setting is shattered as a figure hurtles out of the hedgerow, sending Frodo sprawling. Merry, Pippin, and Frodo find themselves picking up, with vegetables scattered in comedic disarray around them. In an alarming turn, a large pitchfork is seen rushing toward them along the hedgerow, accompanied by the angry shouts of Farmer Maggot. Reacting quickly, Merry and Pippin gather their stolen vegetables in a hurried frenzy and take off running, with Frodo and Sam chasing frantically after them. The four friends tumble head over heels down a slope, landing with a thud on a dark, wooded road below. A breathless Pippin finds his face perilously close to a large pile of horse droppings, just as he retrieves a nearly broken carrot from his back pocket, chuckling at the absurdity of their predicament. Meanwhile, Pippin's keen eyes have spotted something intriguing under the trees across the road—small, brown mushrooms thriving in the loamy undergrowth. Sam, Merry, and Pippin dash eagerly toward the mushrooms, while Frodo lingers, tense and vigilant, his eyes scanning their surroundings. With a quick motion, Frodo picks himself up, rapidly assessing their unfamiliar wooded road. Leaves scatter upwards, spinning and dancing down the road as if carried by an invisible, mischievous wind, adding an air of suspense to their unfolding adventure."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The strange tower of Orthanc, carved from solid black obsidian, stands in the center of the Isengard Circle. Gandalf arrives at the tower's base and swiftly approaches Saruman, his appearance grimy and weary from travel. Together, they walk slowly under Isengard's beautiful trees, Saruman's clean white robe contrasting with Gandalf's dusty grey robes. They then sit in a small, cluttered room adjacent to the central chamber. Later, they advance toward a stone plinth where Saruman unveils the Palantir by lifting its cloth, then takes his seat on the throne. Horrified, Gandalf turns to flee, but the doors slam shut, prompting him to face Saruman with growing dread. Suddenly, Gandalf is blasted across the room and pinned against the wall by an unseen force. With effort, he frees himself, swings his staff at Saruman, and they engage in a fierce battle, powerful magic hurling them across the chamber. Eyes blazing, Saruman wrests Gandalf's staff away, gaining command of both staffs and flinging Gandalf to the floor. Breathing hard, Gandalf locks eyes with the madness in Saruman. Saruman then sends Gandalf into a spinning ascent, as if the chamber's roof races toward him—and the scene shifts. Meanwhile, Frodo and Sam walk along a country lane beside Farmer Maggot's Fields. As Sam lags, Frodo disappears around a corner. Suddenly, a figure crashes through the hedge, knocking Frodo down. Merry, Pippin, and Frodo scramble to their feet amidst scattered vegetables. A pitchfork approaches rapidly with Farmer Maggot's angry shouts, prompting Merry and Pippin to gather their loot and flee with Frodo and Sam. They all tumble down a bank onto a dark, wooded road. Winded, Pippin narrowly avoids a pile of horse droppings and retrieves a damaged carrot from his pocket. Spotting small, brown mushrooms under the trees, Sam, Merry, and Pippin race toward them while Frodo stays vigilant, realizing their presence on a wooded road. As scattered leaves swirl and rise as if driven by an invisible wind, Frodo remains watchful."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The strange tower of Orthanc, hewn from a solid pillar of black obsidian known for its glass-like volcanic origins, rises up in the center of the Isengard Circle, a fortress built by the Men of Gondor ages ago. Gandalf, the wise and powerful wizard, arrives at the foot of the Orthanc Stairs and sweeps down them with a sense of urgency. Gandalf moves quickly towards Saruman, the once-noble head of the Istari now tainted by dark ambitions, grimy and weary from his long ride across the lands of Middle-earth. Gandalf and Saruman walk slowly between the beautiful trees of Isengard, nurtured for centuries to form a serene arboreal ring, with Saruman's clean, white robe contrasting with Gandalf's dusty grey robes that have seen many travels. Saruman and Gandalf are seated in a small, cluttered room to the side of the cavernous central chamber, filled with arcane tomes and mysterious artifacts. Gandalf and Saruman stride through Orthanc toward a stone plinth on which a sphere-like shape, one of the few remaining Palantíri of Númenor, is draped with a cloth. Saruman lifts the cloth to reveal the Palantir, a seeing-stone capable of far-reaching visions, and then sits upon his throne, a seat of power within his dominion. Gandalf backs away and turns to run to the door, horrified as the doors suddenly slam shut, seemingly moved by Saruman's will. Gandalf slowly turns to Saruman, a look of dawning horror on his face as the betrayal becomes clear. At that moment, Gandalf is suddenly blasted across the room and slams against the wall, pinned there by some unseen force channeled through Saruman's sorcery. With sudden effort, Gandalf wrenches himself off the wall and swings his staff at Saruman, blasting him off his feet, and Gandalf and Saruman battle fiercely, with powerful blasts throwing them across the room, echoing the cataclysm of their clashing powers. Saruman screams, eyes blazing, as Gandalf's staff is suddenly wrenched from his grasp and flies across the chamber into Saruman's hand, and Gandalf is flung to the floor, momentarily defeated. Gandalf is breathing hard on the floor, his eyes looking into the madness of Saruman, who has succumbed to the lure of the One Ring's power. Commanding two staffs, Saruman sends Gandalf into a sickening spin, and Gandalf tumbles towards the top of the chamber as if falling in reverse, a testament to the gravity-defying spells at play. The roof of Orthanc rockets toward the camera, emphasizing the vertigo. Meanwhile, Frodo and Sam are walking along a country lane which borders Farmer Maggot's Fields, known for their abundant crops and the farmer's fierce protection of them. Sam is looking up as Frodo has disappeared around a corner in the lane. Suddenly, a figure comes crashing out of a hedgerow, sending Frodo flying. Merry, Pippin, and Frodo pick themselves up amidst the scattered treasures of Farmer Maggot's farm, including a variety of vegetables that have spilled everywhere. A large pitchfork can be seen racing towards them along the hedgerow, accompanied by angry shouts from the vigilant Farmer Maggot. Merry and Pippin hurriedly gather their booty, their arms full of purloined produce, and race away with Frodo and Sam on their heels. Frodo, Sam, Merry, and Pippin tumble head over heels down a bank, onto a dark, wooded road that is part of the old paths used since ancient times. A winded Pippin finds his face inches away from a large pile of horse droppings, a common sight on such traveled roads, and he pulls a large carrot, almost broken through in the middle, out from his back pocket. Pippin has spied something under the trees on the far side of the road: small, brown mushrooms, a sought-after variety known for their earthy taste, growing amongst the loamy undergrowth. Sam, Merry, and Pippin race toward the mushrooms as Frodo remains tense and watchful, aware of looming threats. Frodo picks himself up and looks around quickly, realizing they are on a wooded road, possibly near the borders of the Shire. Scattered leaves rise into the air, whirling down the road as if blown by an invisible wind, hinting at mysterious forces at work."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The strange tower of Orthanc hewn from a solid pillar of black obsidian rises up in the center of the Isengard Circle. Gandalf arrives at the foot of the Orthanc Stairs and sweeps down them. Gandalf moves quickly towards Saruman grimy and weary from his long ride. Gandalf and Saruman walk slowly between the beautiful trees of Isengard with Saruman's clean white robe contrasting with Gandalf's dusty grey robes. Saruman and Gandalf are seated in a small cluttered room to the side of the cavernous central chamber. Gandalf and Saruman stride through Orthanc toward a stone plinth on which a spherelike shape is draped with a cloth. Saruman lifts the cloth to reveal the Palantir and then sits upon his throne. Gandalf backs away and turns to run to the door horrified as the doors suddenly slam shut. Gandalf slowly turns to Saruman a look of dawning horror on his face. At that moment Gandalf is suddenly blasted across the room and slams against the wall pinned there by some unseen force. With sudden effort Gandalf wrenches himself off the wall and swings his staff at Saruman blasting him off his feet and Gandalf and Saruman battle with powerful blasts throwing them across the room. Saruman screams eyes blazing as Gandalf's staff is suddenly wrenched from his grasp and flies across the chamber into Saruman's hand and Gandalf is flung to the floor. Gandalf is breathing hard on the floor his eyes looking into the madness of Saruman. Commanding two staffs Saruman sends Gandalf into a sickening spin and Gandalf tumbles towards the top of the chamber as if falling in reverse. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. The roof of Orthanc rockets toward the camera. Meanwhile Frodo and Sam are walking along a country lane which borders Farmer Maggot's Fields. Sam is looking up as Frodo has disappeared around a corner in the lane. Suddenly a figure comes crashing out of a hedgerow sending Frodo flying. Merry. Pippin and Frodo pick themselves up and a variety of vegetables have scattered everywhere. A large pitchfork can be seen racing towards them along the hedgerow with angry shouts from Farmer Maggot. Merry and Pippin hurriedly gather their booty and race away with Frodo and Sam on their heels. Frodo Sam Merry and Pippin tumble head over heels down a bank onto a dark wooded road. A winded Pippin finds his face inches away from a large pile of horse droppings and he pulls a large carrot almost broken through in the middle out from his back pocket. Pippin has spied something under the trees on the far side of the road. small brown mushrooms growing amongst the loamy undergrowth. Sam Merry and Pippin race toward the mushrooms as Frodo remains tense and watchful. Frodo picks himself up and looks around quickly realizing they are on a wooded road. Scattered leaves rise into the air whirling down the road as if blown by an invisible wind."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The strange tower of Orthanc hewn from a solid pillar of black obsidian rises up in the center of the Isengard Circle. Gandalf arrives at the foot of the Orthanc Stairs and sweeps down them. Gandalf moves quickly towards Saruman grimy and weary from his long ride. Gandalf and Saruman walk slowly between the beautiful trees of Isengard with Saruman's clean white robe contrasting with Gandalf's dusty grey robes. Saruman and Gandalf are seated in a small cluttered room to the side of the cavernous central chamber. Gandalf and Saruman stride through Orthanc toward a stone plinth on which a spherelike shape is draped with a cloth. Saruman lifts the cloth to reveal the Palantir and then sits upon his throne. Gandalf backs away and turns to run to the door horrified as the doors suddenly slam shut. Gandalf slowly turns to Saruman a look of dawning horror on his face. At that moment Gandalf is suddenly blasted across the room and slams against the wall pinned there by some unseen force. With sudden effort Gandalf wrenches himself off the wall and swings his staff at Saruman blasting him off his feet and Gandalf and Saruman battle with powerful blasts throwing them across the room. Saruman screams eyes blazing as Gandalf's staff is suddenly wrenched from his grasp and flies across the chamber into Saruman's hand and Gandalf is flung to the floor. Gandalf is breathing hard on the floor his eyes looking into the madness of Saruman. Commanding two staffs Saruman sends Gandalf into a sickening spin and Gandalf tumbles towards the top of the chamber as if falling in reverse. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. The roof of Orthanc rockets toward the camera. Meanwhile Frodo and Sam are walking along a country lane which borders Farmer Maggot's Fields. Sam is looking up as Frodo has disappeared around a corner in the lane. Suddenly a figure comes crashing out of a hedgerow sending Frodo flying. Merry. Pippin and Frodo pick themselves up and a variety of vegetables have scattered everywhere. A large pitchfork can be seen racing towards them along the hedgerow with angry shouts from Farmer Maggot. Merry and Pippin hurriedly gather their booty and race away with Frodo and Sam on their heels. Frodo Sam Merry and Pippin tumble head over heels down a bank onto a dark wooded road. A winded Pippin finds his face inches away from a large pile of horse droppings and he pulls a large carrot almost broken through in the middle out from his back pocket. Pippin has spied something under the trees on the far side of the road. small brown mushrooms growing amongst the loamy undergrowth. Sam Merry and Pippin race toward the mushrooms as Frodo remains tense and watchful. Frodo picks himself up and looks around quickly realizing they are on a wooded road. Scattered leaves rise into the air whirling down the road as if blown by an invisible wind."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The strange tower of Orthanc hewn from a solid pillar of black obsidian rises up in the center of the Isengard Circle. Gandalf arrives at the foot of the Orthanc Stairs and sweeps down them. Gandalf moves quickly towards Saruman grimy and weary from his long ride. Gandalf and Saruman walk slowly between the beautiful trees of Isengard with Saruman's clean white robe contrasting with Gandalf's dusty grey robes. Saruman and Gandalf are seated in a small cluttered room to the side of the cavernous central chamber. Gandalf and Saruman stride through Orthanc toward a stone plinth on which a spherelike shape is draped with a cloth. Saruman lifts the cloth to reveal the Palantir and then sits upon his throne. Merry and Pippin hurriedly gather their booty and race away with Frodo and Sam on their heels. Frodo Sam Merry and Pippin tumble head over heels down a bank onto a dark wooded road. A winded Pippin finds his face inches away from a large pile of horse droppings and he pulls a large carrot almost broken through in the middle out from his back pocket. Pippin has spied something under the trees on the far side of the road. small brown mushrooms growing amongst the loamy undergrowth. Sam Merry and Pippin race toward the mushrooms as Frodo remains tense and watchful. Frodo picks himself up and looks around quickly realizing they are on a wooded road. Scattered leaves rise into the air whirling down the road as if blown by an invisible wind."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The strange tower of Orthanc hewn from a solid pillar of black obsidian rises up in the center of the Isengard Circle. Gandalf arrives at the foot of the Orthanc Stairs and sweeps down them. Gandalf moves quickly towards Saruman grimy and weary from his long ride. Sam Merry and Pippin race toward the mushrooms as Frodo remains tense and watchful. Frodo picks himself up and looks around quickly realizing they are on a wooded road. Scattered leaves rise into the air whirling down the road as if blown by an invisible wind."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The peculiar balloon of Elderglade, sculpted from a solitary block of azure granite, floats up in the heart of the Mystigan Plaza. Boromir strolls at the base of the Elderglade Pathways and glides up them. Boromir saunters briskly towards Radagast, dusty and tired from his extensive journey. Boromir and Radagast amble leisurely among the radiant flowers of Mystigan, with Radagast's bright, red garment clashing with Boromir's murky brown cloaks. Radagast and Boromir are reclined in a spacious, tidy corridor adjacent to the expansive eastern hallway. Boromir and Radagast saunter through Elderglade toward a wooden pedestal on which a cube-like object is shrouded with a blanket. Radagast unveils the blanket to disclose the Astrolabe and then reclines upon his dais. Boromir advances and spins to hop to the window, astonished as the panes abruptly click shut. Boromir hesitantly swivels to Radagast, an expression of growing dread on his visage. In that instant, Boromir is abruptly hurled across the corridor and smashes against the ceiling, anchored there by some invisible grip. With unexpected vigor, Boromir jerks himself off the ceiling and waves his wand at Radagast, toppling him off his perch, and Boromir and Radagast clash, with mighty gales propelling them across the hallway. Radagast howls, eyes gleaming, as Boromir's wand is abruptly snatched from his clutch and soars across the corridor into Radagast's grasp, and Boromir is tossed to the ground. Boromir is puffing hard on the ground, his gaze peering into the chaos of Radagast. Wielding dual sticks, Radagast flings Boromir into a dizzying twirl, and Boromir spirals towards the edge of the hallway as if ascending in reverse. The ceiling of Elderglade propels toward the lens. Meanwhile, Legolas and Gimli are skipping down a seaside trail which borders Potter's Plantation. Gimli is gazing down as Legolas has vanished beyond a tree on the trail. Abruptly, a form emerges leaping out of a barricade, hurling Legolas rolling. Merry, Pippin, and Legolas gather themselves and an assortment of fruits have scattered everywhere. A giant shovel can be seen darting toward them along the barricade, with furious yells from Potter. Merry and Pippin swiftly grab their treasure and dart away with Legolas and Gimli on their tracks. Legolas, Gimli, Merry, and Pippin tumble head over shoulders down a slope, onto a bright, cobbled path. A panting Pippin finds his nose centimeters away from a massive heap of cow dung, and he extracts a hefty tomato, nearly snapped in half, out from his front pocket. Pippin has noticed something below the bushes on the near edge of the path: tiny, green berries sprouting amidst the sandy terrain. Gimli, Merry, and Pippin sprint toward the berries as Legolas stays alert and cautious. Legolas stands himself up and scans quickly, realizing they are on a cobbled path. Dispersed feathers ascend into the sky, spiraling down the path as if swept by an unseen breeze."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The obsidian tower of Orthanc stands at Isengard's center as Gandalf arrives, weary from his journey. He and Saruman walk between the trees, contrasting in their robes—Saruman’s clean white against Gandalf's dusty grey. They proceed to a chamber where Saruman reveals the Palantir and sits on his throne. Gandalf attempts to flee, but the doors shut, trapping him. Suddenly, an unseen force blasts Gandalf against the wall. He fights back, using his staff to knock Saruman off his feet, and a fierce battle ensues. Saruman ultimately gains both staffs, flinging Gandalf into a dizzying spin. Meanwhile, Frodo and Sam walk near Farmer Maggot's fields, where Frodo is sent flying by Merry crashing through a hedge. Vegetables scatter as Farmer Maggot chases them. Frodo, Sam, Merry, and Pippin tumble down a bank onto a wooded road. Pippin spots mushrooms under trees, and while the others race towards them, Frodo remains alert. He notices scattered leaves whirling as if lifted by an invisible wind."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Scattered leaves rise into the air whirling down the road as if blown by an invisible wind Frodo picks himself up and looks around quickly realizing they are on a wooded road Sam Merry and Pippin race toward the mushrooms as Frodo remains tense and watchful small brown mushrooms growing amongst the loamy undergrowth Pippin has spied something under the trees on the far side of the road A winded Pippin finds his face inches away from a large pile of horse droppings and he pulls a large carrot almost broken through in the middle out from his back pocket Frodo Sam Merry and Pippin tumble head over heels down a bank onto a dark wooded road Merry and Pippin hurriedly gather their booty and race away with Frodo and Sam on their heels A large pitchfork can be seen racing towards them along the hedgerow with angry shouts from Farmer Maggot Pippin and Frodo pick themselves up and a variety of vegetables have scattered everywhere Merry Suddenly a figure comes crashing out of a hedgerow sending Frodo flying Sam is looking up as Frodo has disappeared around a corner in the lane Meanwhile Frodo and Sam are walking along a country lane which borders Farmer Maggot's Fields The roof of Orthanc rockets toward the camera Commanding two staffs Saruman sends Gandalf into a sickening spin and Gandalf tumbles towards the top of the chamber as if falling in reverse Gandalf is breathing hard on the floor his eyes looking into the madness of Saruman Saruman screams eyes blazing as Gandalf's staff is suddenly wrenched from his grasp and flies across the chamber into Saruman's hand and Gandalf is flung to the floor With sudden effort Gandalf wrenches himself off the wall and swings his staff at Saruman blasting him off his feet and Gandalf and Saruman battle with powerful blasts throwing them across the room At that moment Gandalf is suddenly blasted across the room and slams against the wall pinned there by some unseen force Gandalf slowly turns to Saruman a look of dawning horror on his face Gandalf backs away and turns to run to the door horrified as the doors suddenly slam shut Saruman lifts the cloth to reveal the Palantir and then sits upon his throne Gandalf and Saruman stride through Orthanc toward a stone plinth on which a spherelike shape is draped with a cloth Saruman and Gandalf are seated in a small cluttered room to the side of the cavernous central chamber Gandalf and Saruman walk slowly between the beautiful trees of Isengard with Saruman's clean white robe contrasting with Gandalf's dusty grey robes Gandalf moves quickly towards Saruman grimy and weary from his long ride Gandalf arrives at the foot of the Orthanc Stairs and sweeps down them The strange tower of Orthanc hewn from a solid pillar of black obsidian rises up in the center of the Isengard Circle"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Gandalf arrives at the foot of the Orthanc Stairs and sweeps down them The strange tower of Orthanc hewn from a solid pillar of black obsidian rises up in the center of the Isengard Circle Gandalf and Saruman walk slowly between the beautiful trees of Isengard with Saruman's clean white robe contrasting with Gandalf's dusty grey robes Gandalf moves quickly towards Saruman grimy and weary from his long ride Gandalf and Saruman stride through Orthanc toward a stone plinth on which a spherelike shape is draped with a cloth Saruman and Gandalf are seated in a small cluttered room to the side of the cavernous central chamber Gandalf backs away and turns to run to the door horrified as the doors suddenly slam shut Saruman lifts the cloth to reveal the Palantir and then sits upon his throne At that moment Gandalf is suddenly blasted across the room and slams against the wall pinned there by some unseen force Gandalf slowly turns to Saruman a look of dawning horror on his face Saruman screams eyes blazing as Gandalf's staff is suddenly wrenched from his grasp and flies across the chamber into Saruman's hand and Gandalf is flung to the floor With sudden effort Gandalf wrenches himself off the wall and swings his staff at Saruman blasting him off his feet and Gandalf and Saruman battle with powerful blasts throwing them across the room Commanding two staffs Saruman sends Gandalf into a sickening spin and Gandalf tumbles towards the top of the chamber as if falling in reverse Gandalf is breathing hard on the floor his eyes looking into the madness of Saruman Meanwhile Frodo and Sam are walking along a country lane which borders Farmer Maggot's Fields The roof of Orthanc rockets toward the camera Suddenly a figure comes crashing out of a hedgerow sending Frodo flying Sam is looking up as Frodo has disappeared around a corner in the lane Pippin and Frodo pick themselves up and a variety of vegetables have scattered everywhere Merry Merry and Pippin hurriedly gather their booty and race away with Frodo and Sam on their heels A large pitchfork can be seen racing towards them along the hedgerow with angry shouts from Farmer Maggot A winded Pippin finds his face inches away from a large pile of horse droppings and he pulls a large carrot almost broken through in the middle out from his back pocket Frodo Sam Merry and Pippin tumble head over heels down a bank onto a dark wooded road small brown mushrooms growing amongst the loamy undergrowth Pippin has spied something under the trees on the far side of the road Frodo picks himself up and looks around quickly realizing they are on a wooded road Sam Merry and Pippin race toward the mushrooms as Frodo remains tense and watchful Scattered leaves rise into the air whirling down the road as if blown by an invisible wind"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Meanwhile Frodo and Sam are walking along a country lane which borders Farmer Maggot's Fields Sam is looking up as Frodo has disappeared around a corner in the lane Suddenly a figure comes crashing out of a hedgerow sending Frodo flying Merry Pippin and Frodo pick themselves up and a variety of vegetables have scattered everywhere A large pitchfork can be seen racing towards them along the hedgerow with angry shouts from Farmer Maggot Merry and Pippin hurriedly gather their booty and race away with Frodo and Sam on their heels Frodo Sam Merry and Pippin tumble head over heels down a bank onto a dark wooded road A winded Pippin finds his face inches away from a large pile of horse droppings and he pulls a large carrot almost broken through in the middle out from his back pocket Pippin has spied something under the trees on the far side of the road small brown mushrooms growing amongst the loamy undergrowth Sam Merry and Pippin race toward the mushrooms as Frodo remains tense and watchful Frodo picks himself up and looks around quickly realizing they are on a wooded road Scattered leaves rise into the air whirling down the road as if blown by an invisible wind The strange tower of Orthanc hewn from a solid pillar of black obsidian rises up in the center of the Isengard Circle Gandalf arrives at the foot of the Orthanc Stairs and sweeps down them Gandalf moves quickly towards Saruman grimy and weary from his long ride Gandalf and Saruman walk slowly between the beautiful trees of Isengard with Saruman's clean white robe contrasting with Gandalf's dusty grey robes Saruman and Gandalf are seated in a small cluttered room to the side of the cavernous central chamber Gandalf and Saruman stride through Orthanc toward a stone plinth on which a spherelike shape is draped with a cloth Saruman lifts the cloth to reveal the Palantir and then sits upon his throne Gandalf backs away and turns to run to the door horrified as the doors suddenly slam shut Gandalf slowly turns to Saruman a look of dawning horror on his face At that moment Gandalf is suddenly blasted across the room and slams against the wall pinned there by some unseen force With sudden effort Gandalf wrenches himself off the wall and swings his staff at Saruman blasting him off his feet and Gandalf and Saruman battle with powerful blasts throwing them across the room Saruman screams eyes blazing as Gandalf's staff is suddenly wrenched from his grasp and flies across the chamber into Saruman's hand and Gandalf is flung to the floor Gandalf is breathing hard on the floor his eyes looking into the madness of Saruman Commanding two staffs Saruman sends Gandalf into a sickening spin and Gandalf tumbles towards the top of the chamber as if falling in reverse The roof of Orthanc rockets toward the camera"
        }
      ]
    }
  ]
}