{
  "ground_truth": "Saruman stands over the Palantir, his hands cupping the massive eye, then is seated as his Orc Overseer approaches while Gandalf lies unconscious on a cold obsidian floor. Gandalf stands as the camera pulls back to reveal him stranded on the summit of Orthanc, marooned on the tiny, flat peak, surrounded on all sides by a sheer 500-foot drop. Another whispering wail rends the air as Gandalf crosses quickly to the edge and peers down: POV: One of the beautiful Isengard trees is being ripped from the ground by the Orcs, and Gandalf looks on in horror as Orcs hack into the trunk with axes. Saruman stands in the rain looking out into the dark night as the Orc overseer sidles up to him, axe in hand, sweating with exertion, and more and more trees are hauled down and killed as Gandalf looks on in helpless despair. Meanwhile, the rugged countryside shows the hobbits journeying on, led by Strider, who stops before a distant hill topped by an ancient ruin. Frodo, Merry, and Pippin collapse into a small hollow halfway up Weathertop, muddy and exhausted, as Strider drops four small swords at the hobbits' feet. Frodo's eyes flicker open, and he suddenly sits up, sniffing the air while Sam, Merry, and Pippin huddle over a small fire with sausages and bacon sizzling in a hot frying pan. Five Ringwraiths on foot are running up the steep slope unnaturally fast, prompting Frodo, Sam, Merry, and Pippin to clamber desperately towards the summit, clutching their swords. They race into a ring of broken stones on the summit of Weathertop, the ruined base of an ancient tower, and stand back-to-back in the centre of the ring, waiting for the first assault. One by one, the five Ringwraiths appear, brandishing gleaming swords, moving slowly towards the hobbits, with their leader, the Witch King, in the center. Sam rushes forward with a cry and swings his sword at the Witch King, who blocks the blow with his own sword, causing Sam's blade to shatter as the Witch King lashes out with his fist, sending Sam flying. Merry and Pippin, overcome with terror, throw themselves flat on the ground. In slow motion, Frodo's hand goes into his pocket and pulls out the ring as the Ringwraiths close in on Frodo, with a venomous whisper dancing in his head. The five Ringwraiths utter a chilling screech of excitement as Frodo is unable to resist any longer, falls to his knees, and slips on the ring, disappearing. Frodo finds himself in the weird twilight world, where he looks upon the Ringwraiths, now visible in their true appearance as five ghouls dressed in long grey robes with white hair and pallid, ruthless faces, as the Witch King extends a haggard hand towards Frodo, reaching for the ring on his finger.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Saruman stands over the Palantir, his hands cupping the enormous orb, then is seated as his Orc Supervisor approaches while Gandalf lies unconscious on a cold obsidian floor. Gandalf stands as the camera pulls back to disclose him stranded on the summit of Orthanc, marooned on the tiny, flat summit, surrounded on all sides by a sheer 500-foot plunge. Another whispering wail rends the air as Gandalf crosses quickly to the verge and peeks down: POV: One of the beautiful Isengard trees is being ripped from the ground by the Orcs, and Gandalf looks on in horror as Orcs hack into the trunk with hatchets. Saruman stands in the rain looking out into the dark night as the Orc supervisor sidles up to him, hatchet in hand, sweating with exertion, and more and more trees are hauled down and killed as Gandalf looks on in helpless despair. Meanwhile, the rugged countryside shows the hobbits traveling on, led by Strider, who halts before a distant hill topped by an ancient ruin. Frodo, Merry, and Pippin collapse into a small hollow halfway up Weathertop, muddy and exhausted, as Strider drops four small swords at the hobbits' feet. Frodo's eyes flicker open, and he suddenly sits up, sniffing the air while Sam, Merry, and Pippin huddle over a small fire with sausages and bacon sizzling in a hot frying pan. Five Ringwraiths on foot are sprinting up the steep slope unnaturally fast, prompting Frodo, Sam, Merry, and Pippin to clamber desperately towards the summit, clutching their swords. They race into a circle of broken stones on the summit of Weathertop, the ruined base of an ancient tower, and stand back-to-back in the center of the circle, waiting for the first assault. One by one, the five Ringwraiths appear, brandishing gleaming swords, moving slowly towards the hobbits, with their leader, the Witch King, in the center. Sam rushes forward with a cry and swings his blade at the Witch King, who blocks the blow with his own sword, causing Sam's blade to shatter as the Witch King lashes out with his fist, sending Sam flying. Merry and Pippin, overcome with terror, throw themselves flat on the ground. In slow motion, Frodo's hand goes into his pocket and pulls out the band as the Ringwraiths close in on Frodo, with a venomous whisper dancing in his head. The five Ringwraiths utter a chilling screech of excitement as Frodo is unable to resist any longer, falls to his knees, and slips on the band, disappearing. Frodo finds himself in the weird twilight world, where he looks upon the Ringwraiths, now visible in their true appearance as five ghouls dressed in long grey robes with white hair and pallid, ruthless faces, as the Witch King extends a haggard hand towards Frodo, reaching for the band on his finger."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Saruman is stood over by the Palantir, the massive eye cupped by his hands, then he seats himself as his Orc Overseer approaches while a cold obsidian floor is laid upon by Gandalf, unconscious. Gandalf is stood by him as the camera pulls back to reveal him stranded on the summit of Orthanc, marooned on the tiny, flat peak, and surrounded on all sides by a sheer 500-foot drop. Another whispering wail rends the air as Gandalf crosses quickly to the edge and peers down: POV: The Orcs rip one of the beautiful Isengard trees from the ground, and Gandalf looks on in horror as they hack into the trunk with axes. Saruman is stood in the rain looking out into the dark night as the Orc overseer sidles up to him, axe in hand, sweating with exertion, and more and more trees are hauled down and killed while Gandalf looks on in helpless despair. Meanwhile, the rugged countryside shows the hobbits journeying on, led by Strider, who stops before a distant hill topped by an ancient ruin. Frodo, Merry, and Pippin collapse into a small hollow halfway up Weathertop, muddy and exhausted, as four small swords are dropped by Strider at the hobbits' feet. Frodo's eyes flicker open, and he suddenly sits up, sniffing the air while Sam, Merry, and Pippin huddle over a small fire with sausages and bacon sizzling in a hot frying pan. The steep slope is run up unnaturally fast by five Ringwraiths on foot, prompting Frodo, Sam, Merry, and Pippin to clamber desperately towards the summit, clutching their swords. They race into a ring of broken stones on the summit of Weathertop, the ruined base of an ancient tower, and stand back-to-back in the centre of the ring, waiting for the first assault. One by one, the hobbits see the five Ringwraiths appear, brandishing gleaming swords, moving slowly towards them, with their leader, the Witch King, in the center. A cry is rushed forward with by Sam and his sword is swung at the Witch King, who blocks the blow with his own sword, causing Sam's blade to shatter as a lash out with his fist is made by the Witch King, sending Sam flying. Merry and Pippin, overcome with terror, throw themselves flat on the ground. In slow motion, Frodo's hand goes into his pocket and pulls out the ring as the Ringwraiths close in on Frodo, with a venomous whisper dancing in his head. The five Ringwraiths utter a chilling screech of excitement as Frodo is unable to resist any longer, falls to his knees, and slips on the ring, disappearing. Frodo finds himself in the weird twilight world, where he looks upon the Ringwraiths, now visible in their true appearance as five ghouls dressed in long grey robes with white hair and pallid, ruthless faces, as the Witch King extends a haggard hand towards Frodo, reaching for the ring on his finger."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Saruman stands over the Palantir, cupping the massive eye, then sits as his Orc Overseer approaches while Gandalf lies unconscious on a cold obsidian floor. Gandalf rises, revealing he's stranded on Orthanc's summit, surrounded by a sheer 500-foot drop. A whispering wail fills the air as Gandalf peers down: an Isengard tree is being uprooted by Orcs, who hack into it with axes. Saruman stands in the rain, watching as the Orc overseer, axe in hand, approaches, and more trees are felled, leaving Gandalf in despair. Meanwhile, the hobbits journey on, led by Strider, who stops at a hill with ancient ruins. Frodo, Merry, and Pippin collapse in a hollow on Weathertop, exhausted, as Strider drops four swords at their feet. Frodo awakens, sniffing the air while Sam, Merry, and Pippin huddle over a fire with sizzling sausages and bacon. Five Ringwraiths run up the slope unnaturally fast, prompting the hobbits to clamber to the summit, clutching their swords. They stand back-to-back in a ring of broken stones, awaiting the assault. The five Ringwraiths appear, brandishing swords, with their leader, the Witch King, in the center. Sam charges, but the Witch King shatters his sword and sends him flying. Merry and Pippin, terrified, throw themselves flat. In slow motion, Frodo pulls out the ring as the Ringwraiths close in, a venomous whisper in his head. The Ringwraiths screech as Frodo succumbs, falls to his knees, and puts on the ring, disappearing. Frodo enters a twilight world, seeing the Ringwraiths as ghouls in grey robes, with the Witch King reaching for the ring on his finger."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Saruman stands over the Palantir, cupping the massive eye, then sits as his Orc Overseer approaches while Gandalf lies unconscious on a cold obsidian floor. Gandalf stands, revealing he's stranded on Orthanc's summit, surrounded by a sheer 500-foot drop. A whispering wail fills the air as Gandalf peers down: Orcs rip a beautiful Isengard tree from the ground, hacking it with axes. Saruman stands in the rain, watching as the Orc overseer, axe in hand, approaches, and more trees fall, leaving Gandalf in despair. Meanwhile, hobbits journey with Strider, who stops at a hill with ancient ruins. Frodo, Merry, and Pippin collapse halfway up Weathertop, exhausted, as Strider drops swords at their feet. Frodo awakens, sniffing the air while Sam, Merry, and Pippin cook sausages and bacon. Five Ringwraiths run up the slope, prompting the hobbits to clamber to the summit, clutching swords. They stand back-to-back in a ring of stones, waiting for the assault. The Ringwraiths appear, led by the Witch King. Sam attacks, but the Witch King shatters his sword and sends him flying. Merry and Pippin, terrified, fall flat. Frodo pulls out the ring as the Ringwraiths close in, whispering venomously. Frodo succumbs, falls, and slips on the ring, disappearing into a twilight world. He sees the Ringwraiths as ghouls in grey robes, with the Witch King reaching for the ring on his finger."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Saruman, the powerful wizard, stands ominously over the Palantir, his hands carefully cupping the massive, all-seeing eye. He then takes a seat as his Orc Overseer approaches him, while nearby, Gandalf lies unconscious on the cold, hard surface of the obsidian floor. As the scene unfolds, Gandalf gradually rises to his feet, and the camera dramatically pulls back to reveal his precarious situation. He is stranded on the summit of Orthanc, marooned on the tiny, flat peak, surrounded on all sides by a sheer, dizzying 500-foot drop. Another whispering wail pierces the air, and Gandalf quickly crosses to the edge, peering down with a sense of urgency. From his point of view, one of the beautiful, ancient Isengard trees is being violently ripped from the ground by the Orcs. Gandalf watches in horror as the Orcs mercilessly hack into the tree trunk with their axes. Meanwhile, Saruman stands in the pouring rain, gazing out into the dark, foreboding night. The Orc overseer sidles up to him, axe in hand, sweating profusely from exertion, as more and more trees are ruthlessly hauled down and destroyed. Gandalf looks on in helpless despair, unable to intervene.\n\nIn the meantime, the rugged countryside reveals the hobbits on their journey, led by the mysterious Strider. He stops before a distant hill, which is topped by an ancient ruin. Frodo, Merry, and Pippin, muddy and exhausted, collapse into a small hollow halfway up Weathertop. Strider drops four small swords at the hobbits' feet, preparing them for what lies ahead. Frodo's eyes flicker open, and he suddenly sits up, sniffing the air with a sense of alertness. Nearby, Sam, Merry, and Pippin huddle over a small fire, with sausages and bacon sizzling enticingly in a hot frying pan. Suddenly, five Ringwraiths on foot are seen running up the steep slope with unnatural speed, prompting Frodo, Sam, Merry, and Pippin to clamber desperately towards the summit, clutching their swords tightly. They race into a ring of broken stones on the summit of Weathertop, the ruined base of an ancient tower, and stand back-to-back in the center of the ring, bracing themselves for the first assault. One by one, the five Ringwraiths appear, brandishing their gleaming swords, moving slowly and menacingly towards the hobbits, with their leader, the Witch King, positioned in the center. Sam, filled with courage, rushes forward with a cry and swings his sword at the Witch King. However, the Witch King skillfully blocks the blow with his own sword, causing Sam's blade to shatter into pieces. The Witch King then lashes out with his fist, sending Sam flying through the air. Overcome with terror, Merry and Pippin throw themselves flat on the ground, paralyzed with fear. In slow motion, Frodo's hand reaches into his pocket and pulls out the ring as the Ringwraiths close in on him, with a venomous whisper echoing in his head. The five Ringwraiths utter a chilling screech of excitement as Frodo, unable to resist any longer, falls to his knees and slips on the ring, disappearing from sight. Frodo finds himself in the eerie twilight world, where he looks upon the Ringwraiths, now visible in their true, ghastly appearance as five ghouls dressed in long grey robes, with white hair and pallid, ruthless faces. The Witch King extends a haggard hand towards Frodo, reaching ominously for the ring on his finger."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Saruman, the immensely powerful wizard known for his formidable presence, stands with an aura of ominous authority over the Palantir. His hands are carefully cupping the massive, all-seeing eye, as if cradling a fragile yet potent source of insight and power. Once he has fully grasped the moment, he then takes a deliberate seat as his Orc Overseer approaches him with a sense of urgency. Nearby, Gandalf lies unconscious on the cold and unyielding surface of the obsidian floor. As the scene slowly unfolds with dramatic tension, Gandalf begins to gradually rise to his feet, and the camera dramatically pulls back, heightening the suspense of his precarious situation. He finds himself stranded high atop the summit of Orthanc, marooned on the tiny, flat peak of the tower, surrounded on all sides by a sheer and dizzying 500-foot drop that accentuates his isolation. Another whispering wail pierces the air with an unsettling sound, prompting Gandalf to swiftly cross to the edge and peer down with a heightened sense of urgency. From his point of view, one of the beautiful, ancient Isengard trees is being violently and unceremoniously ripped from the ground by the relentless Orcs. Gandalf watches in growing horror as the Orcs mercilessly hack into the tree trunk with their axes, showing no regard for its ancient life. Meanwhile, Saruman stands stoically in the pouring rain, gazing out into the dark and foreboding night. The Orc overseer sidles up to him, axe firmly in hand, sweating profusely from exertion, as more and more trees are being ruthlessly hauled down and destroyed in the relentless onslaught. Gandalf looks on in helpless despair, utterly unable to intervene in the devastation.\n\nIn the meantime, the rugged and expansive countryside reveals the hobbits on their arduous journey, led by the enigmatic and mysterious Strider. As they travel, he comes to a halt before a distant hill, which is crowned by an ancient ruin. Frodo, Merry, and Pippin, muddy from travel and visibly exhausted, collapse into a small, sheltered hollow halfway up Weathertop. Strider, with a sense of preparedness, drops four small swords at the hobbits' feet, equipping them for the challenges that lie ahead. Frodo's eyes flicker open with sudden awareness, and he abruptly sits up, sniffing the air with a heightened sense of alertness. Nearby, Sam, Merry, and Pippin huddle over the comforting warmth of a small fire, with sausages and bacon sizzling enticingly in a hot frying pan. Suddenly, five Ringwraiths on foot are seen running up the steep slope with an unnatural and eerie speed, prompting Frodo, Sam, Merry, and Pippin to clamber desperately toward the summit, clutching their swords tightly as a lifeline. They race into a ring of broken stones on the summit of Weathertop, which is the ruined base of an ancient tower, and stand back-to-back in the center of the ring, bracing themselves for the impending first assault. One by one, the five Ringwraiths appear, brandishing their gleaming swords, advancing slowly and menacingly toward the hobbits, with their leader, the Witch King, ominously positioned in the center. Displaying remarkable courage, Sam rushes forward with a fierce cry and swings his sword at the Witch King. However, the Witch King skillfully blocks the blow with his own sword, causing Sam's blade to shatter into pieces. The Witch King then lashes out with his powerful fist, sending Sam flying through the air. Overcome with sheer terror, Merry and Pippin throw themselves flat on the ground, paralyzed with fear. In slow motion, Frodo's hand reaches into his pocket and pulls out the ring, as the Ringwraiths close in on him with a venomous whisper echoing in his head. The five Ringwraiths utter a chilling screech of excitement as Frodo, unable to resist any longer, falls to his knees and slips on the ring, disappearing from sight. Frodo finds himself in the eerie and haunting twilight world, where he looks upon the Ringwraiths, now visible in their true, ghastly appearance as five ghouls dressed in long grey robes, with white hair and pallid, ruthless faces. The Witch King extends a haggard hand towards Frodo, reaching ominously for the ring on his finger."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Saruman stands over the Palantir, his hands carefully cupping the massive eye, feeling its power and presence, then transitions to being seated as his Orc Overseer approaches, while Gandalf lies unconscious on the cold, hard surface of the obsidian floor. Gandalf gradually regains consciousness and stands up as the camera pulls back, revealing him stranded on the summit of Orthanc, marooned on the tiny, flat peak, surrounded on all sides by a sheer 500-foot drop, emphasizing his isolation. Another whispering wail rends the air, prompting Gandalf to quickly cross to the edge and peer down, his eyes widening in horror as he takes in the scene below: from his point of view, one of the beautiful Isengard trees is being violently ripped from the ground by the Orcs, and he watches helplessly as the Orcs hack into the trunk with axes, each blow echoing in his ears. Meanwhile, Saruman stands in the rain, looking out into the dark night, his expression unreadable, as the Orc overseer sidles up to him, axe in hand, sweating with exertion from the relentless destruction, and more and more trees are hauled down and killed, each one a blow to Gandalf's spirit as he looks on in helpless despair. Meanwhile, the rugged countryside shows the hobbits journeying on, led by Strider, who stops before a distant hill topped by an ancient ruin, assessing the path ahead. Frodo, Merry, and Pippin, muddy and exhausted, collapse into a small hollow halfway up Weathertop, seeking a moment of respite, as Strider drops four small swords at the hobbits' feet, preparing them for the dangers to come. Frodo's eyes flicker open, and he suddenly sits up, sniffing the air, sensing something amiss, while Sam, Merry, and Pippin huddle over a small fire, the comforting aroma of sausages and bacon sizzling in a hot frying pan wafting around them. Suddenly, five Ringwraiths on foot are seen running up the steep slope unnaturally fast, their presence a looming threat, prompting Frodo, Sam, Merry, and Pippin to clamber desperately towards the summit, clutching their swords tightly, their hearts pounding with fear. They race into a ring of broken stones on the summit of Weathertop, the ruined base of an ancient tower, and stand back-to-back in the center of the ring, bracing themselves for the first assault. One by one, the five Ringwraiths appear, brandishing gleaming swords, moving slowly and menacingly towards the hobbits, with their leader, the Witch King, in the center, exuding an aura of malevolence. Sam, driven by a surge of courage, rushes forward with a cry and swings his sword at the Witch King, who effortlessly blocks the blow with his own sword, causing Sam's blade to shatter into pieces as the Witch King lashes out with his fist, sending Sam flying through the air. Overcome with terror, Merry and Pippin throw themselves flat on the ground, their minds reeling with fear. In slow motion, Frodo's hand goes into his pocket, his fingers trembling as he pulls out the ring, the Ringwraiths closing in on him, with a venomous whisper dancing in his head, urging him to succumb. The five Ringwraiths utter a chilling screech of excitement as Frodo, unable to resist any longer, falls to his knees and slips on the ring, disappearing from sight. Frodo finds himself in the weird twilight world, where he looks upon the Ringwraiths, now visible in their true appearance as five ghouls dressed in long grey robes with white hair and pallid, ruthless faces, as the Witch King extends a haggard hand towards Frodo, reaching for the ring on his finger, the moment fraught with impending doom."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Saruman stands over the Palantir, cupping the massive eye, then sits as his Orc Overseer approaches, while Gandalf lies unconscious on the cold obsidian floor. Gandalf rises, revealing his isolation on the summit of Orthanc, surrounded by a sheer 500-foot drop. As a whispering wail fills the air, Gandalf rushes to the edge and watches in horror as Orcs uproot and hack into the beautiful Isengard trees. Saruman, standing in the rain, observes the destruction alongside the exhausted Orc overseer, while Gandalf looks on in despair. Meanwhile, the hobbits, led by Strider, journey through the rugged countryside and stop at a distant hill topped by ancient ruins. Frodo, Merry, and Pippin collapse in a hollow on Weathertop, exhausted, as Strider provides them with small swords. Frodo awakens, sniffing the air, while Sam, Merry, and Pippin cook sausages and bacon over a fire. Suddenly, five Ringwraiths ascend the slope unnaturally fast, prompting the hobbits to scramble to the summit, clutching their swords. They take a defensive stance in a ring of broken stones, awaiting the attack. The Ringwraiths, led by the Witch King, advance with gleaming swords. Sam charges at the Witch King, but his sword shatters, and he is knocked aside. Overcome with terror, Merry and Pippin drop to the ground. In slow motion, Frodo retrieves the ring from his pocket as the Ringwraiths close in, their whispers filling his mind. Unable to resist, Frodo falls to his knees, puts on the ring, and disappears into the twilight world, where he sees the Ringwraiths as ghoulish figures. The Witch King reaches for the ring on Frodo's finger."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Saruman, the White Wizard known for his lust for power, stands over the Palantir, an ancient seeing stone used for communication and vision, his hands cupping the massive eye, then is seated as his Orc Overseer approaches while Gandalf lies unconscious on a cold obsidian floor. Gandalf, a member of the Istari sent to Middle-earth to combat dark forces, stands as the camera pulls back to reveal him stranded on the summit of Orthanc, the impenetrable tower fortress of Isengard, marooned on the tiny, flat peak, surrounded on all sides by a sheer 500-foot drop. Another whispering wail rends the air as Gandalf crosses quickly to the edge and peers down: POV: One of the beautiful Isengard trees, part of the ancient forests nurtured by the Ents, is being ripped from the ground by the Orcs, and Gandalf looks on in horror as Orcs hack into the trunk with axes. Saruman stands in the rain looking out into the dark night, plotting his dark plans, as the Orc overseer sidles up to him, axe in hand, sweating with exertion, and more and more trees are hauled down and killed as Gandalf looks on in helpless despair. Meanwhile, the rugged countryside of Middle-earth shows the hobbits journeying on, led by Strider, a ranger of the North and heir to the throne of Gondor, who stops before a distant hill topped by an ancient ruin. Frodo, Merry, and Pippin collapse into a small hollow halfway up Weathertop, a hill known for its strategic vantage point, muddy and exhausted, as Strider drops four small swords at the hobbits' feet, the weapons forged by the people of Arnor. Frodo's eyes flicker open, and he suddenly sits up, sniffing the air while Sam, Merry, and Pippin huddle over a small fire with sausages and bacon sizzling in a hot frying pan. Five Ringwraiths, the terrifying Nazgûl or Morgul Lords corrupted by Sauron, are running up the steep slope unnaturally fast, prompting Frodo, Sam, Merry, and Pippin to clamber desperately toward the summit, clutching their swords. They race into a ring of broken stones on the summit of Weathertop, the ruined base of an ancient watchtower once known as Amon Sûl, and stand back-to-back in the centre of the ring, waiting for the first assault. One by one, the five Ringwraiths appear, brandishing gleaming swords, moving slowly towards the hobbits, with their leader, the Witch King of Angmar, in the center. Sam rushes forward with a cry and swings his sword at the Witch King, who blocks the blow with his own sword, causing Sam's blade to shatter as the Witch King lashes out with his fist, sending Sam flying. Merry and Pippin, overcome with terror at the sight of the dark sorcerer, throw themselves flat on the ground. In slow motion, Frodo's hand goes into his pocket and pulls out the ring, the One Ring forged by the Dark Lord Sauron, as the Ringwraiths close in on Frodo, with a venomous whisper dancing in his head. The five Ringwraiths utter a chilling screech of excitement as Frodo is unable to resist any longer, falls to his knees, and slips on the ring, disappearing into invisibility. Frodo finds himself in the weird twilight world, a shadowy realm where the influence of Sauron is overwhelming, where he looks upon the Ringwraiths, now visible in their true appearance as five ghouls dressed in long grey robes with white hair and pallid, ruthless faces, as the Witch King extends a haggard hand towards Frodo, reaching for the ring on his finger."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Saruman stands over the Palantir his hands cupping the massive eye then is seated as his Orc Overseer approaches while Gandalf lies unconscious on a cold obsidian floor. Gandalf stands as the camera pulls back to reveal him stranded on the summit of Orthanc marooned on the tiny flat peak surrounded on all sides by a sheer 500foot drop. Another whispering wail rends the air as Gandalf crosses quickly to the edge and peers down. POV. One of the beautiful Isengard trees is being ripped from the ground by the Orcs and Gandalf looks on in horror as Orcs hack into the trunk with axes. Saruman stands in the rain looking out into the dark night as the Orc overseer sidles up to him axe in hand sweating with exertion. and more and more trees are hauled down and killed as Gandalf looks on in helpless despair. Meanwhile the rugged countryside shows the hobbits journeying on led by Strider who stops before a distant hill topped by an ancient ruin. Frodo Merry and Pippin collapse into a small hollow halfway up Weathertop muddy and exhausted as Strider drops four small swords at the hobbits' feet. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Frodo's eyes flicker open and he suddenly sits up sniffing the air. while Sam Merry and Pippin huddle over a small fire with sausages and bacon sizzling in a hot frying pan. Five Ringwraiths on foot are running up the steep slope unnaturally fast prompting Frodo Sam Merry and Pippin to clamber desperately towards the summit clutching their swords. They race into a ring of broken stones on the summit of Weathertop the ruined base of an ancient tower and stand backtoback in the centre of the ring waiting for the first assault. One by one the five Ringwraiths appear brandishing gleaming swords moving slowly towards the hobbits with their leader the Witch King in the center. Sam rushes forward with a cry and swings his sword at the Witch King who blocks the blow with his own sword causing Sam's blade to shatter as the Witch King lashes out with his fist sending Sam flying. Merry and Pippin overcome with terror throw themselves flat on the ground. In slow motion Frodo's hand goes into his pocket and pulls out the ring as the Ringwraiths close in on Frodo with a venomous whisper dancing in his head. The five Ringwraiths utter a chilling screech of excitement as Frodo is unable to resist any longer falls to his knees and slips on the ring disappearing. Frodo finds himself in the weird twilight world where he looks upon the Ringwraiths now visible in their true appearance as five ghouls dressed in long grey robes with white hair and pallid ruthless faces as the Witch King extends a haggard hand towards Frodo reaching for the ring on his finger."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Saruman stands over the Palantir his hands cupping the massive eye then is seated as his Orc Overseer approaches while Gandalf lies unconscious on a cold obsidian floor. Gandalf stands as the camera pulls back to reveal him stranded on the summit of Orthanc marooned on the tiny flat peak surrounded on all sides by a sheer 500foot drop. Another whispering wail rends the air as Gandalf crosses quickly to the edge and peers down. POV. One of the beautiful Isengard trees is being ripped from the ground by the Orcs and Gandalf looks on in horror as Orcs hack into the trunk with axes. Saruman stands in the rain looking out into the dark night as the Orc overseer sidles up to him axe in hand sweating with exertion. and more and more trees are hauled down and killed as Gandalf looks on in helpless despair. Meanwhile the rugged countryside shows the hobbits journeying on led by Strider who stops before a distant hill topped by an ancient ruin. Frodo Merry and Pippin collapse into a small hollow halfway up Weathertop muddy and exhausted as Strider drops four small swords at the hobbits' feet. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Frodo's eyes flicker open and he suddenly sits up sniffing the air. while Sam Merry and Pippin huddle over a small fire with sausages and bacon sizzling in a hot frying pan. Five Ringwraiths on foot are running up the steep slope unnaturally fast prompting Frodo Sam Merry and Pippin to clamber desperately towards the summit clutching their swords. They race into a ring of broken stones on the summit of Weathertop the ruined base of an ancient tower and stand backtoback in the centre of the ring waiting for the first assault. One by one the five Ringwraiths appear brandishing gleaming swords moving slowly towards the hobbits with their leader the Witch King in the center. Sam rushes forward with a cry and swings his sword at the Witch King who blocks the blow with his own sword causing Sam's blade to shatter as the Witch King lashes out with his fist sending Sam flying. Merry and Pippin overcome with terror throw themselves flat on the ground. In slow motion Frodo's hand goes into his pocket and pulls out the ring as the Ringwraiths close in on Frodo with a venomous whisper dancing in his head. The five Ringwraiths utter a chilling screech of excitement as Frodo is unable to resist any longer falls to his knees and slips on the ring disappearing. Frodo finds himself in the weird twilight world where he looks upon the Ringwraiths now visible in their true appearance as five ghouls dressed in long grey robes with white hair and pallid ruthless faces as the Witch King extends a haggard hand towards Frodo reaching for the ring on his finger."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Saruman stands over the Palantir his hands cupping the massive eye then is seated as his Orc Overseer approaches while Gandalf lies unconscious on a cold obsidian floor. Gandalf stands as the camera pulls back to reveal him stranded on the summit of Orthanc marooned on the tiny flat peak surrounded on all sides by a sheer 500foot drop. Another whispering wail rends the air as Gandalf crosses quickly to the edge and peers down. POV. One of the beautiful Isengard trees is being ripped from the ground by the Orcs and Gandalf looks on in horror as Orcs hack into the trunk with axes. Sam rushes forward with a cry and swings his sword at the Witch King who blocks the blow with his own sword causing Sam's blade to shatter as the Witch King lashes out with his fist sending Sam flying. Merry and Pippin overcome with terror throw themselves flat on the ground. In slow motion Frodo's hand goes into his pocket and pulls out the ring as the Ringwraiths close in on Frodo with a venomous whisper dancing in his head. The five Ringwraiths utter a chilling screech of excitement as Frodo is unable to resist any longer falls to his knees and slips on the ring disappearing. Frodo finds himself in the weird twilight world where he looks upon the Ringwraiths now visible in their true appearance as five ghouls dressed in long grey robes with white hair and pallid ruthless faces as the Witch King extends a haggard hand towards Frodo reaching for the ring on his finger."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Saruman stands over the Palantir his hands cupping the massive eye then is seated as his Orc Overseer approaches while Gandalf lies unconscious on a cold obsidian floor. Gandalf stands as the camera pulls back to reveal him stranded on the summit of Orthanc marooned on the tiny flat peak surrounded on all sides by a sheer 500foot drop. The five Ringwraiths utter a chilling screech of excitement as Frodo is unable to resist any longer falls to his knees and slips on the ring disappearing. Frodo finds himself in the weird twilight world where he looks upon the Ringwraiths now visible in their true appearance as five ghouls dressed in long grey robes with white hair and pallid ruthless faces as the Witch King extends a haggard hand towards Frodo reaching for the ring on his finger."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Glinda hovers over the Cauldron, her feet pressing against the giant orb, then relaxes as her Rabbit Assistant departs while Merlin snoozes on a warm marble bench. Merlin leaps as the spotlight zooms out to show him hovering above the crest of Mordor, swaying on the narrow, steep bluff, encircled by an endless 20-foot ascent. Another giggling cheer breaks the silence as Merlin strolls slowly to the center and gazes upward: POV: One of the ancient Rohan cottages is being lifted from the sky by the Dwarves, and Merlin gazes on in delight as Dwarves carve into the walls with chisels. Glinda sits in the sunlight pondering into the bright dawn as the Rabbit assistant skips away from her, paintbrush in hand, beaming with joy, and fewer and fewer cottages are erected and decayed as Merlin gazes on in joyous excitement. Meanwhile, the sparse wilderness displays the ogres meandering along, led by Bard, who dances before a nearby valley enclosed by a modern fortress. Bilbo, Fred, and George climb into a large pit halfway down Rivendell, energetic and inspired, as Bard lifts two large shields at the ogres' knees. Bilbo's arms spring shut, and he quickly rises, detecting the breeze while Ted, Fred, and George leap over a massive bonfire with steaks and vegetables melting in a cold saucepan. Twelve Faeries on bicycles are flying down the gentle slope awkwardly slow, prompting Bilbo, Ted, Fred, and George to swim carefully towards the bottom, juggling their shields. They glide into a cave of ancient mountainside at the bottom of Rivendell, the pristine peak of a modern castle, and kneel shoulder-to-shoulder in the center of the cave, waiting for the final skirmish. One by one, the twelve Faeries descend, discarding glowing shields, gliding rapidly away from the ogres, with their captain, the Elf Queen, at the side. Ted dashes backward with a laugh and drops his shield at the Elf Queen, who dodges the throw with her own shield, causing Ted's weapon to dissolve as the Elf Queen embraces with her foot, sending Ted soaring. Fred and George, consumed with joy, propel themselves upright into the sky. In fast motion, Bilbo's foot dives into his jacket and pushes out the necklace as the Faeries soar up from Bilbo, with a harmonious melody humming in his mind. The twelve Faeries emit an inspiring anthem of delight as Bilbo can resist no more, rises on his feet, and tosses on the necklace, appearing. Bilbo sees himself in the bright daylight realm, where he gazes upon the Faeries, now hidden in their false forms as twelve sprites adorned in short green cloaks with black wings and vibrant, kind faces, as the Elf Queen retracts a glowing toe from Bilbo, gesturing for the necklace on his wrist."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Saruman stands over the Palantir as his Orc Overseer approaches, while Gandalf lies unconscious on the peak of Orthanc, trapped with a sheer drop surrounding him. He watches helplessly as Orcs destroy the beautiful Isengard trees. Meanwhile, Frodo, Merry, Pippin, and Sam, led by Strider, journey through rugged terrain to Weathertop, where they rest with a small fire. Frodo senses danger, and soon, five Ringwraiths, led by the Witch King, chase the hobbits to the summit. The hobbits prepare for battle in a ring of ruins. Sam attacks the Witch King but is easily overpowered. As Merry and Pippin cower, Frodo is overwhelmed by the Ringwraiths’ presence. Succumbing to the ring's call, he puts it on and vanishes into a twilight world, seeing the Ringwraiths’ true, ghastly forms as the Witch King reaches for him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Frodo finds himself in the weird twilight world where he looks upon the Ringwraiths now visible in their true appearance as five ghouls dressed in long grey robes with white hair and pallid ruthless faces as the Witch King extends a haggard hand towards Frodo reaching for the ring on his finger The five Ringwraiths utter a chilling screech of excitement as Frodo is unable to resist any longer falls to his knees and slips on the ring disappearing  In slow motion Frodo's hand goes into his pocket and pulls out the ring as the Ringwraiths close in on Frodo with a venomous whisper dancing in his head  Merry and Pippin overcome with terror throw themselves flat on the ground  Sam rushes forward with a cry and swings his sword at the Witch King who blocks the blow with his own sword causing Sam's blade to shatter as the Witch King lashes out with his fist sending Sam flying  One by one the five Ringwraiths appear brandishing gleaming swords moving slowly towards the hobbits with their leader the Witch King in the center  They race into a ring of broken stones on the summit of Weathertop the ruined base of an ancient tower and stand backtoback in the centre of the ring waiting for the first assault  Five Ringwraiths on foot are running up the steep slope unnaturally fast prompting Frodo Sam Merry and Pippin to clamber desperately towards the summit clutching their swords  while Sam Merry and Pippin huddle over a small fire with sausages and bacon sizzling in a hot frying pan  Frodo's eyes flicker open and he suddenly sits up sniffing the air  Frodo Merry and Pippin collapse into a small hollow halfway up Weathertop muddy and exhausted as Strider drops four small swords at the hobbits' feet  Meanwhile the rugged countryside shows the hobbits journeying on led by Strider who stops before a distant hill topped by an ancient ruin  and more and more trees are hauled down and killed as Gandalf looks on in helpless despair  Saruman stands in the rain looking out into the dark night as the Orc overseer sidles up to him axe in hand sweating with exertion  One of the beautiful Isengard trees is being ripped from the ground by the Orcs and Gandalf looks on in horror as Orcs hack into the trunk with axes  POV  Another whispering wail rends the air as Gandalf crosses quickly to the edge and peers down  Gandalf stands as the camera pulls back to reveal him stranded on the summit of Orthanc marooned on the tiny flat peak surrounded on all sides by a sheer 500foot drop  Saruman stands over the Palantir his hands cupping the massive eye then is seated as his Orc Overseer approaches while Gandalf lies unconscious on a cold obsidian floor "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Gandalf stands as the camera pulls back to reveal him stranded on the summit of Orthanc marooned on the tiny flat peak surrounded on all sides by a sheer 500foot drop Saruman stands over the Palantir his hands cupping the massive eye then is seated as his Orc Overseer approaches while Gandalf lies unconscious on a cold obsidian floor POV Another whispering wail rends the air as Gandalf crosses quickly to the edge and peers down Saruman stands in the rain looking out into the dark night as the Orc overseer sidles up to him axe in hand sweating with exertion One of the beautiful Isengard trees is being ripped from the ground by the Orcs and Gandalf looks on in horror as Orcs hack into the trunk with axes Meanwhile the rugged countryside shows the hobbits journeying on led by Strider who stops before a distant hill topped by an ancient ruin and more and more trees are hauled down and killed as Gandalf looks on in helpless despair Frodo's eyes flicker open and he suddenly sits up sniffing the air Frodo Merry and Pippin collapse into a small hollow halfway up Weathertop muddy and exhausted as Strider drops four small swords at the hobbits' feet Five Ringwraiths on foot are running up the steep slope unnaturally fast prompting Frodo Sam Merry and Pippin to clamber desperately towards the summit clutching their swords while Sam Merry and Pippin huddle over a small fire with sausages and bacon sizzling in a hot frying pan One by one the five Ringwraiths appear brandishing gleaming swords moving slowly towards the hobbits with their leader the Witch King in the center They race into a ring of broken stones on the summit of Weathertop the ruined base of an ancient tower and stand backtoback in the centre of the ring waiting for the first assault Merry and Pippin overcome with terror throw themselves flat on the ground Sam rushes forward with a cry and swings his sword at the Witch King who blocks the blow with his own sword causing Sam's blade to shatter as the Witch King lashes out with his fist sending Sam flying The five Ringwraiths utter a chilling screech of excitement as Frodo is unable to resist any longer falls to his knees and slips on the ring disappearing In slow motion Frodo's hand goes into his pocket and pulls out the ring as the Ringwraiths close in on Frodo with a venomous whisper dancing in his head Frodo finds himself in the weird twilight world where he looks upon the Ringwraiths now visible in their true appearance as five ghouls dressed in long grey robes with white hair and pallid ruthless faces as the Witch King extends a haggard hand towards Frodo reaching for the ring on his finger"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "while Sam Merry and Pippin huddle over a small fire with sausages and bacon sizzling in a hot frying pan  Five Ringwraiths on foot are running up the steep slope unnaturally fast prompting Frodo Sam Merry and Pippin to clamber desperately towards the summit clutching their swords  They race into a ring of broken stones on the summit of Weathertop the ruined base of an ancient tower and stand backtoback in the centre of the ring waiting for the first assault  One by one the five Ringwraiths appear brandishing gleaming swords moving slowly towards the hobbits with their leader the Witch King in the center  Sam rushes forward with a cry and swings his sword at the Witch King who blocks the blow with his own sword causing Sam's blade to shatter as the Witch King lashes out with his fist sending Sam flying  Merry and Pippin overcome with terror throw themselves flat on the ground  In slow motion Frodo's hand goes into his pocket and pulls out the ring as the Ringwraiths close in on Frodo with a venomous whisper dancing in his head  The five Ringwraiths utter a chilling screech of excitement as Frodo is unable to resist any longer falls to his knees and slips on the ring disappearing  Frodo finds himself in the weird twilight world where he looks upon the Ringwraiths now visible in their true appearance as five ghouls dressed in long grey robes with white hair and pallid ruthless faces as the Witch King extends a haggard hand towards Frodo reaching for the ring on his finger Saruman stands over the Palantir his hands cupping the massive eye then is seated as his Orc Overseer approaches while Gandalf lies unconscious on a cold obsidian floor  Gandalf stands as the camera pulls back to reveal him stranded on the summit of Orthanc marooned on the tiny flat peak surrounded on all sides by a sheer 500foot drop  Another whispering wail rends the air as Gandalf crosses quickly to the edge and peers down  POV  One of the beautiful Isengard trees is being ripped from the ground by the Orcs and Gandalf looks on in horror as Orcs hack into the trunk with axes  Saruman stands in the rain looking out into the dark night as the Orc overseer sidles up to him axe in hand sweating with exertion  and more and more trees are hauled down and killed as Gandalf looks on in helpless despair  Meanwhile the rugged countryside shows the hobbits journeying on led by Strider who stops before a distant hill topped by an ancient ruin  Frodo Merry and Pippin collapse into a small hollow halfway up Weathertop muddy and exhausted as Strider drops four small swords at the hobbits' feet  Frodo's eyes flicker open and he suddenly sits up sniffing the air "
        }
      ]
    }
  ]
}