{
  "ground_truth": "DEAGOL pulls on his rod, but is hauled overboard and disappears underwater with a splash, while SMEAGOL leans over the boat. DEAGOL turns to look at him with a smirk on his face. SMEAGOL moves towards DEAGOL, and then jumps on him, strangling him and ripping the glittering ring from DEAGOL's limp hand. SMEAGOL slips the ring onto his finger, descending into madness as his body twists and distorts, becoming a creepy, shriveled wretch, and finally crawling into a dark cave beneath the Misty Mountains. A grim landscape, covered in thorn bushes and the scars of recent fires, surrounds the dark Morgul Valley as it disappears up towards the mountains. FRODO and SAM are in a filthy culvert; SAM twitches in a restless sleep, but FRODO is awake, his hand trailing down to the chain around his neck. A sudden hiss startles FRODO, who quickly hides the ring as GOLLUM peers at them with gleaming eyes. SAM stirs, looks at FRODO, who shakes his head. SAM then looks at the dead, brown twilight. The days are growing darker when the ground suddenly quivers, and a rolling, rumbling noise echoes down the valley. SAM shoots GOLLUM a hostile look and turns back to rummage in his knapsack, holding up a piece of dried lembas bread to FRODO. FRODO looks at SAM questioningly. FRODO and SAM follow GOLLUM, clambering through bracken and over jagged rocks, as he leads them on a winding, torturous path. Meanwhile, GANDALF leads ARAGORN, LEGOLAS, THEODEN, and GIMLI through dark woodland as the moving forest of Fangorn opens before them, creating an avenue of trees that allows access along the old Isengard road. A thick, humid mist fills the forest, and as the forest separates ahead, the ruins of the great stone wall, cracked and splintered into countless jagged shards, are revealed. Far off, half veiled in swirling steam, stands the tower of Orthanc, unbroken by the storm, with pale waters lapping about its feet. Two small hobbits, MERRY and PIPPIN, sit on the smashed wall with a feast of breads, meats, and wine spread before them. They puff on long pipes as they lie back in the sun. MERRY cuts PIPPIN off before he can respond, as GANDALF, ARAGORN, LEGOLAS, and GIMLI stare at the sight before them. GANDALF leads the company through the flotsam and jetsam floating upon the muddied waters surrounding the tower. TREEBEARD, the giant ENT, strides towards them, alarming all but GANDALF, who stares up the long length of the dark tower as the old ENT nods his head wisely. PIPPIN's eye is caught by something glowing with a golden light in the muddy waters. ARAGORN turns as, quick as a flash, PIPPIN has jumped off his horse and picked up the Palantír.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "DEAGOL tugs on his pole, but is dragged overboard and vanishes underwater with a splash, while SMEAGOL leans over the vessel. DEAGOL turns to glance at him with a grin on his visage. SMEAGOL advances towards DEAGOL, and then leaps on him, throttling him and tearing the sparkling ring from DEAGOL's limp hand. SMEAGOL slips the ring onto his digit, descending into insanity as his form twists and distorts, becoming a creepy, shriveled wretch, and finally creeping into a dark cave beneath the Misty Mountains. A grim terrain, covered in thorny plants and the scars of recent blazes, surrounds the dark Morgul Valley as it fades up towards the peaks. FRODO and SAM are in a filthy drain; SAM twitches in a restless slumber, but FRODO is awake, his hand trailing down to the chain around his throat. A sudden hiss startles FRODO, who quickly conceals the ring as GOLLUM peers at them with gleaming eyes. SAM stirs, gazes at FRODO, who shakes his head. SAM then looks at the dead, brown twilight. The days are growing darker when the ground suddenly quivers, and a rolling, rumbling sound echoes down the valley. SAM shoots GOLLUM a hostile glance and turns back to rummage in his backpack, holding up a piece of dried lembas bread to FRODO. FRODO glances at SAM questioningly. FRODO and SAM follow GOLLUM, scrambling through bracken and over jagged stones, as he guides them on a winding, torturous route. Meanwhile, GANDALF leads ARAGORN, LEGOLAS, THEODEN, and GIMLI through dark woodland as the moving forest of Fangorn opens before them, creating an avenue of trees that allows access along the old Isengard path. A thick, humid mist fills the forest, and as the forest parts ahead, the ruins of the great stone barrier, cracked and splintered into countless jagged fragments, are revealed. Far off, half veiled in swirling vapor, stands the tower of Orthanc, unbroken by the tempest, with pale waters lapping about its base. Two small hobbits, MERRY and PIPPIN, sit on the smashed wall with a feast of breads, meats, and wine spread before them. They puff on long pipes as they recline in the sun. MERRY cuts PIPPIN off before he can respond, as GANDALF, ARAGORN, LEGOLAS, and GIMLI gaze at the scene before them. GANDALF leads the company through the flotsam and jetsam drifting upon the muddied waters surrounding the tower. TREEBEARD, the giant ENT, strides towards them, alarming all but GANDALF, who gazes up the long length of the dark tower as the old ENT nods his head wisely. PIPPIN's eye is caught by something glowing with a golden light in the murky waters. ARAGORN turns as, quick as a flash, PIPPIN has leapt off his steed and picked up the Palantír."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "DEAGOL pulls on his rod but is hauled overboard and disappears underwater with a splash, while the boat is leaned over by SMEAGOL. A smirk is turned by DEAGOL to look at SMEAGOL's face. DEAGOL is moved towards by SMEAGOL, and then DEAGOL is jumped on by him, strangling him and ripping the glittering ring from his limp hand. The ring is slipped onto SMEAGOL's finger by him, descending into madness as his body twists and distorts, becoming a creepy, shriveled wretch, and finally he crawls into a dark cave beneath the Misty Mountains. A grim landscape covers the dark Morgul Valley, thorn bushes and the scars of recent fires surrounding it as it disappears up towards the mountains. FRODO and SAM are in a filthy culvert; a restless sleep twitches SAM, but FRODO is awake, his hand trailing down to the chain around his neck. FRODO is startled by a sudden hiss, and he quickly hides the ring as GOLLUM peers at them with gleaming eyes. SAM stirs, looks at FRODO, who shakes his head. SAM then looks at the dead, brown twilight. The days are making the ground suddenly quiver and a rolling, rumbling noise echoing down the valley grow darker. GOLLUM is shot a hostile look by SAM, and his knapsack is rummaged in as he turns back, holding up a piece of dried lembas bread to FRODO. SAM is looked at questioningly by FRODO. GOLLUM is followed by FRODO and SAM, clambering through bracken and over jagged rocks, as a winding, torturous path is led by him. Meanwhile, ARAGORN, LEGOLAS, THEODEN, and GIMLI are led by GANDALF through dark woodland as the moving forest of Fangorn opens before them, creating an avenue of trees that provides access along the old Isengard road. The forest is filled with a thick, humid mist, and as it separates ahead, the great stone wall, cracked and splintered into countless jagged shards, reveals its ruins. Far off, half veiled in swirling steam, stands the tower of Orthanc, which the storm has not broken, with pale waters lapping about its feet. Two small hobbits, MERRY and PIPPIN, sit on the smashed wall with a feast of breads, meats, and wine spread before them. Long pipes are puffed on by them as they lie back in the sun. PIPPIN is cut off by MERRY before he can respond, as the sight is stared at by GANDALF, ARAGORN, LEGOLAS, and GIMLI. The company is led by GANDALF through the flotsam and jetsam floating upon the muddied waters surrounding the tower. TREEBEARD, the giant ENT, strides towards them, alarming all but GANDALF, who stares up the long length of the dark tower as the old ENT nods his head wisely. Something glowing with a golden light in the muddy waters catches PIPPIN's eye. ARAGORN turns as, quick as a flash, the Palantír is jumped off his horse for and picked up by PIPPIN."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "DEAGOL pulls on his rod but is dragged overboard, disappearing underwater with a splash. SMEAGOL leans over, smirking as he moves toward DEAGOL, then jumps on him, strangling him and ripping the glittering ring from DEAGOL's limp hand. SMEAGOL slips the ring on, descending into madness as his body distorts, becoming a shriveled wretch, and finally crawls into a cave beneath the Misty Mountains. A grim landscape of thorn bushes and recent fire scars surrounds the Morgul Valley as it stretches toward the mountains. FRODO and SAM are in a filthy culvert; SAM twitches in restless sleep, while FRODO, awake, touches the chain around his neck. A hiss startles him, and he hides the ring as GOLLUM peers at them. SAM stirs, looks at FRODO, who shakes his head. SAM looks at the twilight. Days grow darker when the ground quivers and a rumbling echoes down the valley. SAM glares at GOLLUM then rummages in his knapsack, offering FRODO dried lembas. FRODO looks at SAM questioningly. They follow GOLLUM through bracken and jagged rocks on a winding path. Meanwhile, GANDALF leads ARAGORN, LEGOLAS, THEODEN, and GIMLI through Fangorn forest, opening an avenue of trees along the old Isengard road. A humid mist fills the forest, revealing the ruins of the stone wall, splintered into shards. Far off, in swirling steam, stands Orthanc tower, unbroken by the storm, with pale waters lapping its base. MERRY and PIPPIN sit on the wall with a feast, smoking pipes in the sun. MERRY cuts PIPPIN off as GANDALF and company stare. GANDALF leads them through flotsam floating in the muddy waters surrounding the tower. TREEBEARD, the ENT, strides towards them, alarming all but GANDALF, who gazes at the tower as TREEBEARD nods wisely. PIPPIN spots something glowing in the water; quick as a flash, he jumps off his horse and picks up the Palantír."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "DEAGOL is pulled overboard, disappearing underwater as SMEAGOL leans over the boat. DEAGOL smirks, but SMEAGOL jumps on him, strangles him, and takes the ring from DEAGOL's limp hand. SMEAGOL wears the ring, descends into madness, and becomes a shriveled wretch, crawling into a cave beneath the Misty Mountains. A grim landscape surrounds the Morgul Valley as it disappears into the mountains. FRODO and SAM are in a filthy culvert; SAM sleeps restlessly, while FRODO, awake, touches the chain around his neck. A sudden hiss startles FRODO, hiding the ring as GOLLUM peers at them. SAM stirs, looks at FRODO, who shakes his head, then looks at the darkening twilight. The ground quivers, and a rumbling echoes down the valley. SAM glares at GOLLUM, then gives FRODO dried lembas bread. FRODO and SAM follow GOLLUM through bracken and rocks on a winding path. Meanwhile, GANDALF, ARAGORN, LEGOLAS, THEODEN, and GIMLI travel through Fangorn forest towards Isengard. The forest's thick mist reveals the cracked stone wall and the unbroken tower of Orthanc. MERRY and PIPPIN sit on the smashed wall with food spread before them, puffing pipes. GANDALF's group arrives, navigating the muddied waters. TREEBEARD strides toward them, alarming everyone but GANDALF. PIPPIN notices a golden light in the water and quickly retrieves the Palantír."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "DEAGOL, with determination, tugs on his fishing rod, but unexpectedly, he is pulled overboard and vanishes beneath the water with a sudden splash. Meanwhile, SMEAGOL is leaning over the edge of the small boat, peering intently into the water. DEAGOL turns back to look at him, a smirk playing upon his lips. In a swift motion, SMEAGOL moves closer to DEAGOL, then suddenly leaps upon him, wrapping his hands tightly around DEAGOL’s throat. He strangles him mercilessly and snatches the glittering ring from DEAGOL’s now limp hand. Without hesitation, SMEAGOL slips the glistening ring onto his own finger and almost immediately descends into madness. As his body twists and contorts, he deteriorates into a creepy, shriveled wretch, eventually crawling away into a shadowy cave beneath the imposing Misty Mountains.\n\nThe scene shifts to a grim and foreboding landscape, a desolate expanse covered with thorn bushes and marred by the scars of recent fires. This dreary terrain surrounds the dark, ominous Morgul Valley as it disappears upwards towards the distant mountains. Amidst this setting, FRODO and SAM find themselves in a filthy, damp culvert. SAM is twitching restlessly in a troubled sleep, while FRODO remains awake, his hand gently drifting down to the chain that hangs around his neck. A sudden, sharp hiss startles FRODO, prompting him to quickly hide the precious ring just as GOLLUM peers at them with his gleaming, searching eyes. SAM stirs awake and glances over at FRODO, who subtly shakes his head in response. SAM then shifts his gaze to the dead, brownish twilight encroaching around them. With each passing day, the atmosphere grows increasingly darker. Suddenly, the ground beneath them quivers, and a deep, rolling rumble echoes ominously throughout the valley. Showing clear disdain, SAM shoots GOLLUM a hostile look before turning back to rummage through his knapsack. He retrieves a piece of dried lembas bread and holds it out to FRODO, who shoots SAM a questioning look in return. Together, FRODO and SAM follow GOLLUM, struggling as they clamber through the thick bracken and over jagged rocks. GOLLUM leads them along a winding, torturous path through the rugged landscape.\n\nElsewhere, GANDALF leads ARAGORN, LEGOLAS, THEODEN, and GIMLI through the dense darkness of the woodland as the living forest of Fangorn unfolds before them. The forest creates a grand avenue of trees that permits access along the ancient Isengard road. A thick, humid mist permeates the air, and as the forest gradually parts before them, the broken ruins of the once great stone wall, now cracked and splintered into countless jagged shards, come into view. In the distance, half concealed by swirling steam, stands the tower of Orthanc, steadfast and unbroken by the storm, with pale waters gently lapping at its base. Close by, two small hobbits, MERRY and PIPPIN, rest atop the smashed wall with a feast spread before them consisting of breads, meats, and wine. Contentedly puffing on long pipes, they lie back, basking in the warm sunlight. MERRY abruptly cuts PIPPIN off before he can respond, as GANDALF, ARAGORN, LEGOLAS, and GIMLI gaze intently at the scene before them. GANDALF leads the company through the assortment of flotsam and jetsam floating on the muddied waters surrounding the tower. TREEBEARD, the ancient and massive ENT, strides purposefully towards them, causing alarm to all except GANDALF, who gazes up at the long, dark length of the tower as the wise old ENT nods his head knowingly. PIPPIN’s attention is suddenly caught by the sight of something glowing with a mysterious golden light in the murky waters. In a flash, ARAGORN turns only to see PIPPIN quickly dismount from his horse and retrieve the Palantír."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "DEAGOL, fueled by unwavering determination, grips his fishing rod firmly and gives it a strong yank. However, to his complete surprise, he is unexpectedly yanked overboard and vanishes beneath the surface of the water with a sudden and dramatic splash. Meanwhile, at the same time, SMEAGOL is leaning over the side of the small boat, peering intently into the depths below. DEAGOL manages to glance back at him, a smirk teasingly appearing on his lips. In a sudden and swift motion, SMEAGOL draws closer to DEAGOL, then, in a burst of movement, he leaps upon him, wrapping his hands tightly and unforgivingly around DEAGOL’s throat. He strangles him ruthlessly and pries the dazzling, glittering ring from DEAGOL’s now limp and lifeless hand. Without a moment's hesitation, SMEAGOL slips the glistening, enchanting ring onto his own finger and almost immediately begins to descend into madness. His body twists and contorts grotesquely as he rapidly deteriorates into a creepy, shriveled wretch, eventually crawling away into the shadowy, forbidding cave beneath the imposing Misty Mountains.\n\nThe scene transitions to a grim and ominous landscape, a bleak and barren expanse covered with thorn bushes and marred by the unmistakable scars of recent fires. This dreary and desolate terrain surrounds the dark, foreboding Morgul Valley as it stretches upwards towards the distant, looming mountains. Within this unsettling setting, FRODO and SAM find themselves huddled in a filthy, damp culvert. SAM is twitching restlessly in a troubled sleep, while FRODO remains alert and awake, his hand instinctively drifting down to the chain that hangs around his neck. A sudden, sharp hiss cuts through the air, startling FRODO and prompting him to quickly hide the precious, powerful ring just as GOLLUM peers at them with his gleaming, searching eyes. SAM stirs awake and glances over at FRODO, who subtly yet clearly shakes his head in response. SAM then shifts his gaze to the dead, brownish twilight encroaching ominously around them. With each passing day, the atmosphere around them grows increasingly darker and more foreboding. Suddenly, the ground beneath them quivers, and a deep, rolling rumble echoes with an ominous sound throughout the entire valley. Showing clear disdain, SAM shoots GOLLUM a hostile, distrustful look before turning back to rummage through his knapsack. He retrieves a small piece of dried lembas bread and holds it out to FRODO, who shoots SAM a questioning look in return. Together, FRODO and SAM follow GOLLUM, struggling as they clamber through the thick bracken and over the jagged, treacherous rocks. GOLLUM leads them along a winding, torturous path through the rugged, unforgiving landscape.\n\nIn a different part of this world, GANDALF leads ARAGORN, LEGOLAS, THEODEN, and GIMLI through the dense, enveloping darkness of the ancient woodland as the living forest of Fangorn unfolds majestically before them. The forest creates a grand and impressive avenue of towering trees that permits passage along the ancient Isengard road. A thick, humid mist permeates the air, adding to the mystique, and as the forest gradually parts before them, the broken ruins of the once great stone wall, now cracked and splintered into countless jagged shards, come into clear view. In the distance, half concealed by swirling, ethereal steam, stands the mighty tower of Orthanc, steadfast and unbroken by the storm, with pale waters gently lapping at its sturdy base. Close by, two small hobbits, MERRY and PIPPIN, rest contentedly atop the smashed wall with a generous feast spread before them consisting of various breads, savory meats, and fine wine. Contentedly puffing on their long pipes, they lie back, basking in the comforting warmth of the sunlight. MERRY abruptly cuts PIPPIN off before he can respond, as GANDALF, ARAGORN, LEGOLAS, and GIMLI gaze intently and with purpose at the scene before them. GANDALF leads the company through the assortment of flotsam and jetsam floating on the muddied, swirling waters surrounding the tower. TREEBEARD, the ancient and massive ENT, strides purposefully towards them, causing alarm to all except GANDALF, who gazes up with wisdom at the long, dark length of the tower as the wise old ENT nods his head knowingly. PIPPIN’s attention is suddenly caught by the sight of something glowing with a mysterious and enchanting golden light in the murky waters. In a flash, ARAGORN turns just in time to see PIPPIN quickly dismount from his horse and retrieve the alluring Palantír."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As DEAGOL stands at the edge of the boat, he grips his fishing rod tightly, feeling a sudden, powerful tug that pulls him overboard with a splash into the deep water, causing him to disappear beneath the surface as bubbles rise rapidly. Meanwhile, SMEAGOL leans precariously over the edge of the boat, eyes searching the water for any sign of DEAGOL. Below, DEAGOL turns underwater, locking eyes with SMEAGOL, a smirk playing on his lips despite the circumstances. With sudden determination, SMEAGOL inches towards where DEAGOL has surfaced. He pounces with a ferocity born of desperation, landing on DEAGOL and wrapping his hands around DEAGOL's throat, his grip tightening as he strangles him. SMEAGOL's fingers claw at DEAGOL's hand, and he pries the glittering ring from DEAGOL’s now limp fingers. Securing his prize, SMEAGOL slips the ring onto his finger, a sinister transformation overtaking him as the madness seeps into his mind, contorting his body grotesquely. His former self disintegrates into the eerie, shriveled figure now known as GOLLUM, who crawls away from his old life, seeking refuge in the dark, ominous cave beneath the looming Misty Mountains. In the grim landscape overhead, thorn bushes stretch hostilely across the terrain, the ground still scarred by recent fires, while the Morgul Valley meanders off towards the menacing peaks of the mountains. In a filthy culvert nearby, FRODO, wide-eyed and alert, lies quietly as his fingers brush against the chain around his neck, holding the precious ring hidden beneath his clothing. Next to him, SAM twitches sporadically, lost in a restless sleep, unaware of the brewing tension. A sudden, sharp hiss pierces the air, causing FRODO to instinctively tuck the ring away just as GOLLUM's gleaming eyes emerge from the shadows, scrutinizing them with eerie intensity. SAM stirs from his uneasy slumber, glancing first at FRODO, who offers a subtle shake of his head to communicate silence. Confusion shifts SAM's gaze to the desolate, deadened twilight around them, as the realization sets in that the days are becoming darker and more perilous. The ground unexpectedly starts to tremble beneath them, accompanied by a deep, rolling rumble that reverberates through the valley. SAM shoots GOLLUM a hostile, mistrustful look before turning his attention back to his knapsack, rummaging through its contents until he retrieves a piece of dried lembas bread, extending it towards FRODO in a gesture of sustenance and solidarity. With a look of mutual understanding, FRODO and SAM begin to follow in GOLLUM's lead, clambering over the treacherous terrain of bracken and jagged rocks as GOLLUM guides them on a convoluted, arduous path through the wilderness. Elsewhere, GANDALF, with an air of determined leadership, leads ARAGORN, LEGOLAS, THEODEN, and GIMLI through the dense, foreboding woodland of Fangorn. As they march, the forest seems to part before them, forming an avenue of towering trees that provide a guided route along the old, worn path of the Isengard road. A thick, oppressive mist clings to the forest air, swirling around them as the trees give way to reveal the shattered remnants of a once-mighty stone wall, now reduced to countless jagged shards from the storm's wrath. In the distance, the dark silhouette of the tower of Orthanc stands defiant, unyielding to the storm, its base lapped by pale, murky waters. Two small hobbits, MERRY and PIPPIN, find a moment of brief reprieve and indulgence atop the shattered wall, a spread of breads, meats, and wine laid out before them as they recline under the warm rays of the sun, puffing contentedly on long pipes. MERRY is quick to interject, cutting off PIPPIN's words before he can respond, diverting their attention back to the view as GANDALF, ARAGORN, LEGOLAS, and GIMLI take in the extraordinary sight before them. GANDALF leads their small assembly through the debris and remains floating in the muddied waters at the tower's base, making their way through the aftermath. TREEBEARD, the mighty ENT, strides purposefully towards the group, his imposing presence causing alarm among them all except for GANDALF, who holds his ground, looking up respectfully at the ENT, recognizing his ancient wisdom. As TREEBEARD nods his head with solemn understanding, PIPPIN's attention is captured by a mesmerizing, golden light emanating from within the muddy waters. With instinctive swiftness, PIPPIN dismounts his horse, moving quickly to the source of the light and before ARAGORN's warning voice can reach him, he has already laid claim to the Palantír, clasping it tightly in his hands."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "DEAGOL is pulled overboard while retrieving his rod and disappears underwater with a splash as SMEAGOL watches from the boat. Once DEAGOL resurfaces with a smirk, SMEAGOL attacks, strangling him and taking the glittering ring from DEAGOL's limp hand. Placing the ring on his finger, SMEAGOL descends into madness, his body contorting into a shriveled wretch as he retreats to a dark cave beneath the Misty Mountains. The bleak landscape of Morgul Valley, marred by thorn bushes and fire scars, stretches toward the mountains. In a filthy culvert, FRODO is awake, clutching the chain around his neck while SAM twitches in restless sleep. A sudden hiss startles FRODO, who hides the ring as GOLLUM appears with gleaming eyes. SAM awakens, exchanges a look with FRODO, and then surveys the dead, brown twilight. As the ground quivers and a rumbling echoes down the valley, SAM glares at GOLLUM before offering FRODO some dried lembas bread. FRODO and SAM follow GOLLUM through bracken and jagged rocks on a tortuous path. Meanwhile, GANDALF leads ARAGORN, LEGOLAS, THEODEN, and GIMLI through Fangorn, the forest parting to reveal the cracked ruins of an old stone wall and the tower of Orthanc, surrounded by swirling steam and pale waters. MERRY and PIPPIN, reclining on the smashed wall, enjoy a feast and smoke long pipes in the sun. GANDALF leads the group through debris floating in the muddied waters. TREEBEARD, the giant ENT, approaches, alarming all but GANDALF, who acknowledges the wise nod of the old ENT. PIPPIN, drawn to a golden light in the water, quickly dismounts and retrieves the Palantír as ARAGORN turns too late to stop him."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "DEAGOL pulls on his rod, fishing in the river Anduin that flows through Gondor, but is hauled overboard and disappears underwater with a splash, while SMEAGOL leans over the boat. DEAGOL turns to look at him with a smirk on his face, reminiscent of the close bond they once shared as cousins. SMEAGOL moves towards DEAGOL, and then jumps on him, strangling him and ripping the glittering ring, known to be the One Ring forged by the Dark Lord Sauron to control Middle-earth, from DEAGOL's limp hand. SMEAGOL slips the ring onto his finger, descending into madness as his body twists and distorts, becoming a creepy, shriveled wretch, and finally crawling into a dark cave beneath the Misty Mountains, which have long been shrouded in mystery and danger. A grim landscape, covered in thorn bushes and the scars of recent fires from the battles of the War of the Ring, surrounds the dark Morgul Valley as it disappears up towards the mountains. FRODO and SAM are in a filthy culvert, part of the winding paths leading to Mordor; SAM twitches in a restless sleep, but FRODO is awake, his hand trailing down to the chain around his neck, from which the One Ring hangs. A sudden hiss startles FRODO, who quickly hides the ring as GOLLUM, the twisted creature once known as Smeagol, peers at them with gleaming eyes. SAM stirs, looks at FRODO, who shakes his head. SAM then looks at the dead, brown twilight that marks the decay spreading from Mordor. The days are growing darker when the ground suddenly quivers, and a rolling, rumbling noise echoes down the valley, heralding the approach of Sauron's forces. SAM shoots GOLLUM a hostile look and turns back to rummage in his knapsack, holding up a piece of dried lembas bread, a sustaining Elvish waybread, to FRODO. FRODO looks at SAM questioningly. FRODO and SAM follow GOLLUM, clambering through bracken and over jagged rocks, as he leads them on a winding, torturous path through the perilous lands of Middle-earth. Meanwhile, GANDALF leads ARAGORN, heir to the throne of Gondor, LEGOLAS, THEODEN, king of Rohan, and GIMLI through dark woodland as the moving forest of Fangorn, ancient and sentient, opens before them, creating an avenue of trees that allows access along the old Isengard road. A thick, humid mist fills the forest, and as the forest separates ahead, the ruins of the great stone wall of Isengard, cracked and splintered into countless jagged shards, are revealed. Far off, half veiled in swirling steam, stands the tower of Orthanc, a formidable fortress of Saruman, unbroken by the storm, with pale waters lapping about its feet. Two small hobbits, MERRY and PIPPIN, sit on the smashed wall with a feast of breads, meats, and wine spread before them, remnants of plundered provisions. They puff on long pipes filled with pipeweed from the Shire as they lie back in the sun. MERRY cuts PIPPIN off before he can respond, as GANDALF, ARAGORN, LEGOLAS, and GIMLI stare at the sight before them. GANDALF leads the company through the flotsam and jetsam floating upon the muddied waters surrounding the tower. TREEBEARD, the giant ENT, an ancient shepherd of the forest, strides towards them, alarming all but GANDALF, who stares up the long length of the dark tower as the old ENT nods his head wisely. PIPPIN's eye is caught by something glowing with a golden light in the muddy waters, the Palantír, a seeing-stone once used by the wizards. ARAGORN turns as, quick as a flash, PIPPIN has jumped off his horse and picked up the Palantír, bound to become enmeshed in its inescapable visions."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Far off half veiled in swirling steam stands the tower of Orthanc unbroken by the storm with pale waters lapping about its feet DEAGOL pulls on his rod but is hauled overboard and disappears underwater with a splash TREEBEARD while SMEAGOL leans over the boat MERRY cuts PIPPIN off before he can respond as GANDALF DEAGOL turns to look at him with a smirk on his face SMEAGOL moves towards DEAGOL and then jumps on him strangling him and ripping the glittering ring from DEAGOL's limp hand SMEAGOL slips the ring onto his finger descending into madness as his body twists and distorts becoming a creepy shriveled wretch and finally crawling into a dark cave beneath the Misty Mountains SMEAGOL moves towards DEAGOL and then jumps on him strangling him and ripping the glittering ring from DEAGOL's limp hand DEAGOL pulls on his rod but is hauled overboard and disappears underwater with a splash DEAGOL turns to look at him with a smirk on his face A grim landscape covered in thorn bushes and the scars of recent fires surrounds the dark Morgul Valley as it disappears up towards the mountains FRODO and SAM are in a filthy culvert SAM twitches in a restless sleep but FRODO is awake his hand trailing down to the chain around his neck A sudden hiss startles FRODO who quickly hides the ring as GOLLUM peers at them with gleaming eyes A sudden hiss startles FRODO who quickly hides the ring as GOLLUM peers at them with gleaming eyes GANDALF leads the company through the flotsam and jetsam floating upon the muddied waters surrounding the tower PIPPIN's eye is caught by something glowing with a golden light in the muddy waters SAM stirs looks at FRODO who shakes his head SAM then looks at the dead brown twilight ARAGORN turns as quick as a flash The days are growing darker when the ground suddenly quivers and a rolling rumbling noise echoes down the valley while SMEAGOL leans over the boat SAM shoots GOLLUM a hostile look and turns back to rummage in his knapsack holding up a piece of dried lembas bread to FRODO FRODO looks at SAM questioningly FRODO and SAM follow GOLLUM clambering through bracken and over jagged rocks as he leads them on a winding torturous path Meanwhile GANDALF leads ARAGORN LEGOLAS THEODEN and GIMLI through dark woodland as the moving forest of Fangorn opens before them creating an avenue of trees that allows access along the old Isengard road A thick humid mist fills the forest and as the forest separates ahead the ruins of the great stone wall cracked and splintered into countless jagged shards are revealed Far off half veiled in swirling steam stands the tower of Orthanc unbroken by the storm with pale waters lapping about its feet FRODO looks at SAM questioningly Two small hobbits MERRY and PIPPIN sit on the smashed wall with a feast of breads meats and wine spread before them They puff on long pipes as they lie back in the sun MERRY cuts PIPPIN off before he can respond as GANDALF SAM twitches in a restless sleep but FRODO is awake his hand trailing down to the chain around his neck SMEAGOL slips the ring onto his finger descending into madness as his body twists and distorts becoming a creepy shriveled wretch and finally crawling into a dark cave beneath the Misty Mountains ARAGORN LEGOLAS and GIMLI stare at the sight before them GANDALF leads the company through the flotsam and jetsam floating upon the muddied waters surrounding the tower TREEBEARD the giant ENT strides towards them alarming all but GANDALF who stares up the long length of the dark tower as the old ENT nods his head wisely PIPPIN's eye is caught by something glowing with a golden light in the muddy waters ARAGORN turns as quick as a flash PIPPIN has jumped off his horse and picked up the Palantír"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "DEAGOL pulls on his rod but is hauled overboard and disappears underwater with a splash. while SMEAGOL leans over the boat. DEAGOL turns to look at him with a smirk on his face. SMEAGOL moves towards DEAGOL and then jumps on him strangling him and ripping the glittering ring from DEAGOL's limp hand. SMEAGOL slips the ring onto his finger descending into madness as his body twists and distorts becoming a creepy shriveled wretch and finally crawling into a dark cave beneath the Misty Mountains. A grim landscape covered in thorn bushes and the scars of recent fires surrounds the dark Morgul Valley. as it disappears up towards the mountains FRODO and SAM are in a filthy culvert. SAM twitches in a restless sleep but FRODO is awake his hand trailing down to the chain around his neck. A sudden hiss startles FRODO who quickly hides the ring as GOLLUM peers at them with gleaming eyes. SAM stirs looks at FRODO who shakes his head. SAM then looks at the dead brown twilight. The days are growing darker when the ground suddenly quivers and a rolling rumbling noise echoes down the valley. SAM shoots GOLLUM a hostile look and turns back to rummage in his knapsack holding up a piece of dried lembas bread to FRODO. FRODO looks at SAM questioningly. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. FRODO and SAM follow GOLLUM clambering through bracken and over jagged rocks as he leads them on a winding torturous path. Meanwhile GANDALF leads ARAGORN LEGOLAS THEODEN and GIMLI through dark woodland as the moving forest of Fangorn opens before them creating an avenue of trees that allows access along the old Isengard road. A thick humid mist fills the forest and as the forest separates ahead the ruins of the great stone wall cracked and splintered into countless jagged shards are revealed. Far off half veiled in swirling steam stands the tower of Orthanc unbroken by the storm with pale waters lapping about its feet. Two small hobbits MERRY and PIPPIN sit on the smashed wall with a feast of breads meats and wine spread before them. They puff on long pipes as they lie back in the sun. MERRY cuts PIPPIN off before he can respond as GANDALF. ARAGORN LEGOLAS and GIMLI stare at the sight before them. GANDALF leads the company through the flotsam and jetsam floating upon the muddied waters surrounding the tower. TREEBEARD. the giant ENT strides towards them alarming all but GANDALF who stares up the long length of the dark tower as the old ENT nods his head wisely. PIPPIN's eye is caught by something glowing with a golden light in the muddy waters. ARAGORN turns as quick as a flash. PIPPIN has jumped off his horse and picked up the Palantír."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "DEAGOL pulls on his rod but is hauled overboard and disappears underwater with a splash. while SMEAGOL leans over the boat. DEAGOL turns to look at him with a smirk on his face. SMEAGOL moves towards DEAGOL and then jumps on him strangling him and ripping the glittering ring from DEAGOL's limp hand. SMEAGOL slips the ring onto his finger descending into madness as his body twists and distorts becoming a creepy shriveled wretch and finally crawling into a dark cave beneath the Misty Mountains. A grim landscape covered in thorn bushes and the scars of recent fires surrounds the dark Morgul Valley. as it disappears up towards the mountains FRODO and SAM are in a filthy culvert. SAM twitches in a restless sleep but FRODO is awake his hand trailing down to the chain around his neck. A sudden hiss startles FRODO who quickly hides the ring as GOLLUM peers at them with gleaming eyes. SAM stirs looks at FRODO who shakes his head. SAM then looks at the dead brown twilight. The days are growing darker when the ground suddenly quivers and a rolling rumbling noise echoes down the valley. SAM shoots GOLLUM a hostile look and turns back to rummage in his knapsack holding up a piece of dried lembas bread to FRODO. FRODO looks at SAM questioningly. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. FRODO and SAM follow GOLLUM clambering through bracken and over jagged rocks as he leads them on a winding torturous path. Meanwhile GANDALF leads ARAGORN LEGOLAS THEODEN and GIMLI through dark woodland as the moving forest of Fangorn opens before them creating an avenue of trees that allows access along the old Isengard road. A thick humid mist fills the forest and as the forest separates ahead the ruins of the great stone wall cracked and splintered into countless jagged shards are revealed. Far off half veiled in swirling steam stands the tower of Orthanc unbroken by the storm with pale waters lapping about its feet. Two small hobbits MERRY and PIPPIN sit on the smashed wall with a feast of breads meats and wine spread before them. They puff on long pipes as they lie back in the sun. MERRY cuts PIPPIN off before he can respond as GANDALF. ARAGORN LEGOLAS and GIMLI stare at the sight before them. GANDALF leads the company through the flotsam and jetsam floating upon the muddied waters surrounding the tower. TREEBEARD. the giant ENT strides towards them alarming all but GANDALF who stares up the long length of the dark tower as the old ENT nods his head wisely. PIPPIN's eye is caught by something glowing with a golden light in the muddy waters. ARAGORN turns as quick as a flash. PIPPIN has jumped off his horse and picked up the Palantír."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "DEAGOL pulls on his rod but is hauled overboard and disappears underwater with a splash. while SMEAGOL leans over the boat. DEAGOL turns to look at him with a smirk on his face. SMEAGOL moves towards DEAGOL and then jumps on him strangling him and ripping the glittering ring from DEAGOL's limp hand. SMEAGOL slips the ring onto his finger descending into madness as his body twists and distorts becoming a creepy shriveled wretch and finally crawling into a dark cave beneath the Misty Mountains. A grim landscape covered in thorn bushes and the scars of recent fires surrounds the dark Morgul Valley. as it disappears up towards the mountains FRODO and SAM are in a filthy culvert. ARAGORN LEGOLAS and GIMLI stare at the sight before them. GANDALF leads the company through the flotsam and jetsam floating upon the muddied waters surrounding the tower. TREEBEARD. the giant ENT strides towards them alarming all but GANDALF who stares up the long length of the dark tower as the old ENT nods his head wisely. PIPPIN's eye is caught by something glowing with a golden light in the muddy waters. ARAGORN turns as quick as a flash. PIPPIN has jumped off his horse and picked up the Palantír."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "DEAGOL pulls on his rod but is hauled overboard and disappears underwater with a splash. while SMEAGOL leans over the boat. DEAGOL turns to look at him with a smirk on his face. PIPPIN's eye is caught by something glowing with a golden light in the muddy waters. ARAGORN turns as quick as a flash. PIPPIN has jumped off his horse and picked up the Palantír."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "DEAGOL pulls on his rod, but is hauled overboard and disappears underwater with a splash, while a dolphin leans over the boat. DEAGOL turns to look at the dolphin with a smirk on his face. A rabbit moves towards DEAGOL, and then jumps on him, strangling him and ripping the glittering ring from DEAGOL's limp hand. The rabbit slips the ring onto its finger, descending into madness as its body twists and distorts, becoming a creepy, shriveled wretch, and finally crawling into a dark cave beneath the Misty Mountains. A grim landscape, covered in thorn bushes and the scars of recent fires, surrounds the dark Morgul Valley as it disappears up towards the mountains. A turtle and a squirrel are in a filthy culvert; the squirrel twitches in a restless sleep, but the turtle is awake, its hand trailing down to the chain around its neck. A sudden hiss startles the turtle, who quickly hides the ring as a raven peers at them with gleaming eyes. The squirrel stirs, looks at the turtle, who shakes its head. The squirrel then looks at the dead, brown twilight. The days are growing darker when the ground suddenly quivers, and a rolling, rumbling noise echoes down the valley. The squirrel shoots the raven a hostile look and turns back to rummage in its knapsack, holding up a piece of dried lembas bread to the turtle. The turtle looks at the squirrel questioningly. The turtle and the squirrel follow the raven, clambering through bracken and over jagged rocks, as it leads them on a winding, torturous path. Meanwhile, an owl leads a lion, a gazelle, a giraffe, and an elephant through dark woodland as the moving forest of Fangorn opens before them, creating an avenue of trees that allows access along the old Isengard road. A thick, humid mist fills the forest, and as the forest separates ahead, the ruins of the great stone wall, cracked and splintered into countless jagged shards, are revealed. Far off, half veiled in swirling steam, stands the tower of Orthanc, unbroken by the storm, with pale waters lapping about its feet. Two small raccoons, a badger and a beaver, sit on the smashed wall with a feast of breads, meats, and wine spread before them. They puff on long pipes as they lie back in the sun. The badger cuts the beaver off before it can respond, as the owl, the lion, the gazelle, and the elephant stare at the sight before them. The owl leads the company through the flotsam and jetsam floating upon the muddied waters surrounding the tower. A giant tortoise strides towards them, alarming all but the owl, who stares up the long length of the dark tower as the old tortoise nods its head wisely. The beaver's eye is caught by something glowing with a golden light in the muddy waters. The lion turns as, quick as a flash, the beaver has jumped off its horse and picked up the Palantír."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "DEAGOL pulls on his ribbon, but is yanked off the train and disappears beneath the sand with a splash, while SMEAGOL leans over the carriage. DEAGOL turns to look at him with a smirk on his face. SMEAGOL moves towards DEAGOL, and then jumps on him, strangling him and ripping the sparkling brooch from DEAGOL's limp hand. SMEAGOL slips the brooch onto his finger, descending into madness as his body twists and distorts, becoming a creepy, shriveled wretch, and finally crawling into a dark tunnel beneath the Rocky Cliffs. A grim landscape, covered in thistle bushes and the scars of recent storms, surrounds the dark Tundra Valley as it disappears up towards the peaks. FRODO and SAM are in a grimy gully; SAM twitches in a restless sleep, but FRODO is awake, his hand trailing down to the string around his ankle. A sudden hiss startles FRODO, who quickly hides the brooch as GOLLUM peers at them with gleaming eyes. SAM stirs, looks at FRODO, who shakes his head. SAM then looks at the dead, grey dusk. The days are growing darker when the earth suddenly quivers, and a rolling, rumbling noise echoes down the valley. SAM shoots GOLLUM a hostile look and turns back to rummage in his satchel, holding up a piece of dried fruitcake to FRODO. FRODO looks at SAM questioningly. FRODO and SAM follow GOLLUM, clambering through hazel and over jagged cliffs, as he leads them on a winding, torturous path. Meanwhile, GANDALF leads ARAGORN, LEGOLAS, THEODEN, and GIMLI through shadowy woodland as the shifting forest of Greenwood opens before them, creating an avenue of foliage that allows access along the old Rivendell path. A dense, muggy fog fills the forest, and as the forest separates ahead, the skeleton of the great wooden fence, cracked and splintered into countless jagged shards, is revealed. Far off, half veiled in swirling vapor, stands the spire of Barad-dûr, unbroken by the tempest, with pale waters lapping about its feet. Two small hobbits, MERRY and PIPPIN, sit on the shattered fence with a feast of pastries, cheeses, and ale spread before them. They puff on long cigars as they lie back in the shade. MERRY cuts PIPPIN off before he can respond, as GANDALF, ARAGORN, LEGOLAS, and GIMLI stare at the sight before them. GANDALF leads the company through the debris and refuse floating upon the muddied waters surrounding the spire. TREEBEARD, the giant ELF, strides towards them, alarming all but GANDALF, who stares up the long length of the dark spire as the old ELF nods his head wisely. PIPPIN's eye is caught by something glowing with a golden light in the muddy waters. ARAGORN turns as, quick as a flash, PIPPIN has jumped off his horse and picked up the Crystal Orb."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "DEAGOL yanks on his rod, but is catapulted overboard and vanishes underwater with a splash, while SMEAGOL dangles over the boat. DEAGOL glances at him with a smirk on his face. SMEAGOL drifts towards DEAGOL, and then pounces on him, hugging him and swiping the glittering ring from DEAGOL's limp hand. SMEAGOL slides the ring onto his finger, spiraling into madness as his body bends and contorts, becoming a creepy, shriveled wretch, and eventually creeping into a dark cave beneath the Misty Mountains. A grim landscape, covered in thorn bushes and the scars of recent fires, borders the dark Morgul Valley as it vanishes up towards the mountains. FRODO and SAM are in a filthy culvert; SAM shifts in a restless sleep, but FRODO is awake, his hand drifting down to the chain around his neck. A sudden hiss alarms FRODO, who rapidly conceals the ring as GOLLUM gazes at them with gleaming eyes. SAM stirs, glances at FRODO, who nods his head. SAM then gazes at the dead, brown twilight. The days are growing darker when the ground gently trembles, and a rolling, rumbling noise reverberates down the valley. SAM casts GOLLUM a wary look and turns back to dig through his knapsack, holding up a piece of dried lembas bread to FRODO. FRODO gazes at SAM questioningly. FRODO and SAM shadow GOLLUM, clambering through bracken and over jagged rocks, as he guides them on a winding, torturous path. Meanwhile, GANDALF guides ARAGORN, LEGOLAS, THEODEN, and GIMLI through dark woodland as the shifting forest of Fangorn unfolds before them, forming an avenue of trees that allows access along the old Isengard road. A dense, humid mist shrouds the forest, and as the forest parts ahead, the ruins of the great stone wall, fractured and shattered into countless jagged shards, are exposed. Far off, half obscured in swirling steam, stands the tower of Orthanc, untouched by the storm, with pale waters lapping around its base. Two small hobbits, MERRY and PIPPIN, recline on the smashed wall with a feast of breads, meats, and wine spread before them. They puff on long pipes as they bask in the sun. MERRY interrupts PIPPIN before he can respond, as GANDALF, ARAGORN, LEGOLAS, and GIMLI gaze at the sight before them. GANDALF leads the company through the flotsam and jetsam bobbing upon the muddied waters surrounding the tower. TREEBEARD, the giant ENT, strides towards them, startling all but GANDALF, who gazes up the long length of the dark tower as the old ENT nods his head wisely. PIPPIN's eye is ensnared by something glowing with a golden light in the muddy waters. ARAGORN turns as, quick as a flash, PIPPIN has leaped off his horse and snatched up the Palantír."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "FLYTRAP pulls on his balloon, but is hauled overboard and disappears underwater with a splash, while MOUSETRAP leans over the wagon. FLYTRAP turns to look at it with a smirk on its face. MOUSETRAP moves towards FLYTRAP, and then jumps on it, strangling it and ripping the glittering marble from FLYTRAP's limp paw. MOUSETRAP slips the marble onto its antenna, descending into madness as its body twists and distorts, becoming a creepy, shriveled kobold, and finally crawling into a dark burrow beneath the Smoky Mountains. A grim cityscape, covered in thistle vines and the scars of recent festivals, surrounds the dark Wiggle Valley as it disappears up towards the pyramids. PLUTO and MARS are in a filthy greenhouse; MARS twitches in a restless sleep, but PLUTO is awake, its hand trailing down to the bracelet around its wrist. A sudden bark startles PLUTO, who quickly hides the marble as GRUFF peers at them with gleaming spectacles. MARS stirs, looks at PLUTO, who shakes its head. MARS then looks at the sleepy, gray dawn. The seasons are growing colder when the sky suddenly whirls, and a rolling, rumbling noise echoes down the canyon. MARS shoots GRUFF a cheerful look and turns back to rummage in its toolbox, holding up a piece of dried oatmeal cookie to PLUTO. PLUTO looks at MARS questioningly. PLUTO and MARS follow GRUFF, clambering through slippery floors and over jagged cliffs, as it leads them on a winding, torturous route. Meanwhile, NEPTUNE leads PLUTO, IO, URANUS, and SATURN through dark showroom as the moving barn of Cobble opens before them, creating an avenue of hedges that allows access along the old Wonderland lane. A thick, humid fog fills the barn, and as the barn separates ahead, the ruins of the great brick fence, cracked and splintered into countless jagged fragments, are revealed. Far off, half veiled in swirling vapor, stands the lighthouse of Neptune, unbroken by the storm, with pale shadows lapping about its feet. Two small seagulls, KEVIN and CLIFFORD, sit on the smashed fence with a feast of crisps, cheeses, and ginger ale spread before them. They puff on long straws as they lie back in the shade. KEVIN cuts CLIFFORD off before it can respond, as NEPTUNE, PLUTO, IO, and SATURN stare at the sight before them. NEPTUNE leads the company through the reeds and algae floating upon the muddied ponds surrounding the lighthouse. BRANCHBEARD, the giant SPRITE, strides towards them, alarming all but NEPTUNE, who stares up the long length of the dark lighthouse as the old SPRITE nods its head wisely. CLIFFORD's eye is caught by something glowing with a silver glow in the muddied ponds. PLUTO turns as, quick as a flash, CLIFFORD has jumped off its bicycle and picked up the Compass."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "GRINDEL tugs on his rope, but is lifted overboard and surfaces underwater with a splash, while FRODO leans over the boat. GRINDEL rotates to gaze at him with a grin on his face. FRODO advances towards GRINDEL, and then tackles him, hugging him and extracting the lustrous ring from GRINDEL's limp hand. FRODO slides the ring onto his finger, spiraling into insanity as his form warps and contorts, becoming a sinister, withered creature, and eventually slithering into a dim cave beneath the Mysterious Hills. A bleak landscape, entangled in bramble bushes and the marks of recent tempests, surrounds the gloomy Mordor Valley as it vanishes up towards the hills. EDWARD and BILLY are in a grimy trench; BILLY flinches in a disturbed nap, but EDWARD is alert, his hand sliding down to the chain around his neck. An abrupt whisper startles EDWARD, who swiftly conceals the ring as SMEAGOL gazes at them with shining eyes. BILLY rouses, glances at EDWARD, who nods. BILLY then gazes at the lifeless, gray dusk. The nights are growing gloomier when the earth suddenly trembles, and a rolling, growling noise reverberates down the valley. BILLY flashes SMEAGOL a wary look and turns back to sift through his pouch, brandishing a slice of stale lembas bread to EDWARD. EDWARD glances at BILLY inquisitively. EDWARD and BILLY trail behind SMEAGOL, scrambling through thorns and over jagged stones, as he guides them on a curving, treacherous route. Meanwhile, BOROMIR guides LEGOLAS, ARWEN, EOMER, and BORIN through gloomy forest as the shifting woods of Fangorn unfold before them, forming a boulevard of trees that grants passage along the ancient Rohan path. A dense, moist fog saturates the forest, and as the trees part ahead, the remains of the formidable stone rampart, fractured and broken into numerous jagged fragments, are disclosed. Far away, partially obscured in swirling vapor, stands the tower of Orthanc, undamaged by the tempest, with pale waters lapping at its base. Two small dwarves, BILBO and FRODO, relax on the demolished barricade with a banquet of pastries, meats, and ale spread before them. They puff on long pipes as they recline in the sunlight. BILBO interrupts FRODO before he can reply, as BOROMIR, LEGOLAS, ARWEN, and BORIN gaze at the scene before them. BOROMIR guides the group through the debris and driftwood floating upon the murky waters encircling the tower. YAVANNA, the towering ENT, strides towards them, startling all but BOROMIR, who gazes up the extended length of the towering spire as the ancient ENT nods his head sagely. FRODO's attention is drawn to something glowing with a golden hue amidst the muddy waters. LEGOLAS turns as, instantaneously, FRODO has leaped off his donkey and retrieved the Palantír."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "DEAGOL pulls on his umbrella, but is catapulted overboard and vanishes underground with a thud, while SMEAGOL leans over the wagon. DEAGOL turns to glance at him with a grin on his face. SMEAGOL advances towards DEAGOL, and then pounces on him, tickling him and extracting the shimmering bracelet from DEAGOL's drooping foot. SMEAGOL slides the bracelet onto his toe, ascending into madness as his form twists and contorts, becoming a spooky, shriveled phantom, and ultimately crawling into a dim tunnel beneath the Foggy Cliffs. A bleak panorama, covered in cactus plants and the scars of recent droughts, surrounds the shadowy Morgul Valley as it ascends toward the cliffs. FRODO and SAM are in a grimy sewer; SAM shifts in a restless nap, but FRODO is awake, his hand gliding down to the rope around his waist. A sudden whisper startles FRODO, who quickly tucks away the bracelet as GOLLUM gazes at them with sparkling eyes. SAM shifts, glances at FRODO, who nods his head. SAM then gazes at the dull, grey twilight. The days are growing dimmer when the earth suddenly wobbles, and a tumbling, rattling noise reverberates down the valley. SAM flashes GOLLUM a wary look and pivots back to dig in his satchel, holding up a slice of stale scone to FRODO. FRODO gazes at SAM inquisitively. FRODO and SAM trail GOLLUM, crawling through vines and over jagged pebbles, as he guides them on a twisting, arduous route. Meanwhile, GANDALF guides ARAGORN, LEGOLAS, THEODEN, and GIMLI through shadowy undergrowth as the drifting shrubs of Fangorn part before them, forming a corridor of bushes that permits passage along the ancient Isengard path. A thick, steamy fog fills the undergrowth, and as the shrubs part ahead, the remnants of the mighty wooden fence, splintered and fragmented into numerous shattered pieces, appear. In the distance, partially shrouded in swirling vapor, stands the spire of Orthanc, unscathed by the squall, with clear streams flowing about its base. Two tiny hobbits, MERRY and PIPPIN, perch on the shattered fence with a banquet of fruits, cheeses, and juice spread before them. They puff on lengthy reeds as they recline in the shade. MERRY interrupts PIPPIN before he can comment, as GANDALF, ARAGORN, LEGOLAS, and GIMLI gaze at the scene before them. GANDALF leads the group through the debris and litter floating upon the murky water surrounding the spire. TREEBEARD, the colossal ENT, strides towards them, startling all but GANDALF, who gazes up the towering length of the shadowy spire as the ancient ENT nods his head sagely. PIPPIN's gaze is attracted by something glowing with a silver light in the murky water. ARAGORN spins around as, quick as a wink, PIPPIN has vaulted off his donkey and scooped up the Orb."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "BERT tugs on his kite, but is pulled off the pier and vanishes into the sky with a swoosh, while ERNIE leans over the bench. BERT turns to glance at him with a grin on his face. ERNIE moves towards BERT, and then leaps on him, tickling him and snatching the shining badge from BERT's limp paw. ERNIE slips the badge onto his collar, spiraling into delirium as his shape bends and twists, becoming a bizarre, wilted creature, and finally crawling into a hidden burrow beneath the Rolling Hills. A desolate terrain, covered in tumbleweeds and the marks of recent floods, surrounds the barren Sugar Valley as it vanishes up towards the hills. JAMES and LUCAS are in a grimy trench; LUCAS twitches in a fitful nap, but JAMES is alert, his arm reaching down to the rope around his waist. An abrupt whistle startles JAMES, who quickly conceals the badge as GRUMPY peers at them with flickering eyes. LUCAS stirs, glances at JAMES, who nods his head. LUCAS then looks at the faded, grey dusk. The weeks are becoming gloomier when the earth suddenly shakes, and a rolling, booming roar echoes down the valley. LUCAS throws GRUMPY a wary glance and turns back to dig in his satchel, holding up a strip of stale flatbread to JAMES. JAMES glances at LUCAS questioningly. JAMES and LUCAS follow GRUMPY, scrambling through thickets and across jagged cliffs, as he guides them on a meandering, punishing route. Meanwhile, MERLIN guides LANCELOT, ROBIN, CHARLES, and ODIN through dim undergrowth as the shifting brush of Sherwood parts before them, creating a corridor of shrubs that permits passage along the ancient Nottingham path. A dense, steamy fog fills the glen, and as the thicket divides ahead, the remnants of the massive timber fence, fractured and shattered into myriad splintered fragments, are exposed. Far away, half obscured in swirling vapor, stands the spire of Rivendell, untouched by the winds, with clear streams lapping about its base. Two tiny elves, WILLOW and MAPLE, perch on the broken fence with a spread of pastries, cheeses, and cider laid before them. They smoke long reeds as they recline in the sunlight. WILLOW interrupts MAPLE before he can reply, as MERLIN, LANCELOT, ROBIN, and ODIN gaze at the scene ahead. MERLIN leads the group through the debris and rubble floating upon the murky streams surrounding the spire. OAKEN, the towering TROLL, strides towards them, startling all but MERLIN, who gazes up the great height of the shadowy spire as the ancient TROLL nods his head sagely. MAPLE's eye is caught by something radiating with a silver glow in the muddy brook. LANCELOT pivots as, quick as a wink, MAPLE has leapt off his chariot and scooped up the Mirror Orb."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "DEAGOL is pulled underwater while SMEAGOL watches, then attacks and kills DEAGOL to take a glittering ring, which drives SMEAGOL mad and transforms him into GOLLUM. He retreats to a cave beneath the Misty Mountains. In a bleak landscape, FRODO and SAM rest, with FRODO alert and hiding the ring from GOLLUM. SAM offers lembas bread to FRODO as they follow GOLLUM on a difficult path. Meanwhile, GANDALF leads ARAGORN, LEGOLAS, THEODEN, and GIMLI through Fangorn Forest to the shattered ruins of Isengard. MERRY and PIPPIN relax nearby with a feast, as GANDALF's company encounters the giant ENT, TREEBEARD. PIPPIN is drawn to a glowing Palantír in the muddy water and quickly retrieves it."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "PIPPIN has jumped off his horse and picked up the Palantír ARAGORN turns as quick as a flash PIPPIN's eye is caught by something glowing with a golden light in the muddy waters the giant ENT strides towards them alarming all but GANDALF who stares up the long length of the dark tower as the old ENT nods his head wisely TREEBEARD GANDALF leads the company through the flotsam and jetsam floating upon the muddied waters surrounding the tower ARAGORN LEGOLAS and GIMLI stare at the sight before them MERRY cuts PIPPIN off before he can respond as GANDALF They puff on long pipes as they lie back in the sun Two small hobbits MERRY and PIPPIN sit on the smashed wall with a feast of breads meats and wine spread before them Far off half veiled in swirling steam stands the tower of Orthanc unbroken by the storm with pale waters lapping about its feet A thick humid mist fills the forest and as the forest separates ahead the ruins of the great stone wall cracked and splintered into countless jagged shards are revealed Meanwhile GANDALF leads ARAGORN LEGOLAS THEODEN and GIMLI through dark woodland as the moving forest of Fangorn opens before them creating an avenue of trees that allows access along the old Isengard road FRODO and SAM follow GOLLUM clambering through bracken and over jagged rocks as he leads them on a winding torturous path FRODO looks at SAM questioningly SAM shoots GOLLUM a hostile look and turns back to rummage in his knapsack holding up a piece of dried lembas bread to FRODO The days are growing darker when the ground suddenly quivers and a rolling rumbling noise echoes down the valley SAM then looks at the dead brown twilight SAM stirs looks at FRODO who shakes his head A sudden hiss startles FRODO who quickly hides the ring as GOLLUM peers at them with gleaming eyes SAM twitches in a restless sleep but FRODO is awake his hand trailing down to the chain around his neck as it disappears up towards the mountains FRODO and SAM are in a filthy culvert A grim landscape covered in thorn bushes and the scars of recent fires surrounds the dark Morgul Valley SMEAGOL slips the ring onto his finger descending into madness as his body twists and distorts becoming a creepy shriveled wretch and finally crawling into a dark cave beneath the Misty Mountains SMEAGOL moves towards DEAGOL and then jumps on him strangling him and ripping the glittering ring from DEAGOL's limp hand DEAGOL turns to look at him with a smirk on his face while SMEAGOL leans over the boat DEAGOL pulls on his rod but is hauled overboard and disappears underwater with a splash"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Two small hobbits MERRY and PIPPIN sit on the smashed wall with a feast of breads meats and wine spread before them A thick humid mist fills the forest and as the forest separates ahead the ruins of the great stone wall cracked and splintered into countless jagged shards are revealed SAM then looks at the dead brown twilight ARAGORN LEGOLAS and GIMLI stare at the sight before them PIPPIN has jumped off his horse and picked up the Palantír as it disappears up towards the mountains FRODO and SAM are in a filthy culvert A grim landscape covered in thorn bushes and the scars of recent fires surrounds the dark Morgul Valley The days are growing darker when the ground suddenly quivers and a rolling rumbling noise echoes down the valley FRODO and SAM follow GOLLUM clambering through bracken and over jagged rocks as he leads them on a winding torturous path SAM stirs looks at FRODO who shakes his head the giant ENT strides towards them alarming all but GANDALF who stares up the long length of the dark tower as the old ENT nods his head wisely SAM shoots GOLLUM a hostile look and turns back to rummage in his knapsack holding up a piece of dried lembas bread to FRODO They puff on long pipes as they lie back in the sun Meanwhile GANDALF leads ARAGORN LEGOLAS THEODEN and GIMLI through dark woodland as the moving forest of Fangorn opens before them creating an avenue of trees that allows access along the old Isengard road PIPPIN's eye is caught by something glowing with a golden light in the muddy waters while SMEAGOL leans over the boat FRODO looks at SAM questioningly DEAGOL turns to look at him with a smirk on his face Far off half veiled in swirling steam stands the tower of Orthanc unbroken by the storm with pale waters lapping about its feet ARAGORN turns as quick as a flash SMEAGOL slips the ring onto his finger descending into madness as his body twists and distorts becoming a creepy shriveled wretch and finally crawling into a dark cave beneath the Misty Mountains GANDALF leads the company through the flotsam and jetsam floating upon the muddied waters surrounding the tower SAM twitches in a restless sleep but FRODO is awake his hand trailing down to the chain around his neck A sudden hiss startles FRODO who quickly hides the ring as GOLLUM peers at them with gleaming eyes TREEBEARD DEAGOL pulls on his rod but is hauled overboard and disappears underwater with a splash SMEAGOL moves towards DEAGOL and then jumps on him strangling him and ripping the glittering ring from DEAGOL's limp hand MERRY cuts PIPPIN off before he can respond as GANDALF"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "FRODO and SAM follow GOLLUM clambering through bracken and over jagged rocks as he leads them on a winding torturous path Meanwhile GANDALF leads ARAGORN LEGOLAS THEODEN and GIMLI through dark woodland as the moving forest of Fangorn opens before them creating an avenue of trees that allows access along the old Isengard road A thick humid mist fills the forest and as the forest separates ahead the ruins of the great stone wall cracked and splintered into countless jagged shards are revealed Far off half veiled in swirling steam stands the tower of Orthanc unbroken by the storm with pale waters lapping about its feet Two small hobbits MERRY and PIPPIN sit on the smashed wall with a feast of breads meats and wine spread before them They puff on long pipes as they lie back in the sun MERRY cuts PIPPIN off before he can respond as GANDALF ARAGORN LEGOLAS and GIMLI stare at the sight before them GANDALF leads the company through the flotsam and jetsam floating upon the muddied waters surrounding the tower TREEBEARD the giant ENT strides towards them alarming all but GANDALF who stares up the long length of the dark tower as the old ENT nods his head wisely PIPPIN's eye is caught by something glowing with a golden light in the muddy waters ARAGORN turns as quick as a flash PIPPIN has jumped off his horse and picked up the Palantír DEAGOL pulls on his rod but is hauled overboard and disappears underwater with a splash while SMEAGOL leans over the boat DEAGOL turns to look at him with a smirk on his face SMEAGOL moves towards DEAGOL and then jumps on him strangling him and ripping the glittering ring from DEAGOL's limp hand SMEAGOL slips the ring onto his finger descending into madness as his body twists and distorts becoming a creepy shriveled wretch and finally crawling into a dark cave beneath the Misty Mountains A grim landscape covered in thorn bushes and the scars of recent fires surrounds the dark Morgul Valley as it disappears up towards the mountains FRODO and SAM are in a filthy culvert SAM twitches in a restless sleep but FRODO is awake his hand trailing down to the chain around his neck A sudden hiss startles FRODO who quickly hides the ring as GOLLUM peers at them with gleaming eyes SAM stirs looks at FRODO who shakes his head SAM then looks at the dead brown twilight The days are growing darker when the ground suddenly quivers and a rolling rumbling noise echoes down the valley SAM shoots GOLLUM a hostile look and turns back to rummage in his knapsack holding up a piece of dried lembas bread to FRODO FRODO looks at SAM questioningly"
        }
      ]
    }
  ]
}