{
  "ground_truth": "Strasser looks up from the book, and Rick reaches over to take the book from his hand. Rick looks up from the book and gets up, walking away toward the gambling room. A couple enters the front door—Victor Laszlo, the Czech resistance leader, and a very pretty young woman in a simple white gown, Miss Ilsa Lund. The headwaiter approaches them, and as he takes them to a table, they pass by the piano, where the woman looks at Sam. She is so beautiful that people turn to stare, and Sam, making a conscious effort, keeps his eyes on the keyboard as they go past, though he steals a look in her direction afterward, appearing to know her. Berger, a slight, middle-aged man, observes the couple from a distance. The headwaiter seats Ilsa, and Strasser and Renault look up at them from their table. Laszlo sits opposite Ilsa and surveys the room while Berger walks up to their table. Carefully lifting something up, Berger holds it for their view, then sits down with them as Ilsa tries to warn him. Berger, taking the cue, sighs and puts the ring away as Renault approaches the table from behind Laszlo. Ilsa's manner is friendly yet reserved, her voice low and soft. Renault sits down, and Ilsa glances in Sam's direction. Suddenly, Renault jumps to his feet as Strasser enters, bowing and smiling pleasantly, but neither Ilsa nor Laszlo shows the slightest recognition. Strasser waits to be asked to seat himself, and Laszlo stands. Strasser looks sharply at Renault, only to see a noncommittal smile on his face, and then Renault and Strasser bow shortly. Ilsa smiles back at Strasser, although her eyes remain troubled. On the floor, Corina strums a guitar and starts her number, while Laszlo looks around with apparent casualness. He notices Strasser and Renault whispering together and sees Berger at the bar, so he rises and goes off. Ilsa's troubled profile is evident, and while Corina sings, Sam gives a worried glance in Ilsa's direction, which Ilsa notices. At the bar, Berger is sipping a drink as Laszlo walks up and casually takes a place next to him. Laszlo takes the ring and looks at it, and Berger shakes his head. Laszlo quietly absorbs the shock and stops when Sacha brings a drink to him. Corina finishes her song, and the crowd applauds enthusiastically as Ilsa sits alone at her table. Sam sits down, ready to play, and begins a number nervously, seemingly waiting for anything. He looks very uncomfortable and even more scared now. Of course he can. Ilsa starts to hum.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Strasser gazes up from the tome, and Rick extends over to seize the tome from his grasp. Rick gazes up from the tome and rises, strolling away toward the wagering chamber. A pair enters the main entrance—Victor Laszlo, the Czech opposition chief, and a very attractive young lady in a plain white dress, Miss Ilsa Lund. The headwaiter nears them, and as he escorts them to a table, they pass by the piano, where the lady glances at Sam. She is so lovely that individuals turn to gaze, and Sam, making a deliberate effort, keeps his gaze on the keys as they go past, though he sneaks a glimpse in her direction afterward, seeming to recognize her. Berger, a slight, middle-aged gentleman, watches the pair from a distance. The headwaiter places Ilsa, and Strasser and Renault gaze up at them from their table. Laszlo sits across from Ilsa and explores the chamber while Berger steps up to their table. Carefully elevating something up, Berger holds it for their view, then sits down with them as Ilsa attempts to alert him. Berger, taking the signal, exhales and puts the circlet away as Renault nears the table from behind Laszlo. Ilsa's manner is cordial yet restrained, her voice low and gentle. Renault sits down, and Ilsa peeks in Sam's direction. Abruptly, Renault leaps to his feet as Strasser enters, bowing and smiling agreeably, but neither Ilsa nor Laszlo shows the slightest acknowledgment. Strasser waits to be invited to seat himself, and Laszlo stands. Strasser gazes sharply at Renault, only to see a noncommittal grin on his countenance, and then Renault and Strasser bow briefly. Ilsa grins back at Strasser, although her eyes remain disturbed. On the floor, Corina strums a guitar and begins her piece, while Laszlo glances around with apparent nonchalance. He notices Strasser and Renault murmuring together and sees Berger at the bar, so he rises and departs. Ilsa's disturbed aspect is noticeable, and while Corina sings, Sam gives a worried glance in Ilsa's direction, which Ilsa notices. At the bar, Berger is sipping a beverage as Laszlo steps up and casually takes a position next to him. Laszlo takes the circlet and examines it, and Berger shakes his head. Laszlo quietly absorbs the surprise and pauses when Sacha brings a beverage to him. Corina completes her piece, and the crowd cheers enthusiastically as Ilsa sits solo at her table. Sam sits down, prepared to perform, and begins a piece nervously, seemingly waiting for anything. He looks very uncomfortable and even more frightened now. Of course he can. Ilsa begins to hum."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Strasser is looked up at from the book, and the book is reached over for by Rick to be taken from his hand. The book is looked up from by Rick, and he gets up, walking away toward the gambling room. The front door is entered by a couple—Victor Laszlo, the Czech resistance leader, and a very pretty young woman in a simple white gown, Miss Ilsa Lund. The headwaiter approaches them, and they are taken to a table by him as they pass by the piano, where Sam is looked at by the woman. She is so beautiful that stares are turned by people, and Sam, making a conscious effort, keeps his eyes on the keyboard while they are passed by, though a look is stolen by him in her direction afterward, appearing to know her. The couple is observed from a distance by Berger, a slight, middle-aged man. Ilsa is seated by the headwaiter, and they are looked up at by Strasser and Renault from their table. Opposite Ilsa, Laszlo sits and surveys the room while their table is walked up to by Berger. Carefully, something is lifted up by Berger and it is held for their view, then he sits down with them as a warning is tried to be given to him by Ilsa. Taking the cue, a sigh is given by Berger and the ring is put away as the table is approached from behind Laszlo by Renault. Her manner is friendly yet reserved, her voice low and soft. Down sits Renault, and a glance in Sam's direction is given by Ilsa. Suddenly, Renault jumps to his feet as Strasser enters, bowing and smiling pleasantly, but neither Ilsa nor Laszlo shows the slightest recognition. Strasser waits to be asked to seat himself, and Laszlo stands. A sharp look is given to Renault by Strasser, only to see a noncommittal smile on his face, and then a short bow is exchanged by Renault and Strasser. A smile is given back to Strasser by Ilsa, although her eyes remain troubled. On the floor, a guitar is strummed by Corina and her number is started, while apparent casualness is looked around with by Laszlo. Strasser and Renault are noticed whispering together and Berger is seen at the bar, so he rises and goes off. Ilsa's troubled profile is evident, and as Corina sings, a worried glance in Ilsa's direction is given by Sam, which is noticed by Ilsa. At the bar, a drink is sipped by Berger as Laszlo walks up and casually takes a place next to him. The ring is taken by Laszlo and it is looked at, and Berger shakes his head. Quietly, the shock is absorbed by Laszlo and a stop is made when Sacha brings a drink to him. Her song is finished by Corina, and enthusiastic applause is given by the crowd as Ilsa sits alone at her table. Sam sits down, ready to play, and a number is nervously begun by him, seemingly waiting for anything. He looks very uncomfortable and even more scared now. Of course he can. Ilsa starts to hum."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Strasser looks up from the book, and Rick takes it from him before walking toward the gambling room. Victor Laszlo, the Czech resistance leader, enters with Miss Ilsa Lund, a lovely young woman in a simple white gown. Passing the piano, Ilsa captures attention with her beauty; Sam, at the piano, avoids eye contact but later sneaks a glance, recognizing her. Berger, a slight, middle-aged man, observes them. The headwaiter seats Ilsa as Strasser and Renault watch. Laszlo sits opposite Ilsa and surveys the room, while Berger approaches and discreetly shows them something before Ilsa warns him. Berger then hides the item as Renault joins them. Ilsa's demeanor is friendly yet reserved. Renault rises suddenly when Strasser enters; neither Ilsa nor Laszlo acknowledges him. Strasser waits to be invited to sit, and Laszlo stands. Strasser and Renault exchange bows, with Ilsa smiling at Strasser despite troubled eyes. Corina starts playing the guitar, while Laszlo observes Strasser and Renault conversing and notices Berger at the bar. Laszlo joins Berger and examines the ring, absorbing the shock before Sacha brings him a drink. Corina finishes her song to applause as Ilsa sits alone. Sam nervously begins playing another number, feeling uncomfortable yet anticipating something. Ilsa begins to hum."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Strasser looks up from the book as Rick takes it and walks toward the gambling room. Victor Laszlo, the Czech resistance leader, and Miss Ilsa Lund, a beautiful woman in a white gown, enter. People stare as Ilsa glances at Sam, who pretends to focus on the piano but sneaks a look, seemingly recognizing her. Berger observes the couple, and the headwaiter seats Ilsa as Strasser and Renault notice them. Laszlo joins Ilsa, and Berger approaches, showing them something discreetly before sitting. Ilsa warns Berger, who sighs and hides the ring as Renault arrives. Ilsa is friendly yet reserved, glancing at Sam. Renault jumps as Strasser enters, but Ilsa and Laszlo remain indifferent. Strasser waits for a seat as Laszlo stands; Renault and Strasser exchange short bows. Ilsa smiles at Strasser, her eyes troubled. Corina plays guitar and sings while Laszlo notices Strasser, Renault, and Berger. He leaves as Ilsa looks worriedly. At the bar, Berger sips a drink next to Laszlo, who examines the ring and absorbs the shock quietly. Corina finishes her song, and the crowd applauds as Ilsa sits alone. Sam nervously starts playing, uneasy and scared, as Ilsa hums along."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Strasser, having been deeply engrossed in his book, suddenly looks up, breaking his focus as Rick reaches over to gently take the book from his hands. Rick then directs his gaze upward from the book he now holds and rises from his seat, proceeding to walk away leisurely toward the bustling gambling room nearby. At that moment, the front door swings open, and a couple enters gracefully—Victor Laszlo, the renowned Czech resistance leader whose presence commands attention, and a very pretty young woman, Miss Ilsa Lund, elegantly dressed in a simple, striking white gown. As they make their entrance, the headwaiter approaches them with a courteous demeanor and, as he guides them to their table, they pass by the grand piano. Here, the woman, with an air of grace, glances at Sam, the pianist. Her beauty is so captivating that it turns heads, drawing the gaze of many. Sam, exerting a conscious effort, keeps his focus intently on the keys beneath his fingers as they pass, though he discreetly steals a glance in her direction afterward, hinting at a past acquaintance. Observing keenly from a distance is Berger, a slight, middle-aged man, who watches the couple intently. The headwaiter, executing his role with precision, seats Ilsa while Strasser and Renault, situated at their own table, acknowledge the couple with their eyes. Laszlo takes his seat opposite Ilsa, casting a discerning eye around the room, while Berger makes his way to their table with intention. Carefully, Berger lifts an object for their discreet viewing, then joins them at the table as Ilsa, with a subtle gesture, attempts to caution him. Berger, understanding her cue, sighs softly and puts the ring away just as Renault approaches their table stealthily from behind Laszlo. Ilsa's demeanor is a perfect blend of friendliness and reserve, her voice low and soft as she speaks. Renault takes his seat, and Ilsa, almost instinctively, glances in Sam's direction. Abruptly, Renault springs to his feet upon Strasser's entrance, bowing and smiling in a manner both pleasant and respectful, yet neither Ilsa nor Laszlo offers any sign of recognition. Strasser, awaiting an invitation, stands poised, and Laszlo rises to acknowledge him. Strasser's gaze darts sharply toward Renault, who merely returns a noncommittal smile, and then Renault and Strasser exchange short bows. Ilsa returns Strasser's smile, albeit with eyes that betray her inner turmoil. On the floor, Corina begins strumming a guitar, starting her musical number, while Laszlo, maintaining an air of casualness, surveys the room. Within his field of view, Strasser and Renault are seen whispering conspiratorially, and he also notices Berger positioned at the bar, prompting him to rise and leave the table. Ilsa's profile, marked by its troubled expression, becomes more apparent. While Corina continues to sing, Sam casts a worried glance in Ilsa's direction, capturing her attention. Meanwhile, Berger, seated at the bar and sipping his drink leisurely, is joined by Laszlo, who casually takes a spot beside him. Looking intently at the ring Berger presents, Laszlo absorbs the shock quietly. His reflections are interrupted when Sacha arrives with a drink for him, and Corina's song reaches its conclusion, earning enthusiastic applause from the crowd. Ilsa, seated alone at her table, presents a solitary figure as Sam, preparing to play, sits down and nervously begins a number, seemingly apprehensive and expectant. His discomfort grows, and a sense of fear becomes even more apparent. Yet, despite the tension, Ilsa begins to hum softly, adding to the atmosphere in a gentle, melodious way."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Strasser, who had been completely absorbed and deeply lost in the world of his book, suddenly lifts his gaze, breaking his intense focus as Rick reaches over with a gentle touch to take the book from his hands. With a deliberate motion, Rick directs his eyes upward from the book that he now possesses and rises from his seat with ease, proceeding to walk away in an unhurried manner toward the bustling gambling room situated nearby. Just at that moment, the front door swings open with a quiet creak, and a couple enters with an air of grace and confidence—Victor Laszlo, the highly regarded and celebrated Czech resistance leader whose very presence demands attention and respect, and a very pretty young woman, Miss Ilsa Lund, who is elegantly dressed in a simple yet striking white gown that highlights her features. As they gracefully make their entrance, the attentive headwaiter, maintaining a courteous demeanor, approaches them, and as he guides them with precision to their table, they pass by the grand piano. Here, the woman, exuding an air of grace, bestows a glance upon Sam, the talented pianist. Her beauty is so captivating and striking that it naturally draws the gaze of many bystanders, turning heads in admiration. Sam, exerting a conscious effort, keeps his focus intently on the keys beneath his fingers as they pass by, though he discreetly and subtly steals a glance in her direction afterward, hinting at a past acquaintance that lingers in his memory. Observing keenly from a distance is Berger, a slight, middle-aged man whose expression is one of deep focus, watching the couple intently with keen interest. The headwaiter, executing his role with precision and professionalism, seats Ilsa while Strasser and Renault, situated at their own table nearby, acknowledge the entrance of the couple with their eyes. Laszlo takes his seat directly opposite Ilsa, casting a discerning eye around the room, while Berger makes his way purposefully to their table. Carefully and discreetly, Berger lifts an object for their private viewing, then joins them at the table as Ilsa, with a subtle gesture, attempts to convey a cautionary message to him. Berger, understanding her cue with a nod of recognition, sighs softly and puts the ring away just as Renault approaches their table with stealthy steps from behind Laszlo. Ilsa's demeanor is a complex blend of friendliness and reserve, and her voice, when she speaks, is low and soft, carrying a note of cautious warmth. Renault takes his seat, and Ilsa, almost instinctively and with a subtle awareness, glances in Sam's direction. Abruptly, Renault springs to his feet upon Strasser's entrance into the room, bowing and smiling in a manner that is both pleasant and respectful, yet neither Ilsa nor Laszlo offers any overt sign of recognition. Strasser, standing poised and awaiting an invitation, remains attentive, and Laszlo rises to acknowledge him with a nod. Strasser's gaze darts sharply toward Renault, who merely returns a noncommittal smile, and then Renault and Strasser exchange short bows in a formal manner. Ilsa returns Strasser's smile, but her eyes, betraying her inner turmoil, reveal a different story. On the floor, Corina starts to strum the strings of her guitar, beginning her musical number with gentle notes, while Laszlo, maintaining an air of casualness, surveys the room attentively. Within his field of view, Strasser and Renault are seen whispering in a conspiratorial manner, and he also takes note of Berger positioned at the bar, prompting him to rise and leave the table. Ilsa's profile, marked by its troubled expression, becomes more apparent as she sits alone. While Corina continues to sing her song with passion, Sam casts a worried glance in Ilsa's direction, a look that captures her attention. Meanwhile, Berger, seated at the bar and sipping his drink leisurely, is joined by Laszlo, who casually takes a spot beside him. Looking intently at the ring Berger presents, Laszlo absorbs the shock quietly with a composed expression. His reflections are interrupted when Sacha arrives with a refreshing drink for him, and Corina's song reaches its conclusion, earning enthusiastic applause from the appreciative crowd. Ilsa, seated alone at her table, presents a solitary and contemplative figure as Sam, preparing to play, sits down and nervously begins a number, his demeanor one of apprehension and expectancy. His discomfort grows more evident, and a sense of underlying fear becomes even more apparent. Yet, despite the tension that hangs in the air, Ilsa begins to hum softly, adding to the atmosphere in a gentle, melodious way that echoes throughout the room."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Strasser glances up from the book he was engrossed in, just in time for Rick to reach over smoothly and gently take the book from his hand. After absorbing whatever he needed from the book, Rick lifts his gaze, rises from his seat with a deliberate motion, and strides purposefully toward the gambling room, leaving the scene behind. Meanwhile, the front door swings open, allowing a couple to step gracefully into the room. They are Victor Laszlo, a notable figure in the Czech resistance, and Miss Ilsa Lund, a strikingly beautiful young woman clad in a simple yet elegant white gown. As they enter, the headwaiter approaches them with professional swiftness, guiding them to their table. On their way, they pass by the piano, where Miss Lund's striking beauty draws the attention of onlookers, compelling them to turn and stare. Sam, seated at the piano, conscientiously keeps his focus on the keyboard, yet he cannot resist stealing a discreet glance in her direction as they pass, suggesting he knows her. Observing from a distance, Berger, a slight and middle-aged man, discreetly watches the couple. The headwaiter, fulfilling his duty, pulls the chair out and seats Ilsa elegantly, catching the attention of Strasser and Renault, who look up from their table to take in the scene. Laszlo takes his seat opposite Ilsa, his eyes scanning the room with a calculated survey. Berger then makes his way to their table with measured steps, carefully lifts an object for their view, and joins them at the table with a sense of quiet urgency as Ilsa subtly tries to caution him. Picking up on her cue, Berger lets out a resigned sigh and discreetly slips the ring back into its place just as Renault approaches their table stealthily from behind Laszlo. In contrast, Ilsa's demeanor remains amicable yet restrained, her voice carrying a gentle softness. Without much delay, Renault slips into a seat, prompting Ilsa to cast a glance in Sam's direction. Abruptly, Renault springs to his feet the moment Strasser enters, offering a polite bow and a congenial smile, though Ilsa and Laszlo remain impassive, showing no acknowledgment. Strasser pauses, waiting for an invitation to sit, and Laszlo rises to his feet. Strasser gives Renault a sharp look, encountering only a neutral smile in return, after which Renault and Strasser exchange brief bows. Ilsa returns Strasser's smile, though a hint of trouble lingers in her eyes. Nearby, Corina, with effortless flair, strums her guitar and launches into her performance, while Laszlo feigns casualness as he scans the room. His eyes catch Strasser and Renault engaged in a whispered conversation, then spot Berger at the bar, prompting him to rise and depart from the table. Ilsa's profile, marked by a subtle distress, is illuminated as Corina's voice fills the room. Sam, amid his performance, risks a worried glance in Ilsa's direction, a look that she catches. At the bar, Berger savors a drink just as Laszlo approaches and smoothly takes a place beside him. Without words, Laszlo takes the ring from Berger and inspects it, only for Berger to shake his head solemnly. Laszlo absorbs the shock quietly, interrupted only when Sacha serves him a drink. Corina brings her song to a rousing finish, and the room erupts with enthusiastic applause as Ilsa remains alone, seated at her table. Seated at the piano, Sam readies himself to play, his nervous energy palpable, as though bracing for whatever may come next. Despite his discomfort and rising fear, he's there, caught in the moment. With a barely perceptible start, Ilsa begins to hum a tune, intertwining with the lingering tension in the air."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Strasser looks up from the book as Rick takes it from his hand and heads toward the gambling room. At the entrance, Victor Laszlo, the Czech resistance leader, arrives with Miss Ilsa Lund, a striking young woman in a simple white gown. As the headwaiter guides them to a table, Ilsa's beauty captures attention, and Sam at the piano, who seems to recognize her, keeps his eyes on the keyboard but glances her way. Berger, observing from afar, watches the couple. Once seated, Laszlo surveys the room, and Berger joins them, discreetly showing something before putting it away as Renault approaches. Ilsa's demeanor is both friendly and reserved, her voice soft. Renault sits, and Ilsa glances toward Sam. At that moment, Renault stands to greet Strasser, who enters with a bow. Strasser’s presence goes unacknowledged by Ilsa and Laszlo, and he waits to be invited to sit. Laszlo rises to greet Strasser with a slight bow, exchanging noncommittal gestures with Renault. Although Ilsa smiles at Strasser, her eyes reveal concern. Meanwhile, Corina plays the guitar, drawing Laszlo’s attention to Strasser and Renault whispering, as well as Berger at the bar. Laszlo approaches Berger, examines a ring he is shown, and pauses as Sacha brings him a drink. Corina ends her song to enthusiastic applause while Ilsa sits alone, her troubled profile noticeable. Sam, ready to play, starts a piece nervously, casting worried glances at Ilsa, which she notices. Laszlo joins Berger at the bar, quietly processing news as Sam, looking unsettled, begins his performance. Ilsa hums along softly."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Strasser looks up from the book, and Rick, the owner of Rick's Café Américain in Casablanca, reaches over to take the book from his hand. Rick looks up from the book and gets up, walking away toward the gambling room, which is a bustling hub of activity attracting various patrons. A couple enters the front door—Victor Laszlo, the renowned Czech resistance leader who has escaped Nazi capture multiple times, and a very pretty young woman in a simple white gown, Miss Ilsa Lund. The headwaiter approaches them, and as he takes them to a table, they pass by the piano, where the woman looks at Sam, the resident pianist and Rick's old friend. She is so beautiful that people turn to stare, and Sam, who recognizes her from Paris, making a conscious effort, keeps his eyes on the keyboard as they go past, though he steals a look in her direction afterward, appearing to know her. Berger, a slight, middle-aged man, observes the couple from a distance; he is discreetly allied with the underground resistance. The headwaiter seats Ilsa, and Strasser and Renault, the local French police captain with dubious loyalties, look up at them from their table. Laszlo sits opposite Ilsa and surveys the room while Berger walks up to their table. Carefully lifting something up, Berger holds it for their view, then sits down with them as Ilsa tries to warn him with a subtle gesture. Berger, taking the cue, sighs and puts the significant resistance ring away as Renault approaches the table from behind Laszlo. Ilsa's manner is friendly yet reserved, her voice low and soft, reflecting her caution in this public setting. Renault sits down, and Ilsa glances in Sam's direction. Suddenly, Renault jumps to his feet as Strasser, a high-ranking Nazi officer sent to capture Laszlo, enters, bowing and smiling pleasantly, but neither Ilsa nor Laszlo shows the slightest recognition. Strasser waits to be asked to seat himself, and Laszlo stands, maintaining a diplomatic politeness. Strasser looks sharply at Renault, only to see a noncommittal smile on his face, and then Renault and Strasser bow shortly. Ilsa smiles back at Strasser, although her eyes remain troubled, hinting at the complex emotions beneath her composed exterior. On the floor, Corina, a local performer known for her vibrant presence, strums a guitar and starts her number, while Laszlo looks around with apparent casualness, well aware of the dangers surrounding him. He notices Strasser and Renault whispering together and sees Berger at the bar, so he rises and goes off to confer with him. Ilsa's troubled profile is evident, and while Corina sings, Sam gives a worried glance in Ilsa's direction, which Ilsa notices, recalling their shared past. At the bar, Berger is sipping a drink as Laszlo walks up and casually takes a place next to him. Laszlo takes the ring and looks at it, a symbol of their dangerous mission, and Berger shakes his head. Laszlo quietly absorbs the shock and stops when Sacha, a sympathetic bartender working at Rick's, brings a drink to him. Corina finishes her song, and the crowd applauds enthusiastically as Ilsa sits alone at her table, lost in thought. Sam sits down, ready to play, and begins a number nervously, seemingly waiting for anything, his mind perhaps on the past he shared with Ilsa. He looks very uncomfortable and even more scared now in the tense atmosphere. Of course he can find courage. Ilsa starts to hum, perhaps remembering a song from their past."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "On the floor Corina strums a guitar and starts her number while Laszlo looks around with apparent casualness Strasser looks up from the book and Rick reaches over to take the book from his hand Corina finishes her song and the crowd applauds enthusiastically as Ilsa sits alone at her table Rick looks up from the book and gets up walking away toward the gambling room At the bar Berger is sipping a drink as Laszlo walks up and casually takes a place next to him A couple enters the front door—Victor Laszlo the Czech resistance leader and a very pretty young woman in a simple white gown Miss Ilsa Lund The headwaiter approaches them and as he takes them to a table they pass by the piano where the woman looks at Sam Miss Ilsa Lund Strasser looks up from the book and Rick reaches over to take the book from his hand A couple enters the front door—Victor Laszlo the Czech resistance leader and a very pretty young woman in a simple white gown She is so beautiful that people turn to stare and Sam making a conscious effort keeps his eyes on the keyboard as they go past though he steals a look in her direction afterward appearing to know her Berger a slight middleaged man observes the couple from a distance The headwaiter seats Ilsa and Strasser and Renault look up at them from their table Laszlo sits opposite Ilsa and surveys the room while Berger walks up to their table Laszlo sits opposite Ilsa and surveys the room while Berger walks up to their table Laszlo quietly absorbs the shock and stops when Sacha brings a drink to him He looks very uncomfortable and even more scared now Carefully lifting something up Berger holds it for their view then sits down with them as Ilsa tries to warn him Berger taking the cue sighs and puts the ring away as Renault approaches the table from behind Laszlo Of course he can Ilsa's manner is friendly yet reserved her voice low and soft Rick looks up from the book and gets up walking away toward the gambling room Renault sits down and Ilsa glances in Sam's direction Suddenly Renault jumps to his feet as Strasser enters bowing and smiling pleasantly but neither Ilsa nor Laszlo shows the slightest recognition Strasser waits to be asked to seat himself and Laszlo stands Strasser looks sharply at Renault only to see a noncommittal smile on his face and then Renault and Strasser bow shortly Ilsa smiles back at Strasser although her eyes remain troubled On the floor Corina strums a guitar and starts her number while Laszlo looks around with apparent casualness Suddenly Renault jumps to his feet as Strasser enters bowing and smiling pleasantly but neither Ilsa nor Laszlo shows the slightest recognition He notices Strasser and Renault whispering together and sees Berger at the bar so he rises and goes off Ilsa's troubled profile is evident and while Corina sings Sam gives a worried glance in Ilsa's direction which Ilsa notices At the bar Berger is sipping a drink as Laszlo walks up and casually takes a place next to him The headwaiter seats Ilsa and Strasser and Renault look up at them from their table The headwaiter approaches them and as he takes them to a table they pass by the piano where the woman looks at Sam Laszlo takes the ring and looks at it and Berger shakes his head Laszlo quietly absorbs the shock and stops when Sacha brings a drink to him Corina finishes her song and the crowd applauds enthusiastically as Ilsa sits alone at her table Sam sits down ready to play and begins a number nervously seemingly waiting for anything He looks very uncomfortable and even more scared now Of course he can Ilsa starts to hum"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Strasser looks up from the book and Rick reaches over to take the book from his hand. Rick looks up from the book and gets up walking away toward the gambling room. A couple enters the front door—Victor Laszlo the Czech resistance leader and a very pretty young woman in a simple white gown. Miss Ilsa Lund. The headwaiter approaches them and as he takes them to a table they pass by the piano where the woman looks at Sam. She is so beautiful that people turn to stare and Sam making a conscious effort keeps his eyes on the keyboard as they go past though he steals a look in her direction afterward appearing to know her. Berger a slight middleaged man observes the couple from a distance. The headwaiter seats Ilsa and Strasser and Renault look up at them from their table. Laszlo sits opposite Ilsa and surveys the room while Berger walks up to their table. Carefully lifting something up Berger holds it for their view then sits down with them as Ilsa tries to warn him. Berger taking the cue sighs and puts the ring away as Renault approaches the table from behind Laszlo. Ilsa's manner is friendly yet reserved her voice low and soft. Renault sits down and Ilsa glances in Sam's direction. Suddenly Renault jumps to his feet as Strasser enters bowing and smiling pleasantly but neither Ilsa nor Laszlo shows the slightest recognition. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Strasser waits to be asked to seat himself and Laszlo stands. Strasser looks sharply at Renault only to see a noncommittal smile on his face and then Renault and Strasser bow shortly. Ilsa smiles back at Strasser although her eyes remain troubled. On the floor Corina strums a guitar and starts her number while Laszlo looks around with apparent casualness. He notices Strasser and Renault whispering together and sees Berger at the bar so he rises and goes off. Ilsa's troubled profile is evident and while Corina sings Sam gives a worried glance in Ilsa's direction which Ilsa notices. At the bar Berger is sipping a drink as Laszlo walks up and casually takes a place next to him. Laszlo takes the ring and looks at it and Berger shakes his head. Laszlo quietly absorbs the shock and stops when Sacha brings a drink to him. Corina finishes her song and the crowd applauds enthusiastically as Ilsa sits alone at her table. Sam sits down ready to play and begins a number nervously seemingly waiting for anything. He looks very uncomfortable and even more scared now. Of course he can. Ilsa starts to hum."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Strasser looks up from the book and Rick reaches over to take the book from his hand. Rick looks up from the book and gets up walking away toward the gambling room. A couple enters the front door—Victor Laszlo the Czech resistance leader and a very pretty young woman in a simple white gown. Miss Ilsa Lund. The headwaiter approaches them and as he takes them to a table they pass by the piano where the woman looks at Sam. She is so beautiful that people turn to stare and Sam making a conscious effort keeps his eyes on the keyboard as they go past though he steals a look in her direction afterward appearing to know her. Berger a slight middleaged man observes the couple from a distance. The headwaiter seats Ilsa and Strasser and Renault look up at them from their table. Laszlo sits opposite Ilsa and surveys the room while Berger walks up to their table. Carefully lifting something up Berger holds it for their view then sits down with them as Ilsa tries to warn him. Berger taking the cue sighs and puts the ring away as Renault approaches the table from behind Laszlo. Ilsa's manner is friendly yet reserved her voice low and soft. Renault sits down and Ilsa glances in Sam's direction. Suddenly Renault jumps to his feet as Strasser enters bowing and smiling pleasantly but neither Ilsa nor Laszlo shows the slightest recognition. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. Strasser waits to be asked to seat himself and Laszlo stands. Strasser looks sharply at Renault only to see a noncommittal smile on his face and then Renault and Strasser bow shortly. Ilsa smiles back at Strasser although her eyes remain troubled. On the floor Corina strums a guitar and starts her number while Laszlo looks around with apparent casualness. He notices Strasser and Renault whispering together and sees Berger at the bar so he rises and goes off. Ilsa's troubled profile is evident and while Corina sings Sam gives a worried glance in Ilsa's direction which Ilsa notices. At the bar Berger is sipping a drink as Laszlo walks up and casually takes a place next to him. Laszlo takes the ring and looks at it and Berger shakes his head. Laszlo quietly absorbs the shock and stops when Sacha brings a drink to him. Corina finishes her song and the crowd applauds enthusiastically as Ilsa sits alone at her table. Sam sits down ready to play and begins a number nervously seemingly waiting for anything. He looks very uncomfortable and even more scared now. Of course he can. Ilsa starts to hum."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Strasser looks up from the book and Rick reaches over to take the book from his hand. Rick looks up from the book and gets up walking away toward the gambling room. A couple enters the front door—Victor Laszlo the Czech resistance leader and a very pretty young woman in a simple white gown. Miss Ilsa Lund. The headwaiter approaches them and as he takes them to a table they pass by the piano where the woman looks at Sam. She is so beautiful that people turn to stare and Sam making a conscious effort keeps his eyes on the keyboard as they go past though he steals a look in her direction afterward appearing to know her. Berger a slight middleaged man observes the couple from a distance. Laszlo takes the ring and looks at it and Berger shakes his head. Laszlo quietly absorbs the shock and stops when Sacha brings a drink to him. Corina finishes her song and the crowd applauds enthusiastically as Ilsa sits alone at her table. Sam sits down ready to play and begins a number nervously seemingly waiting for anything. He looks very uncomfortable and even more scared now. Of course he can. Ilsa starts to hum."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Strasser looks up from the book and Rick reaches over to take the book from his hand. Rick looks up from the book and gets up walking away toward the gambling room. A couple enters the front door—Victor Laszlo the Czech resistance leader and a very pretty young woman in a simple white gown. He looks very uncomfortable and even more scared now. Of course he can. Ilsa starts to hum."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Strasser looks up from the book, and the cat reaches over to take the book from his hand. The cat looks up from the book and gets up, walking away toward the gambling room. A couple enters the front door—a giraffe, the Czech resistance leader, and a very pretty young woman in a simple white gown, Miss Ilsa Lund. The penguin approaches them, and as he takes them to a table, they pass by the piano, where the woman looks at the monkey. She is so beautiful that people turn to stare, and the monkey, making a conscious effort, keeps his eyes on the keyboard as they go past, though he steals a look in her direction afterward, appearing to know her. A squirrel, a slight, middle-aged creature, observes the couple from a distance. The penguin seats Ilsa, and the elephant and the horse look up at them from their table. The giraffe sits opposite Ilsa and surveys the room while the squirrel walks up to their table. Carefully lifting something up, the squirrel holds it for their view, then sits down with them as Ilsa tries to warn him. The squirrel, taking the cue, sighs and puts the ring away as the horse approaches the table from behind the giraffe. Ilsa's manner is friendly yet reserved, her voice low and soft. The horse sits down, and Ilsa glances in the monkey's direction. Suddenly, the horse jumps to his feet as the elephant enters, bowing and smiling pleasantly, but neither Ilsa nor the giraffe shows the slightest recognition. The elephant waits to be asked to seat himself, and the giraffe stands. The elephant looks sharply at the horse, only to see a noncommittal smile on his face, and then the horse and the elephant bow shortly. Ilsa smiles back at the elephant, although her eyes remain troubled. On the floor, the llama strums a guitar and starts her number, while the giraffe looks around with apparent casualness. He notices the elephant and the horse whispering together and sees the squirrel at the bar, so he rises and goes off. Ilsa's troubled profile is evident, and while the llama sings, the monkey gives a worried glance in Ilsa's direction, which Ilsa notices. At the bar, the squirrel is sipping a drink as the giraffe walks up and casually takes a place next to him. The giraffe takes the ring and looks at it, and the squirrel shakes his head. The giraffe quietly absorbs the shock and stops when the fox brings a drink to him. The llama finishes her song, and the crowd applauds enthusiastically as Ilsa sits alone at her table. The monkey sits down, ready to play, and begins a number nervously, seemingly waiting for anything. He looks very uncomfortable and even more scared now. Of course he can. Ilsa starts to hum."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Strasser looks up from the magazine, and Rick reaches over to take the magazine from his hand. Rick looks up from the magazine and gets up, walking away toward the library. A couple enters the back door—Victor Laszlo, the Czech resistance leader, and a very pretty young woman in a simple red dress, Miss Ilsa Lund. The bartender approaches them, and as he takes them to a couch, they pass by the drum set, where the woman looks at Sam. She is so beautiful that people turn to stare, and Sam, making a conscious effort, keeps his eyes on the sheet music as they go past, though he steals a look in her direction afterward, appearing to know her. Berger, a slight, middle-aged man, observes the couple from a distance. The bartender seats Ilsa, and Strasser and Renault look up at them from their chair. Laszlo sits opposite Ilsa and surveys the room while Berger walks up to their couch. Carefully lifting something up, Berger holds it for their view, then sits down with them as Ilsa tries to warn him. Berger, taking the cue, sighs and puts the necklace away as Renault approaches the couch from behind Laszlo. Ilsa's manner is friendly yet reserved, her voice low and soft. Renault sits down, and Ilsa glances in Sam's direction. Suddenly, Renault jumps to his feet as Strasser enters, bowing and smiling pleasantly, but neither Ilsa nor Laszlo shows the slightest recognition. Strasser waits to be asked to seat himself, and Laszlo stands. Strasser looks sharply at Renault, only to see a noncommittal smile on his face, and then Renault and Strasser bow shortly. Ilsa smiles back at Strasser, although her eyes remain troubled. On the stage, Corina strums a violin and starts her number, while Laszlo looks around with apparent casualness. He notices Strasser and Renault whispering together and sees Berger at the snack bar, so he rises and goes off. Ilsa's troubled profile is evident, and while Corina sings, Sam gives a worried glance in Ilsa's direction, which Ilsa notices. At the snack bar, Berger is sipping a tea as Laszlo walks up and casually takes a place next to him. Laszlo takes the necklace and looks at it, and Berger shakes his head. Laszlo quietly absorbs the shock and stops when Sacha brings a soda to him. Corina finishes her song, and the crowd applauds enthusiastically as Ilsa sits alone at her couch. Sam sits down, ready to play, and begins a number nervously, seemingly waiting for anything. He looks very uncomfortable and even more scared now. Of course he can. Ilsa starts to hum."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Strasser glances down at the book, and Rick leans over to hand the book from his hand. Rick glances down at the book and sits down, strolling away toward the gambling room. A couple exits the front door—Victor Laszlo, the Czech resistance leader, and a very pretty young woman in a simple white gown, Miss Ilsa Lund. The headwaiter greets them, and as he guides them to a table, they linger by the piano, where the woman winks at Sam. She is so beautiful that people pause to chat, and Sam, making a conscious effort, keeps his eyes on the sheet music as they go past, though he sneaks a glance in her direction afterward, appearing to recognize her. Berger, a slight, middle-aged man, shadows the couple from a distance. The headwaiter places Ilsa at the table, and Strasser and Renault peek up at them from their table. Laszlo stands beside Ilsa and examines the room while Berger strolls up to their table. Carefully lowering something down, Berger hides it from their view, then stands with them as Ilsa tries to caution him. Berger, taking the hint, groans and moves the ring aside as Renault approaches the table from in front of Laszlo. Ilsa's manner is friendly yet contained, her voice low and gentle. Renault stands up, and Ilsa peers in Sam's direction. Suddenly, Renault sits as Strasser arrives, waving and frowning pleasantly, but neither Ilsa nor Laszlo shows the slightest acknowledgment. Strasser leaves without being asked to sit down, and Laszlo remains seated. Strasser stares softly at Renault, only to see a slight frown on his face, and then Renault and Strasser nod gently. Ilsa frowns back at Strasser, although her eyes remain peaceful. On the floor, Corina tunes a guitar and starts her piece, while Laszlo glances around with apparent attentiveness. He misses Strasser and Renault chatting together and doesn't see Berger at the bar, so he remains seated. Ilsa's calm profile is evident, and while Corina performs, Sam gives a relaxed glance in Ilsa's direction, which Ilsa overlooks. At the bar, Berger is creating a drink as Laszlo stands up and casually moves to a place next to him. Laszlo discards the ring and returns it, and Berger nods. Laszlo quietly processes the realization and moves when Sacha takes a drink from him. Corina starts her song, and the crowd listens quietly as Ilsa stands alone at her table. Sam stands up, ready to listen, and ends a number calmly, seemingly avoiding anything. He looks very relaxed and even more confident now. Of course he can't. Ilsa stops humming."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Johnson glances up from the skateboard, and Tim reaches over to take the skateboard from its tire. Tim glances up from the skateboard and stands up, walking away toward the gallery. A herd enters the back window—Marcus Jeeves, the Bolivian pastry leader, and a very hairy old man in a complex yellow hat, Mr. Greta Swanson. The gardener approaches them, and as he takes them to a bench, they pass by the telescope, where the man looks at Fred. He is so beautiful that creatures turn to stare, and Fred, making a conscious effort, keeps his eyes on the notebook as they go past, though he steals a look in his direction afterward, appearing to know him. Taylor, a tall, young woman, observes the herd from a distance. The gardener seats Greta, and Johnson and Collins glance up at them from their sofa. Jeeves sits opposite Greta and surveys the scene while Taylor walks up to their bench. Carefully lifting something up, Taylor holds it for their view, then sits down with them as Greta tries to warn her. Taylor, taking the hint, sighs and puts the button away as Collins approaches the bench from beside Jeeves. Greta's manner is aloof yet eager, her voice high and rough. Collins sits down, and Greta glances in Fred's direction. Suddenly, Collins leaps to his toes as Johnson enters, bowing and smiling reservedly, but neither Greta nor Jeeves shows the slightest recognition. Johnson waits to be asked to recline, and Jeeves stands. Johnson looks sharply at Collins, only to see a puzzled smirk on his lips, and then Collins and Johnson bow briefly. Greta grins back at Johnson, although her eyes remain uneasy. On the ceiling, Monica taps a tambourine and starts her exercise, while Jeeves looks around with apparent awkwardness. He notices Johnson and Collins whispering together and sees Taylor at the sofa, so he rises and goes off. Greta's peaceful profile is evident, and while Monica croons, Fred gives a relaxed glance in Greta's direction, which Greta notices. At the sofa, Taylor is twirling a wand as Jeeves walks up and casually takes a position next to her. Jeeves takes the button and examines it, and Taylor shakes her nose. Jeeves quietly absorbs the surprise and stops when Ben offers a wand to him. Monica finishes her exercise, and the swarm cheers enthusiastically as Greta sits alone at her bench. Fred sits down, ready to sketch, and begins an exercise tensely, seemingly waiting for everything. He looks very relaxed and even more joyful now. Of course he can. Greta starts to paint."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Rufus scans the room from the painting, and Jeremy leans over to retrieve the painting from his grip. Jeremy scans the room from the painting and stands up, meandering away toward the garden. A team enters the back door—Robert Anders, the Finnish intelligence officer, and an exceptionally charming young woman in a simple blue dress, Miss Clara Holt. The bellboy approaches them, and as he leads them to a booth, they pass by the violinist, where the woman glances at Julian. She is so captivating that individuals turn to gaze, and Julian, exerting a deliberate effort, keeps his focus on the strings as they go past, though he sneaks a peek in her direction afterward, appearing to recognize her. Randall, a tall, elderly gentleman, examines the team from afar. The bellboy seats Clara, and Rufus and Oliver glance at them from their booth. Anders sits opposite Clara and inspects the hall while Randall strides up to their booth. Casually presenting something, Randall holds it for their observation, then settles down with them as Clara tries to caution him. Randall, taking the hint, grumbles and tucks the bracelet away as Oliver approaches the booth from behind Anders. Clara's demeanor is amiable yet distant, her voice hushed and gentle. Oliver settles down, and Clara peeks in Julian's direction. Abruptly, Oliver leaps to his feet as Rufus enters, nodding and grinning warmly, but neither Clara nor Anders exhibits the faintest acknowledgment. Rufus pauses, awaiting an invitation to sit, and Anders rises. Rufus scrutinizes Oliver, only to see an ambiguous grin on his face, and then Oliver and Rufus nod slightly. Clara beams back at Rufus, although her demeanor remains unsettled. On the stage, Fiona plucks a harp and initiates her piece, while Anders glances around with apparent nonchalance. He notices Rufus and Oliver murmuring together and spies Randall at the counter, so he stands and departs. Clara's unsettled countenance is clear, and while Fiona performs, Julian gives an anxious look in Clara's direction, which Clara perceives. At the counter, Randall is sipping tea as Anders strolls up and casually claims a spot beside him. Anders examines the bracelet and studies it, and Randall shakes his head. Anders quietly processes the revelation and halts when Marvin delivers a tea to him. Fiona concludes her piece, and the audience applauds eagerly as Clara remains alone at her booth. Julian sits down, ready to perform, and starts a piece hesitantly, seemingly anticipating anything. He appears very uneasy and even more anxious now. Certainly, he can. Clara starts to whistle."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Strasser glances up from the magazine, and Rick reaches over to lift the magazine from his hand. Rick glances up from the magazine and rises, wandering toward the dining area. A couple drifts through the back gate—Victor Laszlo, the Czech resistance leader, and an elegantly dressed young lady in a vibrant red suit, Miss Ilsa Lund. The headwaiter greets them, and as he guides them to a booth, they stroll by the harp, where the woman glances at Sam. She is so enchanting that people pause to watch, and Sam, making a conscious effort, keeps his eyes on the sheet music as they drift past, though he sneaks a peek in her direction afterward, seeming to recognize her. Berger, a thin, middle-aged gentleman, monitors the couple from afar. The headwaiter settles Ilsa, and Strasser and Renault glance at them from their booth. Laszlo seats himself across from Ilsa and examines the space while Berger approaches their booth. Carefully swinging something around, Berger displays it for their view, then sits down with them as Ilsa attempts to caution him. Berger, understanding the hint, chuckles and tucks the bracelet away as Renault approaches the booth from behind Laszlo. Ilsa's demeanor is warm yet cautious, her voice gentle and quiet. Renault settles, and Ilsa peeks in Sam's direction. Unexpectedly, Renault leaps to his feet as Strasser enters, nodding and beaming warmly, but neither Ilsa nor Laszlo shows the slightest acknowledgment. Strasser waits to be invited to join, and Laszlo stands. Strasser glares at Renault, only to see a neutral grin on his face, and then Renault and Strasser exchange quick nods. Ilsa grins back at Strasser, although her eyes remain unsettled. On the stage, Corina strikes a drum and begins her routine, while Laszlo scans around with feigned nonchalance. He notices Strasser and Renault murmuring together and sees Berger at the counter, so he rises and departs. Ilsa's worried expression is evident, and while Corina performs, Sam casts a concerned glance in Ilsa's direction, which Ilsa notices. At the counter, Berger is nibbling a cookie as Laszlo strolls up and nonchalantly takes a position beside him. Laszlo grasps the bracelet and examines it, and Berger shakes his head. Laszlo quietly processes the discomfort and halts when Sacha hands a snack to him. Corina concludes her performance, and the audience applauds fervently as Ilsa sits alone at her booth. Sam sits down, ready to perform, and starts a piece nervously, seemingly anticipating something. He appears very uneasy and increasingly anxious now. Naturally, he can. Ilsa begins to whistle."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Blanche glances down from the scroll, and Bruce reaches over to grab the scroll from his paw. Bruce glances down from the scroll and stands up, strolling away toward the bakery. A pair sprints through the side door—Gustav, the Swiss scientist, and a rather striking young gentleman in a plain black suit, Mr. Otto Grant. The chef approaches them, and as he guides them to a counter, they wander by the violin, where the gentleman glances at Lee. He is so remarkable that creatures pause to gawk, and Lee, exerting significant effort, maintains his focus on the strings as they proceed by, though he sneaks a glimpse in his path afterward, seeming to recognize him. Dexter, a wiry, elderly owl, views the pair from afar. The chef perches Otto, and Blanche and Oliver glance at them from their perch. Gustav perches across from Otto and scans the bakery while Dexter shuffles up to their counter. Delicately hoisting something up, Dexter displays it for their inspection, then settles down with them as Otto attempts to caution him. Dexter, heeding the hint, grumbles and tucks the crown away as Oliver shuffles up to the counter behind Gustav. Otto's demeanor is cordial yet distant, his tone low and gentle. Oliver perches, and Otto peeks in Lee's path. Abruptly, Oliver leaps to his claws as Blanche glides in, nodding and grinning warmly, but neither Otto nor Gustav displays the faintest acknowledgment. Blanche waits to be invited to perch, and Gustav stands. Blanche peers critically at Oliver, only to notice a blank grin on his beak, and then Oliver and Blanche nod briefly. Otto grins back at Blanche, although his gaze remains uneasy. On the tiles, Marina plucks a harp and begins her piece, while Gustav examines his surroundings with apparent ease. He catches sight of Blanche and Oliver murmuring together and observes Dexter at the soda fountain, so he ascends and wanders off. Otto's uneasy visage is unmistakable, and while Marina chants, Lee gives a fretful glance in Otto's path, which Otto discerns. At the soda fountain, Dexter is sipping a milkshake as Gustav strolls up and leisurely claims a spot beside him. Gustav seizes the crown and inspects it, and Dexter shakes his beak. Gustav silently registers the surprise and pauses when Inga brings a milkshake to him. Marina concludes her piece, and the herd cheers enthusiastically as Otto perches alone at his counter. Lee perches, ready to strum, and commences a piece anxiously, seemingly anticipating anything. He appears exceedingly uneasy and even more frightened now. Naturally, he can. Otto begins to chant."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Rick takes a book from Strasser and heads to the gambling room. Victor Laszlo, a Czech resistance leader, and Ilsa Lund, a beautiful woman in a white gown, enter. Ilsa catches Sam's attention at the piano, although he tries to focus on playing. Berger, observing them, shows them something discreetly before Renault joins their table. Ilsa remains friendly but reserved. Renault stands as Strasser enters, and the two exchange polite bows. Ilsa smiles at Strasser, though her eyes reveal concern. Corina plays guitar, and Laszlo notices Strasser and Renault whispering. Concerned, Laszlo goes to the bar, where he sees Berger and examines a ring, appearing shaken. As Sacha brings Laszlo a drink, Corina finishes her song. Ilsa sits alone, and Sam nervously begins to play again, visibly uncomfortable and apprehensive as Ilsa hums along."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Ilsa starts to hum Of course he can He looks very uncomfortable and even more scared now Sam sits down ready to play and begins a number nervously seemingly waiting for anything Corina finishes her song and the crowd applauds enthusiastically as Ilsa sits alone at her table Laszlo quietly absorbs the shock and stops when Sacha brings a drink to him Laszlo takes the ring and looks at it and Berger shakes his head At the bar Berger is sipping a drink as Laszlo walks up and casually takes a place next to him Ilsa's troubled profile is evident and while Corina sings Sam gives a worried glance in Ilsa's direction which Ilsa notices He notices Strasser and Renault whispering together and sees Berger at the bar so he rises and goes off On the floor Corina strums a guitar and starts her number while Laszlo looks around with apparent casualness Ilsa smiles back at Strasser although her eyes remain troubled Strasser looks sharply at Renault only to see a noncommittal smile on his face and then Renault and Strasser bow shortly Strasser waits to be asked to seat himself and Laszlo stands Suddenly Renault jumps to his feet as Strasser enters bowing and smiling pleasantly but neither Ilsa nor Laszlo shows the slightest recognition Renault sits down and Ilsa glances in Sam's direction Ilsa's manner is friendly yet reserved her voice low and soft Berger taking the cue sighs and puts the ring away as Renault approaches the table from behind Laszlo Carefully lifting something up Berger holds it for their view then sits down with them as Ilsa tries to warn him Laszlo sits opposite Ilsa and surveys the room while Berger walks up to their table The headwaiter seats Ilsa and Strasser and Renault look up at them from their table Berger a slight middleaged man observes the couple from a distance She is so beautiful that people turn to stare and Sam making a conscious effort keeps his eyes on the keyboard as they go past though he steals a look in her direction afterward appearing to know her The headwaiter approaches them and as he takes them to a table they pass by the piano where the woman looks at Sam Miss Ilsa Lund A couple enters the front door—Victor Laszlo the Czech resistance leader and a very pretty young woman in a simple white gown Rick looks up from the book and gets up walking away toward the gambling room Strasser looks up from the book and Rick reaches over to take the book from his hand"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He notices Strasser and Renault whispering together and sees Berger at the bar so he rises and goes off Ilsa smiles back at Strasser although her eyes remain troubled Berger taking the cue sighs and puts the ring away as Renault approaches the table from behind Laszlo Laszlo takes the ring and looks at it and Berger shakes his head Ilsa starts to hum Berger a slight middleaged man observes the couple from a distance She is so beautiful that people turn to stare and Sam making a conscious effort keeps his eyes on the keyboard as they go past though he steals a look in her direction afterward appearing to know her Ilsa's manner is friendly yet reserved her voice low and soft Strasser waits to be asked to seat himself and Laszlo stands Carefully lifting something up Berger holds it for their view then sits down with them as Ilsa tries to warn him Sam sits down ready to play and begins a number nervously seemingly waiting for anything Renault sits down and Ilsa glances in Sam's direction Ilsa's troubled profile is evident and while Corina sings Sam gives a worried glance in Ilsa's direction which Ilsa notices Strasser looks sharply at Renault only to see a noncommittal smile on his face and then Renault and Strasser bow shortly He looks very uncomfortable and even more scared now Rick looks up from the book and gets up walking away toward the gambling room Suddenly Renault jumps to his feet as Strasser enters bowing and smiling pleasantly but neither Ilsa nor Laszlo shows the slightest recognition A couple enters the front door—Victor Laszlo the Czech resistance leader and a very pretty young woman in a simple white gown On the floor Corina strums a guitar and starts her number while Laszlo looks around with apparent casualness Of course he can The headwaiter approaches them and as he takes them to a table they pass by the piano where the woman looks at Sam Laszlo quietly absorbs the shock and stops when Sacha brings a drink to him The headwaiter seats Ilsa and Strasser and Renault look up at them from their table Laszlo sits opposite Ilsa and surveys the room while Berger walks up to their table Corina finishes her song and the crowd applauds enthusiastically as Ilsa sits alone at her table Strasser looks up from the book and Rick reaches over to take the book from his hand Miss Ilsa Lund At the bar Berger is sipping a drink as Laszlo walks up and casually takes a place next to him"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Strasser waits to be asked to seat himself and Laszlo stands Strasser looks sharply at Renault only to see a noncommittal smile on his face and then Renault and Strasser bow shortly Ilsa smiles back at Strasser although her eyes remain troubled On the floor Corina strums a guitar and starts her number while Laszlo looks around with apparent casualness He notices Strasser and Renault whispering together and sees Berger at the bar so he rises and goes off Ilsa's troubled profile is evident and while Corina sings Sam gives a worried glance in Ilsa's direction which Ilsa notices At the bar Berger is sipping a drink as Laszlo walks up and casually takes a place next to him Laszlo takes the ring and looks at it and Berger shakes his head Laszlo quietly absorbs the shock and stops when Sacha brings a drink to him Corina finishes her song and the crowd applauds enthusiastically as Ilsa sits alone at her table Sam sits down ready to play and begins a number nervously seemingly waiting for anything He looks very uncomfortable and even more scared now Of course he can Ilsa starts to hum Strasser looks up from the book and Rick reaches over to take the book from his hand Rick looks up from the book and gets up walking away toward the gambling room A couple enters the front door—Victor Laszlo the Czech resistance leader and a very pretty young woman in a simple white gown Miss Ilsa Lund The headwaiter approaches them and as he takes them to a table they pass by the piano where the woman looks at Sam She is so beautiful that people turn to stare and Sam making a conscious effort keeps his eyes on the keyboard as they go past though he steals a look in her direction afterward appearing to know her Berger a slight middleaged man observes the couple from a distance The headwaiter seats Ilsa and Strasser and Renault look up at them from their table Laszlo sits opposite Ilsa and surveys the room while Berger walks up to their table Carefully lifting something up Berger holds it for their view then sits down with them as Ilsa tries to warn him Berger taking the cue sighs and puts the ring away as Renault approaches the table from behind Laszlo Ilsa's manner is friendly yet reserved her voice low and soft Renault sits down and Ilsa glances in Sam's direction Suddenly Renault jumps to his feet as Strasser enters bowing and smiling pleasantly but neither Ilsa nor Laszlo shows the slightest recognition"
        }
      ]
    }
  ]
}