{
  "ground_truth": "The ominously muffled thud of their horses' hooves on the dank fir needles sets the scene as they arrive at the root of the mountain, where a sheer wall of rock towers before them. Within this wall, a creepy dark door gapes like a mouth of night, with signs and figures carved above its wide arch. At that moment, a chill wind rushes out of the doorway. Aragorn stares into the blackness, his hair blowing wildly, as the horses rear and buck in terror, turning until the three horses disappear. Aragorn turns resolutely towards the doorway and walks into the blackness, quickly followed by Legolas. Gimli is left alone, hesitating and struggling with his fear, before he plunges into the tunnel behind the others. Meanwhile, there is much activity as the entire camp is on the move; fires are doused, tents are pulled down, and horses are saddled. Theoden strides through the camp, Eomer at his side, preparing a little pony with a saddle and supplies. He wears an oversized helmet and Rohirrim clothing, appearing both nervous and excited. King Theoden breaks away from a column and rides up to Merry before wheeling his horse away, leaving Merry bitterly disappointed. Merry stands, head down, as a tiny dejected figure among the mighty Rohirrim on their large horses. Suddenly, Merry is plucked off the ground by a soldier who has snatched him by the collar. Merry twists around to see the soldier, and beneath a helmet and mail hood is Eowyn, disguised as a man. Merry's face is visible under the cape, looking on as the valley floor fills with thousands of horsemen who ride out after their king. Great siege towers and catapults roll across the Pelennor Fields, with thousands of flaming torches lighting the snarling, slathering Morgul Orcs marching in ragged torrents past cave trolls, who beat the drums of war. In the distance, Minas Tirith lies ahead. Aragorn leads Legolas and Gimli into a wide cavern, waving his torch through the darkness and illuminating a huge cavern. A ghastly cracking noise, like stone being sundered, cuts through the silence as a ghostly figure steps from the rock walls. Aragorn, Legolas, and Gimli look on in horror as a mummified spectre looms before them, eyeless sockets gazing out—it's the King of the Dead. Fog swirls around as the ghost snarls at Aragorn, who moves forward. The fog suddenly rolls back, forming a retreating wall of grey vapour, and reveals rank upon rank of spectral warriors with ghoulish faces. The fog unveils a dead army of many thousands assembled around the cavern. Aragorn stares grimly at the King of the Dead, holding his gaze as the King of the Dead moves relentlessly towards him. Aragorn, Legolas, and Gimli are now surrounded by an army of the dead.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The ominously muted thump of their horses' hooves on the damp fir needles sets the scene as they arrive at the base of the mountain, where a sheer barricade of stone towers before them. Within this barricade, a sinister dark portal gapes like a mouth of night, with signs and figures etched above its wide arch. At that moment, a chilly breeze rushes out of the entryway. Aragorn stares into the blackness, his hair blowing wildly, as the horses rear and buck in fright, turning until the three steeds vanish. Aragorn turns resolutely towards the entryway and walks into the blackness, quickly followed by Legolas. Gimli is left solitary, hesitating and grappling with his dread, before he plunges into the passageway behind the others. Meanwhile, there is much activity as the entire camp is on the move; fires are extinguished, tents are pulled down, and horses are saddled. Theoden strides through the encampment, Eomer at his side, readying a little pony with a saddle and provisions. He wears an oversized helmet and Rohirrim attire, appearing both anxious and excited. King Theoden breaks away from a column and rides up to Merry before turning his horse away, leaving Merry bitterly disappointed. Merry stands, head down, as a tiny dejected figure among the mighty Rohirrim on their large horses. Suddenly, Merry is plucked off the soil by a soldier who has seized him by the collar. Merry twists around to see the soldier, and beneath a helmet and mail hood is Eowyn, disguised as a man. Merry's face is visible under the cloak, looking on as the valley floor fills with thousands of horsemen who ride out after their king. Great siege towers and catapults roll across the Pelennor Fields, with thousands of flaming torches lighting the snarling, slathering Morgul Orcs marching in ragged torrents past cave trolls, who beat the drums of war. In the distance, Minas Tirith lies ahead. Aragorn leads Legolas and Gimli into a wide cavern, waving his torch through the gloom and illuminating a vast cavern. A ghastly cracking noise, like stone being split, cuts through the silence as a ghostly figure steps from the stone walls. Aragorn, Legolas, and Gimli look on in horror as a mummified spectre looms before them, eyeless sockets gazing out—it's the King of the Dead. Mist swirls around as the wraith snarls at Aragorn, who moves forward. The mist suddenly rolls back, forming a retreating barricade of grey vapor, and reveals rank upon rank of spectral warriors with ghoulish visages. The mist unveils a deceased army of many thousands assembled around the cavern. Aragorn stares grimly at the King of the Dead, holding his gaze as the King of the Dead moves relentlessly towards him. Aragorn, Legolas, and Gimli are now surrounded by a legion of the dead."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The ominously muffled thud of their horses' hooves on the dank fir needles sets the scene as they arrive at the root of the mountain, where a sheer wall of rock is towered above them. Within this wall, a creepy dark door is gaped like a mouth of night, with signs and figures carved above its wide arch. At that moment, a chill wind is rushed out of the doorway. The blackness is stared into by Aragorn, his hair blown wildly, as the horses are reared and bucked in terror, turning until the three horses are disappeared. The doorway is resolutely turned towards by Aragorn, and the blackness is walked into by him, quickly followed by Legolas. Gimli leaves himself alone, hesitating and struggling with his fear, before he plunges into the tunnel behind the others. Meanwhile, much activity fills the camp as it moves; fires douse, tents pull down, and horses saddle. The camp is strode through by Theoden, Eomer at his side, preparing a little pony with a saddle and supplies. An oversized helmet and Rohirrim clothing are worn by him, appearing both nervous and excited. Merry is broken away from by King Theoden as he rides up to him before his horse is wheeled away, leaving Merry bitterly disappointed. Head down, Merry stands, a tiny dejected figure is seen among the mighty Rohirrim on their large horses. Suddenly, the ground is plucked off of Merry by a soldier who snatches him by the collar. Merry twists around to see the soldier, and beneath a helmet and mail hood, Eowyn is found, disguised as a man. Merry’s face is looked upon by him under the cape, as the valley floor is filled with thousands of horsemen who ride out after their king. Great siege towers and catapults are rolled across the Pelennor Fields, with thousands of flaming torches lighting the snarling, slathering Morgul Orcs marching in ragged torrents past cave trolls, who drum the beats of war. In the distance, Minas Tirith is laid ahead. Legolas and Gimli are led by Aragorn into a wide cavern, his torch waved through the darkness, illuminating a huge cavern. A ghastly cracking noise, like stone being sundered, is cut through the silence as a ghostly figure steps from the rock walls. The horror is looked on by Aragorn, Legolas, and Gimli as a mummified spectre looms before them, eyeless sockets gazing out—it's the King of the Dead. Fog swirls around as the ghost snarls at Aragorn, who moves forward. Suddenly, the fog rolls back, forming a retreating wall of grey vapour, and rank upon rank of spectral warriors with ghoulish faces are revealed. The fog unveils a dead army of many thousands assembled around the cavern. The King of the Dead is grimly stared at by Aragorn, holding his gaze as the King of the Dead moves relentlessly towards him. An army of the dead surrounds Aragorn, Legolas, and Gimli."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The muffled thud of their horses' hooves on damp fir needles sets the scene as they reach the mountain's base, confronted by a sheer rock wall. A dark doorway gapes ominously within, and a chill wind rushes out. Aragorn, with his hair blowing, stares into the blackness as the startled horses rear and flee. Resolute, Aragorn enters the darkness, followed by Legolas. Gimli hesitates, struggling with fear, before plunging into the tunnel. Meanwhile, the camp bustles with activity; fires are doused, tents dismantled, and horses saddled. Theoden, with Eomer, prepares a small pony with supplies, wearing an oversized helmet and Rohirrim attire, both nervous and excited. Theoden rides to Merry, then departs, leaving Merry disheartened. Merry stands small among the mighty Rohirrim, until a soldier, Eowyn in disguise, hoists him up. Merry sees thousands of horsemen ride out with their king. On the Pelennor Fields, siege towers and catapults accompany flaming-torch-bearing Morgul Orcs and cave trolls marching to Minas Tirith. Aragorn leads Legolas and Gimli into a cavern, where a ghostly figure emerges with a cracking noise. They watch in horror as the mummified King of the Dead, with eyeless sockets, appears. Fog swirls, unveiling spectral warriors. Aragorn grimly faces the King of the Dead as spectral warriors surround them, forming an army of the dead."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Their horses' hooves thud ominously on damp fir needles as they reach the mountain's base, facing a towering rock wall and a dark, mouth-like door with carved signs. A chilling wind rushes out. Aragorn stares into the blackness, hair wild, as the terrified horses rear, disappearing. Resolutely, Aragorn enters the doorway, with Legolas following. Gimli hesitates, battling fear before plunging in. Meanwhile, the camp is bustling; fires are extinguished, tents collapsed, horses saddled. Theoden, alongside Eomer, prepares a pony with supplies, wearing nervous, excited Rohirrim attire. He leaves Merry, disappointed, among mighty Rohirrim riders. Suddenly, a soldier lifts Merry, revealing Eowyn disguised as a man. Merry watches, as the valley fills with horsemen riding after their king. Orcs and cave trolls march with siege towers and catapults, while Minas Tirith lies ahead. Aragorn, Legolas, and Gimli enter a wide cavern, Aragorn's torch revealing a cavern. A cracking noise cuts through as a ghost emerges from the rock. Horrified, they face the mummified King of the Dead. Fog swirls, revealing spectral warriors. Aragorn stands firm, surrounded by the dead army."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The eerily muffled thud of their horses' hooves resonating dully on the damp, dense fir needles begins to establish the scene as they make their way to the base of the looming mountain. Here, a towering, sheer wall of rock stands imposingly before them. Nestled within this rock wall is a sinister, dark door that gapes open, resembling the mouth of night itself, with a series of mysterious signs and intricate figures etched above its broad archway. At that precise moment, a cold, chilling wind rushes out of the open doorway. Aragorn stands, staring intensely into the inky blackness, his hair whipped wildly by the wind, as the horses, overcome with terror, rear up and buck frantically, eventually turning away and vanishing from sight. Resolutely, Aragorn turns toward the ominous doorway and walks determinedly into the darkness, with Legolas swiftly following suit. In the meantime, Gimli finds himself left standing alone, hesitating and grappling with his own fear, before finally mustering his courage and plunging into the tunnel behind his companions. Meanwhile, considerable activity envelops the camp as it springs into action; fires are meticulously extinguished, tents are methodically taken down, and horses are efficiently saddled in preparation. Theoden strides purposefully through the bustling camp, with Eomer walking at his side, as they ready a small pony with a saddle and supplies. He is clad in an oversized helmet and the distinctive clothing of the Rohirrim, and he appears simultaneously nervous and excited. King Theoden detaches himself from the column of riders and approaches Merry only to wheel his horse around, leaving Merry feeling bitterly disappointed and rather forlorn. Merry stands there, head bowed, appearing as a small, dejected figure amidst the mighty Rohirrim on their towering horses. All of a sudden, Merry is lifted off the ground by a soldier who snatches him by the collar. As Merry twists around to look at the soldier, he discovers beneath a helmet and mail hood, none other than Eowyn, skillfully disguised as a man. Merry's face, now visible under the cloak, gazes out across the valley floor, which is rapidly filling with countless horsemen riding out after their king. Massive siege towers and catapults rumble across the expanse of the Pelennor Fields, while tens of thousands of fiery torches illuminate the snarling, slavering Morgul Orcs marching in ragged, chaotic torrents past the cave trolls, who are rhythmically beating the ominous drums of war. In the distance, the grand city of Minas Tirith lies ahead. Aragorn leads Legolas and Gimli into a vast, expansive cavern, waving his torch vigorously through the enveloping darkness, which slowly illuminates the immense cavern. A ghastly cracking noise, akin to stone being torn asunder, pierces the silence as a ghostly figure emerges eerily from the rock walls. Aragorn, Legolas, and Gimli watch in horror as a mummified spectre looms menacingly before them, its eyeless sockets staring out—it is the formidable King of the Dead. Swirling fog encircles the scene, adding to the eerie atmosphere as the ghost snarls angrily at Aragorn, who courageously moves forward. Suddenly, the fog rolls back with a swift motion, forming a retreating wall of grey vapor, and reveals rank upon rank of spectral warriors with terrifying, ghastly faces. The swirling fog uncovers a vast army of the dead, numbering in the thousands, assembled ominously around the cavern. Aragorn stares grimly into the eyes of the King of the Dead, holding his gaze unwaveringly as the King of the Dead advances relentlessly toward him. Aragorn, Legolas, and Gimli find themselves now completely surrounded by the ghostly army of the dead."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The eerily muffled thud of their horses' hooves resonated dully on the damp, dense bed of fir needles, creating an atmospheric backdrop that begins to establish the scene as they slowly make their way to the formidable base of the looming, imposing mountain. Here, a towering and sheer wall of rock stands imposingly before them, exuding an almost tangible sense of grandeur and foreboding. Nestled within this formidable rock wall is a sinister, ominous, and dark door that gapes open wide, resembling the very mouth of night itself. Above its broad archway, a series of mysterious, unknown signs and intricate, enigmatic figures are meticulously etched. At that precise moment, a cold, chilling wind suddenly rushes out of the open doorway like an unseen phantom. Aragorn stands, staring intensely into the inky, impenetrable blackness, his hair whipped wildly by the relentless wind, as the once-calm horses, now overcome with sheer terror, rear up and buck frantically, eventually turning away and vanishing from sight in a desperate flight. With resolute determination, Aragorn turns toward the ominous doorway and walks determinedly into the enveloping darkness, with Legolas swiftly following suit, shadowing his every step. In the meantime, Gimli finds himself left standing alone, hesitating and grappling with his own deeply rooted fear, before finally mustering the courage he needs and plunging into the tunnel behind his companions. Meanwhile, considerable activity and purposeful hustle envelops the camp as it springs into action; fires are meticulously extinguished with care, tents are methodically taken down with precision, and horses are efficiently saddled in preparation for the journey. Theoden strides purposefully through the bustling camp, with Eomer walking steadfastly at his side, as they ready a small pony by equipping it with a saddle and necessary supplies. He is clad in an oversized helmet and the distinctive clothing of the Rohirrim, and he appears simultaneously nervous and excited, a mixture of emotions evident in his demeanor. King Theoden detaches himself from the column of riders and approaches Merry, only to wheel his horse around, leaving Merry feeling bitterly disappointed and rather forlorn, a mood that envelops him. Merry stands there, his head bowed low, appearing as a small, dejected figure amidst the mighty Rohirrim on their towering horses. All of a sudden, Merry is lifted off the ground by a soldier who snatches him swiftly by the collar. As Merry twists around to look at this mysterious soldier, he discovers, hidden beneath a helmet and mail hood, none other than Eowyn, skillfully disguised as a man. Merry's face, now visible under the cloak, gazes out across the valley floor, which is rapidly filling with countless horsemen riding out with determination after their king. Massive siege towers and catapults rumble ominously across the expansive terrain of the Pelennor Fields, while tens of thousands of fiery torches illuminate the snarling, slavering Morgul Orcs marching in ragged, chaotic torrents past the cave trolls, who are rhythmically beating the ominous drums of war. In the distance, the grand city of Minas Tirith lies ahead, standing as a majestic beacon. Aragorn leads Legolas and Gimli into a vast, expansive cavern, waving his torch vigorously through the enveloping darkness, which slowly, methodically illuminates the immense cavern with its flickering light. A ghastly cracking noise, akin to stone being torn asunder, pierces the silence with an unsettling intensity as a ghostly figure emerges eerily from the solid rock walls. Aragorn, Legolas, and Gimli watch in horror as a mummified spectre looms menacingly before them, its hollow, eyeless sockets staring out—it is the formidable King of the Dead. Swirling, ethereal fog encircles the scene, adding to the already eerie atmosphere as the ghost snarls angrily at Aragorn, who courageously moves forward without hesitation. Suddenly, the thick fog rolls back with a swift, decisive motion, forming a retreating wall of grey vapor, and reveals rank upon rank of spectral warriors with terrifying, ghastly faces. The swirling fog uncovers a vast and daunting army of the dead, numbering in the thousands, assembled ominously around the cavern. Aragorn stares grimly into the eyes of the King of the Dead, holding his gaze unwaveringly as the King of the Dead advances relentlessly toward him. Aragorn, Legolas, and Gimli find themselves now completely surrounded by the ghostly, silent army of the dead."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The ominously muffled thud of their horses' hooves reverberates softly through the dense, damp fir needles that cover the ground as they make their way towards the base of the formidable mountain, where a sheer, imposing wall of rock rises up before them like a natural fortress. Embedded within this towering wall, a doorway stands open, its dark, foreboding entrance resembling an inky mouth opening up to the night, with mysterious signs and arcane figures intricately carved above its wide, arching frame. At that precise moment, a chilling wind suddenly surges out from the depths of the doorway, sending a shiver through the air. As Aragorn stands rooted to the spot, his gaze fixed intently on the impenetrable blackness beyond, his hair begins to whip about his face wildly in the gusting wind. In response to the ominous atmosphere, the horses around them begin to rear up and buck frantically in a panicked attempt to escape, their fear causing them to turn sharply away until, one by one, the three horses bolt and vanish from sight. In the wake of their disappearance, Aragorn turns with unwavering determination towards the ominous doorway and strides purposefully into the encroaching blackness, with Legolas quickly following in his footsteps. Left standing alone, Gimli fights an internal battle with his own fear, hesitating only briefly before mustering the courage to plunge into the tunnel behind his companions. Meanwhile, the entire encampment springs into a hive of activity as preparations are swiftly made for departure: fires are systematically extinguished, tents are efficiently disassembled and packed away, and horses are expertly saddled in readiness for the journey ahead. Amidst this whirlwind of motion, Theoden strides purposefully through the camp with Eomer walking closely beside him, both of them focused on preparing a small pony by fitting it with a saddle and loading it with essential supplies. Dressed in oversized Rohirrim garb and an ill-fitting helmet, he exudes a mix of nervous energy and eager excitement. King Theoden abruptly breaks away from the assembled column of riders, urging his horse forward to meet Merry before decisively wheeling the steed around and riding away, leaving Merry standing in a state of bitter disappointment. With his head bowed, Merry cuts a forlorn and diminutive figure among the formidable Rohirrim warriors mounted on their towering steeds. In an unexpected turn of events, Merry is suddenly hoisted off the ground, grabbed firmly by the collar by an imposing soldier. Twisting around in surprise, Merry looks up to discover that beneath the soldier's helmet and mail hood is Eowyn, cleverly concealed in her disguise as a man. Beneath the cape, Merry's face is set, his eyes taking in the sight of the valley floor becoming alive with motion as thousands of horsemen form up and begin to ride out in pursuit of their king. Across the landscape, massive siege towers and catapults rumble along the Pelennor Fields, silhouetted against the dim light cast by thousands of flaming torches held aloft by the snarling, slavering Morgul Orcs as they march in disorganized torrents, accompanied by cave trolls who rhythmically beat the drums of impending war. Far ahead, the city of Minas Tirith stands as a distant silhouette. Inside a vast cavern, Aragorn leads the way for Legolas and Gimli, brandishing his torch to cut through the suffocating darkness and cast flickering light upon the expansive chamber. Their exploration is abruptly interrupted by a ghastly cracking sound, like the very stone being split apart, which echoes through the silence as a ghostly figure slowly emerges from the seemingly solid rock walls. Aragorn, Legolas, and Gimli find themselves staring in horrified disbelief as the apparition of a mummified spectre materializes before them, its eyeless sockets fixing a stare that seems to penetrate through their very souls—it's the King of the Dead. A spectral fog swirls ominously around them, carrying with it a menacing snarl from the ghost directed at Aragorn, who steps forward resolutely. Almost as if in response, the fog abruptly retreats, rolling back to form a shifting wall of grey vapor, revealing an eerie assembly of rank upon rank of spectral warriors, their ghoulish faces emerging from the mist. The fog fully unveils this chilling sight—a vast, dead army numbering many thousands, standing silently within the cavern. Aragorn locks his gaze grimly with the King of the Dead, maintaining eye contact even as the King of the Dead inexorably advances towards him. Surrounded by an army of the dead, Aragorn, Legolas, and Gimli brace themselves for what is to come."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As they arrive at the mountain's base, the ominous thud of their horses' hooves on the dank fir needles sets the scene, and they are greeted by a sheer rock wall with a dark, gaping doorway adorned with carvings above its arch. A chill wind rushes out, causing the terrified horses to rear and buck before disappearing. Aragorn resolutely enters the doorway, with Legolas following closely, leaving Gimli hesitating briefly before plunging in after them. Elsewhere, the camp bustles with activity as fires are doused, tents dismantled, and horses saddled. Theoden, alongside Eomer, prepares a pony with a saddle and supplies, appearing both nervous and excited in Rohirrim attire. Merry’s anticipation turns to disappointment as Theoden rides away, leaving him among the towering Rohirrim. Suddenly, Eowyn, disguised as a soldier, lifts Merry onto her horse, surprising him as he glimpses her face underneath her helmet. As the valley fills with thousands of horsemen departing with their king, siege towers and catapults advance across the Pelennor Fields, lighting the way for Morgul Orcs and cave trolls beating war drums. Minas Tirith lies ahead. Aragorn leads Legolas and Gimli into a wide cavern, where a torch reveals a massive space, abruptly disturbed by a ghastly cracking sound. A ghostly, mummified figure emerges—the King of the Dead. As they watch in horror, fog swirls, unveiling an army of spectral warriors surrounding them. Aragorn stands grimly, locking eyes with the advancing King of the Dead, now surrounded by thousands of the dead."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The ominously muffled thud of their horses' hooves on the dank fir needles sets the scene as they arrive at the root of the mountain, the Dwimorberg, known in legend as the Haunted Mountain, where a sheer wall of rock towers before them. Within this wall, a creepy dark door gapes like a mouth of night, known as the Door of the Dead, with signs and figures carved above its wide arch that are said to be warnings left by long-gone civilizations. At that moment, a chill wind rushes out of the doorway. Aragorn, the heir to the throne of Gondor with a lineage that traces back to Isildur, stares into the blackness, his hair blowing wildly, as the horses rear and buck in terror, turning until the three horses disappear. Aragorn turns resolutely towards the doorway and walks into the blackness, quickly followed by Legolas, a Woodland Elf known for his keen senses and unmatched archery skills. Gimli, a Dwarf of the proud race inhabiting the Misty Mountains, is left alone, hesitating and struggling with his fear, before he plunges into the tunnel behind the others. Meanwhile, there is much activity as the entire camp is on the move; fires are doused, tents are pulled down, and horses, the prized steeds of Rohan renowned for their speed and endurance, are saddled. Theoden, the King of Rohan and a seasoned warrior, strides through the camp, Eomer at his side, preparing a little pony with a saddle and supplies. He wears an oversized helmet and Rohirrim clothing, appearing both nervous and excited. King Theoden breaks away from a column and rides up to Merry, a Hobbit from the Shire known for their small stature and big hearts, before wheeling his horse away, leaving Merry bitterly disappointed. Merry stands, head down, as a tiny dejected figure among the mighty Rohirrim on their large horses. Suddenly, Merry is plucked off the ground by a soldier who has snatched him by the collar. Merry twists around to see the soldier, and beneath a helmet and mail hood is Eowyn, the niece of Theoden and a shieldmaiden of Rohan, disguised as a man. Merry's face is visible under the cape, looking on as the valley floor fills with thousands of horsemen who ride out after their king. Great siege towers and catapults roll across the Pelennor Fields, a vast expanse outside Minas Tirith known for the epic battles fought there, with thousands of flaming torches lighting the snarling, slathering Morgul Orcs marching in ragged torrents past cave trolls, who beat the drums of war. In the distance, Minas Tirith, the capital of Gondor and a city renowned for its white walls and steep terrains, lies ahead. Aragorn leads Legolas and Gimli into a wide cavern, waving his torch through the darkness and illuminating a huge cavern known as the Paths of the Dead. A ghastly cracking noise, like stone being sundered, cuts through the silence as a ghostly figure steps from the rock walls. Aragorn, Legolas, and Gimli look on in horror as a mummified spectre looms before them, eyeless sockets gazing out—it's the King of the Dead, once a ruler who broke an oath to aid Isildur and was cursed to linger until the oath is fulfilled. Fog swirls around as the ghost snarls at Aragorn, who moves forward as the rightful heir who can release them from the curse. The fog suddenly rolls back, forming a retreating wall of grey vapour, and reveals rank upon rank of spectral warriors with ghoulish faces. The fog unveils a dead army of many thousands assembled around the cavern. Aragorn stares grimly at the King of the Dead, holding his gaze as the King of the Dead moves relentlessly towards him. Aragorn, Legolas, and Gimli are now surrounded by an army of the dead, bound by their ancient oath to serve the true heir of Isildur."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The ominously muffled thud of their horses' hooves on the dank fir needles sets the scene as they arrive at the root of the mountain where a sheer wall of rock towers before them. Within this wall a creepy dark door gapes like a mouth of night with signs and figures carved above its wide arch. At that moment a chill wind rushes out of the doorway. Aragorn stares into the blackness his hair blowing wildly as the horses rear and buck in terror turning until the three horses disappear. Aragorn turns resolutely towards the doorway and walks into the blackness quickly followed by Legolas. Gimli is left alone hesitating and struggling with his fear before he plunges into the tunnel behind the others. Meanwhile there is much activity as the entire camp is on the move. fires are doused tents are pulled down and horses are saddled. Theoden strides through the camp Eomer at his side preparing a little pony with a saddle and supplies. He wears an oversized helmet and Rohirrim clothing appearing both nervous and excited. King Theoden breaks away from a column and rides up to Merry before wheeling his horse away leaving Merry bitterly disappointed. Merry stands head down as a tiny dejected figure among the mighty Rohirrim on their large horses. Suddenly Merry is plucked off the ground by a soldier who has snatched him by the collar. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Merry twists around to see the soldier and beneath a helmet and mail hood is Eowyn disguised as a man. Merry's face is visible under the cape looking on as the valley floor fills with thousands of horsemen who ride out after their king. Great siege towers and catapults roll across the Pelennor Fields with thousands of flaming torches lighting the snarling slathering Morgul Orcs marching in ragged torrents past cave trolls who beat the drums of war. In the distance Minas Tirith lies ahead. Aragorn leads Legolas and Gimli into a wide cavern waving his torch through the darkness and illuminating a huge cavern. A ghastly cracking noise like stone being sundered cuts through the silence as a ghostly figure steps from the rock walls. Aragorn Legolas and Gimli look on in horror as a mummified spectre looms before them. eyeless sockets gazing out—it is the King of the Dead. Fog swirls around as the ghost snarls at Aragorn who moves forward. The fog suddenly rolls back forming a retreating wall of grey vapour and reveals rank upon rank of spectral warriors with ghoulish faces. The fog unveils a dead army of many thousands assembled around the cavern. Aragorn stares grimly at the King of the Dead holding his gaze as the King of the Dead moves relentlessly towards him. Aragorn Legolas and Gimli are now surrounded by an army of the dead."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The ominously muffled thud of their horses' hooves on the dank fir needles sets the scene as they arrive at the root of the mountain where a sheer wall of rock towers before them. Within this wall a creepy dark door gapes like a mouth of night with signs and figures carved above its wide arch. At that moment a chill wind rushes out of the doorway. Aragorn stares into the blackness his hair blowing wildly as the horses rear and buck in terror turning until the three horses disappear. Aragorn turns resolutely towards the doorway and walks into the blackness quickly followed by Legolas. Gimli is left alone hesitating and struggling with his fear before he plunges into the tunnel behind the others. Meanwhile there is much activity as the entire camp is on the move. fires are doused tents are pulled down and horses are saddled. Theoden strides through the camp Eomer at his side preparing a little pony with a saddle and supplies. He wears an oversized helmet and Rohirrim clothing appearing both nervous and excited. King Theoden breaks away from a column and rides up to Merry before wheeling his horse away leaving Merry bitterly disappointed. Merry stands head down as a tiny dejected figure among the mighty Rohirrim on their large horses. Suddenly Merry is plucked off the ground by a soldier who has snatched him by the collar. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Merry twists around to see the soldier and beneath a helmet and mail hood is Eowyn disguised as a man. Merry's face is visible under the cape looking on as the valley floor fills with thousands of horsemen who ride out after their king. Great siege towers and catapults roll across the Pelennor Fields with thousands of flaming torches lighting the snarling slathering Morgul Orcs marching in ragged torrents past cave trolls who beat the drums of war. In the distance Minas Tirith lies ahead. Aragorn leads Legolas and Gimli into a wide cavern waving his torch through the darkness and illuminating a huge cavern. A ghastly cracking noise like stone being sundered cuts through the silence as a ghostly figure steps from the rock walls. Aragorn Legolas and Gimli look on in horror as a mummified spectre looms before them. eyeless sockets gazing out—it is the King of the Dead. Fog swirls around as the ghost snarls at Aragorn who moves forward. The fog suddenly rolls back forming a retreating wall of grey vapour and reveals rank upon rank of spectral warriors with ghoulish faces. The fog unveils a dead army of many thousands assembled around the cavern. Aragorn stares grimly at the King of the Dead holding his gaze as the King of the Dead moves relentlessly towards him. Aragorn Legolas and Gimli are now surrounded by an army of the dead."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The ominously muffled thud of their horses' hooves on the dank fir needles sets the scene as they arrive at the root of the mountain where a sheer wall of rock towers before them. Within this wall a creepy dark door gapes like a mouth of night with signs and figures carved above its wide arch. At that moment a chill wind rushes out of the doorway. Aragorn stares into the blackness his hair blowing wildly as the horses rear and buck in terror turning until the three horses disappear. Aragorn turns resolutely towards the doorway and walks into the blackness quickly followed by Legolas. Gimli is left alone hesitating and struggling with his fear before he plunges into the tunnel behind the others. Meanwhile there is much activity as the entire camp is on the move. eyeless sockets gazing out—it is the King of the Dead. Fog swirls around as the ghost snarls at Aragorn who moves forward. The fog suddenly rolls back forming a retreating wall of grey vapour and reveals rank upon rank of spectral warriors with ghoulish faces. The fog unveils a dead army of many thousands assembled around the cavern. Aragorn stares grimly at the King of the Dead holding his gaze as the King of the Dead moves relentlessly towards him. Aragorn Legolas and Gimli are now surrounded by an army of the dead."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The ominously muffled thud of their horses' hooves on the dank fir needles sets the scene as they arrive at the root of the mountain where a sheer wall of rock towers before them. Within this wall a creepy dark door gapes like a mouth of night with signs and figures carved above its wide arch. At that moment a chill wind rushes out of the doorway. The fog unveils a dead army of many thousands assembled around the cavern. Aragorn stares grimly at the King of the Dead holding his gaze as the King of the Dead moves relentlessly towards him. Aragorn Legolas and Gimli are now surrounded by an army of the dead."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The strangely whispered chirp of their camels' paws on the dry pine cones paints the picture as they arrive at the tip of the canyon, where a steep hill of sand looms before them. Within this hill, a bright blue window yawns like a mouth of day, with numbers and letters etched above its tall frame. At that moment, a warm breeze hurries out of the window. Balthazar peers into the lightness, his hat fluttering gently, as the camels bolt and dash in joy, spinning until the five camels materialize. Balthazar spins eagerly toward the window and hops through the lightness, steadily shadowed by Lancelot. Horace is left behind, pausing and wrestling with his courage, before he dives into the passage behind the companions. Meanwhile, there is little commotion as the small group stays put; candles are lit, seats are set up, and camels are unsaddled. Gertrude wanders around the group, Beatrice by her side, adjusting a giant donkey with a blanket and decorations. She wears a tiny bonnet and Roman attire, appearing both weary and calm. Queen Gertrude breaks apart from a crowd and strides down to Barry before swinging her donkey away, leaving Barry joyfully content. Barry sits, head up, as a massive cheerful being among the miniature Romans on their tiny camels. Suddenly, Barry is dropped onto the water by a sailor who has released him by the sleeve. Barry spins around to see the sailor, and beneath a bonnet and wool scarf is Marie, disguised as a woman. Barry's smile is hidden under the scarf, relaxing as the mountain peak empties with dozens of camels who walk in before their queen. Small speed boats and rafts float across the Silted Marshes, with dozens of dim lanterns darkening the growling, drooling Goblin Elves marching in orderly streams past river ducks, who bang the cymbals of peace. In the distance, Atlantis sprawls behind. Balthazar guides Lancelot and Horace into a narrow tunnel, waving his lantern through the lightness and shading a tiny chamber. A joyful clapping sound, like water being splashed, echoes through the noise as a lively figure dances from the mud walls. Balthazar, Lancelot, and Horace smile in delight as a lively spirit skips before them, bright eyes gazing out—it's the Jester of the Living. Mist settles around as the spirit giggles at Balthazar, who shifts backward. The mist suddenly floats forward, shaping a forming row of white vapor, and hides line after line of lively performers with cheerful faces. The mist conceals a live assembly of a few dozens scattered around the chamber. Balthazar smiles joyfully at the Jester of the Living, breaking his stare as the Jester of the Living floats gently away from him. Balthazar, Lancelot, and Horace are now shielded by a gathering of the living."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Aragorn, Legolas, and Gimli arrive at a mountain's base, facing a dark doorway in a towering rock wall. A chill wind emanates from the entrance, causing their horses to flee in terror. Resolutely, Aragorn enters the dark passage, followed by Legolas, leaving Gimli to wrestle with fear before joining them. As the camp prepares for battle, Theoden and Eomer ready their forces, while Merry is left disappointed when Theoden leaves without him. However, Eowyn, disguised as a soldier, secretly takes Merry along. Meanwhile, siege towers and catapults advance on Pelennor Fields, led by Orcs and cave trolls. Aragorn's group enters a cavern where a ghostly figure, the King of the Dead, emerges. As fog recedes, it reveals countless spectral warriors. Resolute, Aragorn confronts the King of the Dead, surrounded by this eerie army."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Aragorn Legolas and Gimli are now surrounded by an army of the dead Aragorn stares grimly at the King of the Dead holding his gaze as the King of the Dead moves relentlessly towards him The fog unveils a dead army of many thousands assembled around the cavern The fog suddenly rolls back forming a retreating wall of grey vapour and reveals rank upon rank of spectral warriors with ghoulish faces Fog swirls around as the ghost snarls at Aragorn who moves forward eyeless sockets gazing out—it is the King of the Dead Aragorn Legolas and Gimli look on in horror as a mummified spectre looms before them A ghastly cracking noise like stone being sundered cuts through the silence as a ghostly figure steps from the rock walls Aragorn leads Legolas and Gimli into a wide cavern waving his torch through the darkness and illuminating a huge cavern In the distance Minas Tirith lies ahead Great siege towers and catapults roll across the Pelennor Fields with thousands of flaming torches lighting the snarling slathering Morgul Orcs marching in ragged torrents past cave trolls who beat the drums of war Merry's face is visible under the cape looking on as the valley floor fills with thousands of horsemen who ride out after their king Merry twists around to see the soldier and beneath a helmet and mail hood is Eowyn disguised as a man Suddenly Merry is plucked off the ground by a soldier who has snatched him by the collar Merry stands head down as a tiny dejected figure among the mighty Rohirrim on their large horses King Theoden breaks away from a column and rides up to Merry before wheeling his horse away leaving Merry bitterly disappointed He wears an oversized helmet and Rohirrim clothing appearing both nervous and excited Theoden strides through the camp Eomer at his side preparing a little pony with a saddle and supplies fires are doused tents are pulled down and horses are saddled Meanwhile there is much activity as the entire camp is on the move Gimli is left alone hesitating and struggling with his fear before he plunges into the tunnel behind the others Aragorn turns resolutely towards the doorway and walks into the blackness quickly followed by Legolas Aragorn stares into the blackness his hair blowing wildly as the horses rear and buck in terror turning until the three horses disappear At that moment a chill wind rushes out of the doorway Within this wall a creepy dark door gapes like a mouth of night with signs and figures carved above its wide arch The ominously muffled thud of their horses' hooves on the dank fir needles sets the scene as they arrive at the root of the mountain where a sheer wall of rock towers before them"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Within this wall a creepy dark door gapes like a mouth of night with signs and figures carved above its wide arch The ominously muffled thud of their horses' hooves on the dank fir needles sets the scene as they arrive at the root of the mountain where a sheer wall of rock towers before them Aragorn stares into the blackness his hair blowing wildly as the horses rear and buck in terror turning until the three horses disappear At that moment a chill wind rushes out of the doorway Gimli is left alone hesitating and struggling with his fear before he plunges into the tunnel behind the others Aragorn turns resolutely towards the doorway and walks into the blackness quickly followed by Legolas fires are doused tents are pulled down and horses are saddled Meanwhile there is much activity as the entire camp is on the move He wears an oversized helmet and Rohirrim clothing appearing both nervous and excited Theoden strides through the camp Eomer at his side preparing a little pony with a saddle and supplies Merry stands head down as a tiny dejected figure among the mighty Rohirrim on their large horses King Theoden breaks away from a column and rides up to Merry before wheeling his horse away leaving Merry bitterly disappointed Merry twists around to see the soldier and beneath a helmet and mail hood is Eowyn disguised as a man Suddenly Merry is plucked off the ground by a soldier who has snatched him by the collar Great siege towers and catapults roll across the Pelennor Fields with thousands of flaming torches lighting the snarling slathering Morgul Orcs marching in ragged torrents past cave trolls who beat the drums of war Merry's face is visible under the cape looking on as the valley floor fills with thousands of horsemen who ride out after their king Aragorn leads Legolas and Gimli into a wide cavern waving his torch through the darkness and illuminating a huge cavern In the distance Minas Tirith lies ahead Aragorn Legolas and Gimli look on in horror as a mummified spectre looms before them A ghastly cracking noise like stone being sundered cuts through the silence as a ghostly figure steps from the rock walls Fog swirls around as the ghost snarls at Aragorn who moves forward eyeless sockets gazing out—it is the King of the Dead The fog unveils a dead army of many thousands assembled around the cavern The fog suddenly rolls back forming a retreating wall of grey vapour and reveals rank upon rank of spectral warriors with ghoulish faces Aragorn Legolas and Gimli are now surrounded by an army of the dead Aragorn stares grimly at the King of the Dead holding his gaze as the King of the Dead moves relentlessly towards him"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Merry twists around to see the soldier and beneath a helmet and mail hood is Eowyn disguised as a man Merry's face is visible under the cape looking on as the valley floor fills with thousands of horsemen who ride out after their king Great siege towers and catapults roll across the Pelennor Fields with thousands of flaming torches lighting the snarling slathering Morgul Orcs marching in ragged torrents past cave trolls who beat the drums of war In the distance Minas Tirith lies ahead Aragorn leads Legolas and Gimli into a wide cavern waving his torch through the darkness and illuminating a huge cavern A ghastly cracking noise like stone being sundered cuts through the silence as a ghostly figure steps from the rock walls Aragorn Legolas and Gimli look on in horror as a mummified spectre looms before them eyeless sockets gazing out—it is the King of the Dead Fog swirls around as the ghost snarls at Aragorn who moves forward The fog suddenly rolls back forming a retreating wall of grey vapour and reveals rank upon rank of spectral warriors with ghoulish faces The fog unveils a dead army of many thousands assembled around the cavern Aragorn stares grimly at the King of the Dead holding his gaze as the King of the Dead moves relentlessly towards him Aragorn Legolas and Gimli are now surrounded by an army of the dead The ominously muffled thud of their horses' hooves on the dank fir needles sets the scene as they arrive at the root of the mountain where a sheer wall of rock towers before them Within this wall a creepy dark door gapes like a mouth of night with signs and figures carved above its wide arch At that moment a chill wind rushes out of the doorway Aragorn stares into the blackness his hair blowing wildly as the horses rear and buck in terror turning until the three horses disappear Aragorn turns resolutely towards the doorway and walks into the blackness quickly followed by Legolas Gimli is left alone hesitating and struggling with his fear before he plunges into the tunnel behind the others Meanwhile there is much activity as the entire camp is on the move fires are doused tents are pulled down and horses are saddled Theoden strides through the camp Eomer at his side preparing a little pony with a saddle and supplies He wears an oversized helmet and Rohirrim clothing appearing both nervous and excited King Theoden breaks away from a column and rides up to Merry before wheeling his horse away leaving Merry bitterly disappointed Merry stands head down as a tiny dejected figure among the mighty Rohirrim on their large horses Suddenly Merry is plucked off the ground by a soldier who has snatched him by the collar"
        }
      ]
    }
  ]
}