{
  "ground_truth": "GOLLUM is cowering back, coughing and spluttering. FRODO looks at SMEAGOL in shock and gets to his feet, while SMEAGOL stares at FRODO in disbelief. In a fury, SMEAGOL lunges at FRODO, who falls backwards, dangerously close to the edge of the precipice, as GOLLUM tumbles over FRODO's body and falls to the bottom of the ravine. FRODO, overcome with exhaustion, stumbles down the steep stairs of CIRITH UNGOL, full of remorse at his treatment of SAM, and falls to his knees. FRODO lands on soft green grass and sees sun-drenched images of trees. In a hazy image, GALADRIEL walks towards him, barefoot, and leans down, offering her hand. For a beat, FRODO stares at her, torn, not wanting to go on and wanting to lie down, but he knows what he must do. FRODO is lifted to his feet, once again in the dark, rank tunnels of the pass of CIRITH UNGOL, and he goes on. Flaming missiles rain down on the city as GROND thuds against the MINAS TIRITH gate, sending a vibration through the city. GANDALF, on SHADOWFAX, leads several hundred Gondorian foot soldiers down through the streets. PIPPIN watches as FARAMIR's unconscious body is carried on a stretcher by DENETHOR's servants, led by DENETHOR. It has the atmosphere of a funeral as an iron door creaks open and FARAMIR's procession enters a wide vaulted chamber where lantern light throws great shadows upon the shrouded walls. Row upon row of marble tombs are visible in the dim light, with each tomb having a sleeping form carved in stone, hands folded. DENETHOR turns to his servants. The gate splinters with a boom under GROND's mighty weight. Behind the gates, the Gondorian foot soldiers are fearful. GANDALF rallies the line of bowmen as they wait in front of the great doors, their courage wavering with each crashing. Suddenly, the fearsome head protrudes into MINAS TIRITH. Within moments, the gate is smashed, and giant cave trolls enter into the first circle of MINAS TIRITH under the archway that no enemy had ever passed. Rows of archers fire off a volley of arrows, but the trolls continue to smash the foot soldiers with their giant clubs. Orcs swarm through the opening, and the pitched, hand-to-hand battle spills into flames and blackened, smouldering buildings. With a roar, GANDALF leads a counterattack on SHADOWFAX, followed by several hundred Gondorian foot soldiers, as thousands of orcs swarm in through the city gates, and the first level is breached. FRODO staggers through the pass of CIRITH UNGOL, the weight of the ring dragging at his neck. He moves forward, fueled by a grim resolve, and starts climbing a stone staircase that climbs through a narrow pass.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "GOLLUM is recoiling back, hacking and sputtering. FRODO gazes at SMEAGOL in astonishment and rises to his feet, while SMEAGOL gapes at FRODO in incredulity. In a rage, SMEAGOL pounces at FRODO, who topples backward, perilously near to the brink of the chasm, as GOLLUM plummets over FRODO's physique and descends to the base of the gorge. FRODO, overwhelmed with fatigue, totters down the sheer steps of CIRITH UNGOL, full of regret at his handling of SAM, and collapses to his knees. FRODO lands on soft verdant turf and observes sunlit visions of woods. In a blurry vision, GALADRIEL strides towards him, barefoot, and leans down, extending her hand. For a moment, FRODO gazes at her, conflicted, not wishing to proceed and wanting to recline, but he knows what he must do. FRODO is raised to his feet, once more in the dim, rank passageways of the pass of CIRITH UNGOL, and he proceeds. Blazing projectiles pour down on the metropolis as GROND crashes against the MINAS TIRITH gate, sending a tremor through the city. GANDALF, on SHADOWFAX, commands several hundred Gondorian infantry through the streets. PIPPIN observes as FARAMIR's insensate form is borne on a litter by DENETHOR's attendants, led by DENETHOR. It has the feel of a funeral as an iron door squeals open and FARAMIR's cortege enters a broad arched hall where lamp light casts large silhouettes upon the veiled walls. Rank after rank of marble crypts are discernible in the faint light, with each tomb having a reposed figure sculpted in stone, hands clasped. DENETHOR addresses his attendants. The gate shatters with a boom under GROND's colossal heft. Behind the gates, the Gondorian infantry are apprehensive. GANDALF rallies the line of archers as they await in front of the grand doors, their bravery faltering with each crash. Abruptly, the fearsome head juts into MINAS TIRITH. Within seconds, the gate is broken, and immense cave trolls enter into the first circle of MINAS TIRITH under the archway that no adversary had ever traversed. Rows of marksmen discharge a volley of arrows, but the trolls persist in battering the foot soldiers with their colossal clubs. Orcs flood through the aperture, and the intense, close-quarters fight spills into infernos and charred, smoking structures. With a bellow, GANDALF leads a counteroffensive on SHADOWFAX, followed by several hundred Gondorian infantry, as thousands of orcs flood in through the city gates, and the first tier is breached. FRODO lurches through the pass of CIRITH UNGOL, the burden of the ring pulling at his neck. He advances, driven by a bleak determination, and starts ascending a stone stairway that climbs through a narrow defile."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "GOLLUM is cowering back, coughing and spluttering. SMEAGOL is looked at in shock by FRODO, who then gets to his feet, while FRODO is stared at in disbelief by SMEAGOL. In a fury, FRODO is lunged at by SMEAGOL, causing him to fall backwards, dangerously close to the edge of the precipice, as FRODO's body is tumbled over by GOLLUM, who falls to the bottom of the ravine. Overcome with exhaustion, the steep stairs of CIRITH UNGOL are stumbled down by FRODO, full of remorse at his treatment of SAM, and he falls to his knees. Soft green grass is landed on by FRODO, and sun-drenched images of trees are seen by him. In a hazy image, GALADRIEL walks towards him, barefoot, and her hand is offered as she leans down. For a beat, she is stared at by FRODO, torn, not wanting to go on and wanting to lie down, but he knows what must be done by him. FRODO is lifted to his feet, once again in the dark, rank tunnels of the pass of CIRITH UNGOL, and he continues on his way. The city is pelted with flaming missiles as the MINAS TIRITH gate is thudded against by GROND, sending a vibration through the city. Several hundred Gondorian foot soldiers are led down through the streets by GANDALF, on SHADOWFAX. PIPPIN watches as DENETHOR's servants carry FARAMIR's unconscious body on a stretcher, led by DENETHOR. It has the atmosphere of a funeral as an iron door creaks open and FARAMIR's procession enters a wide vaulted chamber where lantern light throws great shadows upon the shrouded walls. The dim light reveals row upon row of marble tombs, each tomb having a sleeping form carved in stone, hands folded. His servants are turned to by DENETHOR. With a boom, the gate is splintered under GROND's mighty weight. Behind the gates, fear grips the Gondorian foot soldiers. The line of bowmen is rallied by GANDALF as they wait in front of the great doors, their courage wavering with each crashing. Suddenly, a fearsome head protrudes into MINAS TIRITH. Within moments, the gate is smashed, and giant cave trolls enter into the first circle of MINAS TIRITH under the archway that no enemy had ever passed. A volley of arrows is fired by rows of archers, but the foot soldiers are smashed by the trolls with their giant clubs. The opening is swarmed through by orcs, and the pitched, hand-to-hand battle spills into flames and blackened, smouldering buildings. With a roar, a counterattack is led by GANDALF on SHADOWFAX, followed by several hundred Gondorian foot soldiers, as thousands of orcs swarm in through the city gates, and the first level is breached. FRODO staggers through the pass of CIRITH UNGOL, the weight of the ring dragging at his neck. Forward movement is made by him, fueled by a grim resolve, and a stone staircase is started to be climbed by him through a narrow pass."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "GOLLUM cowers, coughing and spluttering. FRODO, shocked, stands as SMEAGOL stares in disbelief. In a rage, SMEAGOL lunges at FRODO, who falls near the precipice edge, while GOLLUM tumbles over him into the ravine. Exhausted, FRODO stumbles down CIRITH UNGOL's steep stairs, remorseful about SAM, and falls to his knees on soft grass, seeing sunlit trees. GALADRIEL appears, offering her hand. FRODO hesitates, torn but determined, and rises in the dark tunnels of CIRITH UNGOL, continuing on. Flaming missiles hit the city as GROND strikes MINAS TIRITH's gate, vibrating the city. GANDALF, on SHADOWFAX, leads Gondorian soldiers through the streets. PIPPIN watches FARAMIR's unconscious body carried by DENETHOR's servants into a vaulted chamber with marble tombs. The gate splinters under GROND's weight. Gondorian soldiers, fearful, are rallied by GANDALF. The gate is smashed, and cave trolls enter MINAS TIRITH, with archers firing arrows. Trolls smash soldiers, and orcs swarm in, battling amid flames. GANDALF leads a counterattack on SHADOWFAX, with soldiers following as orcs breach the first level. FRODO staggers through CIRITH UNGOL, the ring's weight heavy, climbing a stone staircase through a narrow pass."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "GOLLUM cowers, coughing. FRODO, shocked, stands as SMEAGOL, furious, lunges at him. FRODO falls near the precipice, and GOLLUM tumbles into the ravine. Exhausted, FRODO stumbles down CIRITH UNGOL's stairs, remorseful about SAM, and collapses on soft grass, seeing sunlit trees. GALADRIEL approaches, offering her hand. Torn, FRODO knows he must continue. He rises in CIRITH UNGOL's dark tunnels and proceeds. Flaming missiles hit the city as GROND strikes MINAS TIRITH's gate. GANDALF leads Gondorian soldiers through the streets. PIPPIN watches FARAMIR's unconscious body carried by DENETHOR's servants into a vaulted chamber with marble tombs. The gate splinters under GROND's weight. GANDALF rallies bowmen as the gate is smashed, and cave trolls enter MINAS TIRITH. Archers fire, but trolls attack with clubs. Orcs swarm, and battle ensues in flames. GANDALF leads a counterattack on SHADOWFAX as orcs breach the first level. FRODO, burdened by the ring, climbs CIRITH UNGOL's stone staircase with grim resolve."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "GOLLUM is cowering back, coughing and spluttering with a sense of desperation. FRODO looks at SMEAGOL in utter shock and disbelief as he gets to his feet, while SMEAGOL stares back at FRODO, equally incredulous. In a sudden fury, SMEAGOL lunges aggressively at FRODO, who falls backwards, perilously close to the edge of the steep precipice. As this happens, GOLLUM tumbles over FRODO's body and plummets to the bottom of the deep ravine. FRODO, overcome with sheer exhaustion, stumbles down the steep, treacherous stairs of CIRITH UNGOL, filled with remorse and regret at his treatment of SAM, and collapses to his knees. FRODO lands on the soft, green grass and sees sun-drenched images of trees around him. In a hazy, dreamlike vision, GALADRIEL walks gracefully towards him, barefoot, and leans down, offering her hand in a gesture of support. For a brief moment, FRODO stares at her, torn between the desire to give up and lie down and the knowledge of what he must do. FRODO is lifted to his feet, once again finding himself in the dark, rank tunnels of the pass of CIRITH UNGOL, and he continues on his journey. Flaming missiles rain down mercilessly on the city as GROND thuds powerfully against the MINAS TIRITH gate, sending a deep vibration through the entire city. GANDALF, riding on SHADOWFAX, leads several hundred determined Gondorian foot soldiers down through the winding streets. PIPPIN watches anxiously as FARAMIR's unconscious body is carried on a stretcher by DENETHOR's servants, led solemnly by DENETHOR himself. It has the somber atmosphere of a funeral procession as an iron door creaks open, and FARAMIR's procession enters a wide, vaulted chamber where lantern light casts great shadows upon the shrouded walls. Row upon row of marble tombs are visible in the dim light, each tomb having a sleeping form carved in stone, hands folded in eternal rest. DENETHOR turns to his servants with a grave expression. The gate splinters with a resounding boom under GROND's mighty weight. Behind the gates, the Gondorian foot soldiers are filled with fear. GANDALF rallies the line of bowmen as they wait tensely in front of the great doors, their courage wavering with each crashing blow. Suddenly, the fearsome head of GROND protrudes into MINAS TIRITH. Within moments, the gate is smashed, and giant cave trolls enter into the first circle of MINAS TIRITH under the archway that no enemy had ever passed before. Rows of archers fire off a volley of arrows, but the trolls continue to smash the foot soldiers with their giant clubs. Orcs swarm through the opening, and the pitched, hand-to-hand battle spills into flames and blackened, smouldering buildings. With a mighty roar, GANDALF leads a counterattack on SHADOWFAX, followed by several hundred brave Gondorian foot soldiers, as thousands of orcs swarm in through the city gates, and the first level is breached. FRODO staggers through the pass of CIRITH UNGOL, the oppressive weight of the ring dragging heavily at his neck. He moves forward, fueled by a grim and determined resolve, and begins climbing a stone staircase that ascends through a narrow, winding pass."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "GOLLUM, in a state of utter terror and desperation, is cowering backward, his breath coming in ragged gasps as he coughs and splutters uncontrollably. FRODO, in complete shock and disbelief, looks at SMEAGOL as he scrambles to his feet, while SMEAGOL stares back at FRODO, his eyes equally filled with incredulity. In a sudden surge of fury, SMEAGOL lunges with aggressive ferocity at FRODO. FRODO stumbles backward, perilously teetering on the precarious edge of the steep precipice. In the chaotic struggle, GOLLUM tumbles over FRODO's body, plummeting down to the bottom of the deep ravine. Overcome with sheer exhaustion, FRODO stumbles down the steep, treacherous stairs of CIRITH UNGOL. As he descends, he is filled with a profound sense of remorse and regret over his treatment of SAM, and he collapses onto his knees. FRODO lands on the soft, green grass, surrounded by sun-drenched images of trees. In a hazy, dreamlike vision, GALADRIEL appears, walking gracefully towards him. She is barefoot and leans down, offering her hand in a gesture of support. For a brief, poignant moment, FRODO stares at her, torn between the deep desire to surrender and lie down and the knowledge of the task he must complete. He is lifted to his feet, finding himself once again in the dark, rank tunnels of the pass of CIRITH UNGOL, continuing on his arduous journey. Flaming missiles rain down with merciless intensity on the city as GROND thuds powerfully against the MINAS TIRITH gate, sending a deep, resonant vibration that echoes through the entire city. GANDALF, astride his trusty steed SHADOWFAX, leads several hundred determined Gondorian foot soldiers through the winding streets. PIPPIN watches with growing anxiety as FARAMIR's unconscious body is carefully carried on a stretcher by DENETHOR's servants, led solemnly by DENETHOR himself. It is a scene filled with the somber atmosphere of a funeral procession as an iron door creaks open, and FARAMIR's procession solemnly enters a wide, vaulted chamber. The lantern light inside casts great shadows upon the shrouded walls. Row upon row of marble tombs come into view in the dim light, each tomb bearing a sleeping form carved in stone, with hands folded in eternal rest. DENETHOR turns to his servants, his expression grave and somber. The gate, under the tremendous weight of GROND, splinters with a resounding boom. Behind the gates, the Gondorian foot soldiers are filled with a palpable sense of fear. GANDALF rallies the tense line of bowmen, who stand anxiously in front of the great doors, their courage wavering with each thunderous crash. Suddenly, the menacing head of GROND protrudes into MINAS TIRITH. Within mere moments, the gate is smashed, and giant cave trolls forcefully enter into the first circle of MINAS TIRITH, under the archway that no enemy had ever breached before. Rows of archers release a volley of arrows, yet the trolls continue to smash the foot soldiers mercilessly with their giant clubs. Orcs swarm through the gaping opening, and the intense, hand-to-hand battle spills into flames and blackened, smouldering buildings. With a mighty, commanding roar, GANDALF leads a bold counterattack on SHADOWFAX, followed by several hundred brave Gondorian foot soldiers. Thousands of orcs swarm through the city gates, and the first level falls under their onslaught. Meanwhile, FRODO staggers through the pass of CIRITH UNGOL, the oppressive weight of the ring dragging heavily at his neck. He moves forward, fueled by a grim and determined resolve, and begins the arduous climb up a stone staircase that ascends through a narrow, winding pass."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "GOLLUM is cowering back, his body trembling as he coughs and splutters, struggling to catch his breath. FRODO, witnessing this unexpected scene, looks at SMEAGOL with wide eyes, filled with shock, and slowly pushes himself up to his feet. Meanwhile, SMEAGOL, his eyes locked onto FRODO, stares back in disbelief, his mind racing with emotions. Suddenly, in a fit of fury, SMEAGOL propels himself forward, lunging at FRODO with all his might. FRODO, caught off guard, loses his balance and falls backwards, his body teetering dangerously close to the edge of the precipice. As this unfolds, GOLLUM, unable to stop his momentum, tumbles over FRODO's prone body and plummets down to the bottom of the ravine. FRODO, now alone and overcome with exhaustion, begins to stumble down the steep, winding stairs of CIRITH UNGOL. His mind is heavy with remorse over his treatment of SAM, and his legs give way, causing him to fall to his knees. As he lands, he feels the softness of green grass beneath him and is momentarily transported to a vision of sun-drenched images of trees. In this hazy vision, GALADRIEL appears, walking towards him with a serene grace, her bare feet barely making a sound. She leans down, extending her hand towards him. For a moment, FRODO stares at her, his heart torn between the desire to give up and lie down and the knowledge of what he must do. Resolute, he takes her hand and is lifted to his feet, finding himself once again in the dark, rank tunnels of the pass of CIRITH UNGOL, where he continues his journey. Meanwhile, in the city, flaming missiles rain down, casting a fiery glow as GROND, the massive battering ram, thuds against the MINAS TIRITH gate, sending a deep vibration through the city. GANDALF, mounted on SHADOWFAX, leads several hundred Gondorian foot soldiers through the streets, their faces set with determination. PIPPIN stands by, watching as FARAMIR's unconscious body is carried on a stretcher by DENETHOR's servants, with DENETHOR himself leading the somber procession. The atmosphere is heavy, akin to a funeral, as an iron door creaks open, allowing FARAMIR's procession to enter a wide, vaulted chamber. Lantern light flickers, casting great shadows upon the shrouded walls, revealing row upon row of marble tombs, each with a sleeping form carved in stone, hands folded in eternal rest. DENETHOR turns to his servants, his face a mask of grim resolve. Outside, the gate splinters with a resounding boom under GROND's mighty weight, and behind the gates, the Gondorian foot soldiers stand, their faces etched with fear. GANDALF, sensing their wavering courage, rallies the line of bowmen as they stand ready in front of the great doors, each crash of GROND testing their resolve. Suddenly, the fearsome head of GROND protrudes into MINAS TIRITH, and within moments, the gate is smashed open. Giant cave trolls, their massive forms casting long shadows, enter into the first circle of MINAS TIRITH under the archway that no enemy had ever breached before. Rows of archers release a volley of arrows, but the trolls, undeterred, continue to smash the foot soldiers with their giant clubs. Orcs swarm through the opening, and the battle quickly devolves into a chaotic, hand-to-hand struggle amidst flames and blackened, smouldering buildings. With a mighty roar, GANDALF leads a counterattack on SHADOWFAX, charging forward with several hundred Gondorian foot soldiers at his back, as thousands of orcs pour in through the city gates, breaching the first level. Meanwhile, FRODO, his body weary and the weight of the ring a constant burden around his neck, staggers through the pass of CIRITH UNGOL. Each step is fueled by a grim resolve as he moves forward, his eyes fixed on the path ahead. He begins to climb a stone staircase, each step echoing in the narrow pass, as he continues his arduous journey."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "GOLLUM cowers back, coughing, as FRODO, shocked, rises to his feet. In disbelief, SMEAGOL lunges at FRODO, causing him to fall dangerously close to the precipice, while GOLLUM tumbles over him into the ravine. Exhausted and remorseful over his treatment of SAM, FRODO stumbles down the steep stairs of CIRITH UNGOL and collapses on soft grass, seeing sunlit trees. In a vision, GALADRIEL approaches, offering her hand. Though torn, FRODO knows he must continue. He is lifted to his feet and resumes his journey through the dark tunnels of CIRITH UNGOL. Meanwhile, flaming missiles bombard MINAS TIRITH as GROND strikes the gate, shaking the city. GANDALF, on SHADOWFAX, leads Gondorian soldiers through the streets. PIPPIN watches FARAMIR's unconscious body carried by DENETHOR's servants into a vaulted chamber, resembling a funeral procession. The chamber is lined with marble tombs, each with a carved figure. As the gate splinters under GROND's weight, GANDALF rallies the bowmen, their courage faltering. The gate is breached, and cave trolls enter MINAS TIRITH, followed by orcs, igniting a fierce battle. GANDALF leads a counterattack on SHADOWFAX with Gondorian soldiers as orcs swarm the city, breaching the first level. FRODO, burdened by the ring, staggers through CIRITH UNGOL, driven by resolve, and begins climbing a stone staircase through a narrow pass."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Gollum is cowering back, coughing and spluttering, a pitiful figure who once was a hobbit-like creature named Sméagol before the One Ring corrupted him. Frodo, a hobbit on a perilous quest to destroy the Ring in the fires of Mount Doom, looks at Sméagol in shock and gets to his feet, while Sméagol, torn between his dual personalities, stares at Frodo in disbelief. In a fury, Sméagol lunges at Frodo, who falls backwards, dangerously close to the edge of the precipice, as Gollum tumbles over Frodo's body and falls to the bottom of the ravine in the treacherous landscape of Mordor. Frodo, overcome with exhaustion from the journey that began in the peaceful Shire, stumbles down the steep stairs of Cirith Ungol, a pass guarded by the deadly giant spider Shelob, full of remorse at his treatment of Sam, his loyal companion and friend. Frodo falls to his knees and lands on soft green grass, seeing sun-drenched images of trees, a stark contrast to the barren lands he has traversed. In a hazy image, Galadriel, the Elven Lady of Lothlórien renowned for her wisdom and beauty, walks towards him, barefoot, and leans down, offering her hand. For a beat, Frodo stares at her, torn, not wanting to go on and wanting to lie down, but he knows what he must do, spurred by the duty to save Middle-earth. Frodo is lifted to his feet, once again in the dark, rank tunnels of the pass of Cirith Ungol, and he goes on. Flaming missiles rain down on the city of Minas Tirith, the capital of Gondor, as Grond, the massive battering ram named after Morgoth's hammer, thuds against the Minas Tirith gate, sending a vibration through the city. Gandalf, the wise and powerful wizard also known as Mithrandir, on Shadowfax, the lord of all horses gifted with incredible speed, leads several hundred Gondorian foot soldiers down through the streets. Pippin, a young hobbit caught in the war for Middle-earth, watches as Faramir's unconscious body is carried on a stretcher by Denethor's servants, led by Denethor, the Steward of Gondor who has been driven to madness. It has the atmosphere of a funeral as an iron door creaks open and Faramir's procession enters a wide vaulted chamber where lantern light throws great shadows upon the shrouded walls. Row upon row of marble tombs in the Hallows are visible in the dim light, with each tomb having a sleeping form carved in stone, hands folded in an eternal rest. Denethor turns to his servants. The gate splinters with a boom under Grond's mighty weight. Behind the gates, the Gondorian foot soldiers are fearful. Gandalf rallies the line of bowmen as they wait in front of the great doors, their courage wavering with each crashing. Suddenly, the fearsome head of Grond protrudes into Minas Tirith. Within moments, the gate is smashed, and giant cave trolls, bred for war by Sauron, enter into the first circle of Minas Tirith under the archway that no enemy had ever passed. Rows of archers fire off a volley of arrows, but the trolls, resistant to injury owing to their thick skin, continue to smash the foot soldiers with their giant clubs. Orcs, the twisted servants of Sauron, swarm through the opening, and the pitched, hand-to-hand battle spills into flames and blackened, smouldering buildings. With a roar, Gandalf leads a counterattack on Shadowfax, followed by several hundred Gondorian foot soldiers, as thousands of orcs swarm in through the city gates, and the first level is breached. Frodo staggers through the pass of Cirith Ungol, the weight of the ring dragging at his neck like an anchor of doom. He moves forward, fueled by a grim resolve, and starts climbing a stone staircase that climbs through a narrow pass leading to the dreaded land of Mordor, where his quest will finally end."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "GOLLUM is cowering back coughing and spluttering. FRODO looks at SMEAGOL in shock and gets to his feet while SMEAGOL stares at FRODO in disbelief. In a fury SMEAGOL lunges at FRODO who falls backwards dangerously close to the edge of the precipice as GOLLUM tumbles over FRODO's body and falls to the bottom of the ravine. FRODO overcome with exhaustion stumbles down the steep stairs of CIRITH UNGOL full of remorse at his treatment of SAM and falls to his knees. FRODO lands on soft green grass and sees sundrenched images of trees. In a hazy image GALADRIEL walks towards him barefoot and leans down offering her hand. For a beat FRODO stares at her torn not wanting to go on and wanting to lie down but he knows what he must do. FRODO is lifted to his feet once again in the dark rank tunnels of the pass of CIRITH UNGOL and he goes on. Flaming missiles rain down on the city as GROND thuds against the MINAS TIRITH gate sending a vibration through the city. GANDALF on SHADOWFAX leads several hundred Gondorian foot soldiers down through the streets. PIPPIN watches as FARAMIR's unconscious body is carried on a stretcher by DENETHOR's servants led by DENETHOR. It has the atmosphere of a funeral as an iron door creaks open and FARAMIR's procession enters a wide vaulted chamber where lantern light throws great shadows upon the shrouded walls. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Row upon row of marble tombs are visible in the dim light with each tomb having a sleeping form carved in stone hands folded. DENETHOR turns to his servants. The gate splinters with a boom under GROND's mighty weight. Behind the gates the Gondorian foot soldiers are fearful. GANDALF rallies the line of bowmen as they wait in front of the great doors their courage wavering with each crashing. Suddenly the fearsome head protrudes into MINAS TIRITH. Within moments the gate is smashed and giant cave trolls enter into the first circle of MINAS TIRITH under the archway that no enemy had ever passed. Rows of archers fire off a volley of arrows but the trolls continue to smash the foot soldiers with their giant clubs. Orcs swarm through the opening and the pitched handtohand battle spills into flames and blackened smouldering buildings. With a roar GANDALF leads a counterattack on SHADOWFAX followed by several hundred Gondorian foot soldiers. as thousands of orcs swarm in through the city gates and the first level is breached. FRODO staggers through the pass of CIRITH UNGOL the weight of the ring dragging at his neck. He moves forward fueled by a grim resolve and starts climbing a stone staircase that climbs through a narrow pass."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "GOLLUM is cowering back coughing and spluttering. FRODO looks at SMEAGOL in shock and gets to his feet while SMEAGOL stares at FRODO in disbelief. In a fury SMEAGOL lunges at FRODO who falls backwards dangerously close to the edge of the precipice as GOLLUM tumbles over FRODO's body and falls to the bottom of the ravine. FRODO overcome with exhaustion stumbles down the steep stairs of CIRITH UNGOL full of remorse at his treatment of SAM and falls to his knees. FRODO lands on soft green grass and sees sundrenched images of trees. In a hazy image GALADRIEL walks towards him barefoot and leans down offering her hand. For a beat FRODO stares at her torn not wanting to go on and wanting to lie down but he knows what he must do. FRODO is lifted to his feet once again in the dark rank tunnels of the pass of CIRITH UNGOL and he goes on. Flaming missiles rain down on the city as GROND thuds against the MINAS TIRITH gate sending a vibration through the city. GANDALF on SHADOWFAX leads several hundred Gondorian foot soldiers down through the streets. PIPPIN watches as FARAMIR's unconscious body is carried on a stretcher by DENETHOR's servants led by DENETHOR. It has the atmosphere of a funeral as an iron door creaks open and FARAMIR's procession enters a wide vaulted chamber where lantern light throws great shadows upon the shrouded walls. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Row upon row of marble tombs are visible in the dim light with each tomb having a sleeping form carved in stone hands folded. DENETHOR turns to his servants. The gate splinters with a boom under GROND's mighty weight. Behind the gates the Gondorian foot soldiers are fearful. GANDALF rallies the line of bowmen as they wait in front of the great doors their courage wavering with each crashing. Suddenly the fearsome head protrudes into MINAS TIRITH. Within moments the gate is smashed and giant cave trolls enter into the first circle of MINAS TIRITH under the archway that no enemy had ever passed. Rows of archers fire off a volley of arrows but the trolls continue to smash the foot soldiers with their giant clubs. Orcs swarm through the opening and the pitched handtohand battle spills into flames and blackened smouldering buildings. With a roar GANDALF leads a counterattack on SHADOWFAX followed by several hundred Gondorian foot soldiers. as thousands of orcs swarm in through the city gates and the first level is breached. FRODO staggers through the pass of CIRITH UNGOL the weight of the ring dragging at his neck. He moves forward fueled by a grim resolve and starts climbing a stone staircase that climbs through a narrow pass."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "GOLLUM is cowering back coughing and spluttering. FRODO looks at SMEAGOL in shock and gets to his feet while SMEAGOL stares at FRODO in disbelief. In a fury SMEAGOL lunges at FRODO who falls backwards dangerously close to the edge of the precipice as GOLLUM tumbles over FRODO's body and falls to the bottom of the ravine. FRODO overcome with exhaustion stumbles down the steep stairs of CIRITH UNGOL full of remorse at his treatment of SAM and falls to his knees. FRODO lands on soft green grass and sees sundrenched images of trees. In a hazy image GALADRIEL walks towards him barefoot and leans down offering her hand. Within moments the gate is smashed and giant cave trolls enter into the first circle of MINAS TIRITH under the archway that no enemy had ever passed. Rows of archers fire off a volley of arrows but the trolls continue to smash the foot soldiers with their giant clubs. Orcs swarm through the opening and the pitched handtohand battle spills into flames and blackened smouldering buildings. With a roar GANDALF leads a counterattack on SHADOWFAX followed by several hundred Gondorian foot soldiers. as thousands of orcs swarm in through the city gates and the first level is breached. FRODO staggers through the pass of CIRITH UNGOL the weight of the ring dragging at his neck. He moves forward fueled by a grim resolve and starts climbing a stone staircase that climbs through a narrow pass."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "GOLLUM is cowering back coughing and spluttering. FRODO looks at SMEAGOL in shock and gets to his feet while SMEAGOL stares at FRODO in disbelief. as thousands of orcs swarm in through the city gates and the first level is breached. FRODO staggers through the pass of CIRITH UNGOL the weight of the ring dragging at his neck. He moves forward fueled by a grim resolve and starts climbing a stone staircase that climbs through a narrow pass."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "SNOWFLAKE is dancing forward, sneezing and wheezing. KITTY glances at FLUFFY in surprise and rises to her knees, while FLUFFY gazes at KITTY in amazement. In a rage, FLUFFY charges at KITTY, who leaps sideways, precariously close to the rim of the chasm, as SNOWFLAKE rolls beneath KITTY's feet and plummets to the depths of the abyss. KITTY, drained with fatigue, meanders up the gentle hill of THE MOONLIT GROVE, filled with regret over her treatment of JOEY, and collapses to her toes. KITTY rests on soft red soil and glimpses rain-soaked visions of flowers. In a misty scene, SELENE strides towards her, shoeless, and bends down, extending her umbrella. For a moment, KITTY gazes at her, conflicted, not wishing to continue and craving to sit down, but she realizes what she must accomplish. KITTY is lifted to her toes, once again in the bright, fragrant gardens of the path of THE MOONLIT GROVE, and she presses forward. Frozen snowflakes drift over the meadow as THUNDER pounds against the EMERALD CITY wall, sending a shiver through the town. ARTHUR, on WHITEY, guides a few dozen Elvish horse warriors up through the lanes. FRANCIE watches as LUCAS's sleeping spirit is held on a shield by GERALD's assistants, directed by GERALD. It has the essence of a celebration as a golden gate whispers open and LUCAS's parade enters a broad vibrant courtyard where candlelight casts long silhouettes upon the festive walls. Layer upon layer of jade monuments are discernible in the bright glow, with each monument having a leaping figure carved in wood, arms extended. GERALD faces his assistants. The wall crumbles with a whisper under THUNDER's gentle presence. Beyond the walls, the Elvish horse warriors are calm. ARTHUR inspires the row of dancers as they stand behind the large arches, their hope rising with every tapping. Abruptly, the delicate nose nudges into EMERALD CITY. In seconds, the wall is cracked, and towering rock giants push into the outer courtyard of EMERALD CITY beneath the portal that no friend had ever crossed. Lines of bards strike off a chorus of melodies, but the giants continue to chase the horse warriors with their massive nets. Goblins flood through the portal, and the lively, voice-to-voice chatter erupts into music and gleaming, polished instruments. With a cheer, ARTHUR spearheads a retreat on WHITEY, joined by a few dozen Elvish horse warriors, as hundreds of goblins rush out through the town portals, and the first terrace is overrun. KITTY stumbles through the path of THE MOONLIT GROVE, the pull of the tiara tugging at her hair. She pushes onward, driven by a cheerful determination, and starts skipping a pebble trail that winds through a wide corridor."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "GOLLUM is cowering and coughing, as FRODO looks at SMEAGOL in shock. SMEAGOL, in disbelief, lunges at FRODO, who falls dangerously close to a precipice edge. GOLLUM tumbles over him and falls into a ravine. Exhausted, FRODO stumbles down CIRITH UNGOL's steep stairs, remorseful about SAM, and collapses on soft grass. He sees GALADRIEL approaching in a hazy vision, who offers her hand. FRODO, torn but resolved, rises back in the dark tunnels of CIRITH UNGOL and continues his journey. Meanwhile, MINAS TIRITH is under siege. GANDALF, on SHADOWFAX, leads soldiers as GROND pounds the gate, causing fear among the defenders. PIPPIN watches FARAMIR, carried unconscious by DENETHOR's servants into a funereal chamber of marble tombs. The gate finally splinters, and cave trolls breach MINAS TIRITH, followed by orcs. GANDALF and the troops launch a counterattack, but the city’s first level is overrun. FRODO, burdened by the ring, struggles through CIRITH UNGOL, climbing a stone staircase with grim determination."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He moves forward fueled by a grim resolve and starts climbing a stone staircase that climbs through a narrow pass FRODO staggers through the pass of CIRITH UNGOL the weight of the ring dragging at his neck  as thousands of orcs swarm in through the city gates and the first level is breached  With a roar GANDALF leads a counterattack on SHADOWFAX followed by several hundred Gondorian foot soldiers  Orcs swarm through the opening and the pitched handtohand battle spills into flames and blackened smouldering buildings  Rows of archers fire off a volley of arrows but the trolls continue to smash the foot soldiers with their giant clubs  Within moments the gate is smashed and giant cave trolls enter into the first circle of MINAS TIRITH under the archway that no enemy had ever passed  Suddenly the fearsome head protrudes into MINAS TIRITH  GANDALF rallies the line of bowmen as they wait in front of the great doors their courage wavering with each crashing  Behind the gates the Gondorian foot soldiers are fearful  The gate splinters with a boom under GROND's mighty weight  DENETHOR turns to his servants  Row upon row of marble tombs are visible in the dim light with each tomb having a sleeping form carved in stone hands folded  It has the atmosphere of a funeral as an iron door creaks open and FARAMIR's procession enters a wide vaulted chamber where lantern light throws great shadows upon the shrouded walls  PIPPIN watches as FARAMIR's unconscious body is carried on a stretcher by DENETHOR's servants led by DENETHOR  GANDALF on SHADOWFAX leads several hundred Gondorian foot soldiers down through the streets  Flaming missiles rain down on the city as GROND thuds against the MINAS TIRITH gate sending a vibration through the city  FRODO is lifted to his feet once again in the dark rank tunnels of the pass of CIRITH UNGOL and he goes on  For a beat FRODO stares at her torn not wanting to go on and wanting to lie down but he knows what he must do  In a hazy image GALADRIEL walks towards him barefoot and leans down offering her hand  FRODO lands on soft green grass and sees sundrenched images of trees  FRODO overcome with exhaustion stumbles down the steep stairs of CIRITH UNGOL full of remorse at his treatment of SAM and falls to his knees  In a fury SMEAGOL lunges at FRODO who falls backwards dangerously close to the edge of the precipice as GOLLUM tumbles over FRODO's body and falls to the bottom of the ravine  FRODO looks at SMEAGOL in shock and gets to his feet while SMEAGOL stares at FRODO in disbelief  GOLLUM is cowering back coughing and spluttering "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "FRODO looks at SMEAGOL in shock and gets to his feet while SMEAGOL stares at FRODO in disbelief GOLLUM is cowering back coughing and spluttering FRODO overcome with exhaustion stumbles down the steep stairs of CIRITH UNGOL full of remorse at his treatment of SAM and falls to his knees In a fury SMEAGOL lunges at FRODO who falls backwards dangerously close to the edge of the precipice as GOLLUM tumbles over FRODO's body and falls to the bottom of the ravine In a hazy image GALADRIEL walks towards him barefoot and leans down offering her hand FRODO lands on soft green grass and sees sundrenched images of trees FRODO is lifted to his feet once again in the dark rank tunnels of the pass of CIRITH UNGOL and he goes on For a beat FRODO stares at her torn not wanting to go on and wanting to lie down but he knows what he must do GANDALF on SHADOWFAX leads several hundred Gondorian foot soldiers down through the streets Flaming missiles rain down on the city as GROND thuds against the MINAS TIRITH gate sending a vibration through the city It has the atmosphere of a funeral as an iron door creaks open and FARAMIR's procession enters a wide vaulted chamber where lantern light throws great shadows upon the shrouded walls PIPPIN watches as FARAMIR's unconscious body is carried on a stretcher by DENETHOR's servants led by DENETHOR DENETHOR turns to his servants Row upon row of marble tombs are visible in the dim light with each tomb having a sleeping form carved in stone hands folded Behind the gates the Gondorian foot soldiers are fearful The gate splinters with a boom under GROND's mighty weight Suddenly the fearsome head protrudes into MINAS TIRITH GANDALF rallies the line of bowmen as they wait in front of the great doors their courage wavering with each crashing Rows of archers fire off a volley of arrows but the trolls continue to smash the foot soldiers with their giant clubs Within moments the gate is smashed and giant cave trolls enter into the first circle of MINAS TIRITH under the archway that no enemy had ever passed With a roar GANDALF leads a counterattack on SHADOWFAX followed by several hundred Gondorian foot soldiers Orcs swarm through the opening and the pitched handtohand battle spills into flames and blackened smouldering buildings FRODO staggers through the pass of CIRITH UNGOL the weight of the ring dragging at his neck as thousands of orcs swarm in through the city gates and the first level is breached He moves forward fueled by a grim resolve and starts climbing a stone staircase that climbs through a narrow pass"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "DENETHOR turns to his servants  The gate splinters with a boom under GROND's mighty weight  Behind the gates the Gondorian foot soldiers are fearful  GANDALF rallies the line of bowmen as they wait in front of the great doors their courage wavering with each crashing  Suddenly the fearsome head protrudes into MINAS TIRITH  Within moments the gate is smashed and giant cave trolls enter into the first circle of MINAS TIRITH under the archway that no enemy had ever passed  Rows of archers fire off a volley of arrows but the trolls continue to smash the foot soldiers with their giant clubs  Orcs swarm through the opening and the pitched handtohand battle spills into flames and blackened smouldering buildings  With a roar GANDALF leads a counterattack on SHADOWFAX followed by several hundred Gondorian foot soldiers  as thousands of orcs swarm in through the city gates and the first level is breached  FRODO staggers through the pass of CIRITH UNGOL the weight of the ring dragging at his neck  He moves forward fueled by a grim resolve and starts climbing a stone staircase that climbs through a narrow pass GOLLUM is cowering back coughing and spluttering  FRODO looks at SMEAGOL in shock and gets to his feet while SMEAGOL stares at FRODO in disbelief  In a fury SMEAGOL lunges at FRODO who falls backwards dangerously close to the edge of the precipice as GOLLUM tumbles over FRODO's body and falls to the bottom of the ravine  FRODO overcome with exhaustion stumbles down the steep stairs of CIRITH UNGOL full of remorse at his treatment of SAM and falls to his knees  FRODO lands on soft green grass and sees sundrenched images of trees  In a hazy image GALADRIEL walks towards him barefoot and leans down offering her hand  For a beat FRODO stares at her torn not wanting to go on and wanting to lie down but he knows what he must do  FRODO is lifted to his feet once again in the dark rank tunnels of the pass of CIRITH UNGOL and he goes on  Flaming missiles rain down on the city as GROND thuds against the MINAS TIRITH gate sending a vibration through the city  GANDALF on SHADOWFAX leads several hundred Gondorian foot soldiers down through the streets  PIPPIN watches as FARAMIR's unconscious body is carried on a stretcher by DENETHOR's servants led by DENETHOR  It has the atmosphere of a funeral as an iron door creaks open and FARAMIR's procession enters a wide vaulted chamber where lantern light throws great shadows upon the shrouded walls  Row upon row of marble tombs are visible in the dim light with each tomb having a sleeping form carved in stone hands folded "
        }
      ]
    }
  ]
}