{
  "ground_truth": "TALL PEAKS rise on either side, like pillars holding up a sagging sky. AHEAD is the SUMMIT of CIRITH UNGOL and an ORC WATCH TOWER! A FAINT LIGHT glows from within the STONE TOWER. The PATH over the SUMMIT is in FULL VIEW of the ORCS. FRODO stays CLOSE to the ROCK WALL, masked by SHADOWS. Behind FRODO, SHELOB APPEARS! With hideous STEALTH, she follows FRODO. FRODO slowly climbing the STONE STAIRS, his GAZE and CONCENTRATION on the ORC TOWER. Behind him, SHELOB lurches into a HORRIBLE SCUTTLE down the SHEER ROCK FACE. FRODO suddenly senses the LURKING MALICE. He SPINS AROUND: Before he can react, SHELOB VICIOUSLY STABS FRODO in the NECK with her monstrous abdominal STINGER! FRODO instantly goes LIMP. SHELOB'S LEGS catch him as he falls, and she quickly starts WEAVING COBWEBS around him. With great dexterity, she tumbles the LITTLE HOBBIT over and over in her LEGS, binding him in WEB from HEAD to TOE! SUDDENLY! The RAZOR SHARP EDGE of a SWORD comes into shot. SAMWISE GAMGEE stands before the GIANT SPIDER -- STING clutched in one hand, the SHINING PHIAL in the other. SHELOB HISSES at SAM, DROPPING FRODO, who ROLLS down the STAIRS in his WEB COCOON. SAM moves forward, a fell light in his normally friendly eyes. SAM SWINGS the small sword, SLASHING upward! ANGLE ON: SHELOB HISSES and REARS above SAM, her STINGER dribbling with VENOM! SAM ducks inside the arch of her LEGS and STABS STING into one of her EYE CLUSTERS! CLOSE ON: SHELOB SCREAMS, her MANDIBLES thrashing wildly, GREEN OOZE trickling from her WOUNDED EYE. With HIND LEGS, SHELOB picks SAM off the ground and TOSSES him BACKWARDS! SAM lands heavily, and SHELOB POUNCES! ANGLE ON: SHELOB heaves the great bag of her BELLY high above SAM'S HEAD. As she splays her legs to drive her huge bulk down on him, SAM lifts the ELVEN BLADE above his head, holding it with TWO HANDS. STING slides into SHELOB'S SOFT UNDERBELLY! A SHUDDER runs through her! HEAVING up again, she wrenches herself away from the PAIN, her LIMBS writhing beneath her. JERKING and QUIVERING, SHELOB crawls to her HOLE, leaving a trail of GREEN-YELLOW SLIME. She SQUEEZES down the HOLE and DISAPPEARS, the SOUND of her BUBBLING MISERY fades. SAM RIPS COBWEBS away from FRODO'S HEAD, his FACE is DEATHLY PALE. FRODO'S head LOLLS LIFELESSLY in SAM'S ARMS. SAM lays his FACE on FRODO'S CHEST, WEEPING SOFTLY. SAM looks up. SAM looks up at the ORC TOWER and then at STING which is glowing BLUE! ORCS approach -- SAM must make a decision. A SMALL PARTY of ORCS and URUK-HAI heading down the STAIRS from the WATCH TOWER. SHAGRAT leads the URUK-HAI, and GORBAG leads the ORCS.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "TALL PEAKS ascend on either side, like columns supporting a drooping sky. AHEAD is the APEX of CIRITH UNGOL and an ORC OBSERVATION TOWER! A FAINT LIGHT shimmers from within the STONE TOWER. The TRAIL over the APEX is in FULL VIEW of the ORCS. FRODO remains CLOSE to the ROCK WALL, concealed by SHADOWS. Behind FRODO, SHELOB EMERGES! With hideous STEALTH, she trails FRODO. FRODO slowly ascending the STONE STAIRS, his GAZE and FOCUS on the ORC TOWER. Behind him, SHELOB jerks into a HORRIBLE SCUTTLE down the STEEP ROCK FACE. FRODO suddenly detects the LURKING MALICE. He TWISTS AROUND: Before he can react, SHELOB VICIOUSLY JABS FRODO in the NECK with her monstrous abdominal STINGER! FRODO instantly goes LIMP. SHELOB'S LEGS seize him as he falls, and she swiftly begins WEAVING COBWEBS around him. With great dexterity, she rolls the SMALL HOBBIT over and over in her LEGS, binding him in WEB from HEAD to TOE! SUDDENLY! The RAZOR SHARP EDGE of a SWORD enters the scene. SAMWISE GAMGEE stands before the GIANT SPIDER -- STING gripped in one hand, the SHINING PHIAL in the other. SHELOB HISSES at SAM, DROPPING FRODO, who ROLLS down the STAIRS in his WEB COCOON. SAM advances, a fell light in his normally amiable eyes. SAM SWINGS the small sword, SLASHING upward! ANGLE ON: SHELOB HISSES and RISES above SAM, her STINGER dribbling with VENOM! SAM ducks within the arch of her LEGS and JABS STING into one of her EYE CLUSTERS! CLOSE ON: SHELOB SCREAMS, her MANDIBLES thrashing wildly, GREEN OOZE streaming from her INJURED EYE. With HIND LEGS, SHELOB lifts SAM off the ground and HURLS him BACKWARDS! SAM lands heavily, and SHELOB POUNCES! ANGLE ON: SHELOB elevates the great bag of her BELLY high above SAM'S HEAD. As she spreads her legs to drive her huge mass down on him, SAM raises the ELVEN BLADE above his head, holding it with TWO HANDS. STING slides into SHELOB'S SOFT UNDERBELLY! A SHUDDER courses through her! HEAVING up again, she wrenches herself away from the PAIN, her LIMBS writhing beneath her. JERKING and QUIVERING, SHELOB crawls to her LAIR, leaving a trail of GREEN-YELLOW SLIME. She COMPRESSES down the LAIR and VANISHES, the SOUND of her BUBBLING MISERY diminishes. SAM RIPS COBWEBS away from FRODO'S HEAD, his FACE is DEATHLY PALE. FRODO'S head LOLLS LIFELESSLY in SAM'S ARMS. SAM lays his FACE on FRODO'S CHEST, SOBBING SOFTLY. SAM gazes up. SAM gazes up at the ORC TOWER and then at STING which is glowing BLUE! ORCS advance -- SAM must make a choice. A SMALL GROUP of ORCS and URUK-HAI descending the STAIRS from the OBSERVATION TOWER. SHAGRAT leads the URUK-HAI, and GORBAG leads the ORCS."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "TALL PEAKS are risen on either side, like pillars holding up a sagging sky. The SUMMIT of CIRITH UNGOL and an ORC WATCH TOWER are ahead! A FAINT LIGHT is glowing from within the STONE TOWER. The PATH over the SUMMIT is fully viewed by the ORCS. FRODO is stayed close to the ROCK WALL, and shadows mask him. SHELOB appears behind FRODO! FRODO is followed by her with hideous STEALTH. The STONE STAIRS are slowly climbed by FRODO, his GAZE and CONCENTRATION are directed toward the ORC TOWER. SHELOB lurches into a HORRIBLE SCUTTLE behind him, down the SHEER ROCK FACE. The LURKING MALICE is suddenly sensed by FRODO. He SPINS AROUND: Before he can react, FRODO is VICIOUSLY STABBED by SHELOB in the NECK with her monstrous abdominal STINGER! FRODO is instantly made limp. As he falls, he is caught by SHELOB'S LEGS, and COBWEBS are quickly started to be woven around him by her. The LITTLE HOBBIT is tumbled over and over with great dexterity in her LEGS, and he is bound in WEB from HEAD to TOE! SUDDENLY! The RAZOR SHARP EDGE of a SWORD is brought into shot. SAMWISE GAMGEE stands before the GIANT SPIDER -- STING clutched in one hand, the SHINING PHIAL in the other. SHELOB HISSES at SAM, and FRODO is dropped, rolling down the STAIRS in his WEB COCOON. Forward is moved by SAM, a fell light glowing in his normally friendly eyes. The small sword is SWUNG by SAM, and he SLASHES upward! ANGLE ON: SHELOB HISSES and is reared above SAM, her STINGER dribbling with VENOM! SAM ducks inside the arch of her LEGS and STABS STING into one of her EYE CLUSTERS! CLOSE ON: SHELOB SCREAMS, her MANDIBLES thrashing wildly, and GREEN OOZE trickles from her WOUNDED EYE. SAM is picked off the ground by SHELOB with HIND LEGS and is TOSSED BACKWARDS! SAM lands heavily, and SHELOB POUNCES! ANGLE ON: The great bag of her BELLY is heaved high above SAM'S HEAD by SHELOB. As her legs are splayed to drive her huge bulk down on him, the ELVEN BLADE is lifted by SAM above his head, holding it with TWO HANDS. STING is slid into SHELOB'S SOFT UNDERBELLY! A SHUDDER is run through her! She heaves up again, wrenching herself away from the PAIN, her LIMBS writhe beneath her. SHELOB is caused to crawl to her HOLE, JERKING and QUIVERING, leaving a trail of GREEN-YELLOW SLIME. The HOLE is squeezed down by her, and she DISAPPEARS, the SOUND of her BUBBLING MISERY fading. COBWEBS are ripped away from FRODO'S HEAD by SAM, his FACE is DEATHLY PALE. In SAM'S ARMS, FRODO'S head is lolled lifeLEssly. SAM lays his FACE on FRODO'S CHEST, and he is weeping softly. SAM looks up. SAM looks up at the ORC TOWER and then at STING, which glows BLUE! ORCS approach -- a decision must be made by SAM. A SMALL PARTY of ORCS and URUK-HAI head down the STAIRS from the WATCH TOWER. The URUK-HAI are led by SHAGRAT, and the ORCS are led by GORBAG."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "TALL PEAKS rise on either side, like pillars supporting a sagging sky. AHEAD is the SUMMIT of CIRITH UNGOL and an ORC WATCH TOWER, with a FAINT LIGHT glowing inside. The PATH over the SUMMIT is in FULL VIEW of the ORCS. FRODO stays CLOSE to the ROCK WALL, hidden by SHADOWS. Behind him, SHELOB APPEARS, following with hideous STEALTH. FRODO climbs the STONE STAIRS, focused on the ORC TOWER. SHELOB lurches into a HORRIBLE SCUTTLE down the ROCK FACE. FRODO senses the LURKING MALICE and SPINS AROUND: SHELOB VICIOUSLY STABS him in the NECK with her abdominal STINGER! FRODO goes LIMP. SHELOB'S LEGS catch him, quickly WEAVING COBWEBS around him, binding him from HEAD to TOE! SUDDENLY, a SWORD appears. SAMWISE GAMGEE stands before the GIANT SPIDER, STING in one hand, SHINING PHIAL in the other. SHELOB HISSES at SAM, DROPPING FRODO, who ROLLS down the STAIRS in his WEB COCOON. SAM advances, a fell light in his eyes, and SLASHES upward! SHELOB HISSES, REARING above SAM, her STINGER dripping VENOM! SAM ducks under her LEGS and STABS STING into her EYE CLUSTERS! SHELOB SCREAMS, MANDIBLES thrashing, GREEN OOZE trickling from her WOUNDED EYE. With HIND LEGS, SHELOB TOSSES SAM BACKWARDS! He lands heavily, and SHELOB POUNCES! She raises her BELLY above SAM'S HEAD, but SAM lifts the ELVEN BLADE, STING sliding into her SOFT UNDERBELLY! A SHUDDER runs through her! She wrenches away from the PAIN, LIMBS writhing. JERKING and QUIVERING, SHELOB crawls to her HOLE, leaving a trail of GREEN-YELLOW SLIME, and DISAPPEARS, her BUBBLING MISERY fading. SAM RIPS COBWEBS from FRODO'S HEAD, his FACE DEATHLY PALE. FRODO'S head LOLLS LIFELESSLY in SAM'S ARMS. SAM lays his FACE on FRODO'S CHEST, WEEPING SOFTLY. SAM looks up at the ORC TOWER and then at STING, glowing BLUE! ORCS approach -- SAM must decide. A SMALL PARTY of ORCS and URUK-HAI descend the STAIRS from the WATCH TOWER, led by SHAGRAT and GORBAG."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "TALL PEAKS rise like pillars holding up the sky. AHEAD is the SUMMIT of CIRITH UNGOL and an ORC WATCH TOWER with a FAINT LIGHT glowing inside. The PATH is in FULL VIEW of the ORCS. FRODO stays CLOSE to the ROCK WALL, hidden by SHADOWS. Behind him, SHELOB APPEARS, following with STEALTH. FRODO climbs the STONE STAIRS, focused on the ORC TOWER. SHELOB lurches into a SCUTTLE down the ROCK FACE. FRODO senses MALICE, SPINS AROUND, but SHELOB STABS him in the NECK with her STINGER! FRODO goes LIMP. SHELOB'S LEGS catch him, quickly WEAVING COBWEBS around him, binding him from HEAD to TOE! SUDDENLY, SAMWISE GAMGEE appears with STING and a SHINING PHIAL. SHELOB HISSES, DROPPING FRODO, who ROLLS down the STAIRS. SAM advances, SWINGS the sword, SLASHING upward! SHELOB HISSES, REARS above SAM, her STINGER dripping VENOM! SAM ducks, STABS STING into her EYE CLUSTERS! SHELOB SCREAMS, GREEN OOZE trickling from her EYE. SHELOB picks SAM up and TOSSES him! SAM lands heavily, and SHELOB POUNCES! She raises her BELLY above SAM, but he lifts the ELVEN BLADE, STING slides into her UNDERBELLY! SHELOB SHUDDERS, crawls to her HOLE, leaving SLIME. She DISAPPEARS, her BUBBLING MISERY fading. SAM RIPS COBWEBS from FRODO'S HEAD, his FACE PALE. FRODO'S head LOLLS in SAM'S ARMS. SAM WEEPS, looks at the ORC TOWER and STING glowing BLUE! ORCS approach -- SAM must decide. A PARTY of ORCS and URUK-HAI descends the STAIRS, led by SHAGRAT and GORBAG."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "TALL PEAKS rise majestically on either side, resembling colossal pillars that seem to support a sagging, overcast sky. AHEAD lies the formidable SUMMIT of CIRITH UNGOL, accompanied by an imposing ORC WATCH TOWER! A FAINT LIGHT, barely perceptible, glows eerily from within the ancient STONE TOWER. The PATH that traverses over the SUMMIT is in FULL VIEW of the ever-watchful ORCS. FRODO, with great caution, stays CLOSE to the ROCK WALL, skillfully masked by the enveloping SHADOWS. Behind FRODO, SHELOB APPEARS with terrifying stealth! With hideous, silent STEALTH, she follows FRODO, her presence menacing. FRODO is slowly climbing the worn STONE STAIRS, his GAZE and unwavering CONCENTRATION fixed on the distant ORC TOWER. Behind him, SHELOB lurches into a HORRIBLE SCUTTLE, descending the SHEER ROCK FACE with alarming speed. FRODO suddenly senses the LURKING MALICE behind him. He SPINS AROUND: Before he can react, SHELOB VICIOUSLY STABS FRODO in the NECK with her monstrous, venomous abdominal STINGER! FRODO instantly goes LIMP, his body rendered motionless. SHELOB'S LEGS catch him as he falls, and she quickly starts WEAVING thick COBWEBS around him. With great dexterity and speed, she tumbles the LITTLE HOBBIT over and over in her LEGS, binding him tightly in WEB from HEAD to TOE! SUDDENLY! The RAZOR SHARP EDGE of a SWORD comes into view. SAMWISE GAMGEE stands defiantly before the GIANT SPIDER -- STING clutched firmly in one hand, the SHINING PHIAL glowing in the other. SHELOB HISSES menacingly at SAM, DROPPING FRODO, who ROLLS helplessly down the STAIRS in his WEB COCOON. SAM moves forward with determination, a fell light burning in his normally friendly eyes. SAM SWINGS the small sword, SLASHING upward with force! ANGLE ON: SHELOB HISSES and REARS above SAM, her deadly STINGER dribbling with VENOM! SAM ducks swiftly inside the arch of her LEGS and STABS STING into one of her many EYE CLUSTERS! CLOSE ON: SHELOB SCREAMS in agony, her MANDIBLES thrashing wildly, GREEN OOZE trickling from her WOUNDED EYE. With her HIND LEGS, SHELOB picks SAM off the ground and TOSSES him BACKWARDS with great force! SAM lands heavily, and SHELOB POUNCES with intent! ANGLE ON: SHELOB heaves the great bag of her BELLY high above SAM'S HEAD. As she splays her legs to drive her huge bulk down on him, SAM lifts the ELVEN BLADE above his head, holding it with TWO HANDS. STING slides into SHELOB'S SOFT UNDERBELLY! A SHUDDER runs through her massive form! HEAVING up again, she wrenches herself away from the PAIN, her LIMBS writhing beneath her. JERKING and QUIVERING, SHELOB crawls to her dark HOLE, leaving a trail of GREEN-YELLOW SLIME in her wake. She SQUEEZES down the HOLE and DISAPPEARS, the SOUND of her BUBBLING MISERY gradually fades. SAM RIPS the sticky COBWEBS away from FRODO'S HEAD, revealing his FACE, which is DEATHLY PALE. FRODO'S head LOLLS LIFELESSLY in SAM'S ARMS. SAM lays his FACE on FRODO'S CHEST, WEEPING SOFTLY in despair. SAM looks up, his eyes filled with determination. SAM looks up at the ORC TOWER and then at STING, which is glowing BLUE! ORCS approach -- SAM must make a crucial decision. A SMALL PARTY of ORCS and URUK-HAI is heading down the STAIRS from the ominous WATCH TOWER. SHAGRAT leads the URUK-HAI, and GORBAG leads the ORCS."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Majestically rising toward the heavens, the towering peaks on either side of the narrow path resemble enormous, ancient pillars, almost as though they are supporting the drooping, somber overcast sky above. Ahead, looming large and formidable, lies the summit of the dreaded Cirith Ungol, accompanied ominously by an imposing ORC WATCH TOWER. From within this ancient stone fortress, a faint, barely perceptible light glows with an eerie luminescence, casting an unsettling atmosphere. The path that winds over the summit is fully exposed to the unceasing vigilance of the watchful orcs. Frodo moves with extreme caution, staying as close as possible to the cold rock wall, deftly masked by the enveloping and protective shadows. However, unbeknownst to him, behind Frodo, the monstrous Shelob appears. With terrifying stealth, she follows him, her presence menacing and filled with hideous, silent intent. Frodo carefully climbs the worn stone stairs, his gaze and unwavering concentration focused on the ominous orc tower in the distance. Behind him, Shelob lurches forward with a horrible scuttle, descending the sheer rock face with alarming speed and precision. Frodo suddenly senses the lurking malice creeping up behind him. He spins around quickly, but before he can react, Shelob viciously stabs Frodo in the neck with her monstrous, venomous abdominal stinger! In an instant, Frodo goes limp, his body rendered completely motionless. Shelob’s many legs catch him as he falls, and she quickly begins to weave her thick cobwebs around him. With great dexterity and alarming speed, she tumbles the little hobbit over and over in her legs, binding him tightly in web from head to toe! Suddenly, the razor-sharp edge of a sword appears in view. Samwise Gamgee stands defiantly before the giant spider. With Sting clutched firmly in one hand and the shining Phial glowing brightly in the other, Sam faces off against the terrifying creature. Shelob hisses menacingly at Sam, dropping Frodo, who rolls helplessly down the stairs in his web cocoon. With a fierce determination, Sam moves forward, a fell light burning fiercely in his normally friendly eyes. Sam swings the small sword with all his might, slashing upward with great force! The angle shifts as Shelob hisses menacingly and rears above Sam, her deadly stinger dripping with venom! Sam quickly ducks inside the arch of her many legs and stabs Sting into one of her numerous eye clusters! Close on: Shelob screams in agony, her mandibles thrashing wildly, as green ooze trickles from her wounded eye. With her powerful hind legs, Shelob picks Sam off the ground and tosses him backwards with great force! Sam lands heavily, and Shelob pounces toward him with aggressive intent! Angle on: Shelob heaves the great swollen bag of her belly high above Sam's head, preparing to crush him. As she sets to drive her massive body down upon him, Sam lifts the elven blade above his head, holding it tightly with both hands. Sting slides into Shelob’s soft underbelly! A shudder runs through her massive form as she writhes in pain! Heaving upwards again, she wrenches herself away from the agony, her limbs writhing beneath her. Jerking and quivering, Shelob crawls toward her dark lair, leaving a trail of green-yellow slime in her wake. She squeezes herself down the hole and disappears, the sound of her bubbling misery gradually fading away. Sam tears the sticky cobwebs away from Frodo's head, revealing his face, which is deathly pale. Frodo's head lolls lifelessly in Sam's arms. Sam gently lays his face on Frodo's chest, weeping softly in despair and sorrow. Then, gathering himself, Sam looks up, his eyes filled with determination. He glances at the orc tower in the distance and at Sting, which is glowing blue! Orcs are approaching -- Sam must make a crucial decision. A small party of orcs and Uruk-hai is heading down the stairs from the ominous watch tower. Shagrat leads the Uruk-hai, while Gorbag is at the forefront of the orcs."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Tall peaks rise majestically on either side, resembling colossal pillars that seem to support a sagging sky above. Ahead, the summit of Cirith Ungol looms ominously, crowned by an Orc watchtower that stands as a vigilant sentinel. A faint light emanates from within the stone tower, casting an eerie glow that pierces the surrounding darkness. The path over the summit lies fully exposed to the watchful eyes of the Orcs, creating a perilous passage. Frodo, with a sense of urgency and caution, stays close to the rock wall, skillfully masking himself in the shadows to avoid detection. Unbeknownst to him, behind Frodo, Shelob, the monstrous spider, appears with hideous stealth, her many legs moving silently as she follows him with predatory intent. Frodo, unaware of the danger lurking behind, slowly ascends the stone stairs, his gaze and concentration fixed intently on the Orc tower, oblivious to the threat that creeps ever closer. Behind him, Shelob lurches into a horrible scuttle, her massive form descending the sheer rock face with terrifying agility. Suddenly, Frodo senses the lurking malice, a chill running down his spine as he spins around in alarm. Before he can react, Shelob strikes with vicious speed, stabbing Frodo in the neck with her monstrous abdominal stinger. Frodo instantly goes limp, his body succumbing to the venom as Shelob's legs catch him mid-fall. With swift and practiced movements, she begins weaving cobwebs around him, her dexterous legs tumbling the little hobbit over and over, binding him tightly in a cocoon of web from head to toe. Suddenly, the razor-sharp edge of a sword slices into view. Samwise Gamgee stands defiantly before the giant spider, clutching Sting in one hand and the shining Phial in the other. Shelob hisses menacingly at Sam, dropping Frodo, who rolls helplessly down the stairs, encased in his web cocoon. Sam, undeterred, moves forward with a fierce determination, a fell light burning in his normally friendly eyes. He swings the small sword with precision, slashing upward at the monstrous creature. Shelob rears above Sam, her stinger dripping with venom, ready to strike. Sam ducks inside the arch of her legs, seizing the opportunity to stab Sting into one of her eye clusters. Shelob screams in agony, her mandibles thrashing wildly as green ooze trickles from her wounded eye. With her hind legs, Shelob picks Sam off the ground and tosses him backward with brute force. Sam lands heavily, the impact jarring him, but Shelob pounces, her massive form looming threateningly. As she heaves the great bag of her belly high above Sam's head, preparing to crush him, Sam lifts the Elven blade above his head, gripping it with both hands. With a decisive thrust, Sting slides into Shelob's soft underbelly, sending a shudder through her massive body. Heaving up again, she wrenches herself away from the pain, her limbs writhing beneath her as she retreats. Jerking and quivering, Shelob crawls to her hole, leaving a trail of green-yellow slime in her wake. She squeezes down the hole and disappears, the sound of her bubbling misery fading into the distance. Sam, his heart pounding, rips the cobwebs away from Frodo's head, revealing a face that is deathly pale. Frodo's head lolls lifelessly in Sam's arms, prompting Sam to lay his face on Frodo's chest, weeping softly in despair. As he looks up, Sam's gaze shifts to the Orc tower and then to Sting, which is glowing blue, a sign of approaching danger. Realizing the urgency of the situation, Sam knows he must make a decision as a small party of Orcs and Uruk-hai descends the stairs from the watchtower. Shagrat leads the Uruk-hai, while Gorbag leads the Orcs, their approach signaling an imminent threat."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "TALL PEAKS rise on either side, framing the SUMMIT of CIRITH UNGOL and an ORC WATCH TOWER, from which a FAINT LIGHT glows. The PATH over the SUMMIT is fully exposed to the ORCS. FRODO stays close to the ROCK WALL, hidden in SHADOWS, as SHELOB stealthily follows him. As FRODO climbs the STONE STAIRS, focused on the ORC TOWER, SHELOB scuttles down the ROCK FACE. Sensing danger, FRODO spins around, but SHELOB strikes, stabbing him in the neck with her stinger, rendering him limp. She quickly ensnares him in webs, binding him from head to toe. Suddenly, SAMWISE GAMGEE appears, wielding STING and the SHINING PHIAL. SHELOB hisses and drops FRODO, who rolls down the stairs in his cocoon. SAM advances with determination, slashing upward with STING. SHELOB rears above him, her stinger dripping venom, but SAM ducks and stabs her eye cluster. Screaming, SHELOB thrashes wildly, oozing green from her wound. She tosses SAM backward, but as she pounces, SAM thrusts STING into her soft underbelly. SHELOB shudders and retreats, leaving a trail of slime as she disappears into her hole. SAM tears the webs from FRODO, whose face is deathly pale, and weeps softly over him. Looking up, SAM sees the ORC TOWER and notices STING glowing blue, signaling the approach of ORCS. A small party of ORCS and URUK-HAI, led by SHAGRAT and GORBAG, descends the stairs from the WATCH TOWER."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Tall peaks rise on either side, like pillars holding up a sagging sky, reminiscent of the Misty Mountains known for their imposing beauty. Ahead looms the summit of Cirith Ungol, an ancient pass in the land of Mordor, and an orc watchtower, a relic from Sauron's dark regime. A faint light glows from within the stone tower, a signal of vigilance maintained by the orcs. The path over the summit is in full view of the orcs, notorious for their keen eyesight. Frodo stays close to the rock wall, masked by shadows cast by the moon in the perilous night. Behind Frodo, Shelob appears, a monstrous spider of legend feared even by Sauron's servants. With hideous stealth, she follows Frodo, who is slowly climbing the stone stairs, his gaze and concentration on the orc tower, a focal point of danger. Behind him, Shelob lurches into a horrible scuttle down the sheer rock face, a testament to her terrifying agility. Frodo suddenly senses the lurking malice, an instinct honed in the long journey. He spins around: Before he can react, Shelob viciously stabs Frodo in the neck with her monstrous abdominal stinger, a deadly weapon evolved for this very purpose. Frodo instantly goes limp. Shelob's legs catch him as he falls, and she quickly starts weaving cobwebs around him, an age-old method of ensnaring prey. With great dexterity, she tumbles the little hobbit over and over in her legs, binding him in web from head to toe, ensuring he cannot escape. Suddenly, the razor-sharp edge of a sword comes into shot. Samwise Gamgee stands before the giant spider — Sting, the famed Elven blade known for glowing blue in the presence of orcs, clutched in one hand, the shining phial, a gift from the Lady Galadriel filled with light from the star of Eärendil, in the other. Shelob hisses at Sam, dropping Frodo, who rolls down the stairs in his web cocoon, helpless yet untouched by death. Sam moves forward, a fell light in his normally friendly eyes, a transformation spurred by fierce loyalty and love. Sam swings the small sword, slashing upward! Angle on: Shelob hisses and rears above Sam, her stinger dribbling with venom, a liquid lethal enough to paralyze her victims. Sam ducks inside the arch of her legs and stabs Sting into one of her eye clusters, an act of bravery and desperation. Close on: Shelob screams, her mandibles thrashing wildly, green ooze trickling from her wounded eye, a fluid that speaks of her otherworldly nature. With hind legs, Shelob picks Sam off the ground and tosses him backwards, a demonstration of her immense strength. Sam lands heavily, and Shelob pounces! Angle on: Shelob heaves the great bag of her belly high above Sam's head, ready to crush him. As she splays her legs to drive her huge bulk down on him, Sam lifts the Elven blade above his head, holding it with two hands, his resolve unyielding. Sting slides into Shelob's soft underbelly, a vulnerable spot even for such a creature. A shudder runs through her! Heaving up again, she wrenches herself away from the pain, her limbs writhing beneath her in a frenzy. Jerking and quivering, Shelob crawls to her hole, a labyrinthine lair carved in the hillside, leaving a trail of green-yellow slime, the ichor of her defeat. She squeezes down the hole and disappears, the sound of her bubbling misery fades into the darkness. Sam rips cobwebs away from Frodo's head, his face is deathly pale, reminiscent of those under a deep spell. Frodo's head lolls lifelessly in Sam's arms. Sam lays his face on Frodo's chest, weeping softly, his heart heavy with grief and fear. Sam looks up. Sam looks up at the orc tower, a bastion of threat, and then at Sting, which is glowing blue! Orcs approach — Sam must make a decision. A small party of orcs and Uruk-hai, the fearsome crossbreed warriors bred for war, head down the stairs from the watch tower. Shagrat, known for his cruel leadership, leads the Uruk-hai, and Gorbag, infamous for his cunning, leads the orcs."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "TALL PEAKS rise on either side like pillars holding up a sagging sky  AHEAD is the SUMMIT of CIRITH UNGOL and an ORC WATCH TOWER  A FAINT LIGHT glows from within the STONE TOWER  The PATH over the SUMMIT is in FULL VIEW of the ORCS  FRODO stays CLOSE to the ROCK WALL masked by SHADOWS  Behind FRODO  SHELOB APPEARS  The RAZOR SHARP EDGE of a SWORD comes into shot  SAMWISE GAMGEE stands before the GIANT SPIDER  STING clutched in one hand  the SHINING PHIAL in the other  SHELOB HISSES at SAM  DROPPING FRODO who ROLLS down the STAIRS in his WEB COCOON  SAM moves forward a fell light in his normally friendly eyes  SAM SWINGS the small sword SLASHING upward  ANGLE ON SHELOB HISSES and REARS above SAM her STINGER dribbling with VENOM  SAM ducks inside the arch of her LEGS and STABS STING into one of her EYE CLUSTERS  CLOSE ON  SHELOB SCREAMS her MANDIBLES thrashing wildly  GREEN OOZE trickling from her WOUNDED EYE  With HIND LEGS SHELOB picks SAM off the ground and TOSSES him BACKWARDS  SAM lands heavily and SHELOB POUNCES ANGLE ON  SHELOB heaves the great bag of her BELLY high above SAM'S HEAD  As she splays her legs to drive her huge bulk down on him  SAM lifts the ELVEN BLADE above his head holding it with TWO HANDS  STING slides into SHELOB'S SOFT UNDERBELLY  A SHUDDER runs through her HEAVING up again  she wrenches herself away from the PAIN  her LIMBS writhing beneath her JERKING and QUIVERING  SHELOB crawls to her HOLE leaving a trail of GREENYELLOW SLIME  She SQUEEZES down the HOLE and DISAPPEARS the SOUND of her BUBBLING MISERY fades  SAM RIPS COBWEBS away from FRODO'S HEAD  his FACE is DEATHLY PALE  FRODO'S head LOLLS LIFELESSLY in SAM'S ARMS  SAM lays his FACE on FRODO'S CHEST WEEPING SOFTLY  With hideous STEALTH  she follows FRODO  FRODO slowly climbing the STONE STAIRS his GAZE and CONCENTRATION on the ORC TOWER  Behind him  SHELOB lurches into a HORRIBLE SCUTTLE down the SHEER  ROCK FACE  FRODO suddenly senses the LURKING MALICE  He SPINS AROUND  Before he can react SHELOB VICIOUSLY STABS FRODO in the NECK with her monstrous abdominal STINGER  FRODO instantly goes LIMP  SHELOB'S LEGS  catch him as he falls and she quickly starts WEAVING COBWEBS around him  With great dexterity she tumbles the LITTLE HOBBIT over and over in her LEGS binding him in WEB from HEAD to TOE SUDDENLY  The RAZOR SHARP EDGE of a SWORD comes into shot  SAMWISE GAMGEE stands before the GIANT SPIDER  STING clutched in one hand  the SHINING PHIAL in the other  SHELOB HISSES at SAM  DROPPING FRODO who ROLLS down the STAIRS in his WEB COCOON  SAM moves forward a fell light in his normally friendly eyes  SAM SWINGS the small sword SLASHING upward  ANGLE ON SHELOB HISSES and REARS above SAM her STINGER dribbling with VENOM  SAM ducks inside the arch of her LEGS and STABS STING into one of her EYE CLUSTERS  CLOSE ON  SHELOB SCREAMS her MANDIBLES thrashing wildly  GREEN OOZE trickling from her WOUNDED EYE  With HIND LEGS SHELOB picks SAM off the ground and TOSSES him BACKWARDS  SAM lands heavily and SHELOB POUNCES ANGLE ON  SHELOB heaves the great bag of her BELLY high above SAM'S HEAD  As she splays her legs to drive her huge bulk down on him  SAM lifts the ELVEN BLADE above his head holding it with TWO HANDS  STING slides into SHELOB'S SOFT UNDERBELLY  A SHUDDER runs through her HEAVING up again  she wrenches herself away from the PAIN  her LIMBS writhing beneath her JERKING and QUIVERING  SHELOB crawls to her HOLE leaving a trail of GREENYELLOW SLIME  She SQUEEZES down the HOLE and DISAPPEARS the SOUND of her BUBBLING MISERY fades  SAM RIPS COBWEBS away from FRODO'S HEAD  his FACE is DEATHLY PALE  FRODO'S head LOLLS LIFELESSLY in SAM'S ARMS  SAM lays his FACE on FRODO'S CHEST WEEPING SOFTLY  SAM looks up  SAM looks up at the ORC TOWER and then at STING which is glowing  BLUE ORCS approach   SAM must make a decision  A SMALL PARTY of ORCS and URUKHAI heading down the STAIRS from the WATCH TOWER  SHAGRAT leads the URUKHAI and GORBAG leads the ORCS"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "TALL PEAKS rise on either side like pillars holding up a sagging sky. AHEAD is the SUMMIT of CIRITH UNGOL and an ORC WATCH TOWER. A FAINT LIGHT glows from within the STONE TOWER. The PATH over the SUMMIT is in FULL VIEW of the ORCS. FRODO stays CLOSE to the ROCK WALL masked by SHADOWS. Behind FRODO. SHELOB APPEARS. With hideous STEALTH. she follows FRODO. FRODO slowly climbing the STONE STAIRS his GAZE and CONCENTRATION on the ORC TOWER. Behind him. SHELOB lurches into a HORRIBLE SCUTTLE down the SHEER. ROCK FACE. FRODO suddenly senses the LURKING MALICE. He SPINS AROUND. Before he can react SHELOB VICIOUSLY STABS FRODO in the NECK with her monstrous abdominal STINGER. FRODO instantly goes LIMP. SHELOB'S LEGS. catch him as he falls and she quickly starts WEAVING COBWEBS around him. With great dexterity she tumbles the LITTLE HOBBIT over and over in her LEGS binding him in WEB from HEAD to TOE SUDDENLY. The RAZOR SHARP EDGE of a SWORD comes into shot. SAMWISE GAMGEE stands before the GIANT SPIDER  STING clutched in one hand. the SHINING PHIAL in the other. SHELOB HISSES at SAM. DROPPING FRODO who ROLLS down the STAIRS in his WEB COCOON. SAM moves forward a fell light in his normally friendly eyes. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. SAM SWINGS the small sword SLASHING upward. ANGLE ON SHELOB HISSES and REARS above SAM her STINGER dribbling with VENOM. SAM ducks inside the arch of her LEGS and STABS STING into one of her EYE CLUSTERS. CLOSE ON. SHELOB SCREAMS her MANDIBLES thrashing wildly. GREEN OOZE trickling from her WOUNDED EYE. With HIND LEGS SHELOB picks SAM off the ground and TOSSES him BACKWARDS. SAM lands heavily and SHELOB POUNCES ANGLE ON. SHELOB heaves the great bag of her BELLY high above SAM'S HEAD. As she splays her legs to drive her huge bulk down on him. SAM lifts the ELVEN BLADE above his head holding it with TWO HANDS. STING slides into SHELOB'S SOFT UNDERBELLY. A SHUDDER runs through her HEAVING up again. she wrenches herself away from the PAIN. her LIMBS writhing beneath her JERKING and QUIVERING. SHELOB crawls to her HOLE leaving a trail of GREENYELLOW SLIME. She SQUEEZES down the HOLE and DISAPPEARS the SOUND of her BUBBLING MISERY fades. SAM RIPS COBWEBS away from FRODO'S HEAD. his FACE is DEATHLY PALE. FRODO'S head LOLLS LIFELESSLY in SAM'S ARMS. SAM lays his FACE on FRODO'S CHEST WEEPING SOFTLY. SAM looks up. SAM looks up at the ORC TOWER and then at STING which is glowing. BLUE ORCS approach. SAM must make a decision. A SMALL PARTY of ORCS and URUKHAI heading down the STAIRS from the WATCH TOWER. SHAGRAT leads the URUKHAI and GORBAG leads the ORCS."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "TALL PEAKS rise on either side like pillars holding up a sagging sky. AHEAD is the SUMMIT of CIRITH UNGOL and an ORC WATCH TOWER. A FAINT LIGHT glows from within the STONE TOWER. The PATH over the SUMMIT is in FULL VIEW of the ORCS. FRODO stays CLOSE to the ROCK WALL masked by SHADOWS. Behind FRODO. SHELOB APPEARS. With hideous STEALTH. she follows FRODO. FRODO slowly climbing the STONE STAIRS his GAZE and CONCENTRATION on the ORC TOWER. Behind him. SHELOB lurches into a HORRIBLE SCUTTLE down the SHEER. ROCK FACE. FRODO suddenly senses the LURKING MALICE. He SPINS AROUND. Before he can react SHELOB VICIOUSLY STABS FRODO in the NECK with her monstrous abdominal STINGER. FRODO instantly goes LIMP. SHELOB'S LEGS. catch him as he falls and she quickly starts WEAVING COBWEBS around him. With great dexterity she tumbles the LITTLE HOBBIT over and over in her LEGS binding him in WEB from HEAD to TOE SUDDENLY. The RAZOR SHARP EDGE of a SWORD comes into shot. SAMWISE GAMGEE stands before the GIANT SPIDER  STING clutched in one hand. the SHINING PHIAL in the other. SHELOB HISSES at SAM. DROPPING FRODO who ROLLS down the STAIRS in his WEB COCOON. SAM moves forward a fell light in his normally friendly eyes. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. SAM SWINGS the small sword SLASHING upward. ANGLE ON SHELOB HISSES and REARS above SAM her STINGER dribbling with VENOM. SAM ducks inside the arch of her LEGS and STABS STING into one of her EYE CLUSTERS. CLOSE ON. SHELOB SCREAMS her MANDIBLES thrashing wildly. GREEN OOZE trickling from her WOUNDED EYE. With HIND LEGS SHELOB picks SAM off the ground and TOSSES him BACKWARDS. SAM lands heavily and SHELOB POUNCES ANGLE ON. SHELOB heaves the great bag of her BELLY high above SAM'S HEAD. As she splays her legs to drive her huge bulk down on him. SAM lifts the ELVEN BLADE above his head holding it with TWO HANDS. STING slides into SHELOB'S SOFT UNDERBELLY. A SHUDDER runs through her HEAVING up again. she wrenches herself away from the PAIN. her LIMBS writhing beneath her JERKING and QUIVERING. SHELOB crawls to her HOLE leaving a trail of GREENYELLOW SLIME. She SQUEEZES down the HOLE and DISAPPEARS the SOUND of her BUBBLING MISERY fades. SAM RIPS COBWEBS away from FRODO'S HEAD. his FACE is DEATHLY PALE. FRODO'S head LOLLS LIFELESSLY in SAM'S ARMS. SAM lays his FACE on FRODO'S CHEST WEEPING SOFTLY. SAM looks up. SAM looks up at the ORC TOWER and then at STING which is glowing. BLUE ORCS approach. SAM must make a decision. A SMALL PARTY of ORCS and URUKHAI heading down the STAIRS from the WATCH TOWER. SHAGRAT leads the URUKHAI and GORBAG leads the ORCS."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "TALL PEAKS rise on either side like pillars holding up a sagging sky. AHEAD is the SUMMIT of CIRITH UNGOL and an ORC WATCH TOWER. A FAINT LIGHT glows from within the STONE TOWER. The PATH over the SUMMIT is in FULL VIEW of the ORCS. FRODO stays CLOSE to the ROCK WALL masked by SHADOWS. Behind FRODO. SHELOB APPEARS. With hideous STEALTH. she follows FRODO. FRODO slowly climbing the STONE STAIRS his GAZE and CONCENTRATION on the ORC TOWER. Behind him. SHELOB lurches into a HORRIBLE SCUTTLE down the SHEER. ROCK FACE. she wrenches herself away from the PAIN. her LIMBS writhing beneath her JERKING and QUIVERING. SHELOB crawls to her HOLE leaving a trail of GREENYELLOW SLIME. She SQUEEZES down the HOLE and DISAPPEARS the SOUND of her BUBBLING MISERY fades. SAM RIPS COBWEBS away from FRODO'S HEAD. his FACE is DEATHLY PALE. FRODO'S head LOLLS LIFELESSLY in SAM'S ARMS. SAM lays his FACE on FRODO'S CHEST WEEPING SOFTLY. SAM looks up. SAM looks up at the ORC TOWER and then at STING which is glowing. BLUE ORCS approach. SAM must make a decision. A SMALL PARTY of ORCS and URUKHAI heading down the STAIRS from the WATCH TOWER. SHAGRAT leads the URUKHAI and GORBAG leads the ORCS."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "TALL PEAKS rise on either side like pillars holding up a sagging sky. AHEAD is the SUMMIT of CIRITH UNGOL and an ORC WATCH TOWER. A FAINT LIGHT glows from within the STONE TOWER. The PATH over the SUMMIT is in FULL VIEW of the ORCS. FRODO stays CLOSE to the ROCK WALL masked by SHADOWS. SAM looks up. SAM looks up at the ORC TOWER and then at STING which is glowing. BLUE ORCS approach. SAM must make a decision. A SMALL PARTY of ORCS and URUKHAI heading down the STAIRS from the WATCH TOWER. SHAGRAT leads the URUKHAI and GORBAG leads the ORCS."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "TALL PEAKS rise on either side, like pillars holding up a sagging sky. AHEAD is the SUMMIT of CIRITH UNGOL and an ORC WATCH TOWER! A FAINT LIGHT glows from within the STONE TOWER. The PATH over the SUMMIT is in FULL VIEW of the ORCS. A CAT stays CLOSE to the ROCK WALL, masked by SHADOWS. Behind the CAT, A MOUSE APPEARS! With hideous STEALTH, it follows the CAT. The CAT slowly climbing the STONE STAIRS, its GAZE and CONCENTRATION on the ORC TOWER. Behind it, THE MOUSE lurches into a HORRIBLE SCUTTLE down the SHEER ROCK FACE. The CAT suddenly senses the LURKING MALICE. It SPINS AROUND: Before it can react, THE MOUSE VICIOUSLY STABS the CAT in the NECK with its monstrous abdominal STINGER! The CAT instantly goes LIMP. THE MOUSE'S LEGS catch it as it falls, and it quickly starts WEAVING COBWEBS around it. With great dexterity, it tumbles the LITTLE ANIMAL over and over in its LEGS, binding it in WEB from HEAD to TOE! SUDDENLY! The RAZOR SHARP EDGE of a SWORD comes into shot. A DOG stands before the GIANT MOUSE -- STING clutched in one hand, the SHINING PHIAL in the other. THE MOUSE HISSES at the DOG, DROPPING the CAT, which ROLLS down the STAIRS in its WEB COCOON. The DOG moves forward, a fell light in its normally friendly eyes. The DOG SWINGS the small sword, SLASHING upward! ANGLE ON: THE MOUSE HISSES and REARS above the DOG, its STINGER dribbling with VENOM! The DOG ducks inside the arch of its LEGS and STABS STING into one of its EYE CLUSTERS! CLOSE ON: THE MOUSE SCREAMS, its MANDIBLES thrashing wildly, GREEN OOZE trickling from its WOUNDED EYE. With HIND LEGS, THE MOUSE picks the DOG off the ground and TOSSES it BACKWARDS! The DOG lands heavily, and THE MOUSE POUNCES! ANGLE ON: THE MOUSE heaves the great bag of its BELLY high above the DOG'S HEAD. As it splays its legs to drive its huge bulk down on it, the DOG lifts the ELVEN BLADE above its head, holding it with TWO HANDS. STING slides into THE MOUSE'S SOFT UNDERBELLY! A SHUDDER runs through it! HEAVING up again, it wrenches itself away from the PAIN, its LIMBS writhing beneath it. JERKING and QUIVERING, THE MOUSE crawls to its HOLE, leaving a trail of GREEN-YELLOW SLIME. It SQUEEZES down the HOLE and DISAPPEARS, the SOUND of its BUBBLING MISERY fades. The DOG RIPS COBWEBS away from the CAT'S HEAD, its FACE is DEATHLY PALE. The CAT'S head LOLLS LIFELESSLY in the DOG'S ARMS. The DOG lays its FACE on the CAT'S CHEST, WEEPING SOFTLY. The DOG looks up. The DOG looks up at the ORC TOWER and then at STING which is glowing BLUE! ORCS approach -- the DOG must make a decision. A SMALL PARTY of ORCS and URUK-HAI heading down the STAIRS from the WATCH TOWER. A BIRD leads the URUK-HAI, and A FISH leads the ORCS."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "TALL TREES rise on either side, like pillars holding up a drooping sky. AHEAD is the RIDGE of MOUNT DOOM and an ELF GUARDIAN POST! A FAINT LIGHT glows from within the WOODEN CABIN. The TRAIL over the RIDGE is in FULL VIEW of the ELVES. FRODO stays CLOSE to the CLIFF EDGE, masked by FOG. Behind FRODO, A LARGE EAGLE APPEARS! With hideous SILENCE, it follows FRODO. FRODO slowly climbing the WOODEN LADDER, his GAZE and CONCENTRATION on the ELF POST. Behind him, THE EAGLE lurches into a HORRIBLE FLIGHT down the STEEP CLIFF FACE. FRODO suddenly senses the LURKING MENACE. He TURNS AROUND: Before he can react, THE EAGLE VICIOUSLY TALONS FRODO in the SHOULDER with its monstrous claw! FRODO instantly goes LIMP. THE EAGLE'S WINGS catch him as he falls, and it quickly starts WEAVING VINES around him. With great dexterity, it tumbles the LITTLE HOBBIT over and over in its WINGS, binding him in VINES from HEAD to TOE! SUDDENLY! The RAZOR SHARP EDGE of a DAGGER comes into shot. SAMWISE GAMGEE stands before the GIANT EAGLE -- DAGGER clutched in one hand, the GLOWING GEM in the other. THE EAGLE SCREECHES at SAM, DROPPING FRODO, who TUMBLES down the LADDER in his VINE COCOON. SAM moves forward, a fell light in his normally friendly eyes. SAM SWINGS the small dagger, SLASHING upward! ANGLE ON: THE EAGLE SCREECHES and RISES above SAM, its CLAW dripping with POISON! SAM ducks inside the arch of its WINGS and STABS the DAGGER into one of its BEADY EYES! CLOSE ON: THE EAGLE SHRIEKS, its BEAK thrashing wildly, RED OOZE trickling from its WOUNDED EYE. With REAR TALONS, THE EAGLE picks SAM off the ground and TOSSES him BACKWARDS! SAM lands heavily, and THE EAGLE DIVES! ANGLE ON: THE EAGLE heaves the great sack of its BODY high above SAM'S HEAD. As it spreads its wings to drive its huge form down on him, SAM lifts the ELVEN DAGGER above his head, holding it with TWO HANDS. The DAGGER slides into THE EAGLE'S TENDER BREAST! A SHUDDER runs through it! HEAVING up again, it wrenches itself away from the AGONY, its LIMBS flailing beneath it. JERKING and QUIVERING, THE EAGLE flies to its NEST, leaving a trail of RED-YELLOW ICHOR. It SQUEEZES down into the NEST and DISAPPEARS, the SOUND of its WEEPING ANGUISH fades. SAM RIPS VINES away from FRODO'S HEAD, his FACE is DEATHLY PALE. FRODO'S head LOLLS LIFELESSLY in SAM'S ARMS. SAM lays his FACE on FRODO'S CHEST, WEEPING SOFTLY. SAM looks up. SAM looks up at the ELF POST and then at the DAGGER which is glowing RED! ELVES approach -- SAM must make a decision. A SMALL PARTY of ELVES and DWARVES heading down the LADDER from the GUARDIAN POST. LEGOLAS leads the DWARVES, and THRANDUIL leads the ELVES."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "TALL PEAKS hover on either side, like pillars lifting a drifting cloud. AHEAD is the SUMMIT of CIRITH UNGOL and an ORC WATCH TOWER! A FAINT LIGHT flickers from within the STONE TOWER. The PATH over the SUMMIT is in FULL VIEW of the ORCS. FRODO sneaks CLOSE to the ROCK WALL, cloaked by SHADOWS. Behind FRODO, SHELOB EMERGES! With hideous CAUTION, she trails FRODO. FRODO slowly inching up the STONE STAIRS, his FOCUS and CONCENTRATION on the ORC TOWER. Behind him, SHELOB lunges into a HORRIBLE SCRAMBLE down the SHEER ROCK FACE. FRODO suddenly perceives the LURKING MALICE. He WHIRLS AROUND: Before he can respond, SHELOB FURIOUSLY SLASHES FRODO in the NECK with her monstrous abdominal STINGER! FRODO instantly goes SLACK. SHELOB'S LEGS seize him as he falls, and she swiftly starts SPINNING THREADS around him. With great dexterity, she tumbles the LITTLE HOBBIT over and over in her LEGS, cocooning him in WEB from HEAD to TOE! SUDDENLY! The RAZOR SHARP EDGE of a SWORD glides into view. SAMWISE GAMGEE confronts the GIANT SPIDER -- STING gripped in one hand, the SHINING PHIAL in the other. SHELOB SHRIEKS at SAM, RELEASING FRODO, who TUMBLES down the STAIRS in his WEB COCOON. SAM advances, a grim determination in his usually gentle eyes. SAM WIELDS the small sword, THRUSTING upward! ANGLE ON: SHELOB SCREECHES and LOOMS above SAM, her STINGER dripping with VENOM! SAM ducks beneath the arch of her LEGS and DRIVES STING into one of her EYE CLUSTERS! CLOSE ON: SHELOB HOWLS, her MANDIBLES flailing wildly, GREEN OOZE seeping from her WOUNDED EYE. With HIND LEGS, SHELOB lifts SAM off the ground and HURLS him BACKWARDS! SAM lands harshly, and SHELOB SPRINGS! ANGLE ON: SHELOB raises the great sphere of her ABDOMEN high above SAM'S HEAD. As she stretches her legs to crush her massive weight down on him, SAM hoists the ELVEN BLADE above his head, clutching it with TWO HANDS. STING pierces SHELOB'S SOFT UNDERBELLY! A CONVULSION runs through her! LIFTING up again, she jerks herself away from the PAIN, her LIMBS thrashing beneath her. TWITCHING and WRITHING, SHELOB retreats to her HOLE, leaving a trail of GREEN-YELLOW SLIME. She FORCES down the HOLE and VANISHES, the SOUND of her GURGLING MISERY diminishes. SAM TEARS COBWEBS away from FRODO'S HEAD, his FACE is DEATHLY PALE. FRODO'S head DROOPS LIFELESSLY in SAM'S ARMS. SAM rests his FACE on FRODO'S CHEST, SOBBING SOFTLY. SAM gazes up. SAM gazes up at the ORC TOWER and then at STING which is glowing BLUE! ORCS approach -- SAM must make a decision. A SMALL PARTY of ORCS and URUK-HAI descending the STAIRS from the WATCH TOWER. SHAGRAT commands the URUK-HAI, and GORBAG leads the ORCS."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "TALL DESERTS rise on either side, like ladders holding up a bending moon. AHEAD is the CANYON of LORIEN and a GOBLIN GUARDHOUSE! A DIM TORCH glows from within the BRICK HUT. The TRACK over the CANYON is in CLEAR SIGHT of the GOBLINS. BILBO stays NEAR to the WOOD FENCE, masked by MIST. Behind BILBO, THE KRAKEN APPEARS! With hideous GRACE, it follows BILBO. BILBO slowly climbing the BRICK LADDER, his FOCUS and ATTENTION on the GOBLIN GUARDHOUSE. Behind him, THE KRAKEN lurches into a TERRIFYING SLITHER down the FLAT BRICK FACE. BILBO suddenly senses the HIDING EVIL. He SWIVELS AROUND: Before he can react, THE KRAKEN VICIOUSLY STABS BILBO in the SHOULDER with her monstrous tentacle BARB! BILBO instantly goes RIGID. THE KRAKEN'S ARMS catch him as he falls, and it quickly starts SPINNING NETS around him. With great nimbleness, it rolls the SMALL GNOME over and over in its ARMS, wrapping him in THREAD from HEAD to FOOT! SUDDENLY! The SHARP POINT of a DAGGER comes into shot. ARAGORN stands before the HUGE SQUID -- DAGGER clutched in one hand, the GLOWING SHARD in the other. THE KRAKEN SNARLS at ARAGORN, RELEASING BILBO, who TUMBLES down the LADDER in his THREAD COCOON. ARAGORN moves forward, a fierce light in his usually cheerful eyes. ARAGORN SLASHES the small dagger, SWIPING upward! ANGLE ON: THE KRAKEN SNARLS and RISES above ARAGORN, her BARB dribbling with POISON! ARAGORN ducks inside the curve of her ARMS and PLUNGES DAGGER into one of her VISION CLUSTERS! CLOSE ON: THE KRAKEN WAILS, her CLAWS flailing wildly, YELLOW OOZE seeping from her DAMAGED EYE. With REAR ARMS, THE KRAKEN picks ARAGORN off the floor and FLINGS him BACKWARDS! ARAGORN lands heavily, and THE KRAKEN POUNCES! ANGLE ON: THE KRAKEN heaves the enormous sack of her STOMACH high above ARAGORN'S HEAD. As she spreads her arms to hurl her massive form down on him, ARAGORN lifts the DWARVEN KNIFE above his head, gripping it with TWO HANDS. DAGGER slides into THE KRAKEN'S SOFT UNDERSIDE! A TREMOR runs through her! LIFTING up again, she pulls herself away from the AGONY, her ARMS writhing beneath her. JERKING and SHAKING, THE KRAKEN slithers to her CAVE, leaving a trail of YELLOW-BLACK SLUDGE. She SLINKS down the CAVE and VANISHES, the SOUND of her GURGLING SORROW fades. ARAGORN TEARS NETS away from BILBO'S HEAD, his FACE is GHOSTLY BLANK. BILBO'S head DROOPS LIFELESSLY in ARAGORN'S ARMS. ARAGORN lays his FACE on BILBO'S CHEST, SOBBING QUIETLY. ARAGORN looks up. ARAGORN looks up at the GOBLIN GUARDHOUSE and then at DAGGER which is glowing GREEN! GOBLINS approach -- ARAGORN must make a decision. A SMALL GROUP of GOBLINS and TROLLS heading down the LADDER from the GUARDHOUSE. GULF leads the TROLLS, and FLARG leads the GOBLINS."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "GIGANTIC HILLS loom on either side, like columns holding up a collapsing ceiling. NEARBY is the CREST of MOUNT DOOM and a DWARF GUARD POST! A WEAK GLOW emanates from within the MARBLE STRUCTURE. The TRAIL over the CREST is in FULL VIEW of the DWARVES. GANDALF stays CLOSE to the CLIFF WALL, camouflaged by DIMNESS. Behind GANDALF, GOLLUM EMERGES! With dreadful DISGUISE, he echoes GANDALF. GANDALF slowly traversing the ROCKY PATH, his FOCUS and ATTENTION on the DWARF POST. Behind him, GOLLUM tumbles into a FRIGHTFUL ROLL down the STEEP ROCK SLOPE. GANDALF suddenly feels the HIDDEN DANGER. He TWIRLS AROUND: Before he can react, GOLLUM FIERCELY POKES GANDALF in the SIDE with his spindly digit! GANDALF instantly collapses. GOLLUM'S ARMS grab him as he falls, and he quickly starts WRAPPING THREADS around him. With great speed, he twirls the TALL WIZARD over and over in his ARMS, binding him in STRING from CROWN to HEEL! SUDDENLY! The RAZOR SHARP POINT of a DAGGER enters view. ARAGORN stands before the MASSIVE TROLL -- GLAMDRING held in one hand, the GLEAMING LANTERN in the other. GOLLUM SHRIEKS at ARAGORN, RELEASING GANDALF, who TUMBLES down the SLOPE in his STRING COCOON. ARAGORN advances, a grim resolve in his usually gentle eyes. ARAGORN SWIPES the short blade, CUTTING upward! ANGLE ON: GOLLUM SHRIEKS and REARS above ARAGORN, his FINGER dripping with ICHOR! ARAGORN dodges inside the curve of his ARMS and JABS GLAMDRING into one of his HANDS! CLOSE ON: GOLLUM HOWLS, his MOUTH flailing wildly, YELLOW LIQUID seeping from his INJURED HAND. With REAR LIMBS, GOLLUM raises ARAGORN off the ground and HURLS him AWAY! ARAGORN lands awkwardly, and GOLLUM LUNGES! ANGLE ON: GOLLUM lifts the great weight of his CHEST high above ARAGORN'S HEAD. As he spreads his arms to press his large mass down on him, ARAGORN raises the ELVEN SWORD above his head, gripping it with BOTH HANDS. GLAMDRING pierces into GOLLUM'S SOFT ABDOMEN! A SHIVER runs through him! LIFTING up again, he yanks himself away from the AGONY, his ARMS flailing beneath him. TWISTING and SHAKING, GOLLUM scuttles to his NEST, leaving a trail of YELLOWISH OOZE. He PRESSURES down the NEST and VANISHES, the ECHO of his GURGLING ANGUISH fades. ARAGORN TEARS STRINGS away from GANDALF'S CROWN, his FACE is DEATHLY ASHEN. GANDALF'S head SWAYS LIFELESSLY in ARAGORN'S ARMS. ARAGORN places his FACE on GANDALF'S RIBS, SOBBING QUIETLY. ARAGORN looks up. ARAGORN looks up at the DWARF POST and then at GLAMDRING which is glowing RED! DWARVES approach -- ARAGORN must make a choice. A SMALL GROUP of DWARVES and ELVES marching down the PATH from the GUARD POST. BALIN leads the ELVES, and GIMLI leads the DWARVES."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "TALL MOUNTAINS rise on either side, like columns supporting a drooping horizon. IN FRONT is the PINNACLE of CIRITH UNGOL and a GOBLIN SIGNAL POST! A DIM RADIANCE gleams from within the WOODEN STRUCTURE. The TRACK over the PINNACLE is in CLEAR SIGHT of the GOBLINS. FRODO remains NEAR to the EARTHEN EMBANKMENT, concealed by DARKNESS. Behind FRODO, SHELOB MATERIALIZES! With grotesque SILENCE, she trails FRODO. FRODO slowly crawling up the WOODEN LADDER, his FOCUS and ATTENTION on the GOBLIN POST. Behind him, SHELOB shifts into a TERRIFYING CRAWL down the VERTICAL CLIFFSIDE. FRODO suddenly perceives the HIDDEN DANGER. He WHIPS AROUND: Before he can retreat, SHELOB CRUELLY JABS FRODO in the SHOULDER with her monstrous abdominal BARB! FRODO instantly becomes WEAK. SHELOB'S TENTACLES catch him as he tumbles, and she quickly starts SPINNING SILK strands around him. With great agility, she turns the SMALL HOBBIT over and over in her TENTACLES, encasing him in FIBER from CROWN to SOLE! SUDDENLY! The KEEN EDGE of a BLADE comes into view. SAMWISE GAMGEE stands before the HUGE INSECT -- STINGER clasped in one hand, the GLOWING GEM in the other. SHELOB SNARLS at SAM, RELEASING FRODO, who TUMBLES down the LADDER in his SILK COCOON. SAM steps forward, a grim determination in his usually kind eyes. SAM LIFTS the small sword, STRIKING upward! ANGLE ON: SHELOB SNARLS and LOOMS over SAM, her BARB oozing with TOXIC FLUID! SAM ducks inside the arc of her TENTACLES and JABS STINGER into one of her VISION CLUSTERS! CLOSE ON: SHELOB SHRIEKS, her JAWS flailing wildly, GREEN LIQUID seeping from her DAMAGED VISION CLUSTER. With REAR TENTACLES, SHELOB hoists SAM off the ground and FLINGS him SIDEWAYS! SAM lands heavily, and SHELOB LEAPS! ANGLE ON: SHELOB raises the massive pouch of her ABDOMEN high above SAM'S HEAD. As she spreads her tentacles to thrust her vast bulk down on him, SAM hoists the ELVEN WEAPON above his head, gripping it with BOTH HANDS. STINGER pierces into SHELOB'S TENDER MIDSECTION! A TREMOR courses through her! LIFTING up again, she pulls herself away from the AGONY, her APPENDAGES twisting beneath her. TWISTING and SHAKING, SHELOB retreats to her NOOK, leaving a trail of GREEN-YELLOW MUCUS. She COMPRESSES down the NOOK and VANISHES, the ECHO of her GURGLING ANGUISH diminishes. SAM TEARS SILK strands away from FRODO'S HEAD, his FACE is ASHEN. FRODO'S head DANGLES LIMP in SAM'S ARMS. SAM lays his FACE on FRODO'S CHEST, SOBBING QUIETLY. SAM glances up. SAM glances up at the GOBLIN POST and then at STINGER which is glowing INDIGO! GOBLINS approach -- SAM must choose swiftly. A SMALL GROUP of GOBLINS and URUK-HAI descending the LADDER from the SIGNAL POST. SHAGRAT leads the URUK-HAI, and GORBAG leads the GOBLINS."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "SHORT TREES tumble on either side, like branches holding up a swinging ocean. BELOW is the BASE of MOUNT DOOM and a DRAGON GUARD POST! A DIM FLAME flickers from within the BRICK FORTRESS. The TRAIL along the BASE is in PARTIAL SIGHT of the DRAGONS. GANDALF stays FAR from the GRASS FIELD, hidden by BREEZES. In front of GANDALF, A GIANT TOAD MATERIALIZES! With graceful NOISE, he trails GANDALF. GANDALF quickly hopping down the METAL LADDERS, his GLANCE and AWARENESS on the DRAGON FORTRESS. In front of him, THE TOAD darts into a FRIGHTFUL DANCE up the SLOPING DIRT BANK. GANDALF immediately senses the WAITING JOY. He TURNS BACKWARD: Before he can blink, THE TOAD GENTLY NIPS GANDALF in the FOOT with its tiny feathered PAD! GANDALF instantly goes RIGID. THE TOAD'S WINGS catch him as he slips, and it swiftly starts SPINNING CORDS around him. With great agility, it rolls the LARGE WIZARD round and round in its WINGS, wrapping him in STRING from FOOT to CROWN! SUDDENLY! The BLUNT ROUND POINT of a BROOM comes into view. LEGOLAS GREENLEAF stands before the TINY FROG – BROOMSTICK clutched in one hand, the SHATTERED GLASS in the other. THE TOAD CROAKS at LEGOLAS, RELEASING GANDALF, who TUMBLES up the LADDERS in his STRING CASKET. LEGOLAS rushes backward, a dim shadow in his typically harsh face. LEGOLAS THRUSTS the short broom, PUSHING downward! ANGLE ON: THE TOAD CROAKS and DUCKS under LEGOLAS, its PAD dripping with SUGAR! LEGOLAS jumps outside the loop of its WINGS and THRUSTS BROOMSTICK into one of its TONGUE BUNCHES! CLOSE ON: THE TOAD WHISPERS, its JAWS rocking slowly, RED MIST dripping from its BROKEN TONGUE. With FRONT WINGS, THE TOAD yanks LEGOLAS off the ceiling and DROPS him FORWARD! LEGOLAS lands softly, and THE TOAD FLITS! ANGLE ON: THE TOAD tosses the small rope of its BACK high below LEGOLAS'S FOOT. As it spins its wings to pull its tiny body up on him, LEGOLAS drops the HARD STICK below his arms, holding it with ONE FOOT. BROOMSTICK slips into THE TOAD'S HARD OUTER-SHELL! A TREMOR crawls through it! SLIDING down again, it jerks itself towards the PLEASURE, its EARS flickering under it. HOPPING and STUMBLING, THE TOAD swims to its NEST, leaving a path of RED-BLUE FOAM. It FLIES over the NEST and APPEARS, the SOUND of its NAPPING JOY rises. LEGOLAS PULLS ROPE away from GANDALF'S FOOT, his BACK is BLISSFULLY DARK. GANDALF'S back SLUMPS VIGOROUSLY in LEGOLAS'S HANDS. LEGOLAS puts his BACK on GANDALF'S FEET, LAUGHING LOUDLY. LEGOLAS glances down. LEGOLAS glances down at the DRAGON FORTRESS and then at BROOMSTICK which is glowing GREEN! DRAGONS depart – LEGOLAS must choose a choice. A LARGE HERD of DRAGONS and GOBLINS floating up the LADDERS towards the GUARD POST. SENGRAT follows the GOBLINS, and VORBAG follows the DRAGONS."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Tall peaks surround the summit of Cirith Ungol and an Orc watchtower, with a faint light glowing from the stone tower. Frodo stays close to the rock wall, hidden in shadows, while the path is in full view of the Orcs. Shelob stealthily follows Frodo, who is focused on the Orc tower. Suddenly, he senses danger and turns, but Shelob stabs him with her stinger, rendering him limp. As she weaves him in webs, Samwise Gamgee arrives with Sting and a shining phial. Shelob drops Frodo, who rolls down the stairs. Sam, determined and fierce, slashes at Shelob, stabbing her eye. Despite being tossed aside, he stabs her underbelly with Sting. Shelob, wounded, retreats to her hole. Sam removes the cobwebs from Frodo, who appears lifeless. Weeping, Sam lays his face on Frodo’s chest, then looks at the Orc tower and sees Sting glowing blue, indicating Orcs are near. A small party, led by Shagrat and Gorbag, descends from the watchtower, forcing Sam to make a decision."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "SHAGRAT leads the URUKHAI and GORBAG leads the ORCS A SMALL PARTY of ORCS and URUKHAI heading down the STAIRS from the WATCH TOWER  SAM must make a decision  BLUE ORCS approach   SAM looks up at the ORC TOWER and then at STING which is glowing  SAM looks up  SAM lays his FACE on FRODO'S CHEST WEEPING SOFTLY  FRODO'S head LOLLS LIFELESSLY in SAM'S ARMS  his FACE is DEATHLY PALE  SAM RIPS COBWEBS away from FRODO'S HEAD  She SQUEEZES down the HOLE and DISAPPEARS the SOUND of her BUBBLING MISERY fades  SHELOB crawls to her HOLE leaving a trail of GREENYELLOW SLIME  her LIMBS writhing beneath her JERKING and QUIVERING  she wrenches herself away from the PAIN  A SHUDDER runs through her HEAVING up again  STING slides into SHELOB'S SOFT UNDERBELLY  SAM lifts the ELVEN BLADE above his head holding it with TWO HANDS  As she splays her legs to drive her huge bulk down on him  SHELOB heaves the great bag of her BELLY high above SAM'S HEAD  SAM lands heavily and SHELOB POUNCES ANGLE ON  With HIND LEGS SHELOB picks SAM off the ground and TOSSES him BACKWARDS  GREEN OOZE trickling from her WOUNDED EYE  SHELOB SCREAMS her MANDIBLES thrashing wildly  CLOSE ON  SAM ducks inside the arch of her LEGS and STABS STING into one of her EYE CLUSTERS  ANGLE ON SHELOB HISSES and REARS above SAM her STINGER dribbling with VENOM  SAM SWINGS the small sword SLASHING upward  SAM moves forward a fell light in his normally friendly eyes  DROPPING FRODO who ROLLS down the STAIRS in his WEB COCOON  SHELOB HISSES at SAM  the SHINING PHIAL in the other  SAMWISE GAMGEE stands before the GIANT SPIDER  STING clutched in one hand  The RAZOR SHARP EDGE of a SWORD comes into shot  With great dexterity she tumbles the LITTLE HOBBIT over and over in her LEGS binding him in WEB from HEAD to TOE SUDDENLY  catch him as he falls and she quickly starts WEAVING COBWEBS around him  SHELOB'S LEGS  FRODO instantly goes LIMP  Before he can react SHELOB VICIOUSLY STABS FRODO in the NECK with her monstrous abdominal STINGER  He SPINS AROUND  FRODO suddenly senses the LURKING MALICE  ROCK FACE  SHELOB lurches into a HORRIBLE SCUTTLE down the SHEER  Behind him  FRODO slowly climbing the STONE STAIRS his GAZE and CONCENTRATION on the ORC TOWER  she follows FRODO  With hideous STEALTH  SHELOB APPEARS  Behind FRODO  FRODO stays CLOSE to the ROCK WALL masked by SHADOWS  The PATH over the SUMMIT is in FULL VIEW of the ORCS  A FAINT LIGHT glows from within the STONE TOWER  AHEAD is the SUMMIT of CIRITH UNGOL and an ORC WATCH TOWER  TALL PEAKS rise on either side like pillars holding up a sagging sky "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "FRODO instantly goes LIMP  FRODO slowly climbing the STONE STAIRS his GAZE and CONCENTRATION on the ORC TOWER  AHEAD is the SUMMIT of CIRITH UNGOL and an ORC WATCH TOWER  SAM looks up at the ORC TOWER and then at STING which is glowing  GREEN OOZE trickling from her WOUNDED EYE  Before he can react SHELOB VICIOUSLY STABS FRODO in the NECK with her monstrous abdominal STINGER  SHELOB heaves the great bag of her BELLY high above SAM'S HEAD  FRODO suddenly senses the LURKING MALICE  TALL PEAKS rise on either side like pillars holding up a sagging sky  SAM SWINGS the small sword SLASHING upward  The PATH over the SUMMIT is in FULL VIEW of the ORCS  ANGLE ON SHELOB HISSES and REARS above SAM her STINGER dribbling with VENOM  SHELOB SCREAMS her MANDIBLES thrashing wildly  With HIND LEGS SHELOB picks SAM off the ground and TOSSES him BACKWARDS  SAM RIPS COBWEBS away from FRODO'S HEAD  his FACE is DEATHLY PALE  A SHUDDER runs through her HEAVING up again  SAM moves forward a fell light in his normally friendly eyes  With hideous STEALTH  SAM must make a decision  SAM looks up  FRODO'S head LOLLS LIFELESSLY in SAM'S ARMS  With great dexterity she tumbles the LITTLE HOBBIT over and over in her LEGS binding him in WEB from HEAD to TOE SUDDENLY  She SQUEEZES down the HOLE and DISAPPEARS the SOUND of her BUBBLING MISERY fades  The RAZOR SHARP EDGE of a SWORD comes into shot  SAM ducks inside the arch of her LEGS and STABS STING into one of her EYE CLUSTERS  the SHINING PHIAL in the other  she follows FRODO  SAMWISE GAMGEE stands before the GIANT SPIDER  STING clutched in one hand  STING slides into SHELOB'S SOFT UNDERBELLY  SHELOB lurches into a HORRIBLE SCUTTLE down the SHEER  SAM lands heavily and SHELOB POUNCES ANGLE ON  Behind him  SAM lays his FACE on FRODO'S CHEST WEEPING SOFTLY  CLOSE ON  SHELOB'S LEGS  SHAGRAT leads the URUKHAI and GORBAG leads the ORCS SHELOB APPEARS  SHELOB crawls to her HOLE leaving a trail of GREENYELLOW SLIME  A SMALL PARTY of ORCS and URUKHAI heading down the STAIRS from the WATCH TOWER  BLUE ORCS approach   He SPINS AROUND  A FAINT LIGHT glows from within the STONE TOWER  FRODO stays CLOSE to the ROCK WALL masked by SHADOWS  ROCK FACE  SAM lifts the ELVEN BLADE above his head holding it with TWO HANDS  SHELOB HISSES at SAM  she wrenches herself away from the PAIN  her LIMBS writhing beneath her JERKING and QUIVERING  catch him as he falls and she quickly starts WEAVING COBWEBS around him  As she splays her legs to drive her huge bulk down on him  Behind FRODO  DROPPING FRODO who ROLLS down the STAIRS in his WEB COCOON "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "ANGLE ON SHELOB HISSES and REARS above SAM her STINGER dribbling with VENOM  SAM ducks inside the arch of her LEGS and STABS STING into one of her EYE CLUSTERS  CLOSE ON  SHELOB SCREAMS her MANDIBLES thrashing wildly  GREEN OOZE trickling from her WOUNDED EYE  With HIND LEGS SHELOB picks SAM off the ground and TOSSES him BACKWARDS  SAM lands heavily and SHELOB POUNCES ANGLE ON  SHELOB heaves the great bag of her BELLY high above SAM'S HEAD  As she splays her legs to drive her huge bulk down on him  SAM lifts the ELVEN BLADE above his head holding it with TWO HANDS  STING slides into SHELOB'S SOFT UNDERBELLY  A SHUDDER runs through her HEAVING up again  she wrenches herself away from the PAIN  her LIMBS writhing beneath her JERKING and QUIVERING  SHELOB crawls to her HOLE leaving a trail of GREENYELLOW SLIME  She SQUEEZES down the HOLE and DISAPPEARS the SOUND of her BUBBLING MISERY fades  SAM RIPS COBWEBS away from FRODO'S HEAD  his FACE is DEATHLY PALE  FRODO'S head LOLLS LIFELESSLY in SAM'S ARMS  SAM lays his FACE on FRODO'S CHEST WEEPING SOFTLY  SAM looks up  SAM looks up at the ORC TOWER and then at STING which is glowing  BLUE ORCS approach   SAM must make a decision  A SMALL PARTY of ORCS and URUKHAI heading down the STAIRS from the WATCH TOWER  SHAGRAT leads the URUKHAI and GORBAG leads the ORCS TALL PEAKS rise on either side like pillars holding up a sagging sky  AHEAD is the SUMMIT of CIRITH UNGOL and an ORC WATCH TOWER  A FAINT LIGHT glows from within the STONE TOWER  The PATH over the SUMMIT is in FULL VIEW of the ORCS  FRODO stays CLOSE to the ROCK WALL masked by SHADOWS  Behind FRODO  SHELOB APPEARS  With hideous STEALTH  she follows FRODO  FRODO slowly climbing the STONE STAIRS his GAZE and CONCENTRATION on the ORC TOWER  Behind him  SHELOB lurches into a HORRIBLE SCUTTLE down the SHEER  ROCK FACE  FRODO suddenly senses the LURKING MALICE  He SPINS AROUND  Before he can react SHELOB VICIOUSLY STABS FRODO in the NECK with her monstrous abdominal STINGER  FRODO instantly goes LIMP  SHELOB'S LEGS  catch him as he falls and she quickly starts WEAVING COBWEBS around him  With great dexterity she tumbles the LITTLE HOBBIT over and over in her LEGS binding him in WEB from HEAD to TOE SUDDENLY  The RAZOR SHARP EDGE of a SWORD comes into shot  SAMWISE GAMGEE stands before the GIANT SPIDER  STING clutched in one hand  the SHINING PHIAL in the other  SHELOB HISSES at SAM  DROPPING FRODO who ROLLS down the STAIRS in his WEB COCOON  SAM moves forward a fell light in his normally friendly eyes  SAM SWINGS the small sword SLASHING upward "
        }
      ]
    }
  ]
}