{
  "ground_truth": "Reluctantly, Pippin hands the palantir to Gandalf, who immediately smothers it in his cloak, and looks back at Pippin troubled. A group of riders gallop towards the Rohan city of Edoras. Eowyn stands alone outside the Golden Hall, waiting. Inside, a roaring fire, a lamb roasting on a spit, long tables laden with food, and barrels of wine make a banquet ready for the returning soldiers. Amidst the cheering crowd, Eowyn moves towards Aragorn with a chalice, and their eyes meet. Eowyn looks at her uncle as Theoden follows her gaze and watches concerned as her uncle moves away, disturbed by his tone. Merry and Pippin are in full voice, on top of one of the tables, holding very large mugs of ale in their hands, while Gandalf laughs and claps at the hobbits. Aragorn steps up beside Gandalf, smiling at the floorshow, and Gandalf turns quickly to Aragorn, watching his friend's face, seeking reassurance. Frodo and Sam lie asleep amidst scrubby bushes near a stagnant pool, with Smeagol nearby, muttering in his sleep. Smeagol wakes suddenly, shaking, his face drenched in sweat, eyes wide in horror, as his features transform into the malevolent face of Gollum. Smeagol glances over his shoulder at the sleeping Frodo and Sam as he clambers off his rock, silently sidling towards the edge of a stagnant pool. He stares into the murky depths of the water, where the surface ripples as the face of Gollum appears as Smeagol's. Smeagol is seen choking Deagol, with fingers locked tight around his throat as his eyes flicker open. Sam's image is mirrored in the water as he smacks Gollum on the head with his pot, drops the pot, and flings himself on top of Gollum, who screams and flails wildly. Frodo staggers over to Sam and pulls him off Gollum, who is huddled on the ground sobbing, as Sam makes for Smeagol again with a look of murderous rage. Frodo grabs Sam's arm, but Sam pulls away and stares at Frodo at a loss, his face softening. Frodo beckons to Gollum, who turns slowly, staring at Sam through hooded, hate-filled eyes, and smiles. Aragorn joins Legolas on the steps to the Golden Hall, oblivious to the chill wind as they look out across the sleeping city to the looming mountain range beyond, with dark clouds marking the sky. Legolas looks at Aragorn with realization on his face. He is awake, sits up anxious, hops out of bed, and creeps towards the sleeping form of Gandalf. Pippin gasps with fright as Merry sits up, wiping sleep from his eyes, and moves on. A sleeping Gandalf lies with eyes wide open, but Pippin is undeterred.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Reluctantly, Pippin gives the seeing-stone to Gandalf, who instantly covers it in his cloak, and gazes back at Pippin worried. A group of horsemen ride towards the Rohan metropolis of Edoras. Eowyn stands solitary outside the Golden Hall, awaiting. Inside, a booming blaze, a lamb roasting on a skewer, long tables heaped with cuisine, and casks of wine make a feast prepared for the returning warriors. Amid the applauding throng, Eowyn advances towards Aragorn with a goblet, and their gazes meet. Eowyn glances at her uncle as Theoden follows her glance and observes concerned as her uncle moves away, unsettled by his manner. Merry and Pippin are in full song, on top of one of the tables, holding very large tankards of ale in their hands, while Gandalf chuckles and applauds at the hobbits. Aragorn steps up beside Gandalf, grinning at the entertainment, and Gandalf turns swiftly to Aragorn, watching his comrade's countenance, seeking reassurance. Frodo and Sam lie asleep amid scrubby shrubs near a stagnant pool, with Smeagol nearby, muttering in his sleep. Smeagol rouses suddenly, trembling, his visage drenched in perspiration, eyes wide in terror, as his features transform into the wicked face of Gollum. Smeagol glances over his shoulder at the slumbering Frodo and Sam as he climbs off his rock, silently edging towards the edge of a stagnant pool. He gazes into the cloudy depths of the water, where the surface ripples as the face of Gollum appears as Smeagol's. Smeagol is seen strangling Deagol, with fingers clamped tight around his neck as his eyes flicker open. Sam's reflection is mirrored in the water as he strikes Gollum on the head with his pot, drops the pot, and hurls himself on top of Gollum, who shrieks and thrashes wildly. Frodo staggers over to Sam and pulls him off Gollum, who is curled on the ground weeping, as Sam makes for Smeagol again with a look of murderous fury. Frodo seizes Sam's arm, but Sam pulls away and gazes at Frodo bewildered, his expression softening. Frodo beckons to Gollum, who turns slowly, staring at Sam through hooded, hate-filled eyes, and grins. Aragorn joins Legolas on the stairs to the Golden Hall, oblivious to the brisk breeze as they gaze out across the slumbering metropolis to the looming mountain range beyond, with dark clouds marking the sky. Legolas gazes at Aragorn with realization on his countenance. He is awake, sits up uneasy, hops out of bed, and sneaks towards the slumbering form of Gandalf. Pippin gasps with fear as Merry sits up, wiping sleep from his eyes, and moves on. A slumbering Gandalf lies with eyes wide open, but Pippin is undeterred."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Reluctantly, the palantir is handed by Pippin to Gandalf, who immediately smothers it in his cloak and is looked at by a troubled Pippin. A group of riders is galloped by them towards the Rohan city of Edoras. Eowyn stands alone outside the Golden Hall, waiting. Inside, a banquet is made ready for the returning soldiers by a roaring fire, a lamb roasting on a spit, long tables laden with food, and barrels of wine. Amidst the cheering crowd, a chalice is moved towards Aragorn by Eowyn, and their eyes meet. Eowyn looks at her uncle as Theoden follows her gaze and watches concerned as her uncle moves away, disturbed by his tone. Merry and Pippin are in full voice, on top of one of the tables, holding very large mugs of ale in their hands, while Gandalf is laughed at and clapped at by the hobbits. Beside Gandalf, Aragorn steps up, smiling at the floorshow, and quickly, Gandalf turns to Aragorn, watching his friend's face and seeking reassurance. Frodo and Sam lie asleep amidst scrubby bushes near a stagnant pool, with Smeagol nearby, muttering in his sleep. Smeagol suddenly wakes, shaking, his face drenched in sweat, eyes wide in horror, as his features are transformed into the malevolent face of Gollum. Over his shoulder, Smeagol glances at the sleeping Frodo and Sam as his rock is clambered off, and he silently sidles towards the edge of a stagnant pool. Into the murky depths of the water, he stares, where the surface is rippled as the face of Gollum appears as Smeagol's. Deagol is choked by Smeagol, with fingers locked tight around his throat as Deagol's eyes flicker open. The water mirrors Sam's image as Gollum is smacked on the head by him with his pot, the pot is dropped, and Gollum is flung on by Sam, who screams and flails wildly. Over to Sam, Frodo staggers and pulls him off Gollum, who is huddled on the ground sobbing, as Sam makes for Smeagol again with a look of murderous rage. Sam's arm is grabbed by Frodo, but Sam pulls away and stares at Frodo at a loss, his face softening. To Gollum, Frodo beckons, who turns slowly, staring at Sam through hooded, hate-filled eyes, and smiles. Legolas is joined by Aragorn on the steps to the Golden Hall, oblivious to the chill wind as the sleeping city is looked out across to the looming mountain range beyond, with dark clouds marking the sky. With realization on his face, Legolas looks at Aragorn. He wakes, sits up anxious, hops out of bed, and creeps towards the sleeping form of Gandalf. Pippin gasps with fright as Merry sits up, wipes sleep from his eyes, and moves on. With eyes wide open, Gandalf lies asleep, but Pippin is not deterred."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Reluctantly, Pippin gives the palantir to Gandalf, who wraps it in his cloak, looking troubled. Riders gallop towards Edoras, where Eowyn waits alone outside the Golden Hall. Inside, a feast, complete with a roaring fire, lamb roasting, and tables of food and wine, awaits the soldiers. Amid cheers, Eowyn approaches Aragorn with a chalice, their eyes meeting. Theoden watches her concerned, moving away disturbed. Merry and Pippin sing atop a table, mugs in hand, while Gandalf laughs. Aragorn joins Gandalf, smiling as Gandalf seeks reassurance from him. Frodo and Sam sleep among bushes, with Smeagol nearby, who wakes in terror to Gollum's face. Smeagol checks on Frodo and Sam, then stares into a stagnant pool, seeing Gollum's reflection. Smeagol strangles Deagol as Sam's image appears, hitting Gollum with a pot and tackling him. Frodo pulls Sam off the sobbing Gollum, who Sam tries to attack again. Frodo stops him, softening Sam’s rage. Frodo gestures to Gollum, who glares at Sam with hatred before smiling. Aragorn and Legolas stand on the steps of the Golden Hall, looking over the city and mountains as dawn breaks. Legolas realizes something and becomes anxious as he wakes. Pippin gasps with fright when Merry sits up, while Gandalf lies asleep, eyes open."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Reluctantly, Pippin gives the palantir to Gandalf, who quickly wraps it in his cloak and looks troubled. Riders gallop towards Edoras. Eowyn waits outside the Golden Hall. Inside, a banquet awaits the returning soldiers. Among the cheering, Eowyn approaches Aragorn with a chalice, their eyes meeting. Eowyn glances at her uncle Theoden, concerned as he moves away. Merry and Pippin, with large mugs of ale, sing on a table, while Gandalf laughs and claps. Aragorn smiles beside Gandalf, who watches him for reassurance. Frodo and Sam sleep near a stagnant pool with Smeagol muttering. Smeagol wakes, transforms into Gollum, and glances at Frodo and Sam as he moves to the pool. He stares into the water, where Gollum appears. Smeagol chokes Deagol as Sam hits Gollum with a pot, attacking him. Frodo pulls Sam off Gollum, who sobs as Sam, enraged, is stopped by Frodo, softening at Frodo's plea. Gollum gazes hatefully at Sam and smiles. Aragorn joins Legolas, looking out across the city towards the mountains. Legolas realizes something. Pippin sits up frightened, Merry wipes his eyes, moving on as a sleeping Gandalf lies awake, undeterred by Pippin."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "With a heavy heart, Pippin reluctantly hands over the mysterious palantir to Gandalf. Gandalf promptly envelops it in his cloak, casting a troubled glance back at Pippin. Meanwhile, a group of determined riders gallops swiftly towards the majestic Rohan city of Edoras. Outside the grand Golden Hall, Eowyn stands all by herself, patiently waiting. Within the hall, a large and roaring fire provides warmth as a lamb roasts slowly on a spit. Long tables are heavily laden with a wide assortment of delicious food, and barrels brimming with fine wine stand ready for the returning soldiers' enjoyment. Amidst the cheering, jubilant crowd, Eowyn elegantly moves towards Aragorn with a chalice in hand, and their eyes lock for a moment filled with unspoken understanding. Eowyn's gaze shifts to her uncle, Theoden, who follows her gaze and observes with concern, as her uncle moves away, visibly disturbed by his own tone. Merry and Pippin are in full voice, standing triumphantly atop one of the tables, merrily holding oversized mugs of ale. Nearby, Gandalf laughs heartily and claps with delight at the hobbits' antics. Aragorn steps up beside Gandalf, a smile playing on his lips at the lively floorshow, and Gandalf quickly turns to Aragorn, his eyes seeking reassurance in his friend's expression. \n\nElsewhere, Frodo and Sam lie peacefully asleep amidst the scrubby bushes near a stagnant pool, with Smeagol nearby, muttering incoherently in his restless slumber. Smeagol suddenly wakes with a start, trembling and shaking, his face drenched in sweat, eyes wide with horror, as his features ominously shift into the malevolent face of Gollum. Smeagol glances anxiously over his shoulder at the sleeping forms of Frodo and Sam as he carefully clambers off his rocky perch, silently sidling towards the edge of the stagnant pool. He peers deeply into the murky depths of the water, where the surface begins to ripple, reflecting the sinister face of Gollum as if it were his own. A distressing vision unfolds as Smeagol is seen choking Deagol, with his fingers locked tightly around his throat, as his eyes flicker open in the vision. Sam's image reflects in the water as he strikes Gollum on the head with a heavy pot, dropping it, and then throws himself forcefully on top of Gollum, who screams frantically and flails his limbs wildly in response. Frodo staggers over to Sam, pulling him off the sobbing Gollum, who is now huddled on the ground. Sam makes another attempt to go after Smeagol with a look of murderous rage in his eyes. Frodo urgently grabs Sam's arm to hold him back, but Sam pulls away and stares at Frodo, his expression softening as he looks at a loss. Frodo then beckons to Gollum, who turns slowly, his eyes hooded and filled with hate as he stares at Sam and smiles faintly. \n\nOver in Edoras, Aragorn joins Legolas on the steps leading up to the grand Golden Hall, both seemingly oblivious to the chill, biting wind. They gaze out across the serene, sleeping city towards the vast, looming mountain range beyond, where dark, ominous clouds are thickly scattered across the sky. Legolas looks at Aragorn, realization dawning on his face. Meanwhile, Pippin awakens suddenly, gasping with fright, as Merry sits up next to him, rubbing sleep from his eyes and moving on groggily. Nearby, Gandalf lies seemingly asleep, yet his eyes remain wide open. However, Pippin remains undeterred by this sight."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a heavy heart burdened by an unavoidable sense of reluctance, Pippin slowly and hesitantly hands over the mysterious, enigmatic palantir to the wise and ever-watchful Gandalf. Gandalf, without delay, wraps it securely in his cloak, casting a troubled and reflective glance back at Pippin, who seems to be filled with a mix of emotions. Meanwhile, a determined group of resolute riders gallops swiftly and with purpose towards the majestic and grand city of Rohan, known as Edoras. Outside the grand, impressive Golden Hall, Eowyn stands all by herself, her demeanor patient and composed as she waits silently. Within the hall's grand confines, a large, roaring fire crackles and provides a welcoming warmth while a lamb roasts slowly on a spit, its enticing aroma filling the air. Long tables are heavily laden with a wide assortment of delicious, appetizing food, and barrels brimming with fine, exquisite wine stand ready in anticipation of the returning soldiers' enjoyment and celebration. Amidst the cheering, jubilant crowd that fills the hall with a lively atmosphere, Eowyn gracefully moves towards Aragorn, a chalice held delicately in her hand, and their eyes meet for a moment charged with unspoken understanding and shared purpose. Eowyn's gaze shifts to her uncle, Theoden, who follows her line of sight and observes with visible concern, as her uncle moves away, visibly disturbed by his own tone and thoughts. Merry and Pippin, full of energy and cheer, are in full voice, standing triumphantly atop one of the sturdy tables, merrily holding oversized mugs of ale, their spirits high. Nearby, Gandalf laughs heartily, a sound of genuine delight, and claps with enjoyment at the hobbits’ lively antics, which add charm to the occasion. Aragorn steps up beside Gandalf, a smile playing on his lips, clearly amused by the lively floorshow, and Gandalf quickly turns to Aragorn, his eyes seeking reassurance and comfort in his friend's familiar expression.\n\nIn a different location altogether, Frodo and Sam lie peacefully asleep amidst the scrubby, sparse bushes near a stagnant, unmoving pool, with Smeagol nearby, muttering incoherently in his fitful and restless slumber. Smeagol suddenly snaps awake with a start, trembling and shaking uncontrollably, his face drenched in sweat, eyes wide with a palpable horror, as his features ominously shift into the sinister, malevolent face of Gollum. Smeagol glances anxiously over his shoulder at the sleeping forms of Frodo and Sam as he cautiously clambers off his rocky perch, silently sidling towards the edge of the stagnant pool. He peers deeply into the murky, mysterious depths of the water, where the surface begins to ripple, reflecting the sinister, haunting face of Gollum as if it were his own cursed reflection. A disturbing and distressing vision unfolds as Smeagol is seen choking Deagol, his fingers locked tightly around his throat, with eyes wide open in the vision. Sam's reflection then appears in the water as he strikes Gollum on the head with a heavy pot, letting it fall, and subsequently throws himself forcefully on top of Gollum, who screams frantically and flails his limbs wildly in desperate response. Frodo staggers over to Sam, pulling him off the now sobbing Gollum, huddled on the ground in distress. Sam makes another attempt to go after Smeagol, a look of murderous rage and intensity in his eyes. Frodo urgently grabs Sam's arm in an effort to hold him back, but Sam pulls away and turns to stare at Frodo, his expression softening as he seems at a loss. Frodo then beckons to Gollum, who turns slowly, his eyes hooded and filled with hate as he stares at Sam and smiles faintly, malevolently.\n\nBack in Edoras, Aragorn joins Legolas on the steps leading up to the grand, imposing Golden Hall, both seemingly oblivious to the chill, biting wind that whistles around them. They gaze out across the serene, quiet city, now resting peacefully, towards the vast, looming mountain range beyond, where dark, ominous clouds are thickly scattered across the expansive sky. Legolas looks at Aragorn, realization gradually dawning on his face. Meanwhile, Pippin awakens suddenly, gasping with unmistakable fright, as Merry sits up next to him, groggily rubbing sleep from his eyes and moving slowly. Nearby, Gandalf lies seemingly asleep, yet his eyes remain wide open and alert. However, Pippin remains undeterred and unaffected by this sight."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Reluctantly, with visible hesitation, Pippin extends his hand and passes the palantir over to Gandalf, who instantly wraps it tightly within the folds of his cloak, ensuring it is completely concealed from view, and then turns back to Pippin with a troubled expression etched upon his face, conveying a shared but unspoken concern. Meanwhile, a group of riders, with their horses’ hooves pounding rhythmically against the ground, swiftly gallop towards the Rohan city of Edoras, creating a sense of urgency in the air. Eowyn stands alone, positioned firmly outside the Golden Hall, her gaze steady and patient as she awaits their arrival. Inside the hall, a large, roaring fire emits warmth and light, providing a comforting backdrop to the scene where a lamb is slowly rotating on a spit, its enticing aroma wafting through the room. Long tables are meticulously arranged and laden with a bountiful array of food and barrels of wine, setting a feast-like atmosphere ready to welcome the returning soldiers. As the room fills with the sounds of a cheering crowd, Eowyn gracefully moves through the gathering towards Aragorn, her path purposeful, and when their eyes meet, a momentary connection sparks between them. With a slight glance, Eowyn shifts her attention to her uncle, Theoden, who catches her gaze and observes her with a concerned, discerning look, sensing something amiss in her demeanor as her uncle turns away, troubled by his inner thoughts. Nearby, Merry and Pippin are exuberant, standing atop one of the tables, singing forthrightly with large mugs of ale enthusiastically gripped in their hands, their energetic display eliciting laughter and applause from Gandalf, who is thoroughly entertained by the hobbits’ antics. Aragorn approaches the scene, stepping up beside Gandalf, a smile playing on his lips as he enjoys the lively floorshow, prompting Gandalf to pivot quickly towards Aragorn, his eyes searching his friend's face for some form of reassurance. Elsewhere, Frodo and Sam lie dormant amidst a cluster of scrubby bushes positioned near a stagnant pool, their forms motionless in sleep, while Smeagol, lying nearby, mutters softly, caught in the throes of his slumber. Suddenly, Smeagol jolts awake, shaking uncontrollably with his face slick with sweat, his eyes wide with terror as they transform into the malevolent visage of Gollum. Anxiously, Smeagol casts a wary glance over his shoulder at the still sleeping Frodo and Sam, then discreetly climbs down from his rocky perch, moving stealthily towards the pool's edge. He peers into the clouded depths of the water, where the surface shifts and distorts, reflecting back at him the features of Gollum as though merging with his own. A vision unfolds of Smeagol choking Deagol, his fingers clenched tightly around Deagol’s throat as an unbidden memory surfaces, causing his eyes to flicker open. Meanwhile, Sam's image appears in the water’s reflection just as he brings his pot down with a sharp smack against Gollum's head, the impact causing Sam to drop the pot as he throws himself onto Gollum, who reacts with a wild scream and frantic flailing. Hastily, Frodo stumbles over to Sam, reaching out and tugging him off Gollum, who is now curled on the ground, sobbing uncontrollably. Sam, however, driven by an overriding fury, makes another move towards Smeagol, but Frodo intervenes, grabbing Sam's arm. Although Sam initially pulls away, he pauses to stare at Frodo, his anger melting into confusion as his features soften. Frodo then gestures towards Gollum, who turns around slowly, his eyes narrowed with a mix of malice and mistrust as he fixes his gaze on Sam, allowing a sinister smile to cross his lips. Meanwhile, Aragorn joins Legolas on the broad steps leading up to the Golden Hall, both seemingly unaffected by the chill wind that sweeps around them, as they quietly survey the sleeping city spread out before them, their eyes drawn towards the imposing mountain range that looms in the distance, the sky above marked by ominous dark clouds. A flicker of understanding dawns upon Legolas as he glances at Aragorn, realization written clearly across his features. Inside, Pippin stirs restlessly, gradually becoming alert as he sits up with a start, his anxiety driving him from his bed as he tiptoes cautiously towards the sleeping figure of Gandalf. Pippin gasps in fright when he notices Merry sitting up, rubbing sleep from his eyes, continuing on unaware. Despite Gandalf lying peacefully, his eyes unexpectedly open, Pippin remains undeterred, compelled by a sense of urgency that propels him forward."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Reluctantly, Pippin hands the palantir to Gandalf, who conceals it in his cloak and looks back at Pippin, troubled. A group of riders approaches Edoras in Rohan, where Eowyn stands outside the Golden Hall, waiting. Inside, a celebratory banquet with a roaring fire, roasting lamb, tables of food, and barrels of wine awaits the returning soldiers. Amidst the cheering crowd, Eowyn approaches Aragorn with a chalice, their eyes meeting, while Theoden watches concerned as he moves away, disturbed by Eowyn's interest. Merry and Pippin sing heartily from atop a table, mugs of ale in hand, as Gandalf laughs and claps. Aragorn joins Gandalf, smiling at the revelry, while Gandalf seeks reassurance from Aragorn's expression. Frodo and Sam sleep near a stagnant pool, with Smeagol muttering in his sleep. Smeagol starts awake, drenched in sweat and wide-eyed with horror as his face transforms into Gollum's. He silently moves to the pool's edge, where his reflection reveals Gollum's menacing visage. A memory of Smeagol choking Deagol flickers, then Sam's reflection appears in the water as he strikes Gollum with a pot and tackles him. Frodo staggers over, pulling Sam off the sobbing Gollum, as Sam angrily moves toward Smeagol again. Frodo restrains Sam, who softens and looks at him, confused. Frodo beckons Gollum, who turns, staring hatefully at Sam but smiles. Meanwhile, Aragorn and Legolas stand on the steps of the Golden Hall, looking out across the sleeping city toward the mountains, dark clouds looming. Legolas has a realization and anxiously approaches Gandalf as Pippin, despite his fright, is undeterred by Merry waking and moving on."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Reluctantly, Pippin hands the palantir, a mystical seeing-stone used for telepathic communication across distances, to Gandalf, who immediately smothers it in his cloak, aware of the dangerous potential it holds, and looks back at Pippin troubled. A group of riders gallop towards the Rohan city of Edoras, known for its thatched-roof homes and the towering fortress of Meduseld. Eowyn, a noblewoman of Rohan renowned for her courage and skill in combat, stands alone outside the Golden Hall, waiting. Inside, a roaring fire, a lamb roasting on a spit, long tables laden with food from the fertile lands of the Riddermark, and barrels of wine imported from Gondor make a banquet ready for the returning soldiers. Amidst the cheering crowd, Eowyn moves towards Aragorn with a chalice, an ancient ceremonial cup of Rohan, and their eyes meet. Eowyn looks at her uncle, King Theoden, as Theoden follows her gaze and watches concerned as her uncle, weary from the burdens of leadership and recent battles, moves away, disturbed by his tone. Merry and Pippin are in full voice, on top of one of the tables, holding very large mugs of ale crafted from the renowned barley of the Westfold in their hands, while Gandalf laughs and claps at the hobbits. Aragorn steps up beside Gandalf, smiling at the floorshow that celebrates their few moments of respite, and Gandalf turns quickly to Aragorn, watching his friend's face, seeking reassurance about the road ahead. Frodo and Sam lie asleep amidst scrubby bushes near a stagnant pool, far from the comforts of the Shire, with Smeagol nearby, muttering in his sleep. Smeagol wakes suddenly, shaking, his face drenched in sweat, eyes wide in horror, as his features transform into the malevolent face of Gollum, his darker alter ego corrupted by the One Ring. Smeagol glances over his shoulder at the sleeping Frodo and Sam as he clambers off his rock, silently sidling towards the edge of a stagnant pool that reflects his inner turmoil. He stares into the murky depths of the water, where the surface ripples as the face of Gollum appears as Smeagol's, revealing the internal struggle he faces. Smeagol is seen choking Deagol, a scene from his past that forever haunts him, with fingers locked tight around his throat as his eyes flicker open. Sam's image is mirrored in the water as he smacks Gollum on the head with his pot, a simple cooking tool from their supplies, drops the pot, and flings himself on top of Gollum, who screams and flails wildly. Frodo staggers over to Sam and pulls him off Gollum, who is huddled on the ground sobbing, as Sam makes for Smeagol again with a look of murderous rage, driven by despair and fatigue. Frodo grabs Sam's arm, but Sam pulls away and stares at Frodo at a loss, his face softening with the realization of their shared burden. Frodo beckons to Gollum, who turns slowly, staring at Sam through hooded, hate-filled eyes, and smiles with the cunning of someone who knows more than he reveals. Aragorn joins Legolas on the steps to the Golden Hall, oblivious to the chill wind as they look out across the sleeping city to the looming mountain range beyond, with dark clouds marking the sky and hinting at the challenges yet to come. Legolas looks at Aragorn with realization on his face. He is awake, sits up anxious, hops out of bed, and creeps towards the sleeping form of Gandalf, the wise and revered wizard whose guidance they depend on. Pippin gasps with fright as Merry sits up, wiping sleep from his eyes, and moves on. A sleeping Gandalf lies with eyes wide open, but Pippin is undeterred, showing a curiosity that often leads him into trouble."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Deagol with fingers locked tight around his throat as his eyes flicker open Eowyn looks at her uncle as Theoden follows her gaze and watches concerned as her uncle moves away disturbed by his tone Reluctantly Pippin hands the palantir to Gandalf who immediately smothers it in his cloak and looks back at Pippin troubled A group of riders gallop towards the Rohan city of Edoras Eowyn stands alone outside the Golden Hall waiting Inside a roaring fire a lamb roasting on a spit long tables laden with food and barrels of wine make a banquet ready for the returning soldiers Aragorn joins Legolas on the steps to the Golden Hall oblivious to the chill wind as they look out across the sleeping city to the looming mountain range beyond with dark clouds marking the sky Inside a roaring fire A group of riders gallop towards the Rohan city of Edoras Amidst the cheering crowd Eowyn moves towards Aragorn with a chalice and their eyes meet Eowyn looks at her uncle as Theoden follows her gaze and watches concerned as her uncle moves away disturbed by his tone Merry and Pippin are in full voice on top of one of the tables holding very large mugs of ale in their hands while Gandalf laughs and claps at the hobbits a lamb roasting on a spit Aragorn steps up beside Gandalf smiling at the floorshow and Gandalf turns quickly to Aragorn watching his friend's face seeking reassurance Eowyn stands alone outside the Golden Hall waiting Frodo and Sam lie asleep amidst scrubby bushes near a stagnant pool with Smeagol nearby muttering in his sleep Smeagol wakes suddenly shaking his face drenched in sweat eyes wide in horror as his features transform into the malevolent face of Gollum He is awake sits up anxious hops out of bed and creeps towards the sleeping form of Gandalf Smeagol glances over his shoulder at the sleeping Frodo and Sam as he clambers off his rock silently sidling towards the edge of a stagnant pool He stares into the murky depths of the water where the surface ripples as the face of Gollum appears as Smeagol's Smeagol is seen choking A sleeping Gandalf lies with eyes wide open but Pippin is undeterred Reluctantly Pippin hands the palantir to Gandalf who immediately smothers it in his cloak and looks back at Pippin troubled Deagol with fingers locked tight around his throat as his eyes flicker open Sam's image is mirrored in the water as he smacks Gollum on the head with his pot drops the pot and flings himself on top of Gollum who screams and flails wildly Merry and Pippin are in full voice on top of one of the tables holding very large mugs of ale in their hands while Gandalf laughs and claps at the hobbits Frodo staggers over to Sam and pulls him off Gollum who is huddled on the ground sobbing as Sam makes for Smeagol again with a look of murderous rage Frodo grabs Sam's arm but Sam pulls away and stares at Frodo at a loss his face softening Pippin gasps with fright as Merry sits up wiping sleep from his eyes and moves on He stares into the murky depths of the water where the surface ripples as the face of Gollum appears as Smeagol's Smeagol is seen choking Frodo beckons to Gollum who turns slowly staring at Sam through hooded hatefilled eyes and smiles Aragorn joins Legolas on the steps to the Golden Hall oblivious to the chill wind as they look out across the sleeping city to the looming mountain range beyond with dark clouds marking the sky Legolas looks at Aragorn with realization on his face He is awake sits up anxious hops out of bed and creeps towards the sleeping form of Gandalf Pippin gasps with fright as Merry sits up wiping sleep from his eyes and moves on A sleeping Gandalf lies with eyes wide open but Pippin is undeterred"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Reluctantly Pippin hands the palantir to Gandalf who immediately smothers it in his cloak and looks back at Pippin troubled. A group of riders gallop towards the Rohan city of Edoras. Eowyn stands alone outside the Golden Hall waiting. Inside a roaring fire. a lamb roasting on a spit. long tables laden with food and barrels of wine make a banquet ready for the returning soldiers. Amidst the cheering crowd Eowyn moves towards Aragorn with a chalice and their eyes meet. Eowyn looks at her uncle as Theoden follows her gaze and watches concerned as her uncle moves away disturbed by his tone. Merry and Pippin are in full voice on top of one of the tables holding very large mugs of ale in their hands while Gandalf laughs and claps at the hobbits. Aragorn steps up beside Gandalf smiling at the floorshow and Gandalf turns quickly to Aragorn watching his friend's face seeking reassurance. Frodo and Sam lie asleep amidst scrubby bushes near a stagnant pool with Smeagol nearby muttering in his sleep. Smeagol wakes suddenly shaking his face drenched in sweat eyes wide in horror as his features transform into the malevolent face of Gollum. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Smeagol glances over his shoulder at the sleeping Frodo and Sam as he clambers off his rock silently sidling towards the edge of a stagnant pool. He stares into the murky depths of the water where the surface ripples as the face of Gollum appears as Smeagol's Smeagol is seen choking. Deagol with fingers locked tight around his throat as his eyes flicker open. Sam's image is mirrored in the water as he smacks Gollum on the head with his pot drops the pot and flings himself on top of Gollum who screams and flails wildly. Frodo staggers over to Sam and pulls him off. Gollum who is huddled on the ground sobbing as Sam makes for Smeagol again with a look of murderous rage. Frodo grabs Sam's arm but Sam pulls away and stares at Frodo at a loss his face softening. Frodo beckons to Gollum who turns slowly staring at Sam through hooded hatefilled eyes and smiles. Aragorn joins Legolas on the steps to the Golden Hall oblivious to the chill wind as they look out across the sleeping city to the looming mountain range beyond with dark clouds marking the sky. Legolas looks at Aragorn with realization on his face. He is awake sits up anxious hops out of bed and creeps towards the sleeping form of Gandalf. Pippin gasps with fright as Merry sits up wiping sleep from his eyes and moves on. A sleeping Gandalf lies with eyes wide open but Pippin is undeterred."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Reluctantly Pippin hands the palantir to Gandalf who immediately smothers it in his cloak and looks back at Pippin troubled. A group of riders gallop towards the Rohan city of Edoras. Eowyn stands alone outside the Golden Hall waiting. Inside a roaring fire. a lamb roasting on a spit. long tables laden with food and barrels of wine make a banquet ready for the returning soldiers. Amidst the cheering crowd Eowyn moves towards Aragorn with a chalice and their eyes meet. Eowyn looks at her uncle as Theoden follows her gaze and watches concerned as her uncle moves away disturbed by his tone. Merry and Pippin are in full voice on top of one of the tables holding very large mugs of ale in their hands while Gandalf laughs and claps at the hobbits. Aragorn steps up beside Gandalf smiling at the floorshow and Gandalf turns quickly to Aragorn watching his friend's face seeking reassurance. Frodo and Sam lie asleep amidst scrubby bushes near a stagnant pool with Smeagol nearby muttering in his sleep. Smeagol wakes suddenly shaking his face drenched in sweat eyes wide in horror as his features transform into the malevolent face of Gollum. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Smeagol glances over his shoulder at the sleeping Frodo and Sam as he clambers off his rock silently sidling towards the edge of a stagnant pool. He stares into the murky depths of the water where the surface ripples as the face of Gollum appears as Smeagol's Smeagol is seen choking. Deagol with fingers locked tight around his throat as his eyes flicker open. Sam's image is mirrored in the water as he smacks Gollum on the head with his pot drops the pot and flings himself on top of Gollum who screams and flails wildly. Frodo staggers over to Sam and pulls him off. Gollum who is huddled on the ground sobbing as Sam makes for Smeagol again with a look of murderous rage. Frodo grabs Sam's arm but Sam pulls away and stares at Frodo at a loss his face softening. Frodo beckons to Gollum who turns slowly staring at Sam through hooded hatefilled eyes and smiles. Aragorn joins Legolas on the steps to the Golden Hall oblivious to the chill wind as they look out across the sleeping city to the looming mountain range beyond with dark clouds marking the sky. Legolas looks at Aragorn with realization on his face. He is awake sits up anxious hops out of bed and creeps towards the sleeping form of Gandalf. Pippin gasps with fright as Merry sits up wiping sleep from his eyes and moves on. A sleeping Gandalf lies with eyes wide open but Pippin is undeterred."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Reluctantly Pippin hands the palantir to Gandalf who immediately smothers it in his cloak and looks back at Pippin troubled. A group of riders gallop towards the Rohan city of Edoras. Eowyn stands alone outside the Golden Hall waiting. Inside a roaring fire. a lamb roasting on a spit. long tables laden with food and barrels of wine make a banquet ready for the returning soldiers. Frodo grabs Sam's arm but Sam pulls away and stares at Frodo at a loss his face softening. Frodo beckons to Gollum who turns slowly staring at Sam through hooded hatefilled eyes and smiles. Aragorn joins Legolas on the steps to the Golden Hall oblivious to the chill wind as they look out across the sleeping city to the looming mountain range beyond with dark clouds marking the sky. Legolas looks at Aragorn with realization on his face. He is awake sits up anxious hops out of bed and creeps towards the sleeping form of Gandalf. Pippin gasps with fright as Merry sits up wiping sleep from his eyes and moves on. A sleeping Gandalf lies with eyes wide open but Pippin is undeterred."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Reluctantly Pippin hands the palantir to Gandalf who immediately smothers it in his cloak and looks back at Pippin troubled. A group of riders gallop towards the Rohan city of Edoras. He is awake sits up anxious hops out of bed and creeps towards the sleeping form of Gandalf. Pippin gasps with fright as Merry sits up wiping sleep from his eyes and moves on. A sleeping Gandalf lies with eyes wide open but Pippin is undeterred."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Reluctantly, a squirrel hands the palantir to a rabbit, who immediately smothers it in his cloak, and looks back at the squirrel troubled. A group of foxes gallop towards the Rohan city of Edoras. A turtle stands alone outside the Golden Hall, waiting. Inside, a roaring fire, a lamb roasting on a spit, long tables laden with food, and barrels of wine make a banquet ready for the returning soldiers. Amidst the cheering crowd, the turtle moves towards a hedgehog with a chalice, and their eyes meet. The turtle looks at her uncle as an owl follows her gaze and watches concerned as her uncle moves away, disturbed by his tone. Two parrots are in full voice, on top of one of the tables, holding very large mugs of ale in their hands, while a raccoon laughs and claps at the parrots. A deer steps up beside the raccoon, smiling at the floorshow, and the raccoon turns quickly to the deer, watching his friend's face, seeking reassurance. Two dogs lie asleep amidst scrubby bushes near a stagnant pool, with a snake nearby, muttering in his sleep. The snake wakes suddenly, shaking, his face drenched in sweat, eyes wide in horror, as his features transform into the malevolent face of a lizard. The snake glances over his shoulder at the sleeping dogs as he clambers off his rock, silently sidling towards the edge of a stagnant pool. He stares into the murky depths of the water, where the surface ripples as the face of the lizard appears as the snake's. A rabbit is seen choking a mouse, with fingers locked tight around his throat as his eyes flicker open. A dog's image is mirrored in the water as he smacks the lizard on the head with his pot, drops the pot, and flings himself on top of the lizard, who screams and flails wildly. A bird staggers over to the dog and pulls him off the lizard, who is huddled on the ground sobbing, as the dog makes for the snake again with a look of murderous rage. The bird grabs the dog's arm, but the dog pulls away and stares at the bird at a loss, his face softening. The bird beckons to the lizard, who turns slowly, staring at the dog through hooded, hate-filled eyes, and smiles. A deer joins a cat on the steps to the Golden Hall, oblivious to the chill wind as they look out across the sleeping city to the looming mountain range beyond, with dark clouds marking the sky. The cat looks at the deer with realization on his face. He is awake, sits up anxious, hops out of bed, and creeps towards the sleeping form of the raccoon. A squirrel gasps with fright as a parrot sits up, wiping sleep from his eyes, and moves on. A sleeping raccoon lies with eyes wide open, but the squirrel is undeterred."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Reluctantly, Pippin hands the amulet to Gandalf, who immediately smothers it in his jacket, and looks back at Pippin troubled. A group of riders gallop towards the Gondorian village of Dol Amroth. Eowyn stands alone outside the Silver Temple, waiting. Inside, a flickering lantern, a duck roasting on a grill, short benches laden with fruit, and casks of cider make a feast ready for the returning soldiers. Amidst the cheering throng, Eowyn moves towards Aragorn with a goblet, and their eyes meet. Eowyn looks at her uncle as Theoden follows her gaze and watches concerned as her uncle moves away, disturbed by his tone. Merry and Pippin are in full voice, on top of one of the benches, holding very large pitchers of juice in their hands, while Gandalf laughs and claps at the hobbits. Aragorn steps up beside Gandalf, smiling at the floorshow, and Gandalf turns quickly to Aragorn, watching his friend's face, seeking reassurance. Frodo and Sam lie asleep amidst thorny shrubs near a stagnant ditch, with Smeagol nearby, muttering in his sleep. Smeagol wakes suddenly, shaking, his face drenched in sweat, eyes wide in horror, as his features transform into the malevolent face of Gollum. Smeagol glances over his shoulder at the sleeping Frodo and Sam as he clambers off his stump, silently sidling towards the edge of a stagnant ditch. He stares into the muddy depths of the liquid, where the surface ripples as the face of Gollum appears as Smeagol's. Smeagol is seen choking Deagol, with fingers locked tight around his wrist as his eyes flicker open. Sam's image is mirrored in the liquid as he smacks Gollum on the head with his skillet, drops the skillet, and flings himself on top of Gollum, who screams and flails wildly. Frodo staggers over to Sam and pulls him off Gollum, who is huddled on the ground sobbing, as Sam makes for Smeagol again with a look of murderous rage. Frodo grabs Sam's arm, but Sam pulls away and stares at Frodo at a loss, his face softening. Frodo beckons to Gollum, who turns slowly, staring at Sam through hooded, hate-filled eyes, and smiles. Aragorn joins Legolas on the landing to the Silver Temple, oblivious to the chill breeze as they look out across the sleeping village to the looming cliff face beyond, with dark clouds marking the sky. Legolas looks at Aragorn with realization on his face. He is awake, sits up anxious, hops out of his tent, and creeps towards the sleeping form of Gandalf. Pippin gasps with fright as Merry sits up, wiping sleep from his eyes, and moves on. A sleeping Gandalf lies with eyes wide open, but Pippin is undeterred."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Reluctantly, Pippin tosses the palantir to Gandalf, who immediately conceals it in his cloak, and glances back at Pippin puzzled. A group of riders stroll towards the Rohan city of Edoras. Eowyn lounges alone outside the Golden Hall, reflecting. Inside, a crackling fire, a lamb spinning on a spit, long tables strewn with food, and barrels of wine provide a banquet ready for the returning soldiers. Amidst the cheering crowd, Eowyn drifts towards Aragorn with a chalice, and their eyes connect. Eowyn peers at her uncle as Theoden mimics her gaze and observes concerned as her uncle retreats, unsettled by his tone. Merry and Pippin are in full voice, under one of the tables, holding very large mugs of ale in their hands, while Gandalf chuckles and nods at the hobbits. Aragorn leans up beside Gandalf, grinning at the floorshow, and Gandalf swivels quickly to Aragorn, examining his friend's face, seeking reassurance. Frodo and Sam lie asleep amidst scrubby bushes near a stagnant pool, with Smeagol nearby, mumbling in his sleep. Smeagol rises suddenly, trembling, his face drenched in sweat, eyes wide in dread, as his features transform into the malevolent face of Gollum. Smeagol peers over his shoulder at the sleeping Frodo and Sam as he descends off his rock, quietly shimmying towards the edge of a stagnant pool. He peers into the murky depths of the water, where the surface ripples as the face of Gollum emerges as Smeagol's. Smeagol is seen embracing Deagol, with fingers locked tight around his throat as his eyes flicker open. Sam's image is mirrored in the water as he taps Gollum on the head with his pot, drops the pot, and launches himself on top of Gollum, who whimpers and flails wildly. Frodo shuffles over to Sam and lifts him off Gollum, who is curled on the ground sobbing, as Sam aims for Smeagol again with a look of murderous rage. Frodo clutches Sam's arm, but Sam yanks away and gazes at Frodo at a loss, his face softening. Frodo gestures to Gollum, who turns slowly, glaring at Sam through hooded, hate-filled eyes, and grins. Aragorn mingles with Legolas on the steps to the Golden Hall, indifferent to the chill wind as they gaze out across the sleeping city to the looming mountain range beyond, with dark clouds streaking the sky. Legolas glances at Aragorn with realization on his face. He is awake, shifts up anxious, tiptoes out of bed, and tiptoes towards the sleeping form of Gandalf. Pippin shudders with fright as Merry rises, wiping sleep from his eyes, and wanders on. A sleeping Gandalf lies with eyes wide open, but Pippin is undeterred."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Reluctantly, the toaster hands the rubber duck to the guitar, who immediately smothers it in its jacket, and looks back at the toaster troubled. A group of jellybeans gallop towards the moon city of Atlantis. The lamp stands alone outside the Honeycomb Palace, waiting. Inside, a roaring bonfire, a sandwich roasting on a grill, long tables laden with cupcakes, and barrels of lemonade make a picnic ready for the returning turtles. Amidst the cheering orchestra, the lamp moves towards the telephone with a teapot, and their eyes meet. The lamp looks at its cactus as the shoelace follows its gaze and watches concerned as its cactus moves away, disturbed by its tune. The mailbox and the toaster are in full voice, on top of one of the pianos, holding very large shoes of milk in their hands, while the guitar laughs and claps at the toothbrushes. The telephone steps up beside the guitar, smiling at the floorshow, and the guitar turns quickly to the telephone, watching its book's face, seeking reassurance. The paperclip and the stapler lie asleep amidst prickly roses near a dusty shoe, with the pickaxe nearby, muttering in its sleep. The pickaxe wakes suddenly, shaking, its face drenched in glitter, eyes wide in terror, as its features transform into the malevolent face of the anvil. The pickaxe glances over its shoulder at the sleeping paperclip and stapler as it clambers off its squirrel, silently sidling towards the edge of a dusty shoe. It stares into the murky depths of the chocolate, where the surface ripples as the face of the anvil appears as the pickaxe's. The pickaxe is seen choking the gavel, with fingers locked tight around its elbow as its eyes flicker open. The stapler's image is mirrored in the chocolate as it smacks the anvil on the nose with its spoon, drops the spoon, and flings itself on top of the anvil, which screams and flails wildly. The paperclip staggers over to the stapler and pulls it off the anvil, which is huddled on the ground sobbing, as the stapler makes for the pickaxe again with a look of murderous glee. The paperclip grabs the stapler's knee, but the stapler pulls away and stares at the paperclip at a loss, its face softening. The paperclip beckons to the anvil, which turns slowly, staring at the stapler through hooded, hate-filled eyes, and smiles. The telephone joins the flute on the tracks to the Honeycomb Palace, oblivious to the chilly iceberg as they look out across the sleeping igloo to the looming candy mountains beyond, with dark clocks marking the sky. The flute looks at the telephone with realization on its face. It is awake, sits up anxious, hops out of bed, and creeps towards the sleeping form of the guitar. The toaster gasps with fright as the mailbox sits up, wiping sleep from its toes, and moves on. A sleeping guitar lies with eyes wide open, but the toaster is undeterred."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Reluctantly, Bilbo passes the ring to Boromir, who immediately conceals it in his satchel, and glances back at Bilbo puzzled. A flock of geese waddle towards the Gondor village of Bree. Arwen sits quietly outside the Silver Cottage, knitting. Inside, a crackling hearth, a chicken simmering in a pot, short stools covered with fruit, and casks of cider prepare a feast for the arriving travelers. Amidst the shouting throng, Arwen drifts towards Legolas with a goblet, and their gazes connect. Arwen glances at her cousin as Elrond tracks her look and gazes worried as her cousin walks off, shaken by his demeanor. Merry and Bilbo are in full song, atop one of the benches, clutching very large pitchers of cider in their hands, while Boromir snickers and stomps at the dwarves. Legolas slides up alongside Boromir, smirking at the entertainment, and Boromir turns promptly to Legolas, studying his companion's expression, seeking confirmation. Frodo and Sam nap amidst thorny bushes near a stagnant marsh, with Gimli nearby, murmuring in his slumber. Gimli awakens abruptly, trembling, his face slick with perspiration, eyes wide in shock, as his features morph into the sinister face of Gollum. Gimli peers over his shoulder at the napping Frodo and Sam as he scrambles off his perch, silently creeping towards the edge of a stagnant marsh. He peers into the cloudy shallows of the pool, where the surface distorts as the face of Gollum materializes as Gimli's. Gimli is seen shaking Deagol, with thumbs pressed tight against his throat as his eyes flutter open. Sam's reflection is mirrored in the water as he smacks Gollum on the forehead with his ladle, drops the ladle, and hurls himself onto Gollum, who yelps and squirms violently. Frodo shuffles over to Sam and tugs him off Gollum, who is curled on the dirt weeping, as Sam lunges for Gimli again with an expression of deadly anger. Frodo seizes Sam's shoulder, but Sam jerks away and peers at Frodo confused, his features softening. Frodo summons Gollum, who pivots gradually, glaring at Sam through narrow, furious eyes, and grins. Legolas joins Gimli on the steps to the Silver Cottage, indifferent to the biting breeze as they survey the resting town to the towering hill range beyond, with ominous clouds blemishing the sky. Gimli gazes at Legolas with recognition on his countenance. He is alert, rises nervous, hops out of bed, and sneaks towards the dozing figure of Boromir. Merry gasps with fear as Pippin rises, rubbing drowsiness from his features, and moves forward. A slumbering Boromir rests with eyes wide shut, but Merry is unfazed."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Reluctantly, Pippin tosses the lantern to Gandalf, who immediately crushes it in his satchel, and glances back at Pippin baffled. A group of dancers glide towards the Rohan village of Edoras. Eowyn stands alone outside the Silver Tower, pondering. Inside, a crackling bonfire, a goose grilling on a tray, long benches stacked with desserts, and crates of cider create a feast ready for the approaching travelers. Amidst the jubilant assembly, Eowyn drifts towards Aragorn with a goblet, and their eyes connect. Eowyn peers at her uncle as Theoden tracks her gaze and observes concerned as her uncle wanders away, unsettled by his expression. Merry and Pippin are in full chorus, atop one of the benches, holding very large goblets of juice in their hands, while Gandalf chuckles and stomps for the hobbits. Aragorn steps beside Gandalf, grinning at the spectacle, and Gandalf turns swiftly to Aragorn, scrutinizing his friend's face, seeking solidarity. Frodo and Sam lie napping amid withered weeds near a brackish pond, with Smeagol nearby, mumbling in his slumber. Smeagol stirs suddenly, trembling, his face bathed in dew, eyes wide in dread, as his features morph into the sinister face of Gollum. Smeagol casts a glance over his shoulder at the snoozing Frodo and Sam as he crawls off his boulder, quietly slinking towards the edge of a brackish pond. He gazes into the opaque shallows of the water, where the surface quivers as the face of Gollum manifests as Smeagol. Smeagol is seen grasping Deagol, with fingers coiled tightly around his collar as his eyes flicker open. Sam’s reflection is mirrored in the water as he taps Gollum on the shoulder with his pan, drops the pan, and flings himself on top of Gollum, who wails and flails madly. Frodo stumbles over to Sam and pulls him off Gollum, who is crouched on the ground weeping, as Sam charges for Smeagol again with a look of furious wrath. Frodo seizes Sam’s elbow, but Sam pulls away and gawks at Frodo bewildered, his face easing. Frodo gestures to Gollum, who turns slowly, glaring at Sam through squinted, envious eyes, and grins. Aragorn joins Legolas on the steps to the Silver Tower, oblivious to the brisk gale as they gaze out across the dormant village to the towering hills beyond, with murky clouds shading the sky. Legolas gazes at Aragorn with revelation on his face. He is alert, sits up nervous, leaps out of the hammock, and sneaks towards the resting form of Gandalf. Pippin gasps with shock as Merry rises, rubbing slumber from his eyes, and carries on. A resting Gandalf lies with eyes wide open, but Pippin remains resolute."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Hesitantly, the rabbit delivers the carrot to the wizard, who instantly wraps it in his scarf, and glances back at the rabbit perplexed. A flock of pigeons flutter towards the Elven waterfall of Rivendell. Arwen stands alone outside the Silver Tower, waiting. Inside, a crackling bonfire, a duck grilling on a grill, circular tables stacked with fruits, and kegs of cider create a feast prepared for the returning adventurers. Amongst the applauding throng, Arwen moves towards Boromir with a goblet, and their eyes lock. Arwen glances at her cousin as Elrond follows her gaze and observes uneasily as her cousin saunters away, troubled by his manner. Tom and Huck are in full swing, atop one of the benches, holding very large jugs of cider in their grips, while the wizard chuckles and snaps at the elves. Boromir saunters up beside the wizard, grinning at the spectacle, and the wizard spins quickly to Boromir, scrutinizing his comrade's visage, seeking comfort. Aardvark and Anteater rest asleep amidst thorny hedges near a brackish swamp, with Monkey nearby, babbling in his slumber. Monkey rouses abruptly, shivering, his face soaked in tears, eyes wide with panic, as his features morph into the sinister visage of Gremlin. Monkey peeks over his shoulder at the dozing Aardvark and Anteater as he scrambles off his perch, quietly sliding towards the brink of a brackish swamp. He peers into the murky depths of the swamp, where the surface ripples as the face of Gremlin emerges as Monkey's. Monkey is observed throttling Parrot, with claws clamped tightly around his throat as his eyes flutter open. Anteater's reflection is mirrored in the swamp as he slaps Gremlin on the face with his pan, drops the pan, and lunges onto Gremlin, who shrieks and thrashes wildly. Aardvark stumbles over to Anteater and drags him off Gremlin, who is crouched on the earth wailing, as Anteater charges at Monkey again with a glare of furious wrath. Aardvark grabs Anteater's shoulder, but Anteater shrugs off and gapes at Aardvark baffled, his expression softening. Aardvark gestures to Gremlin, who turns slowly, glaring at Anteater through narrowed, malevolent eyes, and smirks. Boromir joins Gimli on the stairs to the Silver Tower, indifferent to the biting breeze as they gaze out over the dozing village to the towering cliff beyond, with ominous fog painting the sky. Gimli glances at Boromir with comprehension on his expression. He is awake, leaps up tense, bounds out of his hammock, and tiptoes towards the slumbering form of the wizard. The rabbit gasps with dread as Tom sits up, rubbing sleep from his eyes, and shuffles forward. A sleeping wizard lies with eyes wide shut, yet the rabbit is relentless."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Reluctantly, Pippin hands the palantir to Gandalf, who quickly conceals it, looking back at Pippin with concern. Riders gallop towards Edoras, where Eowyn awaits outside the Golden Hall. Inside, a feast awaits the returning soldiers. Eowyn approaches Aragorn with a chalice, their eyes meeting, while Theoden watches with concern. Merry and Pippin entertain on a table with mugs of ale, as Gandalf and Aragorn look on. Frodo and Sam sleep near a pool, with Smeagol muttering nearby. Smeagol wakes, transforming into Gollum, and approaches the pool. A vision of him choking Deagol appears, then Sam attacks Gollum, whom Frodo stops. Frodo gestures to Gollum, who eyes Sam hatefully. Aragorn and Legolas stand on the steps of the Golden Hall, observing the city and mountains. Pippin awakens, startled, and sneaks towards Gandalf, undeterred by his open eyes."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "A sleeping Gandalf lies with eyes wide open but Pippin is undeterred Pippin gasps with fright as Merry sits up wiping sleep from his eyes and moves on He is awake sits up anxious hops out of bed and creeps towards the sleeping form of Gandalf Legolas looks at Aragorn with realization on his face Aragorn joins Legolas on the steps to the Golden Hall oblivious to the chill wind as they look out across the sleeping city to the looming mountain range beyond with dark clouds marking the sky Frodo beckons to Gollum who turns slowly staring at Sam through hooded hatefilled eyes and smiles Frodo grabs Sam's arm but Sam pulls away and stares at Frodo at a loss his face softening Gollum who is huddled on the ground sobbing as Sam makes for Smeagol again with a look of murderous rage Frodo staggers over to Sam and pulls him off Sam's image is mirrored in the water as he smacks Gollum on the head with his pot drops the pot and flings himself on top of Gollum who screams and flails wildly Deagol with fingers locked tight around his throat as his eyes flicker open He stares into the murky depths of the water where the surface ripples as the face of Gollum appears as Smeagol's Smeagol is seen choking Smeagol glances over his shoulder at the sleeping Frodo and Sam as he clambers off his rock silently sidling towards the edge of a stagnant pool Smeagol wakes suddenly shaking his face drenched in sweat eyes wide in horror as his features transform into the malevolent face of Gollum Frodo and Sam lie asleep amidst scrubby bushes near a stagnant pool with Smeagol nearby muttering in his sleep Aragorn steps up beside Gandalf smiling at the floorshow and Gandalf turns quickly to Aragorn watching his friend's face seeking reassurance Merry and Pippin are in full voice on top of one of the tables holding very large mugs of ale in their hands while Gandalf laughs and claps at the hobbits Eowyn looks at her uncle as Theoden follows her gaze and watches concerned as her uncle moves away disturbed by his tone Amidst the cheering crowd Eowyn moves towards Aragorn with a chalice and their eyes meet long tables laden with food and barrels of wine make a banquet ready for the returning soldiers a lamb roasting on a spit Inside a roaring fire Eowyn stands alone outside the Golden Hall waiting A group of riders gallop towards the Rohan city of Edoras Reluctantly Pippin hands the palantir to Gandalf who immediately smothers it in his cloak and looks back at Pippin troubled"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Inside a roaring fire A group of riders gallop towards the Rohan city of Edoras Frodo beckons to Gollum who turns slowly staring at Sam through hooded hatefilled eyes and smiles Aragorn joins Legolas on the steps to the Golden Hall oblivious to the chill wind as they look out across the sleeping city to the looming mountain range beyond with dark clouds marking the sky Eowyn looks at her uncle as Theoden follows her gaze and watches concerned as her uncle moves away disturbed by his tone a lamb roasting on a spit Gollum who is huddled on the ground sobbing as Sam makes for Smeagol again with a look of murderous rage Amidst the cheering crowd Eowyn moves towards Aragorn with a chalice and their eyes meet He is awake sits up anxious hops out of bed and creeps towards the sleeping form of Gandalf Frodo and Sam lie asleep amidst scrubby bushes near a stagnant pool with Smeagol nearby muttering in his sleep Smeagol glances over his shoulder at the sleeping Frodo and Sam as he clambers off his rock silently sidling towards the edge of a stagnant pool Eowyn stands alone outside the Golden Hall waiting Frodo staggers over to Sam and pulls him off A sleeping Gandalf lies with eyes wide open but Pippin is undeterred Sam's image is mirrored in the water as he smacks Gollum on the head with his pot drops the pot and flings himself on top of Gollum who screams and flails wildly Aragorn steps up beside Gandalf smiling at the floorshow and Gandalf turns quickly to Aragorn watching his friend's face seeking reassurance He stares into the murky depths of the water where the surface ripples as the face of Gollum appears as Smeagol's Smeagol is seen choking Deagol with fingers locked tight around his throat as his eyes flicker open Frodo grabs Sam's arm but Sam pulls away and stares at Frodo at a loss his face softening Merry and Pippin are in full voice on top of one of the tables holding very large mugs of ale in their hands while Gandalf laughs and claps at the hobbits Legolas looks at Aragorn with realization on his face Pippin gasps with fright as Merry sits up wiping sleep from his eyes and moves on Reluctantly Pippin hands the palantir to Gandalf who immediately smothers it in his cloak and looks back at Pippin troubled long tables laden with food and barrels of wine make a banquet ready for the returning soldiers Smeagol wakes suddenly shaking his face drenched in sweat eyes wide in horror as his features transform into the malevolent face of Gollum"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He stares into the murky depths of the water where the surface ripples as the face of Gollum appears as Smeagol's Smeagol is seen choking Deagol with fingers locked tight around his throat as his eyes flicker open Sam's image is mirrored in the water as he smacks Gollum on the head with his pot drops the pot and flings himself on top of Gollum who screams and flails wildly Frodo staggers over to Sam and pulls him off Gollum who is huddled on the ground sobbing as Sam makes for Smeagol again with a look of murderous rage Frodo grabs Sam's arm but Sam pulls away and stares at Frodo at a loss his face softening Frodo beckons to Gollum who turns slowly staring at Sam through hooded hatefilled eyes and smiles Aragorn joins Legolas on the steps to the Golden Hall oblivious to the chill wind as they look out across the sleeping city to the looming mountain range beyond with dark clouds marking the sky Legolas looks at Aragorn with realization on his face He is awake sits up anxious hops out of bed and creeps towards the sleeping form of Gandalf Pippin gasps with fright as Merry sits up wiping sleep from his eyes and moves on A sleeping Gandalf lies with eyes wide open but Pippin is undeterred Reluctantly Pippin hands the palantir to Gandalf who immediately smothers it in his cloak and looks back at Pippin troubled A group of riders gallop towards the Rohan city of Edoras Eowyn stands alone outside the Golden Hall waiting Inside a roaring fire a lamb roasting on a spit long tables laden with food and barrels of wine make a banquet ready for the returning soldiers Amidst the cheering crowd Eowyn moves towards Aragorn with a chalice and their eyes meet Eowyn looks at her uncle as Theoden follows her gaze and watches concerned as her uncle moves away disturbed by his tone Merry and Pippin are in full voice on top of one of the tables holding very large mugs of ale in their hands while Gandalf laughs and claps at the hobbits Aragorn steps up beside Gandalf smiling at the floorshow and Gandalf turns quickly to Aragorn watching his friend's face seeking reassurance Frodo and Sam lie asleep amidst scrubby bushes near a stagnant pool with Smeagol nearby muttering in his sleep Smeagol wakes suddenly shaking his face drenched in sweat eyes wide in horror as his features transform into the malevolent face of Gollum Smeagol glances over his shoulder at the sleeping Frodo and Sam as he clambers off his rock silently sidling towards the edge of a stagnant pool"
        }
      ]
    }
  ]
}