{
  "ground_truth": "The Mumakil react with terror as spectral warriors climb up their sides, routing the Haradrim from their war-towers, and orcs flee in their thousands. The army of the dead swarms over the city, routing the orcs. Eowyn crawls to where Theoden lays, mortally wounded. Theoden looks up at Eowyn, his breathing shallow and his vision clouded. Eowyn smiles down at him as she gently strokes his face. Theoden is dying. The army of the dead slowly dissolves into dust and is immediately swept away by the four winds. Aragorn turns to Gandalf, who bows his head in homage. Pippin, in his Gondorian armor, looks around at the devastation, his eyes full of sadness. They suddenly fix on something, and Pippin runs through the ruin of the battle towards a small figure slumped on the ground. Merry stares unseeing at Pippin, horror and shock erasing all other memories from Merry's mind. Tears fall down Pippin's face as he looks on his friend. Pippin covers Merry with a blanket. The camera rises towards the dark orc tower of Cirith Ungol, and a light glows from the topmost window. The camera reaches the tower, dissolving through the wall into a small cold room. Frodo Baggins is unconscious on the floor. His eyes suddenly flicker, and he wakes up. Tilt up to reveal the orc and Uruk-hai, Gorbag and Shagrat, arguing over Frodo's belongings and clothes. Gorbag is snatching for the mithril vest. Frodo realizes that he has been stripped down to his underwear. He clutches at his throat; the ring has gone. Gorbag grabs for the mithril vest and draws his sword, but Shagrat kicks him backwards with his foot. Gorbag falls through a trap door leading to the floor below. Gorbag lands in the guard room with a crash, creating sudden alarm amongst the orcs and Uruk-hai stationed there. Shagrat leans through the trap door. Several Uruk-hai converge on Gorbag, and he lashes out, slashing one across the throat with his sword. The dead Uruk-hai topples backward over the parapet, landing on top of Uruk-hai and orcs in the courtyard below. Within moments, a brutal civil war breaks out between the two companies stationed in Cirith Ungol. Sam hurries towards the gate, fearful for Frodo. Sam is confronted with the sight of over 50 slaughtered orc and Uruk-hai, strewn over the courtyard. Angle on: Sam pounds up the staircase. He suddenly pauses. Several Uruk-hai are running down towards him. He grips Sting and continues charging up, screaming at the top of his lungs. Angle on: the four Uruks. They see a huge distorted shadow on the wall in front of them. They turn around and flee in terror back to the top of the stairs. Sam appears, and before the Uruk-hai can fully regain their wits, he slays three.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The Oliphaunts respond with dread as ghostly fighters climb up their flanks, dispersing the Haradrim from their battle-towers, and goblins escape in their multitudes. The legion of the deceased overcomes the metropolis, dispersing the goblins. Eowyn crawls to where Theoden lies, fatally injured. Theoden gazes up at Eowyn, his respiration shallow and his sight obscured. Eowyn beams down at him as she softly caresses his visage. Theoden is perishing. The legion of the deceased gradually disintegrates into powder and is instantly swept away by the four breezes. Aragorn turns to Gandalf, who inclines his head in reverence. Pippin, in his Gondorian armor, gazes around at the destruction, his eyes full of sorrow. They suddenly lock on something, and Pippin dashes through the wreckage of the skirmish towards a small silhouette slumped on the terrain. Merry stares unseeing at Pippin, dread and astonishment wiping all other thoughts from Merry's mind. Tears fall down Pippin's visage as he looks on his companion. Pippin covers Merry with a blanket. The camera ascends towards the dark goblin tower of Cirith Ungol, and a glow emanates from the uppermost window. The camera reaches the tower, dissolving through the wall into a small frigid chamber. Frodo Baggins is insensible on the floor. His eyes suddenly flicker, and he rouses. Tilt up to reveal the goblin and Uruk-hai, Gorbag and Shagrat, disputing over Frodo's possessions and garments. Gorbag is grasping for the mithril vest. Frodo perceives that he has been stripped down to his underclothes. He clutches at his neck; the ring has vanished. Gorbag grabs for the mithril vest and draws his blade, but Shagrat kicks him backward with his foot. Gorbag plummets through a trap door leading to the floor below. Gorbag lands in the guard chamber with a crash, causing sudden alarm among the goblins and Uruk-hai stationed there. Shagrat leans through the trap door. Several Uruk-hai converge on Gorbag, and he lashes out, slashing one across the neck with his blade. The deceased Uruk-hai topples backward over the parapet, landing on top of Uruk-hai and goblins in the courtyard below. Within moments, a savage civil conflict erupts between the two factions stationed in Cirith Ungol. Sam hastens towards the gate, apprehensive for Frodo. Sam is confronted with the sight of over 50 slaughtered goblin and Uruk-hai, scattered over the courtyard. Angle on: Sam pounds up the staircase. He suddenly halts. Several Uruk-hai are running down towards him. He grips Sting and continues charging up, shouting at the top of his lungs. Angle on: the four Uruks. They see a huge distorted silhouette on the wall in front of them. They turn around and escape in dread back to the top of the stairs. Sam appears, and before the Uruk-hai can fully regain their senses, he slays three."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "As terror is reacted with by the Mumakil, spectral warriors are climbed up by them on their sides, and the Haradrim are routed from their war-towers, while their thousands flee. The orcs are swarmed over by the army of the dead, who rout them from the city. Eowyn crawls to the place where Theoden, mortally wounded, is laying. Eowyn is looked up at by Theoden, his breathing shallow and vision clouded. Down at him, Eowyn smiles as his face is gently stroked by her. Theoden is dying. Into dust, the army of the dead slowly dissolves and is immediately swept away by the four winds. To Gandalf, Aragorn turns, and his head is bowed by Gandalf in homage. In his Gondorian armor, Pippin looks around the devastation, eyes full of sadness. On something, they suddenly fix, and the ruin of the battle is run through by Pippin towards a small figure slumped on the ground. Unseeing, Merry stares at Pippin, all other memories are erased from Merry's mind by horror and shock. Pippin, as he looks at his friend, has tears fall down his face. Merry is covered by Pippin with a blanket. Towards the dark orc tower of Cirith Ungol, the camera rises, and from the topmost window, a light glows. The camera reaches the tower, dissolving through the wall into a small cold room. On the floor, Frodo Baggins is unconscious. Suddenly, his eyes flicker, and he wakes up. Tilt up to reveal Frodo's belongings and clothes being argued over by the orc and Uruk-hai, Gorbag and Shagrat. The mithril vest is snatched for by Gorbag. Frodo realizes that to his underwear, he has been stripped down. At his throat, he clutches; gone is the ring. For the mithril vest, Gorbag grabs and his sword is drawn by him, but backwards, with his foot, Shagrat kicks him. Through a trap door leading to the floor below, Gorbag falls. With a crash, Gorbag lands in the guard room, creating sudden alarm among the orcs and Uruk-hai stationed there. The trap door is leaned through by Shagrat. On Gorbag, several Uruk-hai converge, and Gorbag lashes out, slashing one across the throat with his sword. Over the parapet, the dead Uruk-hai are toppled backward, landing on top of Uruk-hai and orcs in the courtyard below. Within moments, between the two companies stationed in Cirith Ungol, a brutal civil war breaks out. Towards the gate, fearful for Frodo, Sam hurries. Sam is confronted with the sight of over 50 orc and Uruk-hai slaughtered, strewn over the courtyard. Angle on: up the staircase, Sam pounds. Suddenly, he pauses. Down towards him, several Uruk-hai are running. Sting is gripped by him, and continuing charging up, he screams at the top of his lungs. Angle on: the four Uruks. On the wall in front of them, they see a huge distorted shadow. They are turned around, and in terror, flee back to the top of the stairs. Sam appears, and before their wits can be fully regained by the Uruk-hai, three are slain by him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The Mumakil panic as spectral warriors climb their sides, routing the Haradrim from their war-towers, while orcs flee by the thousands. The army of the dead swarms the city, routing the orcs. Eowyn crawls to Theoden, who is mortally wounded. He looks at Eowyn, breathing shallow and vision clouded. Eowyn smiles and gently strokes his face. Theoden is dying. The army of the dead dissolves into dust, swept by the winds. Aragorn turns to Gandalf, who bows in homage. Pippin, in Gondorian armor, surveys the devastation, eyes sad. Spotting something, Pippin runs through the battle's ruins to a small figure. Merry stares at him, shock erasing all memories. Tears fall as Pippin covers Merry with a blanket. The camera rises to the orc tower of Cirith Ungol, with light in the top window. Inside, Frodo Baggins is unconscious. His eyes flicker, and he wakes. Above, the orc and Uruk-hai, Gorbag and Shagrat, argue over Frodo's belongings. Gorbag grabs for the mithril vest. Frodo, stripped to his underwear, clutches his throat; the ring is gone. Gorbag snatches the mithril vest, draws his sword, but Shagrat kicks him through a trap door below. Gorbag crashes into the guard room, alarming the orcs and Uruk-hai. Shagrat leans through the trap door. Several Uruk-hai converge on Gorbag, who slashes one’s throat with his sword. The dead Uruk-hai topples onto others in the courtyard. A brutal civil war erupts between the two companies at Cirith Ungol. Sam rushes toward the gate, fearing for Frodo. He sees over 50 slaughtered orc and Uruk-hai. Sam climbs the staircase and pauses as Uruk-hai run towards him. Gripping Sting, he charges up, screaming. The four Uruks see a huge shadow on the wall and flee in terror. Sam appears and slays three before they can recover."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Mumakil flee in terror as spectral warriors climb, routing Haradrim and orcs. The dead army swarms the city. Eowyn finds mortally wounded Theoden; she smiles and strokes his face. He is dying. The dead dissolve into dust, swept by four winds. Aragorn turns to Gandalf, who bows. Pippin, in armor, sees the devastation and spots something. He runs to Merry, who is in shock. Pippin cries and covers him with a blanket. The camera moves to Cirith Ungol's dark tower, entering a cold room where Frodo lies unconscious. He wakes to see Gorbag and Shagrat arguing over his belongings. Gorbag grabs for the mithril vest and draws his sword; Shagrat kicks him through a trap door. Gorbag crashes into the guard room, alarming orcs and Uruk-hai, leading to a brutal civil war. Sam rushes to Frodo, seeing over 50 dead orcs and Uruk-hai in the courtyard. As Sam ascends, several Uruk-hai charge him. He grips Sting, screams, and they flee. Sam appears and slays three."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As the mighty Mumakil stand in panic and fright, their immense sides are climbed by spectral warriors, causing chaos as the Haradrim are forced from their towering war-towers, while orcs dash away in their countless numbers. The spectral and ghostly army of the dead swarms like a tide over the besieged city, chasing away the orcs in disarray. Meanwhile, Eowyn slowly crawls over the ground to reach where Theoden lies, gravely, mortally wounded. Theoden, with labored, shallow breathing and vision clouded by approaching death, gazes up at Eowyn. She gives him a warm, comforting smile as she tenderly strokes his face, acknowledging that Theoden is slipping away. Gradually, the spectral army of the dead dissolves into a fine dust, swiftly carried away by the four winds. Aragorn turns his focus towards Gandalf, who solemnly bows his head in a gesture of deep respect. In his Gondorian armor, Pippin surveys the scene of devastation, with eyes that express profound sadness. His gaze suddenly locks onto something, and with urgency, Pippin races through the ruins of the battlefield towards a small, slumped figure on the ground. Merry, in a daze, stares blankly at Pippin, horror and shock completely wiping all other memories from his mind. Tears cascade down Pippin’s face as he looks upon his friend with grief. Tenderly, Pippin covers Merry with a blanket for warmth and comfort. Meanwhile, the camera rises upward, revealing the dark, foreboding orc tower of Cirith Ungol, where a mysterious light glows from the topmost window. As the camera approaches the tower, it dissolves seamlessly through the wall into a small, cold room where Frodo Baggins lies unconscious on the floor. Suddenly, his eyes flicker open, and he awakens. As the camera tilts up, it reveals the orc and Uruk-hai—Gorbag and Shagrat—engaged in a heated argument over Frodo’s belongings and clothes. Gorbag tries to snatch the precious mithril vest. Frodo realizes, with growing dread, that he has been stripped down to his undergarments. Instinctively, he clutches at his throat, only to find that the ring is gone. Desperately, Gorbag reaches for the mithril vest and draws his sword, but Shagrat brutally kicks him backward with his foot. Gorbag plummets through a trap door to the floor below. With a loud crash, Gorbag lands in the guard room, causing alarm among the orcs and Uruk-hai stationed there. Shagrat leans over the trap door, and as several Uruk-hai converge on Gorbag, he lashes out, slashing one across the throat with his sword. The dead Uruk-hai topples backward over the parapet, crashing onto his fellow Uruk-hai and orcs in the courtyard below. In mere moments, a savage and fierce civil war erupts between the two rival companies stationed in Cirith Ungol. Sam rushes toward the gate, filled with fear and concern for Frodo. Sam is abruptly confronted with the sight of over fifty slaughtered orc and Uruk-hai bodies strewn across the courtyard. The camera angles on Sam as he pounds up the staircase but suddenly pauses. Several Uruk-hai are charging down towards him. Gritting his teeth, Sam tightly grips Sting and, with a ferocious yell, continues to charge up, screaming at the top of his lungs. The camera focuses on the four Uruks as they see a massive, distorted shadow cast upon the wall in front of them. Terrified, they turn and flee in panic back to the top of the staircase. Sam appears, and before the Uruk-hai can fully regain their senses, he swiftly slays three of them with unyielding resolve."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In an atmosphere thick with tension and chaos, the towering and mighty Mumakil, those legendary beasts of war, are found paralyzed by panic and fright. As their colossal sides tremble, the spectral warriors, ghostly figures from a bygone era, begin their eerie ascent. This causes pandemonium among the Haradrim, who are unceremoniously expelled from their lofty war-towers. Simultaneously, the orcs, in what seems like an endless swarm of countless numbers, scatter in all directions. The spectral, ghostly army of the dead flows relentlessly over the beleaguered city, much like an unstoppable tide, driving the orcs away in utter disarray.\n\nIn a parallel scene of poignant sorrow, Eowyn crawls painstakingly over the ravaged ground to reach Theoden, who lies critically, mortally wounded. Theoden, with his breathing labored and his vision increasingly obscured by the shadow of impending death, gazes upward at Eowyn. She offers him a warm, comforting smile, as if to impart some peace, and gently strokes his face, silently accepting that Theoden is slipping away from the realm of the living. Slowly, the spectral army of the dead begins to dissolve, transforming into a fine dust that is promptly carried away by the relentless four winds. Aragorn, with a heavy heart, shifts his attention towards Gandalf, who bows his head solemnly, a gesture filled with deep and profound respect.\n\nIn the midst of his Gondorian armor, Pippin surveys the expansive scene of devastation, his eyes filled with profound sadness. Suddenly, his gaze fixes on something specific, and compelled by urgency, Pippin dashes through the ruins of the battlefield towards a small, slumped figure lying on the ground. The figure is Merry, who is in a daze, staring blankly at Pippin, the horror and shock having erased all other memories from his beleaguered mind. Overcome with grief, tears cascade freely down Pippin’s face as he looks upon his dear friend. With tenderness and care, Pippin covers Merry with a blanket, offering warmth and comfort. Meanwhile, the camera begins to rise gradually, revealing the dark, ominous orc tower known as Cirith Ungol. A mysterious light shimmers from the highest window, drawing the camera’s focus.\n\nAs the camera seamlessly approaches and dissolves through the tower's wall, it reveals a small, cold room where Frodo Baggins lies unconscious on the hard, unforgiving floor. Suddenly, his eyes flicker open, and he becomes aware of his surroundings once again. As the camera tilts upwards, it reveals the orc and Uruk-hai—Gorbag and Shagrat—locked in a heated argument over Frodo’s belongings and garments. In the midst of this confrontation, Gorbag attempts to seize the precious mithril vest. A chill of realization washes over Frodo as he comprehends, with mounting dread, that he has been stripped down to nothing but his undergarments. Instinctively, he clutches at his throat, only to discover, to his horror, that the ring is gone.\n\nDesperately, Gorbag lunges for the mithril vest, drawing his sword in a frantic move. However, Shagrat intervenes with a brutal kick, sending Gorbag plummeting through a trap door to the floor below. With a resounding crash, Gorbag lands in the guard room, causing panic among the orcs and Uruk-hai stationed there. Shagrat leans menacingly over the trap door, and as several Uruk-hai rush towards Gorbag, he retaliates, slashing one viciously across the throat. The lifeless Uruk-hai topples backward, crashing into his comrades in the courtyard below. In a matter of moments, a savage and ferocious civil war erupts between the two rival factions stationed within the walls of Cirith Ungol.\n\nSamwise Gamgee, driven by fear and deep concern for Frodo, rushes towards the gate. His heart pounds as he is abruptly confronted by the ghastly sight of over fifty slaughtered orc and Uruk-hai bodies strewn haphazardly across the courtyard. The camera captures Sam’s determined visage as he pounds up the staircase, only to pause when confronted by several Uruk-hai charging towards him. Gritting his teeth and summoning his courage, Sam grips the sword Sting tightly and, with a ferocious yell echoing through the air, charges up the staircase at full speed, screaming at the top of his lungs. The camera focuses intently on the four Uruks as they behold a massive, distorted shadow cast upon the wall before them. Terrified beyond reason, they turn and flee in sheer panic back towards the top of the staircase. In an instant, Sam emerges, and before the Uruk-hai can fully comprehend the threat, he swiftly dispatches three of them with unyielding resolve."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The Mumakil, gigantic and fearsome creatures, exhibit palpable terror as spectral warriors, ethereal and otherworldly, start climbing up their massive sides. These ghostly warriors effectively rout the Haradrim, forcing them to abandon their fortified war-towers in fear and disarray. Simultaneously, the orcs, confronted with this supernatural menace, flee in their thousands in a desperate attempt to escape. The army of the dead continues its relentless advance, swarming over the city’s defenses and routing the orcs with ease and efficiency. Nearby, Eowyn, injured but determined, painstakingly crawls across the battlefield toward the prone figure of Theoden, who lies mortally wounded. As she reaches him, Theoden looks up, his eyes struggling to focus through the haze of pain and his shallow breaths. Eowyn, despite her own pain, offers a comforting smile down at him, tenderly stroking his face as she accepts the gravity of his dying state. Meanwhile, the once-tangible presence of the army of the dead begins to dissolve into dust, their purpose fulfilled, and this spectral dust is immediately caught up and swept away by the four winds. Aragorn, witnessing this transformation, turns with solemnity to Gandalf, who responds by bowing his head in a gesture of deep respect and homage. Amidst the battlefield's devastation, Pippin, clad in his Gondorian armor, surveys the scene with eyes full of sadness and loss. His gaze suddenly locks onto something that provokes an urgent response. He breaks into a run, navigating through the ruinous remnants of battle, until he reaches a small, familiar figure slumped on the ground—his friend Merry. Merry, shell-shocked and staring blankly, is engulfed by horror and a numbing sense of disbelief, all other memories momentarily erased from his mind. Observing his friend's devastated state, tears stream down Pippin's face, and with a tender motion, he covers Merry with a blanket, offering what little comfort he can. As this poignant scene unfolds, the camera's focus shifts, ascending towards the dark, foreboding orc tower of Cirith Ungol, where a mysterious light glows from the topmost window. The camera reaches the tower, its perspective seamlessly transitioning through the wall to reveal a small, cold room within, where Frodo Baggins lies unconscious on the floor. His eyes, closed in oblivion, suddenly flicker and he awakens, jolting to the harsh reality of his predicament. As he becomes more aware, we tilt up to witness Gorbag, an orc, and Shagrat, an Uruk-hai, locked in a heated argument over Frodo's belongings and clothes, their voices rising in greed and tension. Gorbag's greedy hands are snatching for the mithril vest, a prized item, and Frodo, realizing his vulnerability, discovers he has been stripped down to his underwear. In a panic, he clutches at his throat, only to find that the ring, his most precious possession, is gone. As the argument escalates, Gorbag reaches for the mithril vest once more and draws his sword, intending to assert his claim, but Shagrat reacts swiftly, kicking Gorbag backwards with his foot. The force of the kick sends Gorbag tumbling through a trap door, and he plummets to the floor below, landing in the guard room with a loud crash, creating immediate alarm among the orcs and Uruk-hai stationed there. Shagrat peers down through the trap door, while below, several Uruk-hai converge on the fallen Gorbag. In a desperate bid for survival, Gorbag lashes out with his sword, slashing one unlucky Uruk-hai across the throat. The dead Uruk-hai, momentum carrying it forward, topples backward over the parapet, its lifeless form crashing down onto the Uruk-hai and orcs gathered in the courtyard below. The tension erupts into chaos as a brutal civil war breaks out between the two factions stationed in Cirith Ungol, each side fighting with desperate ferocity. Meanwhile, Sam, driven by fear for Frodo's safety, hurries towards the gate, his heart pounding as he confronts the grim sight of over fifty slaughtered orc and Uruk-hai bodies strewn across the courtyard. Steeling himself, Sam pounds up the staircase, his resolve firm. Suddenly, he halts, spotting several Uruk-hai descending the stairs toward him. With unwavering determination, he grips his trusty weapon, Sting, and continues upwards, a primal scream tearing from his throat. The camera shifts to the perspective of the four Uruks, who, upon seeing a massive, distorted shadow cast on the wall before them, are seized by a primal fear. They instinctively turn and flee back to the top of the stairs. Sam emerges, and before the bewildered Uruk-hai can fully regain their senses, he swiftly and decisively slays three of them, his actions driven by a mix of fear, courage, and desperate urgency."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The Mumakil are terrified as spectral warriors ascend their sides, driving the Haradrim from their war-towers and causing orcs to flee in droves. The army of the dead overruns the city, scattering the orcs. Eowyn reaches the mortally wounded Theoden, gently stroking his face with a smile as he looks up at her with clouded vision. As Theoden faces his end, the army of the dead dissipates into dust swept away by the winds. Aragorn and Gandalf exchange a moment of homage, while Pippin, clad in Gondorian armor, surveys the devastation with sadness. Spotting something, Pippin rushes through the battle's aftermath to find Merry slumped on the ground, lost in shock and horror. Pippin's tears fall as he covers Merry with a blanket. The scene shifts to the dark orc tower of Cirith Ungol, where a light glows from the top window. Inside, Frodo Baggins awakens in a small cold room, stripped to his underwear, and realizes the ring is gone as Gorbag and Shagrat argue over his mithril vest. Gorbag grabs for the vest and is kicked through a trapdoor by Shagrat, landing in the guard room below, sparking alarm among the orcs and Uruk-hai. A deadly conflict erupts between the two factions. Meanwhile, Sam approaches the gate, alarmed for Frodo's safety, encountering over 50 slain orcs and Uruk-hai in the courtyard. Determined, Sam charges up the staircase, gripping Sting and letting out a battle cry. The Uruk-hai come face to face with a menacing shadow, turning in terror back up the stairs, where Sam swiftly confronts and slays three of them."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The Mumakil, immense elephantine creatures bred for war by the Haradrim, react with terror as spectral warriors, the long-dead oath-breakers summoned by Aragorn, climb up their sides, routing the Haradrim from their war-towers, and orcs flee in their thousands. The army of the dead, their presence a result of a curse preventing them from resting until they have fulfilled their oath to Isildur's heir, swarms over the city, routing the orcs. Eowyn, a noblewoman of Rohan who took up arms against the wishes of her kin, crawls to where Theoden, her uncle and King of Rohan, lays, mortally wounded. Theoden looks up at Eowyn, his breathing shallow and his vision clouded, aware that his quest to protect his people is nearing its end. Eowyn, who defied traditional roles to fight for her people's freedom, smiles down at him as she gently strokes his face. Theoden, who led his people bravely into battle against overwhelming odds, is dying. The army of the dead slowly dissolves into dust and is immediately swept away by the four winds, their oath fulfilled. Aragorn, the rightful heir to the thrones of both Gondor and Arnor, turns to Gandalf, who bows his head in homage, recognizing the weight of destiny that Aragorn carries. Pippin, in his Gondorian armor, a symbol of his allegiance to the city he swore to defend, looks around at the devastation, his eyes full of sadness. They suddenly fix on something, and Pippin runs through the ruin of the battle towards a small figure slumped on the ground. Merry, Pippin's kinsman and fellow hobbit from the Shire, stares unseeing at Pippin, horror and shock erasing all other memories from Merry's mind. Tears fall down Pippin's face as he looks on his friend, who fought bravely in the battle despite his small stature. Pippin covers Merry with a blanket, offering what little comfort he can. The camera rises towards the dark orc tower of Cirith Ungol, once a Gondorian watchtower overtaken by Sauron's forces, and a light glows from the topmost window. The camera reaches the tower, dissolving through the wall into a small cold room. Frodo Baggins, the Ring-bearer tasked with the perilous mission to destroy the One Ring, is unconscious on the floor. His eyes suddenly flicker, and he wakes up. Tilt up to reveal the orc and Uruk-hai, Gorbag and Shagrat, arguing over Frodo's belongings and clothes, a quarrel set off by the greed and treachery that often pervades such creatures. Gorbag is snatching for the mithril vest, a rare and valuable protective garment gifted to Frodo by Bilbo, who received it from Thorin Oakenshield. Frodo realizes that he has been stripped down to his underwear, vulnerable and exposed. He clutches at his throat; the ring has gone, stolen during his capture. Gorbag grabs for the mithril vest and draws his sword, but Shagrat kicks him backwards with his foot. Gorbag falls through a trap door leading to the floor below, a common feature in orc fortresses for surprise attacks. Gorbag lands in the guard room with a crash, creating sudden alarm amongst the orcs and Uruk-hai stationed there. Shagrat leans through the trap door. Several Uruk-hai, the fierce and disciplined orc-human hybrids bred by Saruman, converge on Gorbag, and he lashes out, slashing one across the throat with his sword. The dead Uruk-hai topples backward over the parapet, landing on top of Uruk-hai and orcs in the courtyard below. Within moments, a brutal civil war, driven by the power struggles common among Sauron's forces, breaks out between the two companies stationed in Cirith Ungol. Sam, Frodo's loyal companion who has vowed to protect him at all costs, hurries towards the gate, fearful for Frodo. Sam is confronted with the sight of over 50 slaughtered orc and Uruk-hai, strewn over the courtyard, a testament to the internal chaos. Angle on: Sam pounds up the staircase. He suddenly pauses. Several Uruk-hai are running down towards him. He grips Sting, an Elvish blade that glows blue in the presence of orcs, and continues charging up, screaming at the top of his lungs. Angle on: the four Uruks. They see a huge distorted shadow on the wall in front of them, amplified by the flickering torches. They turn around and flee in terror back to the top of the stairs. Sam appears, and before the Uruk-hai can fully regain their wits, he slays three, driven by his unwavering determination to save his friend."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The Mumakil react with terror as spectral warriors climb up their sides routing the Haradrim from their wartowers and orcs flee in their thousands. The army of the dead swarms over the city routing the orcs. Eowyn crawls to where Theoden lays mortally wounded. Theoden looks up at Eowyn his breathing shallow and his vision clouded. Eowyn smiles down at him as she gently strokes his face. Theoden is dying. The army of the dead slowly dissolves into dust and is immediately swept away by the four winds. Aragorn turns to Gandalf who bows his head in homage. Pippin in his Gondorian armor looks around at the devastation his eyes full of sadness. They suddenly fix on something and Pippin runs through the ruin of the battle towards a small figure slumped on the ground. Merry stares unseeing at Pippin horror and shock erasing all other memories from Merry's mind. Tears fall down Pippin's face as he looks on his friend. Pippin covers Merry with a blanket. The camera rises towards the dark orc tower of Cirith Ungol and a light glows from the topmost window. The camera reaches the tower dissolving through the wall into a small cold room. Frodo Baggins is unconscious on the floor. His eyes suddenly flicker and he wakes up. Tilt up to reveal the orc and Urukhai. Gorbag and Shagrat arguing over Frodo's belongings and clothes. Gorbag is snatching for the mithril vest. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Frodo realizes that he has been stripped down to his underwear. He clutches at his throat. the ring has gone. Gorbag grabs for the mithril vest and draws his sword but Shagrat kicks him backwards with his foot. Gorbag falls through a trap door leading to the floor below. Gorbag lands in the guard room with a crash creating sudden alarm amongst the orcs and Urukhai stationed there. Shagrat leans through the trap door. Several Urukhai converge on Gorbag and he lashes out slashing one across the throat with his sword. The dead Urukhai topples backward over the parapet landing on top of Urukhai and orcs in the courtyard below. Within moments a brutal civil war breaks out between the two companies stationed in Cirith Ungol. Sam hurries towards the gate fearful for Frodo. Sam is confronted with the sight of over 50 slaughtered orc and Urukhai strewn over the courtyard. Angle on. Sam pounds up the staircase. He suddenly pauses. Several Urukhai are running down towards him. He grips Sting and continues charging up screaming at the top of his lungs. Angle on the four Uruks. They see a huge distorted shadow on the wall in front of them. They turn around and flee in terror back to the top of the stairs. Sam appears and before the Urukhai can fully regain their wits he slays three."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The Mumakil react with terror as spectral warriors climb up their sides routing the Haradrim from their wartowers and orcs flee in their thousands. The army of the dead swarms over the city routing the orcs. Eowyn crawls to where Theoden lays mortally wounded. Theoden looks up at Eowyn his breathing shallow and his vision clouded. Eowyn smiles down at him as she gently strokes his face. Theoden is dying. The army of the dead slowly dissolves into dust and is immediately swept away by the four winds. Aragorn turns to Gandalf who bows his head in homage. Pippin in his Gondorian armor looks around at the devastation his eyes full of sadness. They suddenly fix on something and Pippin runs through the ruin of the battle towards a small figure slumped on the ground. Merry stares unseeing at Pippin horror and shock erasing all other memories from Merry's mind. Tears fall down Pippin's face as he looks on his friend. Pippin covers Merry with a blanket. The camera rises towards the dark orc tower of Cirith Ungol and a light glows from the topmost window. The camera reaches the tower dissolving through the wall into a small cold room. Frodo Baggins is unconscious on the floor. His eyes suddenly flicker and he wakes up. Tilt up to reveal the orc and Urukhai. Gorbag and Shagrat arguing over Frodo's belongings and clothes. Gorbag is snatching for the mithril vest. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. Frodo realizes that he has been stripped down to his underwear. He clutches at his throat. the ring has gone. Gorbag grabs for the mithril vest and draws his sword but Shagrat kicks him backwards with his foot. Gorbag falls through a trap door leading to the floor below. Gorbag lands in the guard room with a crash creating sudden alarm amongst the orcs and Urukhai stationed there. Shagrat leans through the trap door. Several Urukhai converge on Gorbag and he lashes out slashing one across the throat with his sword. The dead Urukhai topples backward over the parapet landing on top of Urukhai and orcs in the courtyard below. Within moments a brutal civil war breaks out between the two companies stationed in Cirith Ungol. Sam hurries towards the gate fearful for Frodo. Sam is confronted with the sight of over 50 slaughtered orc and Urukhai strewn over the courtyard. Angle on. Sam pounds up the staircase. He suddenly pauses. Several Urukhai are running down towards him. He grips Sting and continues charging up screaming at the top of his lungs. Angle on the four Uruks. They see a huge distorted shadow on the wall in front of them. They turn around and flee in terror back to the top of the stairs. Sam appears and before the Urukhai can fully regain their wits he slays three."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The Mumakil react with terror as spectral warriors climb up their sides routing the Haradrim from their wartowers and orcs flee in their thousands. The army of the dead swarms over the city routing the orcs. Eowyn crawls to where Theoden lays mortally wounded. Theoden looks up at Eowyn his breathing shallow and his vision clouded. Eowyn smiles down at him as she gently strokes his face. Theoden is dying. The army of the dead slowly dissolves into dust and is immediately swept away by the four winds. Aragorn turns to Gandalf who bows his head in homage. Pippin in his Gondorian armor looks around at the devastation his eyes full of sadness. They suddenly fix on something and Pippin runs through the ruin of the battle towards a small figure slumped on the ground. Sam hurries towards the gate fearful for Frodo. Sam is confronted with the sight of over 50 slaughtered orc and Urukhai strewn over the courtyard. Angle on. Sam pounds up the staircase. He suddenly pauses. Several Urukhai are running down towards him. He grips Sting and continues charging up screaming at the top of his lungs. Angle on the four Uruks. They see a huge distorted shadow on the wall in front of them. They turn around and flee in terror back to the top of the stairs. Sam appears and before the Urukhai can fully regain their wits he slays three."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The Mumakil react with terror as spectral warriors climb up their sides routing the Haradrim from their wartowers and orcs flee in their thousands. The army of the dead swarms over the city routing the orcs. Eowyn crawls to where Theoden lays mortally wounded. Theoden looks up at Eowyn his breathing shallow and his vision clouded. He grips Sting and continues charging up screaming at the top of his lungs. Angle on the four Uruks. They see a huge distorted shadow on the wall in front of them. They turn around and flee in terror back to the top of the stairs. Sam appears and before the Urukhai can fully regain their wits he slays three."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The turtles laugh with joy as transparent acrobats slide down their shells, guiding the sailors from their sailing-boats, and eagles dance in their hundreds. The band of the forgotten floats above the jungle, guiding the eagles. Helga skips to where Marcus sleeps, lightly snoring. Marcus peers up at Helga, his eyes wide and his dreams vivid. Helga frowns down at him as she briskly pats his elbow. Marcus is resting. The band of the forgotten quickly solidifies into gemstones and is softly polished by the five breezes. Leopold whispers to Horace, who taps his nose in agreement. Trevor, in his shimmering robe, glances around at the malady, his emotions full of glee. They suddenly latch onto something, and Trevor dashes through the jungle of the festival towards a tall statue leaning on the fountain. Timothy gazes unwaveringly at Trevor, delight and awe painting all other visions on Timothy's expression. Laughter rises from Trevor's mouth as he smiles at his companion. Trevor shades Timothy with an umbrella. The lens lowers towards the bright eagle nest of Mountain Crest, and a shadow dims from the lowest basement. The lens hides the nest, solidifying outside the roof into a massive warm cavern. Charlie Swindler is dancing on the ceiling. His fingers softly snap, and he dozes off. Pan down to unveil the mouse and squirrel, Marvin and Rupert, singing over Charlie's furnishings and shoes. Marvin is reaching for the golden cloak. Charlie realizes that he has been dressed up in his pajamas. He stretches towards his wrist; the bracelet is here. Marvin reaches for the golden cloak and waves his spoon, but Rupert hugs him forward with his arms. Marvin leaps over a trap bridge leading to the ceiling above. Marvin flies in the dance hall with a whisper, creating sudden harmony amongst the mice and squirrels flying there. Rupert leans over the trap bridge. Several squirrels divide on Marvin, and he whispers out, tickling one across the belly with his spoon. The giggling squirrel leaps forward over the banister, landing under squirrel and mice on the stage above. Within minutes, a gentle dance-off starts between the two flocks flying in Mountain Crest. Sally jogs away from the flag, curious about Charlie. Sally is faced with the silence of over 50 dancing mouse and squirrel, bouncing under the stage. Angle on: Sally waltzes down the escalator. She suddenly dances. Several squirrels are skating up away from her. She holds Pebble and continues gliding down, humming from the top of her throat. Angle on: the fifteen mice. They hear a tiny colorful silhouette on the ceiling behind them. They spin around and giggle in delight back to the bottom of the elevator. Sally disappears, and after the mice fail to fully lose their rhythm, she tickles three."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Spectral warriors scaling Mumakil terrorize the Haradrim and orcs, and the army of the dead overruns the city. Eowyn reaches the dying Theoden, comforting him as he passes away. The dead dissolve into dust as Aragorn and Gandalf exchange solemn gestures. Pippin, distressed by the battle's aftermath, finds Merry traumatized, covering him with a blanket as he weeps. The scene shifts to Cirith Ungol, where Frodo regains consciousness, realizing his ring is missing. Orcs Gorbag and Shagrat fight over Frodo's mithril vest, sparking a deadly skirmish. Gorbag falls, leading to a civil war among orcs and Uruk-hai. Meanwhile, Sam races to rescue Frodo, encountering a grim scene of slaughter. Confronted by Uruk-hai, Sam charges up the stairs, brandishing Sting, and kills three before they can respond."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Sam appears and before the Urukhai can fully regain their wits he slays three They turn around and flee in terror back to the top of the stairs They see a huge distorted shadow on the wall in front of them Angle on the four Uruks He grips Sting and continues charging up screaming at the top of his lungs Several Urukhai are running down towards him He suddenly pauses Sam pounds up the staircase Angle on Sam is confronted with the sight of over 50 slaughtered orc and Urukhai strewn over the courtyard Sam hurries towards the gate fearful for Frodo Within moments a brutal civil war breaks out between the two companies stationed in Cirith Ungol The dead Urukhai topples backward over the parapet landing on top of Urukhai and orcs in the courtyard below Several Urukhai converge on Gorbag and he lashes out slashing one across the throat with his sword Shagrat leans through the trap door Gorbag lands in the guard room with a crash creating sudden alarm amongst the orcs and Urukhai stationed there Gorbag falls through a trap door leading to the floor below Gorbag grabs for the mithril vest and draws his sword but Shagrat kicks him backwards with his foot the ring has gone He clutches at his throat Frodo realizes that he has been stripped down to his underwear Gorbag is snatching for the mithril vest Gorbag and Shagrat arguing over Frodo's belongings and clothes Tilt up to reveal the orc and Urukhai His eyes suddenly flicker and he wakes up Frodo Baggins is unconscious on the floor The camera reaches the tower dissolving through the wall into a small cold room The camera rises towards the dark orc tower of Cirith Ungol and a light glows from the topmost window Pippin covers Merry with a blanket Tears fall down Pippin's face as he looks on his friend Merry stares unseeing at Pippin horror and shock erasing all other memories from Merry's mind They suddenly fix on something and Pippin runs through the ruin of the battle towards a small figure slumped on the ground Pippin in his Gondorian armor looks around at the devastation his eyes full of sadness Aragorn turns to Gandalf who bows his head in homage The army of the dead slowly dissolves into dust and is immediately swept away by the four winds Theoden is dying Eowyn smiles down at him as she gently strokes his face Theoden looks up at Eowyn his breathing shallow and his vision clouded Eowyn crawls to where Theoden lays mortally wounded The army of the dead swarms over the city routing the orcs The Mumakil react with terror as spectral warriors climb up their sides routing the Haradrim from their wartowers and orcs flee in their thousands"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The army of the dead swarms over the city routing the orcs The Mumakil react with terror as spectral warriors climb up their sides routing the Haradrim from their wartowers and orcs flee in their thousands Theoden looks up at Eowyn his breathing shallow and his vision clouded Eowyn crawls to where Theoden lays mortally wounded Theoden is dying Eowyn smiles down at him as she gently strokes his face Aragorn turns to Gandalf who bows his head in homage The army of the dead slowly dissolves into dust and is immediately swept away by the four winds They suddenly fix on something and Pippin runs through the ruin of the battle towards a small figure slumped on the ground Pippin in his Gondorian armor looks around at the devastation his eyes full of sadness Tears fall down Pippin's face as he looks on his friend Merry stares unseeing at Pippin horror and shock erasing all other memories from Merry's mind The camera rises towards the dark orc tower of Cirith Ungol and a light glows from the topmost window Pippin covers Merry with a blanket Frodo Baggins is unconscious on the floor The camera reaches the tower dissolving through the wall into a small cold room Tilt up to reveal the orc and Urukhai His eyes suddenly flicker and he wakes up Gorbag is snatching for the mithril vest Gorbag and Shagrat arguing over Frodo's belongings and clothes He clutches at his throat Frodo realizes that he has been stripped down to his underwear Gorbag grabs for the mithril vest and draws his sword but Shagrat kicks him backwards with his foot the ring has gone Gorbag lands in the guard room with a crash creating sudden alarm amongst the orcs and Urukhai stationed there Gorbag falls through a trap door leading to the floor below Several Urukhai converge on Gorbag and he lashes out slashing one across the throat with his sword Shagrat leans through the trap door Within moments a brutal civil war breaks out between the two companies stationed in Cirith Ungol The dead Urukhai topples backward over the parapet landing on top of Urukhai and orcs in the courtyard below Sam is confronted with the sight of over 50 slaughtered orc and Urukhai strewn over the courtyard Sam hurries towards the gate fearful for Frodo Sam pounds up the staircase Angle on Several Urukhai are running down towards him He suddenly pauses Angle on the four Uruks He grips Sting and continues charging up screaming at the top of his lungs They turn around and flee in terror back to the top of the stairs They see a huge distorted shadow on the wall in front of them Sam appears and before the Urukhai can fully regain their wits he slays three"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He clutches at his throat the ring has gone Gorbag grabs for the mithril vest and draws his sword but Shagrat kicks him backwards with his foot Gorbag falls through a trap door leading to the floor below Gorbag lands in the guard room with a crash creating sudden alarm amongst the orcs and Urukhai stationed there Shagrat leans through the trap door Several Urukhai converge on Gorbag and he lashes out slashing one across the throat with his sword The dead Urukhai topples backward over the parapet landing on top of Urukhai and orcs in the courtyard below Within moments a brutal civil war breaks out between the two companies stationed in Cirith Ungol Sam hurries towards the gate fearful for Frodo Sam is confronted with the sight of over 50 slaughtered orc and Urukhai strewn over the courtyard Angle on Sam pounds up the staircase He suddenly pauses Several Urukhai are running down towards him He grips Sting and continues charging up screaming at the top of his lungs Angle on the four Uruks They see a huge distorted shadow on the wall in front of them They turn around and flee in terror back to the top of the stairs Sam appears and before the Urukhai can fully regain their wits he slays three The Mumakil react with terror as spectral warriors climb up their sides routing the Haradrim from their wartowers and orcs flee in their thousands The army of the dead swarms over the city routing the orcs Eowyn crawls to where Theoden lays mortally wounded Theoden looks up at Eowyn his breathing shallow and his vision clouded Eowyn smiles down at him as she gently strokes his face Theoden is dying The army of the dead slowly dissolves into dust and is immediately swept away by the four winds Aragorn turns to Gandalf who bows his head in homage Pippin in his Gondorian armor looks around at the devastation his eyes full of sadness They suddenly fix on something and Pippin runs through the ruin of the battle towards a small figure slumped on the ground Merry stares unseeing at Pippin horror and shock erasing all other memories from Merry's mind Tears fall down Pippin's face as he looks on his friend Pippin covers Merry with a blanket The camera rises towards the dark orc tower of Cirith Ungol and a light glows from the topmost window The camera reaches the tower dissolving through the wall into a small cold room Frodo Baggins is unconscious on the floor His eyes suddenly flicker and he wakes up Tilt up to reveal the orc and Urukhai Gorbag and Shagrat arguing over Frodo's belongings and clothes Gorbag is snatching for the mithril vest Frodo realizes that he has been stripped down to his underwear"
        }
      ]
    }
  ]
}