{
  "ground_truth": "Sam can't believe it—relief and joy flood through him. Smack! Out of nowhere, the figure of Smeagol crashes into them, sending Sam and Frodo sprawling. Smeagol pounces on Frodo, his fingers wrapping around Frodo's throat, snapping Frodo's neck from side to side. Frodo struggles to unlock the bony, white fingers around his neck, but Smeagol's grip is too strong. Smeagol's fingers tighten around Frodo's neck, squeezing the life out of him. Whack! A rock connects with the side of Smeagol's head. Sam jumps on a stunned Smeagol. The battle between men and orcs rages on. From Mordor, high overhead, the Nazgul fly out into the fray. All the old hatred between Sam and Smeagol boils over as they fight. Sam falls back, and Smeagol bites at him. Sam pushes Smeagol away with his feet, rolls to his knees, as Smeagol charges at him. Sam slashes out with Sting, cutting Smeagol across the stomach. Smeagol staggers back, screaming with pain. Sam looks around desperately for Frodo. The eagles engage the Nazgul. Sam is gasping, his lungs exploding as he races up the slopes of Mount Doom searching for Frodo. Sam arrives at the stone doorway of Sammath Naur leading into the mountain and staggers into it. Sam flinches against the fierce heat blasting down the tunnel. Sam lurches forward towards an orange glow deep in the heart of the mountain. The heat is almost unbearable. Sam sees Frodo standing on the edge of the Crack of Doom, a deep lava-filled chasm in the very heart of ancient Sauron's forges, the greatest in Middle-earth. The raging orange glare from the chasm turns Frodo into a black silhouette, standing tense and still. Frodo holds the Ring in his hand and raises it over the bubbling lava far below, a strange expression on his face. The hum of the Ring grows louder and louder. Frodo pulls the Ring close to his body as he turns to Sam. Frodo looks at Sam; the Ring has finally taken him. Sam screams as Frodo puts the Ring on and vanishes. With a storm of wings, the Nazgul wheel around and hurtle towards Mount Doom. In the midst of the battle, Gandalf realizes Frodo has been seen. Footprints move across the ash-covered cavern. Suddenly, Gollum smashes a rock down on Sam's head, knocking him to the ground. Gollum leaps onto the invisible Frodo's footprints, clawing frantically, riding on the back of the invisible Frodo. Aragorn turns and is confronted by an armoured troll wielding an enormous mallet. Gollum suddenly lifts his hands to his face and bites.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sam cannot believe it—relief and joy inundate through him. Smack! Out of nowhere, the shape of Smeagol crashes into them, sending Sam and Frodo sprawling. Smeagol leaps on Frodo, his digits wrapping around Frodo's throat, snapping Frodo's neck from side to side. Frodo struggles to unlock the bony, white digits around his neck, but Smeagol's grasp is too strong. Smeagol's digits tighten around Frodo's neck, squeezing the life out of him. Whack! A rock connects with the side of Smeagol's head. Sam jumps on a stunned Smeagol. The combat between men and orcs rages on. From Mordor, high overhead, the Nazgul fly out into the fray. All the old animosity between Sam and Smeagol boils over as they clash. Sam falls back, and Smeagol bites at him. Sam pushes Smeagol away with his feet, rolls to his knees, as Smeagol charges at him. Sam slashes out with Sting, cutting Smeagol across the abdomen. Smeagol staggers back, screaming with agony. Sam looks around desperately for Frodo. The eagles engage the Nazgul. Sam is gasping, his lungs exploding as he races up the slopes of Mount Doom searching for Frodo. Sam arrives at the stone threshold of Sammath Naur leading into the mountain and staggers into it. Sam flinches against the fierce heat blasting down the passage. Sam lurches forward towards an orange glow deep in the core of the mountain. The heat is almost unbearable. Sam sees Frodo standing on the brink of the Crack of Doom, a deep lava-filled abyss in the very core of ancient Sauron's forges, the greatest in Middle-earth. The raging orange glare from the abyss turns Frodo into a black silhouette, standing tense and still. Frodo holds the Ring in his hand and raises it over the bubbling lava far below, a strange expression on his visage. The hum of the Ring grows louder and louder. Frodo pulls the Ring close to his body as he turns to Sam. Frodo looks at Sam; the Ring has finally taken him. Sam screams as Frodo puts the Ring on and vanishes. With a storm of wings, the Nazgul wheel around and hurtle towards Mount Doom. In the midst of the clash, Gandalf realizes Frodo has been seen. Footprints move across the ash-covered cavern. Suddenly, Gollum smashes a rock down on Sam's head, knocking him to the ground. Gollum leaps onto the invisible Frodo's footprints, clawing frantically, riding on the back of the invisible Frodo. Aragorn turns and is confronted by an armoured troll wielding an enormous mallet. Gollum suddenly lifts his hands to his face and bites."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Sam can't believe it—relief and joy are felt by him. Smack! Out of nowhere, they are crashed into by the figure of Smeagol, sending Sam and Frodo sprawling. Frodo is pounced on by Smeagol, his throat being wrapped around by Smeagol's fingers, with Frodo's neck being snapped from side to side. The bony, white fingers around Frodo's neck are struggled against by Frodo, but the grip of Smeagol is too strong. Frodo's neck is tightened around by Smeagol's fingers, with the life being squeezed out of him. Whack! The side of Smeagol's head is connected with by a rock. A stunned Smeagol is jumped on by Sam. Men and orcs continue to rage on in battle. High overhead from Mordor, the Nazgul fly out into the fray. The old hatred between Sam and Smeagol boils over as they fight. Sam falls back, and Smeagol bites at him. Smeagol is pushed away by Sam with his feet, and Sam rolls to his knees, as Smeagol charges at him. Sting is slashed out with by Sam, and Smeagol is cut across the stomach. Back, Smeagol staggers, screaming with pain. Desperately, around Sam looks for Frodo. The Nazgul are engaged by the eagles. Sam is gasping, as he races up the slopes of Mount Doom searching for Frodo, his lungs exploding. At the stone doorway of Sammath Naur, Sam arrives, leading into the mountain and staggering into it. Against the fierce heat blasting down the tunnel, Sam flinches. Towards an orange glow deep in the heart of the mountain, forward Sam lurches. The heat is found almost unbearable by him. On the edge of the Crack of Doom, Sam sees Frodo standing, chasm-filled with deep lava in the very heart of ancient Sauron's forges, the greatest in Middle-earth. Into a black silhouette, Frodo is turned by the raging orange glare from the chasm, standing tense and still. In his hand, the Ring is held by Frodo and it is raised over the bubbling lava far below, a strange expression on his face. The hum of the Ring is growing louder and louder. The Ring is pulled close to his body by Frodo as he turns to Sam. Sam is looked at by Frodo; he has finally been taken by the Ring. Sam screams as the Ring is put on by Frodo and vanishes. With a storm of wings, around the Nazgul wheel and they hurtle towards Mount Doom. In the midst of the battle, that Frodo has been seen is realized by Gandalf. Across the ash-covered cavern, footprints are moved. A rock is suddenly smashed down on Sam's head by Gollum, and he is knocked to the ground. Onto the invisible Frodo's footprints, Gollum leaps, frantically clawing, riding on the back of the invisible Frodo. Aragorn turns and confronts an armoured troll wielding an enormous mallet. His hands are suddenly lifted by Gollum to his face and he bites."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Sam is overwhelmed with relief and joy. Suddenly, Smeagol crashes into them, sending Sam and Frodo sprawling. Smeagol attacks Frodo, wrapping his fingers around Frodo's throat. Frodo struggles, but Smeagol's grip is too strong. A rock hits Smeagol's head, and Sam jumps on him. The battle with orcs continues, and Nazgul fly overhead. Sam and Smeagol's old hatred resurfaces as they fight. Sam pushes Smeagol away, rolls to his knees, and slashes Smeagol with Sting. Smeagol screams in pain. Sam desperately searches for Frodo. Eagles engage the Nazgul. Sam races up Mount Doom, gasping, and reaches Sammath Naur. He flinches at the heat and moves toward an orange glow. Sam sees Frodo at the Crack of Doom, holding the Ring over the lava. The Ring's hum grows louder. Frodo pulls the Ring close and turns to Sam, finally succumbing to it. Sam screams as Frodo vanishes with the Ring. The Nazgul fly toward Mount Doom. Gandalf realizes Frodo has been seen. Footprints appear in the ash. Gollum knocks Sam down and leaps onto Frodo's invisible footprints. Aragorn faces an armored troll with a mallet. Gollum suddenly bites his own hands."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Sam is overwhelmed with relief and joy. Suddenly, Smeagol crashes into them, sending Sam and Frodo sprawling. Smeagol attacks Frodo, gripping his throat tightly. Frodo struggles, but Smeagol's hold is too strong. A rock hits Smeagol's head, and Sam jumps on him. The battle with orcs continues, and Nazgul fly overhead. Sam and Smeagol's hatred erupts as they fight. Sam pushes Smeagol away, then slashes him with Sting. Smeagol screams in pain. Sam searches for Frodo as eagles engage the Nazgul. Gasping, Sam races up Mount Doom, reaching Sammath Naur. He flinches at the heat and moves toward an orange glow. Sam sees Frodo at the Crack of Doom, holding the Ring over the lava. The Ring's hum grows louder. Frodo pulls the Ring close, looks at Sam, and vanishes. The Nazgul fly toward Mount Doom. Gandalf realizes Frodo is seen. Footprints appear in the ash. Gollum hits Sam with a rock, then leaps onto Frodo's invisible footprints. Aragorn faces an armoured troll. Gollum bites his own hands."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Sam is in a state of disbelief—an overwhelming wave of relief and joy surges through him, filling his entire being. Smack! Out of nowhere, the unexpected figure of Smeagol crashes into them with force, sending both Sam and Frodo sprawling to the ground. Smeagol pounces aggressively on Frodo, his fingers wrapping tightly around Frodo's throat, snapping Frodo's neck from side to side with a vicious intent. Frodo struggles desperately to unlock the bony, white fingers that are clamped around his neck, but Smeagol's grip is unyieldingly strong. Smeagol's fingers tighten even more around Frodo's neck, squeezing the very life out of him. Whack! A rock suddenly connects with the side of Smeagol's head. Sam leaps onto a stunned Smeagol. Meanwhile, the fierce battle between men and orcs continues to rage on. From the dark lands of Mordor, high overhead, the Nazgul fly out into the chaotic fray. All the old hatred and animosity between Sam and Smeagol boils over as they engage in a fierce fight. Sam falls back, and Smeagol bites at him with ferocity. Sam pushes Smeagol away with his feet, rolls to his knees, just as Smeagol charges at him again. Sam slashes out with Sting, cutting Smeagol across the stomach. Smeagol staggers back, screaming in agony. Sam looks around desperately, searching for Frodo. The eagles engage the Nazgul in battle. Sam is gasping for breath, his lungs feeling as if they are about to explode as he races up the steep slopes of Mount Doom, frantically searching for Frodo. Sam arrives at the stone doorway of Sammath Naur, which leads into the mountain, and he staggers into it. Sam flinches against the fierce, intense heat blasting down the tunnel. Sam lurches forward towards an ominous orange glow deep in the heart of the mountain. The heat is almost unbearable, searing his skin. Sam sees Frodo standing on the very edge of the Crack of Doom, a deep, lava-filled chasm in the very heart of ancient Sauron's forges, the greatest in all of Middle-earth. The raging orange glare from the chasm turns Frodo into a stark black silhouette, standing tense and still. Frodo holds the Ring in his hand and raises it over the bubbling lava far below, a strange expression on his face. The hum of the Ring grows louder and louder, filling the air. Frodo pulls the Ring close to his body as he turns to face Sam. Frodo looks at Sam; the Ring has finally taken hold of him. Sam screams in horror as Frodo puts the Ring on and vanishes from sight. With a storm of wings, the Nazgul wheel around and hurtle towards Mount Doom. In the midst of the ongoing battle, Gandalf realizes that Frodo has been seen. Footprints move across the ash-covered cavern. Suddenly, Gollum smashes a rock down on Sam's head, knocking him to the ground. Gollum leaps onto the invisible Frodo's footprints, clawing frantically, riding on the back of the invisible Frodo. Aragorn turns and is confronted by an enormous armoured troll wielding a gigantic mallet. Gollum suddenly lifts his hands to his face and bites down."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Sam finds himself utterly overwhelmed by a profound sense of disbelief—a powerful and overwhelming wave of immense relief and sheer joy surges through him, filling every part of his being. Smack! Out of absolutely nowhere, the unexpected and menacing figure of Smeagol crashes into them with incredible force, sending both Sam and Frodo sprawling onto the unforgiving ground. In a heartbeat, Smeagol pounces aggressively on Frodo, his gnarled fingers wrapping tightly around Frodo's throat, snapping Frodo's neck back and forth with terrifying and vicious intent. Frodo struggles desperately to pry apart the bony, white fingers that are clamped around his neck, but Smeagol's grip remains unyieldingly strong and relentless. Smeagol's fingers tighten even more around Frodo's neck, squeezing the very life out of him. Whack! A rock suddenly connects with the side of Smeagol's head. Sam leaps onto a stunned Smeagol. Meanwhile, the fierce and tumultuous battle between men and orcs continues to rage on with unbridled ferocity. From the dark lands of Mordor, high overhead, the ominous Nazgul fly out into the chaotic fray. All the old hatred and deep animosity between Sam and Smeagol boils over as they engage in a fierce and vicious fight. Sam falls back, and Smeagol bites at him with ferocious intensity. Sam pushes Smeagol away with his feet, rolling swiftly to his knees, just as Smeagol charges at him once again. Sam slashes out with Sting, cutting Smeagol across the stomach. Smeagol staggers back, screaming in utter agony. Sam looks around desperately, urgently searching for Frodo. The mighty eagles engage the fearsome Nazgul in battle. Sam is gasping for breath, his lungs feeling as if they are about to explode as he races up the steep slopes of Mount Doom, frantically searching for Frodo. Sam arrives at the stone doorway of Sammath Naur, which leads into the heart of the mountain, and he staggers into it. Sam flinches against the fierce and intense heat blasting down the tunnel. Sam lurches forward towards an ominous and vivid orange glow deep in the very heart of the mountain. The heat is almost unbearable, searing his skin with its intensity. Sam sees Frodo standing on the very edge of the Crack of Doom, a deep, lava-filled chasm, in the very heart of ancient Sauron's forges, the greatest in all of Middle-earth. The raging, fiery orange glare from the chasm turns Frodo into a stark black silhouette, standing tense and still. Frodo holds the Ring in his hand and raises it over the bubbling lava far below, a strange and unsettling expression on his face. The hum of the Ring grows louder and louder, filling the air around them. Frodo pulls the Ring close to his body, turning to face Sam. Frodo looks at Sam with a gaze that reveals the Ring has finally taken hold of him. Sam screams in horror as Frodo puts the Ring on and vanishes entirely from sight. With a storm of wings, the Nazgul wheel around and hurtle towards the ominous Mount Doom. In the midst of the ongoing and chaotic battle, Gandalf realizes that Frodo has been seen. Footprints move across the ash-covered cavern floor. Suddenly, Gollum smashes a rock down on Sam's head, knocking him harshly to the ground. Gollum leaps onto the invisible Frodo's footprints, clawing frantically, riding on the back of the invisible Frodo. At the same time, Aragorn turns and is confronted by an enormous armored troll wielding a gigantic mallet. Gollum suddenly lifts his hands to his face and bites down."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Sam is overwhelmed with disbelief as a wave of relief and joy surges through him, only to be abruptly interrupted when, without warning, the figure of Smeagol crashes into them with a forceful impact, sending both Sam and Frodo sprawling across the ground. In an instant, Smeagol pounces on Frodo, his fingers swiftly wrapping around Frodo's throat, violently snapping Frodo's neck from side to side in a desperate struggle. Frodo, gasping for air, fights to pry the bony, white fingers from his neck, but Smeagol's grip is unyielding and too powerful to break. As Smeagol's fingers tighten further, squeezing the life out of Frodo, a sudden whack echoes as a rock strikes the side of Smeagol's head, momentarily stunning him. Seizing the opportunity, Sam leaps onto the dazed Smeagol, and amidst the chaos, the battle between men and orcs continues to rage on around them. High above, the Nazgul emerge from Mordor, soaring into the fray. The long-standing animosity between Sam and Smeagol reaches a boiling point as they engage in a fierce struggle. Sam, momentarily losing his balance, falls back as Smeagol lunges forward, attempting to bite him. In a swift defensive move, Sam pushes Smeagol away with his feet, rolling onto his knees just as Smeagol charges at him again. With a quick slash, Sam wields Sting, cutting Smeagol across the stomach, causing Smeagol to stagger back, screaming in agony. Desperately, Sam scans his surroundings for any sign of Frodo. Meanwhile, the eagles engage the Nazgul in battle. Sam, his lungs burning and gasping for air, races up the slopes of Mount Doom in a frantic search for Frodo. He arrives at the stone doorway of Sammath Naur, leading into the mountain, and staggers inside, flinching against the intense heat that blasts down the tunnel. Despite the almost unbearable heat, Sam lurches forward, drawn towards an orange glow deep within the heart of the mountain. There, he sees Frodo standing on the edge of the Crack of Doom, a deep chasm filled with bubbling lava, situated in the very heart of ancient Sauron's forges, the greatest in Middle-earth. The raging orange glare from the chasm casts Frodo into a stark black silhouette, standing tense and still. Frodo holds the Ring in his hand, raising it over the bubbling lava far below, a strange expression etched on his face as the hum of the Ring grows louder and louder. Suddenly, Frodo pulls the Ring close to his body, turning to face Sam with a look that reveals the Ring has finally taken hold of him. Sam screams in horror as Frodo places the Ring on his finger and vanishes from sight. With a storm of wings, the Nazgul wheel around and hurtle towards Mount Doom. Amidst the ongoing battle, Gandalf realizes that Frodo has been seen. Invisible footprints begin to move across the ash-covered cavern. Out of nowhere, Gollum smashes a rock down on Sam's head, knocking him to the ground. Gollum then leaps onto the invisible Frodo's footprints, clawing frantically and riding on the back of the unseen Frodo. Meanwhile, Aragorn turns to find himself face-to-face with an armored troll wielding an enormous mallet. In a sudden, frenzied motion, Gollum lifts his hands to his face and bites down."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Sam is overwhelmed with relief and joy, but suddenly, Smeagol crashes into him and Frodo, sending them sprawling. Smeagol attacks Frodo, gripping his throat tightly. Despite Frodo's struggle, Smeagol's hold is unyielding until a rock strikes Smeagol's head. Sam seizes the moment to tackle Smeagol, and amidst the chaos of battle between men and orcs, the Nazgul soar overhead. The animosity between Sam and Smeagol intensifies as they fight. Sam fends off Smeagol's bite, pushes him away, and, as Smeagol charges again, slashes him with Sting, causing Smeagol to retreat in pain. Desperately searching for Frodo, Sam races up Mount Doom, gasping for breath, and enters the fiery tunnel of Sammath Naur. He presses on through the intense heat toward the orange glow, finding Frodo at the Crack of Doom, silhouetted against the lava. Frodo holds the Ring, poised to drop it, but instead pulls it back, succumbing to its power. As Frodo vanishes with the Ring, Sam screams in despair. The Nazgul, alerted to Frodo's presence, descend upon Mount Doom. Amidst the battle, Gandalf realizes Frodo has been detected. Gollum suddenly attacks Sam, knocking him down, and leaps onto Frodo's invisible form, clawing frantically. Meanwhile, Aragorn faces an armoured troll with a massive mallet as Gollum bites into his own hands."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Sam can't believe it—relief and joy flood through him at the prospect of completing their dangerous quest. Smack! Out of nowhere, the figure of Smeagol, once known as Gollum and cursed by his obsession with the Ring, crashes into them, sending Sam and Frodo sprawling. Smeagol, driven by a twisted desire to regain the Ring, pounces on Frodo, his fingers wrapping around Frodo's throat, snapping Frodo's neck from side to side. Frodo struggles to unlock the bony, white fingers around his neck, but Smeagol's grip is too strong. Smeagol's fingers tighten around Frodo's neck, squeezing the life out of him. Whack! A rock, hurled with desperation, connects with the side of Smeagol's head. Sam jumps on a stunned Smeagol, fueled by his loyalty and courage in the face of evil. The battle between men and orcs, the dark forces of Sauron, rages on. From Mordor, high overhead, the dreaded Nazgul, the Ringwraiths who serve Sauron, fly out into the fray. All the old hatred between Sam and Smeagol, a result of their long and treacherous journey, boils over as they fight. Sam falls back, and Smeagol bites at him with feral intensity. Sam pushes Smeagol away with his feet, rolls to his knees, as Smeagol charges at him. Sam slashes out with Sting, the Elvish blade given to him in Rivendell, cutting Smeagol across the stomach. Smeagol staggers back, screaming with pain. Sam looks around desperately for Frodo. The eagles, great birds allied to the forces of good, engage the Nazgul. Sam is gasping, his lungs exploding as he races up the slopes of Mount Doom, the fiery volcano where the Ring was forged, searching for Frodo. Sam arrives at the stone doorway of Sammath Naur, the chamber where Sauron forged the One Ring, leading into the mountain and staggers into it. Sam flinches against the fierce heat blasting down the tunnel. Sam lurches forward towards an orange glow deep in the heart of the mountain. The heat is almost unbearable. Sam sees Frodo standing on the edge of the Crack of Doom, a deep lava-filled chasm in the very heart of ancient Sauron's forges, the greatest in Middle-earth. The raging orange glare from the chasm turns Frodo into a black silhouette, standing tense and still. Frodo holds the Ring in his hand and raises it over the bubbling lava far below, a strange expression on his face. The hum of the Ring, filled with dark power, grows louder and louder. Frodo pulls the Ring close to his body as he turns to Sam. Frodo looks at Sam; the Ring has finally taken him, corrupting his will. Sam screams as Frodo puts the Ring on and vanishes, becoming invisible as the Ring grants him its power. With a storm of wings, the Nazgul, sensing the Ring, wheel around and hurtle towards Mount Doom. In the midst of the battle, Gandalf, the wise wizard and leader of their quest, realizes Frodo has been seen. Footprints move across the ash-covered cavern. Suddenly, Gollum, driven by his obsession, smashes a rock down on Sam's head, knocking him to the ground. Gollum leaps onto the invisible Frodo's footprints, clawing frantically, riding on the back of the invisible Frodo. Aragorn, the rightful king of Gondor, turns and is confronted by an armoured troll wielding an enormous mallet, a formidable foe in the chaotic battlefield. Gollum suddenly lifts his hands to his face and bites, consumed by his internal struggle and the Ring's influence."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Sam cannot believe it—relief and joy flood through him. Smack. Out of nowhere. the figure of Smeagol crashes into them sending Sam and Frodo sprawling. Smeagol pounces on Frodo his fingers wrapping around Frodo's throat snapping Frodo's neck from side to side. Frodo struggles to unlock the bony white fingers around his neck but Smeagol's grip is too strong. Smeagol's fingers tighten around Frodo's neck squeezing the life out of him. Whack. A rock connects with the side of Smeagol's head. Sam jumps on a stunned Smeagol. The battle between men and orcs rages on. From Mordor high overhead the Nazgul fly out into the fray. All the old hatred between Sam and Smeagol boils over as they fight. Sam falls back and Smeagol bites at him. Sam pushes Smeagol away with his feet rolls to his knees as Smeagol charges at him. Sam slashes out with Sting cutting Smeagol across the stomach. Smeagol staggers back screaming with pain. Sam looks around desperately for Frodo. The eagles engage the Nazgul. Sam is gasping his lungs exploding as he races up the slopes of Mount Doom searching for Frodo. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Sam arrives at the stone doorway of Sammath Naur leading into the mountain and staggers into it. Sam flinches against the fierce heat blasting down the tunnel. Sam lurches forward towards an orange glow deep in the heart of the mountain. The heat is almost unbearable. Sam sees Frodo standing on the edge of the Crack of Doom a deep lavafilled chasm in the very heart of ancient Sauron's forges the greatest in Middleearth. The raging orange glare from the chasm turns Frodo into a black silhouette standing tense and still. Frodo holds the Ring in his hand and raises it over the bubbling lava far below. a strange expression on his face. The hum of the Ring grows louder and louder. Frodo pulls the Ring close to his body as he turns to Sam. Frodo looks at Sam. the Ring has finally taken him. Sam screams as Frodo puts the Ring on and vanishes. With a storm of wings the Nazgul wheel around and hurtle towards Mount Doom. In the midst of the battle Gandalf realizes Frodo has been seen. Footprints move across the ashcovered cavern. Suddenly Gollum smashes a rock down on Sam's head knocking him to the ground. Gollum leaps onto the invisible Frodo's footprints clawing frantically riding on the back of the invisible Frodo. Aragorn turns and is confronted by an armoured troll wielding an enormous mallet. Gollum suddenly lifts his hands to his face and bites."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Sam cannot believe it—relief and joy flood through him. Smack. Out of nowhere. the figure of Smeagol crashes into them sending Sam and Frodo sprawling. Smeagol pounces on Frodo his fingers wrapping around Frodo's throat snapping Frodo's neck from side to side. Frodo struggles to unlock the bony white fingers around his neck but Smeagol's grip is too strong. Smeagol's fingers tighten around Frodo's neck squeezing the life out of him. Whack. A rock connects with the side of Smeagol's head. Sam jumps on a stunned Smeagol. The battle between men and orcs rages on. From Mordor high overhead the Nazgul fly out into the fray. All the old hatred between Sam and Smeagol boils over as they fight. Sam falls back and Smeagol bites at him. Sam pushes Smeagol away with his feet rolls to his knees as Smeagol charges at him. Sam slashes out with Sting cutting Smeagol across the stomach. Smeagol staggers back screaming with pain. Sam looks around desperately for Frodo. The eagles engage the Nazgul. Sam is gasping his lungs exploding as he races up the slopes of Mount Doom searching for Frodo. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. Sam arrives at the stone doorway of Sammath Naur leading into the mountain and staggers into it. Sam flinches against the fierce heat blasting down the tunnel. Sam lurches forward towards an orange glow deep in the heart of the mountain. The heat is almost unbearable. Sam sees Frodo standing on the edge of the Crack of Doom a deep lavafilled chasm in the very heart of ancient Sauron's forges the greatest in Middleearth. The raging orange glare from the chasm turns Frodo into a black silhouette standing tense and still. Frodo holds the Ring in his hand and raises it over the bubbling lava far below. a strange expression on his face. The hum of the Ring grows louder and louder. Frodo pulls the Ring close to his body as he turns to Sam. Frodo looks at Sam. the Ring has finally taken him. Sam screams as Frodo puts the Ring on and vanishes. With a storm of wings the Nazgul wheel around and hurtle towards Mount Doom. In the midst of the battle Gandalf realizes Frodo has been seen. Footprints move across the ashcovered cavern. Suddenly Gollum smashes a rock down on Sam's head knocking him to the ground. Gollum leaps onto the invisible Frodo's footprints clawing frantically riding on the back of the invisible Frodo. Aragorn turns and is confronted by an armoured troll wielding an enormous mallet. Gollum suddenly lifts his hands to his face and bites."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Sam cannot believe it—relief and joy flood through him. Smack. Out of nowhere. the figure of Smeagol crashes into them sending Sam and Frodo sprawling. Smeagol pounces on Frodo his fingers wrapping around Frodo's throat snapping Frodo's neck from side to side. Frodo struggles to unlock the bony white fingers around his neck but Smeagol's grip is too strong. Smeagol's fingers tighten around Frodo's neck squeezing the life out of him. Whack. A rock connects with the side of Smeagol's head. Sam jumps on a stunned Smeagol. Frodo looks at Sam. the Ring has finally taken him. Sam screams as Frodo puts the Ring on and vanishes. With a storm of wings the Nazgul wheel around and hurtle towards Mount Doom. In the midst of the battle Gandalf realizes Frodo has been seen. Footprints move across the ashcovered cavern. Suddenly Gollum smashes a rock down on Sam's head knocking him to the ground. Gollum leaps onto the invisible Frodo's footprints clawing frantically riding on the back of the invisible Frodo. Aragorn turns and is confronted by an armoured troll wielding an enormous mallet. Gollum suddenly lifts his hands to his face and bites."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Sam cannot believe it—relief and joy flood through him. Smack. Out of nowhere. the figure of Smeagol crashes into them sending Sam and Frodo sprawling. Suddenly Gollum smashes a rock down on Sam's head knocking him to the ground. Gollum leaps onto the invisible Frodo's footprints clawing frantically riding on the back of the invisible Frodo. Aragorn turns and is confronted by an armoured troll wielding an enormous mallet. Gollum suddenly lifts his hands to his face and bites."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Jordan can't fathom it—confusion and sorrow cascade through her. Whap! Out of the blue, the silhouette of Gizmo collides with them, sending Jordan and Terry tumbling. Gizmo lunges at Terry, his toes curling around Terry's wrist, twisting Terry's arm from side to side. Terry grapples to unhook the rigid, gray toes around his wrist, but Gizmo's hold is too firm. Gizmo's toes constrict around Terry's wrist, draining the strength out of him. Bam! A pebble connects with the corner of Gizmo's jaw. Jordan leaps on a dazed Gizmo. The skirmish between elves and goblins surges on. From Gondor, far beneath, the Wyverns dive into the melee. All the dormant rivalry between Jordan and Gizmo erupts as they clash. Jordan stumbles back, and Gizmo snaps at her. Jordan shoves Gizmo aside with her knees, rolls onto her feet, as Gizmo barrels at her. Jordan swipes out with Dagger, slicing Gizmo across the ankle. Gizmo reels back, howling with agony. Jordan glances around frantically for Terry. The falcons engage the Wyverns. Jordan is panting, her heart bursting as she sprints up the paths of Mount Blaze searching for Terry. Jordan reaches the metallic portal of Draken's Lair leading into the volcano and lurches into it. Jordan winces against the searing cold gusting up the corridor. Jordan stumbles forward towards a blue glow deep in the core of the volcano. The chill is nearly intolerable. Jordan spots Terry standing on the brim of the Rift of Fear, a shallow ice-filled crevasse in the very core of ancient Drake's furnaces, the smallest in Middle-earth. The ferocious blue gleam from the crevasse casts Terry into a white shade, standing tense and rigid. Terry holds the Amulet in his hand and lifts it over the bubbling ice far above, a bewildered expression on his face. The buzz of the Amulet grows softer and softer. Terry draws the Amulet close to his chest as he spins to Jordan. Terry gazes at Jordan; the Amulet has completely enchanted him. Jordan yells as Terry places the Amulet on and disappears. With a gale of talons, the Wyverns circle around and dive towards Mount Blaze. In the heart of the brawl, Merlin realizes Terry has been discovered. Pawprints tread across the ice-coated chamber. Abruptly, Gremlin hurls a boulder down on Jordan's shoulder, sending her to the ground. Gremlin vaults onto the invisible Terry's pawprints, grappling vigorously, riding on the neck of the invisible Terry. Boromir pivots and is faced with a cloaked ogre swinging an enormous hammer. Gremlin suddenly raises his paws to his ears and gnaws."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Sam is flooded with relief and joy, but Smeagol suddenly attacks, strangling Frodo. As Sam and Smeagol fight fiercely, a rock stuns Smeagol, allowing Sam to pursue Frodo. Overhead, the Nazgul battle with eagles, while Sam races through the intense heat of Mount Doom searching for Frodo. He finds Frodo at the Crack of Doom, poised to destroy the Ring but succumbing to its power instead. Frodo, captivated by the Ring, vanishes as he puts it on. Nazgul approach Mount Doom while Gandalf realizes Frodo's plight. Gollum knocks Sam down and leaps at the invisible Frodo, clawing at him. As Aragorn faces an armoured troll, Gollum bites in a desperate struggle."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Gollum suddenly lifts his hands to his face and bites Aragorn turns and is confronted by an armoured troll wielding an enormous mallet  Gollum leaps onto the invisible Frodo's footprints clawing frantically riding on the back of the invisible Frodo  Suddenly Gollum smashes a rock down on Sam's head knocking him to the ground  Footprints move across the ashcovered cavern  In the midst of the battle Gandalf realizes Frodo has been seen  With a storm of wings the Nazgul wheel around and hurtle towards Mount Doom  Sam screams as Frodo puts the Ring on and vanishes  the Ring has finally taken him  Frodo looks at Sam  Frodo pulls the Ring close to his body as he turns to Sam  The hum of the Ring grows louder and louder  a strange expression on his face  Frodo holds the Ring in his hand and raises it over the bubbling lava far below  The raging orange glare from the chasm turns Frodo into a black silhouette standing tense and still  Sam sees Frodo standing on the edge of the Crack of Doom a deep lavafilled chasm in the very heart of ancient Sauron's forges the greatest in Middleearth  The heat is almost unbearable  Sam lurches forward towards an orange glow deep in the heart of the mountain  Sam flinches against the fierce heat blasting down the tunnel  Sam arrives at the stone doorway of Sammath Naur leading into the mountain and staggers into it  Sam is gasping his lungs exploding as he races up the slopes of Mount Doom searching for Frodo  The eagles engage the Nazgul  Sam looks around desperately for Frodo  Smeagol staggers back screaming with pain  Sam slashes out with Sting cutting Smeagol across the stomach  Sam pushes Smeagol away with his feet rolls to his knees as Smeagol charges at him  Sam falls back and Smeagol bites at him  All the old hatred between Sam and Smeagol boils over as they fight  From Mordor high overhead the Nazgul fly out into the fray  The battle between men and orcs rages on  Sam jumps on a stunned Smeagol  A rock connects with the side of Smeagol's head  Whack  Smeagol's fingers tighten around Frodo's neck squeezing the life out of him  Frodo struggles to unlock the bony white fingers around his neck but Smeagol's grip is too strong  Smeagol pounces on Frodo his fingers wrapping around Frodo's throat snapping Frodo's neck from side to side  Out of nowhere the figure of Smeagol crashes into them sending Sam and Frodo sprawling  Smack  Sam can't believe it—relief and joy flood through him "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Smack Sam cannot believe it—relief and joy flood through him the figure of Smeagol crashes into them sending Sam and Frodo sprawling Out of nowhere Frodo struggles to unlock the bony white fingers around his neck but Smeagol's grip is too strong Smeagol pounces on Frodo his fingers wrapping around Frodo's throat snapping Frodo's neck from side to side Whack Smeagol's fingers tighten around Frodo's neck squeezing the life out of him Sam jumps on a stunned Smeagol A rock connects with the side of Smeagol's head From Mordor high overhead the Nazgul fly out into the fray The battle between men and orcs rages on Sam falls back and Smeagol bites at him All the old hatred between Sam and Smeagol boils over as they fight Sam slashes out with Sting cutting Smeagol across the stomach Sam pushes Smeagol away with his feet rolls to his knees as Smeagol charges at him Sam looks around desperately for Frodo Smeagol staggers back screaming with pain Sam is gasping his lungs exploding as he races up the slopes of Mount Doom searching for Frodo The eagles engage the Nazgul Sam flinches against the fierce heat blasting down the tunnel Sam arrives at the stone doorway of Sammath Naur leading into the mountain and staggers into it The heat is almost unbearable Sam lurches forward towards an orange glow deep in the heart of the mountain The raging orange glare from the chasm turns Frodo into a black silhouette standing tense and still Sam sees Frodo standing on the edge of the Crack of Doom a deep lavafilled chasm in the very heart of ancient Sauron's forges the greatest in Middleearth a strange expression on his face Frodo holds the Ring in his hand and raises it over the bubbling lava far below Frodo pulls the Ring close to his body as he turns to Sam The hum of the Ring grows louder and louder the Ring has finally taken him Frodo looks at Sam With a storm of wings the Nazgul wheel around and hurtle towards Mount Doom Sam screams as Frodo puts the Ring on and vanishes Footprints move across the ashcovered cavern In the midst of the battle Gandalf realizes Frodo has been seen Gollum leaps onto the invisible Frodo's footprints clawing frantically riding on the back of the invisible Frodo Suddenly Gollum smashes a rock down on Sam's head knocking him to the ground Gollum suddenly lifts his hands to his face and bites Aragorn turns and is confronted by an armoured troll wielding an enormous mallet"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Sam flinches against the fierce heat blasting down the tunnel  Sam lurches forward towards an orange glow deep in the heart of the mountain  The heat is almost unbearable  Sam sees Frodo standing on the edge of the Crack of Doom a deep lavafilled chasm in the very heart of ancient Sauron's forges the greatest in Middleearth  The raging orange glare from the chasm turns Frodo into a black silhouette standing tense and still  Frodo holds the Ring in his hand and raises it over the bubbling lava far below  a strange expression on his face  The hum of the Ring grows louder and louder  Frodo pulls the Ring close to his body as he turns to Sam  Frodo looks at Sam  the Ring has finally taken him  Sam screams as Frodo puts the Ring on and vanishes  With a storm of wings the Nazgul wheel around and hurtle towards Mount Doom  In the midst of the battle Gandalf realizes Frodo has been seen  Footprints move across the ashcovered cavern  Suddenly Gollum smashes a rock down on Sam's head knocking him to the ground  Gollum leaps onto the invisible Frodo's footprints clawing frantically riding on the back of the invisible Frodo  Aragorn turns and is confronted by an armoured troll wielding an enormous mallet  Gollum suddenly lifts his hands to his face and bites Sam can't believe it—relief and joy flood through him  Smack  Out of nowhere the figure of Smeagol crashes into them sending Sam and Frodo sprawling  Smeagol pounces on Frodo his fingers wrapping around Frodo's throat snapping Frodo's neck from side to side  Frodo struggles to unlock the bony white fingers around his neck but Smeagol's grip is too strong  Smeagol's fingers tighten around Frodo's neck squeezing the life out of him  Whack  A rock connects with the side of Smeagol's head  Sam jumps on a stunned Smeagol  The battle between men and orcs rages on  From Mordor high overhead the Nazgul fly out into the fray  All the old hatred between Sam and Smeagol boils over as they fight  Sam falls back and Smeagol bites at him  Sam pushes Smeagol away with his feet rolls to his knees as Smeagol charges at him  Sam slashes out with Sting cutting Smeagol across the stomach  Smeagol staggers back screaming with pain  Sam looks around desperately for Frodo  The eagles engage the Nazgul  Sam is gasping his lungs exploding as he races up the slopes of Mount Doom searching for Frodo  Sam arrives at the stone doorway of Sammath Naur leading into the mountain and staggers into it "
        }
      ]
    }
  ]
}