{
  "ground_truth": "Aragorn and Arwen look on Frodo, Sam, Merry, and Pippin as they stand before them. The four hobbits, dressed in their old clothes, clean and mended, bow their heads. Aragorn raises his hand and drops on one knee, kneeling before the hobbits, his head bowed, followed by all assembled there. Tears spring into Frodo's eyes as he clutches Sam's shoulder, and 4000 people pay homage to the courage of two little hobbits from the Shire. The camera rises into the air away from the crowded citadel until Minas Tirith becomes a speck in the landscape, dissolving into the parchment map of Middle-earth, slowly drifting across the map towards the west, revealing Hobbiton bathed in a warm sunset as Frodo, Sam, Merry, and Pippin ride into shot on ponies, past Odo Proudfoot who shakes his head at the strangeness of their appearance. Frodo brings a round of drinks to the table, and nearby, a huge fuss is being made of a large pumpkin which has been brought in to be shown off. The four friends look at each other, a world of experience now separates them from their fellow hobbits. Seated at a long table, the four friends raise their glasses. Sam's eye is suddenly caught by Rosie Cotton who is serving behind the bar. Sam steels himself and leaves to go and talk to Rosie. Frodo, Merry, and Pippin exchange smiles as on a beautiful sunny day, Sam and Rosie are married, with their dearest friends gathered around them. Rosie throws a beautiful bouquet of flowers, and it's caught by Pippin who smiles in embarrassment. Frodo walks through Bag End to his study, hunched over a desk, to reveal Bilbo's red book open on Frodo's desk. He is writing in the last chapters in careful neat handwriting. Frodo turns back the pages, revealing: There and Back Again -- A Hobbit's Tale, by Bilbo Baggins. He writes below it as Sam Gamgee calls out from the door. Frodo winces with a sharp gasp of pain, puts the pen down, and clutches at his shoulder. Sam has entered the room and stands behind Frodo. He is drawn and pale, and Sam is at a loss for words. On a cold winter's morning, out of the fog rattles a small covered wagon; Gandalf is at the reins. Frodo, Sam, Merry, and Pippin are waiting on ponies for the wagon, all wearing their grey elven robes. Gandalf arrives in his cart, and the wagon trundles along at a sedate pace. Sam, Merry, and Pippin ride behind, leading Frodo's empty pony. Frodo is sitting in the wagon with his arm around his uncle Bilbo. Bilbo is extremely old and frail, dozing, his head slumped, and Bilbo's eyes flutter open.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Aragorn and Arwen observe Frodo, Sam, Merry, and Pippin as they stand before them. The four hobbits, attired in their previous garments, tidy and repaired, bow their heads. Aragorn elevates his hand and descends on one knee, kneeling before the hobbits, his head inclined, followed by all gathered there. Tears leap into Frodo's eyes as he grasps Sam's shoulder, and 4000 people pay tribute to the bravery of two little hobbits from the Shire. The camera ascends into the air away from the crowded fortress until Minas Tirith becomes a dot in the scenery, dissolving into the scroll map of Middle-earth, slowly drifting across the map towards the west, revealing Hobbiton bathed in a warm sunset as Frodo, Sam, Merry, and Pippin ride into view on ponies, past Odo Proudfoot who shakes his head at the peculiarity of their appearance. Frodo brings a round of beverages to the table, and nearby, a huge commotion is being made of a large squash which has been brought in to be exhibited. The four companions look at each other, a world of experience now separates them from their fellow hobbits. Seated at a long table, the four companions lift their glasses. Sam's eye is suddenly caught by Rosie Cotton who is serving behind the bar. Sam fortifies himself and leaves to go and converse with Rosie. Frodo, Merry, and Pippin swap smiles as on a lovely sunny day, Sam and Rosie are wed, with their dearest companions gathered around them. Rosie tosses a beautiful bouquet of flowers, and it's caught by Pippin who smiles in awkwardness. Frodo walks through Bag End to his study, hunched over a desk, to reveal Bilbo's red book open on Frodo's desk. He is inscribing in the final chapters in careful neat handwriting. Frodo turns back the pages, revealing: There and Back Again -- A Hobbit's Tale, by Bilbo Baggins. He writes beneath it as Sam Gamgee calls out from the door. Frodo grimaces with a sharp intake of pain, puts the pen down, and clutches at his shoulder. Sam has entered the room and stands behind Frodo. He is drawn and pale, and Sam is speechless. On a cold winter's morning, out of the haze rattles a small covered carriage; Gandalf is at the reins. Frodo, Sam, Merry, and Pippin are waiting on ponies for the carriage, all wearing their grey elven cloaks. Gandalf arrives in his cart, and the carriage trundles along at a leisurely pace. Sam, Merry, and Pippin ride behind, leading Frodo's vacant pony. Frodo is sitting in the carriage with his arm around his uncle Bilbo. Bilbo is extremely old and frail, dozing, his head drooped, and Bilbo's eyes flicker open."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Aragorn and Arwen are looked upon by Frodo, Sam, Merry, and Pippin as they are stood before. The four hobbits, dressed in their old clothes, which have been cleaned and mended, bow their heads. Aragorn’s hand is raised and he is dropped onto one knee, kneeling before the hobbits, his head bowed, and all assembled there follow him. Frodo's eyes have tears springing into them as Sam's shoulder is clutched by him, and the courage of two little hobbits from the Shire is paid homage to by 4000 people. The air is risen into by the camera away from the crowded citadel until a speck in the landscape is Minas Tirith, which is dissolved into the parchment map of Middle-earth, and the map is drifted across slowly towards the west, Hobbiton is revealed bathed in a warm sunset as Frodo, Sam, Merry, and Pippin are ridden into shot on ponies, past Odo Proudfoot who shakes his head at the strangeness of their appearance. Frodo brings a round of drinks to the table, and nearby, a huge fuss is made of a large pumpkin which someone has brought in to show off. The four friends are looked at by each other, a world of experience now separates them from their fellow hobbits. Seated at a long table, the glasses are raised by the four friends. Rosie Cotton is suddenly caught by Sam's eye as she serves behind the bar. Sam steels himself and leaves to go and talk to Rosie. Frodo, Merry, and Pippin exchange smiles as on a beautiful sunny day, Sam and Rosie are married, and their dearest friends gather around them. A beautiful bouquet of flowers is thrown by Rosie and Pippin catches it, smiling in embarrassment. Frodo walks through Bag End to his study, hunched over a desk, to reveal Bilbo's red book open on Frodo's desk. The last chapters are written by him in careful neat handwriting. The pages are turned back by Frodo, revealing: There and Back Again -- A Hobbit's Tale, by Bilbo Baggins. Below it, he writes as Sam Gamgee calls out from the door. Frodo winces with a sharp gasp of pain, puts the pen down, and his shoulder is clutched at by him. Sam has entered the room and stands behind Frodo. Frodo is drawn and pale, and words are at a loss for Sam. On a cold winter's morning, out of the fog rattles a small covered wagon; Gandalf is at the reins. Frodo, Sam, Merry, and Pippin wait on ponies for the wagon, and their grey elven robes are worn by all. Gandalf arrives in his cart, and along the wagon is trundled at a sedate pace. Sam, Merry, and Pippin ride behind, leading Frodo's empty pony. Frodo is sitting in the wagon with his arm around his uncle Bilbo. Bilbo is extremely old and frail, dozing, his head slumped, and Bilbo's eyes flutter open."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Aragorn and Arwen watch as Frodo, Sam, Merry, and Pippin stand before them. The four hobbits, in their old, clean clothes, bow their heads. Aragorn kneels, followed by all assembled, honoring the hobbits' bravery. Tears fill Frodo's eyes as he grips Sam's shoulder, and 4,000 people pay homage. The camera ascends, showing Minas Tirith as a speck, then transitions to a map of Middle-earth, drifting west to reveal Hobbiton at sunset. Frodo, Sam, Merry, and Pippin ride past Odo Proudfoot, who shakes his head at their appearance. Frodo brings drinks to a table where a fuss is made over a large pumpkin. The friends, now changed by their experiences, raise their glasses. Sam notices Rosie Cotton serving at the bar and approaches her. Frodo, Merry, and Pippin smile as Sam and Rosie marry on a sunny day, surrounded by friends. Rosie tosses a bouquet, caught by an embarrassed Pippin. Frodo walks to his study in Bag End, writing in Bilbo's red book, \"There and Back Again -- A Hobbit's Tale.\" As Sam calls from the door, Frodo winces in pain and clutches his shoulder. Sam, worried, stands by him. On a cold winter's morning, Gandalf arrives in a small wagon. Frodo, Sam, Merry, and Pippin, in grey elven robes, wait with ponies. Sam, Merry, and Pippin ride behind Frodo's empty pony as Frodo sits in the wagon with Bilbo, who is very old and frail, his eyes fluttering open."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Aragorn and Arwen watch Frodo, Sam, Merry, and Pippin, who bow in their old, mended clothes. Aragorn kneels before the hobbits, joined by everyone present. Tears fill Frodo's eyes as he clutches Sam's shoulder, with 4000 people honoring their bravery. The camera rises, showing Minas Tirith shrink to a speck, then shifts to Hobbiton in a warm sunset where the hobbits ride past Odo Proudfoot, who finds their appearance strange. Frodo brings drinks to their table as a fuss is made over a large pumpkin. The four friends share a look, aware of the vast experiences that set them apart now. At a long table, they raise their glasses. Sam notices Rosie Cotton at the bar and approaches her. Frodo, Merry, and Pippin smile as Sam and Rosie marry on a sunny day, surrounded by friends. Rosie throws a bouquet, caught by Pippin, who grins awkwardly. Frodo, at Bag End, writes in Bilbo's red book when Sam calls. Frodo gasps in pain, clutching his shoulder as Sam enters, wordless at Frodo's drawn, pale appearance. On a cold winter morning, Gandalf's covered wagon emerges from the fog. Frodo, Sam, Merry, and Pippin, in grey elven robes, wait on ponies for Gandalf. The wagon travels slowly, with Sam, Merry, and Pippin leading Frodo's empty pony. Frodo sits in the wagon, arm around elderly Bilbo, who dozes with fluttering eyes."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Aragorn and Arwen stand with a regal presence as they gaze upon Frodo, Sam, Merry, and Pippin, who are positioned directly in front of them. These four hobbits, clad in their familiar, well-worn attire, which has been carefully cleaned and mended, lower their heads respectfully. In a gesture of deep reverence, Aragorn elevates his hand before gracefully dropping to one knee, kneeling solemnly before the hobbits with his own head bowed. All those gathered around follow his lead in homage. Tears well up in Frodo's eyes as he tightly grips Sam's shoulder, while the assembled throng of 4,000 individuals collectively pays tribute to the remarkable bravery exhibited by these two small hobbits from the Shire. The camera elegantly ascends into the sky, slowly pulling away from the throng-packed citadel until the majestic city of Minas Tirith diminishes to a mere dot within the vast landscape. This scene then seamlessly transitions into the parchment map of Middle-earth, which gently shifts across the page towards the west, gradually revealing the peaceful village of Hobbiton, bathed in the glowing hues of a warm sunset. Here, Frodo, Sam, Merry, and Pippin appear, riding into view on their trusty ponies, passing by Odo Proudfoot, who looks on and shakes his head at the unusual spectacle of their transformed appearance. Frodo proceeds to bring a round of refreshing drinks to the table, where nearby, there's a lively commotion surrounding an impressively large pumpkin that has been brought in for show. As the four friends exchange glances, a profound world of experiences now sets them apart from their fellow hobbits. Seated comfortably at a long, rustic table, the quartet raises their glasses in a gesture of camaraderie. Sam's attention is unexpectedly caught by the lovely Rosie Cotton, who is busily serving behind the bar. Gathering his courage, Sam makes his way over to speak with Rosie. Frodo, Merry, and Pippin exchange knowing smiles as, on a wonderfully sunny day, Sam and Rosie are joyously wed, surrounded by their cherished friends. With a playful spirit, Rosie tosses a vibrant bouquet of flowers into the air, which is promptly caught by Pippin, who grins sheepishly, slightly embarrassed. Frodo slowly walks the familiar halls of Bag End towards his study, where he hunches over a well-worn desk. Here, Bilbo's iconic red book lies open before him, and Frodo is diligently writing the concluding chapters in careful, neat handwriting. As he flips back through the pages, the title is revealed: \"There and Back Again – A Hobbit's Tale, by Bilbo Baggins.\" With concentration, he begins to write below it, only to be interrupted by Sam Gamgee's voice calling from the door. Frodo suddenly winces in sharp pain, gasping as he sets down the pen and clutches at his shoulder. Sam enters quietly, standing supportively behind Frodo, looking drawn and pale. Sam finds himself momentarily lost for words. On a brisk winter's morning, a small covered wagon rattles through the dense fog, with Gandalf firmly holding the reins. Frodo, Sam, Merry, and Pippin patiently wait on their ponies for the wagon to arrive, each wearing their elegant grey elven robes. As Gandalf guides the cart along its gentle pace, Sam, Merry, and Pippin follow closely behind, leading Frodo's riderless pony. Inside the wagon, Frodo sits with his arm tenderly around his dear uncle Bilbo. Bilbo, now extremely aged and frail, dozes peacefully, his head lolling gently, until his eyes flutter open."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Aragorn and Arwen stand together, exuding a regal presence and an air of nobility as their gaze falls upon Frodo, Sam, Merry, and Pippin, who are positioned directly before them. These four hobbits, adorned in their familiar and well-worn attire, which has been meticulously cleaned and skillfully mended, lower their heads respectfully in acknowledgment. In a gesture imbued with deep reverence and respect, Aragorn raises his hand gracefully before dropping to one knee, kneeling solemnly before the hobbits with his own head bowed in humility. All those gathered around take their cue from Aragorn and follow his lead in paying homage. Tears begin to well up in Frodo's eyes as he grips Sam's shoulder tightly, while the assembled throng of 4,000 individuals collectively pays tribute to the extraordinary bravery displayed by these two small hobbits from the Shire. The camera then begins an elegant ascent into the sky, slowly pulling away from the throng-packed citadel, until the majestic city of Minas Tirith diminishes to a mere dot within the vast landscape. This poignant scene seamlessly transitions into a parchment map of Middle-earth, which gently slides across the page towards the west, gradually unveiling the peaceful village of Hobbiton, bathed in the glowing hues of a warm sunset. In this serene setting, Frodo, Sam, Merry, and Pippin appear, riding into view on their trusty ponies, as they pass by Odo Proudfoot, who looks on and shakes his head at the unusual spectacle of their transformed appearance. Frodo then proceeds to bring a round of refreshing drinks to the table, where nearby, there's a lively commotion surrounding an impressively large pumpkin that has been brought in for display. As the four friends exchange meaningful glances, a profound world of experiences now sets them apart from their fellow hobbits. Seated comfortably at a long, rustic table, the quartet raises their glasses in a gesture of camaraderie and shared understanding. Sam's attention is unexpectedly captivated by the lovely Rosie Cotton, who is busily serving behind the bar. Gathering his courage, Sam makes his way over to speak with Rosie. Frodo, Merry, and Pippin exchange knowing smiles as, on a wonderfully sunny day, Sam and Rosie are joyously wed, surrounded by their cherished friends and companions. With a playful spirit, Rosie tosses a vibrant bouquet of flowers into the air, and it is promptly caught by Pippin, who grins sheepishly, slightly embarrassed by the attention. Frodo then slowly walks the familiar halls of Bag End towards his study, where he hunches over a well-worn desk. Here, Bilbo's iconic red book lies open before him, and Frodo is diligently writing the concluding chapters in careful, neat handwriting. As he flips back through the treasured pages, the title is revealed: \"There and Back Again – A Hobbit's Tale, by Bilbo Baggins.\" With focused concentration, he begins to write below it, only to be interrupted by Sam Gamgee's voice calling from the door. Frodo suddenly winces in sharp pain, gasping as he sets down the pen and clutches at his shoulder. Sam enters quietly, standing supportively behind Frodo, looking drawn and pale, momentarily lost for words. On a brisk, chilly winter's morning, a small covered wagon rattles through the dense fog, with Gandalf gently yet firmly holding the reins. Frodo, Sam, Merry, and Pippin patiently wait on their ponies for the wagon to arrive, each wearing their elegant grey elven robes. As Gandalf guides the cart along its gentle pace, Sam, Merry, and Pippin follow closely behind, leading Frodo's riderless pony. Inside the wagon, Frodo sits tenderly with his arm around his dear uncle Bilbo. Bilbo, now extremely aged and frail, dozes peacefully, his head lolling gently, until his eyes flutter open, revealing his enduring warmth."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Aragorn and Arwen stand together, their eyes focused on Frodo, Sam, Merry, and Pippin as the four hobbits quietly position themselves before them. Each hobbit, clad in their familiar old garments that have been carefully cleaned and repaired, bows their heads respectfully. Observing this, Aragorn raises his hand in a gesture of reverence and gracefully descends onto one knee, kneeling before the hobbits with his head humbly bowed, an action mirrored by everyone present in the gathering. Tears begin to well up in Frodo's eyes as he instinctively reaches out and clutches Sam's shoulder for support. The immense crowd of 4,000 people collectively acknowledges and honors the bravery of the two small hobbits from the Shire. As the scene unfolds, the camera gradually ascends into the air, moving away from the densely packed citadel, until the city of Minas Tirith fades into a tiny speck on the vast landscape. This image slowly transitions into a parchment map of Middle-earth, which effortlessly drifts toward the west, eventually revealing Hobbiton bathed in the soft hues of a warm sunset. At this moment, Frodo, Sam, Merry, and Pippin appear in the frame riding ponies, traversing the familiar territory, passing by Odo Proudfoot who reacts with a shake of his head, commenting silently on the unusual sight before him. Frodo, carrying a round of drinks, approaches a table, setting the glasses down as they notice a commotion nearby centered around a notably large pumpkin that has been brought in for admiration. The four friends exchange knowing glances, acknowledging the profound experiences that now set them apart from their fellow hobbits. Seated comfortably at a long table, the four companions raise their glasses in a silent toast. Sam's attention is suddenly captured by the sight of Rosie Cotton, who is busy serving drinks behind the bar. Summoning his courage, Sam gets up and decisively heads over to speak with Rosie. Watching him go, Frodo, Merry, and Pippin share amused smiles, knowing what this moment means for Sam. On a radiant, sunlit day, Sam and Rosie celebrate their marriage, surrounded by their closest friends, united in joy. Rosie, with a bright smile, tosses a lovely bouquet of flowers into the air, which lands gracefully in Pippin's hands, causing him to smile sheepishly. Later, Frodo moves through the familiar corridors of Bag End, eventually making his way to his study. There, he hunches over his desk, revealing Bilbo's red book open before him. Frodo is intently focused as he carefully writes in neat, precise handwriting, adding the final chapters. As he writes, he pauses to turn back the pages, uncovering the title: There and Back Again -- A Hobbit's Tale, by Bilbo Baggins. Frodo continues writing, but just then, Sam Gamgee's voice calls out from the doorway. Frodo suddenly winces, a sharp pain jolting through him, and he sets the pen down, clutching his shoulder with a grimace. Sam enters, standing behind Frodo, his expression one of concern, seeing Frodo looking drawn and pale, leaving Sam momentarily speechless. On a brisk winter morning, a small covered wagon emerges from the fog, with Gandalf at the reins, guiding the horses steadily. Frodo, Sam, Merry, and Pippin wait patiently on their ponies for the approaching wagon, each wearing their grey elven robes as a mark of their adventures. As Gandalf draws near in his cart, the wagon moves forward at a gentle, unhurried pace. Meanwhile, Sam, Merry, and Pippin follow on their ponies, leading Frodo's now-empty pony as part of the procession. Inside the wagon, Frodo sits close to his uncle Bilbo, wrapping an arm around him protectively. Bilbo, now extremely old and frail, rests against Frodo, his head tilted as he dozes, with his eyes flickering open periodically, a reflection of the life he has lived."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Aragorn and Arwen look on as Frodo, Sam, Merry, and Pippin, dressed in their clean, mended clothes, bow their heads in respect. Aragorn kneels before the hobbits, joined by everyone present, honoring their bravery. Tears well up in Frodo's eyes as he clutches Sam's shoulder amidst the homage of 4000 people. The camera pans out from Minas Tirith, transitioning to a map of Middle-earth, moving west until revealing Hobbiton at sunset. The four hobbits ride into the scene on ponies, passing by Odo Proudfoot, who looks on skeptically. Later, Frodo brings drinks to their table as a fuss over a large pumpkin unfolds nearby. Seated together, the friends raise their glasses, acknowledging their shared experiences that now set them apart from other hobbits. Sam, noticing Rosie Cotton behind the bar, gathers the courage to approach her, prompting smiles from his companions. On a beautiful day, Sam and Rosie marry, surrounded by their closest friends. Rosie tosses her bouquet, which Pippin catches, blushing. Frodo, in Bag End, writes the final chapters in Bilbo's red book but winces in pain and clutches his shoulder as Sam enters, feeling concerned. On a cold winter's morning, Gandalf arrives in a small wagon, greeted by Frodo, Sam, Merry, and Pippin in their grey elven robes. As the wagon trundles forward, Sam, Merry, and Pippin follow behind, leading Frodo's empty pony, while Frodo sits beside his uncle Bilbo, who, though frail and dozing, briefly opens his eyes."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Aragorn and Arwen, standing together in the majestic halls of Minas Tirith, look on Frodo, Sam, Merry, and Pippin as they stand before them. The four hobbits, dressed in their old clothes that reflect the simplicity of life in the Shire, clean and mended, bow their heads. Aragorn, now the newly crowned king of Gondor, raises his hand and drops on one knee, kneeling before the hobbits, his head bowed, followed by all assembled there, including the diverse peoples of Middle-earth who have gathered to honor them. Tears spring into Frodo's eyes as he clutches Sam's shoulder, and 4000 people pay homage to the courage of two little hobbits from the Shire, a place known for its peaceful rural charm. The camera rises into the air away from the crowded citadel until Minas Tirith, a city built on several levels along the face of a mountain, becomes a speck in the landscape, dissolving into the parchment map of Middle-earth, slowly drifting across the map towards the west, revealing Hobbiton bathed in a warm sunset as Frodo, Sam, Merry, and Pippin ride into shot on ponies, past Odo Proudfoot, a resident of the Shire who takes pride in maintaining his garden, who shakes his head at the strangeness of their appearance. Frodo brings a round of drinks to the table at The Green Dragon Inn, a popular local gathering spot, and nearby, a huge fuss is being made of a large pumpkin which has been brought in to be shown off as part of an annual harvest festival. The four friends look at each other, a world of experience now separates them from their fellow hobbits. Seated at a long table, the four friends raise their glasses. Sam's eye is suddenly caught by Rosie Cotton, a girl from Hobbiton he has long admired, who is serving behind the bar. Sam steels himself and leaves to go and talk to Rosie. Frodo, Merry, and Pippin exchange smiles as on a beautiful sunny day, Sam and Rosie are married in a Shire tradition, with their dearest friends gathered around them. Rosie throws a beautiful bouquet of flowers, a customary moment symbolizing good fortune, and it's caught by Pippin who smiles in embarrassment. Frodo walks through Bag End, the cozy home he inherited from Bilbo, to his study, hunched over a desk, to reveal Bilbo's red book, an account of their adventures, open on Frodo's desk. He is writing in the last chapters in careful, neat handwriting. Frodo turns back the pages, revealing: There and Back Again -- A Hobbit's Tale, by Bilbo Baggins. He writes below it as Sam Gamgee calls out from the door. Frodo winces with a sharp gasp of pain, a lingering reminder of his ordeals, puts the pen down, and clutches at his shoulder. Sam has entered the room and stands behind Frodo. He is drawn and pale, and Sam is at a loss for words. On a cold winter's morning, out of the fog rattles a small covered wagon; Gandalf, the wise and powerful wizard, is at the reins. Frodo, Sam, Merry, and Pippin are waiting on ponies for the wagon, all wearing their grey elven robes gifted to them by Galadriel in Lothlórien. Gandalf arrives in his cart, a wooden conveyance laden with its own enigmatic aura, and the wagon trundles along at a sedate pace. Sam, Merry, and Pippin ride behind, leading Frodo's empty pony. Frodo is sitting in the wagon with his arm around his uncle Bilbo, the original adventurer whose tales inspired them all. Bilbo is extremely old and frail, dozing, his head slumped, and Bilbo's eyes flutter open, catching a glimpse of the world he once roamed."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Aragorn and Arwen look on Frodo Sam Merry and Pippin as they stand before them. The four hobbits dressed in their old clothes clean and mended bow their heads. Aragorn raises his hand and drops on one knee kneeling before the hobbits his head bowed followed by all assembled there. Tears spring into Frodo's eyes as he clutches Sam's shoulder and 4000 people pay homage to the courage of two little hobbits from the Shire. The camera rises into the air away from the crowded citadel until Minas Tirith becomes a speck in the landscape dissolving into the parchment map of Middleearth slowly drifting across the map towards the west revealing Hobbiton bathed in a warm sunset. as Frodo Sam Merry and Pippin ride into shot on ponies past Odo Proudfoot who shakes his head at the strangeness of their appearance. Frodo brings a round of drinks to the table and nearby a huge fuss is being made of a large pumpkin which has been brought in to be shown off. The four friends look at each other. a world of experience now separates them from their fellow hobbits. Seated at a long table the four friends raise their glasses. Sam's eye is suddenly caught by Rosie Cotton who is serving behind the bar. Sam steels himself and leaves to go and talk to Rosie. Frodo Merry and Pippin exchange smiles as on a beautiful sunny day. Sam and Rosie are married with their dearest friends gathered around them. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Rosie throws a beautiful bouquet of flowers and it is caught by Pippin who smiles in embarrassment. Frodo walks through Bag End to his study hunched over a desk to reveal Bilbo's red book open on Frodo's desk. He is writing in the last chapters in careful neat handwriting. Frodo turns back the pages revealing There and Back Again  A Hobbit's Tale by Bilbo Baggins. He writes below it as Sam Gamgee calls out from the door. Frodo winces with a sharp gasp of pain puts the pen down and clutches at his shoulder. Sam has entered the room and stands behind Frodo. He is drawn and pale and Sam is at a loss for words. On a cold winter's morning out of the fog rattles a small covered wagon. Gandalf is at the reins. Frodo Sam Merry and Pippin are waiting on ponies for the wagon all wearing their grey elven robes. Gandalf arrives in his cart and the wagon trundles along at a sedate pace. Sam Merry and Pippin ride behind leading Frodo's empty pony. Frodo is sitting in the wagon with his arm around his uncle Bilbo. Bilbo is extremely old and frail dozing his head slumped and Bilbo's eyes flutter open."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Aragorn and Arwen look on Frodo Sam Merry and Pippin as they stand before them. The four hobbits dressed in their old clothes clean and mended bow their heads. Aragorn raises his hand and drops on one knee kneeling before the hobbits his head bowed followed by all assembled there. Tears spring into Frodo's eyes as he clutches Sam's shoulder and 4000 people pay homage to the courage of two little hobbits from the Shire. The camera rises into the air away from the crowded citadel until Minas Tirith becomes a speck in the landscape dissolving into the parchment map of Middleearth slowly drifting across the map towards the west revealing Hobbiton bathed in a warm sunset. as Frodo Sam Merry and Pippin ride into shot on ponies past Odo Proudfoot who shakes his head at the strangeness of their appearance. Frodo brings a round of drinks to the table and nearby a huge fuss is being made of a large pumpkin which has been brought in to be shown off. The four friends look at each other. a world of experience now separates them from their fellow hobbits. Seated at a long table the four friends raise their glasses. Sam's eye is suddenly caught by Rosie Cotton who is serving behind the bar. Sam steels himself and leaves to go and talk to Rosie. Frodo Merry and Pippin exchange smiles as on a beautiful sunny day. Sam and Rosie are married with their dearest friends gathered around them. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. Rosie throws a beautiful bouquet of flowers and it is caught by Pippin who smiles in embarrassment. Frodo walks through Bag End to his study hunched over a desk to reveal Bilbo's red book open on Frodo's desk. He is writing in the last chapters in careful neat handwriting. Frodo turns back the pages revealing There and Back Again  A Hobbit's Tale by Bilbo Baggins. He writes below it as Sam Gamgee calls out from the door. Frodo winces with a sharp gasp of pain puts the pen down and clutches at his shoulder. Sam has entered the room and stands behind Frodo. He is drawn and pale and Sam is at a loss for words. On a cold winter's morning out of the fog rattles a small covered wagon. Gandalf is at the reins. Frodo Sam Merry and Pippin are waiting on ponies for the wagon all wearing their grey elven robes. Gandalf arrives in his cart and the wagon trundles along at a sedate pace. Sam Merry and Pippin ride behind leading Frodo's empty pony. Frodo is sitting in the wagon with his arm around his uncle Bilbo. Bilbo is extremely old and frail dozing his head slumped and Bilbo's eyes flutter open."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Aragorn and Arwen look on Frodo Sam Merry and Pippin as they stand before them. The four hobbits dressed in their old clothes clean and mended bow their heads. Aragorn raises his hand and drops on one knee kneeling before the hobbits his head bowed followed by all assembled there. Tears spring into Frodo's eyes as he clutches Sam's shoulder and 4000 people pay homage to the courage of two little hobbits from the Shire. The camera rises into the air away from the crowded citadel until Minas Tirith becomes a speck in the landscape dissolving into the parchment map of Middleearth slowly drifting across the map towards the west revealing Hobbiton bathed in a warm sunset. as Frodo Sam Merry and Pippin ride into shot on ponies past Odo Proudfoot who shakes his head at the strangeness of their appearance. Frodo brings a round of drinks to the table and nearby a huge fuss is being made of a large pumpkin which has been brought in to be shown off. He is drawn and pale and Sam is at a loss for words. On a cold winter's morning out of the fog rattles a small covered wagon. Gandalf is at the reins. Frodo Sam Merry and Pippin are waiting on ponies for the wagon all wearing their grey elven robes. Gandalf arrives in his cart and the wagon trundles along at a sedate pace. Sam Merry and Pippin ride behind leading Frodo's empty pony. Frodo is sitting in the wagon with his arm around his uncle Bilbo. Bilbo is extremely old and frail dozing his head slumped and Bilbo's eyes flutter open."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Aragorn and Arwen look on Frodo Sam Merry and Pippin as they stand before them. The four hobbits dressed in their old clothes clean and mended bow their heads. Aragorn raises his hand and drops on one knee kneeling before the hobbits his head bowed followed by all assembled there. Sam Merry and Pippin ride behind leading Frodo's empty pony. Frodo is sitting in the wagon with his arm around his uncle Bilbo. Bilbo is extremely old and frail dozing his head slumped and Bilbo's eyes flutter open."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Boromir and Eowyn gaze upon Legolas, Gimli, Boromir, and Faramir as they float above them. The four elves, clad in their new armor, tarnished and tattered, raise their hats. Boromir lowers his flag and leaps over ten barrels, cartwheeling above the elves, his feet pointed upwards, echoed by all observing there. Feathers dance into Gimli's beard as he pokes Faramir’s ankle, and 4000 squirrels pay tribute to the whispers of two giant elves from Mordor. The camera dives into the sea away from the bustling mountain until Rivendell becomes a pebble in the ocean, transforming into the canvas map of Valinor, swiftly sailing across the chart towards the east, revealing Gondor bathed in a bright sunrise as Legolas, Gimli, Boromir, and Faramir swim into frame on dolphins, past Grima Wormtongue who nods his nose at the oddity of their attire. Legolas delivers a tray of pebbles to the stage, and nearby, a tiny chaos is being made of a small acorn which has been hauled in to be shown around. The four comrades glance at each other, a universe of discovery now unites them with their fellow elves. Seated at a round stump, the four companions clink their bottles. Gimli's eyebrow is swiftly drawn by Eowyn Shieldmaiden who is dancing beside the stage. Gimli fortifies himself and arrives to shout at Eowyn. Legolas, Boromir, and Faramir trade frowns as on a stormy rainy night, Gimli and Eowyn are separated, with their nearest strangers scattered among them. Eowyn tosses a tiny pebble, and it's seized by Faramir who grins in pride. Legolas strolls through Mirkwood to his cellar, crouching under a bench, to display Bilbo's silver crown resting on Legolas's arm. He is scribbling on the first pages in messy sloppy handwriting. Legolas flips forward the covers, uncovering: Up and Away Again — An Elf's Secret, by Gandalf the Grey. He doodles above it as Gimli Ironfoot whistles out from the window. Legolas laughs with a loud shout of joy, picks the feather up, and dances on his toes. Gimli has left the tent and floats beside Legolas. He is vibrant and cheerful, and Gimli is full of poetry. On a hot summer's afternoon, through the mist floats a huge open phoenix; Sauron is on the saddle. Legolas, Gimli, Boromir, and Faramir are napping on foxes for the phoenix, all wearing their red dwarf hats. Sauron arrives on his eagle, and the phoenix twirls along in a lively dance. Gimli, Boromir, and Faramir dash ahead, trailing Legolas's occupied fox. Legolas is standing on the phoenix with his nose nestled against his cousin Bilbo. Bilbo is incredibly young and spry, singing, his head raised, and Bilbo's feet tap gracefully."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Aragorn, Arwen, and 4000 people honor Frodo, Sam, Merry, and Pippin for their bravery. As the camera pans away from the citadel to Hobbiton, the hobbits ride in, passing Odo Proudfoot. They share drinks and a large pumpkin is admired nearby, symbolizing their return to simpler times. Their experiences set them apart, but Sam is drawn to Rosie Cotton and soon marries her, with friends celebrating. Frodo, in Bag End, writes in Bilbo's book, but pain grips him as Sam enters. On a foggy winter morning, Gandalf's wagon arrives, and the four hobbits, in elven robes, prepare for their next journey. Frodo sits with his frail uncle Bilbo in the wagon as they continue on."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Bilbo is extremely old and frail dozing his head slumped and Bilbo's eyes flutter open Frodo is sitting in the wagon with his arm around his uncle Bilbo Sam Merry and Pippin ride behind leading Frodo's empty pony Gandalf arrives in his cart and the wagon trundles along at a sedate pace Frodo Sam Merry and Pippin are waiting on ponies for the wagon all wearing their grey elven robes Gandalf is at the reins On a cold winter's morning out of the fog rattles a small covered wagon He is drawn and pale and Sam is at a loss for words Sam has entered the room and stands behind Frodo Frodo winces with a sharp gasp of pain puts the pen down and clutches at his shoulder He writes below it as Sam Gamgee calls out from the door Frodo turns back the pages revealing There and Back Again  A Hobbit's Tale by Bilbo Baggins He is writing in the last chapters in careful neat handwriting Frodo walks through Bag End to his study hunched over a desk to reveal Bilbo's red book open on Frodo's desk Rosie throws a beautiful bouquet of flowers and it is caught by Pippin who smiles in embarrassment Sam and Rosie are married with their dearest friends gathered around them Frodo Merry and Pippin exchange smiles as on a beautiful sunny day Sam steels himself and leaves to go and talk to Rosie Sam's eye is suddenly caught by Rosie Cotton who is serving behind the bar Seated at a long table the four friends raise their glasses a world of experience now separates them from their fellow hobbits The four friends look at each other Frodo brings a round of drinks to the table and nearby a huge fuss is being made of a large pumpkin which has been brought in to be shown off as Frodo Sam Merry and Pippin ride into shot on ponies past Odo Proudfoot who shakes his head at the strangeness of their appearance The camera rises into the air away from the crowded citadel until Minas Tirith becomes a speck in the landscape dissolving into the parchment map of Middleearth slowly drifting across the map towards the west revealing Hobbiton bathed in a warm sunset Tears spring into Frodo's eyes as he clutches Sam's shoulder and 4000 people pay homage to the courage of two little hobbits from the Shire Aragorn raises his hand and drops on one knee kneeling before the hobbits his head bowed followed by all assembled there The four hobbits dressed in their old clothes clean and mended bow their heads Aragorn and Arwen look on Frodo Sam Merry and Pippin as they stand before them"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The four hobbits dressed in their old clothes clean and mended bow their heads Aragorn and Arwen look on Frodo Sam Merry and Pippin as they stand before them Tears spring into Frodo's eyes as he clutches Sam's shoulder and 4000 people pay homage to the courage of two little hobbits from the Shire Aragorn raises his hand and drops on one knee kneeling before the hobbits his head bowed followed by all assembled there as Frodo Sam Merry and Pippin ride into shot on ponies past Odo Proudfoot who shakes his head at the strangeness of their appearance The camera rises into the air away from the crowded citadel until Minas Tirith becomes a speck in the landscape dissolving into the parchment map of Middleearth slowly drifting across the map towards the west revealing Hobbiton bathed in a warm sunset The four friends look at each other Frodo brings a round of drinks to the table and nearby a huge fuss is being made of a large pumpkin which has been brought in to be shown off Seated at a long table the four friends raise their glasses a world of experience now separates them from their fellow hobbits Sam steels himself and leaves to go and talk to Rosie Sam's eye is suddenly caught by Rosie Cotton who is serving behind the bar Sam and Rosie are married with their dearest friends gathered around them Frodo Merry and Pippin exchange smiles as on a beautiful sunny day Frodo walks through Bag End to his study hunched over a desk to reveal Bilbo's red book open on Frodo's desk Rosie throws a beautiful bouquet of flowers and it is caught by Pippin who smiles in embarrassment Frodo turns back the pages revealing There and Back Again  A Hobbit's Tale by Bilbo Baggins He is writing in the last chapters in careful neat handwriting Frodo winces with a sharp gasp of pain puts the pen down and clutches at his shoulder He writes below it as Sam Gamgee calls out from the door He is drawn and pale and Sam is at a loss for words Sam has entered the room and stands behind Frodo Gandalf is at the reins On a cold winter's morning out of the fog rattles a small covered wagon Gandalf arrives in his cart and the wagon trundles along at a sedate pace Frodo Sam Merry and Pippin are waiting on ponies for the wagon all wearing their grey elven robes Frodo is sitting in the wagon with his arm around his uncle Bilbo Sam Merry and Pippin ride behind leading Frodo's empty pony Bilbo is extremely old and frail dozing his head slumped and Bilbo's eyes flutter open"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Frodo walks through Bag End to his study hunched over a desk to reveal Bilbo's red book open on Frodo's desk He is writing in the last chapters in careful neat handwriting Frodo turns back the pages revealing There and Back Again  A Hobbit's Tale by Bilbo Baggins He writes below it as Sam Gamgee calls out from the door Frodo winces with a sharp gasp of pain puts the pen down and clutches at his shoulder Sam has entered the room and stands behind Frodo He is drawn and pale and Sam is at a loss for words On a cold winter's morning out of the fog rattles a small covered wagon Gandalf is at the reins Frodo Sam Merry and Pippin are waiting on ponies for the wagon all wearing their grey elven robes Gandalf arrives in his cart and the wagon trundles along at a sedate pace Sam Merry and Pippin ride behind leading Frodo's empty pony Frodo is sitting in the wagon with his arm around his uncle Bilbo Bilbo is extremely old and frail dozing his head slumped and Bilbo's eyes flutter open Aragorn and Arwen look on Frodo Sam Merry and Pippin as they stand before them The four hobbits dressed in their old clothes clean and mended bow their heads Aragorn raises his hand and drops on one knee kneeling before the hobbits his head bowed followed by all assembled there Tears spring into Frodo's eyes as he clutches Sam's shoulder and 4000 people pay homage to the courage of two little hobbits from the Shire The camera rises into the air away from the crowded citadel until Minas Tirith becomes a speck in the landscape dissolving into the parchment map of Middleearth slowly drifting across the map towards the west revealing Hobbiton bathed in a warm sunset as Frodo Sam Merry and Pippin ride into shot on ponies past Odo Proudfoot who shakes his head at the strangeness of their appearance Frodo brings a round of drinks to the table and nearby a huge fuss is being made of a large pumpkin which has been brought in to be shown off The four friends look at each other a world of experience now separates them from their fellow hobbits Seated at a long table the four friends raise their glasses Sam's eye is suddenly caught by Rosie Cotton who is serving behind the bar Sam steels himself and leaves to go and talk to Rosie Frodo Merry and Pippin exchange smiles as on a beautiful sunny day Sam and Rosie are married with their dearest friends gathered around them Rosie throws a beautiful bouquet of flowers and it is caught by Pippin who smiles in embarrassment"
        }
      ]
    }
  ]
}