{
  "ground_truth": "She can't go on. She lifts her face to his, and he kisses her gently. He looks into her eyes, then he does kiss her as though it were going to be the last time. Her hand falls to the table and knocks over a glass. It's raining very hard at the train station, and there is a hectic, fevered excitement, evident in the faces of the people that pass by. Rick appears in the crowd, stops, puts his suitcase down, and glances at his watch. He nervously checks his watch again, rain pouring over his head and shoulders, but he doesn't seem to notice. Suddenly Sam appears, pulls an envelope from his pocket, and Rick grabs it, opens it, and stares down at the letter, as raindrops pour down the letter, smudging the writing. Sam pulls a stunned, reluctant Rick to the train, which starts to move just as he boards. From the steps he looks off into the distance, then crumbles the letter and tosses it away as the steam from the engine clouds over him. A close-up of a glass on the table in the cafe is shown, and Rick's hand reaches for it and knocks it over. We now see Rick's face and he's very drunk. Sam walks over to the table to pick up the glass and a fallen chair. Just then the door opens and it's Ilsa. Rick stares at the doorway. Ilsa lingers a moment, then comes over to the table, her manner a little uncertain, a little tentative, but with a quiet determination beneath it. Rick reaches for the bottle, and pours himself another drink. She sits down in the chair before the empty glass, her eyes searching his face, but there is no expression on it except a cold and impassive one. He takes a drink. Ilsa gets up and leaves, and Rick's head slumps over the table. Strasser sits while Renault attends to some paperwork and looks at him. Laszlo and Ilsa make their way through the jam in the lobby of the Prefecture, as Jan and Annina talk to an officer. Laszlo and Ilsa enter Renault's office, and Renault bows to them both. Close-ups of Ilsa and then Laszlo reveal their disappointment, observed by Strasser. Renault rings a buzzer and the door is opened for them. As Ilsa and Laszlo leave, an officer comes in. Signor Ferrari turns around, pleased to see Rick, and they shake hands. He hails a waiter, eyes Rick closely, and Rick looks out of the window and sees Ilsa at the linen bazaar, then Laszlo walking toward the cafe. Rick isn't listening to him, looking through the open window in the direction of the linen bazaar. Rick gets up.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She cannot continue. She raises her visage to his, and he pecks her softly. He gazes into her orbs, then he does smooch her as though it were going to be the final instance. Her palm drops to the desk and knocks over a tumbler. It's pouring very hard at the railway depot, and there is a frenzied, fevered excitement, evident in the visages of the individuals that pass by. Rick emerges in the throng, halts, places his valise down, and glances at his chronometer. He anxiously checks his chronometer again, rain streaming over his head and shoulders, but he does not seem to notice. Suddenly Sam materializes, extracts an envelope from his pocket, and Rick seizes it, opens it, and gazes down at the missive, as raindrops cascade down the letter, blurring the script. Sam drags a shocked, hesitant Rick to the train, which begins to move just as he boards. From the steps he looks off into the expanse, then crumples the letter and hurls it away as the vapor from the engine enshrouds him. A close-up of a chalice on the desk in the cafe is shown, and Rick's hand reaches for it and knocks it over. We now observe Rick's visage and he's very inebriated. Sam strides over to the desk to retrieve the chalice and a toppled seat. Just then the portal opens and it's Ilsa. Rick peers at the entrance. Ilsa hesitates a moment, then approaches the desk, her demeanor a little unsure, a little tentative, but with a quiet resolve beneath it. Rick reaches for the decanter, and pours himself another libation. She settles down in the seat before the vacant chalice, her orbs searching his visage, but there is no expression on it except a frigid and impassive one. He takes a sip. Ilsa rises and departs, and Rick's head slumps over the desk. Strasser seats while Renault attends to some documentation and gazes at him. Laszlo and Ilsa make their way through the jam in the lobby of the Prefecture, as Jan and Annina converse with an official. Laszlo and Ilsa enter Renault's bureau, and Renault inclines to them both. Close-ups of Ilsa and then Laszlo expose their disillusionment, observed by Strasser. Renault rings a bell and the entrance is opened for them. As Ilsa and Laszlo depart, an official arrives. Signor Ferrari pivots around, delighted to encounter Rick, and they clasp hands. He summons a server, scrutinizes Rick closely, and Rick gazes out of the aperture and sees Ilsa at the fabric marketplace, then Laszlo approaching the cafe. Rick is not heeding him, looking through the open aperture in the direction of the fabric marketplace. Rick rises."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "She can't continue. Her face is lifted by her to his, and she is kissed gently by him. Her eyes are looked into by him, then he kisses her as though it were going to be the last time. The table is struck by her hand, and a glass is knocked over by it. Rain is falling very hard at the train station, and the faces of the people who pass by show a hectic, fevered excitement. Rick is seen appearing in the crowd; he stops, puts his suitcase down, and glances at his watch. His watch is checked nervously by him again, with rain pouring over his head and shoulders, but no notice is taken by him. Suddenly, Sam is seen appearing, an envelope is pulled from his pocket by him, and it is grabbed by Rick, opened, and stared at, as raindrops pour down the letter, smudging the writing. A stunned, reluctant Rick is pulled by Sam to the train, which starts moving just as he boards it. The distance is looked off into by him from the steps, then the letter is crumbled by him and tossed away as the steam from the engine clouds over him. A close-up is shown of a glass on the table in the cafe, and it is reached for by Rick's hand and knocked over. Rick's face is now seen, and he is very drunk. The glass and a fallen chair are picked up by Sam, who walks over to the table. Just then, the door is opened, and it is Ilsa. The doorway is stared at by Rick. Ilsa lingers a moment, then the table is approached by her, her manner a little uncertain, a little tentative, but with a quiet determination beneath it. The bottle is reached for by Rick, and another drink is poured for himself. The chair before the empty glass is sat down in by her, her eyes searching his face, but the only expression on it is a cold and impassive one. A drink is taken by him. Ilsa gets up and leaves, and his head slumps over the table. Renault sits while some paperwork is attended to by Strasser and looks at him. The jam in the lobby of the Prefecture is made their way through by Laszlo and Ilsa, as an officer is talked to by Jan and Annina. Renault's office is entered by Laszlo and Ilsa, and they are both bowed to by Renault. Close-ups of Ilsa and then Laszlo reveal their disappointment, which is observed by Strasser. A buzzer is rung by Renault, and the door is opened for them. An officer enters as Ilsa and Laszlo leave. Rick is seen by Signor Ferrari, who turns around, pleased, and hands are shaken by them. A waiter is hailed by him, Rick is eyed closely, and the window is looked out of by Rick, where Ilsa is seen at the linen bazaar, then Laszlo walking toward the cafe. Signor Ferrari is not listened to by Rick, as he looks through the open window in the direction of the linen bazaar. He gets up."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "She can't continue. She raises her face to his, and he kisses her tenderly. He gazes into her eyes and kisses her as if it were the last time. Her hand falls, knocking over a glass. It's raining heavily at the train station, with people exhibiting a hectic excitement. Rick appears, stops, places his suitcase down, and checks his watch nervously as rain drenches him. Sam arrives, handing him an envelope. Rick opens it, the rain smudging the letter. Sam pulls a reluctant Rick to the train, which departs as he boards. From the steps, he crumples the letter and throws it away as steam envelops him. A close-up shows a glass on the cafe table, which Rick's hand knocks over. He's visibly drunk. Sam picks up the glass and chair. Ilsa enters, and Rick stares. She approaches with uncertainty but quiet determination. Rick pours another drink. She sits, searching his face, finding only coldness. Ilsa leaves, and Rick slumps over the table. Strasser sits as Renault works. Laszlo and Ilsa navigate the Prefecture lobby, and enter Renault's office, greeted with bows. Close-ups show their disappointment, observed by Strasser. Renault rings a buzzer for their exit. An officer enters. Signor Ferrari greets Rick warmly, sizing him up as Rick watches Ilsa at the linen bazaar, ignoring Ferrari. Rick stands."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "She can't continue. She lifts her face, and he kisses her gently, then deeply, as if it were their last. Her hand knocks over a glass. It's pouring rain at the station, bustling with excitement. Rick, amid the crowd, checks his watch nervously, despite the rain drenching him. Sam arrives, hands him an envelope, and Rick reads it as rain smudges the writing. Sam drags a stunned Rick onto the moving train. Rick crumples the letter and tosses it as steam envelops him. Back in the café, a close-up shows Rick knocking over a glass, drunk. Sam picks it up, and Ilsa enters hesitantly, determined. Rick drinks, showing no emotion. Ilsa leaves, and Rick slumps over the table. Strasser and Renault are in the office. Laszlo and Ilsa enter, greeted by Renault, revealing their disappointment. Renault opens the door for them. Rick meets Signor Ferrari, who hails a waiter and observes Rick, who watches Ilsa and Laszlo outside, uninterested in Ferrari. Rick rises."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "She simply cannot continue any longer. Lifting her face tenderly to meet his gaze, she receives his gentle, soft kiss. He peers deeply into her eyes, and then he kisses her again, this time with a fervor as if it were the final opportunity he would ever have. Her hand drops onto the table, and in doing so, it accidentally knocks over a tall, delicate glass. Meanwhile, outside, the rain is coming down in torrents at the bustling train station, where a sense of hectic, fevered excitement is palpable, visible on the faces of the numerous people hurriedly passing by. Among the crowd, Rick makes his appearance, and after stopping abruptly, he places his suitcase down on the wet ground and casually looks at his watch. With nervous energy, he checks his watch once more, uncaring of the rain that is relentlessly pouring over his head and dampening his shoulders, as it seems to go entirely unnoticed by him. Suddenly, Sam emerges from the throng, producing an envelope from his pocket, which Rick swiftly grabs, opens, and intensely gazes at the letter within, the raindrops smearing and distorting the writing. Sam then leads a somewhat stunned and reluctant Rick toward the train, which conveniently begins to move just as he manages to hop aboard. From the steps of the train, he gazes off into the vast distance, then crumples the letter in his hand and discards it, allowing it to be enveloped by the steam billowing from the engine. The scene transitions to a close-up view of a glass on a café table, and Rick's hand, rather carelessly, reaches out and accidentally tips it over. The camera now focuses on Rick's face, revealing that he is quite inebriated. Sam approaches the table, bending over to pick up not only the fallen glass but also an overturned chair. At that moment, the door swings open, revealing Ilsa standing there. Rick fixes his gaze upon the doorway, and Ilsa hesitates for a brief moment before slowly making her way over to the table. Her demeanor is somewhat uncertain, a bit tentative, yet there is a quiet determination underlying her actions. Rick reaches out for the bottle and proceeds to pour himself another drink. She settles into the chair positioned before the now-empty glass, her eyes searching his face for some sign of emotion, though all she finds is a cold, impassive look. Rick takes a sip of his drink. Without a word, Ilsa rises from her seat and departs, leaving Rick to slump his head over the table in desolation. At another location, Strasser sits as Renault attends to some paperwork, casting glances in his direction. Laszlo and Ilsa navigate through the crowded lobby of the Prefecture, as Jan and Annina engage an officer in conversation. Entering Renault's office, Laszlo and Ilsa receive bows from Renault. Close-up shots of both Ilsa and Laszlo reveal a deep disappointment, observed keenly by Strasser. With the press of a buzzer, the door is opened for their exit. As Ilsa and Laszlo leave, an officer makes his entrance. At another corner, Signor Ferrari turns with evident pleasure to see Rick, and they exchange a firm handshake. Calling over a waiter, Ferrari studies Rick intently, while Rick's gaze is directed outside the window, observing Ilsa at the linen bazaar, and then notices Laszlo approaching the cafe. Although Ferrari attempts conversation, Rick pays him little mind, remaining focused on looking through the open window in the burlap direction of the linen bazaar. Eventually, Rick rises from his seat."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "She finds herself utterly unable to continue any longer. Gently lifting her weary face to meet his unwavering gaze, she receives his soft, tender kiss with a depth of emotion. As he peers deeply and intently into her eyes, he leans in to kiss her once more, but this time there is a palpable fervor, almost as if this moment were the last opportunity he would ever have to do so. Her hand slips and drops onto the table, inadvertently knocking over a tall, delicate glass in the process. \n\nSimultaneously, outside, the rain is pouring down in relentless torrents at the bustling train station, where a sense of hectic, fevered excitement is almost tangible, visible in the expressions and hurried movements of the numerous individuals busily passing by. Amid the crowd, Rick makes his appearance, and after abruptly coming to a halt, he places his suitcase down on the wet, rain-soaked ground and casually checks his watch. With a nervous energy, he checks his watch once more, seemingly oblivious to the rain that is continuously pouring over his head, dampening his shoulders, as he appears completely unaffected by it. \n\nIn a spontaneous moment, Sam emerges from the throng, producing an envelope from his pocket, which Rick swiftly grabs, tears open, and intensely gazes at the letter contained within, the raindrops smearing and distorting the writing beyond recognition. Sam then leads a somewhat stunned and reluctant Rick toward the train, which, with perfect timing, begins to move just as he manages to hop aboard. From the steps of the moving train, he gazes out into the vast expanse of distance, then crumples the letter in his hand and discards it, allowing it to be enveloped by the steam that billows from the powerful locomotive engine. \n\nThe scene transitions seamlessly to a close-up view of a glass precariously positioned on a café table, and Rick's hand, rather absent-mindedly, reaches out and accidentally tips it over. The camera now focuses sharply on Rick's face, revealing that he is considerably inebriated. Sam approaches the table, carefully bending over to pick up not only the fallen glass but also an overturned chair. At that very moment, the door swings open with a sudden flourish, revealing Ilsa standing in the doorway. Rick fixes his gaze intently upon the entrance, and Ilsa hesitates for a fleeting moment before she slowly makes her way over to the table. Her demeanor is somewhat uncertain, a bit tentative, yet there is an unmistakable quiet determination underlying her actions. \n\nRick reaches out for the bottle, and proceeds to pour himself another drink. She settles into the chair positioned before the now-empty glass, her eyes searching his face for some sign, any hint of emotion, though all she finds is a cold, impassive look. Rick takes a deliberate sip of his drink. Without uttering a single word, Ilsa rises from her seat and departs, leaving Rick to slump his head over the table in utter desolation.\n\nIn another location, Strasser sits composedly as Renault attends to a stack of paperwork, casting curious glances in his direction. Laszlo and Ilsa navigate their way through the crowded lobby of the Prefecture, while Jan and Annina engage an officer in conversation. Entering Renault's office, Laszlo and Ilsa are greeted with polite bows from Renault. Close-up shots of both Ilsa and Laszlo reveal a deep-seated disappointment, observed keenly and shrewdly by Strasser. With the press of a buzzer, the door swings open to permit their exit. As Ilsa and Laszlo leave, an officer steps in to make his entrance.\n\nIn another corner of this unfolding drama, Signor Ferrari turns with evident pleasure upon seeing Rick, and they exchange a firm, cordial handshake. Calling over a waiter with a gesture, Ferrari studies Rick intently, while Rick's gaze is directed unwaveringly outside the window, observing Ilsa at the linen bazaar, then noticing Laszlo's approach toward the café. Although Ferrari attempts to engage Rick in conversation, Rick pays him little heed, remaining singularly focused on looking through the open window in the burlap-lined direction of the lively linen bazaar. Eventually, with deliberate motion, Rick rises from his seat."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "She feels she cannot continue and slowly raises her face to meet his, prompting him to lean in and gently press his lips against hers, a soft and tender connection. He then fixes his gaze on her eyes, deeply absorbing the moment, before kissing her again, this time with an intensity and passion as if it were their very last farewell. Her hand, devoid of strength and resolve, collapses onto the table, inadvertently colliding with a glass and sending it toppling over. Meanwhile, the train station is engulfed in a heavy downpour, each raindrop amplifying the atmosphere's frenetic energy, mirrored in the expressions of the bustling crowd. Amidst this bustling scene, Rick emerges, carefully making his way through the throng. He comes to an abrupt halt, gently sets his suitcase down, and takes a quick glance at his watch, a gesture tinged with urgency and impatience. His eyes dart to his watch once more, oblivious to the sheets of rain streaming down his head and shoulders and drenching him completely. In a sudden shift of events, Sam materializes out of the crowd, swiftly extracting an envelope from his pocket. Rick hastily snatches it, tears it open, and lets his eyes fall onto the letter held within, even as the relentless rain blurs and smudges the inked words. Sam, sensing Rick's hesitation, firmly grasps his arm, urging and almost dragging the startled Rick toward the waiting train, which begins to pull away just as Rick steps on board. Standing on the steps, Rick's gaze fixes on the distant horizon, grappling with a maelstrom of emotions, before his resolve crumbles, matching the letter he crumples and discards carelessly into the swirling steam enveloping him. In sharp contrast, the scene transitions back to the cafe where a close-up reveals a glass on the table, only to be knocked over by Rick's unsteady hand. The camera pans up to reveal Rick's face, his features heavy with the unmistakable signs of inebriation. Sam approaches, dutifully gathering the overturned glass and righting a fallen chair nearby, restoring some semblance of order. Just as Sam finishes, the door swings open, revealing Ilsa standing in the threshold. Rick's eyes lock onto the doorway, taking in the sight of Ilsa as she pauses briefly, her demeanor tinged with uncertainty yet underscored by a quiet resolve. She proceeds over to the table, her movements measured and gentle, and finally lowers herself into the chair before the vacant glass, her eyes gently probing his face for any trace of warmth, only to be met with his cold, impassive exterior. In response, he reaches for the bottle with a steady hand, pouring another drink to fortify himself. Ilsa, sensing the futility, rises from her seat and withdraws, leaving Rick to slump forward, his head heavy on the table. The scene shifts to Strasser seated while Renault, preoccupied, attends to paperwork, casting a glance at him. Simultaneously, Laszlo and Ilsa navigate through the dense crowd cluttering the Prefecture's lobby as Jan and Annina engage an officer in conversation. With poise, Laszlo and Ilsa approach Renault's office entrance, and as they step inside, Renault greets them with a courteous bow. Their faces, caught in close-up, betray their disappointment, an emotion keenly observed by Strasser. Without hesitation, Renault presses a buzzer to signal departure, and the door is ceremoniously opened to facilitate their exit. As they leave, an officer enters the scene, signaling a change of pace. Meanwhile, Signor Ferrari, upon encountering Rick, turns with a welcoming smile and they exchange a warm handshake. Ferrari calls a waiter, his eyes scrutinizing Rick, who is meanwhile absorbed in the view outside, his gaze drifting toward the linen bazaar where Ilsa can be seen, and further beyond to where Laszlo is approaching the cafe. Rick remains disengaged from Ferrari's words, his attention utterly consumed by the scene framed within the open window, and what it portends, prompting him to rise decisively from his seat."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "She can't continue and lifts her face to him for a gentle kiss, followed by a more intense one as if it were their last. Her hand accidentally knocks over a glass as the scene shifts to a bustling, rainy train station, alive with frenetic energy. In the crowd, Rick appears, sets down his suitcase, and anxiously checks his watch, seemingly unaware of the rain soaking him. Sam suddenly arrives, hands Rick an envelope, and Rick reads the letter as the rain smudges the ink. Sam pulls a hesitant Rick onto the departing train. Rick throws the crumpled letter away, shrouded in engine steam.\n\nIn a cafe, Rick's drunken hand knocks over a glass. Sam tidies up around him just as Ilsa enters, her manner uncertain yet quietly determined. Rick coldly drinks while Ilsa sits opposite him, searching his emotionless face. She soon leaves, and Rick's head falls to the table. Elsewhere, Strasser observes Renault attending to paperwork. Laszlo and Ilsa navigate the crowded lobby to Renault's office, where they are greeted with bows. Disappointment is evident on their faces, noticed by Strasser. As they depart, an officer enters. Meanwhile, Signor Ferrari greets Rick warmly before they shake hands. Ferrari signals a waiter while observing Rick, who is distractedly watching Ilsa and Laszlo near the linen bazaar. Rick rises from his seat, lost in thought."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She can't go on, overwhelmed by the weight of their circumstances in the dimly lit room of the Parisian apartment. She lifts her face to his, and he kisses her gently. He looks into her eyes, then he does kiss her as though it were going to be the last time, their separation inevitable amid the chaos of World War II. Her hand falls to the table and knocks over a glass, spilling remnants of the fine French wine they had been sharing. It's raining very hard at the train station, a bustling hub of departures and reunions common during the war, and there is a hectic, fevered excitement, evident in the faces of the people that pass by, each with their own urgent story. Rick appears in the crowd, a man marked by his past and yet searching for a future, stops, puts his suitcase down, and glances at his watch, a family heirloom. He nervously checks his watch again, rain pouring over his head and shoulders in sheets, but he doesn't seem to notice, his mind elsewhere. Suddenly Sam, his loyal friend and confidant from their time in Casablanca, appears, pulls an envelope from his pocket, and Rick grabs it, opens it, and stares down at the letter detailing a new safe passage, as raindrops pour down the letter, smudging the writing. Sam pulls a stunned, reluctant Rick to the train, which starts to move just as he boards. From the steps he looks off into the distance, then crumbles the letter and tosses it away into the wind as the steam from the engine clouds over him, symbolizing his unresolved feelings. A close-up of a glass on the table in the cafe is shown, and Rick's hand reaches for it and knocks it over as if mirroring his inner turmoil. We now see Rick's face and he's very drunk, drowning his sorrows. Sam walks over to the table to pick up the glass and a fallen chair, knowing too well the depths of Rick's despair. Just then the door opens and it's Ilsa, the woman who once shattered his heart in Paris. Rick stares at the doorway. Ilsa lingers a moment, then comes over to the table, her manner a little uncertain, a little tentative, but with a quiet determination beneath it, driven by the need to find closure. Rick reaches for the bottle, and pours himself another drink, trying to maintain his composure. She sits down in the chair before the empty glass, her eyes searching his face for any sign of the man she once loved, but there is no expression on it except a cold and impassive one, crafted by years of heartache. He takes a drink. Ilsa gets up and leaves, and Rick's head slumps over the table, weighed down by a mixture of alcohol and regret. Strasser, a German officer known for his cunning and ruthless nature, sits while Renault, the Vichy official with shifting loyalties, attends to some paperwork and looks at him. Laszlo, a leader of the Resistance, and Ilsa make their way through the jam in the lobby of the Prefecture, a place of bureaucratic power and control, as Jan and Annina, refugees seeking escape, talk to an officer. Laszlo and Ilsa enter Renault's office, and Renault bows to them both, masking his intentions. Close-ups of Ilsa and then Laszlo reveal their disappointment, observed by Strasser, who watches for any sign of weakness. Renault rings a buzzer and the door is opened for them, a signal for their departure. As Ilsa and Laszlo leave, an officer comes in, interrupting the tense moment. Signor Ferrari, the shrewd owner of the Blue Parrot nightclub, turns around, pleased to see Rick, and they shake hands, an alliance of convenience. He hails a waiter, eyes Rick closely, assessing his next move, and Rick looks out of the window and sees Ilsa at the linen bazaar, a place teeming with vibrant fabrics and merchants haggling over prices, then Laszlo walking toward the cafe. Rick isn't listening to him, looking through the open window in the direction of the linen bazaar, lost in thoughts of what might have been. Rick gets up, driven by a sense of purpose amid the swirling currents of fate."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "her manner a little uncertain a little tentative but with a quiet determination beneath it She cannot go on Rick gets up She lifts her face to his and he kisses her gently He looks into her eyes then he does kiss her as though it were going to be the last time Her hand falls to the table and knocks over a glass It is raining very hard at the train station and there is a hectic fevered excitement evident in the faces of the people that pass by Rick appears in the crowd stops puts his suitcase down and glances at his watch He nervously checks his watch again rain pouring over his head and shoulders but he does not seem to notice We now see Rick's face and he is very drunk Suddenly Sam appears pulls an envelope from his pocket and Rick grabs it opens it and stares down at the letter as raindrops pour down the letter smudging the writing Sam pulls a stunned reluctant Rick to the train which starts to move just as he boards It is raining very hard at the train station and there is a hectic fevered excitement evident in the faces of the people that pass by From the steps he looks off into the distance then crumbles the letter and tosses it away as the steam from the engine clouds over him He takes a drink A closeup of a glass on the table in the cafe is shown and Rick's hand reaches for it and knocks it over rain pouring over his head and shoulders but he does not seem to notice He looks into her eyes then he does kiss her as though it were going to be the last time She lifts her face to his and he kisses her gently Ilsa gets up and leaves and Rick's head slumps over the table We now see Rick's face and he is very drunk Sam walks over to the table to pick up the glass and a fallen chair Just then the door opens and it is Ilsa Rick stares at the doorway Ilsa lingers a moment then comes over to the table her manner a little uncertain a little tentative but with a quiet determination beneath it She cannot go on Rick reaches for the bottle and pours himself another drink She sits down in the chair before the empty glass her eyes searching his face but there is no expression on it except a cold and impassive one He takes a drink Her hand falls to the table and knocks over a glass Renault rings a buzzer and the door is opened for them Ilsa gets up and leaves and Rick's head slumps over the table Strasser sits while Renault attends to some paperwork and looks at him Laszlo and Ilsa make their way through the jam in the lobby of the Prefecture as Jan and Annina talk to an officer Laszlo and Ilsa enter Renault's office and Renault bows to them both Closeups of Ilsa and then Laszlo reveal their disappointment observed by Strasser Renault rings a buzzer and the door is opened for them As Ilsa and Laszlo leave an officer comes in Signor Ferrari turns around pleased to see Rick and they shake hands then Laszlo walking toward the cafe Strasser sits while Renault attends to some paperwork and looks at him Ilsa lingers a moment then comes over to the table He hails a waiter eyes Rick closely and Rick looks out of the window and sees Ilsa at the linen bazaar Rick is not listening to him looking through the open window in the direction of the linen bazaar He hails a waiter eyes Rick closely and Rick looks out of the window and sees Ilsa at the linen bazaar then Laszlo walking toward the cafe Rick is not listening to him looking through the open window in the direction of the linen bazaar Rick gets up"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "She cannot go on. She lifts her face to his and he kisses her gently. He looks into her eyes then he does kiss her as though it were going to be the last time. Her hand falls to the table and knocks over a glass. It is raining very hard at the train station and there is a hectic fevered excitement evident in the faces of the people that pass by. Rick appears in the crowd stops puts his suitcase down and glances at his watch. He nervously checks his watch again. rain pouring over his head and shoulders but he does not seem to notice. Suddenly Sam appears pulls an envelope from his pocket and Rick grabs it opens it and stares down at the letter. as raindrops pour down the letter smudging the writing. Sam pulls a stunned reluctant Rick to the train which starts to move just as he boards. From the steps he looks off into the distance then crumbles the letter and tosses it away as the steam from the engine clouds over him. A closeup of a glass on the table in the cafe is shown and Rick's hand reaches for it and knocks it over. We now see Rick's face and he is very drunk. Sam walks over to the table to pick up the glass and a fallen chair. Just then the door opens and it is Ilsa. Rick stares at the doorway. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Ilsa lingers a moment then comes over to the table. her manner a little uncertain a little tentative but with a quiet determination beneath it. Rick reaches for the bottle and pours himself another drink. She sits down in the chair before the empty glass her eyes searching his face but there is no expression on it except a cold and impassive one. He takes a drink. Ilsa gets up and leaves and Rick's head slumps over the table. Strasser sits while Renault attends to some paperwork and looks at him. Laszlo and Ilsa make their way through the jam in the lobby of the Prefecture. as Jan and Annina talk to an officer Laszlo and Ilsa enter Renault's office and Renault bows to them both. Closeups of Ilsa and then Laszlo reveal their disappointment observed by Strasser. Renault rings a buzzer and the door is opened for them. As Ilsa and Laszlo leave an officer comes in. Signor Ferrari turns around pleased to see Rick and they shake hands. He hails a waiter eyes Rick closely and Rick looks out of the window and sees Ilsa at the linen bazaar. then Laszlo walking toward the cafe. Rick is not listening to him looking through the open window in the direction of the linen bazaar. Rick gets up."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "She cannot go on. She lifts her face to his and he kisses her gently. He looks into her eyes then he does kiss her as though it were going to be the last time. Her hand falls to the table and knocks over a glass. It is raining very hard at the train station and there is a hectic fevered excitement evident in the faces of the people that pass by. Rick appears in the crowd stops puts his suitcase down and glances at his watch. He nervously checks his watch again. rain pouring over his head and shoulders but he does not seem to notice. Suddenly Sam appears pulls an envelope from his pocket and Rick grabs it opens it and stares down at the letter. as raindrops pour down the letter smudging the writing. Sam pulls a stunned reluctant Rick to the train which starts to move just as he boards. From the steps he looks off into the distance then crumbles the letter and tosses it away as the steam from the engine clouds over him. A closeup of a glass on the table in the cafe is shown and Rick's hand reaches for it and knocks it over. We now see Rick's face and he is very drunk. Sam walks over to the table to pick up the glass and a fallen chair. Just then the door opens and it is Ilsa. Rick stares at the doorway. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. Ilsa lingers a moment then comes over to the table. her manner a little uncertain a little tentative but with a quiet determination beneath it. Rick reaches for the bottle and pours himself another drink. She sits down in the chair before the empty glass her eyes searching his face but there is no expression on it except a cold and impassive one. He takes a drink. Ilsa gets up and leaves and Rick's head slumps over the table. Strasser sits while Renault attends to some paperwork and looks at him. Laszlo and Ilsa make their way through the jam in the lobby of the Prefecture. as Jan and Annina talk to an officer Laszlo and Ilsa enter Renault's office and Renault bows to them both. Closeups of Ilsa and then Laszlo reveal their disappointment observed by Strasser. Renault rings a buzzer and the door is opened for them. As Ilsa and Laszlo leave an officer comes in. Signor Ferrari turns around pleased to see Rick and they shake hands. He hails a waiter eyes Rick closely and Rick looks out of the window and sees Ilsa at the linen bazaar. then Laszlo walking toward the cafe. Rick is not listening to him looking through the open window in the direction of the linen bazaar. Rick gets up."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "She cannot go on. She lifts her face to his and he kisses her gently. He looks into her eyes then he does kiss her as though it were going to be the last time. Her hand falls to the table and knocks over a glass. It is raining very hard at the train station and there is a hectic fevered excitement evident in the faces of the people that pass by. Rick appears in the crowd stops puts his suitcase down and glances at his watch. He nervously checks his watch again. rain pouring over his head and shoulders but he does not seem to notice. Suddenly Sam appears pulls an envelope from his pocket and Rick grabs it opens it and stares down at the letter. Closeups of Ilsa and then Laszlo reveal their disappointment observed by Strasser. Renault rings a buzzer and the door is opened for them. As Ilsa and Laszlo leave an officer comes in. Signor Ferrari turns around pleased to see Rick and they shake hands. He hails a waiter eyes Rick closely and Rick looks out of the window and sees Ilsa at the linen bazaar. then Laszlo walking toward the cafe. Rick is not listening to him looking through the open window in the direction of the linen bazaar. Rick gets up."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "She cannot go on. She lifts her face to his and he kisses her gently. He looks into her eyes then he does kiss her as though it were going to be the last time. Her hand falls to the table and knocks over a glass. then Laszlo walking toward the cafe. Rick is not listening to him looking through the open window in the direction of the linen bazaar. Rick gets up."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dog can't go on. The dog lifts its face to the squirrel, and the squirrel kisses the dog gently. The squirrel looks into the dog's eyes, then the squirrel does kiss the dog as though it were going to be the last time. The dog's paw falls to the table and knocks over a glass. It's raining very hard at the train station, and there is a hectic, fevered excitement, evident in the faces of the people that pass by. The cat appears in the crowd, stops, puts its suitcase down, and glances at its watch. The cat nervously checks its watch again, rain pouring over its head and shoulders, but the cat doesn't seem to notice. Suddenly the bird appears, pulls an envelope from its pocket, and the cat grabs it, opens it, and stares down at the letter, as raindrops pour down the letter, smudging the writing. The bird pulls a stunned, reluctant cat to the train, which starts to move just as the cat boards. From the steps the cat looks off into the distance, then crumbles the letter and tosses it away as the steam from the engine clouds over the cat. A close-up of a glass on the table in the cafe is shown, and the cat's paw reaches for it and knocks it over. We now see the cat's face and it's very drunk. The bird walks over to the table to pick up the glass and a fallen chair. Just then the door opens and it's the rabbit. The cat stares at the doorway. The rabbit lingers a moment, then comes over to the table, its manner a little uncertain, a little tentative, but with a quiet determination beneath it. The cat reaches for the bottle, and pours itself another drink. The rabbit sits down in the chair before the empty glass, its eyes searching the cat's face, but there is no expression on it except a cold and impassive one. The cat takes a drink. The rabbit gets up and leaves, and the cat's head slumps over the table. The elephant sits while the giraffe attends to some paperwork and looks at the elephant. The mouse and the rabbit make their way through the jam in the lobby of the Prefecture, as the turtle and the ladybug talk to an officer. The mouse and the rabbit enter the giraffe's office, and the giraffe bows to them both. Close-ups of the rabbit and then the mouse reveal their disappointment, observed by the elephant. The giraffe rings a buzzer and the door is opened for them. As the rabbit and the mouse leave, an officer comes in. The fox turns around, pleased to see the cat, and they shake hands. The fox hails a waiter, eyes the cat closely, and the cat looks out of the window and sees the rabbit at the linen bazaar, then the mouse walking toward the cafe. The cat isn't listening to the fox, looking through the open window in the direction of the linen bazaar. The cat gets up."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "She can't go on. She lifts her face to his, and he kisses her gently. He looks into her eyes, then he does kiss her as though it were going to be the last time. Her hand falls to the bench and knocks over a candle. It's snowing very hard at the park, and there is a hectic, fevered excitement, evident in the faces of the people that pass by. Rick appears in the crowd, stops, puts his backpack down, and glances at his phone. He nervously checks his phone again, snow piling over his head and shoulders, but he doesn't seem to notice. Suddenly Sam appears, pulls a map from his pocket, and Rick grabs it, opens it, and stares down at the map, as snowflakes land on it, smudging the ink. Sam pulls a stunned, reluctant Rick to the car, which starts to move just as he boards. From the steps he looks off into the distance, then crumbles the map and tosses it away as the fog from the engine clouds over him. A close-up of a candle on the bench in the library is shown, and Rick's hand reaches for it and knocks it over. We now see Rick's face and he's very tipsy. Sam walks over to the bench to pick up the candle and a fallen book. Just then the window opens and it's Ilsa. Rick stares at the window. Ilsa lingers a moment, then comes over to the bench, her manner a little uncertain, a little tentative, but with a quiet determination beneath it. Rick reaches for the mug, and pours himself another drink. She sits down in the armchair before the empty candle holder, her eyes searching his face, but there is no expression on it except a cold and impassive one. He takes a drink. Ilsa gets up and leaves, and Rick's head slumps over the bench. Strasser sits while Renault attends to some paperwork and looks at him. Laszlo and Ilsa make their way through the jam in the lobby of the embassy, as Jan and Annina talk to an officer. Laszlo and Ilsa enter Renault's office, and Renault bows to them both. Close-ups of Ilsa and then Laszlo reveal their disappointment, observed by Strasser. Renault rings a bell and the window is opened for them. As Ilsa and Laszlo leave, an officer comes in. Signor Ferrari turns around, pleased to see Rick, and they shake hands. He hails a server, eyes Rick closely, and Rick looks out of the doorway and sees Ilsa at the hat shop, then Laszlo walking toward the library. Rick isn't listening to him, looking through the open doorway in the direction of the hat shop. Rick gets up."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "She can't hold on. She lowers her face to his, and he hugs her gently. He peers into her eyes, then he does hug her as though it were going to be the last time. Her hand rises to the table and taps on a glass. It's snowing very lightly at the train station, and there is a calm, serene anticipation, hidden in the faces of the people that pass by. Rick vanishes in the crowd, pauses, lifts his suitcase up, and peeks at his watch. He eagerly taps his watch again, snowflakes landing on his head and shoulders, but he doesn't seem to react. Suddenly Sam emerges, slides an envelope from his pocket, and Rick snatches it, closes it, and glances up at the letter, as snowflakes gather on the letter, brightening the writing. Sam nudges a calm, willing Rick to the train, which halts just as he enters. From the steps he gazes off into the distance, then unfolds the letter and tucks it away as the steam from the engine clears away from him. A close-up of a bottle on the table in the cafe is shown, and Rick's hand reaches for it and sets it upright. We now see Rick's face and he's very alert. Sam strolls over to the table to set up the glass and a fallen chair. Just then the door closes and it's Ilsa. Rick glances at the doorway. Ilsa hesitates a moment, then strides over to the table, her manner a little bold, a little assertive, but with a wavering uncertainty beneath it. Rick reaches for the napkin, and folds himself another paper. She sits down in the chair before the full glass, her eyes avoiding his face, but there is no expression on it except a warm and emotive one. He sets down the drink. Ilsa sits back and pauses, and Rick's head lifts over the table. Strasser stands while Renault holds some paperwork and frowns at him. Laszlo and Ilsa push their way through the space in the lobby of the Prefecture, as Jan and Annina greet an officer. Laszlo and Ilsa leave Renault's office, and Renault turns away from them both. Close-ups of Ilsa and then Laszlo reveal their relief, hidden by Strasser. Renault taps a buzzer and the door is closed for them. As Ilsa and Laszlo stay, an officer goes out. Signor Ferrari walks over, eager to see Rick, and they embrace. He summons a waiter, ignores Rick closely, and Rick looks back from the window and spots Ilsa at the linen bazaar, then Laszlo jogging from the cafe. Rick isn’t hearing him, closing the open window in the direction of the linen bazaar. Rick sits down."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The saxophone can't go on. The saxophone lifts its lamp to the suitcase, and the lamp kisses the saxophone gently. The lamp looks into the saxophone's shoelaces, then it does kiss the saxophone as though it were going to be the last time. The saxophone's shoe falls to the curtain and knocks over a pillow. It's snowing very hard at the grocery store, and there is a hectic, fevered excitement, evident in the whiskers of the tulips that scamper by. A kite appears in the crowd, stops, puts its sandwich down, and glances at its glove. The kite nervously checks its glove again, snow pouring over its elbow and knees, but it doesn't seem to notice. Suddenly a toaster appears, pulls an umbrella from its pocket, and the kite grabs it, opens it, and stares down at the postcard, as snowflakes pour down the postcard, smudging the doodles. The toaster pulls a stunned, reluctant kite to the bicycle, which starts to move just as it boards. From the steps it looks off into the distance, then crumbles the postcard and tosses it away as the steam from the engine clouds over it. A close-up of a pillow on the curtain in the hotel is shown, and the kite's shoe reaches for it and knocks it over. We now see the kite's face and it's very asleep. The toaster walks over to the curtain to pick up the pillow and a fallen balloon. Just then the book opens and it's a violin. The kite stares at the walkway. The violin lingers a moment, then comes over to the curtain, its manner a little uncertain, a little tentative, but with a quiet determination beneath it. The kite reaches for the notebook, and pours itself another candy. The violin sits down in the balloon before the empty pillow, its shoelaces searching the kite's face, but there is no expression on it except a cold and impassive one. The lamp takes a candy. The violin gets up and leaves, and the kite's jacket slumps over the curtain. A tree sits while a microwave attends to some wallpaper and looks at it. A lamp and a violin make their way through the jam in the driveway of the bakery, as a lamp and a cello talk to a violin. A lamp and a violin enter the microwave's shoe, and the microwave bows to them both. Close-ups of the violin and then the lamp reveal their disappointment, observed by the tree. The microwave rings a drum and the book is opened for them. As the violin and the lamp leave, a violin comes in. A banjo turns around, pleased to see the kite, and they shake shoelaces. It hails a backpack, eyes the kite closely, and the kite looks out of the doorway and sees the violin at the fruit market, then the lamp walking toward the hotel. The kite isn't listening to it, looking through the open doorway in the direction of the fruit market. The kite gets up."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "She can’t continue. She tilts her face to his, and he whispers to her softly. He peers into her eyes, then he does whisper to her as though it were going to be the last time. Her hand lands on the table and tips over a vase. It’s snowing very heavily at the bus stop, and there is a bustling, frenzied anticipation, marked on the faces of the people that wander past. Jack emerges in the crowd, pauses, places his backpack down, and checks his phone. He anxiously checks his phone again, snow falling on his head and shoulders, but he doesn’t seem to care. Suddenly Dave appears, takes out a letter from his jacket, and Jack snatches it, rips it open, and peers down at the note, as snowflakes fall on the note, blurring the words. Dave drags a bewildered, hesitant Jack to the bus, which begins to depart just as he boards. From the steps he gazes into the horizon, then crumples the note and lets it drift away as the smoke from the exhaust envelops him. A close-up of a mug on the table in the cafeteria is shown, and Jack’s hand reaches for it and tips it over. We now see Jack’s face and he’s very disoriented. Dave strolls over to the table to retrieve the mug and an overturned stool. Just then the door swings open and it’s Emma. Jack gazes at the entrance. Emma hesitates a moment, then strides over to the table, her demeanor a little apprehensive, a little hesitant, but with a quiet resolve underneath it. Jack reaches for the jug, and fills himself another cup. She settles down in the stool before the empty mug, her eyes studying his face, but there is no emotion on it except a cold and detached one. He takes a sip. Emma stands up and exits, and Jack’s head droops over the table. Johnson reclines while Murray attends to some notes and glances at him. Davis and Emma navigate their way through the congestion in the atrium of the Embassy, as Tom and Linda chat to a clerk. Davis and Emma enter Murray’s chamber, and Murray nods to them both. Close-ups of Emma and then Davis show their frustration, noticed by Johnson. Murray presses a buzzer and the door is opened for them. As Emma and Davis depart, a clerk enters. Mr. Rossi swivels around, happy to see Jack, and they shake hands. He calls over a waitress, watches Jack intently, and Jack gazes out of the window and spots Emma at the fabric market, then Davis heading toward the cafeteria. Jack isn’t paying attention to him, gazing through the open window toward the fabric market. Jack stands up."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "She can't proceed. She tilts her nose to his, and he nudges her gently. He peers into her eyes, then he does nudge her as though it were going to be the final moment. Her hand descends to the plate and bumps into a candle. It's snowing very hard at the airport, and there is a calm, relaxed tranquility, evident in the expressions of the people that stroll by. Rick emerges in the throng, halts, places his backpack down, and peeks at his compass. He anxiously checks his compass again, snow cascading over his hat and coat, but he doesn't appear to mind. Suddenly Sam emerges, extracts a postcard from his bag, and Rick snatches it, unfolds it, and peers down at the note, as snowflakes cascade down the note, blurring the writing. Sam pushes a bewildered, unwilling Rick to the boat, which starts to drift just as he climbs aboard. From the deck, he gazes off into the horizon, then crumples the note and flicks it away as the mist from the ocean envelops him. A close-up of a candle on the plate in the bistro is shown, and Rick's finger brushes it and bumps it over. We now see Rick's profile, and he's very weary. Sam strolls over to the plate to pick up the candle and a tossed hat. Just then the door swings open and it's Ilsa. Rick gazes at the entryway. Ilsa hesitates a moment, then approaches the plate, her demeanor slightly unsure, a bit hesitant, but with a calm persistence beneath it. Rick stretches for the flask, and fills himself another sip. She settles down in the chair before the vacant plate, her eyes probing his profile, but there is no emotion on it except a distant and unreadable one. He takes a sip. Ilsa rises and departs, and Rick's chin droops over the plate. Strasser reclines while Renault attends to some folders and glances at him. Laszlo and Ilsa maneuver their way through the jam in the lounge of the Headquarters, as Jan and Annina chat with a clerk. Laszlo and Ilsa step into Renault's study, and Renault nods to them both. Close-ups of Ilsa and then Laszlo unveil their disillusionment, observed by Strasser. Renault presses a switch and the entryway is swung open for them. As Ilsa and Laszlo depart, a clerk enters. Signor Ferrari swivels around, delighted to see Rick, and they exchange pleasantries. He beckons a server, scrutinizes Rick intently, and Rick gazes out of the portal and sees Ilsa at the fabric market, then Laszlo ambling toward the bistro. Rick isn't heeding him, peering through the wide window in the direction of the fabric market. Rick stands up."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "She won't march on. She tilts her head to the cat, and the dog licks her softly. The dog peers into her ears, then it does lick her as if it were going to be the first time. Her toe drops to the couch and flips over a book. It's snowing very lightly at the bus stop, and there is a calm, sleepy relaxation, evident in the feet of the insects that wander by. Tim appears in the flock, skips, places his backpack down, and squints at his ring. He calmly checks his ring again, snow piling over his feet and ankles, but he doesn't seem to feel it. Suddenly Max emerges, extracts a spoon from his bag, and Tim snatches it, inspects it, and peers up at the spoon, as snowflakes drip off the spoon, fading the colors. Max drags a chuckling, eager Tim to the bus, which halts to move just as he leaps. From the windows, he gazes off into the haze, then scatters the spoon and flings it away as the mist from the fountain wafts over him. A close-up of a book on the couch in the library is shown, and Tim's toe reaches for it and flips it over. We now see Tim's chin and he's very sleepy. Max strides over to the couch to pick up the book and a standing lamp. Just then the gate swings open and it's Julia. Tim gazes at the gateway. Julia pauses a moment, then clambers over to the couch, her stance a little worried, a little timid, but with a loud persistence beneath it. Tim reaches for the sandwich, and bites himself another piece. She climbs down in the lamp before the full plate, her nose tracing his chin, but there is no movement on it except a warm and lively one. He bites a piece. Julia stands up and leaps, and Tim's toes slouch over the couch. Captain lounges while Leo bends to some inkwork and glances at him. Victor and Julia make their path through the gap in the lobby of the Museum, as Pete and Angela listen to a gardener. Victor and Julia step into Leo's room, and Leo nods to them both. Close-ups of Julia and then Victor betray their satisfaction, observed by Captain. Leo presses a socket and the gate is fastened for them. As Julia and Victor jump, a newspaper arrives in. Señor Luca pivots around, eager to hear Tim, and they bump elbows. He calls a teacher, glances at Tim slowly, and Tim scans out of the ceiling and hears Julia at the paper mill, then Victor strolling toward the library. Tim isn't hearing him, peering through the shut ceiling in the direction of the paper mill. Tim pops up."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "She can't continue and lifts her face to him; he kisses her gently, then passionately, as if it's their last moment. Her hand knocks over a glass. At the bustling, rainy train station, Rick stands anxious, checking his watch. Sam appears, handing him an envelope. Rick opens it, rain smudging the letter as Sam pulls him onto the moving train. Rick crumples the letter, tossing it away as he departs. Back at the cafe, Rick is drunk, knocking over another glass. Sam tidies up as Ilsa enters, hesitantly joining Rick at the table. He remains cold and impassive, pouring another drink. Ilsa leaves, and Rick slumps over. Strasser and Renault are in the office, while Laszlo and Ilsa meet Renault, their disappointment clear. Rick later meets Signor Ferrari, distracted as he sees Ilsa and Laszlo outside. Rick rises, lost in thought."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Rick gets up Rick is not listening to him looking through the open window in the direction of the linen bazaar then Laszlo walking toward the cafe He hails a waiter eyes Rick closely and Rick looks out of the window and sees Ilsa at the linen bazaar Signor Ferrari turns around pleased to see Rick and they shake hands As Ilsa and Laszlo leave an officer comes in Renault rings a buzzer and the door is opened for them Closeups of Ilsa and then Laszlo reveal their disappointment observed by Strasser as Jan and Annina talk to an officer Laszlo and Ilsa enter Renault's office and Renault bows to them both Laszlo and Ilsa make their way through the jam in the lobby of the Prefecture Strasser sits while Renault attends to some paperwork and looks at him Ilsa gets up and leaves and Rick's head slumps over the table He takes a drink She sits down in the chair before the empty glass her eyes searching his face but there is no expression on it except a cold and impassive one Rick reaches for the bottle and pours himself another drink her manner a little uncertain a little tentative but with a quiet determination beneath it Ilsa lingers a moment then comes over to the table Rick stares at the doorway Just then the door opens and it is Ilsa Sam walks over to the table to pick up the glass and a fallen chair We now see Rick's face and he is very drunk A closeup of a glass on the table in the cafe is shown and Rick's hand reaches for it and knocks it over From the steps he looks off into the distance then crumbles the letter and tosses it away as the steam from the engine clouds over him Sam pulls a stunned reluctant Rick to the train which starts to move just as he boards as raindrops pour down the letter smudging the writing Suddenly Sam appears pulls an envelope from his pocket and Rick grabs it opens it and stares down at the letter rain pouring over his head and shoulders but he does not seem to notice He nervously checks his watch again Rick appears in the crowd stops puts his suitcase down and glances at his watch It is raining very hard at the train station and there is a hectic fevered excitement evident in the faces of the people that pass by Her hand falls to the table and knocks over a glass He looks into her eyes then he does kiss her as though it were going to be the last time She lifts her face to his and he kisses her gently She cannot go on"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Rick appears in the crowd stops puts his suitcase down and glances at his watch Rick reaches for the bottle and pours himself another drink She sits down in the chair before the empty glass her eyes searching his face but there is no expression on it except a cold and impassive one A closeup of a glass on the table in the cafe is shown and Rick's hand reaches for it and knocks it over Laszlo and Ilsa make their way through the jam in the lobby of the Prefecture As Ilsa and Laszlo leave an officer comes in Just then the door opens and it is Ilsa Sam pulls a stunned reluctant Rick to the train which starts to move just as he boards Rick stares at the doorway From the steps he looks off into the distance then crumbles the letter and tosses it away as the steam from the engine clouds over him Closeups of Ilsa and then Laszlo reveal their disappointment observed by Strasser Sam walks over to the table to pick up the glass and a fallen chair as Jan and Annina talk to an officer Laszlo and Ilsa enter Renault's office and Renault bows to them both as raindrops pour down the letter smudging the writing Suddenly Sam appears pulls an envelope from his pocket and Rick grabs it opens it and stares down at the letter Signor Ferrari turns around pleased to see Rick and they shake hands He nervously checks his watch again Ilsa gets up and leaves and Rick's head slumps over the table She cannot go on Rick is not listening to him looking through the open window in the direction of the linen bazaar We now see Rick's face and he is very drunk her manner a little uncertain a little tentative but with a quiet determination beneath it He looks into her eyes then he does kiss her as though it were going to be the last time then Laszlo walking toward the cafe Renault rings a buzzer and the door is opened for them He takes a drink Her hand falls to the table and knocks over a glass Strasser sits while Renault attends to some paperwork and looks at him It is raining very hard at the train station and there is a hectic fevered excitement evident in the faces of the people that pass by He hails a waiter eyes Rick closely and Rick looks out of the window and sees Ilsa at the linen bazaar Rick gets up Ilsa lingers a moment then comes over to the table She lifts her face to his and he kisses her gently rain pouring over his head and shoulders but he does not seem to notice"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Ilsa lingers a moment then comes over to the table her manner a little uncertain a little tentative but with a quiet determination beneath it Rick reaches for the bottle and pours himself another drink She sits down in the chair before the empty glass her eyes searching his face but there is no expression on it except a cold and impassive one He takes a drink Ilsa gets up and leaves and Rick's head slumps over the table Strasser sits while Renault attends to some paperwork and looks at him Laszlo and Ilsa make their way through the jam in the lobby of the Prefecture as Jan and Annina talk to an officer Laszlo and Ilsa enter Renault's office and Renault bows to them both Closeups of Ilsa and then Laszlo reveal their disappointment observed by Strasser Renault rings a buzzer and the door is opened for them As Ilsa and Laszlo leave an officer comes in Signor Ferrari turns around pleased to see Rick and they shake hands He hails a waiter eyes Rick closely and Rick looks out of the window and sees Ilsa at the linen bazaar then Laszlo walking toward the cafe Rick is not listening to him looking through the open window in the direction of the linen bazaar Rick gets up She cannot go on She lifts her face to his and he kisses her gently He looks into her eyes then he does kiss her as though it were going to be the last time Her hand falls to the table and knocks over a glass It is raining very hard at the train station and there is a hectic fevered excitement evident in the faces of the people that pass by Rick appears in the crowd stops puts his suitcase down and glances at his watch He nervously checks his watch again rain pouring over his head and shoulders but he does not seem to notice Suddenly Sam appears pulls an envelope from his pocket and Rick grabs it opens it and stares down at the letter as raindrops pour down the letter smudging the writing Sam pulls a stunned reluctant Rick to the train which starts to move just as he boards From the steps he looks off into the distance then crumbles the letter and tosses it away as the steam from the engine clouds over him A closeup of a glass on the table in the cafe is shown and Rick's hand reaches for it and knocks it over We now see Rick's face and he is very drunk Sam walks over to the table to pick up the glass and a fallen chair Just then the door opens and it is Ilsa Rick stares at the doorway"
        }
      ]
    }
  ]
}