{
  "ground_truth": "Gandalf stands quietly on a balcony that overlooks the great city as Pippin stares up at the vast night sky. Gandalf watches the young hobbit and then joins Pippin as they look towards the distant, jagged mountains of Mordor. Pippin, unnerved, looks up at Gandalf, who gives him a small self-deprecating smile. Together, Gandalf and Pippin share a quiet moment as they stare out towards the fiery sky over Mordor. Giant Mumakil carry armies upon their backs, and Corsair ships sail up the river. Almost talking to himself, like a man unable to prevent a sure disaster, Gandalf observes the battle-scarred city of Osgiliath, the last bastion between Minas Tirith and Mordor. Pippin desperately seeks reassurance, but Gandalf looks down at him without saying anything and stares into the distance as if seeing something in his mind's eye. A towering, hooded figure dressed in black is being armored by attendant orcs as Gandalf continues to stare intently as if facing his enemy in person. Pippin looks up at Gandalf, afraid to ask, while he recalls Frodo screaming as the Morgul blade is driven into his shoulder, and Pippin blanches at the memory. Meanwhile, Frodo and Sam clamber into a small gully beside a rough-hewn road as Gollum carefully peers over the lip of the gully. Minas Morgul, a massive dead city set upon a rocky knee at the head of the Morgul Valley, glows with a sickly luminous light like a corpse candle, and two huge, bestial stone statues guard the bridge leading to the city. Gollum, Frodo, and Sam hurry from their cover, scampering in the shadows towards Minas Morgul. Frodo looks up at the hideous statues, and he and Sam are aghast at the sight of a narrow, near-vertical staircase cut into the rock face directly in front of the Minas Morgul gates, leading higher and higher up the sheer western side of the Morgul Valley to the high peaks of the razor-like mountains of Mordor. Suddenly, Frodo staggers across the road as if some force other than his own will is at work, lurching toward the bridge and Minas Morgul. Sam runs after Frodo, catching him in his arms as he stumbles, and with Gollum's help, pulls Frodo from the bridge before Frodo falls to the ground. At that moment, the ground quivers, and a great rumbling noise rolls across and echoes in the mountains. The cold, dull Morgul Valley becomes violent and fierce as uprushing flames spring from Mount Doom. Minas Morgul responds with a flare of livid lightning, forks of blue flame springing up from the tower into the sullen cloud, and violent fiery flashes light the cloud above Mordor as sharp thunder rolls across 40 miles to Minas Tirith.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Gandalf stands silently on a terrace that overlooks the grand municipality as Pippin gazes up at the immense nocturnal sky. Gandalf observes the youthful hobbit and then joins Pippin as they look towards the remote, craggy peaks of Mordor. Pippin, unnerved, glances up at Gandalf, who gives him a slight self-deprecating grin. Together, Gandalf and Pippin share a tranquil moment as they gaze out towards the blazing sky over Mordor. Giant Mumakil transport troops upon their backs, and Corsair vessels navigate up the stream. Almost muttering to himself, like a man incapable of averting a certain catastrophe, Gandalf surveys the combat-scarred municipality of Osgiliath, the final bastion between Minas Tirith and Mordor. Pippin desperately seeks encouragement, but Gandalf glances down at him without speaking and gazes into the distance as if perceiving something in his mind's eye. A towering, hooded figure dressed in black is being armored by attendant orcs as Gandalf continues to gaze intently as if confronting his rival in person. Pippin glances up at Gandalf, fearful to inquire, while he recalls Frodo yelling as the Morgul blade is thrust into his shoulder, and Pippin pales at the recollection. Meanwhile, Frodo and Sam scramble into a small ravine beside a rough-hewn path as Gollum cautiously peers over the edge of the ravine. Minas Morgul, a colossal lifeless city set upon a rocky spur at the head of the Morgul Valley, glows with a sickly luminous light like a corpse candle, and two enormous, bestial stone effigies guard the bridge leading to the city. Gollum, Frodo, and Sam hasten from their concealment, scuttling in the shadows towards Minas Morgul. Frodo glances up at the revolting effigies, and he and Sam are aghast at the sight of a narrow, near-vertical staircase cut into the rock face directly in front of the Minas Morgul gates, leading higher and higher up the sheer western flank of the Morgul Valley to the high summits of the razor-like peaks of Mordor. Suddenly, Frodo reels across the path as if some power other than his own will is at play, lurching toward the bridge and Minas Morgul. Sam dashes after Frodo, catching him in his arms as he stumbles, and with Gollum's aid, pulls Frodo from the bridge before Frodo collapses to the ground. At that instant, the ground quivers, and a great rumbling noise reverberates across and echoes in the mountains. The cold, dull Morgul Valley becomes turbulent and fierce as uprushing flames erupt from Mount Doom. Minas Morgul responds with a burst of livid lightning, forks of blue fire springing up from the tower into the sullen cloud, and violent fiery flashes illuminate the cloud above Mordor as sharp thunder reverberates across 40 miles to Minas Tirith."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Quietly, a balcony that overlooks the great city is stood upon by Gandalf as the vast night sky is stared up at by Pippin. The young hobbit is watched by Gandalf, and Pippin is then joined by him as the distant, jagged mountains of Mordor are looked towards by them. Unnerved, Pippin looks up at Gandalf, who is given by him a small self-deprecating smile. A quiet moment is shared by Gandalf and Pippin together as the fiery sky over Mordor is stared out towards by them. Armies are carried upon their backs by giant Mumakil, and the river is sailed up by Corsair ships. Almost talking to himself, like a man unable to prevent a sure disaster, the battle-scarred city of Osgiliath, the last bastion between Minas Tirith and Mordor, is observed by Gandalf. Desperately seeking reassurance, Pippin looks down upon by Gandalf without saying anything and stares into the distance as if something in his mind's eye is being seen by him. A towering, hooded figure dressed in black armors attended by orcs as Gandalf continues to stare intently as if his enemy in person is being faced by him. Up at Gandalf, Pippin looks, afraid to ask, while Frodo screaming as the Morgul blade being driven into his shoulder is recalled by him, and at the memory, Pippin blanches. Meanwhile, a small gully beside a rough-hewn road is clambered into by Frodo and Sam while the lip of the gully is carefully peered over by Gollum. A massive dead city set upon a rocky knee at the head of the Morgul Valley, Minas Morgul, glows with a sickly luminous light like a corpse candle, and the bridge leading to the city is guarded by two huge, bestial stone statues. From their cover, Gollum, Frodo, and Sam hurry, scampering in the shadows towards Minas Morgul. Up at the hideous statues, Frodo looks, and at the sight of a narrow, near-vertical staircase cut into the rock face directly in front of the Minas Morgul gates, leading higher and higher up the sheer western side of the Morgul Valley to the high peaks of the razor-like mountains of Mordor, he and Sam are aghast. Suddenly, Frodo staggers across the road as if his own will is not the force at work, lurching toward the bridge and Minas Morgul. After Frodo runs Sam, catching him in his arms as he stumbles, and with Gollum's help, Frodo is pulled from the bridge before he falls to the ground. At that moment, the ground quivers, and a great rumbling noise rolls across and echoes in the mountains. Violent and fierce, the cold, dull Morgul Valley becomes as flames uprush and spring from Mount Doom. With a flare of livid lightning, Minas Morgul responds, blue flame forks springing up from the tower into the sullen cloud, and violent fiery flashes light the cloud above Mordor as sharp thunder rolls across 40 miles to Minas Tirith."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Gandalf stands quietly on a balcony overlooking the city as Pippin gazes at the vast night sky. Gandalf joins Pippin, and they look toward Mordor's jagged mountains. Pippin, uneasy, glances at Gandalf, who offers a small smile. Together, they share a moment, watching the fiery sky over Mordor. Mumakil carry armies, and Corsair ships sail the river. Gandalf, almost talking to himself, observes Osgiliath, the last bastion between Minas Tirith and Mordor. Pippin seeks reassurance, but Gandalf remains silent, staring into the distance. A hooded figure in black is armored by orcs as Gandalf focuses intently. Pippin recalls Frodo's scream as the Morgul blade pierced him, blanching at the memory. Meanwhile, Frodo and Sam hide in a gully beside a road as Gollum peers over. Minas Morgul, a dead city glowing with a sickly light, is guarded by stone statues at the bridge. Gollum, Frodo, and Sam hurry toward Minas Morgul. Frodo and Sam are aghast at a narrow staircase leading up the mountains of Mordor. Suddenly, Frodo staggers toward the bridge, but Sam catches him with Gollum's help. The ground quivers, and a rumbling echoes as flames rise from Mount Doom. Minas Morgul responds with lightning, and fiery flashes light the cloud above Mordor as thunder rolls to Minas Tirith."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Gandalf stands on a balcony overlooking the city as Pippin gazes at the night sky. Gandalf joins him, and they look towards Mordor's jagged mountains. Pippin, uneasy, glances at Gandalf, who gives a small smile. They share a quiet moment, watching the fiery sky over Mordor. Mumakil carry armies, and Corsair ships sail the river. Gandalf, almost talking to himself, observes Osgiliath, the last defense between Minas Tirith and Mordor. Pippin seeks reassurance, but Gandalf remains silent, staring into the distance. A hooded figure in black is armored by orcs as Gandalf focuses intently. Pippin recalls Frodo's scream from the Morgul blade, blanching at the memory. Frodo and Sam hide in a gully beside a road as Gollum peers over. Minas Morgul, glowing like a corpse candle, is guarded by stone statues. Gollum, Frodo, and Sam hurry towards Minas Morgul. Frodo and Sam are aghast at a steep staircase leading up Mordor's mountains. Frodo staggers toward Minas Morgul, but Sam and Gollum pull him back. The ground quivers, and flames rise from Mount Doom. Minas Morgul flares with lightning, and fiery flashes light the cloud above Mordor as thunder rolls to Minas Tirith."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Gandalf stands silently and contemplatively on a balcony that offers a sweeping view of the magnificent and sprawling city below, while Pippin gazes up at the expansive and starry night sky above them. Gandalf, observing the young hobbit with a thoughtful expression, eventually joins Pippin in looking out towards the distant, jagged peaks of the ominous mountains of Mordor. Pippin, feeling a sense of unease, glances up at Gandalf, who responds with a small, self-deprecating smile that offers little comfort. Together, Gandalf and Pippin share a quiet, introspective moment as they gaze out towards the fiery, foreboding sky over Mordor. In the distance, giant Mumakil, massive creatures of war, carry entire armies upon their broad backs, while Corsair ships sail ominously up the river. Almost as if speaking to himself, like a man resigned to an impending and unavoidable disaster, Gandalf observes the battle-scarred city of Osgiliath, which stands as the last bastion between the fortified city of Minas Tirith and the dark lands of Mordor. Pippin, desperately seeking some form of reassurance, looks up at Gandalf, who remains silent, staring into the distance as if seeing visions in his mind's eye. A towering, hooded figure clad in black is being armored by attendant orcs, and Gandalf continues to stare intently, as though confronting his enemy face-to-face. Pippin looks up at Gandalf, too afraid to voice his fears, while he recalls the harrowing memory of Frodo screaming as the Morgul blade was driven into his shoulder, causing Pippin to blanch at the recollection. Meanwhile, Frodo and Sam carefully clamber into a small, protective gully beside a rough-hewn road, as Gollum cautiously peers over the edge of the gully. Minas Morgul, a massive, eerie dead city perched upon a rocky outcrop at the head of the Morgul Valley, emits a sickly, luminous glow reminiscent of a corpse candle, while two huge, bestial stone statues stand guard over the bridge leading to the city. Gollum, Frodo, and Sam quickly hurry from their cover, scampering stealthily in the shadows towards the ominous city of Minas Morgul. Frodo looks up at the grotesque statues, and both he and Sam are aghast at the sight of a narrow, near-vertical staircase carved into the rock face directly in front of the gates of Minas Morgul, leading ever higher up the sheer western side of the Morgul Valley to the high peaks of the razor-sharp mountains of Mordor. Suddenly, Frodo staggers across the road as if compelled by a force beyond his own will, lurching uncontrollably toward the bridge and the menacing city of Minas Morgul. Sam rushes after Frodo, catching him in his arms as he stumbles, and with Gollum's assistance, pulls Frodo back from the brink of the bridge before Frodo collapses to the ground. At that very moment, the ground quivers violently, and a great rumbling noise rolls across the landscape, echoing ominously in the mountains. The cold, dull Morgul Valley becomes a scene of violent and fierce upheaval as uprushing flames erupt from Mount Doom. Minas Morgul responds with a dramatic flare of livid lightning, as forks of blue flame leap from the tower into the sullen cloud, and violent, fiery flashes illuminate the cloud above Mordor, while sharp, rolling thunder reverberates across the 40 miles to the city of Minas Tirith."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Gandalf stands silently and with deep contemplation on an expansive balcony. From this vantage point, he surveys the magnificent and sprawling city that extends far below. At the same time, Pippin, the young hobbit, lifts his gaze to the vast and starry night sky that stretches endlessly above them. Gandalf, with a thoughtful and reflective expression on his face, observes Pippin for a few moments before he eventually joins the young hobbit in directing his attention toward the distant, rugged peaks of the ominous mountains of Mordor. Pippin, feeling a wave of unease wash over him, glances up at Gandalf. The wizard responds with a small, self-deprecating smile that offers little in the way of comfort or reassurance. Together, Gandalf and Pippin share a quiet moment of introspection as they both gaze out toward the fiery and foreboding sky looming over Mordor. In the far distance, giant Mumakil, massive and formidable creatures bred for war, carry entire armies upon their broad and sturdy backs, while Corsair ships sail ominously up the river, adding to the atmosphere of impending conflict.\n\nAlmost as if speaking to himself, like someone resigned to facing a disaster that feels both unavoidable and inescapable, Gandalf casts his gaze upon the battle-scarred city of Osgiliath. This city stands as the last bastion and line of defense between the fortified city of Minas Tirith and the dark and menacing lands of Mordor. Pippin, desperately searching for any form of reassurance or comfort, looks up at Gandalf, who remains silent and unyielding, staring intently into the distance as if witnessing visions playing out in his mind's eye. A towering, hooded figure, clad entirely in black, is being armored by attendant orcs, and Gandalf continues to look on with unwavering focus, as though he is confronting his enemy in a face-to-face standoff. Pippin, too afraid to give voice to his fears, remembers the harrowing moment when Frodo screamed in anguish as the Morgul blade was driven into his shoulder—a memory that causes Pippin to blanch at the mere recollection.\n\nMeanwhile, Frodo and Sam are carefully clambering into a small, secluded gully situated beside a rough-hewn road. Gollum, with his ever-watchful eyes, cautiously peers over the edge of the gully. Minas Morgul, an enormous and eerie dead city perched ominously upon a rocky outcrop at the head of the Morgul Valley, emits a sickly, luminous glow that brings to mind the eerie light of a corpse candle. Two huge and bestial stone statues stand steadfast, guarding the bridge that leads to this eerie city. Gollum, Frodo, and Sam swiftly hurry from their place of concealment, scampering stealthily under the cover of darkness toward the ominous city of Minas Morgul. Frodo lifts his gaze to the grotesque stone statues, and both he and Sam are utterly aghast at the daunting sight of a narrow, nearly vertical staircase carved directly into the rock face. This precarious stairway ascends ever higher up the sheer western side of the Morgul Valley, leading to the towering, razor-sharp peaks of the mountains of Mordor.\n\nSuddenly, as if compelled by a force beyond his own will, Frodo staggers across the road, lurching uncontrollably toward the bridge and the menacing city of Minas Morgul. Sam rushes after Frodo in a panic, catching him in his arms as he stumbles and, with Gollum's assistance, manages to pull Frodo back from the brink of the bridge just before Frodo collapses to the ground. At that very moment, the earth begins to tremble violently, and a great rumbling noise rolls ominously across the landscape, echoing off the mountains with a foreboding intensity. The cold and dull Morgul Valley transforms into a scene of violent upheaval as flames erupt dramatically from Mount Doom. Minas Morgul responds with a spectacular flare of livid lightning, as forks of blue flame leap from the tower into the sullen clouds above. Violent and fiery flashes illuminate the sky over Mordor, while sharp, rolling thunder reverberates with a deafening echo across the 40 miles to the city of Minas Tirith."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Gandalf stands quietly on a balcony, his gaze sweeping over the sprawling expanse of the great city below, while Pippin, standing nearby, lifts his eyes to the vast night sky, taking in the celestial display above. Gandalf, observing the young hobbit's contemplative stance, turns his attention to Pippin and then steps closer to join him, their eyes collectively drawn towards the distant, jagged silhouette of the mountains of Mordor. Pippin, feeling a sense of unease, shifts his gaze upwards to meet Gandalf's, who, in response, offers a small, self-deprecating smile, a gesture meant to provide some comfort. Together, they share a moment of quiet reflection, their eyes fixed on the fiery sky that looms ominously over Mordor. In the distance, giant Mumakil, massive creatures of war, carry armies upon their broad backs, while Corsair ships glide up the river, their sails billowing in the wind. Almost as if speaking to himself, Gandalf, with a tone of resignation, surveys the battle-scarred city of Osgiliath, recognizing it as the last stronghold standing between Minas Tirith and the encroaching threat of Mordor. Pippin, seeking reassurance, looks up at Gandalf, but Gandalf, lost in thought, remains silent, his eyes fixed on the horizon as if envisioning a scene unfolding in his mind. In his mind's eye, a towering, hooded figure clad in black is being armored by attendant orcs, and Gandalf's intense stare suggests he is confronting this enemy in spirit. Pippin, hesitant to voice his fears, recalls the harrowing memory of Frodo's scream as the Morgul blade pierced his shoulder, causing Pippin to blanch at the recollection. Meanwhile, Frodo and Sam, navigating the treacherous terrain, clamber into a small gully beside a rough-hewn road, while Gollum, ever cautious, peers over the edge of the gully, ensuring their path is clear. Ahead lies Minas Morgul, a massive, desolate city perched on a rocky outcrop at the head of the Morgul Valley, its eerie, corpse-like glow casting an unsettling light. Two enormous, beastly stone statues stand guard at the bridge leading to the city, their presence foreboding. Gollum, Frodo, and Sam, seizing the opportunity, hurry from their cover, moving swiftly and silently in the shadows towards Minas Morgul. As Frodo looks up at the grotesque statues, he and Sam are struck with horror at the sight of a narrow, near-vertical staircase carved into the rock face, ascending steeply from the gates of Minas Morgul to the high peaks of the razor-sharp mountains of Mordor. Suddenly, as if compelled by an unseen force, Frodo staggers across the road, his body lurching uncontrollably towards the bridge and the ominous city of Minas Morgul. Sam, reacting quickly, dashes after Frodo, catching him in his arms just as he stumbles, and with Gollum's assistance, they manage to pull Frodo back from the brink before he collapses to the ground. At that moment, the earth trembles beneath them, and a deep, resonant rumbling reverberates through the mountains. The cold, somber Morgul Valley erupts into a scene of chaos as flames surge violently from Mount Doom. In response, Minas Morgul emits a burst of livid lightning, with blue flames forking upwards from the tower into the oppressive cloud cover, while violent, fiery flashes illuminate the sky above Mordor, and sharp peals of thunder roll across the vast distance to Minas Tirith."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Gandalf stands quietly on a balcony overlooking the great city, joining Pippin as they gaze towards the distant, jagged mountains of Mordor under the vast night sky. Sharing a quiet moment, Gandalf offers Pippin a small, self-deprecating smile as they watch the fiery sky over Mordor, where giant Mumakil carry armies and Corsair ships sail up the river. Observing the battle-scarred city of Osgiliath, Gandalf reflects on the impending disaster, while Pippin seeks reassurance. Gandalf, lost in thought, envisions a towering, hooded figure in black being armored by orcs, recalling Frodo's scream as the Morgul blade pierced his shoulder, which causes Pippin to blanch at the memory.\n\nMeanwhile, Frodo and Sam, with Gollum's guidance, clamber into a gully beside a rough-hewn road near Minas Morgul. The massive dead city glows with a sickly light, guarded by two huge stone statues at the bridge. The trio hurries in the shadows towards Minas Morgul, where Frodo and Sam are aghast at a narrow, steep staircase leading up the rock face to the high peaks of Mordor. Suddenly, Frodo, as if compelled by an external force, staggers towards the bridge. Sam and Gollum quickly intervene, pulling him back before he collapses. At that moment, the ground quivers with a great rumbling noise as flames erupt from Mount Doom. Minas Morgul responds with a flare of livid lightning, and fiery flashes light the cloud above Mordor, with sharp thunder rolling across to Minas Tirith."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Gandalf stands quietly on a balcony in Minas Tirith, the fortified capital and a symbol of hope for the kingdom of Gondor, that overlooks the great city as Pippin stares up at the vast night sky dotted with stars. Gandalf watches the young hobbit, one of the smallest and least expected heroes, and then joins Pippin as they look towards the distant, jagged mountains of Mordor, where the dark lord Sauron seeks to conquer Middle-earth. Pippin, unnerved by the ominous sight, looks up at Gandalf, who gives him a small self-deprecating smile, remembering that he too has faced many fears. Together, Gandalf and Pippin share a quiet moment as they stare out towards the fiery sky over Mordor, illuminated by the volcanic eruptions from Mount Doom, the critical focal point of their looming journey. Giant Mumakil, enormous elephant-like beasts from the south used in battle, carry armies upon their backs, and Corsair ships, belonging to the pirates from Umbar, sail up the river Anduin towards Osgiliath. Almost talking to himself, like a man unable to prevent a sure disaster, Gandalf observes the battle-scarred city of Osgiliath, once the bustling capital of Gondor but now the last bastion between Minas Tirith and Mordor. Pippin desperately seeks reassurance, but Gandalf looks down at him without saying anything and stares into the distance as if seeing something in his mind's eye, aware of the growing threat. A towering, hooded figure dressed in black, the Witch-king of Angmar leader of Sauron's Ringwraiths, is being armored by attendant orcs as Gandalf continues to stare intently as if facing his enemy in person. Pippin looks up at Gandalf, afraid to ask about the figure, while he recalls Frodo screaming in agony as the Morgul blade, a cursed weapon of the Ringwraiths, is driven into his shoulder, and Pippin blanches at the memory. Meanwhile, Frodo and Sam clamber into a small gully beside a rough-hewn road as Gollum, their treacherous guide who once possessed the One Ring, carefully peers over the lip of the gully. Minas Morgul, a massive dead city set upon a rocky knee at the head of the Morgul Valley, glows with a sickly luminous light like a corpse candle, and two huge, bestial stone statues called the Watchers guard the bridge leading to the city. Gollum, Frodo, and Sam hurry from their cover, scampering in the shadows towards Minas Morgul. Frodo looks up at the hideous statues, and he and Sam are aghast at the sight of a narrow, near-vertical staircase called the Stairs of Cirith Ungol cut into the rock face directly in front of the Minas Morgul gates, leading higher and higher up the sheer western side of the Morgul Valley to the high peaks of the razor-like mountains of Mordor. Suddenly, Frodo staggers across the road as if some force other than his own will is at work, the perilous pull of the One Ring affecting him, lurching toward the bridge and Minas Morgul. Sam runs after Frodo, catching him in his arms as he stumbles, and with Gollum's help, pulls Frodo from the bridge before Frodo falls to the ground. At that moment, the ground quivers, and a great rumbling noise rolls across and echoes in the mountains. The cold, dull Morgul Valley becomes violent and fierce as uprushing flames spring from Mount Doom, the heart of Sauron's power. Minas Morgul responds with a flare of livid lightning, forks of blue flame springing up from the tower into the sullen cloud, and violent fiery flashes light the cloud above Mordor as sharp thunder rolls across 40 miles to Minas Tirith, the sounds of war echoing ominously through the land."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Gandalf watches the young hobbit and then joins Pippin as they look towards the distant jagged mountains of Mordor  Pippin unnerved looks up at Gandalf who gives him a small selfdeprecating smile  Together Gandalf and Pippin share a quiet moment as they stare out towards the fiery sky over Mordor  Giant Mumakil carry armies upon their backs and Corsair ships sail up the river  Almost talking to himself like a man unable to prevent a sure disaster Gandalf observes the battlescarred city of Osgiliath the last bastion between Minas Tirith and Mordor  Pippin desperately seeks reassurance but Gandalf looks down at him without saying anything and stares into the distance as if seeing something in his mind's eye  A towering hooded figure dressed in black is being armored by attendant orcs as Gandalf continues to stare intently as if facing his enemy in person  Pippin looks up at Gandalf afraid to ask while he recalls Frodo screaming as the Morgul blade is driven into his shoulder and Pippin blanches at the memory  Meanwhile Frodo and Sam clamber into a small gully beside a roughhewn road as Gollum carefully peers over the lip of the gully  Minas Morgul a massive dead city set upon a rocky knee at the head of the Morgul Valley glows with a sickly luminous light like a corpse candle and two huge bestial stone statues guard the bridge leading to the city  Gandalf stands quietly on a balcony that overlooks the great city as Pippin stares up at the vast night sky  Gandalf watches the young hobbit and then joins Pippin as they look towards the distant jagged mountains of Mordor  Pippin unnerved looks up at Gandalf who gives him a small selfdeprecating smile  Together Gandalf and Pippin share a quiet moment as they stare out towards the fiery sky over Mordor  Giant Mumakil carry armies upon their backs and Corsair ships sail up the river  Almost talking to himself like a man unable to prevent a sure disaster Gandalf observes the battlescarred city of Osgiliath the last bastion between Minas Tirith and Mordor  Pippin desperately seeks reassurance but Gandalf looks down at him without saying anything and stares into the distance as if seeing something in his mind's eye  A towering hooded figure dressed in black is being armored by attendant orcs as Gandalf continues to stare intently as if facing his enemy in person  Pippin looks up at Gandalf afraid to ask while he recalls Frodo screaming as the Morgul blade is driven into his shoulder and Pippin blanches at the memory  Meanwhile Frodo and Sam clamber into a small gully beside a roughhewn road as Gollum carefully peers over the lip of the gully  Minas Morgul a massive dead city set upon a rocky knee at the head of the Morgul Valley glows with a sickly luminous light like a corpse candle and two huge bestial stone statues guard the bridge leading to the city  Gollum  Frodo and Sam hurry from their cover scampering in the shadows towards Minas Morgul  Frodo looks up at the hideous statues and he and Sam are aghast at the sight of a narrow nearvertical staircase cut into the rock face directly in front of the Minas Morgul gates leading higher and higher up the sheer western side of the Morgul Valley to the high peaks of the razorlike mountains of Mordor  Suddenly Frodo staggers across the road as if some force other than his own will is at work lurching toward the bridge and Minas Morgul  Sam runs after Frodo catching him in his arms as he stumbles and with Gollum's help pulls Frodo from the bridge before Frodo falls to the ground  At that moment the ground quivers and a great rumbling noise rolls across and echoes in the mountains  The cold dull Morgul Valley becomes violent and fierce as uprushing flames spring from Mount Doom  Minas Morgul responds with a flare of livid lightning forks of blue flame springing up from the tower into the sullen cloud and violent fiery flashes light the cloud above Mordor as sharp thunder rolls across 40 miles to Minas Tirith"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Gandalf stands quietly on a balcony that overlooks the great city as Pippin stares up at the vast night sky. Gandalf watches the young hobbit and then joins Pippin as they look towards the distant jagged mountains of Mordor. Pippin unnerved looks up at Gandalf who gives him a small selfdeprecating smile. Together Gandalf and Pippin share a quiet moment as they stare out towards the fiery sky over Mordor. Giant Mumakil carry armies upon their backs and Corsair ships sail up the river. Almost talking to himself like a man unable to prevent a sure disaster Gandalf observes the battlescarred city of Osgiliath the last bastion between Minas Tirith and Mordor. Pippin desperately seeks reassurance but Gandalf looks down at him without saying anything and stares into the distance as if seeing something in his mind's eye. A towering hooded figure dressed in black is being armored by attendant orcs as Gandalf continues to stare intently as if facing his enemy in person. Pippin looks up at Gandalf afraid to ask while he recalls Frodo screaming as the Morgul blade is driven into his shoulder and Pippin blanches at the memory. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Meanwhile Frodo and Sam clamber into a small gully beside a roughhewn road as Gollum carefully peers over the lip of the gully. Minas Morgul a massive dead city set upon a rocky knee at the head of the Morgul Valley glows with a sickly luminous light like a corpse candle and two huge bestial stone statues guard the bridge leading to the city. Gollum. Frodo and Sam hurry from their cover scampering in the shadows towards Minas Morgul. Frodo looks up at the hideous statues and he and Sam are aghast at the sight of a narrow nearvertical staircase cut into the rock face directly in front of the Minas Morgul gates leading higher and higher up the sheer western side of the Morgul Valley to the high peaks of the razorlike mountains of Mordor. Suddenly Frodo staggers across the road as if some force other than his own will is at work lurching toward the bridge and Minas Morgul. Sam runs after Frodo catching him in his arms as he stumbles and with Gollum's help pulls Frodo from the bridge before Frodo falls to the ground. At that moment the ground quivers and a great rumbling noise rolls across and echoes in the mountains. The cold dull Morgul Valley becomes violent and fierce as uprushing flames spring from Mount Doom. Minas Morgul responds with a flare of livid lightning forks of blue flame springing up from the tower into the sullen cloud and violent fiery flashes light the cloud above Mordor as sharp thunder rolls across 40 miles to Minas Tirith."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Gandalf stands quietly on a balcony that overlooks the great city as Pippin stares up at the vast night sky. Gandalf watches the young hobbit and then joins Pippin as they look towards the distant jagged mountains of Mordor. Pippin unnerved looks up at Gandalf who gives him a small selfdeprecating smile. Together Gandalf and Pippin share a quiet moment as they stare out towards the fiery sky over Mordor. Giant Mumakil carry armies upon their backs and Corsair ships sail up the river. Almost talking to himself like a man unable to prevent a sure disaster Gandalf observes the battlescarred city of Osgiliath the last bastion between Minas Tirith and Mordor. Pippin desperately seeks reassurance but Gandalf looks down at him without saying anything and stares into the distance as if seeing something in his mind's eye. A towering hooded figure dressed in black is being armored by attendant orcs as Gandalf continues to stare intently as if facing his enemy in person. Pippin looks up at Gandalf afraid to ask while he recalls Frodo screaming as the Morgul blade is driven into his shoulder and Pippin blanches at the memory. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Meanwhile Frodo and Sam clamber into a small gully beside a roughhewn road as Gollum carefully peers over the lip of the gully. Minas Morgul a massive dead city set upon a rocky knee at the head of the Morgul Valley glows with a sickly luminous light like a corpse candle and two huge bestial stone statues guard the bridge leading to the city. Gollum. Frodo and Sam hurry from their cover scampering in the shadows towards Minas Morgul. Frodo looks up at the hideous statues and he and Sam are aghast at the sight of a narrow nearvertical staircase cut into the rock face directly in front of the Minas Morgul gates leading higher and higher up the sheer western side of the Morgul Valley to the high peaks of the razorlike mountains of Mordor. Suddenly Frodo staggers across the road as if some force other than his own will is at work lurching toward the bridge and Minas Morgul. Sam runs after Frodo catching him in his arms as he stumbles and with Gollum's help pulls Frodo from the bridge before Frodo falls to the ground. At that moment the ground quivers and a great rumbling noise rolls across and echoes in the mountains. The cold dull Morgul Valley becomes violent and fierce as uprushing flames spring from Mount Doom. Minas Morgul responds with a flare of livid lightning forks of blue flame springing up from the tower into the sullen cloud and violent fiery flashes light the cloud above Mordor as sharp thunder rolls across 40 miles to Minas Tirith."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Gandalf stands quietly on a balcony that overlooks the great city as Pippin stares up at the vast night sky. Gandalf watches the young hobbit and then joins Pippin as they look towards the distant jagged mountains of Mordor. Pippin unnerved looks up at Gandalf who gives him a small selfdeprecating smile. Together Gandalf and Pippin share a quiet moment as they stare out towards the fiery sky over Mordor. Giant Mumakil carry armies upon their backs and Corsair ships sail up the river. Suddenly Frodo staggers across the road as if some force other than his own will is at work lurching toward the bridge and Minas Morgul. Sam runs after Frodo catching him in his arms as he stumbles and with Gollum's help pulls Frodo from the bridge before Frodo falls to the ground. At that moment the ground quivers and a great rumbling noise rolls across and echoes in the mountains. The cold dull Morgul Valley becomes violent and fierce as uprushing flames spring from Mount Doom. Minas Morgul responds with a flare of livid lightning forks of blue flame springing up from the tower into the sullen cloud and violent fiery flashes light the cloud above Mordor as sharp thunder rolls across 40 miles to Minas Tirith."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Gandalf stands quietly on a balcony that overlooks the great city as Pippin stares up at the vast night sky. Gandalf watches the young hobbit and then joins Pippin as they look towards the distant jagged mountains of Mordor. The cold dull Morgul Valley becomes violent and fierce as uprushing flames spring from Mount Doom. Minas Morgul responds with a flare of livid lightning forks of blue flame springing up from the tower into the sullen cloud and violent fiery flashes light the cloud above Mordor as sharp thunder rolls across 40 miles to Minas Tirith."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dragonfly stands quietly on a balcony that overlooks the great city as the squirrel stares up at the vast night sky. The dragonfly watches the young hobbit and then joins the squirrel as they look towards the distant, jagged mountains of Mordor. The squirrel, unnerved, looks up at the dragonfly, who gives him a small self-deprecating smile. Together, the dragonfly and the squirrel share a quiet moment as they stare out towards the fiery sky over Mordor. Giant Mumakil carry armies upon their backs, and Corsair ships sail up the river. Almost talking to himself, like a man unable to prevent a sure disaster, the dragonfly observes the battle-scarred city of Osgiliath, the last bastion between Minas Tirith and Mordor. The squirrel desperately seeks reassurance, but the dragonfly looks down at him without saying anything and stares into the distance as if seeing something in his mind's eye. A towering, hooded figure dressed in black is being armored by attendant orcs as the dragonfly continues to stare intently as if facing his enemy in person. The squirrel looks up at the dragonfly, afraid to ask, while he recalls Frodo screaming as the Morgul blade is driven into his shoulder, and the squirrel blanches at the memory. Meanwhile, the butterfly and the ant clamber into a small gully beside a rough-hewn road as the grasshopper carefully peers over the lip of the gully. Minas Morgul, a massive dead city set upon a rocky knee at the head of the Morgul Valley, glows with a sickly luminous light like a corpse candle, and two huge, bestial stone statues guard the bridge leading to the city. The grasshopper, the butterfly, and the ant hurry from their cover, scampering in the shadows towards Minas Morgul. The butterfly looks up at the hideous statues, and he and the ant are aghast at the sight of a narrow, near-vertical staircase cut into the rock face directly in front of the Minas Morgul gates, leading higher and higher up the sheer western side of the Morgul Valley to the high peaks of the razor-like mountains of Mordor. Suddenly, the butterfly staggers across the road as if some force other than his own will is at work, lurching toward the bridge and Minas Morgul. The ant runs after the butterfly, catching him in his arms as he stumbles, and with the grasshopper's help, pulls the butterfly from the bridge before the butterfly falls to the ground. At that moment, the ground quivers, and a great rumbling noise rolls across and echoes in the mountains. The cold, dull Morgul Valley becomes violent and fierce as uprushing flames spring from Mount Doom. Minas Morgul responds with a flare of livid lightning, forks of blue flame springing up from the tower into the sullen cloud, and violent fiery flashes light the cloud above Mordor as sharp thunder rolls across 40 miles to Minas Tirith."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Gandalf stands quietly on a veranda that overlooks the vast ocean as Pippin stares up at the endless starry expanse. Gandalf watches the young hobbit and then joins Pippin as they look towards the distant, rolling hills of Gondor. Pippin, unnerved, looks up at Gandalf, who gives him a small self-deprecating smile. Together, Gandalf and Pippin share a quiet moment as they stare out towards the shimmering sky over Gondor. Enormous dragons carry warriors upon their backs, and merchant ships sail up the canal. Almost talking to himself, like a man unable to prevent a certain disaster, Gandalf observes the ruined village of Pelargir, the final outpost between Osgiliath and Gondor. Pippin desperately seeks reassurance, but Gandalf looks down at him without saying anything and stares into the distance as if seeing something in his mind's eye. A towering, hooded figure dressed in grey is being armored by attendant trolls as Gandalf continues to stare intently as if facing his adversary in person. Pippin looks up at Gandalf, afraid to ask, while he recalls Frodo screaming as the Elven dagger is driven into his shoulder, and Pippin blanches at the memory. Meanwhile, Frodo and Sam clamber into a small ravine beside a cobbled path as Gollum carefully peers over the edge of the ravine. Minas Tirith, a massive silent fortress set upon a steep cliff at the head of the Anduin River, glows with a pale spectral light like a ghost lamp, and two huge, grotesque stone gargoyles guard the entrance leading to the fortress. Gollum, Frodo, and Sam hurry from their shelter, scampering in the shadows towards Minas Tirith. Frodo looks up at the frightening gargoyles, and he and Sam are aghast at the sight of a narrow, spiraling stairway cut into the rock face directly in front of the Minas Tirith gates, leading higher and higher up the sheer eastern side of the Anduin Valley to the high peaks of the jagged cliffs of Gondor. Suddenly, Frodo staggers across the path as if some force other than his own will is at work, lurching toward the entrance and Minas Tirith. Sam runs after Frodo, catching him in his arms as he stumbles, and with Gollum's help, pulls Frodo from the entrance before Frodo falls to the ground. At that moment, the ground quivers, and a great rumbling noise rolls across and echoes in the cliffs. The cold, dull Anduin Valley becomes violent and fierce as uprushing flames spring from Mount Shadow. Minas Tirith responds with a flare of vivid lightning, forks of red flame springing up from the bastion into the dark cloud, and violent fiery flashes light the cloud above Gondor as sharp thunder rolls across 40 miles to Osgiliath."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Gandalf reclines casually on a balcony that overlooks the great city as Pippin glances up at the vast night sky. Gandalf studies the young hobbit and then accompanies Pippin as they gaze towards the distant, jagged mountains of Mordor. Pippin, apprehensive, glances up at Gandalf, who offers him a small self-deprecating wink. Together, Gandalf and Pippin enjoy a serene moment as they admire the fiery sky over Mordor. Giant Mumakil transport armies upon their backs, and Corsair ships drift up the river. Almost speaking to himself, like a man resigned to an inevitable fate, Gandalf examines the battle-worn city of Osgiliath, the last bastion between Minas Tirith and Mordor. Pippin anxiously seeks reassurance, but Gandalf glances down at him without uttering a word and surveys the distance as if visualizing something in his mind's eye. A towering, hooded figure dressed in black is being dressed by attendant orcs as Gandalf persistently gazes intently as if confronting his enemy directly. Pippin glances up at Gandalf, too frightened to inquire, while he recalls Frodo shouting as the Morgul blade is thrust into his shoulder, and Pippin pales at the memory. Meanwhile, Frodo and Sam scramble into a small gully beside a rough-hewn road as Gollum cautiously peeks over the lip of the gully. Minas Morgul, a massive dead city set upon a rocky knee at the head of the Morgul Valley, emits a sickly luminous light like a corpse candle, and two huge, bestial stone statues monitor the bridge leading to the city. Gollum, Frodo, and Sam dart from their cover, sneaking in the shadows towards Minas Morgul. Frodo glances up at the hideous statues, and he and Sam are stunned at the sight of a narrow, near-vertical staircase carved into the rock face directly in front of the Minas Morgul gates, ascending higher and higher up the sheer western side of the Morgul Valley to the high peaks of the razor-like mountains of Mordor. Suddenly, Frodo stumbles across the road as if some force other than his own will is at work, staggering toward the bridge and Minas Morgul. Sam rushes after Frodo, embracing him as he totters, and with Gollum's aid, lifts Frodo from the bridge before Frodo collapses to the ground. At that moment, the ground shivers, and a great reverberating noise travels across and resonates in the mountains. The cold, dull Morgul Valley turns fierce and intense as erupting flames ascend from Mount Doom. Minas Morgul replies with a burst of vivid lightning, tendrils of blue flame leaping up from the tower into the sullen cloud, and violent fiery flashes illuminate the cloud above Mordor as sharp thunder reverberates across 40 miles to Minas Tirith."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Einstein stands quietly on a lifeboat that overlooks the great library as Watson stares up at the vast lamp post. Einstein watches the young penguin and then joins Watson as they look towards the distant, jagged skyscrapers of Atlantis. Watson, unnerved, looks up at Einstein, who gives him a small self-deprecating wink. Together, Einstein and Watson share a quiet moment as they stare out towards the fiery river over Atlantis. Giant bicycles carry musicians upon their backs, and Viking canoes sail up the orchard. Almost talking to himself, like a dog unable to prevent a sure disaster, Einstein observes the battle-scarred museum of Camelot, the last bastion between Olympus and Atlantis. Watson desperately seeks reassurance, but Einstein looks down at him without saying anything and stares into the gallery as if seeing something in his mind's eye. A towering, hooded mailbox dressed in denim is being armored by attendant flamingos as Einstein continues to stare intently as if facing his opponent in person. Watson looks up at Einstein, afraid to ask, while he recalls Tinkerbell screaming as the scepter is driven into his elbow, and Watson blanches at the thought. Meanwhile, Tinkerbell and Ariel clamber into a small basket beside a rough-hewn path as Leprechaun carefully peers over the lip of the basket. Gotham, a massive dead zoo set upon a rocky elbow at the head of the Gotham Valley, glows with a sickly luminous light like a lantern, and two huge, bestial stone gondolas guard the tunnel leading to the zoo. Leprechaun, Tinkerbell, and Ariel hurry from their shelter, scampering in the shadows towards Gotham. Tinkerbell looks up at the hideous gondolas, and he and Ariel are aghast at the sight of a narrow, near-vertical staircase cut into the painting directly in front of the Gotham tunnel, leading higher and higher up the sheer western side of the Gotham Valley to the high peaks of the razor-like skyscrapers of Atlantis. Suddenly, Tinkerbell staggers across the path as if some force other than his own will is at work, lurching toward the tunnel and Gotham. Ariel runs after Tinkerbell, catching him in his arms as he stumbles, and with Leprechaun's help, pulls Tinkerbell from the tunnel before Tinkerbell falls to the meadow. At that moment, the meadow quivers, and a great rumbling melody rolls across and echoes in the skyscrapers. The cold, dull Gotham Valley becomes violent and fierce as uprushing geysers spring from Mount Popcorn. Gotham responds with a flare of livid fireworks, forks of purple flame springing up from the cathedral into the sullen balcony, and violent fiery flashlights light the balcony above Atlantis as sharp violins rolls across 40 miles to Olympus."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Sherlock lounges quietly on a rooftop that overlooks the bustling metropolis as Watson glances up at the sprawling night sky. Sherlock observes the young detective and then joins Watson as they gaze towards the distant, towering skyscrapers of Gotham. Watson, anxious, glances up at Sherlock, who offers him a small, knowing grin. Together, Sherlock and Watson share a tranquil moment as they gaze out towards the glowing skyline over Gotham. Gigantic airships transport cargo upon their decks, and pirate vessels drift up the canal. Almost speaking to himself, like an explorer unable to chart a sure course, Sherlock examines the fortress-city of Metropolis, the final bastion between New York and Gotham. Watson urgently seeks assurance, but Sherlock glances down at him without uttering a word and gazes into the distance as if envisioning something in his mind's eye. A colossal, hooded figure cloaked in shadows is being clad by servant drones as Sherlock continues to gaze intently as if confronting his adversary in person. Watson looks up at Sherlock, hesitant to inquire, while he remembers Holmes shouting as the dagger pierces his side, and Watson pales at the memory. Meanwhile, Holmes and Lestrade scramble into a narrow ravine beside a cobbled road as Moriarty stealthily observes over the edge of the ravine. Gotham City, a massive abandoned metropolis set upon a rocky plateau at the crest of the Gotham Valley, glows with a ghastly phosphorescent light like a ghost lantern, and two immense, grotesque stone sculptures guard the path leading to the city. Moriarty, Holmes, and Lestrade scurry from their concealment, darting in the shadows towards Gotham City. Holmes glances up at the monstrous sculptures, and he and Lestrade are horrified at the sight of a narrow, near-vertical stairway carved into the cliff face directly in front of the Gotham City gates, climbing higher and higher up the steep eastern side of the Gotham Valley to the high peaks of the razor-like skyscrapers of Gotham. Suddenly, Holmes reels across the street as if some force other than his own intention is at play, stumbling toward the path and Gotham City. Lestrade dashes after Holmes, catching him in his embrace as he falters, and with Moriarty's assistance, drags Holmes from the path before Holmes collapses to the ground. At that moment, the earth trembles, and a great booming noise reverberates and echoes in the towers. The bleak, dreary Gotham Valley becomes wild and fierce as erupting flames leap from Mount Dread. Gotham City responds with a burst of vivid lightning, bolts of green flame leaping up from the skyscraper into the murky cloud, and intense fiery flashes illuminate the cloud above Gotham as sharp thunder reverberates across 40 miles to New York."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Gandalf stands quietly on a terrace that overlooks the vast ocean as Pippin gazes up at the majestic morning clouds. Gandalf listens to the young hobbit and then accompanies Pippin as they glance towards the towering, rolling hills of Rohan. Pippin, unsettled, glances up at Gandalf, who gives him a small secretive wink. Together, Gandalf and Pippin share a peaceful moment as they gaze out towards the shimmering clouds over Rohan. Enormous eagles transport flocks upon their wings, and Viking ships glide down the stream. Almost whispering to himself, like a sailor unable to avert a certain storm, Gandalf surveys the forested valley of Fangorn, the final barrier between Edoras and Rohan. Pippin anxiously seeks comfort, but Gandalf glances down at him without speaking and gazes into the beyond as if visualizing something in his mind's eye. A towering, cloaked figure dressed in white is being attended by loyal dwarves as Gandalf continues to glare intently as if confronting his adversary in spirit. Pippin glances up at Gandalf, hesitant to inquire, while he remembers Frodo whispering as the Elven arrow is aimed at his chest, and Pippin shudders at the memory. Meanwhile, Frodo and Sam scramble into a small trench beside a smooth stone path as Gollum cautiously sneaks over the edge of the trench. Minas Ithil, an ancient thriving city set upon a grassy knoll at the base of the Ithil Vale, shimmers with a vibrant radiant glow like a moonbeam, and two enormous, regal bronze statues guard the archway leading to the city. Gollum, Frodo, and Sam scuttle from their concealment, dashing in the twilight towards Minas Ithil. Frodo glances up at the magnificent statues, and he and Sam are astonished at the sight of a wide, gently winding ramp carved into the hillside directly in front of the Minas Ithil gates, ascending higher and higher up the gentle eastern slope of the Ithil Vale to the lofty peaks of the cloud-capped hills of Rohan. Suddenly, Frodo tiptoes across the path as if some power other than his own will is guiding him, swaying toward the archway and Minas Ithil. Sam dashes after Frodo, steadying him in his arms as he trips, and with Gollum's aid, pulls Frodo from the archway before Frodo collapses to the ground. At that moment, the air vibrates, and a great murmuring sound sweeps across and reverberates in the hills. The warm, calm Ithil Vale becomes tumultuous and vibrant as swirling winds whisk from Mount Mindolluin. Minas Ithil replies with a glow of vivid luminescence, bursts of green mist rising up from the rampart into the serene sky, and brilliant electric sparks illuminate the sky above Rohan as gentle rain rolls across 40 leagues to Edoras."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Merlin lounges loudly on a veranda that oversees the small village as Bilbo gazes down at the tiny forest lake. Merlin observes the old elf and then approaches Bilbo as they glance towards the nearby, rounded hills of Elfland. Bilbo, anxious, glances down at Merlin, who gives him a large boastful frown. Together, Merlin and Bilbo share a loud conversation as they gaze out towards the serene lake over Elfland. Massive Elephants drag trees behind their tusks, and Viking longboats float down the creek. Almost singing to himself, like a bird unable to escape a closed cage, Merlin examines the war-torn village of Rivendell, the final stronghold between Emerald City and Elfland. Bilbo frantically seeks understanding, but Merlin glances up at him without uttering anything and gazes into the horizon as if watching something in his imagination. A miniature, robed child dressed in green is being crowned by loyal dogs as Merlin continues to look intensely as if challenging his rival in spirit. Bilbo looks up at Merlin, hesitant to inquire, while he remembers Daisy laughing as the magic wand is dropped onto her foot, and Bilbo blushes at the thought. Meanwhile, Daisy and Merry glide onto a large plateau beside a polished stone as Grendel cautiously listens over the edge of the plateau. London Bridge, a small lively hamlet perched upon a grassy knoll at the end of the London Valley, shines with a vibrant golden sheen like a sunray, and two tiny, angelic marble figurines guard the road leading to the hamlet. Grendel, Daisy, and Merry stroll from their haven, dancing in the moonlight towards London Bridge. Daisy looks down at the graceful figurines, and she and Merry are delighted at the sight of a broad, gently sloping ramp carved into the soil face directly behind the London Bridge rows, leading lower and lower down the gentle eastern side of the London Valley to the lonely fields of the smooth hills of Elfland. Suddenly, Daisy tumbles across the stone as if some power other than her own strength is in command, drifting away from the road and London Bridge. Merry dashes after Daisy, embracing her with his hands as she falls, and with Grendel's aid, pulls Daisy from the road before Daisy flies to the sky. At that instant, the sky trembles, and a loud crashing sound rumbles above and resonates in the hills. The warm, bright London Valley becomes calm and gentle as upward-billowing clouds rise from Cloud Mountain. London Bridge replies with a flash of blue rain, drops of green water falling away from the building into the gentle breeze, and calm watery flows fill the breeze over Elfland as soft whispers travel 20 feet to Emerald City."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Gandalf and Pippin stand on a balcony overlooking the city, sharing a quiet moment while gazing towards Mordor's fiery horizon. Gandalf contemplates the battle-scarred Osgiliath—the last barrier between Minas Tirith and Mordor—while Pippin seeks reassurance. Meanwhile, Frodo and Sam, guided by Gollum, reach a gully near the ominously glowing Minas Morgul. As they approach the city, they are awed by a steep staircase leading up the mountains. Frodo suddenly staggers towards the bridge, compelled by an unknown force, but Sam and Gollum pull him back in time. As they retreat, Mount Doom erupts violently, with flames and thunder echoing to Minas Tirith."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Minas Morgul responds with a flare of livid lightning forks of blue flame springing up from the tower into the sullen cloud and violent fiery flashes light the cloud above Mordor as sharp thunder rolls across 40 miles to Minas Tirith The cold dull Morgul Valley becomes violent and fierce as uprushing flames spring from Mount Doom  At that moment the ground quivers and a great rumbling noise rolls across and echoes in the mountains  Sam runs after Frodo catching him in his arms as he stumbles and with Gollum's help pulls Frodo from the bridge before Frodo falls to the ground  Suddenly Frodo staggers across the road as if some force other than his own will is at work lurching toward the bridge and Minas Morgul  Frodo looks up at the hideous statues and he and Sam are aghast at the sight of a narrow nearvertical staircase cut into the rock face directly in front of the Minas Morgul gates leading higher and higher up the sheer western side of the Morgul Valley to the high peaks of the razorlike mountains of Mordor  Frodo and Sam hurry from their cover scampering in the shadows towards Minas Morgul  Gollum  Minas Morgul a massive dead city set upon a rocky knee at the head of the Morgul Valley glows with a sickly luminous light like a corpse candle and two huge bestial stone statues guard the bridge leading to the city  Meanwhile Frodo and Sam clamber into a small gully beside a roughhewn road as Gollum carefully peers over the lip of the gully  Pippin looks up at Gandalf afraid to ask while he recalls Frodo screaming as the Morgul blade is driven into his shoulder and Pippin blanches at the memory  A towering hooded figure dressed in black is being armored by attendant orcs as Gandalf continues to stare intently as if facing his enemy in person  Pippin desperately seeks reassurance but Gandalf looks down at him without saying anything and stares into the distance as if seeing something in his mind's eye  Almost talking to himself like a man unable to prevent a sure disaster Gandalf observes the battlescarred city of Osgiliath the last bastion between Minas Tirith and Mordor  Giant Mumakil carry armies upon their backs and Corsair ships sail up the river  Together Gandalf and Pippin share a quiet moment as they stare out towards the fiery sky over Mordor  Pippin unnerved looks up at Gandalf who gives him a small selfdeprecating smile  Gandalf watches the young hobbit and then joins Pippin as they look towards the distant jagged mountains of Mordor  Gandalf stands quietly on a balcony that overlooks the great city as Pippin stares up at the vast night sky "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Gollum  Suddenly Frodo staggers across the road as if some force other than his own will is at work lurching toward the bridge and Minas Morgul  Minas Morgul a massive dead city set upon a rocky knee at the head of the Morgul Valley glows with a sickly luminous light like a corpse candle and two huge bestial stone statues guard the bridge leading to the city  Pippin looks up at Gandalf afraid to ask while he recalls Frodo screaming as the Morgul blade is driven into his shoulder and Pippin blanches at the memory  Sam runs after Frodo catching him in his arms as he stumbles and with Gollum's help pulls Frodo from the bridge before Frodo falls to the ground  Gandalf watches the young hobbit and then joins Pippin as they look towards the distant jagged mountains of Mordor  Frodo and Sam hurry from their cover scampering in the shadows towards Minas Morgul  Almost talking to himself like a man unable to prevent a sure disaster Gandalf observes the battlescarred city of Osgiliath the last bastion between Minas Tirith and Mordor  At that moment the ground quivers and a great rumbling noise rolls across and echoes in the mountains  Pippin unnerved looks up at Gandalf who gives him a small selfdeprecating smile  Minas Morgul responds with a flare of livid lightning forks of blue flame springing up from the tower into the sullen cloud and violent fiery flashes light the cloud above Mordor as sharp thunder rolls across 40 miles to Minas Tirith Giant Mumakil carry armies upon their backs and Corsair ships sail up the river  Meanwhile Frodo and Sam clamber into a small gully beside a roughhewn road as Gollum carefully peers over the lip of the gully  A towering hooded figure dressed in black is being armored by attendant orcs as Gandalf continues to stare intently as if facing his enemy in person  Together Gandalf and Pippin share a quiet moment as they stare out towards the fiery sky over Mordor  Frodo looks up at the hideous statues and he and Sam are aghast at the sight of a narrow nearvertical staircase cut into the rock face directly in front of the Minas Morgul gates leading higher and higher up the sheer western side of the Morgul Valley to the high peaks of the razorlike mountains of Mordor  Pippin desperately seeks reassurance but Gandalf looks down at him without saying anything and stares into the distance as if seeing something in his mind's eye  The cold dull Morgul Valley becomes violent and fierce as uprushing flames spring from Mount Doom  Gandalf stands quietly on a balcony that overlooks the great city as Pippin stares up at the vast night sky "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Minas Morgul a massive dead city set upon a rocky knee at the head of the Morgul Valley glows with a sickly luminous light like a corpse candle and two huge bestial stone statues guard the bridge leading to the city  Gollum  Frodo and Sam hurry from their cover scampering in the shadows towards Minas Morgul  Frodo looks up at the hideous statues and he and Sam are aghast at the sight of a narrow nearvertical staircase cut into the rock face directly in front of the Minas Morgul gates leading higher and higher up the sheer western side of the Morgul Valley to the high peaks of the razorlike mountains of Mordor  Suddenly Frodo staggers across the road as if some force other than his own will is at work lurching toward the bridge and Minas Morgul  Sam runs after Frodo catching him in his arms as he stumbles and with Gollum's help pulls Frodo from the bridge before Frodo falls to the ground  At that moment the ground quivers and a great rumbling noise rolls across and echoes in the mountains  The cold dull Morgul Valley becomes violent and fierce as uprushing flames spring from Mount Doom  Minas Morgul responds with a flare of livid lightning forks of blue flame springing up from the tower into the sullen cloud and violent fiery flashes light the cloud above Mordor as sharp thunder rolls across 40 miles to Minas Tirith Gandalf stands quietly on a balcony that overlooks the great city as Pippin stares up at the vast night sky  Gandalf watches the young hobbit and then joins Pippin as they look towards the distant jagged mountains of Mordor  Pippin unnerved looks up at Gandalf who gives him a small selfdeprecating smile  Together Gandalf and Pippin share a quiet moment as they stare out towards the fiery sky over Mordor  Giant Mumakil carry armies upon their backs and Corsair ships sail up the river  Almost talking to himself like a man unable to prevent a sure disaster Gandalf observes the battlescarred city of Osgiliath the last bastion between Minas Tirith and Mordor  Pippin desperately seeks reassurance but Gandalf looks down at him without saying anything and stares into the distance as if seeing something in his mind's eye  A towering hooded figure dressed in black is being armored by attendant orcs as Gandalf continues to stare intently as if facing his enemy in person  Pippin looks up at Gandalf afraid to ask while he recalls Frodo screaming as the Morgul blade is driven into his shoulder and Pippin blanches at the memory  Meanwhile Frodo and Sam clamber into a small gully beside a roughhewn road as Gollum carefully peers over the lip of the gully "
        }
      ]
    }
  ]
}