{
  "ground_truth": "Young Don Price shines his flashlight on Edward, and a recap of earlier football, baseball, and basketball highlights reveals that Edward beats Don every time, leaving Edward dumbstruck. With all the strength he can muster, he turns and walks down the front steps while she stays in the doorway for a few beats, feeling genuinely horrible for what's happened, but eventually, she goes back inside. We lead Edward as he walks away, tears just starting to form, and he exits the frame, leaving only the sorority house in the background. Edward steps back into the frame, looking at the sorority house, as we circle and he shouts. Sandra and her sisters peer out through the curtains while the tweedy economics professor continues his explanation, but Sandra isn't paying a lot of attention. He switches on the overhead projector without looking at it, causing a titter from the students, but he doesn't notice until a classmate nudges Sandra, who looks up and the professor finally notices what's written there. Walking with her books, Sandra shakes her head, disbelieving, and we look up to the blue sky where a giant sky-written heart floats in the wind. At her sisters' prompting, a just-woken Sandra looks out the second-story window to find the lawn filled with Edward standing amid the sea of flowers. Sandra walks out to him, smiling, confused, joyful, and scared, and out of nowhere, a tear drops down Sandra's cheek. From down the street, the adult Don Price arrives, 230 pounds of football-playing, Skynyrd-loving, fraternity-proud muscle, and he's pissed. A gang of his brothers walk behind him, and Don Price decks him, knocking him down. Edward gets right back up but makes no move to defend himself, unfazed; Don slugs him again, shrugs fine, then proceeds to kick Edward's ass nine ways to Sunday, and as the ass-whupping continues, we see Don Price sitting on the can, pinching a loaf while reading the new Playboy, squeezing down hard, trying to shit the unshittable. Suddenly, he grasps his chest and collapses face-first on the tile, and the same image of Don's dead face on the tile is reflected in The Eye as the thrashing continues. Edward somehow fights his way back to his feet, ready to be knocked down again, and Don is about to slug Edward again when he turns as Sandra pulls off her engagement ring. There's an audible AHH! from her sisters and an OHH! from Don's brothers, and Don stands stunned, his mind reeling. Edward, whose eyes are swollen almost shut, keeps waiting for the next punch as she hands him the ring. Another beat passes, then Don storms off, and Sandra leans over Edward's broken body, his head lying on the daffodils. As the music reaches a crescendo, Edward reaches for his glass of water, but Josephine already has it for him.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Youthful Don Price illuminates his torch on Edward, and a summary of previous soccer, baseball, and basketball best moments discloses that Edward defeats Don every instance, leaving Edward speechless. With all the force he can summon, he pivots and walks down the front steps while she remains in the doorway for a few moments, feeling genuinely awful for what's transpired, but eventually, she returns indoors. We guide Edward as he walks away, tears just starting to form, and he exits the frame, leaving only the sorority residence in the background. Edward steps back into the frame, observing the sorority residence, as we circle and he yells. Sandra and her sisters gaze out through the curtains while the tweedy economics lecturer continues his clarification, but Sandra isn't giving much notice. He activates the overhead projector without glancing at it, causing a giggle from the students, but he doesn't realize until a classmate nudges Sandra, who looks up and the lecturer finally observes what's inscribed there. Walking with her volumes, Sandra shakes her head, incredulous, and we gaze up to the azure sky where a huge sky-written heart drifts in the breeze. At her sisters' urging, a just-woken Sandra peers out the second-story window to find the lawn occupied with Edward standing amid the expanse of blossoms. Sandra walks out to him, smiling, puzzled, joyful, and frightened, and from nowhere, a tear descends Sandra's cheek. From down the road, the grown Don Price arrives, 230 pounds of football-playing, Skynyrd-loving, fraternity-proud brawn, and he's irate. A group of his brothers walk behind him, and Don Price punches him, knocking him down. Edward gets right back up but makes no move to defend himself, unfazed; Don punches him again, shrugs fine, then proceeds to kick Edward's derrière nine ways to Sunday, and as the beating continues, we see Don Price seated on the toilet, pinching a loaf while perusing the new Playboy, squeezing down hard, trying to defecate the unshittable. Suddenly, he grips his chest and collapses face-first on the tile, and the same image of Don's lifeless face on the tile is mirrored in The Eye as the thrashing continues. Edward somehow battles his way back to his feet, ready to be knocked down again, and Don is about to punch Edward again when he turns as Sandra removes her engagement ring. There's an audible AHH! from her sisters and an OHH! from Don's brothers, and Don stands shocked, his mind spinning. Edward, whose eyes are swollen almost shut, keeps waiting for the next blow as she hands him the ring. Another moment passes, then Don storms off, and Sandra leans over Edward's broken form, his head lying on the daffodils. As the music reaches a peak, Edward reaches for his glass of water, but Josephine already has it for him."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The flashlight was shone on Edward by young Don Price, and earlier football, baseball, and basketball highlights were revealed in a recap that shows Edward was beaten by Don every time, leaving Edward dumbstruck. With all the strength he can muster, he is turned and walked down the front steps by himself while she is stayed in the doorway for a few beats, feeling genuinely horrible for what's happened, but she eventually goes back inside. Edward is led by us as he walks away, tears just starting to form, and he is exited from the frame, with only the sorority house being left in the background. The frame is stepped back into by Edward, looking at the sorority house, as we circle and a shout is let out by him. Sandra and her sisters peer out through the curtains while the tweedy economics professor continues his explanation, but Sandra isn't paying a lot of attention. The overhead projector was switched on by him without looking at it, causing a titter from the students, but it wasn't noticed by him until a classmate nudges Sandra, who looks up and notices what's finally written there by the professor. Walking with her books, Sandra shakes her head, disbelieving, and the blue sky where a giant sky-written heart floats in the wind is looked up at by us. At her sisters' prompting, a just-woken Sandra looks out the second-story window to find Edward standing amid the sea of flowers filling the lawn. Edward is walked out to by Sandra, smiling, confused, joyful, and scared, and a tear drops down Sandra's cheek out of nowhere. From down the street, the adult Don Price arrives, 230 pounds of football-playing, Skynyrd-loving, fraternity-proud muscle, and he's pissed. A gang of his brothers walks behind him, and Don Price knocks Edward down by decking him. Edward is gotten right back up but no move is made by him to defend himself, unfazed; Don slugs him again, shrugs fine, then proceeds to have Edward's ass kicked nine ways to Sunday, and as the ass-whupping continues, Don Price is seen by us sitting on the can, pinching a loaf while reading the new Playboy, squeezing down hard, trying to shit the unshittable. Suddenly, his chest is grasped by him and he collapses face-first on the tile, and in The Eye, the same image of Don's dead face on the tile is reflected as the thrashing continues. Edward somehow fights his way back to his feet, ready to be knocked down again, and Edward is about to be slugged by Don again when Don turns as Sandra pulls off her engagement ring. An audible AHH! is let out by her sisters and an OHH! is exclaimed by Don's brothers, and Don stands stunned, his mind reeling. Edward, whose eyes are swollen almost shut, keeps waiting for the next punch as the ring is handed to him by her. Another beat passes, then Don storms off, and Edward's broken body is leaned over by Sandra, his head lying on the daffodils. As the music reaches a crescendo, Edward reaches for his glass of water, but it is already held by Josephine for him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Young Don Price shines his flashlight on Edward, and a recap of earlier sports highlights shows Edward always beating Don, leaving him dumbstruck. Mustering strength, Edward walks down the steps while she stays in the doorway, feeling terrible, but eventually goes inside. Edward walks away, tears forming, exiting the frame with the sorority house in the background. He reappears, looking at the house, shouting. Sandra and her sisters peer through curtains while the economics professor continues his lecture, oblivious to the overhead projector's mishap until a classmate nudges Sandra. Walking with her books, Sandra shakes her head, disbelieving, and sees a sky-written heart. Her sisters prompt her to look out the window, finding Edward amid flowers. Sandra walks to him, smiling, confused, joyful, and scared, as a tear falls. Adult Don Price arrives, angry, with his fraternity brothers. Don punches Edward, who gets up without defending himself. Don continues the assault, and we see Don on the toilet, reading Playboy, straining. Suddenly, he grasps his chest, collapses, and the image of his dead face is reflected in The Eye. Edward stands again, ready for more, as Don turns when Sandra removes her engagement ring. Her sisters gasp, Don's brothers react, and Don is stunned. Edward, eyes swollen, waits for another punch as she hands him the ring. Don storms off, and Sandra leans over Edward's broken body. As music crescendos, Edward reaches for water, but Josephine already has it for him."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Young Don Price shines a flashlight on Edward, revealing Edward's consistent victories in football, baseball, and basketball, leaving Don dumbstruck. Edward, mustering strength, walks away as she stays in the doorway, feeling terrible, but eventually goes inside. Edward walks away, tears forming, exits the frame, leaving the sorority house behind. He returns, shouting at the house, as Sandra and her sisters peer out, distracted from the economics professor's lecture. The professor switches on the projector, causing laughter, and Sandra notices it only when nudged. Walking with her books, Sandra sees a sky-written heart. Her sisters prompt her to look out the window, seeing Edward amid flowers. Sandra, smiling and tearful, walks to him. Adult Don Price, angry, arrives with his brothers and punches Edward, who doesn't defend himself. Don continues the beating, and we see Don on the toilet, reading Playboy, then collapsing. Edward stands again, ready for more, as Sandra removes her engagement ring. Her sisters gasp, Don's brothers react, and Don is stunned. Edward, eyes swollen, waits for another punch as Sandra hands him the ring. Don storms off, and Sandra leans over Edward's broken body. As music crescendos, Edward reaches for water, but Josephine already has it."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Young Don Price, with a determined expression, shines his flashlight directly on Edward. A recap of earlier sports highlights—football, baseball, and basketball—plays out, illustrating that Edward consistently outperforms Don in every instance, leaving Edward utterly dumbstruck by his own success. Summoning all the strength he can muster, Edward turns and descends the front steps, while she remains standing in the doorway for a few lingering moments, feeling genuinely terrible about the events that have transpired. Eventually, she retreats back inside. We follow Edward as he walks away, tears just beginning to form in his eyes, and he exits the frame, leaving only the sorority house visible in the background. Edward re-enters the frame, casting a glance back at the sorority house, and as we circle around him, he shouts. Inside, Sandra and her sisters peer out through the curtains, while the tweedy economics professor continues his lecture, but Sandra is not paying much attention. He switches on the overhead projector without glancing at it, eliciting a titter from the students, but he remains oblivious until a classmate nudges Sandra, prompting her to look up, and the professor finally notices the writing there. Walking with her books in hand, Sandra shakes her head in disbelief, and we gaze up at the expansive blue sky where a giant sky-written heart drifts in the wind. At her sisters' urging, a just-awakened Sandra looks out the second-story window to discover the lawn filled with Edward, standing amidst a sea of flowers. Sandra walks out to him, her emotions a mix of confusion, joy, and fear, and unexpectedly, a tear rolls down her cheek. From down the street, the adult Don Price arrives, a formidable 230 pounds of football-playing, Skynyrd-loving, fraternity-proud muscle, and he is visibly angry. A group of his fraternity brothers follows behind him, and Don Price punches Edward, knocking him to the ground. Edward immediately gets back up but makes no attempt to defend himself, remaining unfazed; Don hits him again, shrugs it off, and proceeds to beat Edward mercilessly. As the beating continues, we see Don Price sitting on the toilet, reading the latest issue of Playboy, straining hard, trying to accomplish the impossible. Suddenly, he clutches his chest and collapses face-first onto the tile floor, and the same image of Don's lifeless face on the tile is reflected in The Eye as the thrashing continues. Edward somehow manages to fight his way back to his feet, ready to be knocked down once more, and Don is about to hit Edward again when he turns to see Sandra removing her engagement ring. There's an audible gasp of \"AHH!\" from her sisters and an \"OHH!\" from Don's brothers, leaving Don standing there, stunned, his mind reeling. Edward, whose eyes are swollen almost shut, continues to brace himself for the next punch as she hands him the ring. Another moment passes, then Don storms off, and Sandra leans over Edward's battered body, his head resting on the daffodils. As the music swells to a crescendo, Edward reaches for his glass of water, but Josephine is already there, holding it for him."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Young Don Price, wearing a resolute and focused look, directs the beam of his flashlight unwaveringly on Edward. The scene shifts to recount earlier sports highlights, showcasing football, baseball, and basketball events. In every one of these, Edward consistently surpasses Don, performing at a level so remarkable that it leaves Edward himself in a state of sheer astonishment at his unexpected triumphs. Gathering every ounce of strength within him, Edward turns away and carefully descends the steps at the front. Meanwhile, she lingers in the doorway, standing there for a few more moments, genuinely feeling a profound sense of regret and sorrow about the events that have unfolded. After those fleeting moments pass, she slowly retreats back indoors. Our focus shifts to Edward as he walks on, tears just beginning to well up in his eyes, eventually disappearing from the frame, leaving only the sorority house as the backdrop. Edward reappears in the frame, glancing back towards the sorority house, and as the camera encircles him, he lets out a shout. Inside, Sandra and her sorority sisters peer out through the curtains, while the tweedy economics professor continues delivering his lecture. However, Sandra’s mind is elsewhere, and she is not paying much attention to the lecture. The professor, obliviously switching on the overhead projector without even glancing at it, inadvertently provokes quiet laughter from the students. It isn’t until a classmate gently nudges Sandra, prompting her to look up, that the professor finally notices the writing projected there. Carrying her books, Sandra walks on, shaking her head in disbelief, and we shift our gaze upward to the vast, expansive blue sky where a giant heart, written in the sky, drifts serenely in the wind. At the urging of her sisters, a freshly awakened Sandra peers out from the second-story window and is taken aback to find the lawn adorned with Edward standing amidst a sea of vibrant flowers. Sandra steps out to meet him, her emotions a whirlwind of confusion, joy, and fear, and quite unexpectedly, a single tear trickles down her cheek. Meanwhile, from down the street, the adult Don Price makes his entrance, weighing in at a formidable 230 pounds of robust, football-playing, Skynyrd-loving, fraternity-proud muscle, and his anger is visibly palpable. Trailing behind him are a group of his fraternity brothers, and in a sudden burst of rage, Don Price punches Edward, knocking him to the ground. Yet, Edward immediately gets back up, not making any attempt to defend himself, and seeming completely unfazed; with each hit from Don, Edward simply shrugs it off, but Don continues to beat Edward mercilessly. As the brutal beating continues relentlessly, we see a parallel scene with Don Price sitting grimly on the toilet, engrossed in reading the latest issue of Playboy, straining intensely, trying to achieve the impossible. Without warning, he clutches his chest and collapses face-first onto the cold tile floor, and the identical haunting image of Don's lifeless face on the tile is mirrored in The Eye as the thrashing persists. Against all odds, Edward somehow manages to struggle back to his feet, preparing himself once more for another fall. Just as Don is about to strike Edward again, his attention is diverted by the sight of Sandra removing her engagement ring. The sound of an audible gasp, \"AHH!\" emanates from her sisters, while an \"OHH!\" escapes from Don's fraternity brothers, leaving Don standing there, utterly stunned, his mind spinning. Despite his eyes being almost swollen shut, Edward continues to brace himself for yet another punch as she reaches out to hand him the ring. Another moment hangs in the air, then Don storms off in a huff, and Sandra leans tenderly over Edward's battered and bruised body, his head resting gently among the daffodils. As the music swells and crescendos with intensity, Edward reaches for his glass of water, but Josephine is already by his side, holding it for him with care."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Young Don Price directs the beam of his flashlight onto Edward, illuminating his face as a series of earlier sports highlights flash through his mind, each one showcasing Edward's consistent victories over Don in football, baseball, and basketball, leaving Edward in a state of disbelief. Summoning all his remaining strength, Edward turns away and begins to descend the front steps, each step deliberate and heavy with emotion, while she lingers in the doorway for a few moments, her heart weighed down by genuine remorse for the events that have transpired, before she eventually retreats back inside. We follow Edward as he continues his walk, his pace slow and burdened, tears beginning to well up in his eyes as he moves out of the frame, leaving the sorority house as the sole backdrop. Edward reappears in the frame, his gaze fixed on the sorority house, and as we circle around him, he raises his voice in a shout. Inside, Sandra and her sisters peek through the curtains, their curiosity piqued, while the tweedy economics professor carries on with his lecture, oblivious to Sandra's lack of attention. He absentmindedly switches on the overhead projector, eliciting a ripple of laughter from the students, which he fails to notice until a classmate nudges Sandra, prompting her to look up, and only then does the professor become aware of the writing on the projector. As Sandra walks with her books, she shakes her head in disbelief, and we shift our gaze to the expansive blue sky where a giant heart, crafted from skywriting, drifts gently in the wind. At the urging of her sisters, a groggy Sandra peers out from the second-story window to discover the lawn below, awash with flowers, and Edward standing amidst them. Sandra steps out to meet him, her emotions a complex mix of confusion, joy, and fear, and unexpectedly, a tear slips down her cheek. From down the street, the adult Don Price approaches, his imposing 230-pound frame, honed by football and fueled by a love for Skynyrd and fraternity pride, radiating anger. Accompanied by a group of his fraternity brothers, Don Price lands a punch on Edward, sending him to the ground. Edward rises immediately, making no attempt to defend himself, seemingly unfazed, as Don strikes him again, then nonchalantly continues to pummel Edward with relentless force. As the beating persists, we catch a glimpse of Don Price in a different setting, sitting on the toilet, engrossed in the latest issue of Playboy, straining with all his might to accomplish the impossible. Abruptly, he clutches his chest and collapses forward, his face meeting the cold tile floor, and this image of Don's lifeless face is mirrored in The Eye as the thrashing continues. Despite the odds, Edward manages to struggle back to his feet, bracing himself for another blow, and just as Don is about to strike again, he pauses as Sandra removes her engagement ring. The sound of her sisters' collective gasp and the surprised exclamations from Don's brothers fill the air, leaving Don momentarily paralyzed, his mind struggling to process the scene. Edward, his eyes nearly swollen shut, remains poised for the next punch, but instead, Sandra extends the ring to him. A moment of silence ensues before Don storms off in a fit of frustration, and Sandra bends over Edward's battered body, his head resting gently on the daffodils. As the music swells to a dramatic peak, Edward reaches out for his glass of water, but Josephine is already there, handing it to him with care."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Young Don Price shines his flashlight on Edward, revealing a series of sports highlights where Edward consistently outperforms Don, leaving Edward dumbstruck. Summoning his strength, Edward walks away from the scene, while she lingers in the doorway, feeling remorseful before retreating inside. As Edward departs, tears begin to form, and he exits the frame, leaving the sorority house behind. He reappears, shouting at the house, prompting Sandra and her sisters to peer out through the curtains during an economics lecture, where Sandra is distracted. The professor inadvertently causes laughter by switching on the overhead projector, only noticing the mishap when a classmate nudges Sandra. Later, Sandra, carrying her books, looks up at a sky-written heart, bewildered. Awakened by her sisters, she sees Edward standing amidst a sea of flowers on the lawn. She approaches him, experiencing a mix of emotions, and a tear falls from her cheek. Meanwhile, adult Don Price, accompanied by his fraternity brothers, arrives angrily and attacks Edward. Despite being knocked down repeatedly, Edward remains unfazed and doesn't defend himself. As Don continues the assault, a scene of Don's demise is intercut, showing him collapsing in a bathroom. Edward, battered but resilient, stands again as Sandra removes her engagement ring, stunning Don and eliciting reactions from the onlookers. Don storms off, and Sandra tends to Edward's broken body, lying among the daffodils. As the music crescendos, Edward reaches for his glass of water, which Josephine already holds for him."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Young Don Price, known for his competitive spirit developed from years of playing high school sports in his hometown, shines his flashlight on Edward, and a recap of earlier football, baseball, and basketball highlights reveals that Edward beats Don every time, leaving Edward dumbstruck. With all the strength he can muster, he turns and walks down the front steps while she stays in the doorway for a few beats, feeling genuinely horrible for what's happened, but eventually, she goes back inside. We lead Edward as he walks away, tears just starting to form, and he exits the frame, leaving only the imposing yet inviting sorority house in the background, which is notorious on campus for its lively parties. Edward steps back into the frame, looking at the sorority house, as we circle and he shouts. Sandra and her sisters, members of a sorority known for their academic achievements and social initiatives, peer out through the curtains while the tweedy economics professor, who is famous for his dry sense of humor and rigorous exams, continues his explanation, but Sandra isn't paying a lot of attention. He switches on the overhead projector without looking at it, causing a titter from the students, but he doesn't notice until a classmate nudges Sandra, who looks up and the professor finally notices what's written there. Walking with her books, Sandra shakes her head, disbelieving, and we look up to the blue sky where a giant sky-written heart, a costly romantic gesture usually reserved for grand proposals, floats in the wind. At her sisters' prompting, a just-woken Sandra looks out the second-story window to find the lawn filled with Edward standing amid the sea of flowers, an extravagant display that stops everyone in their tracks. Sandra walks out to him, smiling, confused, joyful, and scared, and out of nowhere, a tear drops down Sandra's cheek. From down the street, the adult Don Price arrives, 230 pounds of football-playing, Skynyrd-loving, fraternity-proud muscle, and he's pissed, remembering his high school glory days, now overshadowed by Edward's persistent presence. A gang of his brothers, known for their rowdy antics on and off the field, walk behind him, and Don Price decks him, knocking him down. Edward gets right back up but makes no move to defend himself, unfazed; Don slugs him again, shrugs fine, then proceeds to kick Edward's ass nine ways to Sunday, and as the ass-whupping continues, we see Don Price sitting on the can, pinching a loaf while reading the new Playboy, squeezing down hard, trying to shit the unshittable. Suddenly, he grasps his chest, a shock of pain that signifies more than just indigestion, and collapses face-first on the tile, and the same image of Don's dead face on the tile is reflected in The Eye, an ominous symbol suggesting fate's watchful gaze, as the thrashing continues. Edward somehow fights his way back to his feet, ready to be knocked down again, and Don is about to slug Edward again when he turns as Sandra pulls off her engagement ring, a symbol of commitment now broken. There's an audible AHH! from her sisters and an OHH! from Don's brothers, all deeply entrenched in the drama, and Don stands stunned, his mind reeling from the spectacle and its implications. Edward, whose eyes are swollen almost shut, keeps waiting for the next punch as she hands him the ring, an act of defiance and newfound love. Another beat passes, then Don storms off, and Sandra leans over Edward's broken body, his head lying on the daffodils, a flower long associated with rebirth and new beginnings. As the music, a sweeping orchestral piece that underscores the emotional intensity, reaches a crescendo, Edward reaches for his glass of water, but Josephine, ever attentive, already has it for him."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Young Don Price shines his flashlight on Edward and a recap of earlier football baseball and basketball highlights reveals that Edward beats Don every time leaving Edward dumbstruck. With all the strength he can muster he turns and walks down the front steps while she stays in the doorway for a few beats feeling genuinely horrible for what is happened but eventually she goes back inside. We lead Edward as he walks away tears just starting to form and he exits the frame leaving only the sorority house in the background. Edward steps back into the frame looking at the sorority house as we circle and he shouts. Sandra and her sisters peer out through the curtains while the tweedy economics professor continues his explanation but Sandra is not paying a lot of attention. He switches on the overhead projector without looking at it causing a titter from the students but he does not notice until a classmate nudges Sandra who looks up and the professor finally notices what is written there. Walking with her books Sandra shakes her head disbelieving and we look up to the blue sky where a giant skywritten heart floats in the wind. At her sisters' prompting a justwoken Sandra looks out the secondstory window to find the lawn filled with Edward standing amid the sea of flowers. Sandra walks out to him smiling confused joyful and scared and out of nowhere a tear drops down Sandra's cheek. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. From down the street the adult Don Price arrives 230 pounds of footballplaying Skynyrdloving fraternityproud muscle and he is pissed. A gang of his brothers walk behind him and Don Price decks him knocking him down. Edward gets right back up but makes no move to defend himself unfazed. Don slugs him again shrugs fine then proceeds to kick Edward's ass nine ways to Sunday and as the asswhupping continues we see Don Price sitting on the can pinching a loaf while reading the new Playboy squeezing down hard trying to shit the unshittable. Suddenly he grasps his chest and collapses facefirst on the tile and the same image of Don's dead face on the tile is reflected in The Eye as the thrashing continues. Edward somehow fights his way back to his feet ready to be knocked down again and Don is about to slug Edward again when he turns as Sandra pulls off her engagement ring. There is an audible AHH from her sisters and an OHH from Don's brothers and Don stands stunned his mind reeling. Edward whose eyes are swollen almost shut keeps waiting for the next punch as she hands him the ring. Another beat passes then Don storms off and Sandra leans over Edward's broken body his head lying on the daffodils. As the music reaches a crescendo Edward reaches for his glass of water but Josephine already has it for him."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Young Don Price shines his flashlight on Edward and a recap of earlier football baseball and basketball highlights reveals that Edward beats Don every time leaving Edward dumbstruck. With all the strength he can muster he turns and walks down the front steps while she stays in the doorway for a few beats feeling genuinely horrible for what is happened but eventually she goes back inside. We lead Edward as he walks away tears just starting to form and he exits the frame leaving only the sorority house in the background. Edward steps back into the frame looking at the sorority house as we circle and he shouts. Sandra and her sisters peer out through the curtains while the tweedy economics professor continues his explanation but Sandra is not paying a lot of attention. He switches on the overhead projector without looking at it causing a titter from the students but he does not notice until a classmate nudges Sandra who looks up and the professor finally notices what is written there. Walking with her books Sandra shakes her head disbelieving and we look up to the blue sky where a giant skywritten heart floats in the wind. At her sisters' prompting a justwoken Sandra looks out the secondstory window to find the lawn filled with Edward standing amid the sea of flowers. Sandra walks out to him smiling confused joyful and scared and out of nowhere a tear drops down Sandra's cheek. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. From down the street the adult Don Price arrives 230 pounds of footballplaying Skynyrdloving fraternityproud muscle and he is pissed. A gang of his brothers walk behind him and Don Price decks him knocking him down. Edward gets right back up but makes no move to defend himself unfazed. Don slugs him again shrugs fine then proceeds to kick Edward's ass nine ways to Sunday and as the asswhupping continues we see Don Price sitting on the can pinching a loaf while reading the new Playboy squeezing down hard trying to shit the unshittable. Suddenly he grasps his chest and collapses facefirst on the tile and the same image of Don's dead face on the tile is reflected in The Eye as the thrashing continues. Edward somehow fights his way back to his feet ready to be knocked down again and Don is about to slug Edward again when he turns as Sandra pulls off her engagement ring. There is an audible AHH from her sisters and an OHH from Don's brothers and Don stands stunned his mind reeling. Edward whose eyes are swollen almost shut keeps waiting for the next punch as she hands him the ring. Another beat passes then Don storms off and Sandra leans over Edward's broken body his head lying on the daffodils. As the music reaches a crescendo Edward reaches for his glass of water but Josephine already has it for him."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Young Don Price shines his flashlight on Edward and a recap of earlier football baseball and basketball highlights reveals that Edward beats Don every time leaving Edward dumbstruck. With all the strength he can muster he turns and walks down the front steps while she stays in the doorway for a few beats feeling genuinely horrible for what is happened but eventually she goes back inside. We lead Edward as he walks away tears just starting to form and he exits the frame leaving only the sorority house in the background. Edward steps back into the frame looking at the sorority house as we circle and he shouts. Sandra and her sisters peer out through the curtains while the tweedy economics professor continues his explanation but Sandra is not paying a lot of attention. Edward somehow fights his way back to his feet ready to be knocked down again and Don is about to slug Edward again when he turns as Sandra pulls off her engagement ring. There is an audible AHH from her sisters and an OHH from Don's brothers and Don stands stunned his mind reeling. Edward whose eyes are swollen almost shut keeps waiting for the next punch as she hands him the ring. Another beat passes then Don storms off and Sandra leans over Edward's broken body his head lying on the daffodils. As the music reaches a crescendo Edward reaches for his glass of water but Josephine already has it for him."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Young Don Price shines his flashlight on Edward and a recap of earlier football baseball and basketball highlights reveals that Edward beats Don every time leaving Edward dumbstruck. With all the strength he can muster he turns and walks down the front steps while she stays in the doorway for a few beats feeling genuinely horrible for what is happened but eventually she goes back inside. Another beat passes then Don storms off and Sandra leans over Edward's broken body his head lying on the daffodils. As the music reaches a crescendo Edward reaches for his glass of water but Josephine already has it for him."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The young chef Brian waves his lantern at Harold, and a flashback of past chess, swimming, and golf highlights shows Harold outsmarts Brian every round, leaving Harold bewildered. With all the courage he can summon, he pivots and skips down the garden path while she lingers in the porchway for a few moments, feeling genuinely terrible for what's occurred, but eventually, she retreats inside. We guide Harold as he skips away, droplets just beginning to emerge, and he leaves the scene, leaving only the mansion in the distance. Harold hops back into the scene, gazing at the mansion, as we rotate and he hollers. Linda and her roommates peek out through the blinds while the quirky history lecturer resumes his monologue, but Linda isn't focusing much. He flicks on the desk lamp without glancing at it, eliciting a giggle from the audience, but he remains oblivious until a peer elbows Linda, who glances up and the lecturer finally acknowledges what's projected there. Strolling with her satchel, Linda nods to herself, incredulous, and we gaze up to the sunny heavens where a massive balloon-like star drifts in the breeze. At her roommates' urging, a freshly-awakened Linda glances out the attic window to discover the lawn populated with Harold standing amidst the plethora of blooms. Linda strides out to him, beaming, perplexed, elated, and frightened, and unexpectedly, a drop trickles down Linda's face. From up the avenue, the grown Archibald Swift arrives, 230 pounds of rugby-playing, Zeppelin-adoring, club-proud brawn, and he's furious. A posse of his comrades trail behind him, and Archibald clobbers him, toppling him over. Harold springs right back up but makes no attempt to shield himself, undeterred; Archibald punches him again, shrugs okay, then proceeds to wallop Harold's backside all week long, and as the beatdown progresses, we see Archibald Swift lounging in the parlor, reading the latest magazine, straining hard, trying to relax the unrelaxable. Abruptly, he clutches his throat and tumbles face-first onto the carpet, and the same image of Archibald's lifeless visage on the carpet is mirrored in The Reflection as the pummeling carries on. Harold somehow battles his way upright, braced to be toppled once more, and Archibald is about to wallop Harold again when he pivots as Linda removes her necklace. There's an audible GASP! from her roommates and an AHH! from Archibald's comrades, and Archibald stands dazed, his mind spinning. Harold, whose vision is nearly obscured, continues bracing for the ensuing blow as she offers him the necklace. Another heartbeat passes, then Archibald storms away, and Linda bends over Harold's battered form, his head resting on the tulips. As the symphony reaches a peak, Harold reaches for his cup of tea, but Emily already holds it for him."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Young Don Price exposes Edward as the superior athlete through sport highlights. Disheartened, Edward walks away, leaving the sorority house in the background. As Sandra peers through the curtains during class, an overhead projector snafu amuses the students. Later, a sky-written heart captures her attention. Awoken by her sisters, Sandra looks out to find Edward surrounded by flowers, making her smile through tears. Enraged, adult Don Price, with his fraternity brothers, confronts Edward and beats him. Despite the attack, Edward persists in standing up. Don, preparing another strike, halts as Sandra removes her engagement ring. The crowd reacts audibly as Don processes the shock. Defeated, Don leaves while Sandra tends to Edward, lying among the daffodils. At a musical peak, Edward reaches for water, but Josephine offers it to him first."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "As the music reaches a crescendo Edward reaches for his glass of water but Josephine already has it for him Another beat passes then Don storms off and Sandra leans over Edward's broken body his head lying on the daffodils  Edward whose eyes are swollen almost shut keeps waiting for the next punch as she hands him the ring  There's an audible AHH from her sisters and an OHH from Don's brothers and Don stands stunned his mind reeling  Edward somehow fights his way back to his feet ready to be knocked down again and Don is about to slug Edward again when he turns as Sandra pulls off her engagement ring  Suddenly he grasps his chest and collapses facefirst on the tile and the same image of Don's dead face on the tile is reflected in The Eye as the thrashing continues  nine ways to Sunday and as the asswhupping continues we see Don Price sitting on the can pinching a loaf while reading the new Playboy squeezing down hard trying to shit the unshittable  Don slugs him again shrugs fine then proceeds to kick Edward's ass  Edward gets right back up but makes no move to defend himself unfazed  A gang of his brothers walk behind him and Don Price decks him knocking him down  Skynyrdloving fraternityproud muscle and he's pissed  From down the street the adult Don Price arrives 230 pounds of footballplaying  Sandra walks out to him smiling confused joyful and scared and out of nowhere a tear drops down Sandra's cheek  At her sisters' prompting a justwoken Sandra looks out the secondstory window to find the lawn filled with Edward standing amid the sea of flowers  Walking with her books Sandra shakes her head disbelieving and we look up to the blue sky where a giant skywritten heart floats in the wind  He switches on the overhead projector without looking at it causing a titter from the students but he doesn't notice until a classmate nudges Sandra who looks up and the professor finally notices what's written there  Sandra and her sisters peer out through the curtains while the tweedy economics professor continues his explanation but Sandra isn't paying a lot of attention  Edward steps back into the frame looking at the sorority house as we circle and he shouts  We lead Edward as he walks away tears just starting to form and he exits the frame leaving only the sorority house in the background  With all the strength he can muster he turns and walks down the front steps while she stays in the doorway for a few beats feeling genuinely horrible for what's happened but eventually she goes back inside  Young Don Price shines his flashlight on Edward and a recap of earlier football baseball and basketball highlights reveals that Edward beats Don every time leaving Edward dumbstruck "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "With all the strength he can muster he turns and walks down the front steps while she stays in the doorway for a few beats feeling genuinely horrible for what is happened but eventually she goes back inside Young Don Price shines his flashlight on Edward and a recap of earlier football baseball and basketball highlights reveals that Edward beats Don every time leaving Edward dumbstruck Edward steps back into the frame looking at the sorority house as we circle and he shouts We lead Edward as he walks away tears just starting to form and he exits the frame leaving only the sorority house in the background He switches on the overhead projector without looking at it causing a titter from the students but he does not notice until a classmate nudges Sandra who looks up and the professor finally notices what is written there Sandra and her sisters peer out through the curtains while the tweedy economics professor continues his explanation but Sandra is not paying a lot of attention At her sisters' prompting a justwoken Sandra looks out the secondstory window to find the lawn filled with Edward standing amid the sea of flowers Walking with her books Sandra shakes her head disbelieving and we look up to the blue sky where a giant skywritten heart floats in the wind From down the street the adult Don Price arrives 230 pounds of footballplaying Skynyrdloving fraternityproud muscle and he is pissed Sandra walks out to him smiling confused joyful and scared and out of nowhere a tear drops down Sandra's cheek Edward gets right back up but makes no move to defend himself unfazed A gang of his brothers walk behind him and Don Price decks him knocking him down Suddenly he grasps his chest and collapses facefirst on the tile and the same image of Don's dead face on the tile is reflected in The Eye as the thrashing continues Don slugs him again shrugs fine then proceeds to kick Edward's ass nine ways to Sunday and as the asswhupping continues we see Don Price sitting on the can pinching a loaf while reading the new Playboy squeezing down hard trying to shit the unshittable There is an audible AHH from her sisters and an OHH from Don's brothers and Don stands stunned his mind reeling Edward somehow fights his way back to his feet ready to be knocked down again and Don is about to slug Edward again when he turns as Sandra pulls off her engagement ring Another beat passes then Don storms off and Sandra leans over Edward's broken body his head lying on the daffodils Edward whose eyes are swollen almost shut keeps waiting for the next punch as she hands him the ring As the music reaches a crescendo Edward reaches for his glass of water but Josephine already has it for him"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "A gang of his brothers walk behind him and Don Price decks him knocking him down  Edward gets right back up but makes no move to defend himself unfazed  Don slugs him again shrugs fine then proceeds to kick Edward's ass  nine ways to Sunday and as the asswhupping continues we see Don Price sitting on the can pinching a loaf while reading the new Playboy squeezing down hard trying to shit the unshittable  Suddenly he grasps his chest and collapses facefirst on the tile and the same image of Don's dead face on the tile is reflected in The Eye as the thrashing continues  Edward somehow fights his way back to his feet ready to be knocked down again and Don is about to slug Edward again when he turns as Sandra pulls off her engagement ring  There's an audible AHH from her sisters and an OHH from Don's brothers and Don stands stunned his mind reeling  Edward whose eyes are swollen almost shut keeps waiting for the next punch as she hands him the ring  Another beat passes then Don storms off and Sandra leans over Edward's broken body his head lying on the daffodils  As the music reaches a crescendo Edward reaches for his glass of water but Josephine already has it for him Young Don Price shines his flashlight on Edward and a recap of earlier football baseball and basketball highlights reveals that Edward beats Don every time leaving Edward dumbstruck  With all the strength he can muster he turns and walks down the front steps while she stays in the doorway for a few beats feeling genuinely horrible for what's happened but eventually she goes back inside  We lead Edward as he walks away tears just starting to form and he exits the frame leaving only the sorority house in the background  Edward steps back into the frame looking at the sorority house as we circle and he shouts  Sandra and her sisters peer out through the curtains while the tweedy economics professor continues his explanation but Sandra isn't paying a lot of attention  He switches on the overhead projector without looking at it causing a titter from the students but he doesn't notice until a classmate nudges Sandra who looks up and the professor finally notices what's written there  Walking with her books Sandra shakes her head disbelieving and we look up to the blue sky where a giant skywritten heart floats in the wind  At her sisters' prompting a justwoken Sandra looks out the secondstory window to find the lawn filled with Edward standing amid the sea of flowers  Sandra walks out to him smiling confused joyful and scared and out of nowhere a tear drops down Sandra's cheek  From down the street the adult Don Price arrives 230 pounds of footballplaying  Skynyrdloving fraternityproud muscle and he's pissed "
        }
      ]
    }
  ]
}