{
  "ground_truth": "She watches him while he slowly drinks the entire glass, thirstier than he imagined. While he's drinking, Will, back from the grocery store, reaches the top of the stairs. He hears voices coming from the bedroom. Will quietly approaches the door, not exactly sneaking, but not exactly announcing his presence. The door is open a few inches, letting him look in on his father and his wife. In the hallway, Will shifts to a new position, letting himself listen to the story one more time. Bruised and bandaged, Edward sorts through a big bag of mail with help from Sandra. He rips open an official-looking letter. Reading it, his face drops. FLUTE and DRUM, music rising to a military cadence. With a buzz cut and paratrooper gear, Edward squats with a dozen other SOLDIERS. The noise of the ENGINES is deafening, but Edward is engrossed in an Asian phrasebook. The JUMP LEADER yells. One by one the men jump out, their chutes clipped to a main line. When his time comes, Edward leaps. Looking down, he can see the white parachutes disappearing into the darkness. It finally POPS. Edward jumps from the plane. A THOUSAND CHINESE SOLDIERS sit, bored, watching the equivalent of a U.S.O. show. A CHINESE VENTRILOQUIST is on stage with his Communist puppet. We have no idea what they're saying to each other, but every act is fundamentally the same. The EMCEE comes on to usher him off the stage before he's finished. The Ventriloquist protests, but finally gives in. We LOOK DOWN with Edward, who is drifting right for the stage. He can't steer. He's helpless. The lights go out as a DRUM ROLL begins. He lands with a CLANG on the lighting catwalk above the stage. He barely grabs on, disconnecting his chute just as the curtain goes up. The curtain rises to reveal PING (27) at a microphone. She's as gorgeous a woman as you'll ever see. She stands with her hips turned in profile. Her body is a knockout, dress cut to reveal skin. The soldiers are on their feet, WHISTLING and HOLLERING. UP ON THE CATWALK, Edward is surprised by an ENEMY SOLDIER. The two men begin to SCUFFLE. Ping sings melody while an off-stage voice carries perfect harmony. Ping HUFFS, turning her back on her sister. Jing reaches deeper into the closet to find a new dress, exposing Edward's hiding place. She GASPS. Ping turns to look. Jing grabs her, a hand over her mouth, but it's too late. A rifle-toting GUARD looks in. Pretending to be her bitchy sister, the guard obeys. Ping shakes her sister off. Edward pulls a photo out of his flak jacket. Even Ping is a little affected.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She observes him while he gradually sips the whole glass, thirstier than he envisioned. While he's sipping, Will, returned from the grocery store, attains the top of the steps. He perceives voices coming from the bedroom. Will quietly nears the door, not exactly sneaking, but not precisely declaring his presence. The door is ajar a few inches, allowing him to peer in on his father and his wife. In the corridor, Will shifts to a fresh position, allowing himself to listen to the tale once more. Bruised and bandaged, Edward sifts through a large sack of mail with assistance from Sandra. He tears open an official-looking letter. Perusing it, his visage drops. FLUTE and DRUM, music elevating to a military tempo. With a buzz cut and paratrooper attire, Edward crouches with a dozen other TROOPS. The clamor of the ENGINES is earsplitting, but Edward is absorbed in an Asian language book. The JUMP LEADER shouts. One by one the men leap out, their canopies clipped to a main line. When his moment arrives, Edward bounds. Gazing downward, he can discern the white parachutes vanishing into the obscurity. It ultimately POPS. Edward jumps from the aircraft. A THOUSAND CHINESE TROOPS sit, bored, observing the counterpart of a U.S.O. show. A CHINESE VENTRILOQUIST is on stage with his Communist puppet. We have no notion what they're communicating to each other, but every act is essentially the same. The EMCEE appears to usher him off the stage before he's completed. The Ventriloquist objects, but eventually relents. We LOOK DOWN with Edward, who is gliding right for the stage. He can't maneuver. He's powerless. The lights extinguish as a DRUM ROLL commences. He lands with a CLANG on the lighting catwalk above the stage. He scarcely seizes on, detaching his chute just as the curtain ascends. The curtain lifts to unveil PING (27) at a microphone. She's as alluring a woman as you'll ever witness. She stands with her hips turned in silhouette. Her form is a stunner, gown cut to expose skin. The troops are on their feet, WHISTLING and HOLLERING. UP ON THE CATWALK, Edward is surprised by an ADVERSARY SOLDIER. The two men commence to TUSSLE. Ping sings melody while an off-stage voice conveys flawless harmony. Ping PUFFS, turning her back on her sister. Jing reaches deeper into the wardrobe to find a new gown, revealing Edward's hiding place. She GASPS. Ping turns to glance. Jing seizes her, a hand over her mouth, but it's too late. A rifle-toting GUARD peers in. Pretending to be her moody sister, the guard complies. Ping shakes her sister off. Edward pulls a snapshot out of his flak jacket. Even Ping is slightly moved."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "She is watched by him while the entire glass is slowly drunk by him, thirstier than he imagined. While the glass is being drunk, Will, back from the grocery store, reaches the top of the stairs. Voices come from the bedroom, which are heard by him. The door is quietly approached by Will, not exactly sneaking, but not exactly announcing his presence. A few inches open, the door lets him look in on his father and his wife. In the hallway, a new position is shifted to by Will, allowing the story to be listened to by him one more time. Bruised and bandaged, a big bag of mail is sorted through by Edward with help from Sandra. An official-looking letter is ripped open by him. Reading it, his face drops. FLUTE and DRUM, music rising to a military cadence. With a buzz cut and paratrooper gear, Edward squats with a dozen other SOLDIERS. The deafening noise of the ENGINES engrosses Edward in an Asian phrasebook. The JUMP LEADER yells. One by one, out jump the men, their chutes clipped to a main line. When his time arrives, he leaps. Looking down, the white parachutes are seen by him disappearing into the darkness. It finally POPS. The plane is jumped from by Edward. A THOUSAND CHINESE SOLDIERS sit, bored, watching the equivalent of a U.S.O. show. A CHINESE VENTRILOQUIST is on stage with his Communist puppet. We have no idea what they say to each other, but every act fundamentally remains the same. The EMCEE comes on and ushers him off the stage before he finishes. The Ventriloquist protests, but finally gives in. We look down with Edward, who drifts right for the stage. Steering is impossible for him. Helplessness overwhelms him. A DRUM ROLL begins as the lights go out. With a CLANG, he lands on the lighting catwalk above the stage. A barely made grab disconnects his chute as the curtain goes up. PING (27) is revealed at a microphone as the curtain rises. As gorgeous a woman as you'll ever see, she stands with her hips turned in profile. Her body is a knockout, with the dress cut to reveal skin. WHISTLING and HOLLERING, the soldiers are on their feet. UP ON THE CATWALK, Edward is surprised by an ENEMY SOLDIER. The two men SCUFFLE. Ping sings a melody while an off-stage voice carries perfect harmony. Her back is turned on her sister by Ping, who HUFFS. Jing reaches deeper into the closet, finding a new dress and exposing Edward's hiding place. A GASP is emitted by her. Ping turns to look. Jing grabs her, a hand over her mouth, but it's too late. A rifle-toting GUARD looks in. The guard obeys, pretending to be her bitchy sister. Ping shakes her sister off. A photo is pulled out of his flak jacket by Edward. Even Ping is a little affected."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "She watches him drink the glass slowly, thirstier than expected. As he drinks, Will returns from the store and hears voices from the bedroom. He quietly moves to the door, which is slightly ajar, and looks in on his father and wife. In the hallway, he listens to their story again. Bruised and bandaged, Edward sorts mail with Sandra's help and opens an official letter, his face dropping. FLUTE and DRUM music swell to a military beat as Edward, with a buzz cut and paratrooper gear, squats with other SOLDIERS. Engine noise is deafening, but Edward focuses on an Asian phrasebook. The JUMP LEADER yells, and one by one, the men jump, their chutes clipped to a main line. When it's Edward's turn, he leaps, watching the white parachutes vanish into darkness before his opens. He jumps from the plane over spectators watching a U.S.O.-like show featuring a CHINESE VENTRILOQUIST and puppet. The EMCEE ushers him off stage mid-act. Edward drifts helplessly towards the stage as the lights dim and a DRUM ROLL starts. He lands with a CLANG on the catwalk above, barely grabbing on and disconnecting his chute as the curtain rises, revealing PING (27) at a microphone, stunning in a revealing dress. Soldiers whistle and holler. On the CATWALK, Edward is confronted by an ENEMY SOLDIER, and they SCUFFLE. Ping sings, while an off-stage voice harmonizes. Ping turns her back on her sister, Jing, who finds Edward's hiding spot. She GASPS, causing Ping to look. Jing covers her mouth, but it's too late—a rifle-toting GUARD enters. Pretending to be her sister, Ping shakes Jing off. Edward shows a photo from his flak jacket, even affecting Ping."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "She watches him drink the entire glass, thirstier than he thought. Will, back from the grocery store, reaches the top of the stairs, hearing bedroom voices. He approaches the door, not sneakily but not announcing himself. The door is ajar, letting him see his father with his wife. Will listens to the story again. Bruised, Edward sorts mail with Sandra, opens an official letter, and his face drops. FLUTE and DRUM music rise to military cadence. In paratrooper gear, Edward squats with soldiers, engrossed in a phrasebook. The JUMP LEADER yells; men jump out, chutes clipped to a line. Edward jumps, seeing parachutes vanish into darkness. He exits the plane. CHINESE SOLDIERS watch a U.S.O.-like show with a Ventriloquist and puppet. They converse unknowingly. The EMCEE ushers him off stage. Edward drifts helplessly to the stage, landing on the catwalk, barely grabbing on and disconnecting his chute as the curtain rises, revealing PING (27), a stunning woman. Soldiers WHISTLE and HOLLER. Up on the CATWALK, Edward scuffles with an ENEMY SOLDIER. Ping sings while an off-stage voice harmonizes. Ping turns away from her sister, who exposes Edward's hiding spot. Jing GASPS. Ping turns; Jing tries to silence her, but a GUARD looks in. Pretending to be her sister, the guard obeys. Edward shows a photo, affecting even Ping."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "She keenly observes him, focusing intently on his every move, as he slowly sips the entire glass of water, evidently thirstier than he had initially imagined. As he drinks, Will, who has just returned from his trip to the grocery store, makes his way to the top of the stairs. From there, he becomes aware of voices drifting out from the bedroom. Will cautiously advances towards the door; he is not exactly sneaking, nor is he deliberately announcing his arrival. The door is slightly ajar, open by just a few inches, permitting him an unobstructed view of his father and his wife inside the room. Standing in the hallway, Will adjusts his position slightly, allowing himself to listen intently to the story once again. \n\nEdward, who appears both bruised and bandaged, is sorting through a large bag of mail with assistance from Sandra. He rips open a letter that appears official and important. As he reads the letter, his expression changes noticeably, his face falling. Suddenly, the sound of a FLUTE and DRUM begins to play, rising to a military-like cadence. Now, with a buzz cut and dressed in full paratrooper gear, Edward squats alongside a dozen other SOLDIERS. The roar of the ENGINES is nearly deafening, but Edward is completely absorbed in an Asian phrasebook. The JUMP LEADER shouts instructions. One by one, the men dive out, their parachutes securely clipped to a main line. When it’s Edward's turn, he jumps. Looking down, he sees the white parachutes vanishing into the darkness below. Finally, his parachute POPS open. Edward leaps from the plane, and below him, a THOUSAND CHINESE SOLDIERS sit idly, seemingly bored, as they watch a show reminiscent of a U.S.O. performance. On stage is a CHINESE VENTRILOQUIST with his Communist puppet. Although the dialogue between them is a mystery, each act follows a similar, predictable pattern.\n\nThe EMCEE steps on stage to usher the ventriloquist off before the act is complete. Although the ventriloquist protests, he eventually concedes. From his vantage point, Edward looks down, noticing that he is drifting dangerously close towards the stage itself. Frustratingly, he cannot steer, leaving him completely helpless in the air. As a DRUM ROLL begins, the lights dim, and he lands with a loud CLANG on the lighting catwalk positioned above the stage. He manages to secure his grip just in time, quickly detaching his chute as the curtain rises. Behind the curtain stands PING (27), captivating at the microphone. She is as stunning a woman as one could ever encounter, standing with her hips turned slightly in profile. Her body is extraordinary, accentuated by a dress designed to reveal skin. \n\nThe soldiers below are immediately on their feet, WHISTLING and HOLLERING in appreciation. Meanwhile, UP ON THE CATWALK, Edward is taken by surprise when confronted by an ENEMY SOLDIER, leading to an unexpected SCUFFLE between the two men. While this unfolds, Ping continues to sing the melody, harmonizing perfectly with an off-stage voice. Frustrated, Ping turns her back on her sister. Meanwhile, Jing searches deeper into the closet, looking for a new dress and inadvertently exposing Edward's hiding spot. She GASPS in shock. Ping turns around to see what has caught her sister's attention. Jing quickly grabs her sister, covering her mouth, but the action is in vain. A rifle-toting GUARD peeks in, pretending to be her sarcastic sister. The guard complies. Ping impatiently shakes her sister off. Edward retrieves a photo from his flak jacket, and even Ping appears somewhat affected by it."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "She observes him with keen interest, focusing intently on each and every move he makes as he slowly sips the entire glass of water. It becomes evident that he is thirstier than he had initially imagined. Meanwhile, Will, who has just returned from an eventful trip to the grocery store, makes his way up to the top of the stairs. From this vantage point, he begins to notice voices drifting out from the direction of the bedroom. Will cautiously moves towards the door, neither sneaking around nor deliberately announcing his arrival. The door is slightly ajar, left open by just a few inches, which permits him an unobstructed view of his father and his wife inside the room. Standing there in the hallway, Will adjusts his position slightly, allowing himself to listen intently to the story being recounted once again.\n\nInside the room, Edward, who appears both bruised and bandaged, is busily sorting through a large bag of mail with the assistance of Sandra. He rips open a letter that appears to be official and important. As he reads through this significant letter, his expression changes noticeably, his face falling in response. Suddenly, the sound of a FLUTE and DRUM begins to play, rising to a compelling military-like cadence. Now, Edward, sporting a buzz cut and dressed in full paratrooper gear, squats alongside a dozen other SOLDIERS. The deafening roar of the ENGINES is nearly overwhelming, but Edward remains completely absorbed in an Asian phrasebook. The JUMP LEADER shouts instructions, and one by one, the men dive out of the plane, their parachutes securely clipped to a main line. When Edward's turn comes, he jumps. Looking down, he observes the white parachutes vanishing into the darkness below. At last, his parachute POPS open. As Edward leaps from the plane, he sees below him a gathering of a THOUSAND CHINESE SOLDIERS who sit idly, seemingly bored, while watching a show reminiscent of a U.S.O. performance. On stage stands a CHINESE VENTRILOQUIST with his Communist puppet. Though the dialogue between them remains a mystery, each act follows a similar, predictable pattern.\n\nThe EMCEE steps onto the stage to usher the ventriloquist off before his act is complete. Although the ventriloquist protests, he eventually concedes and leaves. From his lofty vantage point, Edward looks down, noticing with growing concern that he is drifting dangerously close towards the stage itself. Frustratingly, he finds that he cannot steer, leaving him completely helpless in the air. As a DRUM ROLL begins, the lights dim, and he lands with a loud CLANG on the lighting catwalk positioned above the stage. He manages to secure his grip just in time and quickly detaches his chute as the curtain begins to rise. Behind the curtain stands PING, who is 27, captivating the audience at the microphone. She is as stunning a woman as one might ever encounter, standing with her hips turned slightly in profile. Her body is extraordinary, accentuated by a dress designed to reveal skin in a striking manner.\n\nThe soldiers below are immediately on their feet, WHISTLING and HOLLERING in thrilled appreciation. Meanwhile, UP ON THE CATWALK, Edward is taken by surprise when he is confronted by an ENEMY SOLDIER, resulting in an unexpected SCUFFLE between the two men. While this unfolds above, Ping continues to deliver the melody, harmonizing perfectly with an off-stage voice. Frustrated by the situation, Ping turns her back on her sister, Jing, who is searching deeper into the closet, looking for a new dress and inadvertently exposing Edward's hiding spot. She GASPS in shock. Ping turns around to see what has captured her sister's attention. Jing quickly grabs her sister, covering her mouth, but the action is in vain. A rifle-toting GUARD peeks in, pretending to be her sarcastic sister. The guard complies, but Ping impatiently shakes her sister off. Edward retrieves a photo from his flak jacket, and even Ping seems somewhat affected by it."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "She fixes her gaze on him as he slowly raises the glass to his lips, drinking deeply and steadily, seemingly thirstier than he had anticipated. As he continues to drink, Will returns from the grocery store and makes his way up the steps, reaching the top of the stairs. Pausing briefly, he hears the sound of voices filtering from the direction of the bedroom. Moving cautiously yet deliberately, Will approaches the bedroom door with a sense of curiosity, neither fully sneaking nor openly announcing his arrival. The door sits ajar, offering him a slight but clear view into the room where he sees his father accompanied by his wife. In the hallway, Will adjusts his position slightly to better hear the familiar story being recounted once more. Inside, Edward, revealing bruises and bandages, goes through a large bag of mail with the assistance of Sandra. He tears open an official-looking letter, and as he reads its contents, his facial expression shifts noticeably to one of dismay. The sound of FLUTE and DRUM music rises, building to a rhythmic military cadence. Suddenly, the scene transitions to Edward, now with a buzz cut and clad in paratrooper gear, squatting alongside a dozen other soldiers. The roar of airplane engines fills the air, a deafening backdrop to the scene, while Edward remains absorbed in studying a phrasebook written in an Asian language. The JUMP LEADER shouts a command, prompting each soldier to leap from the aircraft one by one, their parachutes securely clipped to a main line. When Edward's turn arrives, he leaps boldly from the plane, looking down to see a sea of white parachutes vanishing into the night below. After a tense moment, his own parachute finally deploys with a POP. Edward makes his descent from the aircraft, floating above a gathering of a thousand Chinese soldiers, who sit watching a U.S.O.-equivalent show, their expressions bored. On stage, a Chinese ventriloquist performs with a Communist puppet, the dialogue unintelligible yet familiar in its structure. The EMCEE takes the stage to usher the ventriloquist off, despite his protests, which eventually subside as he leaves. From Edward’s perspective above, he drifts uncontrollably toward the stage, unable to steer himself. The lights go out, and a DRUM ROLL fills the silence. With a metallic CLANG, Edward lands on the lighting catwalk high above the stage, clutching it tightly and urgently disconnecting his parachute just as the curtain begins to lift. As the curtain rises, PING, a stunning woman of 27, stands at a microphone, her hips provocatively turned in profile, her dress skillfully designed to reveal patches of skin. The gathered soldiers leap to their feet, WHISTLING and HOLLERING in appreciation. Meanwhile, up on the catwalk, Edward is caught off guard by an ENEMY SOLDIER, and the two men engage in a sudden SCUFFLE. Below, Ping sings a melody while an off-stage voice provides flawless harmony. Ping, now visibly irritated, huffs and turns her back on her sister. Jing, in search of a new dress, rummages deeper into the closet, inadvertently exposing Edward's hiding spot. She GASPS in surprise, causing Ping to turn and look. Jing quickly covers Ping's mouth with her hand in an attempt to keep her silent, but it's already too late. A GUARD bearing a rifle peers into the room. In an effort to maintain the pretense, Jing adopts the demeanor of her irritable sister, prompting the guard to comply. Ping then shakes off Jing's grasp. Edward, seizing the moment, retrieves a photograph from his flak jacket, revealing an image that even causes Ping to momentarily pause, her expression softening slightly in response."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "She observes him as he drinks an entire glass, thirstier than expected. Meanwhile, Will returns from the grocery store and reaches the top of the stairs, intrigued by the voices coming from the bedroom. He quietly approaches the slightly open door, positioning himself to overhear the story once more. Inside, Edward, who is bruised and bandaged, sorts through a large bag of mail with Sandra's assistance, opening an official-looking letter that visibly dismays him. Transitioning to a military scene, Edward, now with a buzz cut and paratrooper gear, squats among other soldiers, engrossed in an Asian phrasebook amid deafening engine noise. As the jump leader signals, they leap in succession, and Edward follows, watching parachutes vanish into darkness until his deploys. Below, a thousand Chinese soldiers watch a U.S.O. show-like performance with a ventriloquist and his puppet. Edward, unable to steer, lands with a clang on the catwalk above the stage as the curtain rises, revealing the stunning Ping at a microphone. The soldiers cheer while Edward, surprised by an enemy soldier, scuffles on the catwalk. Below, Ping and her sister Jing clash during their performance, inadvertently exposing Edward. As Jing gasps, Ping looks, and a rifle-toting guard investigates, but is deceived by Jing's impersonation of her sister. Edward, pulling a photo from his flak jacket, momentarily affects even Ping."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She watches him while he slowly drinks the entire glass, thirstier than he imagined, perhaps because the heat outside was relentless that day. While he's drinking, Will, back from the grocery store with bags full of essentials and snacks for the week, reaches the top of the stairs. He hears voices coming from the bedroom. Will quietly approaches the door, not exactly sneaking, but not exactly announcing his presence. The door is open a few inches, letting him look in on his father and his wife. In the hallway, Will shifts to a new position, letting himself listen to the story one more time. Bruised and bandaged from a recent accident that left him hospitalized, Edward sorts through a big bag of mail with help from Sandra. He rips open an official-looking letter, its typeface and seal indicating it's from a government agency. Reading it, his face drops. Flute and drum, music rising to a military cadence, echo the sounds of his past service. With a buzz cut and paratrooper gear, Edward squats with a dozen other soldiers preparing for a significant mission during the Korean War. The noise of the engines is deafening, but Edward is engrossed in an Asian phrasebook he hopes will help him communicate if needed. The jump leader yells. One by one, the men jump out, their chutes clipped to a main line, a critical safety measure to prevent mid-air collisions. When his time comes, Edward leaps. Looking down, he can see the white parachutes disappearing into the darkness, a symbol of their silent descent into unknown territory. It finally pops open. Edward jumps from the plane, his training taking over. A thousand Chinese soldiers sit, bored, watching the equivalent of a U.S.O. show that aims to boost morale. A Chinese ventriloquist is on stage with his Communist puppet, a popular form of entertainment used to subtly endorse party messages. We have no idea what they're saying to each other, but every act is fundamentally the same. The emcee comes on to usher him off the stage before he's finished, adhering to a tight schedule. The ventriloquist protests, but finally gives in. We look down with Edward, who is drifting right for the stage, unable to control his descent due to strong winds. He can't steer. He's helpless. The lights go out as a drum roll begins. He lands with a clang on the lighting catwalk above the stage, narrowly avoiding detection. He barely grabs on, disconnecting his chute just as the curtain goes up. The curtain rises to reveal Ping, 27, at a microphone. She's as gorgeous a woman as you'll ever see, a renowned performer known throughout the region for her captivating voice. She stands with her hips turned in profile. Her body is a knockout, dress cut to reveal skin. The soldiers are on their feet, whistling and hollering, captivated by her allure. Up on the catwalk, Edward is surprised by an enemy soldier, who likely had been assigned to guard the stage area. The two men begin to scuffle. Ping sings melody while an off-stage voice carries perfect harmony, showcasing the sisters' well-rehearsed act. Ping huffs, turning her back on her sister. Jing reaches deeper into the closet to find a new dress, exposing Edward's hiding place, a secret compartment behind a false panel. She gasps, startled by the unexpected discovery. Ping turns to look. Jing grabs her, a hand over her mouth, but it's too late. A rifle-toting guard looks in. Pretending to be her bitchy sister, the guard obeys her commands, recognizing her authority due to her familial ties. Ping shakes her sister off. Edward pulls a photo out of his flak jacket, a cherished reminder of his loved ones back home. Even Ping is a little affected, sensing the depth of his emotion."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "She watches him while he slowly drinks the entire glass thirstier than he imagined. While he is drinking Will back from the grocery store reaches the top of the stairs. He hears voices coming from the bedroom. Will quietly approaches the door not exactly sneaking but not exactly announcing his presence. The door is open a few inches letting him look in on his father and his wife. In the hallway Will shifts to a new position letting himself listen to the story one more time. Bruised and bandaged Edward sorts through a big bag of mail with help from Sandra. He rips open an officiallooking letter. Reading it his face drops FLUTE and DRUM music rising to a military cadence. With a buzz cut and paratrooper gear Edward squats with a dozen other SOLDIERS. The noise of the ENGINES is deafening but Edward is engrossed in an Asian phrasebook. The JUMP LEADER yells. One by one. the men jump out their chutes clipped to a main line. When his time comes Edward leaps. Looking down he can see the white parachutes disappearing into the darkness. It finally POPS. Edward jumps from the plane. A THOUSAND CHINESE SOLDIERS sit bored watching the equivalent of a USO show. A CHINESE VENTRILOQUIST is on stage with his Communist puppet. We have no idea what they are saying to each other but every act is fundamentally the same. The EMCEE comes on to usher him off the stage before he is finished. The Ventriloquist protests but finally gives in. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. We LOOK DOWN with Edward who is drifting right for the stage. He cannot steer. He is helpless. The lights go out as a DRUM ROLL begins. He lands with a CLANG on the lighting catwalk above the stage. He barely grabs on disconnecting his chute just as the curtain goes up. The curtain rises to reveal PING 27 at a microphone. She is as gorgeous a woman as you will ever see. She stands with her hips turned in profile. Her body is a knockout dress cut to reveal skin. The soldiers are on their feet WHISTLING and HOLLERING UP ON THE CATWALK. Edward is surprised by an ENEMY SOLDIER. The two men begin to SCUFFLE. Ping sings melody while an offstage voice carries perfect harmony. Ping HUFFS turning her back on her sister. Jing reaches deeper into the closet to find a new dress exposing Edward's hiding place. She GASPS. Ping turns to look. Jing grabs her a hand over her mouth but it is too late. A rifletoting GUARD looks in. Pretending to be her bitchy sister the guard obeys. Ping shakes her sister off. Edward pulls a photo out of his flak jacket. Even Ping is a little affected."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "She watches him while he slowly drinks the entire glass thirstier than he imagined. While he is drinking Will back from the grocery store reaches the top of the stairs. He hears voices coming from the bedroom. Will quietly approaches the door not exactly sneaking but not exactly announcing his presence. The door is open a few inches letting him look in on his father and his wife. In the hallway Will shifts to a new position letting himself listen to the story one more time. Bruised and bandaged Edward sorts through a big bag of mail with help from Sandra. He rips open an officiallooking letter. Reading it his face drops FLUTE and DRUM music rising to a military cadence. With a buzz cut and paratrooper gear Edward squats with a dozen other SOLDIERS. The noise of the ENGINES is deafening but Edward is engrossed in an Asian phrasebook. The JUMP LEADER yells. One by one. the men jump out their chutes clipped to a main line. When his time comes Edward leaps. Looking down he can see the white parachutes disappearing into the darkness. It finally POPS. Edward jumps from the plane. A THOUSAND CHINESE SOLDIERS sit bored watching the equivalent of a USO show. A CHINESE VENTRILOQUIST is on stage with his Communist puppet. We have no idea what they are saying to each other but every act is fundamentally the same. The EMCEE comes on to usher him off the stage before he is finished. The Ventriloquist protests but finally gives in. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. We LOOK DOWN with Edward who is drifting right for the stage. He cannot steer. He is helpless. The lights go out as a DRUM ROLL begins. He lands with a CLANG on the lighting catwalk above the stage. He barely grabs on disconnecting his chute just as the curtain goes up. The curtain rises to reveal PING 27 at a microphone. She is as gorgeous a woman as you will ever see. She stands with her hips turned in profile. Her body is a knockout dress cut to reveal skin. The soldiers are on their feet WHISTLING and HOLLERING UP ON THE CATWALK. Edward is surprised by an ENEMY SOLDIER. The two men begin to SCUFFLE. Ping sings melody while an offstage voice carries perfect harmony. Ping HUFFS turning her back on her sister. Jing reaches deeper into the closet to find a new dress exposing Edward's hiding place. She GASPS. Ping turns to look. Jing grabs her a hand over her mouth but it is too late. A rifletoting GUARD looks in. Pretending to be her bitchy sister the guard obeys. Ping shakes her sister off. Edward pulls a photo out of his flak jacket. Even Ping is a little affected."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "She watches him while he slowly drinks the entire glass thirstier than he imagined. While he is drinking Will back from the grocery store reaches the top of the stairs. He hears voices coming from the bedroom. Will quietly approaches the door not exactly sneaking but not exactly announcing his presence. The door is open a few inches letting him look in on his father and his wife. In the hallway Will shifts to a new position letting himself listen to the story one more time. Bruised and bandaged Edward sorts through a big bag of mail with help from Sandra. He rips open an officiallooking letter. Reading it his face drops FLUTE and DRUM music rising to a military cadence. With a buzz cut and paratrooper gear Edward squats with a dozen other SOLDIERS. The noise of the ENGINES is deafening but Edward is engrossed in an Asian phrasebook. The JUMP LEADER yells. The two men begin to SCUFFLE. Ping sings melody while an offstage voice carries perfect harmony. Ping HUFFS turning her back on her sister. Jing reaches deeper into the closet to find a new dress exposing Edward's hiding place. She GASPS. Ping turns to look. Jing grabs her a hand over her mouth but it is too late. A rifletoting GUARD looks in. Pretending to be her bitchy sister the guard obeys. Ping shakes her sister off. Edward pulls a photo out of his flak jacket. Even Ping is a little affected."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "She watches him while he slowly drinks the entire glass thirstier than he imagined. While he is drinking Will back from the grocery store reaches the top of the stairs. He hears voices coming from the bedroom. Will quietly approaches the door not exactly sneaking but not exactly announcing his presence. The door is open a few inches letting him look in on his father and his wife. A rifletoting GUARD looks in. Pretending to be her bitchy sister the guard obeys. Ping shakes her sister off. Edward pulls a photo out of his flak jacket. Even Ping is a little affected."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Her cat observes the mouse while it lazily chews a giant cookie, hungrier than it expected. While the mouse is chewing, Doug, fresh from the theme park, descends into the basement. Doug overhears music drifting from the kitchen. Doug cautiously tiptoes to the window, not exactly tiptoeing, but not exactly throwing a parade. The window is ajar a few feet, allowing Doug to see his uncle and his grandmother. In the attic, Doug switches spots, allowing himself to listen to the tale yet again. Scratched and patched up, Gerald sorts through a small jar of coins with help from Lauren. He tears open a decorative envelope. Skimming it, his eyes widen. SAX and TRUMPET, sounds climbing to a festive tempo. With a mohawk and diving fins, Gerald crouches with a dozen other ATHLETES. The blaring of the SPEAKERS is overwhelming, but Gerald is engrossed in a French comic book. The COACH bellows. One by one the swimmers dive in, their goggles strapped on tightly. When his turn arrives, Gerald plunges. Peering below, he can see the blue water swallowing the divers. It eventually SWELLS. Gerald dives from the board. A HUNDRED JAPANESE STUDENTS lounge, disinterested, observing the version of a science fair exhibit. A JAPANESE MAGICIAN is performing with his Socialist hat. We have no clue what they're doing together, but each trick is essentially identical. The HOST appears to escort him off the platform before he's concluded. The Magician objects, but eventually relents. We GAZE UP with Gerald, who is gliding straight toward the platform. He can't navigate. He's powerless. The lights dim as a CYMBAL CRASH initiates. He touches down with a BANG on the scaffolding above the platform. He barely clutches on, releasing his goggles just as the curtain ascends. The curtain lifts to disclose MAY (27) at a podium. She's as striking a figure as you'll ever encounter. She stands with her shoulders angled in silhouette. Her frame is stunning, gown designed to reveal form. The students are off their seats, CHEERING and YELLING. UP ON THE SCAFFOLDING, Gerald is caught off guard by a RIVAL STUDENT. The pair begin to WRESTLE. May sings harmony while an unseen voice syncs up in perfect melody. May PUFFS, spinning away from her sibling. Fay reaches further under the bed to uncover a fresh outfit, exposing Gerald's hiding nook. She GASPS. May swivels to observe. Fay seizes her, a palm over her scream, yet it’s too late. A spear-carrying SENTINEL peers in. Pretending to be her rude sibling, the sentinel complies. May shrugs her sibling off. Gerald extracts a map out of his life jacket. Even May is somewhat moved."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Will quietly approaches the partially open bedroom door, overhearing a conversation between his father, Edward, and his wife, Sandra. Edward, bruised and bandaged, sifts through mail and finds a distressing letter. As military music plays, we transition to Edward, now a paratrooper preparing to jump from a plane. Amid deafening engines, Edward studies an Asian phrasebook. As soldiers jump, Edward follows, eventually landing on a lighting catwalk during a Chinese show. A ventriloquist finishes his act as Edward, unable to steer, lands above the stage. Ping, a stunning singer with her sister Jing, performs as Edward struggles with an enemy soldier on the catwalk. During a scuffle, Jing discovers Edward’s hiding spot but is too late to prevent a guard's attention. Ping, affected by Edward's photo, witnesses the unfolding chaos."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Even Ping is a little affected Edward pulls a photo out of his flak jacket Ping shakes her sister off Pretending to be her bitchy sister the guard obeys A rifletoting GUARD looks in Jing grabs her a hand over her mouth but it is too late Ping turns to look She GASPS Jing reaches deeper into the closet to find a new dress exposing Edward's hiding place Ping HUFFS turning her back on her sister Ping sings melody while an offstage voice carries perfect harmony The two men begin to SCUFFLE Edward is surprised by an ENEMY SOLDIER The soldiers are on their feet WHISTLING and HOLLERING UP ON THE CATWALK Her body is a knockout dress cut to reveal skin She stands with her hips turned in profile She is as gorgeous a woman as you will ever see The curtain rises to reveal PING 27 at a microphone He barely grabs on disconnecting his chute just as the curtain goes up He lands with a CLANG on the lighting catwalk above the stage The lights go out as a DRUM ROLL begins He is helpless He cannot steer We LOOK DOWN with Edward who is drifting right for the stage The Ventriloquist protests but finally gives in The EMCEE comes on to usher him off the stage before he is finished We have no idea what they are saying to each other but every act is fundamentally the same A CHINESE VENTRILOQUIST is on stage with his Communist puppet A THOUSAND CHINESE SOLDIERS sit bored watching the equivalent of a USO show Edward jumps from the plane It finally POPS Looking down he can see the white parachutes disappearing into the darkness When his time comes Edward leaps the men jump out their chutes clipped to a main line One by one The JUMP LEADER yells The noise of the ENGINES is deafening but Edward is engrossed in an Asian phrasebook With a buzz cut and paratrooper gear Edward squats with a dozen other SOLDIERS Reading it his face drops FLUTE and DRUM music rising to a military cadence He rips open an officiallooking letter Bruised and bandaged Edward sorts through a big bag of mail with help from Sandra In the hallway Will shifts to a new position letting himself listen to the story one more time The door is open a few inches letting him look in on his father and his wife Will quietly approaches the door not exactly sneaking but not exactly announcing his presence He hears voices coming from the bedroom While he is drinking Will back from the grocery store reaches the top of the stairs She watches him while he slowly drinks the entire glass thirstier than he imagined"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "While he is drinking Will back from the grocery store reaches the top of the stairs She watches him while he slowly drinks the entire glass thirstier than he imagined Will quietly approaches the door not exactly sneaking but not exactly announcing his presence He hears voices coming from the bedroom In the hallway Will shifts to a new position letting himself listen to the story one more time The door is open a few inches letting him look in on his father and his wife He rips open an officiallooking letter Bruised and bandaged Edward sorts through a big bag of mail with help from Sandra With a buzz cut and paratrooper gear Edward squats with a dozen other SOLDIERS Reading it his face drops FLUTE and DRUM music rising to a military cadence The JUMP LEADER yells The noise of the ENGINES is deafening but Edward is engrossed in an Asian phrasebook the men jump out their chutes clipped to a main line One by one Looking down he can see the white parachutes disappearing into the darkness When his time comes Edward leaps Edward jumps from the plane It finally POPS A CHINESE VENTRILOQUIST is on stage with his Communist puppet A THOUSAND CHINESE SOLDIERS sit bored watching the equivalent of a YOUSO show The EMCEE comes on to usher him off the stage before he is finished We have no idea what they are saying to each other but every act is fundamentally the same We LOOK DOWN with Edward who is drifting right for the stage The Ventriloquist protests but finally gives in He is helpless He cannot steer He lands with a CLANG on the lighting catwalk above the stage The lights go out as a DRUM ROLL begins The curtain rises to reveal PING 27 at a microphone He barely grabs on disconnecting his chute just as the curtain goes up She stands with her hips turned in profile She is as gorgeous a woman as you will ever see The soldiers are on their feet WHISTLING and HOLLERING UP ON THE CATWALK Her body is a knockout dress cut to reveal skin The two men begin to SCUFFLE Edward is surprised by an ENEMY SOLDIER Ping HUFFS turning her back on her sister Ping sings melody while an offstage voice carries perfect harmony She GASPS Jing reaches deeper into the closet to find a new dress exposing Edward's hiding place Jing grabs her a hand over her mouth but it is too late Ping turns to look Pretending to be her bitchy sister the guard obeys A rifletoting GUARD looks in Edward pulls a photo out of his flak jacket Ping shakes her sister off Even Ping is a little affected"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He cannot steer He is helpless The lights go out as a DRUM ROLL begins He lands with a CLANG on the lighting catwalk above the stage He barely grabs on disconnecting his chute just as the curtain goes up The curtain rises to reveal PING 27 at a microphone She is as gorgeous a woman as you will ever see She stands with her hips turned in profile Her body is a knockout dress cut to reveal skin The soldiers are on their feet WHISTLING and HOLLERING UP ON THE CATWALK Edward is surprised by an ENEMY SOLDIER The two men begin to SCUFFLE Ping sings melody while an offstage voice carries perfect harmony Ping HUFFS turning her back on her sister Jing reaches deeper into the closet to find a new dress exposing Edward's hiding place She GASPS Ping turns to look Jing grabs her a hand over her mouth but it is too late A rifletoting GUARD looks in Pretending to be her bitchy sister the guard obeys Ping shakes her sister off Edward pulls a photo out of his flak jacket Even Ping is a little affected She watches him while he slowly drinks the entire glass thirstier than he imagined While he is drinking Will back from the grocery store reaches the top of the stairs He hears voices coming from the bedroom Will quietly approaches the door not exactly sneaking but not exactly announcing his presence The door is open a few inches letting him look in on his father and his wife In the hallway Will shifts to a new position letting himself listen to the story one more time Bruised and bandaged Edward sorts through a big bag of mail with help from Sandra He rips open an officiallooking letter Reading it his face drops FLUTE and DRUM music rising to a military cadence With a buzz cut and paratrooper gear Edward squats with a dozen other SOLDIERS The noise of the ENGINES is deafening but Edward is engrossed in an Asian phrasebook The JUMP LEADER yells One by one the men jump out their chutes clipped to a main line When his time comes Edward leaps Looking down he can see the white parachutes disappearing into the darkness It finally POPS Edward jumps from the plane A THOUSAND CHINESE SOLDIERS sit bored watching the equivalent of a USO show A CHINESE VENTRILOQUIST is on stage with his Communist puppet We have no idea what they are saying to each other but every act is fundamentally the same The EMCEE comes on to usher him off the stage before he is finished The Ventriloquist protests but finally gives in We LOOK DOWN with Edward who is drifting right for the stage"
        }
      ]
    }
  ]
}