{
  "ground_truth": "The man is none other than. The men shake, disbelieving this lucky coincidence. He's genuinely proud. Reaching the front of the line, Norther pulls two pistols out of his coat, firing both into the ceiling. Screams all around. The skinny security guard makes a halfhearted reach for his gun, but Norther waves him off. The guard takes out his gun and slides it over. The teller woman nods. Angle on Edward, not sure what to do. He has a gun, but he truly doesn't want to shoot Norther. The teller woman is already waving him to the back. He decides he better go. The teller woman is crying as she works the combination. Edward feels horrible. She pulls open the vault door. The inner sanctum of the Horizon Savings and Loan holds exactly one folding chair. Edward winces, but doesn't say anything yet. He rips it open, revealing just a little cash inside. Even some dimes and pennies. Caught, Edward has to confess. Edward continues his narration. Norther leans in the driver's side window. Edward looks over at Norther, the reality sinking in. The two men wave at each other as Edward drives off. At the last moment, Norther calls out. Sandra is watering the garden. Will (5) runs past her to greet Edward, just returned from another trip. We reveal the Bloom house, the nicest one in the neighborhood. Bubbles rise from his nose for a few beats, then stop. It's quiet, except for the distant splashing of water from the spigot. Edward's eyes are closed. A long beat. Another. Edward opens one eye. The other eye. He sits up to find sitting on the edge of the tub. He smiles, then pulls his knees up, making room for her in the tub. A beat while she considers. Sandra steps out of her sandals and climbs into the tub, facing him. Her dress is soaked, but she doesn't mind. When they separate, she has tears hanging in her eyes. He wipes them away. Perched awkwardly on a canoe, Will's made it through another file cabinet. He goes through the folders page by page, but usually ends up tossing the whole thing in the trash. He's about to toss a file when he stops. Takes another look. Something doesn't make sense. She hands him five dollars out of her pocket. He's out the door in a flash. While Will sips his iced tea, Jenny flips through a form she never expected to see again. She hands it back to Will. A long beat. Jenny is taken back by the suddenness of it. She's a tangle of conflicting emotions. Fair enough. Jenny takes a seat across from him at the table.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The gentleman is none other than. The males grasp, disbelieving this fortunate coincidence. He's sincerely proud. Reaching the front of the queue, Norther pulls two revolvers out of his jacket, discharging both into the roof. Screeches all around. The thin security guard makes a halfhearted reach for his firearm, but Norther gestures him off. The guard takes out his firearm and slides it over. The teller woman nods. Angle on Edward, not sure what to do. He has a firearm, but he truly doesn't want to shoot Norther. The teller woman is already gesturing him to the rear. He decides he better go. The teller woman is sobbing as she works the combination. Edward feels terrible. She pulls open the vault portal. The inner holy of holies of the Horizon Savings and Loan holds exactly one collapsible chair. Edward winces, but doesn't say anything yet. He rips it open, revealing just a little currency inside. Even some nickels and cents. Caught, Edward has to admit. Edward continues his narration. Norther leans in the driver's side pane. Edward looks over at Norther, the actuality sinking in. The two males gesture at each other as Edward drives off. At the final moment, Norther calls out. Sandra is watering the garden. Will (5) runs past her to greet Edward, just returned from another journey. We reveal the Bloom residence, the nicest one in the vicinity. Bubbles rise from his nose for a few beats, then stop. It's silent, except for the distant splashing of water from the spigot. Edward's eyes are closed. A long beat. Another. Edward opens one eye. The other eye. He sits up to find perched on the edge of the tub. He smiles, then pulls his knees up, making room for her in the tub. A beat while she considers. Sandra steps out of her sandals and climbs into the tub, facing him. Her dress is soaked, but she doesn't mind. When they separate, she has tears hanging in her eyes. He wipes them away. Perched awkwardly on a canoe, Will's made it through another file cabinet. He goes through the folders page by page, but usually ends up tossing the whole thing in the trash. He's about to toss a file when he stops. Takes another look. Something doesn't make sense. She hands him five dollars out of her pocket. He's out the door in a flash. While Will sips his iced tea, Jenny flips through a document she never expected to see again. She hands it back to Will. A long beat. Jenny is taken aback by the suddenness of it. She's a tangle of conflicting sentiments. Fair enough. Jenny takes a seat across from him at the table."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The man is none other than. This lucky coincidence is disbelievingly shaken by the men. Genuine pride is felt by him. Upon reaching the front of the line, two pistols are pulled out of his coat by Norther, who fires both into the ceiling. Screams can be heard all around. A halfhearted reach for his gun is made by the skinny security guard, but he is waved off by Norther. His gun is taken out and slid over by the guard. The teller woman nods. Edward, unsure of what to do, is angled. A gun is possessed by him, but he truly doesn't want Norther to be shot. The teller woman is already waving him to the back. It is decided by him that he better go. As she works the combination, the teller woman is crying. Horrible feelings are experienced by Edward. The vault door is pulled open by her. Exactly one folding chair is held by the inner sanctum of the Horizon Savings and Loan. A wince is given by Edward, but nothing is said yet. It is ripped open by him, revealing just a little cash inside. Even some dimes and pennies. Caught, Edward makes a confession. The narration is continued by Edward. Norther leans in the driver's side window. Edward looks over at Norther, allowing the reality to sink in. Each other is waved at by the two men as Edward drives off. At the last moment, a call is made by Norther. The garden is watered by Sandra. Will (5) runs past her to greet Edward, who has just returned from another trip. The Bloom house, the nicest one in the neighborhood, is revealed. From his nose, bubbles rise for a few beats, then stop. Except for the distant splashing of water from the spigot, it is quiet. Edward's eyes are closed. A long beat. Another. One eye is opened by Edward. The other eye. Sitting up, he finds himself on the edge of the tub. A smile is given by him, and his knees are pulled up, making room for her in the tub. A beat is taken while she considers. Out of her sandals, steps Sandra and climbs into the tub, facing him. Her dress is soaked, but minding it is not something she does. When they separate, tears are hanging in her eyes. They are wiped away by him. Awkwardly perched on a canoe, another file cabinet has been made it through by Will. The folders are gone through by him page by page, but the whole thing usually ends up being tossed in the trash by him. A file is about to be tossed by him when he stops. Another look is taken. Something doesn't make sense. Five dollars are handed to him out of her pocket by her. Out the door, he is in a flash. While sipping his iced tea, a form she never expected to see again is flipped through by Jenny. It is handed back to Will by her. A long beat. By the suddenness of it, Jenny is taken aback. Conflicting emotions tangle her. Fair enough. A seat across from him at the table is taken by Jenny."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The man is none other than. The men shake hands, amazed at their luck. He's genuinely proud. At the front of the line, Norther draws two pistols, firing into the ceiling. Screams ensue. The skinny security guard feebly reaches for his weapon, but Norther dismisses him. The guard slides over his gun. The teller woman signals to Edward, who hesitates with his gun, reluctant to shoot Norther. She waves him to the back, crying as she opens the vault. Edward feels terrible. Inside, there's only a folding chair and a small amount of cash. Edward reluctantly confesses, continuing his narration. Norther leans in the driver’s window. Edward acknowledges Norther as he leaves. At the last moment, Norther calls out. Sandra waters the garden, and Will (5) rushes to greet Edward, just returned. The Bloom house is revealed as the nicest in the neighborhood. Bubbles rise from Edward’s nose, then stop. It's quiet except for distant water splashing. Edward's eyes are closed, then open. He sits up, making room for Sandra in the tub. She steps in, dress soaked, but doesn’t mind. She tears up, and he wipes them away. Will awkwardly sorts through a file cabinet on a canoe, nearly tossing a file before noticing something odd. He receives five dollars, then rushes out. While Will drinks iced tea, Jenny reviews a surprising form and returns it. Taken aback, Jenny's emotions conflict. She sits across from him at the table."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The man recognizes him, and they shake hands, astonished at the coincidence. He's proud. At the line's front, Norther draws two pistols, firing into the ceiling. Screams ensue. A skinny security guard attempts to pull his gun, but Norther dismisses him. The guard surrenders his weapon. The teller nods. Edward, confused, doesn't want to shoot Norther. The teller signals him to leave, and he obliges. She cries while opening the vault, and Edward feels terrible. Inside, there's only a folding chair and little cash. Caught, Edward confesses. Norther leans into the car, Edward realizes the situation, and they wave as he departs. Norther calls out. Sandra is gardening when Will races past to greet Edward, just home. The Bloom house is the neighborhood's finest. Edward, submerged, opens his eyes, smiles, and makes space in the tub for Sandra. She joins, dress soaked, but doesn't mind. During their embrace, tears form in her eyes, and he wipes them away. On a canoe, Will processes files, discarding most, but something piques his interest. Someone gives him five dollars, and he dashes out. Will sips iced tea as Jenny examines a form she thought lost, then returns it. Surprised and emotional, Jenny sits with him at the table."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The man in question is none other than the person they had been discussing. As they meet, the men exchange a handshake, clearly still in disbelief over the sheer luck of this coincidental meeting. One of the men, undeniably proud, reaches the front of the line. It is there that Norther dramatically pulls two pistols out from the depths of his coat and fires both of them into the ceiling, causing chaos and terror all around. The room fills with screams. A skinny security guard makes a feeble and halfhearted attempt to reach for his own gun, but Norther effortlessly waves him off. Understanding the situation, the guard proceeds to take out his gun and slides it over submissively. The woman behind the teller's counter gives a quick nod. We focus on Edward, who stands unsure of his next move. Although he has a gun of his own, he genuinely does not want to use it to shoot Norther. The teller woman is already gesturing for him to move to the back. He realizes it would be wise to heed her suggestion and decides to go. As she works to unlock the vault, the teller woman is crying, her tears flowing freely, and Edward feels a deep sense of remorse. She manages to pull open the vault door, revealing the supposed inner sanctum of the Horizon Savings and Loan, which surprisingly holds only one lonely folding chair. Edward winces at the sight of this, but refrains from saying anything at that moment. Upon opening it, he discovers only a small amount of cash inside, along with some dimes and pennies. Finding himself caught in this predicament, Edward has no choice but to confess. Edward continues narrating the events. Norther leans into the driver's side window. Edward, looking over at Norther, is gradually coming to terms with the reality of the situation. The two men exchange waves as Edward drives away. Just at the last moment, Norther calls out to him. Meanwhile, Sandra is out in the garden, watering the plants. Will, who is five years old, runs past her with excitement to greet Edward, who has just returned from yet another trip. The scene reveals the Bloom house, known as the nicest one in the neighborhood. In another scene, bubbles rise gently from Edward’s nose for a few moments before they come to a stop. The space is enveloped in a quiet hush, only interrupted by the distant sound of water splashing from the spigot. Edward’s eyes are closed, seemingly lost in thought. A long, thoughtful moment passes. Then another. Eventually, Edward opens one eye, then the other. As he sits up, he finds her sitting right on the edge of the tub. He can't help but smile and pulls his knees up, creating more space for her in the tub. After a pause, during which she carefully considers her decision, Sandra removes her sandals and steps into the tub, facing him. Her dress becomes soaked through, but she seems unconcerned. When they separate, there are tears shimmering in her eyes, and he gently wipes them away. Elsewhere, Will, perched awkwardly on a canoe, has managed to get through yet another file cabinet. He's meticulously going through the folders page by page, but more often than not, he ends up discarding the entire thing into the trash. He's just about to toss away a file when something makes him pause. He takes another look, noticing that something doesn't quite make sense. She reaches into her pocket and hands him five dollars. In an instant, he is out the door. While Will enjoys sipping his iced tea, Jenny flips through a form she never expected to lay her eyes on again. She returns it to Will after a lengthy pause. The suddenness of the situation takes Jenny by surprise, leaving her entangled in a web of conflicting emotions. Fairly accepting of this, Jenny takes a seat across from him at the table."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The man being discussed at length is, indeed, none other than the very person they had been endlessly talking about. As their paths cross, the two men engage in a handshake, both clearly still reeling from the disbelief and amazement over the extraordinary luck of this coincidental encounter. One of the men, undeniably filled with a sense of pride, advances confidently to the front of the line. It is at this point that Norther makes a dramatic gesture, pulling two pistols from the hidden recesses of his coat and firing both of them into the ceiling, thereby creating chaos and spreading terror throughout the room. The once-calm space is suddenly filled with screams echoing all around. A skinny security guard, in a rather feeble and halfhearted manner, attempts to reach for his own gun, but Norther effortlessly dismisses him with a wave. Understanding the precariousness of the situation, the guard opts to take out his gun and submits by sliding it over without resistance. The woman behind the teller's counter gives a quick, almost imperceptible nod. Our attention then shifts to Edward, standing there, uncertain of his next move. Despite owning a gun himself, he sincerely does not want to use it against Norther. The teller woman is already motioning for him to move to the back. Realizing the wisdom in heeding her suggestion, he makes the decision to go. As she works to unlock the vault, the teller woman is crying, her tears flowing freely down her cheeks, and Edward is overwhelmed with a deep sense of remorse. She manages, with some effort, to pull open the vault door, unveiling what is assumed to be the inner sanctum of the Horizon Savings and Loan, only to reveal a single lonely folding chair, surprisingly. Edward winces at the sight of this but opts to remain silent for the moment. Upon opening it, he discovers only a small amount of cash inside, accompanied by some dimes and pennies. Finding himself ensnared in this predicament, Edward feels he has no choice but to confess. Edward continues to narrate the unfolding events. Norther leans into the driver's side window, and Edward, glancing over at Norther, starts gradually coming to terms with the stark reality of the situation. The two men exchange waves as Edward drives away, moments before Norther calls out to him at the last instant. Meanwhile, Sandra is out in the garden, diligently watering the plants. Will, who is a lively five-year-old, runs past her with an infectious excitement to greet Edward, who has just made his return from yet another trip. The scene beautifully reveals the Bloom house, celebrated as the nicest one in the neighborhood. In another scene, Edward’s quiet contemplation is visually illustrated as bubbles rise gently from his nose for a few moments before they come to a complete stop. The space around him is enveloped in a serene quiet hush, only occasionally interrupted by the distant and gentle sound of water splashing from the spigot. Edward’s eyes remain closed, as if he is deeply lost in thought. A long, thoughtful moment passes, followed by another. Eventually, Edward opens one eye, and then the other. As he sits up, he finds her sitting right on the edge of the tub, prompting him to smile and pull his knees up, creating more space for her in the tub. After a contemplative pause, during which she carefully weighs her decision, Sandra removes her sandals and steps into the tub, facing him. Her dress becomes thoroughly soaked, but she seems utterly unconcerned by this. When they eventually separate, tears shimmer in her eyes, and he gently reaches out to wipe them away. Elsewhere, Will, perched rather awkwardly on a canoe, has managed to meticulously work through yet another file cabinet. He's painstakingly sifting through the folders, page by page, though more often than not, he ends up discarding the entire thing into the trash. He's just about to toss away a file when something catches his attention, making him pause. He takes another more discerning look, noticing something that doesn’t quite make sense. She reaches into her pocket and hands him a crisp five-dollar bill. In an instant, he is out the door. While Will leisurely enjoys sipping his iced tea, Jenny flips through a form she never expected to lay her eyes on again. After a lengthy pause, she returns it to Will. The abruptness of the situation catches Jenny by surprise, leaving her entangled in a web of conflicting emotions. Fairly accepting of this complex situation, Jenny takes a seat across from him at the table, mentally preparing to delve into the conversation."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The man is none other than someone significant, eliciting a sense of disbelief in both men as they shake hands, unable to fathom the fortuitousness of this encounter. A sense of genuine pride radiates from him. As the scene unfolds, Norther reaches the front of the line and, in one swift motion, retrieves two pistols from within his coat and fires them into the ceiling, sending reverberating echoes through the room, which instantly erupts in screams of panic. The skinny security guard, momentarily frozen, makes a lackluster attempt to reach for his firearm, but is quickly dissuaded by Norther's authoritative wave. Reluctantly, the guard withdraws his gun and slides it across the floor in a gesture of submission. Observing the chaos, the teller woman acknowledges the situation with a nod. Meanwhile, Edward is caught in a moment of indecision, grappling with his internal conflict as he clutches his own gun, profoundly averse to the notion of shooting Norther. The teller woman, through her tears, motions him toward the back, compelling Edward to reluctantly follow her lead. As they reach the vault, she struggles through her tears to turn the combination lock, and eventually, with a heavy pull, opens the vault door to reveal the inner sanctum of the Horizon Savings and Loan, which disappointingly contains nothing but a solitary folding chair. Edward winces at the sight, suppressing his disappointment and frustration, until he finally opens the vault, uncovering a meager collection of cash, and even some dimes and pennies, a revelation that prompts him to confess to the sparse findings. As the narrative continues, Norther leans into the driver's side window, sharing a moment of realization with Edward, who acknowledges him with a solemn glance. The two men exchange waves in a silent farewell as Edward drives away. At the cusp of departure, Norther shouts out, creating a final bridge of connection. Meanwhile, in a different setting, Sandra tends to the garden, and young Will, at the age of five, dashes past her in excitement to greet Edward, who has just returned from yet another journey. The scene shifts to reveal the Bloom house, standing out as the nicest residence in the neighborhood. In a quieter moment, bubbles momentarily rise and then cease from Edward's submerged nose, creating a stillness only broken by the distant sound of water splashing from a spigot. His eyes remain closed for a lingering moment, before, with a gradual progression, he opens first one eye, then the other. He sits up from his position in the tub to find someone sitting on its edge, prompting a smile from him. He then draws his knees up to make space for her to join him in the tub. A contemplative pause ensues as she considers the invitation, then she steps out of her sandals and climbs in, facing him without concern for her soaking dress. After a shared moment in the tub, they part, with her tears glistening in her eyes, which he gently wipes away. Meanwhile, perched awkwardly atop a canoe, Will navigates another file cabinet, methodically sifting through folders page by page, often discarding the entire contents into the trash. He is on the verge of tossing away yet another file when something catches his attention, prompting him to pause and re-examine the file with scrutiny, sensing that something doesn't quite add up. She then hands him five dollars from her pocket, a transaction that propels him out the door in a blur of motion. As Will leisurely sips his iced tea, Jenny leafs through a form she had never anticipated encountering again. After a moment of reflection, she returns it to Will, creating a lingering pause, during which Jenny is overwhelmed by the abruptness of the situation, her emotions a complex web of conflict. In acceptance of the unfolding circumstances, she takes a seat across from him at the table, anchoring the scene in an air of reconciliation."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The man encounters another, leading to a moment of disbelief and surprised camaraderie. As Norther reaches the front of the line, he brandishes two pistols and fires into the ceiling, causing panic. The security guard hesitantly surrenders his weapon, while the teller urges Edward to move back, emphasizing his reluctance to confront Norther. Despite his reservations, Edward follows her lead. Inside the vault, Edward is disappointed to find only a small amount of money and coins, prompting him to reluctantly confess the situation. Norther later approaches Edward at the driver's side window, acknowledging the encounter with a wave as Edward departs. Meanwhile, Sandra tends to the garden as Will rushes to greet Edward, highlighting the Bloom house as the neighborhood’s finest. In a reflective and quiet moment, Edward relaxes in the tub with Sandra, who joins him despite soaking her dress. Their tender exchange culminates in Edward gently wiping her tears. Will, perched on a canoe, sorts through files, discarding most until one catches his attention. After receiving five dollars, he quickly leaves, while Jenny examines a form with unexpected recognition, leading her to join Will at the table, conflicted by her emotions."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The man is none other than, a figure shrouded in mystery and yet oddly familiar to those present. The men shake, disbelieving this lucky coincidence that seems straight out of a storybook. He's genuinely proud, a rare sentiment often missing from the otherwise grueling reality of daily life. Reaching the front of the line, in a space filled with anticipation, Norther pulls two pistols out of his coat, firing both into the ceiling, an act reminiscent of old western films intended to command attention. Screams all around reverberate like echoes in a canyon. The skinny security guard, a young recruit fresh out of training, makes a halfhearted reach for his gun, but Norther, with the calm of a veteran stage performer, waves him off. The guard takes out his gun and slides it over, a gesture of reluctant compliance. The teller woman, a stalwart employee known for her dedication, nods as if to say, \"It's all part of the unwritten script.\" Angle on Edward, who stands at the crossroads of fate, not sure what to do. He has a gun, a relic passed down from his grandfather who served in the war, but he truly doesn't want to shoot Norther. The teller woman is already waving him to the back, urging him to safety. He decides he better go, resigned to play his part. The teller woman is crying as she works the combination, her tears a silent testament to the gravity of the situation. Edward feels horrible, like a reluctant participant in a tragic play. She pulls open the vault door, revealing the inner sanctum of the Horizon Savings and Loan, a bank with a century-old legacy of service to the community, which holds exactly one folding chair—an ironic symbol of its recent financial woes. Edward winces, but doesn't say anything yet. He rips it open, revealing just a little cash inside, even some dimes and pennies, the leftover change of a bygone era of prosperity. Caught in the moment, Edward has to confess his role in this unfolding drama. Edward continues his narration, a voice-over in the silent movie of his life. Norther leans in the driver's side window, a scene reminiscent of countless noir films. Edward looks over at Norther, the reality sinking in like the weight of an anchor. The two men wave at each other as Edward drives off into the unknown. At the last moment, Norther calls out, a voice reaching across the void. Sandra is watering the garden, a tranquil retreat she has cultivated over the years. Will, a sprightly five-year-old with boundless energy, runs past her to greet Edward, just returned from another trip that seemed endless. We reveal the Bloom house, the nicest one in the neighborhood, a testament to Edward's hard work and Sandra's impeccable taste. Bubbles rise from his nose for a few beats, then stop, in the stillness of their sacred space. It's quiet, except for the distant splashing of water from the spigot, a gentle reminder of life's continuity. Edward's eyes are closed, as if in a moment of prayer. A long beat. Another. Edward opens one eye, then the other, as if awakening from a dream. He sits up to find Sandra sitting on the edge of the tub, their sanctuary of intimacy. He smiles, then pulls his knees up, making room for her in the tub, inviting her into his world. A beat while she considers, weighing the moment. Sandra steps out of her sandals and climbs into the tub, facing him, choosing connection over convention. Her dress is soaked, but she doesn't mind, reveling in the liberation of the moment. When they separate, she has tears hanging in her eyes, the bittersweet residue of their shared journey. He wipes them away, a gesture of love and reassurance. Perched awkwardly on a canoe, part of a collection of old sporting equipment, Will's made it through another file cabinet, a remnant of Edward's father's estate. He goes through the folders page by page, but usually ends up tossing the whole thing in the trash, a symbolic purging of the past. He's about to toss a file when he stops. Takes another look. Something doesn't make sense, a piece of the puzzle that doesn't fit. She hands him five dollars out of her pocket, a small token of encouragement. He's out the door in a flash, propelled by curiosity. While Will sips his iced tea, savoring the sweet taste of summer, Jenny flips through a form she never expected to see again, a relic from a chapter of her life she thought was closed. She hands it back to Will, her expression a mix of surprise and nostalgia. A long beat. Jenny is taken back by the suddenness of it, the reappearance of the long-forgotten. She's a tangle of conflicting emotions, caught between the past and the present. Fair enough, she thinks, as she tries to make sense of it all. Jenny takes a seat across from him at the table, ready to face whatever comes next."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The man is none other than. The men shake disbelieving this lucky coincidence. He is genuinely proud. Reaching the front of the line Norther pulls two pistols out of his coat firing both into the ceiling. Screams all around. The skinny security guard makes a halfhearted reach for his gun but Norther waves him off. The guard takes out his gun and slides it over. The teller woman nods Angle on Edward not sure what to do. He has a gun but he truly does not want to shoot Norther. The teller woman is already waving him to the back. He decides he better go. The teller woman is crying as she works. the combination. Edward feels horrible. She pulls open the vault door. The inner sanctum of the Horizon. Savings and Loan holds exactly one folding chair. Edward winces but does not say anything yet. He rips it open revealing just a little cash inside. Even some dimes and pennies. Caught. Edward has to confess. Edward continues his narration. Norther leans in the driver's side window. Edward looks over at Norther the reality sinking in. The two men wave at each other as Edward drives off. At the last moment Norther calls out. Sandra is watering the garden. Will 5 runs past her to greet Edward just returned from another trip. We reveal the Bloom house the nicest one in the neighborhood. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. Bubbles rise from his nose for a few beats then stop. It is quiet except for the distant splashing of water from the spigot. Edward's eyes are closed. A long beat. Another. Edward opens one eye. The other eye. He sits up to find sitting on the edge of the tub. He smiles then pulls his knees up making room for her in the tub. A beat while she considers. Sandra steps out of her sandals and climbs into the tub facing him. Her dress is soaked but she does not mind. When they separate she has tears hanging in her eyes. He wipes them away. Perched awkwardly on a canoe. Will's made it through another file cabinet. He goes through the folders page by page but usually ends up tossing the whole thing in the trash. He is about to toss a file. when he stops. Takes another look. Something does not make sense. She hands him five dollars out of her pocket. He is out the door in a flash. While Will sips his iced tea Jenny flips through a form she never expected to see again. She hands it back to Will. A long beat. Jenny is taken back by the suddenness of it. She is a tangle of conflicting emotions. Fair enough. Jenny takes a seat across from him at the table."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The man is none other than. The men shake disbelieving this lucky coincidence. He is genuinely proud. Reaching the front of the line Norther pulls two pistols out of his coat firing both into the ceiling. Screams all around. The skinny security guard makes a halfhearted reach for his gun but Norther waves him off. The guard takes out his gun and slides it over. The teller woman nods Angle on Edward not sure what to do. He has a gun but he truly does not want to shoot Norther. The teller woman is already waving him to the back. He decides he better go. The teller woman is crying as she works. the combination. Edward feels horrible. She pulls open the vault door. The inner sanctum of the Horizon. Savings and Loan holds exactly one folding chair. Edward winces but does not say anything yet. He rips it open revealing just a little cash inside. Even some dimes and pennies. Caught. Edward has to confess. Edward continues his narration. Norther leans in the driver's side window. Edward looks over at Norther the reality sinking in. The two men wave at each other as Edward drives off. At the last moment Norther calls out. Sandra is watering the garden. Will 5 runs past her to greet Edward just returned from another trip. We reveal the Bloom house the nicest one in the neighborhood. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Bubbles rise from his nose for a few beats then stop. It is quiet except for the distant splashing of water from the spigot. Edward's eyes are closed. A long beat. Another. Edward opens one eye. The other eye. He sits up to find sitting on the edge of the tub. He smiles then pulls his knees up making room for her in the tub. A beat while she considers. Sandra steps out of her sandals and climbs into the tub facing him. Her dress is soaked but she does not mind. When they separate she has tears hanging in her eyes. He wipes them away. Perched awkwardly on a canoe. Will's made it through another file cabinet. He goes through the folders page by page but usually ends up tossing the whole thing in the trash. He is about to toss a file. when he stops. Takes another look. Something does not make sense. She hands him five dollars out of her pocket. He is out the door in a flash. While Will sips his iced tea Jenny flips through a form she never expected to see again. She hands it back to Will. A long beat. Jenny is taken back by the suddenness of it. She is a tangle of conflicting emotions. Fair enough. Jenny takes a seat across from him at the table."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The man is none other than. The men shake disbelieving this lucky coincidence. He is genuinely proud. Reaching the front of the line Norther pulls two pistols out of his coat firing both into the ceiling. Screams all around. The skinny security guard makes a halfhearted reach for his gun but Norther waves him off. The guard takes out his gun and slides it over. The teller woman nods Angle on Edward not sure what to do. He has a gun but he truly does not want to shoot Norther. The teller woman is already waving him to the back. He decides he better go. The teller woman is crying as she works. the combination. Edward feels horrible. She pulls open the vault door. Will's made it through another file cabinet. He goes through the folders page by page but usually ends up tossing the whole thing in the trash. He is about to toss a file. when he stops. Takes another look. Something does not make sense. She hands him five dollars out of her pocket. He is out the door in a flash. While Will sips his iced tea Jenny flips through a form she never expected to see again. She hands it back to Will. A long beat. Jenny is taken back by the suddenness of it. She is a tangle of conflicting emotions. Fair enough. Jenny takes a seat across from him at the table."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The man is none other than. The men shake disbelieving this lucky coincidence. He is genuinely proud. Reaching the front of the line Norther pulls two pistols out of his coat firing both into the ceiling. Screams all around. The skinny security guard makes a halfhearted reach for his gun but Norther waves him off. She hands it back to Will. A long beat. Jenny is taken back by the suddenness of it. She is a tangle of conflicting emotions. Fair enough. Jenny takes a seat across from him at the table."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The cat is none other than. The cats dance, disbelieving this strange coincidence. It's genuinely thrilled. Reaching the front of the parade, Jenkins pulls two umbrellas out of his backpack, tossing both into the fountain. Cheers all around. The chubby electrician makes a lazy grab for his hat, but Jenkins waves him off. The electrician takes out his hat and flings it over. The baker nods. Angle on Leo, not sure what to think. He has a balloon, but he truly doesn't want to pop Jenkins. The baker is already signaling him to the rooftop. He decides he better leap. The baker is smiling as she opens the jar. Leo feels wonderful. She swings open the cabinet door. The inner kingdom of the Horizon Markets and Trade holds exactly one umbrella stand. Leo grins, but doesn't say anything yet. He tears it open, revealing just a small toy inside. Even some marbles and buttons. Triumphant, Leo has to celebrate. Leo continues his storytelling. Jenkins leans into the passenger's side window. Leo glances over at Jenkins, the excitement sinking in. The two cats nod at each other as Leo pedals away. At the last second, Jenkins shouts out. Karen is painting the fence. Max (7) skips past her to greet Leo, just returned from another adventure. We illustrate the Pine house, the shabbiest one in the village. Butterflies emerge from his ears for a few moments, then pause. It's still, except for the distant chirping of crickets from the field. Leo's eyes are shut. A short moment. Another. Leo opens one eye. The opposite eye. He stands up to find balancing on the rim of the pool. He grins, then stretches his arms out, making space for her in the pool. A moment while she contemplates. Karen removes her shoes and dives into the pool, facing him. Her jacket is drenched, but she doesn't care. When they part, she has laughter bubbling in her eyes. He brushes it away. Balanced precariously on a skateboard, Max's made it through another bookshelf. He looks through the novels one by one, but usually ends up tossing the whole shelf into the bin. He's about to toss a book when he pauses. Takes another glance. Something doesn't match. She hands him five apples out of her box. He's out the gate like lightning. While Max gulps his lemonade, Lila flips through a paper she never expected to spot again. She passes it back to Max. A short moment. Lila is startled by the quickness of it. She's a swirl of mixed reactions. Fair enough. Lila takes a cushion across from him at the counter."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Norther, reaching the front of a line, pulls two pistols and fires into the ceiling, causing panic. A security guard reluctantly surrenders his gun. Edward, conflicted about stopping Norther, follows a teller to the vault, feeling guilty as it reveals only minimal cash. Later, Norther bids farewell to Edward. At the Bloom house, Edward returns from a trip, greeted by Sandra and their son Will. Sandra joins Edward in a tub, her dress soaked, sharing an emotional moment. Will, reviewing papers, pauses on something unusual. Jenny, surprised by a form from her past, is overwhelmed with emotions when she meets Will at the table."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Jenny takes a seat across from him at the table Fair enough She is a tangle of conflicting emotions Jenny is taken back by the suddenness of it A long beat She hands it back to Will While Will sips his iced tea Jenny flips through a form she never expected to see again He is out the door in a flash She hands him five dollars out of her pocket Something does not make sense Takes another look when he stops He is about to toss a file He goes through the folders page by page but usually ends up tossing the whole thing in the trash Will's made it through another file cabinet Perched awkwardly on a canoe He wipes them away When they separate she has tears hanging in her eyes Her dress is soaked but she does not mind Sandra steps out of her sandals and climbs into the tub facing him A beat while she considers He smiles then pulls his knees up making room for her in the tub He sits up to find sitting on the edge of the tub The other eye Edward opens one eye Another A long beat Edward's eyes are closed It is quiet except for the distant splashing of water from the spigot Bubbles rise from his nose for a few beats then stop We reveal the Bloom house the nicest one in the neighborhood Will 5 runs past her to greet Edward just returned from another trip Sandra is watering the garden At the last moment Norther calls out The two men wave at each other as Edward drives off Edward looks over at Norther the reality sinking in Norther leans in the driver's side window Edward continues his narration Edward has to confess Caught Even some dimes and pennies He rips it open revealing just a little cash inside Edward winces but does not say anything yet Savings and Loan holds exactly one folding chair The inner sanctum of the Horizon She pulls open the vault door Edward feels horrible the combination The teller woman is crying as she works He decides he better go The teller woman is already waving him to the back He has a gun but he truly does not want to shoot Norther The teller woman nods Angle on Edward not sure what to do The guard takes out his gun and slides it over The skinny security guard makes a halfhearted reach for his gun but Norther waves him off Screams all around Reaching the front of the line Norther pulls two pistols out of his coat firing both into the ceiling He is genuinely proud The men shake disbelieving this lucky coincidence The man is none other than"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The men shake disbelieving this lucky coincidence The man is none other than Reaching the front of the line Norther pulls two pistols out of his coat firing both into the ceiling He is genuinely proud The skinny security guard makes a halfhearted reach for his gun but Norther waves him off Screams all around The teller woman nods Angle on Edward not sure what to do The guard takes out his gun and slides it over The teller woman is already waving him to the back He has a gun but he truly does not want to shoot Norther The teller woman is crying as she works He decides he better go Edward feels horrible the combination The inner sanctum of the Horizon She pulls open the vault door Edward winces but does not say anything yet Savings and Loan holds exactly one folding chair Even some dimes and pennies He rips it open revealing just a little cash inside Edward has to confess Caught Norther leans in the driver's side window Edward continues his narration The two men wave at each other as Edward drives off Edward looks over at Norther the reality sinking in Sandra is watering the garden At the last moment Norther calls out We reveal the Bloom house the nicest one in the neighborhood Will 5 runs past her to greet Edward just returned from another trip It is quiet except for the distant splashing of water from the spigot Bubbles rise from his nose for a few beats then stop A long beat Edward's eyes are closed Edward opens one eye Another He sits up to find sitting on the edge of the tub The other eye A beat while she considers He smiles then pulls his knees up making room for her in the tub Her dress is soaked but she does not mind Sandra steps out of her sandals and climbs into the tub facing him He wipes them away When they separate she has tears hanging in her eyes Will's made it through another file cabinet Perched awkwardly on a canoe He is about to toss a file He goes through the folders page by page but usually ends up tossing the whole thing in the trash Takes another look when he stops She hands him five dollars out of her pocket Something does not make sense While Will sips his iced tea Jenny flips through a form she never expected to see again He is out the door in a flash A long beat She hands it back to Will She is a tangle of conflicting emotions Jenny is taken back by the suddenness of it Jenny takes a seat across from him at the table Fair enough"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Bubbles rise from his nose for a few beats then stop It is quiet except for the distant splashing of water from the spigot Edward's eyes are closed A long beat Another Edward opens one eye The other eye He sits up to find sitting on the edge of the tub He smiles then pulls his knees up making room for her in the tub A beat while she considers Sandra steps out of her sandals and climbs into the tub facing him Her dress is soaked but she does not mind When they separate she has tears hanging in her eyes He wipes them away Perched awkwardly on a canoe Will's made it through another file cabinet He goes through the folders page by page but usually ends up tossing the whole thing in the trash He is about to toss a file when he stops Takes another look Something does not make sense She hands him five dollars out of her pocket He is out the door in a flash While Will sips his iced tea Jenny flips through a form she never expected to see again She hands it back to Will A long beat Jenny is taken back by the suddenness of it She is a tangle of conflicting emotions Fair enough Jenny takes a seat across from him at the table The man is none other than The men shake disbelieving this lucky coincidence He is genuinely proud Reaching the front of the line Norther pulls two pistols out of his coat firing both into the ceiling Screams all around The skinny security guard makes a halfhearted reach for his gun but Norther waves him off The guard takes out his gun and slides it over The teller woman nods Angle on Edward not sure what to do He has a gun but he truly does not want to shoot Norther The teller woman is already waving him to the back He decides he better go The teller woman is crying as she works the combination Edward feels horrible She pulls open the vault door The inner sanctum of the Horizon Savings and Loan holds exactly one folding chair Edward winces but does not say anything yet He rips it open revealing just a little cash inside Even some dimes and pennies Caught Edward has to confess Edward continues his narration Norther leans in the driver's side window Edward looks over at Norther the reality sinking in The two men wave at each other as Edward drives off At the last moment Norther calls out Sandra is watering the garden Will 5 runs past her to greet Edward just returned from another trip We reveal the Bloom house the nicest one in the neighborhood"
        }
      ]
    }
  ]
}