{
  "ground_truth": "It's very early morning, and the first blue light of day is glowing through the vertical blinds. Still in his chair, Will wakes up a bit at a time with the notepad on his lap and the pen in his hand, then cracks his neck, crooked from sleeping on it wrong. Wondering what woke him up, he looks to his right and holds his gaze for a breath. His father, Edward, is awake, silently gasping for breath, with eyes open, scared and confused. Edward shakes his head unambiguously, then nods. Will pours a glass from the pitcher on the nightstand and holds it to his father's lips, but Edward won't drink and pushes it away, wanting something else. It takes Edward all his strength to put together each thought, feeling like he's only half-there, fighting to hang on to this world. Will realizes something, and Edward nods again, looking around confused and increasingly scared, seeing the end approaching but not knowing exactly what's coming. Without the story, he's lost and fighting the urge to panic. Will looks around the room, increasingly desperate, and eyes the nurse call button, really wanting to press it. Edward waits for Will to begin but throws back the covers, and before Will can answer, he spots Edward rolling the chair himself, pumping both arms. Will dashes to catch up as the Heavyset Nurse leans out of Edward's hospital room. Seeing security guards heading their way, a quick-thinking Sandra shoves a nearby cart into them, bowling them down. Will brakes hard, sliding with both feet as the chair nearly crashes into the back wall while the doors close. Racing Edward down the row, they finally reach the Chevrolet, and Will lifts his father out of the chair and sets him in the passenger seat, then hands it off. Edward unscrews the cap but instead of drinking it, douses himself and soaks the blanket. Will pops the trunk, and Edward, focused completely on Will's story, enjoys that detail. Will stops short because of traffic backed up, honking to get around the jam. Then, up ahead, the cars start moving, shoved aside by massive hands as Karl the Giant clears a path by brute force. Edward leans out the window and waves to Karl, who waves back. They arrive at the same stretch of the river where it all began, where a crowd of more than 100 is waiting. Amos Calloway is here with the circus folk, including Mr. Soggybottom, as well as Edward's mother and father, the Mayor, and many others from along the way. While Ping scans the horizon, Jing nuzzles with her boyfriend, Norther Winslow. It's Ping who first spots the Chevrolet. Will gets out of the Chevrolet, overwhelmed by the crowd.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "It's extremely early dawn, and the initial azure radiance of dawn is shimmering through the upright shades. Still in his seat, Will stirs a tad at a moment with the notebook on his thighs and the pen in his palm, then pops his nape, twisted from slumbering on it incorrectly. Pondering what roused him, he glances to his right and maintains his stare for a moment. His father, Edward, is alert, soundlessly panting for air, with eyes open, frightened and perplexed. Edward shakes his head unmistakably, then nods. Will fills a tumbler from the carafe on the bedside table and holds it to his father's mouth, but Edward won't sip and shoves it aside, desiring something different. It takes Edward all his might to assemble each notion, feeling like he's only partially present, struggling to cling on to this existence. Will comprehends something, and Edward nods again, glancing around bewildered and increasingly frightened, observing the conclusion nearing but not understanding precisely what's impending. Without the tale, he's lost and battling the impulse to panic. Will glances around the chamber, increasingly frantic, and eyes the nurse summon button, really wishing to press it. Edward waits for Will to commence but tosses back the covers, and before Will can respond, he notices Edward propelling the chair himself, pumping both arms. Will rushes to catch up as the Heavyset Nurse leans out of Edward's infirmary chamber. Observing security officers heading their direction, a quick-witted Sandra thrusts a nearby trolley into them, knocking them down. Will brakes abruptly, skidding with both feet as the chair nearly smashes into the rear barrier while the portals shut. Speeding Edward down the aisle, they finally reach the Chevrolet, and Will hoists his father out of the chair and places him in the co-driver's seat, then hands it off. Edward unscrews the cap but instead of consuming it, drenches himself and saturates the covering. Will pops the trunk, and Edward, engrossed completely in Will's tale, relishes that element. Will halts suddenly because of vehicles backed up, honking to circumvent the block. Then, up ahead, the automobiles start advancing, pushed aside by enormous hands as Karl the Giant clears a passage by sheer power. Edward leans out the pane and waves to Karl, who waves back. They arrive at the same span of the river where it all commenced, where a throng of more than 100 is waiting. Amos Calloway is here with the circus people, including Mr. Soggybottom, as well as Edward's mother and father, the Mayor, and numerous others from along the route. While Ping scans the skyline, Jing cuddles with her partner, Norther Winslow. It's Ping who first detects the Chevrolet. Will gets out of the Chevrolet, overwhelmed by the throng."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "It's very early morning, and the first blue light of day is glowing through the vertical blinds. Still in his chair, Will is woken up a bit at a time with the notepad on his lap and the pen in his hand, then his neck is cracked by him, crooked from sleeping on it wrong. Wondering what woke him up, a breath is held by him while he looks to his right. His father, Edward, is awake, silently gasping for breath, with eyes open, scared and confused. Edward unambiguously shakes his head, then nods. A glass is poured by Will from the pitcher on the nightstand and held to his father's lips, but it is pushed away by Edward, who won't drink, wanting something else. It takes Edward all his strength to put together each thought, feeling like he's only half-there, fighting to hang on to this world. Something is realized by Will, and Edward nods again, looking around confused and increasingly scared, seeing the end approaching but not knowing exactly what's coming. Without the story, he's lost and fighting the urge to panic. The room is looked around by Will, increasingly desperate, and the nurse call button is eyed by him, really wanting to press it. Will is waited for by Edward to begin but the covers are thrown back by him, and before Will can answer, Edward is spotted by him rolling the chair himself, pumping both arms. Will dashes to catch up as the Heavyset Nurse leans out of Edward's hospital room. Seeing security guards heading their way, a nearby cart is shoved into them by a quick-thinking Sandra, bowling them down. Hard brakes are applied by Will, sliding with both feet as the chair nearly crashes into the back wall while the doors close. Racing Edward down the row, the Chevrolet is finally reached, and his father is lifted out of the chair by Will and set in the passenger seat, then it is handed off. The cap is unscrewed by Edward but instead of drinking it, he douses himself and soaks the blanket. The trunk is popped by Will, and Edward, completely focused on Will's story, enjoys that detail. Will stops short because of traffic backed up, honking to get around the jam. Then, up ahead, the cars start moving, shoved aside by massive hands as Karl the Giant clears a path by brute force. Edward leans out the window and waves to Karl, who waves back. They arrive at the same stretch of the river where it all began, where more than 100 are waiting. Amos Calloway is here with the circus folk, including Mr. Soggybottom, as well as Edward's mother and father, the Mayor, and many others from along the way. While the horizon is scanned by Ping, her boyfriend, Norther Winslow, is nuzzled by Jing. It's Ping who first spots the Chevrolet. Overwhelmed by the crowd, Will gets out of the Chevrolet."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "In the early morning, blue light filters through the blinds as Will awakens in his chair with a notepad on his lap. His neck sore from sleeping wrong, he notices Edward, his father, awake and gasping silently, appearing frightened. Edward refuses water from Will, indicating he wants something else. Struggling to maintain clarity, Edward acknowledges Will's realization. Desperate, Will eyes the nurse call button as Edward starts rolling his chair. The Heavyset Nurse watches as Will rushes to catch up, while Sandra obstructs security with a cart. Will brakes hard, avoiding a crash as they reach the Chevrolet. Will helps Edward into the car, where Edward drenches himself with water instead of drinking it. Despite traffic, they move forward as Karl the Giant clears the way. Edward waves to Karl, and they reach a riverbank where over 100 people, including circus folk and Edward's family, wait. Ping spots the Chevrolet first, and Will emerges, overwhelmed by the crowd."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Very early morning, blue light shines through blinds. Will wakes gradually in his chair, with a notepad on his lap and pen in hand, cracks his neck sore from sleep. Seeing his father, Edward, scared and gasping, Will offers water, but Edward refuses. Edward struggles with thoughts, feeling half-present and scared. Will considers pressing the nurse call button, but Edward starts moving himself. Will rushes as Edward rolls away, narrowly avoiding security thanks to Sandra's quick thinking. Will brakes, avoiding a crash as he reaches their Chevrolet, seats Edward, who wets himself and a blanket. Stopped by traffic, Will sees Karl the Giant clear a path, and Edward waves. They arrive at the river where a crowd, including Amos Calloway, circus folk, Edward's parents, and more, wait. Ping spots their Chevrolet, as Will exits, overwhelmed."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In the very early hours of the morning, the initial soft, blue light of dawn filters gently through the vertical blinds, casting a delicate glow. Will, still seated in his chair, awakens slowly and gradually, with a notepad resting on his lap and a pen loosely held in his hand. He stirs slightly, feeling the discomfort in his neck, crooked from having slept in an awkward position. Pondering over what might have roused him from his slumber, he turns his head to the right and holds his gaze for a breath. Edward, his father, is awake, silently gasping for air, with eyes wide open that reflect fear and confusion. Edward shakes his head clearly and then gives a nod. Will pours a glass of water from the pitcher sitting on the nightstand, carefully holding it to Edward's lips, but Edward refuses to drink, pushing it away, indicating a longing for something else. With each thought, Edward uses all his remaining strength, feeling as though he is only partially present, struggling to cling to the remnants of this world. Will comes to a realization as Edward nods again, looking around with a growing sense of confusion and fear, sensing the inevitability of the end but unsure of what exactly is to come. Without his story, Edward feels lost and fights the rising panic. Will glances around the room, his desperation mounting, and eyes the nurse call button, intensely tempted to press it. Edward waits expectantly for Will to start but suddenly throws back the covers, and before Will can respond, he notices Edward maneuvering the chair himself, vigorously pumping both arms. Will races to catch up just as the Heavyset Nurse leans out from Edward's hospital room. Catching sight of security guards approaching quickly, a resourceful Sandra shoves a nearby cart into their path, sending them tumbling. Will brakes hard, coming to a sliding stop with both feet as the chair nearly collides with the back wall while the doors close. Hurriedly pushing Edward down the row, they eventually reach the Chevrolet. Will carefully lifts his father out of the chair, setting him into the passenger seat, then promptly hands it off. Edward unscrews the cap, but instead of drinking, he pours the water over himself, soaking the blanket entirely. Will pops open the trunk as Edward, his attention fully on Will’s story, relishes that detail. Will is forced to halt abruptly due to traffic that has backed up, honking persistently to navigate through the congestion. Up ahead, the vehicles begin to shift, pushed aside by the massive hands of Karl the Giant, who is forcefully clearing a pathway. Edward leans out the window, waving to Karl, who acknowledges and waves back. They finally arrive at the familiar stretch of river where everything began, greeted by the sight of a gathering crowd exceeding 100 people. Present here are Amos Calloway accompanied by the circus folk, including Mr. Soggybottom, Edward's mother and father, the Mayor, and many others who have been part of the journey. With sharp eyes, Ping scans the horizon while Jing cuddles with her boyfriend, Norther Winslow. It is Ping who first spots the approaching Chevrolet. In awe of the assembly, Will steps out of the Chevrolet, utterly overwhelmed by the sizable crowd."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In the very early hours of the morning, the soft, serene blue light of dawn begins to filter gently through the vertical blinds, casting a delicate, ethereal glow over the room. Will, still seated comfortably, or perhaps uncomfortably, in his chair, slowly awakens in a gradual manner, with a notepad nestled on his lap and a pen loosely held within his hand. He stirs slightly, feeling the discomfort settling in his neck, which is crooked from having fallen asleep in such an awkward position. As he ponders over what might have roused him from his deep slumber, he turns his head to the right and holds his gaze for a brief moment. To his right, Edward, his father, is awake, silently gasping for air with his eyes wide open in fear and confusion. Edward shakes his head in a clear manner and then nods subtly. Will, realizing his father's distress, pours a glass of water from the pitcher that sits on the nearby nightstand. He carefully holds it to Edward's lips, but Edward refuses to drink, gently pushing it away, signaling his longing for something else entirely. With each passing thought, Edward uses every ounce of his remaining strength, feeling as though he is only partially present, struggling to hold on to the remnants of this world. Will comes to a realization as Edward nods once more, looking around with a growing sense of confusion and fear, sensing the inevitability of the end but feeling unsure of what exactly lies ahead. Without his story, Edward feels utterly lost and fights the rising tide of panic. Will glances frantically around the room, his desperation mounting, his eyes locking onto the nurse call button, feeling an intense temptation to press it. Edward waits expectantly for Will to begin but suddenly throws back the covers. Before Will can respond, he notices Edward maneuvering the wheelchair himself, vigorously pumping both arms. Will races to catch up just as the Heavyset Nurse leans out from Edward's hospital room doorway. Catching sight of security guards approaching quickly, the resourceful Sandra shoves a nearby cart into their path, causing them to tumble and fall. Will brakes hard, coming to a sliding stop with both feet as the chair nearly collides with the back wall while the doors close behind them. Hurriedly pushing Edward down the row, they eventually reach the Chevrolet. Will carefully lifts his father out of the chair, setting him gently into the passenger seat, before promptly handing off the chair. Edward unscrews the cap, but instead of drinking, he dramatically pours the water over himself, soaking the blanket completely. Will pops open the trunk, as Edward, his attention fully captivated by Will’s story, relishes in that detail. Will is forced to halt abruptly due to traffic that has become heavily backed up, honking persistently to navigate through the frustrating congestion. Up ahead, the vehicles begin to shift and move aside, pushed out of the way by the massive hands of Karl the Giant, who is forcefully clearing a pathway. Edward leans out of the window, waving to Karl, who acknowledges his greeting and waves back. They finally arrive at the familiar stretch of river where their journey began, greeted by the sight of a gathering crowd that exceeds 100 people. Present in this assembly are Amos Calloway accompanied by the circus folk, including Mr. Soggybottom, Edward's mother and father, the Mayor, and many others who have been a part of their journey. With sharp, observant eyes, Ping scans the horizon while Jing cuddles affectionately with her boyfriend, Norther Winslow. It is Ping who first spots the approaching Chevrolet. In awe of the large assembly, Will steps out of the Chevrolet, utterly overwhelmed by the sheer size and presence of the crowd."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "In the very early morning, the first hint of blue daylight filters softly through the vertical blinds, casting a gentle glow into the room. Slumped in his chair, Will begins to stir into consciousness, waking gradually with a notepad perched on his lap and a pen clasped in his hand. As awareness sinks in, he gingerly cracks his neck, which feels stiff and crooked from his uncomfortable night’s sleep. Trying to ascertain what roused him, he turns his head to the right, holding his gaze steadfastly for a moment as he draws a deep breath. His father, Edward, is awake, his eyes wide open, and he is silently gasping for air, a look of fear and confusion etched on his face. Edward shakes his head with a clear but unspoken message and follows it with a nod. Responding instinctively, Will reaches for the pitcher on the nightstand and pours a glass of water, gently bringing it to his father’s lips. Edward, however, refuses to drink and pushes the glass away, signaling his need for something else. Edward struggles intensely, mustering every ounce of his strength to cobble together his thoughts, feeling as though he is only half-present, desperately clinging to his waning hold on life. It dawns on Will that something significant is happening, prompting Edward to nod again, looking increasingly disoriented and frightened, confronting the inevitable end yet unsure of what precisely lies ahead. Without his story, Edward feels adrift, battling the rising tide of panic within him. Will scans the room in growing desperation, his eyes landing on the nurse call button, feeling an urgent desire to press it. In anticipation of something unknown, Edward waits patiently for Will to act, but abruptly throws back the covers before Will can respond, making him notice Edward propelling the wheelchair himself with determined pushes from both arms. Will races to catch up, just as the Heavyset Nurse appears in the doorway of Edward’s hospital room. Quick-witted Sandra, observing security guards approaching fast, shoves a convenient cart into them, causing them to tumble to the ground. Will stops suddenly, sliding to a halt with both feet as the wheelchair narrowly avoids slamming into the back wall while the doors close with a decisive thud. They speed down the row with Edward, arriving at the Chevrolet where Will swiftly lifts his father from the chair, setting him gently in the passenger seat before handing off the chair. Edward unscrews the cap of a container, not to drink, but to pour the contents over himself, drenching both himself and the blanket. Will pops open the trunk, his attention momentarily diverted to the narrative detail that Edward enjoys so much. Traffic ahead grinds to a halt, prompting Will to stop short, honking impatiently to find a way around the congestion. Suddenly, up ahead, cars begin to shift aside, moved by massive hands as Karl the Giant uses his immense strength to clear a path. Edward leans out the window with a smile, waving at Karl, who responds with a friendly wave in return. They finally reach the familiar stretch of riverbank where it all started, where a crowd of more than a hundred people eagerly waits. The scene is vibrant, featuring Amos Calloway and his circus folk, including Mr. Soggybottom, along with Edward’s mother and father, the Mayor, and many others who have joined them along the journey. As Ping scans the horizon with a watchful eye, Jing cuddles with her boyfriend, Norther Winslow. It is Ping who first spots the approaching Chevrolet. Will steps out of the car, feeling a deep sense of being overwhelmed by the gathered crowd."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As the first blue light of day seeps through the blinds, Will gradually awakens in his chair, feeling the strain from a restless sleep. Noticing his father Edward's labored breaths and frightened gaze, he offers water, which Edward refuses, signaling his need for something deeper. Will reads his father's silent plea, as Edward grapples with the reality of his fading presence, and feels the urge to call for help. Before he can act, Edward initiates a bold escape from the hospital, propelling his wheelchair with determination. Will quickly follows, joining forces with Sandra, who cleverly disrupts the security guards' pursuit. They narrowly escape as Will maneuvers the wheelchair into place, transferring Edward into the Chevrolet's passenger seat. As they race away, Edward drenches himself with water, captivated by Will’s story, while Karl the Giant helps clear their path through congested traffic. Reaching their destination by the river, they are met by a large, familiar crowd, including circus folks and townspeople, creating a poignant reunion. Overwhelmed, Will steps out, feeling the weight of this moment amidst the gathered friends and family."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "It's very early morning, and the first blue light of day, reminiscent of the serene early hours often celebrated in literature for their calm and introspection, is glowing through the vertical blinds. Still in his chair, Will wakes up a bit at a time with the notepad on his lap and the pen in his hand, then cracks his neck, crooked from sleeping on it wrong, a common discomfort after a night spent vigilantly by a loved one’s side. Wondering what woke him up, he looks to his right and holds his gaze for a breath. His father, Edward, is awake, silently gasping for breath as if the air itself were made of thorns, with eyes open, scared and confused. Edward shakes his head unambiguously, then nods, a silent language developed over years of understanding. Will pours a glass from the pitcher, which is filled with water from the local spring known for its crisp purity, on the nightstand and holds it to his father's lips, but Edward won't drink and pushes it away, wanting something else that perhaps only a son could understand. It takes Edward all his strength to put together each thought, feeling like he's only half-there, fighting to hang on to this world that he knows is slipping away. Will realizes something profound, and Edward nods again, looking around confused and increasingly scared, seeing the end approaching but not knowing exactly what's coming. Without the story, he's lost, as if in a dense fog, and fighting the urge to panic. Will looks around the room, increasingly desperate, and eyes the nurse call button, a small but potent promise of help, really wanting to press it. Edward waits for Will to begin but throws back the covers, and before Will can answer, he spots Edward rolling the chair himself, pumping both arms in a defiant show of strength and determination. Will dashes to catch up as the Heavyset Nurse leans out of Edward's hospital room, a routine guardian of the ward suddenly caught off-guard. Seeing security guards heading their way, a quick-thinking Sandra, known for her resourcefulness, shoves a nearby cart into them, bowling them down. Will brakes hard, sliding with both feet as the chair nearly crashes into the back wall while the doors close, a narrow escape suggesting they are part of something much larger. Racing Edward down the row, they finally reach the Chevrolet, a vintage model from the 1950s with a history of countless road trips and adventures, and Will lifts his father out of the chair and sets him in the passenger seat, then hands it off. Edward unscrews the cap, but instead of drinking it, douses himself and soaks the blanket, an act that seems to hold symbolic meaning to him. Will pops the trunk, and Edward, focused completely on Will's story that binds them together in a way words often cannot, enjoys that detail. Will stops short because of traffic backed up, honking to get around the jam, a familiar urban frustration. Then, up ahead, the cars start moving, shoved aside by massive hands as Karl the Giant, a legendary figure among them renowned for his unmatched strength, clears a path by brute force. Edward leans out the window and waves to Karl, who waves back with a grin that speaks of long-held camaraderie. They arrive at the same stretch of the river where it all began, a place steeped in personal history and emotional significance for them, where a crowd of more than 100 is waiting. Amos Calloway is here with the circus folk, a vibrant ensemble symbolizing the unexpected ties formed over a lifetime, including Mr. Soggybottom, as well as Edward's mother and father, the Mayor, and many others from along the way. While Ping, the keen-eyed observer of the group, scans the horizon, Jing nuzzles with her boyfriend, Norther Winslow, a poet believed to capture the essence of every moment in his verse. It's Ping who first spots the Chevrolet, her talents once again proving invaluable. Will gets out of the Chevrolet, overwhelmed by the crowd that represents the tapestry of his father's life."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Wondering what woke him up he looks to his right and holds his gaze for a breath It is very early morning and the first blue light of day is glowing through the vertical blinds Will realizes something and Edward nods again looking around confused and increasingly scared seeing the end approaching but not knowing exactly what is coming Still in his chair Will wakes up a bit at a time with the notepad on his lap and the pen in his hand then cracks his neck crooked from sleeping on it wrong Then up ahead the cars start moving shoved aside by massive hands as Karl the Giant clears a path by brute force Wondering what woke him up he looks to his right and holds his gaze for a breath His father Edward is awake silently gasping for breath with eyes open scared and confused Edward shakes his head unambiguously then nods His father Edward is awake silently gasping for breath with eyes open scared and confused It is very early morning and the first blue light of day is glowing through the vertical blinds Seeing security guards heading their way a quickthinking Sandra shoves a nearby cart into them bowling them down Will pours a glass from the pitcher on the nightstand and holds it to his father's lips but Edward will not drink and pushes it away wanting something else It takes Edward all his strength to put together each thought feeling like he is only halfthere fighting to hang on to this world It takes Edward all his strength to put together each thought feeling like he is only halfthere fighting to hang on to this world Will realizes something and Edward nods again looking around confused and increasingly scared seeing the end approaching but not knowing exactly what is coming Edward shakes his head unambiguously then nods Without the story he is lost and fighting the urge to panic Will looks around the room increasingly desperate and eyes the nurse call button really wanting to press it Will pops the trunk and Edward focused completely on Edward waits for Will to begin but throws back the covers and before Will can answer he spots Edward rolling the chair himself pumping both arms Will brakes hard sliding with both feet as the chair nearly crashes into the back wall while the doors close Will dashes to catch up as the Heavyset Nurse leans out of Edward's hospital room Amos Calloway is here with the circus folk including Mr Soggybottom as well as Edward's mother and father the Mayor and many others from along the way Seeing security guards heading their way a quickthinking Sandra shoves a nearby cart into them bowling them down Will brakes hard sliding with both feet as the chair nearly crashes into the back wall while the doors close Racing Edward down the row they finally reach the Chevrolet and Will lifts his father out of the chair and sets him in the passenger seat then hands it off Edward unscrews the cap but instead of drinking it douses himself and soaks the blanket While Ping scans the horizon Jing nuzzles with her boyfriend Norther Winslow Will pops the trunk and Edward focused completely on Will's story enjoys that detail Will stops short because of traffic backed up honking to get around the jam Edward leans out the window and waves to Karl who waves back It is Ping who first spots the Chevrolet Then up ahead the cars start moving shoved aside by massive hands as Karl the Giant clears a path by brute force Edward leans out the window and waves to Karl who waves back They arrive at the same stretch of the river where it all began where a crowd of more than 100 is waiting Amos Calloway is here with the circus folk including Mr Soggybottom as well as Edward's mother and father the Mayor and many others from along the way While Ping scans the horizon Jing nuzzles with her boyfriend Norther Winslow It is Ping who first spots the Chevrolet Will gets out of the Chevrolet overwhelmed by the crowd"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "It is very early morning and the first blue light of day is glowing through the vertical blinds. Still in his chair Will wakes up a bit at a time with the notepad on his lap and the pen in his hand then cracks his neck crooked from sleeping on it wrong. Wondering what woke him up he looks to his right and holds his gaze for a breath. His father Edward is awake silently gasping for breath with eyes open scared and confused. Edward shakes his head unambiguously then nods. Will pours a glass from the pitcher on the nightstand and holds it to his father's lips. but Edward will not drink and pushes it away wanting something else. It takes Edward all his strength to put together each thought feeling like he is only halfthere fighting to hang on to this world. Will realizes something and Edward nods again looking around confused and increasingly scared seeing the end approaching but not knowing exactly what is coming. Without the story he is lost and fighting the urge to panic. Will looks around the room increasingly desperate and eyes the nurse call button really wanting to press it. Edward waits for Will to begin but throws back the covers and before Will can answer he spots Edward rolling the chair himself pumping both arms. Will dashes to catch up as the Heavyset Nurse leans out of Edward's hospital room. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Seeing security guards heading their way a quickthinking Sandra shoves a nearby cart into them bowling them down. Will brakes hard sliding with both feet as the chair nearly crashes into the back wall while the doors close. Racing Edward down the row they finally reach the Chevrolet and Will lifts his father out of the chair and sets him in the passenger seat then hands it off. Edward unscrews the cap but instead of drinking it douses himself and soaks the blanket. Will pops the trunk and Edward focused completely on. Will's story enjoys that detail. Will stops short because of traffic backed up honking to get around the jam. Then up ahead the cars start moving shoved aside by massive hands as Karl the Giant clears a path by brute force. Edward leans out the window and waves to Karl who waves back. They arrive at the same stretch of the river where it all began where a crowd of more than 100 is waiting. Amos Calloway is here with the circus folk including Mr Soggybottom as well as Edward's mother and father the Mayor and many others from along the way. While Ping scans the horizon Jing nuzzles with her boyfriend Norther Winslow. It is Ping who first spots the Chevrolet. Will gets out of the Chevrolet overwhelmed by the crowd."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "It is very early morning and the first blue light of day is glowing through the vertical blinds. Still in his chair Will wakes up a bit at a time with the notepad on his lap and the pen in his hand then cracks his neck crooked from sleeping on it wrong. Wondering what woke him up he looks to his right and holds his gaze for a breath. His father Edward is awake silently gasping for breath with eyes open scared and confused. Edward shakes his head unambiguously then nods. Will pours a glass from the pitcher on the nightstand and holds it to his father's lips. but Edward will not drink and pushes it away wanting something else. It takes Edward all his strength to put together each thought feeling like he is only halfthere fighting to hang on to this world. Will realizes something and Edward nods again looking around confused and increasingly scared seeing the end approaching but not knowing exactly what is coming. Without the story he is lost and fighting the urge to panic. Will looks around the room increasingly desperate and eyes the nurse call button really wanting to press it. Edward waits for Will to begin but throws back the covers and before Will can answer he spots Edward rolling the chair himself pumping both arms. Will dashes to catch up as the Heavyset Nurse leans out of Edward's hospital room. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. Seeing security guards heading their way a quickthinking Sandra shoves a nearby cart into them bowling them down. Will brakes hard sliding with both feet as the chair nearly crashes into the back wall while the doors close. Racing Edward down the row they finally reach the Chevrolet and Will lifts his father out of the chair and sets him in the passenger seat then hands it off. Edward unscrews the cap but instead of drinking it douses himself and soaks the blanket. Will pops the trunk and Edward focused completely on. Will's story enjoys that detail. Will stops short because of traffic backed up honking to get around the jam. Then up ahead the cars start moving shoved aside by massive hands as Karl the Giant clears a path by brute force. Edward leans out the window and waves to Karl who waves back. They arrive at the same stretch of the river where it all began where a crowd of more than 100 is waiting. Amos Calloway is here with the circus folk including Mr Soggybottom as well as Edward's mother and father the Mayor and many others from along the way. While Ping scans the horizon Jing nuzzles with her boyfriend Norther Winslow. It is Ping who first spots the Chevrolet. Will gets out of the Chevrolet overwhelmed by the crowd."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "It is very early morning and the first blue light of day is glowing through the vertical blinds. Still in his chair Will wakes up a bit at a time with the notepad on his lap and the pen in his hand then cracks his neck crooked from sleeping on it wrong. Wondering what woke him up he looks to his right and holds his gaze for a breath. His father Edward is awake silently gasping for breath with eyes open scared and confused. Edward shakes his head unambiguously then nods. Will pours a glass from the pitcher on the nightstand and holds it to his father's lips. but Edward will not drink and pushes it away wanting something else. Then up ahead the cars start moving shoved aside by massive hands as Karl the Giant clears a path by brute force. Edward leans out the window and waves to Karl who waves back. They arrive at the same stretch of the river where it all began where a crowd of more than 100 is waiting. Amos Calloway is here with the circus folk including Mr Soggybottom as well as Edward's mother and father the Mayor and many others from along the way. While Ping scans the horizon Jing nuzzles with her boyfriend Norther Winslow. It is Ping who first spots the Chevrolet. Will gets out of the Chevrolet overwhelmed by the crowd."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "It is very early morning and the first blue light of day is glowing through the vertical blinds. Still in his chair Will wakes up a bit at a time with the notepad on his lap and the pen in his hand then cracks his neck crooked from sleeping on it wrong. Wondering what woke him up he looks to his right and holds his gaze for a breath. While Ping scans the horizon Jing nuzzles with her boyfriend Norther Winslow. It is Ping who first spots the Chevrolet. Will gets out of the Chevrolet overwhelmed by the crowd."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "It's very early morning, and the first blue light of day is glowing through the vertical blinds. Still in his chair, Max wakes up a bit at a time with the notepad on his lap and the pen in his hand, then cracks his neck, crooked from sleeping on it wrong. Wondering what woke him up, he looks to his right and holds his gaze for a breath. His sister, Jessica, is awake, silently gasping for breath, with eyes open, scared and confused. Jessica shakes her head unambiguously, then nods. Max pours a glass from the pitcher on the nightstand and holds it to his sister's lips, but Jessica won't drink and pushes it away, wanting something else. It takes Jessica all her strength to put together each thought, feeling like she's only half-there, fighting to hang on to this world. Max realizes something, and Jessica nods again, looking around confused and increasingly scared, seeing the end approaching but not knowing exactly what's coming. Without the story, she's lost and fighting the urge to panic. Max looks around the room, increasingly desperate, and eyes the nurse call button, really wanting to press it. Jessica waits for Max to begin but throws back the covers, and before Max can answer, she spots Jessica rolling the chair herself, pumping both arms. Max dashes to catch up as the Heavyset Cook leans out of Jessica's hospital room. Seeing security guards heading their way, a quick-thinking Oliver shoves a nearby cart into them, bowling them down. Max brakes hard, sliding with both feet as the chair nearly crashes into the back wall while the doors close. Racing Jessica down the row, they finally reach the Chevrolet, and Max lifts his sister out of the chair and sets her in the passenger seat, then hands it off. Jessica unscrews the cap but instead of drinking it, douses herself and soaks the blanket. Max pops the trunk, and Jessica, focused completely on Max's story, enjoys that detail. Max stops short because of traffic backed up, honking to get around the jam. Then, up ahead, the cars start moving, shoved aside by massive hands as Leonard the Giant clears a path by brute force. Jessica leans out the window and waves to Leonard, who waves back. They arrive at the same stretch of the river where it all began, where a crowd of more than 100 is waiting. Hugo Calloway is here with the circus folk, including Ms. Soggybottom, as well as Jessica's grandmother and grandfather, the Sheriff, and many others from along the way. While Lina scans the horizon, Mia nuzzles with her boyfriend, Southern Winslow. It's Lina who first spots the Chevrolet. Max gets out of the Chevrolet, overwhelmed by the crowd."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "It's very early morning, and the first pink light of day is glowing through the stained glass. Still in his hammock, Will wakes up a bit at a time with the sketchbook on his lap and the crayon in his hand, then cracks his neck, crooked from sleeping on it wrong. Wondering what woke him up, he looks to his right and holds his gaze for a breath. His father, Edward, is awake, silently gasping for breath, with eyes open, scared and confused. Edward shakes his head unambiguously, then nods. Will pours a mug from the teapot on the bookshelf and holds it to his father's lips, but Edward won't drink and pushes it away, wanting something else. It takes Edward all his strength to put together each thought, feeling like he's only half-there, fighting to hang on to this world. Will realizes something, and Edward nods again, looking around confused and increasingly scared, seeing the end approaching but not knowing exactly what's coming. Without the story, he's lost and fighting the urge to panic. Will looks around the tent, increasingly desperate, and eyes the light switch, really wanting to press it. Edward waits for Will to begin but throws back the curtains, and before Will can answer, he spots Edward rolling the wagon himself, pumping both arms. Will dashes to catch up as the Heavyset Nurse leans out of Edward's cabin. Seeing firefighters heading their way, a quick-thinking Sandra shoves a nearby ladder into them, bowling them down. Will brakes hard, sliding with both feet as the wagon nearly crashes into the back fence while the doors close. Racing Edward down the row, they finally reach the Volkswagen, and Will lifts his father out of the wagon and sets him in the passenger seat, then hands it off. Edward unscrews the jar but instead of drinking it, douses himself and soaks the towel. Will pops the glove compartment, and Edward, focused completely on Will's story, enjoys that detail. Will stops short because of traffic backed up, honking to get around the jam. Then, up ahead, the cars start moving, shoved aside by massive bulls as Karl the Giant clears a path by brute force. Edward leans out the window and waves to Karl, who waves back. They arrive at the same stretch of the forest where it all began, where a crowd of more than 100 is waiting. Amos Calloway is here with the carnival folk, including Mr. Dampbottom, as well as Edward's mother and father, the Governor, and many others from along the way. While Ping scans the horizon, Jing nuzzles with her boyfriend, Southern Winslow. It's Ping who first spots the Volkswagen. Will gets out of the Volkswagen, overwhelmed by the crowd."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "It's very early morning, and the first blue light of day is filtering through the vertical blinds. Still in his chair, Will drifts back to consciousness bit by bit with the notepad on his lap and the pen in his hand, then stretches his neck, tense from resting on it awkwardly. Curious about what disturbed his sleep, he glances to his right and holds his gaze for a moment. His father, Edward, is awake, silently mouthing words, with eyes open, perplexed and disoriented. Edward shakes his head clearly, then frowns. Will fills a glass from the pitcher on the nightstand and brings it to his father's lips, but Edward refuses to sip and moves it away, signaling for something else. Edward uses all his resolve to articulate each thought, feeling like he's barely present, struggling to remain in this world. Will understands something, and Edward frowns again, glancing around bewildered and increasingly anxious, sensing the end nearing but not knowing exactly what's approaching. Lacking the narrative, he's adrift and resisting the urge to panic. Will scans the room, increasingly frantic, and sets his eyes on the nurse call button, really wanting to press it. Edward waits for Will to start but uncovers himself, and before Will can speak, he notices Edward rolling the chair himself, flexing both arms. Will hurries to catch up as the Heavyset Nurse peers out of Edward's hospital room. Noticing security guards approaching, a quick-thinking Sandra tips over a nearby cart into them, blocking their path. Will halts quickly, sliding with both feet as the chair nearly hits the back wall while the doors close. Racing Edward down the row, they eventually reach the Chevrolet, and Will picks his father out of the chair and places him in the passenger seat, then hands it off. Edward loosens the cap but instead of sipping it, drenches himself and soaks the blanket. Will shuts the trunk, and Edward, engrossed completely in Will's tale, appreciates that detail. Will comes to a halt due to traffic piled up, honking to bypass the jam. Then, up ahead, the cars begin moving, pushed aside by enormous hands as Karl the Giant clears a path by sheer strength. Edward leans out the window and gestures to Karl, who gestures back. They arrive at the same part of the river where it all began, where a crowd of more than 100 is waiting. Amos Calloway is here with the circus folk, including Mr. Soggybottom, as well as Edward's mother and father, the Mayor, and many others from along the journey. While Ping examines the horizon, Jing snuggles with her boyfriend, Norther Winslow. It's Ping who first notices the Chevrolet. Will steps out of the Chevrolet, moved by the crowd."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "It's very early morning, and the first golden light of dawn is filtering through the stained glass windows. Still in his hammock, the bookshelf wakes up a bit at a time with the tablet on its lap and the crayon in its hand, then stretches its arm, cramped from resting on it wrong. Wondering what woke it up, it glances to its left and fixes its stare for a beat. Its sister, Margaret, is awake, silently gasping for air, with eyes open, frightened and bewildered. Margaret shakes her leg unambiguously, then nods. The bookshelf fills a mug from the teapot on the windowsill and holds it to its sister's lips, but Margaret won’t sip and pushes it away, craving something else. It takes Margaret all her energy to form each thought, feeling like she's only half-there, struggling to remain in this world. The bookshelf realizes something, and Margaret nods again, looking around bewildered and increasingly frightened, sensing the end nearing but not sure exactly what's coming. Without the map, she's lost and resisting the urge to panic. The bookshelf glances around the garden, increasingly frantic, and eyes the emergency flare button, really wanting to press it. Margaret waits for the bookshelf to start but tosses back the blankets, and before the bookshelf can respond, it spots Margaret rolling the tricycle herself, pumping both legs. The bookshelf rushes to catch up as the Tall Nurse leans out of Margaret's dorm room. Spotting firefighters heading their way, a quick-thinking Stephanie shoves a nearby skateboard into them, knocking them down. The bookshelf brakes hard, sliding with both legs as the tricycle nearly crashes into the stone wall while the gates close. Racing Margaret down the aisle, they finally reach the Volkswagen, and the bookshelf lifts its sister out of the tricycle and sets her in the driver's seat, then hands it off. Margaret unscrews the lid but instead of drinking it, douses herself and drenches the scarf. The bookshelf pops the glove compartment, and Margaret, focused completely on the bookshelf's song, relishes that tune. The bookshelf halts abruptly because of bicycles piled up, honking to get past the bottleneck. Then, up ahead, the wagons start rolling, shifted aside by massive paws as Linus the Giant clears a passage by raw strength. Margaret leans out the sunroof and waves to Linus, who waves back. They arrive at the same bend of the highway where it all started, where a gathering of more than 100 is anticipating. Agnes Whittaker is here with the fair folk, including Dr. Raindrop, as well as Margaret's brother and sister, the Principal, and many others from along the journey. While Ling surveys the skyline, Lang cuddles with her partner, Southern Hemsworth. It's Ling who first spots the Volkswagen. The bookshelf gets out of the Volkswagen, overwhelmed by the gathering."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "It's very early morning, and the first blue light of day is glowing through the vertical blinds. Still in his hammock, Alex dozes off a bit at a time with the newspaper on his lap and the pencil in his hand, then rubs his forehead, sore from resting on it wrong. Pondering what stirred him awake, he glances to his right and fixes his gaze for a breath. His uncle, Harold, is alert, silently laughing, with eyes open, curious and amused. Harold shakes his leg unambiguously, then shrugs. Alex brews a cup from the thermos on the nightstand and holds it to his uncle's lips, but Harold won't sip and swats it away, craving something else. It takes Harold all his courage to piece together each feeling, sensing like he's only half-there, striving to hang on to this moment. Alex understands something, and Harold shrugs again, glancing around curious and increasingly amazed, sensing changes approaching but not knowing exactly what's happening. Without the guide, he's bewildered and fighting the urge to giggle. Alex scans the room, increasingly anxious, and eyes the emergency call button, really yearning to press it. Harold waits for Alex to begin but flips back the blankets, and before Alex can react, he notices Harold wheeling the scooter himself, flapping both arms. Alex sprints to catch up as the Petite Nurse leans out of Harold's hospital room. Seeing cleaners heading their way, a quick-thinking Julia hurls a nearby mop into them, tripping them down. Alex halts hard, sliding with both feet as the scooter nearly bumps into the back wall while the doors shut. Zooming Harold down the aisle, they finally reach the Volkswagen, and Alex lifts his uncle out of the scooter and places him in the passenger seat, then waves it off. Harold twists the cap but instead of tasting it, splashes himself and drenches the towel. Alex opens the glove compartment, and Harold, engrossed completely in Alex's tale, savors that element. Alex halts abruptly because of pedestrians backed up, shouting to get past the blockage. Then, up ahead, the people start moving, swept aside by enormous paws as Greta the Giantess clears a route by sheer strength. Harold leans out the window and salutes to Greta, who salutes back. They arrive at the same bend of the river where it all commenced, where a gathering of more than 100 is anticipating. Marcus Calloway is here with the carnival folks, including Mr. Raindrop, as well as Harold's aunt and uncle, the Sheriff, and many others from along the journey. While Pong surveys the skyline, Jang cuddles with her girlfriend, Southern Winslow. It's Pong who first notices the Volkswagen. Alex gets out of the Volkswagen, astounded by the gathering."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "It's very early afternoon, and the first golden glow of sunset is seeping through the horizontal curtains. Still in his couch, Will drifts in and out of a nap with the magazine on his chest and the spoon in his hand, then stretches his arms, cramped from lounging in it awkwardly. Curious about the disturbance, he glances to his left and squints for a moment. His father, Edward, is alert, silently mouthing words, with eyes wide, bewildered and startled. Edward nods ambiguously, then shakes his head. Will fills a bowl from the jug on the coffee table and offers it to his father's nose, but Edward won't sniff and bats it away, needing something different. It takes Edward all his effort to string together each word, feeling like he's only partly-present, struggling to hold on to this reality. Will notices something, and Edward shakes his head again, glancing around bewildered and increasingly startled, sensing the close but not knowing exactly what's happening. Without the tale, he's adrift and battling the urge to shout. Will scans the room, increasingly anxious, and eyes the emergency button, really needing to avoid it. Edward waits for Will to proceed but kicks off the covers, and before Will can respond, he notices Edward wheeling the table himself, flailing both legs. Will sprints to keep up as the Slender Nurse steps out of Edward's hospital ward. Seeing maintenance workers approaching, a resourceful Sandra hurls a nearby bookshelf into them, scattering them. Will skids to a stop, sliding with both hands as the table nearly collides with the side wall while the windows close. Whisking Edward down the pathway, they finally reach the Volkswagen, and Will drags his father out of the table and places him in the driver’s seat, then passes it over. Edward twists the lid but instead of sipping it, drenches himself and drenches the scarf. Will opens the glove compartment, and Edward, entirely consumed by Will's narrative, relishes that component. Will halts abruptly because of congestion building up, sounding his horn to bypass the gridlock. Then, up ahead, the buses start shifting, moved aside by enormous feet as Tina the Colossal clears a trail by sheer strength. Edward leans out the roof and salutes Tina, who salutes back. They reach the same stretch of the meadow where it all began, where an assembly of more than 100 is gathered. Amos Calloway is here with the fair folk, including Mr. Raindrop, as well as Edward's aunt and uncle, the Sheriff, and many others from around the journey. While Ping scrutinizes the skyline, Jing cuddles with her partner, Souther Winslow. It's Ping who first catches sight of the Volkswagen. Will steps out of the Volkswagen, engulfed by the assembly."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "It's incredibly late afternoon, and the initial red glow of evening is dimming through the horizontal curtains. Still in his hammock, Jerry dozes off a bit by bit with the cookbook on his stomach and the spoon in his elbow, then tilts his knee, twisted from resting on it awkwardly. Pondering what lulled him to sleep, he glances to his left and fixes his gaze for a sigh. His aunt, Margaret, is asleep, quietly humming a tune, with ears shut, calm and content. Margaret twirls her finger subtly, then claps. Jerry flips a coin from the jar on the dresser and presses it to his aunt's palm, but Margaret won't hold and drops it, seeking another option. It takes Margaret all her patience to piece together each song, feeling as though she's only partially-present, struggling to slip into this dream. Jerry notices something, and Margaret claps again, glancing around contented and increasingly calm, perceiving the finish departing but not grasping precisely what's leaving. Without the music, she's found and feeling the urge to dance. Jerry surveys the yard, increasingly alert, and eyes the cat toy, really yearning to paw it. Margaret waits for Jerry to conclude but flips over the cushions, and before Jerry can respond, he notices Margaret folding the blanket herself, waving both feet. Jerry sprints to catch up as the Tall Chef peers out of Margaret's kitchen. Noticing firemen nearing their location, a quick-thinking Linda rolls a nearby table into them, tripping them up. Jerry leaps high, gliding with both hands as the blanket nearly floats into the front door while the curtains shut. Strolling Margaret up the path, they eventually reach the Scooter, and Jerry places his aunt out of the blanket and seats her in the potted plant, then passes it across. Margaret tightens the lid but instead of sealing it, splashes herself and drenches the donut. Jerry pops the umbrella, and Margaret, focused completely on Jerry's music, relishes that tune. Jerry halts briefly due to pedestrians blocked up, singing to get past the throng. Then, up ahead, the people start shifting, tugged aside by tiny beaks as Polly the Parrot clears a path by sheer charm. Margaret bends out the hatch and gestures to Polly, who flaps back. They reach the different edge of the meadow where nothing finished, where a troupe of fewer than 50 is departing. Lucille Ball is absent with the actors folk, excluding Mrs. Peppermint, as well as Margaret's sister and brother, the Sheriff, and few others from afar. While Yang squints at the skyline, Yin cuddles with her cousin, Southern Weather. It's Yang who first hides the Scooter. Jerry steps into the Scooter, underwhelmed by the troupe."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In the early morning, Will wakes up in a chair beside his father Edward, who is gasping for breath and appears scared and confused. Edward, feeling detached and struggling to stay in the moment, seems to be indicating he wants something other than water. Will senses Edward’s fear of the approaching end and contemplates calling the nurse but instead follows Edward's lead as he throws back the covers and begins to roll his chair. They make a hasty escape, with Sandra aiding by diverting security guards with a cart. Racing down the hallway, Will helps Edward into their Chevrolet, and Edward soaks himself with a blanket rather than drinking the water. As they navigate traffic, Karl the Giant clears a path, enabling them to reach a familiar stretch of river. A large crowd, including circus folk and various familiar faces from Edward's life, awaits their arrival. Will exits the Chevrolet, overwhelmed by the turnout."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Will gets out of the Chevrolet overwhelmed by the crowd It is Ping who first spots the Chevrolet While Ping scans the horizon Jing nuzzles with her boyfriend Norther Winslow Amos Calloway is here with the circus folk including Mr Soggybottom as well as Edward's mother and father the Mayor and many others from along the way They arrive at the same stretch of the river where it all began where a crowd of more than 100 is waiting Edward leans out the window and waves to Karl who waves back Then up ahead the cars start moving shoved aside by massive hands as Karl the Giant clears a path by brute force Will stops short because of traffic backed up honking to get around the jam Will's story enjoys that detail Will pops the trunk and Edward focused completely on Edward unscrews the cap but instead of drinking it douses himself and soaks the blanket Racing Edward down the row they finally reach the Chevrolet and Will lifts his father out of the chair and sets him in the passenger seat then hands it off Will brakes hard sliding with both feet as the chair nearly crashes into the back wall while the doors close Seeing security guards heading their way a quickthinking Sandra shoves a nearby cart into them bowling them down Will dashes to catch up as the Heavyset Nurse leans out of Edward's hospital room Edward waits for Will to begin but throws back the covers and before Will can answer he spots Edward rolling the chair himself pumping both arms Will looks around the room increasingly desperate and eyes the nurse call button really wanting to press it Without the story he is lost and fighting the urge to panic Will realizes something and Edward nods again looking around confused and increasingly scared seeing the end approaching but not knowing exactly what is coming It takes Edward all his strength to put together each thought feeling like he is only halfthere fighting to hang on to this world but Edward will not drink and pushes it away wanting something else Will pours a glass from the pitcher on the nightstand and holds it to his father's lips Edward shakes his head unambiguously then nods His father Edward is awake silently gasping for breath with eyes open scared and confused Wondering what woke him up he looks to his right and holds his gaze for a breath Still in his chair Will wakes up a bit at a time with the notepad on his lap and the pen in his hand then cracks his neck crooked from sleeping on it wrong It is very early morning and the first blue light of day is glowing through the vertical blinds"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Edward unscrews the cap but instead of drinking it douses himself and soaks the blanket Will dashes to catch up as the Heavyset Nurse leans out of Edward's hospital room Without the story he is lost and fighting the urge to panic Will gets out of the Chevrolet overwhelmed by the crowd Will stops short because of traffic backed up honking to get around the jam but Edward will not drink and pushes it away wanting something else Will pours a glass from the pitcher on the nightstand and holds it to his father's lips Will looks around the room increasingly desperate and eyes the nurse call button really wanting to press it Racing Edward down the row they finally reach the Chevrolet and Will lifts his father out of the chair and sets him in the passenger seat then hands it off They arrive at the same stretch of the river where it all began where a crowd of more than 100 is waiting Edward waits for Will to begin but throws back the covers and before Will can answer he spots Edward rolling the chair himself pumping both arms Will's story enjoys that detail Still in his chair Will wakes up a bit at a time with the notepad on his lap and the pen in his hand then cracks his neck crooked from sleeping on it wrong Will brakes hard sliding with both feet as the chair nearly crashes into the back wall while the doors close While Ping scans the horizon Jing nuzzles with her boyfriend Norther Winslow Seeing security guards heading their way a quickthinking Sandra shoves a nearby cart into them bowling them down Wondering what woke him up he looks to his right and holds his gaze for a breath Will pops the trunk and Edward focused completely on It is Ping who first spots the Chevrolet Edward shakes his head unambiguously then nods Edward leans out the window and waves to Karl who waves back It takes Edward all his strength to put together each thought feeling like he is only halfthere fighting to hang on to this world Will realizes something and Edward nods again looking around confused and increasingly scared seeing the end approaching but not knowing exactly what is coming Amos Calloway is here with the circus folk including Mr Soggybottom as well as Edward's mother and father the Mayor and many others from along the way It is very early morning and the first blue light of day is glowing through the vertical blinds His father Edward is awake silently gasping for breath with eyes open scared and confused Then up ahead the cars start moving shoved aside by massive hands as Karl the Giant clears a path by brute force"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Will brakes hard sliding with both feet as the chair nearly crashes into the back wall while the doors close Racing Edward down the row they finally reach the Chevrolet and Will lifts his father out of the chair and sets him in the passenger seat then hands it off Edward unscrews the cap but instead of drinking it douses himself and soaks the blanket Will pops the trunk and Edward focused completely on Will's story enjoys that detail Will stops short because of traffic backed up honking to get around the jam Then up ahead the cars start moving shoved aside by massive hands as Karl the Giant clears a path by brute force Edward leans out the window and waves to Karl who waves back They arrive at the same stretch of the river where it all began where a crowd of more than 100 is waiting Amos Calloway is here with the circus folk including Mr Soggybottom as well as Edward's mother and father the Mayor and many others from along the way While Ping scans the horizon Jing nuzzles with her boyfriend Norther Winslow It is Ping who first spots the Chevrolet Will gets out of the Chevrolet overwhelmed by the crowd It is very early morning and the first blue light of day is glowing through the vertical blinds Still in his chair Will wakes up a bit at a time with the notepad on his lap and the pen in his hand then cracks his neck crooked from sleeping on it wrong Wondering what woke him up he looks to his right and holds his gaze for a breath His father Edward is awake silently gasping for breath with eyes open scared and confused Edward shakes his head unambiguously then nods Will pours a glass from the pitcher on the nightstand and holds it to his father's lips but Edward will not drink and pushes it away wanting something else It takes Edward all his strength to put together each thought feeling like he is only halfthere fighting to hang on to this world Will realizes something and Edward nods again looking around confused and increasingly scared seeing the end approaching but not knowing exactly what is coming Without the story he is lost and fighting the urge to panic Will looks around the room increasingly desperate and eyes the nurse call button really wanting to press it Edward waits for Will to begin but throws back the covers and before Will can answer he spots Edward rolling the chair himself pumping both arms Will dashes to catch up as the Heavyset Nurse leans out of Edward's hospital room Seeing security guards heading their way a quickthinking Sandra shoves a nearby cart into them bowling them down"
        }
      ]
    }
  ]
}