{
  "ground_truth": "Ahead lies a tiny one-street town, smaller even than Ashton, with powerlines emerging from the woods to feed it. Dangling from the line above are two dozen pairs of shoes, their laces tied together. The main street has stores on each side: Cole's Pharmacy, Talbot's Five and Dime, Al's Country Store. Everything is old, but this isn't a ghost town. A group of about 20 citizens spill out to see Edward approach; most are smiling, and all of these people are barefoot. A forty-year-old man named Beamen comes out of the seed store to greet Edward. Friendly but a little drunk, he's the closest thing the town has to a mayor, carrying a clipboard. Beamen checks the clipboard, still looking, still confused, until a helpful woman named Mildred chimes in. Beamen's daughter Jenny, eight years old, hides behind her father, peering around to look at the handsome stranger. He didn't mean it as a joke, but for some reason, everyone is laughing. Sitting at the kitchen table, Edward takes a second slice of apple pie. He and Beamen are joined by Norther Winslow, who fancies himself a cultured artist, though he's never left the state. Young Jenny is stealthily untying the laces on Edward's shoes. Suddenly, Jenny yanks off Edward's shoes and races for the door, with him chasing after her. As she runs, Jenny ties Edward's laces together. Reaching the edge of town, she tosses the shoes up and around the power line with a perfect throw. The gathered citizens of Spectre cheer for Edward, who is confused and overwhelmed. The women hug him, and the men shake his hand, all while he is still focused on his shoes. The townsfolk continue to congratulate Edward, and Norther grabs his notebook back. Edward looks to the bank, where young Jenny Hill is watching him, embarrassed to admit it. He starts to wade back to the bank and climbs onto the shore, completely drenched, pulling up his pant legs to reveal three shiny leeches clinging to his skin, eager to get off this subject. Lanterns and streamers hang on cables across the street, and a small stage has been built at one end to hold fiddlers. The whole town is there in celebration of its newest citizen, Edward Bloom. Before he can protest, two women grab him by the arms, pulling him in to dance with them. The resulting dance number seems both choreographed and complete chaos. From farmer to baker's wife, everyone wants to dance with Edward, who finds himself tossed around like a stick caught in a whirlpool, though he is having a blast. Jenny grabs both his hands, and they spin wildly until Beamen plucks his laughing daughter away to dance with her.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Ahead lies a small one-street village, tinier even than Ashton, with powerlines emerging from the forest to supply it. Hanging from the line above are two dozen pairs of footwear, their laces tied together. The main avenue has shops on each side: Cole's Apothecary, Talbot's Five and Dime, Al's Country Shop. Everything is aged, but this isn't a ghost village. A group of about 20 residents spill out to see Edward approach; most are grinning, and all of these folks are barefoot. A forty-year-old male named Beamen comes out of the seed shop to greet Edward. Amiable but a little intoxicated, he's the closest thing the village has to a mayor, carrying a clipboard. Beamen checks the clipboard, still gazing, still baffled, until a helpful lady named Mildred chimes in. Beamen's daughter Jenny, eight years old, hides behind her father, peering around to look at the handsome outsider. He didn't mean it as a jest, but for some reason, everyone is chuckling. Sitting at the kitchen table, Edward takes a second slice of apple tart. He and Beamen are joined by Norther Winslow, who considers himself a cultured artist, though he's never left the province. Young Jenny is stealthily untying the laces on Edward's footwear. Suddenly, Jenny yanks off Edward's shoes and sprints for the door, with him pursuing her. As she runs, Jenny ties Edward's laces together. Reaching the edge of the village, she tosses the footwear up and around the power line with a perfect throw. The gathered citizens of Spectre cheer for Edward, who is baffled and overwhelmed. The women hug him, and the men shake his hand, all while he is still focused on his footwear. The townsfolk continue to congratulate Edward, and Norther grabs his notebook back. Edward looks to the bank, where young Jenny Hill is watching him, embarrassed to admit it. He starts to wade back to the bank and climbs onto the shore, completely drenched, pulling up his pant legs to reveal three shiny leeches clinging to his skin, eager to get off this topic. Lanterns and streamers hang on cables across the avenue, and a small platform has been built at one end to hold fiddlers. The whole village is there in celebration of its newest resident, Edward Bloom. Before he can protest, two women grab him by the arms, pulling him in to dance with them. The resulting dance number seems both choreographed and complete chaos. From farmer to baker's wife, everyone wants to dance with Edward, who finds himself tossed around like a stick caught in a whirlpool, though he is having a blast. Jenny grabs both his hands, and they spin wildly until Beamen plucks his laughing daughter away to dance with her."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Ahead lies a tiny one-street town, smaller even than Ashton, with powerlines that emerge from the woods to feed it. Two dozen pairs of shoes are dangling from the line above, with their laces tied together. Stores are lined up on each side of the main street: Cole's Pharmacy, Talbot's Five and Dime, Al's Country Store. Everything is old, but this isn't considered a ghost town. Edward is spilled out to be seen by a group of about 20 citizens; most are smiling, and all of these people are barefoot. Edward is greeted by a forty-year-old man named Beamen, who comes out of the seed store. Friendly but a little drunk, he is the closest thing to a mayor that the town has, carrying a clipboard. Beamen, still looking and still confused, checks the clipboard until Mildred, a helpful woman, chimes in. Jenny, Beamen's eight-year-old daughter, is peering around to look at the handsome stranger while she hides behind her father. It was not meant by him as a joke, but for some reason, laughter erupts from everyone. Edward, sitting at the kitchen table, is taking a second slice of apple pie. Norther Winslow, who joins him and Beamen, fancies himself a cultured artist, though the state has never been left by him. Edward's shoes are being stealthily untied by young Jenny. Suddenly, Edward's shoes are yanked off by Jenny, who races for the door, with him being chased by her. As she runs, Edward's laces are tied together by Jenny. Jenny, reaching the edge of town, tosses the shoes up and around the power line with a perfect throw. Spectre's gathered citizens cheer for Edward, feeling confused and overwhelmed. Women hug him, and men shake his hand, all while his shoes are still focused on. Edward is continued to be congratulated by the townsfolk, and Norther grabs back his notebook. Edward sees Jenny Hill at the bank, who is watching him, embarrassed to admit it. He wades back to the bank and climbs onto the shore, completely drenched, with pant legs being pulled up to reveal three shiny leeches that cling to his skin, eager to get off the subject. Lanterns and streamers are hung on cables across the street, and a small stage has been built at one end to hold fiddlers. The whole town is celebrating its newest citizen, Edward Bloom. Before a protest can be made by him, his arms are grabbed by two women, pulling him in to dance with them. The resulting dance number is both choreographed and complete chaos. From farmer to baker's wife, everyone wants to dance with Edward, who is tossed around like a stick caught in a whirlpool, though having a blast is he. Jenny grabs both his hands, and they spin wildly until Beamen plucks his laughing daughter away to dance with her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Ahead lies a one-street town, smaller than Ashton, with powerlines from the woods. Two dozen pairs of shoes hang from the line above. The main street has Cole's Pharmacy, Talbot's Five and Dime, and Al's Country Store. Though old, it’s not a ghost town. About 20 citizens, all barefoot, greet Edward; most are smiling. Beamen, a friendly yet tipsy man around forty and the town's closest thing to a mayor, approaches with a clipboard. Mildred helps him as his daughter Jenny, eight, peers at Edward, the handsome stranger. Edward unintentionally amuses everyone. Seated at the kitchen table, Edward eats apple pie with Beamen and Norther Winslow, a self-proclaimed artist. Jenny unties Edward’s shoes and races to toss them onto the power line. Citizens cheer as Edward is overwhelmed; women hug him, and men shake his hand. As he wades back to the bank, leeches cling to his skin. Lanterns, streamers, and a small stage with fiddlers set the celebratory scene for Edward Bloom, the town's newest citizen. Women pull him into a chaotic yet fun dance involving everyone. Jenny spins with Edward until Beamen dances with her."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Ahead lies a one-street town, smaller than Ashton, with powerlines from the woods. Hanging above are two dozen pairs of tied shoes. The main street features Cole's Pharmacy, Talbot's Five and Dime, Al's Country Store. It's not a ghost town—20 citizens, barefoot and smiling, greet Edward. Beamen, a 40-year-old man, emerges from the seed store. Friendly but tipsy, he's the nearest thing to a mayor, clipboard in hand. Mildred assists him while Beamen's daughter, Jenny, peeks at Edward. Everyone laughs unexpectedly. At the kitchen table, Edward eats a second slice of pie with Beamen and Norther Winslow, an artist who's never left the state. Jenny stealthily unties Edward's laces, then yanks his shoes off and runs. She ties the laces and throws the shoes onto the power line. Spectre's citizens cheer for Edward, who is bewildered. Women hug him, men shake his hand. He notices Jenny Hill watching him from the bank. Wading there, he climbs out, revealing three leeches on his legs. Lanterns and streamers hang across the street, with a stage for fiddlers. The whole town celebrates Edward Bloom, their newest citizen. Two women pull him into a dance. The dance is both choreographed and chaotic. Everyone, from farmers to the baker's wife, dances with Edward, who is having a blast. Jenny spins with him until Beamen takes her to dance."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Ahead lies a quaint and minuscule one-street town, tinier even than the nearby village of Ashton. As you approach, powerlines mysteriously emerge from the depths of the surrounding woods, extending their cables to provide energy to this settlement. Suspended from the line above are approximately two dozen pairs of shoes, each pair with its laces tied tightly together, creating a peculiar sight. The primary street is flanked on either side by a series of stores: Cole's Pharmacy, Talbot's Five and Dime, and Al's Country Store. While everything appears aged and venerable, this place is far from being a ghost town. A small group comprised of approximately 20 local citizens emerges to witness Edward's arrival; most wear pleasant smiles, and all are remarkable for being barefoot. A man of around forty years, known as Beamen, steps out of the seed store to warmly welcome Edward. Though friendly, he is slightly inebriated and is regarded as the closest entity in the town resembling a mayor. Beamen holds a clipboard in his hands. He examines his clipboard, yet continues to look somewhat puzzled until a considerate woman named Mildred interjects with assistance. Beamen's eight-year-old daughter, Jenny, shyly hides behind her father, curiously peeking around him to catch a glimpse of the attractive stranger. Although he didn't intend it to be humorous, for some unknown reason, everyone bursts into laughter. \n\nSeated comfortably at the kitchen table, Edward reaches for and enjoys a second slice of delicious apple pie. He is joined by Beamen, as well as Norther Winslow, a man who considers himself an artist of cultured refinement, despite never having traveled beyond the state borders. Meanwhile, young Jenny is quietly working to untie the laces on Edward's shoes, acting with a playful stealthiness. Suddenly, Jenny yanks Edward's shoes free and makes a dash for the door, prompting him to chase after her. As she runs, Jenny skillfully ties Edward's laces together. Upon reaching the town's perimeter, she expertly tosses the shoes up and around the power line with an impressive, perfect throw. The citizens of Spectre, who have gathered to witness this, cheer for Edward, who is understandably both bewildered and overwhelmed by the unexpected events. The women in the crowd embrace him warmly, while the men extend their hands for a handshake, all the while Edward remains preoccupied with the thought of his shoes. The townsfolk continue to offer their congratulations to him, and Norther seizes the opportunity to retrieve his notebook. Edward then glances toward the bank, where young Jenny Hill gazes at him, almost embarrassed to acknowledge her interest. \n\nEdward begins to make his way back to the bank, climbing onto the shore completely drenched and in the process, he rolls up his pant legs to expose three shiny leeches clinging to his skin, eager to shift the focus from this topic. Overhead, lanterns and streamers gracefully hang from cables that stretch across the street, and a small stage has been erected at one end to accommodate fiddlers. The entire town has gathered to celebrate and welcome its newest citizen, Edward Bloom. Before he can voice any objections, two women take hold of his arms and enthusiastically pull him in to join them in a lively dance. The resulting dance sequence is both a well-coordinated affair and a display of complete chaos. From the town's farmer to the baker's wife, everyone is eager to dance with Edward, who finds himself being joyfully passed around like a stick caught in a swirling whirlpool—an experience he thoroughly enjoys. Jenny seizes both of his hands, and together they spin wildly until Beamen gently rescues his laughing daughter to engage in a dance with her."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Ahead stretches a quaint and minuscule one-street town, even smaller than the nearby village known as Ashton. As you draw closer, powerlines mysteriously emerge from the hidden depths of the encircling woods, extending their cables outward to deliver energy and electricity to this little settlement. Hanging from the line above are roughly two dozen pairs of shoes, each pair with its laces tied tightly together, creating a unique and peculiar sight. The primary street is flanked on either side by a series of charming, old-fashioned stores: Cole's Pharmacy, Talbot's Five and Dime, and the ever-welcoming Al's Country Store. Although everything appears aged and venerable, this place is far from being a ghost town long forgotten. A small group, composed of approximately twenty local citizens, emerges to witness Edward's anticipated arrival; most wear pleasant and warm smiles, and all are remarkable for being completely barefoot. A man of around forty years, named Beamen, steps forth from the seed store to warmly welcome Edward. Though friendly and approachable, he is slightly inebriated and is regarded by many as the closest entity in the town resembling a mayor. Beamen holds a clipboard firmly in his hands. He examines it with a furrowed brow of confusion, yet continues to look somewhat puzzled until a considerate and helpful woman named Mildred kindly interjects with assistance. Beamen's eight-year-old daughter, Jenny, shyly hides behind her father, curiously peeking around him to catch a glimpse of the handsome stranger. Although he didn’t intend it to be humorous, for some unknown reason, everyone bursts into hearty laughter. \n\nSeated comfortably at the kitchen table, Edward reaches for and indulges in a second slice of delicious apple pie. He is joined by Beamen, as well as Norther Winslow, a man who considers himself an artist of cultured refinement, despite the fact that he has never traveled beyond the state borders. Meanwhile, young Jenny is quietly working to untie the laces on Edward's shoes, acting with playful stealth and cunning. Suddenly, Jenny yanks Edward's shoes free and makes a dash for the door, prompting him to spring up and chase after her. As she runs, Jenny skillfully ties Edward's laces together. Upon reaching the town's perimeter, she expertly tosses the now liberated shoes up and around the power line with an impressive, perfect throw. The citizens of Spectre, who have gathered to witness this event, cheer for Edward, who is understandably both bewildered and overwhelmed by the sudden and unexpected turn of events. The women in the crowd embrace him warmly, while the men extend their hands in the spirit of friendship for a handshake, all the while Edward remains preoccupied with the thought of his shoes dangling above. The townsfolk continue to offer their congratulations to him, and Norther seizes the opportunity to retrieve his ever-present notebook. Edward then glances toward the bank, where young Jenny Hill gazes at him, almost embarrassed to acknowledge her clear interest.\n\nEdward begins to make his way back to the bank, climbing onto the shore completely drenched, and in the process, he rolls up his pant legs to expose three shiny leeches clinging to his skin, eager to shift the focus from this rather unappealing topic. Overhead, lanterns and colorful streamers gracefully hang from the cables that stretch across the street, and a small stage has been erected at one end to accommodate the lively fiddlers. The entire town has gathered to celebrate and warmly welcome its newest citizen, Edward Bloom. Before he can voice any possible objections, two enthusiastic women take hold of his arms and energetically pull him in to join them in a lively and spirited dance. The resulting dance sequence is both a well-coordinated affair and a display of complete, joyous chaos. From the town's farmer to the baker's wife, everyone is eager and delighted to dance with Edward, who finds himself being joyfully passed around like a stick caught in a swirling whirlpool—an experience he thoroughly enjoys. Jenny seizes both of his hands, and together they spin wildly until Beamen gently rescues his laughing daughter to engage in a lively dance with her."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "In the distance, a tiny one-street town comes into view, remarkably smaller even than Ashton, with powerlines snaking out from the woods to supply it with electricity. Suspended from the line overhead are two dozen pairs of shoes, neatly tied together by their laces. Along the main street, stores stand silently on each side: Cole's Pharmacy, Talbot's Five and Dime, and Al's Country Store, betraying an air of age that tells a story of the past, yet it is clear that this is no ghost town. A group of roughly 20 citizens begin to spill out onto the street, eagerly coming forth to witness Edward's approach; the atmosphere is warm, most display broad smiles, and conspicuously, all are barefoot. As Edward draws closer, a man of about forty, known as Beamen, emerges from the seed store greeting him. Although friendly, Beamen carries a hint of intoxication; unofficially, he is the closest thing the town has to a mayor, clutching a clipboard as his emblem of office. As he glances at the clipboard, his expression conveys confusion, and without a word spoken, a woman named Mildred steps in to help. Meanwhile, young Jenny, Beamen's eight-year-old daughter, is positioned strategically behind her father, peeking out with curiosity to glance at the handsome newcomer. Edward unintentionally prompts laughter from the crowd, though his intent was never humorous. Sitting at a kitchen table later, Edward leisurely indulges in a second slice of apple pie. His company includes Beamen and Norther Winslow, who aspires to be seen as a cultured artist despite never having ventured beyond the state lines. At the same moment, Jenny, with stealth and playfulness, discretely unties the laces on Edward's shoes. Without warning, she snatches away his shoes and bolts for the door, compelling him to chase after her in surprise. As swift as a breeze, Jenny expertly ties Edward's laces together while sprinting and, upon reaching the town's edge, launches the shoes up and over the power line with impeccable precision. The gathered townspeople of Spectre erupt in cheerful applause for Edward, who stands amidst them bewildered yet amazed. In the midst of his distraction over his shoes, the women of the town envelop Edward in hugs and the men extend their hands for firm shakes, each congratulating him. Even as Norther retrieves his notebook, Edward's attention drifts momentarily to the bank where young Jenny Hill observes him shyly, trying to hide her embarrassment. He instinctively begins to make his way back toward the bank, wading through the water before climbing ashore utterly soaked, rolling up his pant legs to see three shiny leeches clinging to his skin, hoping to divert attention away from the mishap. Overhead, lanterns and streamers traverse the air on cables, casting a festive glow, while a small stage at one end of the street accommodates fiddlers ready to play. The town has turned out in its entirety, celebrating the arrival of its newest member, Edward Bloom. Before any protest can form on his lips, two women seize Edward by the arms, drawing him into an impromptu dance with them. The subsequent dance number unveils a blend of both choreography and spontaneous chaos. From farmer to baker's wife, everyone desires a turn to whirl with Edward, who experiences the sensation of being carried along like a stick caught up in the swirling currents of a whirlwind, yet relishing every moment. Jenny clasps both his hands, and together they spin in vehement circles until Beamen steps in, playfully pulling his laughing daughter away to claim his own dance."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Ahead lies a tiny one-street town, smaller even than Ashton, with powerlines extending from the woods and adorned with two dozen pairs of shoes tied by their laces. The main street, lined with stores like Cole's Pharmacy, Talbot's Five and Dime, and Al's Country Store, showcases its old, but lively character. As Edward approaches, about 20 smiling, barefoot citizens gather to greet him. Beamen, a friendly yet slightly tipsy man resembling the town's mayor, emerges from the seed store with a clipboard, seeming confused until Mildred offers assistance. Beamen's daughter, eight-year-old Jenny, shyly peeks at Edward from behind her father. Edward's unintended humor causes the group to laugh. At the kitchen table, Edward eats apple pie with Beamen and Norther Winslow, a self-proclaimed artist. Meanwhile, Jenny stealthily unties Edward's shoelaces, then suddenly races off with the shoes, prompting Edward to chase her. Reaching the town's edge, Jenny skillfully tosses the shoes onto the power line, drawing cheers from the Spectre citizens. Despite his confusion, Edward receives congratulations, hugs, and handshakes. Observing young Jenny Hill at the bank, he wades back to retrieve his shoes, revealing leeches on his legs, eager to move on. Lanterns and streamers adorn the street, where a stage hosts fiddlers for a celebration of Edward Bloom, the town's newest citizen. Two women pull him into a lively, seemingly choreographed dance, where he's joyfully tossed around. Jenny takes his hands for a wild spin until Beamen jovially leads her away to dance."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Ahead lies a tiny one-street town named Spectre, smaller even than Ashton, a neighboring community known for its annual corn festival, with powerlines emerging from the woods that have long been rumored to be enchanted, to feed it. Dangling from the line above are two dozen pairs of shoes, their laces tied together, a quirky tradition meant to welcome newcomers with an unexpected surprise. The main street has stores on each side: Cole's Pharmacy, a family-owned business that has been dispensing remedies for over five decades, Talbot's Five and Dime, famous for its penny candy and nostalgic trinkets, Al's Country Store, which serves as the local gathering place for exchanging stories and farm advice. Everything is old, but this isn't a ghost town, a hint of lively history evident in its vibrant community life. A group of about 20 citizens spill out to see Edward approach; most are smiling, and all of these people are barefoot, participating in a town custom symbolizing their connection to the land. A forty-year-old man named Beamen comes out of the seed store to greet Edward. Friendly but a little drunk, he's the closest thing the town has to a mayor, often mediating disputes with his easygoing nature, carrying a clipboard left behind from a recent community meeting. Beamen checks the clipboard, still looking, still confused, until a helpful woman named Mildred, known for organizing the town's annual pie contest, chimes in. Beamen's daughter Jenny, eight years old, hides behind her father, peering around to look at the handsome stranger, with the curiosity that makes her a favorite among the townsfolk. He didn’t mean it as a joke, but for some reason, everyone is laughing; the laughter in this town has often been described as contagious. Sitting at the kitchen table, Edward takes a second slice of apple pie, renowned for its recipe passed down through generations. He and Beamen are joined by Norther Winslow, who fancies himself a cultured artist, though he's never left the state, his paintings reflecting the rural beauty and simplicity of their surroundings. Young Jenny is stealthily untying the laces on Edward's shoes, a playful mischief not uncommon for her. Suddenly, Jenny yanks off Edward's shoes and races for the door, with him chasing after her. As she runs, Jenny ties Edward's laces together, a trick learned from her older brothers. Reaching the edge of town, she tosses the shoes up and around the power line with a perfect throw, showcasing her budding athletic prowess. The gathered citizens of Spectre cheer for Edward, who is confused and overwhelmed by this unexpected initiation. The women hug him, and the men shake his hand, all while he is still focused on his shoes, caught up in the warm yet puzzling welcome. The townsfolk continue to congratulate Edward, and Norther grabs his notebook back, where he often scribbles poems inspired by the events around him. Edward looks to the bank, where young Jenny Hill, known for her shyness and love of books, is watching him, embarrassed to admit it. He starts to wade back to the bank and climbs onto the shore, completely drenched, pulling up his pant legs to reveal three shiny leeches clinging to his skin, eager to get off this subject, as leeches are common in the nearby marshy areas. Lanterns and streamers hang on cables across the street, remnants of a festival held just last month, and a small stage has been built at one end to hold fiddlers, whose music is said to be the soul of Spectre's celebrations. The whole town is there in celebration of its newest citizen, Edward Bloom. Before he can protest, two women grab him by the arms, pulling him in to dance with them. The resulting dance number seems both choreographed and complete chaos, akin to the town's previous celebrations of harvest and good fortune. From farmer to baker's wife, known for her blueberry muffins, everyone wants to dance with Edward, who finds himself tossed around like a stick caught in a whirlpool, though he is having a blast, discovering an unexpected joy in the spontaneity. Jenny grabs both his hands, and they spin wildly until Beamen plucks his laughing daughter away to dance with her, demonstrating the close-knit bonds of Spectre's community."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Ahead lies a tiny onestreet town smaller even than Ashton with powerlines emerging from the woods to feed it. Dangling from the line above are two dozen pairs of shoes their laces tied together. The main street has stores on each side Cole's Pharmacy Talbot's Five and Dime Al's Country Store. Everything is old but this is not a ghost town. A group of about 20 citizens spill out to see Edward approach. most are smiling and all of these people are barefoot. A fortyyearold man named Beamen comes out of the seed store to greet Edward. Friendly but a little drunk. he is the closest thing the town has to a mayor carrying a clipboard. Beamen checks the clipboard still looking still confused until a helpful woman named Mildred chimes in. Beamen's daughter Jenny eight years old hides behind her father peering around to look at the handsome stranger. He did not mean it as a joke but for some reason everyone is laughing. Sitting at the kitchen table Edward takes a second slice of apple pie. He and Beamen are joined by Norther Winslow who fancies himself a cultured artist though he is never left the state. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Young Jenny is stealthily untying the laces on Edward's shoes. Suddenly Jenny yanks off Edward's shoes and races for the door with him chasing after her. As she runs Jenny ties Edward's laces together. Reaching the edge of town she tosses the shoes up and around the power line with a perfect throw. The gathered citizens of Spectre cheer for Edward who is confused and overwhelmed. The women hug him and the men shake his hand all while he is still focused on his shoes. The townsfolk continue to congratulate Edward and Norther grabs his notebook back. Edward looks to the bank where young Jenny Hill is watching him embarrassed to admit it. He starts to wade back to the bank and climbs onto the shore completely drenched pulling up his pant legs to reveal three shiny leeches clinging to his skin eager to get off this subject. Lanterns and streamers hang on cables across the street and a small stage has been built at one end to hold fiddlers. The whole town is there in celebration of its newest citizen Edward Bloom. Before he can protest two women grab him by the arms pulling him in to dance with them. The resulting dance number seems both choreographed and complete chaos. From farmer to baker's wife everyone wants to dance with Edward who finds himself tossed around like a stick caught in a whirlpool though he is having a blast. Jenny grabs both his hands and they spin wildly until Beamen plucks his laughing daughter away to dance with her."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Ahead lies a tiny onestreet town smaller even than Ashton with powerlines emerging from the woods to feed it. Dangling from the line above are two dozen pairs of shoes their laces tied together. The main street has stores on each side Cole's Pharmacy Talbot's Five and Dime Al's Country Store. Everything is old but this is not a ghost town. A group of about 20 citizens spill out to see Edward approach. most are smiling and all of these people are barefoot. A fortyyearold man named Beamen comes out of the seed store to greet Edward. Friendly but a little drunk. he is the closest thing the town has to a mayor carrying a clipboard. Beamen checks the clipboard still looking still confused until a helpful woman named Mildred chimes in. Beamen's daughter Jenny eight years old hides behind her father peering around to look at the handsome stranger. He did not mean it as a joke but for some reason everyone is laughing. Sitting at the kitchen table Edward takes a second slice of apple pie. He and Beamen are joined by Norther Winslow who fancies himself a cultured artist though he is never left the state. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. Young Jenny is stealthily untying the laces on Edward's shoes. Suddenly Jenny yanks off Edward's shoes and races for the door with him chasing after her. As she runs Jenny ties Edward's laces together. Reaching the edge of town she tosses the shoes up and around the power line with a perfect throw. The gathered citizens of Spectre cheer for Edward who is confused and overwhelmed. The women hug him and the men shake his hand all while he is still focused on his shoes. The townsfolk continue to congratulate Edward and Norther grabs his notebook back. Edward looks to the bank where young Jenny Hill is watching him embarrassed to admit it. He starts to wade back to the bank and climbs onto the shore completely drenched pulling up his pant legs to reveal three shiny leeches clinging to his skin eager to get off this subject. Lanterns and streamers hang on cables across the street and a small stage has been built at one end to hold fiddlers. The whole town is there in celebration of its newest citizen Edward Bloom. Before he can protest two women grab him by the arms pulling him in to dance with them. The resulting dance number seems both choreographed and complete chaos. From farmer to baker's wife everyone wants to dance with Edward who finds himself tossed around like a stick caught in a whirlpool though he is having a blast. Jenny grabs both his hands and they spin wildly until Beamen plucks his laughing daughter away to dance with her."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Ahead lies a tiny onestreet town smaller even than Ashton with powerlines emerging from the woods to feed it. Dangling from the line above are two dozen pairs of shoes their laces tied together. The main street has stores on each side Cole's Pharmacy Talbot's Five and Dime Al's Country Store. Everything is old but this is not a ghost town. A group of about 20 citizens spill out to see Edward approach. most are smiling and all of these people are barefoot. A fortyyearold man named Beamen comes out of the seed store to greet Edward. Edward looks to the bank where young Jenny Hill is watching him embarrassed to admit it. He starts to wade back to the bank and climbs onto the shore completely drenched pulling up his pant legs to reveal three shiny leeches clinging to his skin eager to get off this subject. Lanterns and streamers hang on cables across the street and a small stage has been built at one end to hold fiddlers. The whole town is there in celebration of its newest citizen Edward Bloom. Before he can protest two women grab him by the arms pulling him in to dance with them. The resulting dance number seems both choreographed and complete chaos. From farmer to baker's wife everyone wants to dance with Edward who finds himself tossed around like a stick caught in a whirlpool though he is having a blast. Jenny grabs both his hands and they spin wildly until Beamen plucks his laughing daughter away to dance with her."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Ahead lies a tiny onestreet town smaller even than Ashton with powerlines emerging from the woods to feed it. Dangling from the line above are two dozen pairs of shoes their laces tied together. The main street has stores on each side Cole's Pharmacy Talbot's Five and Dime Al's Country Store. The resulting dance number seems both choreographed and complete chaos. From farmer to baker's wife everyone wants to dance with Edward who finds himself tossed around like a stick caught in a whirlpool though he is having a blast. Jenny grabs both his hands and they spin wildly until Beamen plucks his laughing daughter away to dance with her."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Beyond the horizon stretches a narrow two-path village, tinier even than Clearfield, with wind chimes sprouting from the hills to nourish it. Swaying from the rope below are three dozen pairs of hats, their ribbons knotted together. The central avenue has eateries on every corner: Lee's Bakery, Martin's Candy Shop, Sam's Workshop. Everything is ancient, yet this isn't an abandoned village. A clan of about 40 wanderers trickles out to watch Oscar advance; many are giggling, and all of these folks are hatless. A forty-year-old woman named Daisy emerges from the pet shop to welcome Oscar. Warm yet slightly tipsy, she's the closest thing the village has to a queen, wielding a megaphone. Daisy scans the megaphone, still squinting, still bewildered, until a helpful man named Howard speaks up. Daisy's son Tommy, ten years old, hides behind his mother, peeking around to observe the charming visitor. He didn't intend it as a jest, but somehow, everyone is chuckling. Relaxing at the dining room table, Oscar takes a second slice of blueberry tart. He and Daisy are accompanied by Southern Wilkins, who considers himself a sophisticated clown, though he's never left the county. Little Tommy is quietly unbuckling the buckles on Oscar's hat. Suddenly, Tommy snatches Oscar's hat and dashes for the window, with him pursuing after him. As he bolts, Tommy buckles Oscar's hat together. Reaching the village limits, he flings the hat up and around the wind chime with a flawless toss. The gathered wanderers of Bliss clap for Oscar, who is bewildered and stunned. The children embrace him, and the grandparents pat his shoulder, all while he is still preoccupied with his hat. The villagers persist in congratulating Oscar, and Southern retrieves his megaphone back. Oscar gazes toward the library, where little Tommy Bell is observing him, shy to confess it. He starts to drift back to the library and hoists himself onto the dock, utterly soaked, rolling up his sleeves to reveal three glistening starfish sticking to his arm, keen to change this topic. Lanterns and banners dangle on threads across the avenue, and a tiny podium has been constructed at one side to host flautists. The entire village gathers to commemorate its newest inhabitant, Oscar Lake. Before he can object, two children seize him by the wrists, leading him in to whirl with them. The ensuing whirl number appears both orchestrated and utter bedlam. From fisherman to candlestick maker's daughter, everyone desires to whirl with Oscar, who finds himself whirled around like a leaf caught in a whirlwind, though he is enjoying a thrill. Tommy snatches both his shoulders, and they twirl madly until Daisy pulls her giggling son away to twirl with him."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Ahead lies a small town, even tinier than Ashton, with powerlines emerging from the woods. Two dozen pairs of shoes dangle above the street, lined with stores like Cole's Pharmacy and Talbot's Five and Dime. This isn't a ghost town; around 20 barefoot citizens cheerfully greet Edward. Beamen, a friendly but slightly tipsy man acting as the town's mayor, welcomes him with help from Mildred. As Edward and Beamen enjoy apple pie with Norther Winslow, an artist who has never left the state, Beamen's daughter Jenny unties Edward's shoes and tosses them onto the power line, to the town's amusement. Overwhelmed by the attention, Edward wades back to shore, only to find leeches on his legs. The town celebrates Edward as their newest citizen, complete with lanterns, streamers, and a small stage for fiddlers. As the townsfolk pull Edward into a lively dance, he joyfully participates, swirling around with everyone, including Jenny and Beamen."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Jenny grabs both his hands and they spin wildly until Beamen plucks his laughing daughter away to dance with her From farmer to baker's wife everyone wants to dance with Edward who finds himself tossed around like a stick caught in a whirlpool though he is having a blast The resulting dance number seems both choreographed and complete chaos Before he can protest two women grab him by the arms pulling him in to dance with them The whole town is there in celebration of its newest citizen Edward Bloom Lanterns and streamers hang on cables across the street and a small stage has been built at one end to hold fiddlers He starts to wade back to the bank and climbs onto the shore completely drenched pulling up his pant legs to reveal three shiny leeches clinging to his skin eager to get off this subject Edward looks to the bank where young Jenny Hill is watching him embarrassed to admit it The townsfolk continue to congratulate Edward and Norther grabs his notebook back The women hug him and the men shake his hand all while he is still focused on his shoes The gathered citizens of Spectre cheer for Edward who is confused and overwhelmed Reaching the edge of town she tosses the shoes up and around the power line with a perfect throw As she runs Jenny ties Edward's laces together Suddenly Jenny yanks off Edward's shoes and races for the door with him chasing after her Young Jenny is stealthily untying the laces on Edward's shoes He and Beamen are joined by Norther Winslow who fancies himself a cultured artist though he is never left the state Sitting at the kitchen table Edward takes a second slice of apple pie He did not mean it as a joke but for some reason everyone is laughing Beamen's daughter Jenny eight years old hides behind her father peering around to look at the handsome stranger Beamen checks the clipboard still looking still confused until a helpful woman named Mildred chimes in he is the closest thing the town has to a mayor carrying a clipboard Friendly but a little drunk A fortyyearold man named Beamen comes out of the seed store to greet Edward most are smiling and all of these people are barefoot A group of about 20 citizens spill out to see Edward approach Everything is old but this is not a ghost town The main street has stores on each side Cole's Pharmacy Talbot's Five and Dime Al's Country Store Dangling from the line above are two dozen pairs of shoes their laces tied together Ahead lies a tiny onestreet town smaller even than Ashton with powerlines emerging from the woods to feed it"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Dangling from the line above are two dozen pairs of shoes their laces tied together Ahead lies a tiny onestreet town smaller even than Ashton with powerlines emerging from the woods to feed it Everything is old but this is not a ghost town The main street has stores on each side Cole's Pharmacy Talbot's Five and Dime Al's Country Store most are smiling and all of these people are barefoot A group of about 20 citizens spill out to see Edward approach Friendly but a little drunk A fortyyearold man named Beamen comes out of the seed store to greet Edward Beamen checks the clipboard still looking still confused until a helpful woman named Mildred chimes in he is the closest thing the town has to a mayor carrying a clipboard He did not mean it as a joke but for some reason everyone is laughing Beamen's daughter Jenny eight years old hides behind her father peering around to look at the handsome stranger He and Beamen are joined by Norther Winslow who fancies himself a cultured artist though he is never left the state Sitting at the kitchen table Edward takes a second slice of apple pie Suddenly Jenny yanks off Edward's shoes and races for the door with him chasing after her Young Jenny is stealthily untying the laces on Edward's shoes Reaching the edge of town she tosses the shoes up and around the power line with a perfect throw As she runs Jenny ties Edward's laces together The women hug him and the men shake his hand all while he is still focused on his shoes The gathered citizens of Spectre cheer for Edward who is confused and overwhelmed Edward looks to the bank where young Jenny Hill is watching him embarrassed to admit it The townsfolk continue to congratulate Edward and Norther grabs his notebook back Lanterns and streamers hang on cables across the street and a small stage has been built at one end to hold fiddlers He starts to wade back to the bank and climbs onto the shore completely drenched pulling up his pant legs to reveal three shiny leeches clinging to his skin eager to get off this subject Before he can protest two women grab him by the arms pulling him in to dance with them The whole town is there in celebration of its newest citizen Edward Bloom From farmer to baker's wife everyone wants to dance with Edward who finds himself tossed around like a stick caught in a whirlpool though he is having a blast The resulting dance number seems both choreographed and complete chaos Jenny grabs both his hands and they spin wildly until Beamen plucks his laughing daughter away to dance with her"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Suddenly Jenny yanks off Edward's shoes and races for the door with him chasing after her As she runs Jenny ties Edward's laces together Reaching the edge of town she tosses the shoes up and around the power line with a perfect throw The gathered citizens of Spectre cheer for Edward who is confused and overwhelmed The women hug him and the men shake his hand all while he is still focused on his shoes The townsfolk continue to congratulate Edward and Norther grabs his notebook back Edward looks to the bank where young Jenny Hill is watching him embarrassed to admit it He starts to wade back to the bank and climbs onto the shore completely drenched pulling up his pant legs to reveal three shiny leeches clinging to his skin eager to get off this subject Lanterns and streamers hang on cables across the street and a small stage has been built at one end to hold fiddlers The whole town is there in celebration of its newest citizen Edward Bloom Before he can protest two women grab him by the arms pulling him in to dance with them The resulting dance number seems both choreographed and complete chaos From farmer to baker's wife everyone wants to dance with Edward who finds himself tossed around like a stick caught in a whirlpool though he is having a blast Jenny grabs both his hands and they spin wildly until Beamen plucks his laughing daughter away to dance with her Ahead lies a tiny onestreet town smaller even than Ashton with powerlines emerging from the woods to feed it Dangling from the line above are two dozen pairs of shoes their laces tied together The main street has stores on each side Cole's Pharmacy Talbot's Five and Dime Al's Country Store Everything is old but this is not a ghost town A group of about 20 citizens spill out to see Edward approach most are smiling and all of these people are barefoot A fortyyearold man named Beamen comes out of the seed store to greet Edward Friendly but a little drunk he is the closest thing the town has to a mayor carrying a clipboard Beamen checks the clipboard still looking still confused until a helpful woman named Mildred chimes in Beamen's daughter Jenny eight years old hides behind her father peering around to look at the handsome stranger He did not mean it as a joke but for some reason everyone is laughing Sitting at the kitchen table Edward takes a second slice of apple pie He and Beamen are joined by Norther Winslow who fancies himself a cultured artist though he is never left the state Young Jenny is stealthily untying the laces on Edward's shoes"
        }
      ]
    }
  ]
}