{
  "ground_truth": "In an Alabama field where a second-rate carnival is parked, Edward controls his breathing, trying to push through the pain while still carrying the backpack seen earlier, scratched up from his trip through Spectre. She returns with her camera as Edward smiles, masking the pain. A devilish smile appears as he joins the crowd and heads into the big-top, where a troupe of stilt-walking firebreathers finishes their act to tremendous applause. As the performers clear away, the circus' owner-and-ringmaster, Amos Calloway, who is only four feet tall but has a titanic presence, approaches the stands. From behind Amos, carnies begin rolling a massive ball towards the crowd, and as the carnies back away, a deep drum roll begins. A foot suddenly bursts out from within the ball with gasps from the crowd, revealing its massive size as Edward looks closer. As the drum beat intensifies, a second foot, followed by hands, shoulders, and finally a head, emerges. From a low angle, we see just how massive he is, seeming to fill the Heavens, resembling more ogre than man with his shaved head and giant club. In the bandstands, a young boy's jaw drops in awe as a tight spotlight follows him, revealing faces in the crowd. Colossus passes Edward, who seems unimpressed, and leans with the spotlight, whistling to get the big man's attention, then points to the edge of the stands where his friend is sitting on the dirt. The giant stands up, a good foot taller than Colossus, causing gasps and nervous anticipation from the crowd. Amos stands stunned, megaphone dangling, while Colossus, realizing the gig is up, with a resigned shrug, rests his club on his shoulder and walks away into the shadows. As the stands empty, Edward and Karl talk to Amos, who pulls Karl aside for a hard sell, as Edward notices a beautiful young woman in a blue dress and hat leaving with her family. For no good reason, she looks back, making eye contact with Edward, freezing all motion around them as a fiery baton halts mid-twirl and a spilled box of popcorn hangs in mid-air. Only Edward is free to move, winding his way between the frozen bodies and ducking underneath arms to get closer to the woman.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "In an Alabama meadow where a mediocre fair is stationed, Edward regulates his respiration, attempting to push through the agony while still bearing the rucksack witnessed earlier, marred up from his journey through Spectre. She reappears with her camera as Edward grins, concealing the discomfort. A mischievous grin emerges as he joins the assemblage and heads into the big-top, where a troupe of stilt-walking firebreathers concludes their performance to tremendous acclaim. As the entertainers clear away, the circus' proprietor-and-ringmaster, Amos Calloway, who is only four feet tall but possesses a colossal aura, approaches the bleachers. From behind Amos, carnies begin rolling a gigantic sphere towards the crowd, and as the carnies retreat, a deep drum roll commences. A foot abruptly bursts out from within the sphere with gasps from the audience, revealing its enormous magnitude as Edward observes closer. As the drumbeat intensifies, a second foot, followed by hands, shoulders, and finally a head, emerges. From a low angle, we perceive just how colossal he is, seeming to fill the Firmament, resembling more ogre than man with his shaved head and enormous club. In the bleachers, a young boy's jaw drops in wonder as a tight spotlight follows him, revealing faces in the audience. Colossus passes Edward, who appears apathetic, and leans with the spotlight, whistling to get the big man's notice, then gestures to the perimeter of the stands where his companion is seated on the soil. The giant stands up, a good foot taller than Colossus, causing gasps and anxious anticipation from the spectators. Amos stands astonished, megaphone dangling, while Colossus, realizing the charade is up, with a resigned shrug, rests his club on his shoulder and walks away into the shadows. As the bleachers empty, Edward and Karl converse with Amos, who pulls Karl aside for a hard sell, as Edward observes a beautiful young woman in a blue dress and hat departing with her kin. For no good reason, she glances back, making eye contact with Edward, freezing all motion around them as a blazing baton halts mid-twirl and a spilled box of popcorn suspends in mid-air. Only Edward is free to move, winding his way between the frozen forms and ducking underneath limbs to get nearer to the woman."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "In an Alabama field where a second-rate carnival is parked, Edward's breathing is controlled by him as he tries to push through the pain while still carrying the backpack seen earlier, scratched up from his trip through Spectre. Her camera is returned with by her as Edward smiles, masking the pain. A devilish smile is shown by him as the crowd is joined by him, and he heads into the big-top, where a troupe of stilt-walking firebreathers finish their act to tremendous applause. As the performers clear away, Amos Calloway, the circus' owner-and-ringmaster, who is only four feet tall but has a titanic presence, approaches the stands. From behind Amos, carnies begin rolling a massive ball towards the crowd, and as the carnies back away, a deep drum roll begins. A foot suddenly bursts out from within the ball with gasps from the crowd, revealing its massive size when Edward looks closer. As the drum beat intensifies, a second foot is followed by hands, shoulders, and finally a head, emerging. From a low angle, just how massive he is is seen by us, as he seems to fill the Heavens, resembling more ogre than man with his shaved head and giant club. In the bandstands, a young boy drops his jaw in awe as he is revealed by a tight spotlight, with faces in the crowd being illuminated. Edward is passed by Colossus, who seems unimpressed and leans with the spotlight, whistling to get the big man's attention, then points to where his friend sits on the dirt at the edge of the stands. The giant stands up, a good foot taller than Colossus, causing gasps and nervous anticipation from the crowd. Amos stands stunned, megaphone dangling, while the gig is realized to be up by Colossus, who shrugs with resignation, rests his club on his shoulder, and walks away into the shadows. As the stands empty, Amos is approached by Edward and Karl, who talk to him as Karl is pulled aside by Amos for a hard sell, while Edward notices a beautiful young woman in a blue dress and hat leaving with her family. For no good reason, she looks back, making eye contact with Edward, freezing all motion around them as a fiery baton halts mid-twirl and a spilled box of popcorn hangs in mid-air. Only Edward is free to move, winding his way between the frozen bodies and ducking underneath arms to get closer to the woman."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "In an Alabama field with a parked second-rate carnival, Edward manages his breathing, enduring pain while carrying the scratched backpack from his trip through Spectre. A woman returns with her camera as Edward smiles. He heads into the big-top, where stilt-walking firebreathers finish their act to applause. The circus' owner, Amos Calloway, only four feet tall but with a strong presence, approaches. Carnies roll a massive ball towards the crowd, and as they back away, a drum roll starts. A foot bursts from the ball, shocking the crowd, and Edward notices its immense size. As the beat intensifies, more of the figure emerges, resembling an ogre with its massive form. A young boy watches in awe as a spotlight follows the giant. Colossus passes Edward, who remains unimpressed, and gestures at a larger man sitting nearby. The giant, a foot taller than Colossus, stands, eliciting gasps. Amos is stunned, and Colossus resigns, resting his club on his shoulder, and exits. As the crowd disperses, Edward and Karl speak with Amos. Edward spots a young woman in a blue dress leaving with her family. She looks back, locking eyes with Edward, freezing everything around them. Only Edward moves, weaving through the still bodies to approach her."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "In an Alabama field with a second-rate carnival, Edward controls his breathing, enduring pain while carrying his scratched backpack from Spectre. She returns with a camera as Edward smiles, hiding his pain. He joins the crowd at the big-top, where stilt-walking firebreathers finish their act. The circus' owner, Amos Calloway, just four feet tall but with a titanic presence, approaches. Behind Amos, carnies roll a huge ball toward the crowd. A foot bursts out, and the crowd gasps, revealing a giant resembling an ogre. A young boy watches in awe as a spotlight reveals crowd faces. The giant passes Edward, who gestures for his attention. The giant, taller than Colossus, stands, causing gasps. Amos is stunned while Colossus resigns, resting his club and leaving. As the stands empty, Edward and Karl talk to Amos, who pulls Karl aside. Edward notices a young woman in a blue dress leaving with her family. She glances back, making eye contact with Edward, freezing time around them. Only Edward moves, weaving through frozen bodies to approach her."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In a vast and open field situated somewhere deep in the heart of Alabama, there is a second-rate carnival set up with its vibrant, albeit slightly worn, attractions. Amidst this lively yet modest carnival atmosphere, Edward finds himself at the center of attention. He concentrates intensely, deliberately controlling his breathing as he attempts to push through the persistent pain that plagues him. Still strapped securely to his back is the worn and slightly battered backpack he carried with him from his recent travels through Spectre, where it acquired numerous scratches. Soon, a woman returns to his side, camera in hand, just in time to capture Edward’s expression. Despite the enduring pain, Edward forces a smile, cleverly masking any discomfort he might feel. A mischievous, almost devilish grin spreads across his face as he becomes one with the crowd, enthusiastically making his way into the big-top tent. Inside, a talented troupe of stilt-walking firebreathers is performing, concluding their spectacular act to an eruption of thunderous applause from the audience.\n\nAs the enthusiastic crowd's applause echoes, the performers make way for the circus’s charismatic owner and ringmaster, Amos Calloway. Despite standing at a mere four feet tall, Amos has an impressively titanic presence. He confidently approaches the stands as if he towers over everyone. From behind this larger-than-life figure, several carnies start rolling a massive ball towards the excited crowd. The anticipation builds as the carnies step back, signaling the start of a deep and rhythmic drum roll. Suddenly, with a collective gasp from the audience, a foot explosively bursts out from within the ball, highlighting its massive size, prompting Edward to lean in for a closer look. As the drumbeat crescendos, a second foot effortlessly emerges, followed by strong hands, broad shoulders, and finally, a head presents itself. From a dramatic low angle, we are given a clear view of his sheer magnitude, appearing to fill the very Heavens themselves. He resembles an ogre more than a mere man, marked by his shaved head and the immense club he carries. Observing from the bandstands, a young boy's jaw drops in wide-eyed awe, as a tightly focused spotlight follows the action, revealing the eager faces in the audience. The towering Colossus walks past Edward, whose expression remains unimpressed. Edward, whistling to catch the giant man's attention, cleverly directs him to the edge of the stands where his friend is seated on the dusty ground. As the giant rises to his full height, standing a full foot taller than even the formidable Colossus, the crowd emits gasps mixed with nervous anticipation. Stunned into silence, Amos stands with his megaphone dangling uselessly by his side, while Colossus, aware that the performance is over, gives a resigned shrug. He rests his hefty club upon his shoulder and casually walks away into the enveloping shadows.\n\nAs the stands gradually empty of people, Edward and his companion, Karl, engage Amos in conversation. Amos takes a moment to pull Karl aside for a persuasive, hard-sell discussion. Meanwhile, Edward’s attention drifts to a beautiful young woman, elegantly dressed in a striking blue dress and matching hat, as she departs with her family. For no apparent reason, she glances back, locking eyes with Edward. In that frozen moment, time seems to halt, as if the entire world around them pauses. A baton wreathed in flames halts mid-twirl, and a spilled box of popcorn lingers improbably in mid-air. Only Edward, unfrozen by this momentous connection, is free to move. He navigates carefully between the motionless bodies, ducking beneath extended arms, as he tries desperately to get closer to the enchanting woman who has caught his eye."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In a vast and expansive open field, situated deep within the heart of Alabama, there is a slightly underwhelming carnival that has been set up, featuring its vibrant yet somewhat worn attractions. Amidst the lively, though modest, carnival atmosphere, Edward finds himself the center of attention. He focuses intently, deliberately managing his breathing as he attempts to push through the persistent, nagging pain that plagues him. Still strapped securely to his back is the worn and slightly battered backpack that he carried with him from his recent journey through Spectre, where it acquired numerous scratches. Soon, a woman returns to his side, camera in hand, arriving just in time to capture Edward’s expression. Despite the ongoing pain, Edward forces a smile, skillfully masking any discomfort he might be feeling. A mischievous, almost devilish grin spreads across his face as he becomes one with the crowd, eagerly making his way into the grand big-top tent. Inside, a talented troupe of stilt-walking firebreathers is performing, concluding their spectacular act to an eruption of thunderous applause from the captivated audience.\n\nAs the enthusiastic crowd's applause reverberates, the performers gracefully make way for the circus’s charismatic owner and ringmaster, Amos Calloway. Despite standing at a mere four feet tall, Amos exudes an impressively titanic presence. He approaches the stands with confidence, as if he towers over everyone. From behind this larger-than-life figure, several carnival workers begin rolling a massive ball towards the intrigued crowd. The anticipation builds as the carnies step back, signaling the beginning of a deep and rhythmic drum roll. Suddenly, with a collective gasp from the audience, a foot explosively bursts out from within the ball, emphasizing its massive size, prompting Edward to lean in for a closer look. As the drumbeat crescendos, a second foot effortlessly emerges, followed by strong hands, broad shoulders, and finally, a head presents itself. From a dramatic low angle, we are afforded a clear view of his sheer magnitude, as he seems to fill the very Heavens themselves. This enormous figure resembles an ogre more than a mere man, marked by his shaved head and the immense club he carries. Observing from the bandstands, a young boy's jaw drops in wide-eyed awe, as a tightly focused spotlight follows the action, illuminating the eager faces in the audience. The towering Colossus walks past Edward, whose expression remains unimpressed. Edward, whistling to catch the giant man's attention, cleverly directs him to the edge of the stands where his friend is seated on the dusty ground. As the giant rises to his full height, standing a full foot taller than even the formidable Colossus, the crowd emits gasps mixed with nervous anticipation. Stunned into silence, Amos stands with his megaphone dangling uselessly by his side, while Colossus, aware that the performance has concluded, gives a resigned shrug. He rests his hefty club upon his shoulder and casually walks away into the enveloping shadows.\n\nAs the stands gradually empty of people, Edward and his companion, Karl, engage Amos in conversation. Amos takes a moment to pull Karl aside for a persuasive, hard-sell discussion. Meanwhile, Edward’s attention drifts to a beautiful young woman, elegantly dressed in a striking blue dress and matching hat, as she departs with her family. For reasons unknown, she glances back, locking eyes with Edward. In that frozen moment, time seems to halt, as if the entire world around them pauses. A baton wreathed in flames halts mid-twirl, and a spilled box of popcorn suspends improbably in mid-air. Only Edward, unfrozen by this momentous connection, is free to move. He navigates carefully between the motionless bodies, ducking beneath extended arms, as he tries desperately to get closer to the enchanting woman who has captivated his attention."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "In an Alabama field where a run-down carnival has taken up residence, Edward focuses on steadying his breaths, a deliberate action to manage the pain he is enduring, all while shouldering the same backpack that bears scratches from his recent journey through Spectre. She soon returns, camera in hand, capturing the moment as Edward forces a smile to disguise his discomfort. A mischievous grin spreads across his face as he blends into the throng of people making their way into the big-top tent. Inside, he is greeted by the end of a performance by stilt-walking firebreathers who gracefully conclude their act amidst resounding applause from the audience. As these performers clear the stage, the diminutive yet commanding figure of Amos Calloway, the circus' owner and ringmaster, steps forward, drawing the crowd's attention. From behind Amos, a team of carnies begins the task of rolling a massive ball toward the audience, stepping back to reveal the spectacle while the sound of a deep drum roll builds suspense. The crowd reacts with astonishment as a foot suddenly thrusts out from the ball, signaling the emergence of a gigantic form; Edward peers closer to take in its full scale. As the drumming escalates, the figure continues to unfold—first a second foot, then hands, shoulders, and at last a head—towering with a striking presence that seems to touch the sky. The man, shaved-headed and armed with a substantial club, appears more ogre-like than human, filling the space completely. From the stands, a young boy gapes in wonder, his mouth agape, as a tight spotlight traces the giant's path, casting light on the captivated faces in the audience. As the imposing figure passes by Edward, who remains unfazed, Edward leans into the spotlight's beam, whistling to capture the giant's attention. He then gestures towards the periphery of the stands where his companion is seated on the ground. The giant rises, towering a full foot above Colossus, eliciting gasps and a wave of nervous expectation from the crowd. Amidst this, Amos stands in shock, the megaphone hanging loosely from his grasp, while Colossus, acknowledging the end of his act with a resigned shrug, rests his club on his shoulder and retreats into the dimness. As the audience begins to disperse, Edward and Karl engage Amos in conversation; Amos pulls Karl aside, employing persuasive tactics to pitch his offers. Meanwhile, Edward's attention is drawn to a beautiful young woman adorned in a blue dress and hat as she departs with her family. Without apparent reason, she turns back, catching Edward's gaze, a connection that freezes the world around them—a baton in mid-flame halts its twirl, and a cascade of popcorn remains suspended in the air. In this surreal pause, Edward alone remains unaffected, allowing him to navigate through the still tableau of figures, weaving between immobile bodies and ducking beneath motionless arms as he moves closer to the woman."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "In an Alabama field with a second-rate carnival, Edward masks his pain while carrying his scratched-up backpack from Spectre. He puts on a devilish smile and joins the crowd entering the big-top, where he witnesses a stilt-walking firebreathers' performance that ends with applause. As the circus owner, Amos Calloway, a short but commanding figure, approaches, carnies roll a massive ball toward the audience. The drum roll intensifies, and the crowd gasps as a giant figure emerges. Edward remains unfazed and signals to the giant who towers over Colossus, leaving the crowd in nervous anticipation. Amos is stunned as Colossus, accepting defeat, shrugs and retreats into the shadows. As the crowd disperses, Edward and Karl converse with Amos, who then tries to persuade Karl separately. Meanwhile, Edward is captivated by a beautiful woman in a blue dress and hat as she leaves with her family. She unexpectedly looks back, freezing time and everyone around her, except for Edward, who navigates through the frozen scene to get closer to her."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "In a remote Alabama field, known for its lush cotton farms that stretch for miles, where a second-rate carnival is parked, Edward controls his breathing, trying to push through the pain while still carrying the backpack, a rugged item scratched up from his trip through Spectre, a mysterious and nearly forgotten town rumored to hold secrets of extraordinary events. She returns with her vintage Leica camera as Edward smiles, masking the pain. A devilish smile appears as he joins the crowd and heads into the big-top, an iconic symbol of circuses featuring a vibrant striped tent, where a troupe of stilt-walking firebreathers finishes their act to tremendous applause, echoing the excitement of traditional circus performances. As the performers clear away, the circus' owner-and-ringmaster, Amos Calloway, who is only four feet tall but has a titanic presence reminiscent of legendary showmen like P.T. Barnum, approaches the stands. From behind Amos, carnies begin rolling a massive ball towards the crowd, and as the carnies back away, a deep drum roll begins, heightening the suspense in the air. A foot suddenly bursts out from within the ball with gasps from the crowd, revealing its massive size as Edward looks closer. As the drum beat intensifies, a second foot, followed by hands, shoulders, and finally a head, emerges. From a low angle, we see just how massive he is, seeming to fill the Heavens, resembling more ogre than man with his shaved head and giant club, a nod to the mythical creatures found in folklore. In the bandstands, a young boy's jaw drops in awe as a tight spotlight follows him, revealing faces in the crowd illuminated with wonder. Colossus passes Edward, who seems unimpressed, a seasoned traveler unfazed by such spectacles, and leans with the spotlight, whistling to get the big man's attention, then points to the edge of the stands where his friend is sitting on the dirt. The giant stands up, a good foot taller than Colossus, causing gasps and nervous anticipation from the crowd. Amos stands stunned, megaphone dangling, while Colossus, realizing the gig is up, with a resigned shrug, rests his club on his shoulder and walks away into the shadows, reminiscent of a defeated gladiator leaving the arena. As the stands empty, Edward and Karl talk to Amos, who pulls Karl aside for a hard sell, a negotiation technique honed from years in the circus business, as Edward notices a beautiful young woman in a blue dress and hat leaving with her family. For no good reason, she looks back, making eye contact with Edward, freezing all motion around them in a moment reminiscent of cinematic magic as a fiery baton halts mid-twirl and a spilled box of popcorn hangs in mid-air. Only Edward is free to move, winding his way between the frozen bodies and ducking underneath arms to get closer to the woman, driven by an inexplicable pull towards her."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "In an Alabama field where a secondrate carnival is parked Edward controls his breathing trying to push through the pain while still carrying the backpack seen earlier scratched up from his trip through Spectre. She returns with her camera as Edward smiles masking the pain. A devilish smile appears as he joins the crowd and heads into the bigtop where a troupe of stiltwalking firebreathers finishes their act to tremendous applause. As the performers clear away the circus' ownerandringmaster Amos Calloway who is only four feet tall but has a titanic presence approaches the stands. From behind Amos carnies begin rolling a massive ball towards the crowd and as the carnies back away a deep drum roll begins. A foot suddenly bursts out from within the ball with gasps from the crowd revealing its massive size. as Edward looks closer. As the drum beat intensifies a second foot followed by hands shoulders and finally a head emerges. From a low angle we see just how massive he is seeming to fill the Heavens resembling more ogre than man with his shaved head and giant club. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. In the bandstands a young boy's jaw drops in awe as a tight spotlight follows him revealing faces in the crowd Colossus passes. Edward who seems unimpressed and leans with the spotlight whistling to get the big man's attention then points to the edge of the stands where his friend is sitting on the dirt. The giant stands up a good foot taller than Colossus causing gasps and nervous anticipation from the crowd. Amos stands stunned megaphone dangling. while Colossus realizing the gig is up with a resigned shrug rests his club on his shoulder and walks away into the shadows. As the stands empty Edward and Karl talk to Amos who pulls Karl aside for a hard sell. as Edward notices a beautiful young woman in a blue dress and hat leaving with her family. For no good reason she looks back making eye contact with Edward freezing all motion around them. as a fiery baton halts midtwirl and a spilled box of popcorn hangs in midair. Only Edward is free to move winding his way between the frozen bodies and ducking underneath arms to get closer to the woman."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "In an Alabama field where a secondrate carnival is parked Edward controls his breathing trying to push through the pain while still carrying the backpack seen earlier scratched up from his trip through Spectre. She returns with her camera as Edward smiles masking the pain. A devilish smile appears as he joins the crowd and heads into the bigtop where a troupe of stiltwalking firebreathers finishes their act to tremendous applause. As the performers clear away the circus' ownerandringmaster Amos Calloway who is only four feet tall but has a titanic presence approaches the stands. From behind Amos carnies begin rolling a massive ball towards the crowd and as the carnies back away a deep drum roll begins. A foot suddenly bursts out from within the ball with gasps from the crowd revealing its massive size. as Edward looks closer. As the drum beat intensifies a second foot followed by hands shoulders and finally a head emerges. From a low angle we see just how massive he is seeming to fill the Heavens resembling more ogre than man with his shaved head and giant club. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. In the bandstands a young boy's jaw drops in awe as a tight spotlight follows him revealing faces in the crowd Colossus passes. Edward who seems unimpressed and leans with the spotlight whistling to get the big man's attention then points to the edge of the stands where his friend is sitting on the dirt. The giant stands up a good foot taller than Colossus causing gasps and nervous anticipation from the crowd. Amos stands stunned megaphone dangling. while Colossus realizing the gig is up with a resigned shrug rests his club on his shoulder and walks away into the shadows. As the stands empty Edward and Karl talk to Amos who pulls Karl aside for a hard sell. as Edward notices a beautiful young woman in a blue dress and hat leaving with her family. For no good reason she looks back making eye contact with Edward freezing all motion around them. as a fiery baton halts midtwirl and a spilled box of popcorn hangs in midair. Only Edward is free to move winding his way between the frozen bodies and ducking underneath arms to get closer to the woman."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "In an Alabama field where a secondrate carnival is parked Edward controls his breathing trying to push through the pain while still carrying the backpack seen earlier scratched up from his trip through Spectre. She returns with her camera as Edward smiles masking the pain. A devilish smile appears as he joins the crowd and heads into the bigtop where a troupe of stiltwalking firebreathers finishes their act to tremendous applause. As the performers clear away the circus' ownerandringmaster Amos Calloway who is only four feet tall but has a titanic presence approaches the stands. From behind Amos carnies begin rolling a massive ball towards the crowd and as the carnies back away a deep drum roll begins. As the stands empty Edward and Karl talk to Amos who pulls Karl aside for a hard sell. as Edward notices a beautiful young woman in a blue dress and hat leaving with her family. For no good reason she looks back making eye contact with Edward freezing all motion around them. as a fiery baton halts midtwirl and a spilled box of popcorn hangs in midair. Only Edward is free to move winding his way between the frozen bodies and ducking underneath arms to get closer to the woman."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "In an Alabama field where a secondrate carnival is parked Edward controls his breathing trying to push through the pain while still carrying the backpack seen earlier scratched up from his trip through Spectre. She returns with her camera as Edward smiles masking the pain. as a fiery baton halts midtwirl and a spilled box of popcorn hangs in midair. Only Edward is free to move winding his way between the frozen bodies and ducking underneath arms to get closer to the woman."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "In a Louisiana meadow where an outdated zoo is stationed, Roger regulates his laughing, attempting to glide through the joy while still juggling the briefcase spotted earlier, polished from his journey through Mirage. He reappears with his notebook as Roger frowns, hiding the joy. An angelic frown arises as he exits the throng and slips into the canopy, where a gang of juggling water-breathers concludes their play to whispered murmurs. As the entertainers disperse, the zoo's gardener-and-caretaker, Marcus Hemingway, who stands seven feet tall but has a diminutive presence, exits the roofs. From beside Marcus, waiters begin sliding a tiny box towards the throng, and as the waiters move closer, a quiet violin starts. A ribbon suddenly flies out from inside the box with cheers from the throng, unveiling its tiny form as Roger observes distantly. As the violin music fades, another ribbon, followed by tails, snouts, and eventually a nose, appears. From a high angle, we observe just how tiny he is, shrinking to fill the Earth, resembling more elf than sprite with his long hair and tiny pen. In the galleries, an old girl's eyes open in shock as a dim kaleidoscope misses him, hiding legs in the crowd. Goliath meets Roger, who seems startled, and swoons with the kaleidoscope, barking to lose the small sprite's interest, then leaps to the heart of the galleries where his enemy is floating on the air. The sprite sits down, a good inch shorter than Goliath, causing cheers and calm acceptance from the throng. Marcus remains amazed, microphone hanging, while Goliath, knowing the game is on, with a reluctant grin, taps his pen on his elbow and slides away from the lights. As the galleries fill, Roger and Jonah speak with Marcus, who urges Jonah forward for a soft whisper, as Roger glimpses a strange old man in a red suit and cap approaching with his team. For every good reason, he turns away, breaking eye contact with Roger, quickening all movement around them as a wet umbrella speeds mid-waver and a collected pile of paint tumbles in mid-flight. Only Roger is immobile, spinning his path around the swift figures and leaping over heads to get further from the man."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In an Alabama field, Edward, enduring pain from his journey through Spectre, joins the crowd at a carnival. He smiles through the discomfort as circus ringmaster Amos Calloway, small in stature but commanding in presence, entertains the audience. Carnies roll out a massive ball, revealing a towering giant who startles the spectators, including a young boy. Edward, unfazed, signals to the giant, instigating a reaction that leaves the audience in awe. As the crowd disperses, Edward speaks with Amos while noticing a beautiful woman in a blue dress. Their eyes meet, freezing everything around them, allowing Edward to move closer as time stands still."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Only Edward is free to move winding his way between the frozen bodies and ducking underneath arms to get closer to the woman as a fiery baton halts midtwirl and a spilled box of popcorn hangs in midair For no good reason she looks back making eye contact with Edward freezing all motion around them as Edward notices a beautiful young woman in a blue dress and hat leaving with her family As the stands empty Edward and Karl talk to Amos who pulls Karl aside for a hard sell while Colossus realizing the gig is up with a resigned shrug rests his club on his shoulder and walks away into the shadows Amos stands stunned megaphone dangling The giant stands up a good foot taller than Colossus causing gasps and nervous anticipation from the crowd Edward who seems unimpressed and leans with the spotlight whistling to get the big man's attention then points to the edge of the stands where his friend is sitting on the dirt In the bandstands a young boy's jaw drops in awe as a tight spotlight follows him revealing faces in the crowd Colossus passes From a low angle we see just how massive he is seeming to fill the Heavens resembling more ogre than man with his shaved head and giant club As the drum beat intensifies a second foot followed by hands shoulders and finally a head emerges as Edward looks closer A foot suddenly bursts out from within the ball with gasps from the crowd revealing its massive size From behind Amos carnies begin rolling a massive ball towards the crowd and as the carnies back away a deep drum roll begins As the performers clear away the circus' ownerandringmaster Amos Calloway who is only four feet tall but has a titanic presence approaches the stands A devilish smile appears as he joins the crowd and heads into the bigtop where a troupe of stiltwalking firebreathers finishes their act to tremendous applause She returns with her camera as Edward smiles masking the pain In an Alabama field where a secondrate carnival is parked Edward controls his breathing trying to push through the pain while still carrying the backpack seen earlier scratched up from his trip through Spectre"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "She returns with her camera as Edward smiles masking the pain In an Alabama field where a secondrate carnival is parked Edward controls his breathing trying to push through the pain while still carrying the backpack seen earlier scratched up from his trip through Spectre As the performers clear away the circus' ownerandringmaster Amos Calloway who is only four feet tall but has a titanic presence approaches the stands A devilish smile appears as he joins the crowd and heads into the bigtop where a troupe of stiltwalking firebreathers finishes their act to tremendous applause A foot suddenly bursts out from within the ball with gasps from the crowd revealing its massive size From behind Amos carnies begin rolling a massive ball towards the crowd and as the carnies back away a deep drum roll begins As the drum beat intensifies a second foot followed by hands shoulders and finally a head emerges as Edward looks closer In the bandstands a young boy's jaw drops in awe as a tight spotlight follows him revealing faces in the crowd Colossus passes From a low angle we see just how massive he is seeming to fill the Heavens resembling more ogre than man with his shaved head and giant club The giant stands up a good foot taller than Colossus causing gasps and nervous anticipation from the crowd Edward who seems unimpressed and leans with the spotlight whistling to get the big man's attention then points to the edge of the stands where his friend is sitting on the dirt while Colossus realizing the gig is up with a resigned shrug rests his club on his shoulder and walks away into the shadows Amos stands stunned megaphone dangling as Edward notices a beautiful young woman in a blue dress and hat leaving with her family As the stands empty Edward and Karl talk to Amos who pulls Karl aside for a hard sell as a fiery baton halts midtwirl and a spilled box of popcorn hangs in midair For no good reason she looks back making eye contact with Edward freezing all motion around them Only Edward is free to move winding his way between the frozen bodies and ducking underneath arms to get closer to the woman"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Edward who seems unimpressed and leans with the spotlight whistling to get the big man's attention then points to the edge of the stands where his friend is sitting on the dirt The giant stands up a good foot taller than Colossus causing gasps and nervous anticipation from the crowd Amos stands stunned megaphone dangling while Colossus realizing the gig is up with a resigned shrug rests his club on his shoulder and walks away into the shadows As the stands empty Edward and Karl talk to Amos who pulls Karl aside for a hard sell as Edward notices a beautiful young woman in a blue dress and hat leaving with her family For no good reason she looks back making eye contact with Edward freezing all motion around them as a fiery baton halts midtwirl and a spilled box of popcorn hangs in midair Only Edward is free to move winding his way between the frozen bodies and ducking underneath arms to get closer to the woman In an Alabama field where a secondrate carnival is parked Edward controls his breathing trying to push through the pain while still carrying the backpack seen earlier scratched up from his trip through Spectre She returns with her camera as Edward smiles masking the pain A devilish smile appears as he joins the crowd and heads into the bigtop where a troupe of stiltwalking firebreathers finishes their act to tremendous applause As the performers clear away the circus' ownerandringmaster Amos Calloway who is only four feet tall but has a titanic presence approaches the stands From behind Amos carnies begin rolling a massive ball towards the crowd and as the carnies back away a deep drum roll begins A foot suddenly bursts out from within the ball with gasps from the crowd revealing its massive size as Edward looks closer As the drum beat intensifies a second foot followed by hands shoulders and finally a head emerges From a low angle we see just how massive he is seeming to fill the Heavens resembling more ogre than man with his shaved head and giant club In the bandstands a young boy's jaw drops in awe as a tight spotlight follows him revealing faces in the crowd Colossus passes"
        }
      ]
    }
  ]
}