{
  "ground_truth": "They seem very unhappy. The woman speaks to Dieter in German. She is apparently braless, and is teutonically pale with birthmarks on her face and arms. Notable is her camera-side leg, which ends in a bandage-swaddled foot. Dried rust-colored blood stains the tip of the bandage. Walter's eyes are on the road as he listens, driving, to the Dude, whose speech is occasionally punctuated by yaps from the back seat. He is looking off as the car slows. The Dude looks where Walter is looking. Walter's car pulls up the drive into the foreground and he and the Dude get out. Both are gaping off at the front lawn. BANG--the Dude and Walter push through the double doors into. His wheelchair hums as he spins it around. He is crossing to Lebowski. Walter reaches around from behind and hoists the big Lebowski out of the wheelchair by his armpits. He shoves the big Lebowski forward and he crumples to the floor, weeping. The Dude and Walter look. The dog yaps. Quintana is bellowing from the lip of the lane, and is restrained by O'Brien. Walter looks at him innocently. He makes hip-grinding coital motions as O'Brien leads him away. Walter, his head cocked, and the Dude, peeking over his shades, watch him go. Donny, Walter, and the Dude emerge from the alley, each holding his leatherette ball satchel. The men in black, stunned, confer amongst themselves in German. The Germans stop conferring. Walter ignores the Dude, addresses the Germans. The Germans confer again, in German. Donny is visibly frightened. Walter's eyes, burning with hatred, are locked on Dieter's. The Dude is digging into his pocket. Louder, to the Germans, as he looks in his wallet. With a ring of steel, Dieter produces a glinting saber. He hurls his leather satchel. The bowling ball thuds into his chest and lifts him off his feet. In a rage, Dieter charges. Watching Dieter's charge, is caught off-guard. Dieter drops it. He twists away as Dieter reaches him; grabs Dieter's head in both hands; draws Dieter's head up to his mouth, which closes on Dieter's ear. He rushes Franz but draws up short as Franz sends out karate kicks, his leather pants squeaking and popping. His jaw is still clamped on Dieter's ear. Awkwardly circling, evading Franz's kicks. Still worrying the ear. With a tearing sound, his head and Dieter's separate. Growling as Dieter screams, he worries his ear, waggling his head with his jaws clamped. Franz gives a loud cry with each kick; the Dude leans back, throwing his arms up, evading the kicks. The Dude, also panting, rises and trots over. Donny gasps for air. The Dude runs into the lanes. Walter lays a reassuring hand on Donny's shoulder.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "They appear exceedingly miserable. The lady converses with Dieter in German. She is evidently braless and is teutonically pale with birthmarks on her visage and arms. Remarkable is her camera-side limb, which concludes in a bandage-swaddled foot. Desiccated rust-colored gore blemishes the tip of the bandage. Walter's gaze is on the route as he listens, steering, to the Dude, whose discourse is sporadically punctuated by yaps from the aft seat. He is gazing off as the automobile decelerates. The Dude peers where Walter is gazing. Walter's vehicle pulls up the drive into the foreground and he and the Dude disembark. Both are staring off at the forefront lawn. BANG--the Dude and Walter push through the double portals into. His wheelchair whirs as he rotates it around. He is traversing to Lebowski. Walter reaches around from behind and lifts the big Lebowski out of the wheelchair by his armpits. He thrusts the big Lebowski forward and he collapses to the ground, sobbing. The Dude and Walter observe. The canine yaps. Quintana is bellowing from the edge of the lane and is restrained by O'Brien. Walter regards him innocently. He makes hip-grinding copulative motions as O'Brien escorts him away. Walter, his head tilted, and the Dude, peeking over his shades, observe him depart. Donny, Walter, and the Dude emerge from the alley, each clutching his leatherette sphere satchel. The men in black, stunned, confer amongst themselves in German. The Germans cease conferring. Walter disregards the Dude, addresses the Germans. The Germans confer again, in German. Donny is visibly terrified. Walter's eyes, blazing with loathing, are fixed on Dieter's. The Dude is delving into his pocket. Louder, to the Germans, as he looks in his wallet. With a ring of steel, Dieter produces a glinting saber. He hurls his leather satchel. The bowling sphere thuds into his chest and elevates him off his feet. In a fury, Dieter charges. Watching Dieter's charge, is caught off-guard. Dieter drops it. He swivels away as Dieter reaches him; grasps Dieter's head in both hands; draws Dieter's head up to his mouth, which closes on Dieter's ear. He rushes Franz but halts short as Franz dispatches karate kicks, his leather trousers squeaking and popping. His jaw remains fastened on Dieter's ear. Awkwardly circling, dodging Franz's kicks. Still worrying the ear. With a tearing sound, his head and Dieter's separate. Growling as Dieter shrieks, he worries his ear, waggling his head with his jaws clamped. Franz emits a loud cry with each kick; the Dude leans back, raising his arms, dodging the kicks. The Dude, also panting, rises and trots over. Donny gasps for air. The Dude dashes into the lanes. Walter places a reassuring hand on Donny's shoulder."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "They are seemed to be very unhappy. Dieter is spoken to by the woman in German. Apparently braless, she is pale with birthmarks on her face and arms, teutonically. Her camera-side leg, which is notable, ends in a foot swaddled in a bandage. The tip of the bandage is stained by dried rust-colored blood. The road is watched by Walter’s eyes as he listens to the Dude, driving, with the speech being occasionally punctuated by yaps from the back seat. Off is being looked by him as the car is slowed. Where Walter is looking is looked at by the Dude. The drive is pulled up by Walter's car into the foreground and out are gotten by him and the Dude. Off at the front lawn are both gaping. BANG—the double doors are pushed through by the Dude and Walter into. The wheelchair is hummed by him as it is spun around. He crosses to Lebowski. The big Lebowski is hoisted out of the wheelchair by Walter from behind, by his armpits. Forward is shoved by him and to the floor, weeping, he crumples. The Dude and Walter are looked at. Yaps the dog. Quintana is bellowed at by the lip of the lane, and O'Brien restrains him. Walter looks innocently at him. Hip-grinding coital motions are made by him as he is led away by O'Brien. Walter, with his head cocked, and the Dude, peeking over his shades, watch his departure. Donny, Walter, and the Dude are emerged from by the alley, each holding his leatherette ball satchel. The men in black, stunned, are conferred amongst by themselves in German. They stop conferring. The Dude is ignored by Walter, who addresses the Germans. They confer again, in German. Donny visibly shows fear. Dieter's eyes are burned with hatred as they lock on Walter's. Into his pocket, the Dude digs. Louder, as he looks in his wallet, is spoken to the Germans by him. A glinting saber is produced by Dieter with a ring of steel. His leather satchel is hurled by him. Into his chest, the bowling ball is thudded, lifting him off his feet. Dieter, in a rage, charges. Dieter's charge, is watched, and he is caught off-guard. It is dropped by Dieter. Away, he twists as Dieter reaches him; Dieter’s head is grabbed in both hands by him; up to his mouth, Dieter’s head is drawn by him, which closes on Dieter's ear. Franz is rushed at by him but he draws up short as karate kicks are sent out by Franz, his leather pants squeaking and popping. Dieter’s ear is still clamped on by his jaw. Franz's kicks are awkwardly circled and evaded. Still the ear is worried. With a tearing sound, the head and Dieter’s are separated. As Dieter screams, his ear is worried, waggling the head with jaws clamped. Franz gives a loud cry with each kick; the Dude leaning back, throws his arms up, evading the kicks. Also panting, the Dude rises and trots over. Donny gasps for air. Over the lanes runs the Dude. A reassuring hand is laid by Walter on Donny's shoulder."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "They seem very unhappy. The woman speaks to Dieter in German, appearing braless and teutonically pale with birthmarks on her face and arms. Her camera-side leg ends in a bandaged foot stained with dried rust-colored blood. Walter listens to the Dude while driving, occasionally interrupted by yaps from the back seat. As the car slows, Walter and the Dude look at the front lawn. BANG—they push through the double doors. The wheelchair hums as it spins around. Walter hoists the big Lebowski from the wheelchair, shoving him to the floor, weeping. The dog yaps. Quintana bellows from the lane, restrained by O'Brien. Walter makes hip-grinding motions as O'Brien leads him away. Walter and the Dude watch him go. Donny, Walter, and the Dude emerge from the alley with their leatherette ball satchels. The men in black confer in German. Walter addresses the Germans, who confer again. Donny is frightened. Walter's eyes burn with hatred, locked on Dieter. The Dude digs into his pocket, looking in his wallet. Dieter produces a saber, hurling his leather satchel. The bowling ball thuds into his chest, lifting him off his feet. In a rage, Dieter charges. He twists away, grabs Dieter's head, and bites his ear. Franz sends out karate kicks, his leather pants squeaking. Still clamped on Dieter's ear, he evades Franz's kicks. With a tearing sound, their heads separate. Growling as Dieter screams, he waggles his head with jaws clamped. Franz cries with each kick; the Dude leans back, evading. The Dude, panting, rises and trots over. Donny gasps for air. The Dude runs into the lanes. Walter reassures Donny with a hand on his shoulder."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "They seem unhappy. The woman speaks German to Dieter, braless, pale, with birthmarks, and a bandaged foot stained with dried blood. Walter drives, listening to the Dude, as yaps come from the back seat. The car slows, and they get out, staring at the lawn. BANG—they push through double doors. Walter hoists the big Lebowski from his wheelchair, and he crumples, weeping. The dog yaps. Quintana bellows, restrained by O'Brien. Walter watches innocently, making coital motions as O'Brien leads him away. Walter, the Dude, and Donny emerge with their ball satchels. The Germans confer in German. Walter addresses them, eyes locked on Dieter. The Dude digs into his pocket. Dieter produces a saber, hurls his satchel, and charges. He twists away, grabs Dieter's head, and bites his ear. Franz kicks, his leather pants squeaking. With a tearing sound, he separates from Dieter, growling. Franz cries with each kick; the Dude evades. Panting, the Dude rises, and Donny gasps for air. Walter reassures Donny."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "They appear to be very unhappy, displaying a sense of discontentment that is almost palpable. The woman, speaking to Dieter in German, seems to be without a bra, and her skin is notably pale in a distinctly Teutonic manner, marked with birthmarks scattered across her face and arms. Particularly striking is her leg that faces the camera, which ends in a foot wrapped in a bandage. The bandage is stained at the tip with dried blood, a rust-colored reminder of some past injury. Walter, with his eyes fixed on the road, listens intently while driving, as the Dude speaks beside him. The Dude's speech is occasionally interrupted by yaps emanating from the back seat. Walter's gaze drifts as the car begins to slow down. The Dude follows Walter's line of sight, looking in the same direction. Walter's car pulls up the driveway, coming into the foreground, and both he and the Dude exit the vehicle. They both stand there, mouths agape, staring at the front lawn. With a loud BANG, the Dude and Walter forcefully push through the double doors. Inside, a wheelchair hums as its occupant spins it around, crossing over to Lebowski. Walter, reaching around from behind, hoists the big Lebowski out of the wheelchair by his armpits, shoving him forward until he collapses to the floor, weeping uncontrollably. The Dude and Walter watch the scene unfold, while the dog continues to yap. Quintana, standing at the edge of the lane, bellows loudly, restrained by O'Brien. Walter looks at him with an innocent expression, making suggestive hip-grinding motions as O'Brien leads him away. Walter, with his head tilted, and the Dude, peering over his sunglasses, watch him depart. Emerging from the alley, Donny, Walter, and the Dude each carry their leatherette ball satchels. The men dressed in black, appearing stunned, confer amongst themselves in German. The Germans cease their discussion. Walter, ignoring the Dude, addresses the Germans directly. The Germans resume their conference, speaking again in German. Donny is visibly frightened, his fear evident. Walter's eyes, filled with burning hatred, remain locked on Dieter's. The Dude, meanwhile, is rummaging through his pocket. Speaking louder to the Germans, he searches through his wallet. With a metallic ring, Dieter produces a glinting saber. He throws his leather satchel, and the bowling ball inside thuds into his chest, lifting him off his feet. Enraged, Dieter charges forward. Watching Dieter's charge, he is caught off-guard. Dieter drops the saber. He twists away as Dieter reaches him, grabbing Dieter's head with both hands, pulling it up to his mouth, which closes on Dieter's ear. He rushes towards Franz but stops short as Franz unleashes karate kicks, his leather pants squeaking and popping with each movement. His jaw remains clamped on Dieter's ear. Awkwardly, he circles, evading Franz's kicks, still worrying the ear. With a tearing sound, his head and Dieter's separate. Growling as Dieter screams, he continues to worry the ear, shaking his head with his jaws clamped tightly. Franz cries out loudly with each kick; the Dude leans back, throwing his arms up to evade the kicks. The Dude, also panting, rises and trots over. Donny gasps for air, struggling to catch his breath. The Dude runs into the lanes, while Walter places a reassuring hand on Donny's shoulder, offering comfort amidst the chaos."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "They seem to be incredibly discontent, exuding an aura of dissatisfaction that is almost tangible in its intensity. The woman, engaged in a conversation with Dieter in German, appears not to be wearing a bra. Her complexion is strikingly pale, showcasing a distinctively Teutonic look, with birthmarks scattered across her face and arms, giving her a unique appearance. Of particular note is her leg, turned toward the camera, which culminates in a foot that is wrapped in a bandage. The bandage itself is visibly stained at the tip with dried blood, a rust-colored reminder of some prior injury that has yet to fully heal. Meanwhile, Walter, his eyes intently focused on the road, listens carefully while driving as the Dude talks beside him. Their conversation is occasionally interrupted by yaps coming from the back seat, adding to the din. Walter's gaze gradually drifts, and the car starts to decelerate. Following Walter's line of sight, the Dude directs his own gaze in the same direction. Walter maneuvers the car up the driveway, bringing it into the foreground, and both he and the Dude exit the vehicle together. They stand there momentarily, mouths wide open in disbelief, staring at the front lawn before them. With a resounding BANG, the Dude and Walter forcefully push through the double doors. Inside, a wheelchair hums as its occupant spins around, crossing over to Lebowski. Walter, reaching from behind, lifts the big Lebowski out of the wheelchair by his armpits, shoving him forward until he collapses onto the floor, weeping uncontrollably. The Dude and Walter stand by, observing the scene as it unfolds, while the dog continues its persistent yapping. Quintana, positioned at the edge of the lane, bellows loudly, held back by O'Brien. Walter regards him with an innocent expression, making suggestive hip-grinding motions as O'Brien leads him away from the scene. Walter, with his head slightly tilted, and the Dude, peering over his sunglasses, watch as he departs. Emerging from the alley, Donny, Walter, and the Dude are each carrying their leatherette ball satchels. The men dressed in black, appearing utterly stunned, converse among themselves in German. As the Germans cease their discussion, Walter, ignoring the Dude beside him, addresses the Germans directly. The Germans, resuming their conversation, continue speaking in German. Donny is visibly frightened, his fear palpable and evident in his demeanor. Walter's eyes, now filled with seething anger and burning hatred, remain fixed on Dieter's. The Dude, meanwhile, rummages through his pocket, searching intently. Speaking more loudly to the Germans, he continues his search through his wallet. With a metallic ring, Dieter produces a glinting saber. He hurls his leather satchel, and the bowling ball inside thuds heavily against his chest, lifting him off his feet. Enraged, Dieter charges forward with a furious expression. As Dieter charges, he finds himself caught off-guard. Dieter drops the saber, and he twists away as Dieter reaches him, grabbing Dieter's head with both hands. He pulls it up to his mouth, which clamps down on Dieter's ear. He rushes toward Franz but halts abruptly as Franz begins unleashing karate kicks, his leather pants squeaking and popping with every movement. His jaw remains firmly clamped on Dieter's ear. Awkwardly, he circles, deftly evading Franz's kicks while still worrying the ear in his grip. With a tearing sound, their heads separate. Growling as Dieter screams in pain, he continues to worry the ear, shaking his head vigorously with his jaws clamped tightly. Franz cries out loudly with each kick; the Dude leans back, throwing his arms up in an attempt to evade the relentless kicks. Panting heavily, the Dude rises and trots over. Donny, gasping for breath, struggles to catch his breath amidst the commotion. The Dude then rushes into the lanes, while Walter gently places a reassuring hand on Donny's shoulder, offering a measure of comfort and support amidst the swirling chaos."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The scene opens with a palpable sense of discontent as the woman, appearing visibly unhappy, begins to speak to Dieter in German. Her appearance is strikingly teutonic, with a pale complexion and birthmarks scattered across her face and arms. Her camera-side leg is notably wrapped in a bandage, the tip of which is stained with dried, rust-colored blood. Meanwhile, Walter maintains his focus on the road, his eyes fixed ahead as he listens intently to the Dude, who is seated beside him. The Dude's speech is intermittently interrupted by yaps emanating from the back seat. As the car begins to decelerate, Walter's gaze shifts, prompting the Dude to follow his line of sight. The car gradually pulls up the drive, coming to a stop in the foreground, and both Walter and the Dude exit the vehicle, their attention immediately drawn to the front lawn. With a sudden BANG, they forcefully push through the double doors. Inside, the hum of a wheelchair fills the air as its occupant spins around, making his way toward Lebowski. Walter approaches from behind, reaching around to hoist the big Lebowski out of the wheelchair by his armpits, and with a forceful shove, sends him crumpling to the floor, where he begins to weep. The Dude and Walter stand by, observing the scene, while the dog continues to yap. From the lip of the lane, Quintana's voice booms as he is restrained by O'Brien. Walter, feigning innocence, watches as Quintana is led away, making exaggerated hip-grinding motions. Walter, with his head cocked, and the Dude, peering over his shades, watch Quintana's departure. Emerging from the alley, Donny, Walter, and the Dude each carry a leatherette ball satchel. The men in black, momentarily stunned, engage in a hurried conference in German. As the Germans pause their discussion, Walter disregards the Dude and directly addresses them, prompting another round of German conferring. Donny, visibly frightened, stands by as Walter's eyes, filled with burning hatred, lock onto Dieter's. The Dude, meanwhile, rummages through his pocket, his attention divided as he looks into his wallet. Suddenly, with a metallic ring, Dieter brandishes a glinting saber. In response, Walter hurls his leather satchel, the bowling ball inside thudding into Dieter's chest and lifting him off his feet. Enraged, Dieter charges forward, catching Walter off-guard. As Dieter drops the saber, Walter twists away, grabbing Dieter's head with both hands and drawing it up to his mouth, where he clamps down on Dieter's ear. Walter then rushes toward Franz but halts abruptly as Franz counters with karate kicks, his leather pants emitting squeaks and pops. Despite the kicks, Walter maintains his grip on Dieter's ear, awkwardly circling and evading Franz's attacks. With a tearing sound, Walter's head and Dieter's separate, and Walter growls as Dieter screams, continuing to worry the ear, his head waggling with his jaws still clamped. Franz lets out a loud cry with each kick, while the Dude leans back, arms raised, to evade the kicks. Panting, the Dude rises and trots over, as Donny gasps for air. The Dude then runs into the lanes, and Walter places a reassuring hand on Donny's shoulder."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The woman, appearing unhappy and speaking German to Dieter, is notably pale with birthmarks and a bandaged foot stained with dried blood. Meanwhile, Walter drives attentively, listening to the Dude amidst occasional yaps from the back seat. As the car slows, both Walter and the Dude focus on the front lawn as they arrive and exit the vehicle. They burst through double doors, where Walter forcefully lifts the big Lebowski from his wheelchair, causing him to collapse in tears. The scene shifts to Quintana, who is restrained by O'Brien while making provocative gestures, as Walter and the Dude watch. \n\nEmerging from an alley with their bowling satchels, Donny, Walter, and the Dude encounter the Germans, who confer in their language. Walter, ignoring the Dude, confronts them with burning intensity. As tensions rise, Dieter brandishes a saber, prompting Walter to hurl his bowling ball, knocking Dieter off his feet. In a chaotic scuffle, Walter bites Dieter's ear while evading Franz's karate kicks. The struggle intensifies until Walter tears away from Dieter, growling as Dieter screams. Franz continues his assault, but the Dude manages to evade the kicks, eventually joining Walter, who reassures a gasping Donny."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "They seem very unhappy. The woman, speaking to Dieter in German, which is the most widely spoken native language in the European Union, is apparently braless and is teutonically pale with birthmarks on her face and arms, a common genetic trait among those with Germanic ancestry. Notable is her camera-side leg, which ends in a bandage-swaddled foot, often necessary for injuries that need compression and protection. Dried rust-colored blood stains the tip of the bandage, indicating a wound that recently stopped bleeding. \n\nWalter's eyes are on the road as he listens, driving, to the Dude, whose speech is occasionally punctuated by yaps from the back seat, possibly from a small breed dog known for its excitable nature. He is looking off as the car, a classic 1973 Ford Torino beloved by collectors for its durable build, slows. The Dude looks where Walter is looking. Walter's car pulls up the drive into the foreground and he and the Dude get out. Both are gaping off at the front lawn, which is meticulously landscaped as per the suburban custom. BANG—the Dude and Walter push through the double doors into a grand entrance hall. His wheelchair, equipped with a modern electric motor for ease of movement, hums as he spins it around. He is crossing to Lebowski, a figure of authority, as Walter reaches around from behind and hoists the big Lebowski out of the wheelchair by his armpits. He shoves the big Lebowski forward and he crumples to the floor, weeping, overwhelmed by the confrontation. The Dude and Walter look. The dog yaps, adding to the chaos. Quintana is bellowing from the lip of the lane, a common spot for verbal exchanges, and is restrained by O'Brien, who is known for his formidable presence. Walter looks at him innocently. He makes hip-grinding coital motions, reminiscent of a provocative dance, as O'Brien leads him away. Walter, his head cocked in curiosity, and the Dude, peeking over his shades, which are a signature style accessory, watch him go. Donny, Walter, and the Dude emerge from the alley, each holding his leatherette ball satchel used for carrying personal bowling equipment. The men in black, stunned, confer amongst themselves in German, highlighting their shared origins. The Germans stop conferring. Walter ignores the Dude, addresses the Germans with the confidence of someone used to negotiating with adversaries. The Germans confer again, in German. Donny is visibly frightened, his demeanor suggesting a high-strung individual amidst tension. Walter's eyes, burning with hatred, are locked on Dieter's, signaling an impending confrontation. The Dude is digging into his pocket for something, a habitual action when dealing with stress. Louder, to the Germans, Walter looks in his wallet for any leverage. With a ring of steel, Dieter produces a glinting saber, an anachronistic weapon choice signaling desperation or flair for dramatics. He hurls his leather satchel, oft used for bowling, containing a heavy bowling ball that thuds into his chest and lifts him off his feet. In a rage, Dieter charges, reminiscent of a dramatic showdown. Watching Dieter's charge, he is caught off-guard. Dieter drops it, the clatter echoing ominously. He twists away as Dieter reaches him; grabs Dieter's head in both hands; draws Dieter's head up to his mouth, which closes on Dieter's ear in a primal move. He rushes Franz but draws up short as Franz sends out karate kicks, a martial art technique known for its discipline and fluidity, his leather pants squeaking and popping. His jaw, still clamped on Dieter's ear, highlights an unusual but effective defense. Awkwardly circling, evading Franz's kicks. Still worrying the ear with determination. With a tearing sound, his head and Dieter's separate, marking a point of escalation. Growling as Dieter screams, he worries his ear, waggling his head with his jaws clamped, a display of dominance. Franz gives a loud cry with each kick; the Dude leans back, throwing his arms up, evading the kicks with the skill of someone accustomed to unpredictable situations. The Dude, also panting from exertion, rises and trots over. Donny gasps for air, reflecting the physical and mental toll of the encounter. The Dude runs into the lanes, familiar territory where he feels most at ease. Walter lays a reassuring hand on Donny's shoulder, offering comfort amidst the chaos."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "They seem very unhappy. The woman speaks to Dieter in German. She is apparently braless and is teutonically pale with birthmarks on her face and arms. Notable is her cameraside leg which ends in a bandageswaddled foot. Dried rustcolored blood stains the tip of the bandage. Walter's eyes are on the road as he listens driving to the Dude whose speech is occasionally punctuated by yaps from the back seat. He is looking off as the car slows. The Dude looks where Walter is looking. Walter's car pulls up the drive into the foreground and he and the Dude get out. Both are gaping off at the front lawn. BANGthe Dude and Walter push through the double doors into. His wheelchair hums as he spins it around. He is crossing to Lebowski. Walter reaches around from behind and hoists the big Lebowski out of the wheelchair by his armpits. He shoves the big Lebowski forward and he crumples to the floor weeping. The Dude and Walter look. The dog yaps. Quintana is bellowing from the lip of the lane and is restrained by O'Brien. Walter looks at him innocently. He makes hipgrinding coital motions as O'Brien leads him away. Walter his head cocked and the Dude peeking over his shades. watch him go. Donny. Walter and the Dude emerge from the alley each holding his leatherette ball satchel. The men in black stunned confer amongst themselves in German. The Germans stop conferring. Walter ignores. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. the Dude addresses the Germans. The Germans confer again in German. Donny is visibly frightened. Walter's eyes burning with hatred are locked on Dieter's. The Dude is digging into his pocket. Louder to the Germans as he looks in his wallet. With a ring of steel Dieter produces a glinting saber. He hurls his leather satchel. The bowling ball thuds into his chest and lifts him off his feet. In a rage Dieter charges. Watching Dieter's charge is caught offguard. Dieter drops it. He twists away as Dieter reaches him grabs Dieter's head in both hands draws Dieter's head up to his mouth which closes on Dieter's ear. He rushes Franz but draws up short as Franz sends out karate kicks. his leather pants squeaking and popping. His jaw is still clamped on Dieter's ear. Awkwardly circling evading Franz's kicks. Still worrying the ear. With a tearing sound his head and Dieter's separate. Growling as Dieter screams he worries his ear waggling his head with his jaws clamped. Franz gives a loud cry with each kick. the Dude leans back throwing his arms up evading the kicks. The Dude also panting. rises and trots over. Donny gasps for air. The Dude runs into the lanes. Walter lays a reassuring hand on Donny's shoulder."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "They seem very unhappy. The woman speaks to Dieter in German. She is apparently braless and is teutonically pale with birthmarks on her face and arms. Notable is her cameraside leg which ends in a bandageswaddled foot. Dried rustcolored blood stains the tip of the bandage. Walter's eyes are on the road as he listens driving to the Dude whose speech is occasionally punctuated by yaps from the back seat. He is looking off as the car slows. The Dude looks where Walter is looking. Walter's car pulls up the drive into the foreground and he and the Dude get out. Both are gaping off at the front lawn. BANGthe Dude and Walter push through the double doors into. His wheelchair hums as he spins it around. He is crossing to Lebowski. Walter reaches around from behind and hoists the big Lebowski out of the wheelchair by his armpits. He shoves the big Lebowski forward and he crumples to the floor weeping. The Dude and Walter look. The dog yaps. Quintana is bellowing from the lip of the lane and is restrained by O'Brien. Walter looks at him innocently. He makes hipgrinding coital motions as O'Brien leads him away. Walter his head cocked and the Dude peeking over his shades. watch him go. Donny. Walter and the Dude emerge from the alley each holding his leatherette ball satchel. The men in black stunned confer amongst themselves in German. The Germans stop conferring. Walter ignores. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. the Dude addresses the Germans. The Germans confer again in German. Donny is visibly frightened. Walter's eyes burning with hatred are locked on Dieter's. The Dude is digging into his pocket. Louder to the Germans as he looks in his wallet. With a ring of steel Dieter produces a glinting saber. He hurls his leather satchel. The bowling ball thuds into his chest and lifts him off his feet. In a rage Dieter charges. Watching Dieter's charge is caught offguard. Dieter drops it. He twists away as Dieter reaches him grabs Dieter's head in both hands draws Dieter's head up to his mouth which closes on Dieter's ear. He rushes Franz but draws up short as Franz sends out karate kicks. his leather pants squeaking and popping. His jaw is still clamped on Dieter's ear. Awkwardly circling evading Franz's kicks. Still worrying the ear. With a tearing sound his head and Dieter's separate. Growling as Dieter screams he worries his ear waggling his head with his jaws clamped. Franz gives a loud cry with each kick. the Dude leans back throwing his arms up evading the kicks. The Dude also panting. rises and trots over. Donny gasps for air. The Dude runs into the lanes. Walter lays a reassuring hand on Donny's shoulder."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "They seem very unhappy. The woman speaks to Dieter in German. She is apparently braless and is teutonically pale with birthmarks on her face and arms. Notable is her cameraside leg which ends in a bandageswaddled foot. Dried rustcolored blood stains the tip of the bandage. Walter's eyes are on the road as he listens driving to the Dude whose speech is occasionally punctuated by yaps from the back seat. He is looking off as the car slows. The Dude looks where Walter is looking. Walter's car pulls up the drive into the foreground and he and the Dude get out. Both are gaping off at the front lawn. BANGthe Dude and Walter push through the double doors into. His wheelchair hums as he spins it around. He is crossing to Lebowski. Walter reaches around from behind and hoists the big Lebowski out of the wheelchair by his armpits. his leather pants squeaking and popping. His jaw is still clamped on Dieter's ear. Awkwardly circling evading Franz's kicks. Still worrying the ear. With a tearing sound his head and Dieter's separate. Growling as Dieter screams he worries his ear waggling his head with his jaws clamped. Franz gives a loud cry with each kick. the Dude leans back throwing his arms up evading the kicks. The Dude also panting. rises and trots over. Donny gasps for air. The Dude runs into the lanes. Walter lays a reassuring hand on Donny's shoulder."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "They seem very unhappy. The woman speaks to Dieter in German. She is apparently braless and is teutonically pale with birthmarks on her face and arms. Notable is her cameraside leg which ends in a bandageswaddled foot. Dried rustcolored blood stains the tip of the bandage. Walter's eyes are on the road as he listens driving to the Dude whose speech is occasionally punctuated by yaps from the back seat. The Dude also panting. rises and trots over. Donny gasps for air. The Dude runs into the lanes. Walter lays a reassuring hand on Donny's shoulder."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The cats appear very amused. The child whispers to Maxine in French. He is apparently wearing a hat, and is whimsically bright with paints on his nose and fingers. Notable is his sidewalk-side arm, which ends in a glove-covered paw. Wet sky-blue paint drips from the edge of the glove. Gerald's ears are on the trail as he hums, gliding, to the Bird, whose song is occasionally interrupted by meows from the front seat. She is staring off as the bicycle speeds up. The Bird glances where Gerald is glancing. Gerald's bike skids along the path into the distance and he and the Bird hop off. Both are gazing off at the back garden. POP--the Bird and Gerald slide through the revolving screen into. Her skateboard whirs as she kicks it over. She is sprinting to Katrina. Gerald reaches forward from the side and lifts the little Katrina out of the skateboard by her elbows. He drags the little Katrina backward and she collapses to the ceiling, snoring. The Bird and Gerald scream. The cat meows. Trevor is whispering from the edge of the pond, and is restrained by McKenzie. Gerald stares at her suspiciously. She performs head-bobbing dance moves as McKenzie spins her around. Gerald, his chin raised, and the Bird, peeking under her hat, watch her dance. Cindy, Gerald, and the Bird leap from the boat, each gripping his cardboard kite basket. The women in white, inspired, sing amongst themselves in French. The French people stop singing. Gerald interrupts the Bird, questions the French people. The French people sing again, in French. Cindy is visibly relieved. Gerald's ears, filled with joy, are fixed on Maxine's. The Bird is reaching into her glove compartment. Softer, to the French people, as she peers in her backpack. With a flash of gold, Maxine reveals a shiny feather. She waves her plastic basket. The tennis racket bounces against her knee and swings her off her feet. In a cheer, Maxine dances. Observing Maxine's dance, is caught unprepared. Maxine releases it. She spins away as Maxine catches her; holds Maxine's foot in both feet; lifts Maxine's foot up to her chin, which opens on Maxine's nose. She lunges toward Felix but pulls back fast as Felix sends out dance moves, his denim shorts squeaking and cracking. Her mouth is still latched on Maxine's nose. Clumsily sliding, dodging Felix's spins. Still holding the nose. With a popping noise, her chin and Maxine's separate. Purring as Maxine giggles, she pats her nose, shaking her chin with her hands grasped. Felix gives a soft laugh with each spin; the Bird leans forward, dropping her head down, dodging the spins. The Bird, also chuckling, stands and skips over. Cindy yawns loudly. The Bird skips into the ponds. Gerald places a comforting arm on Cindy's knee."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The woman, speaking German to Dieter, is notably pale with birthmarks and a bandaged foot, stained with dried blood. Walter drives as the Dude listens, occasionally interrupted by yapping from the back seat. Arriving at their destination, Walter and the Dude are taken aback by what they see. Inside, Walter forcefully extracts the big Lebowski from his wheelchair, leaving him on the floor weeping. Quintana, restrained by O'Brien, bellows from the sidelines, while Walter and the Dude watch. The trio, including Donny, emerges with leather bowling bags as Germans argue in their native tongue. Walter confronts them, glaring at Dieter. When Dieter charges with a saber, Walter throws his bag, knocking Dieter back. A chaotic scuffle ensues, with Walter biting Dieter’s ear and evading Franz's karate kicks. The Dude dodges the assault as Donny struggles for breath, and Walter comforts Donny with a reassuring touch."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Walter lays a reassuring hand on Donny's shoulder The Dude runs into the lanes  Donny gasps for air  rises and trots over  The Dude also panting  the Dude leans back throwing his arms up evading the kicks  Franz gives a loud cry with each kick  Growling as Dieter screams he worries his ear waggling his head with his jaws clamped  With a tearing sound his head and Dieter's separate  Still worrying the ear  Awkwardly circling evading Franz's kicks  His jaw is still clamped on Dieter's ear  his leather pants squeaking and popping  He rushes Franz but draws up short as Franz sends out karate kicks  He twists away as Dieter reaches him grabs Dieter's head in both hands draws Dieter's head up to his mouth which closes on Dieter's ear  Dieter drops it  Watching Dieter's charge is caught offguard  In a rage Dieter charges  The bowling ball thuds into his chest and lifts him off his feet  He hurls his leather satchel  With a ring of steel Dieter produces a glinting saber  Louder to the Germans as he looks in his wallet  The Dude is digging into his pocket  Walter's eyes burning with hatred are locked on Dieter's  Donny is visibly frightened  The Germans confer again in German  the Dude addresses the Germans  Walter ignores  The Germans stop conferring  The men in black stunned confer amongst themselves in German  Walter and the Dude emerge from the alley each holding his leatherette ball satchel  Donny  watch him go  Walter his head cocked and the Dude peeking over his shades  He makes hipgrinding coital motions as O'Brien leads him away  Walter looks at him innocently  Quintana is bellowing from the lip of the lane and is restrained by O'Brien  The dog yaps  The Dude and Walter look  He shoves the big Lebowski forward and he crumples to the floor weeping  Walter reaches around from behind and hoists the big Lebowski out of the wheelchair by his armpits  He is crossing to Lebowski  His wheelchair hums as he spins it around  BANGthe Dude and Walter push through the double doors into  Both are gaping off at the front lawn  Walter's car pulls up the drive into the foreground and he and the Dude get out  The Dude looks where Walter is looking  He is looking off as the car slows  Walter's eyes are on the road as he listens driving to the Dude whose speech is occasionally punctuated by yaps from the back seat  Dried rustcolored blood stains the tip of the bandage  Notable is her cameraside leg which ends in a bandageswaddled foot  She is apparently braless and is teutonically pale with birthmarks on her face and arms  The woman speaks to Dieter in German  They seem very unhappy "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The woman speaks to Dieter in German They seem very unhappy Notable is her cameraside leg which ends in a bandageswaddled foot She is apparently braless and is teutonically pale with birthmarks on her face and arms Walter's eyes are on the road as he listens driving to the Dude whose speech is occasionally punctuated by yaps from the back seat Dried rustcolored blood stains the tip of the bandage The Dude looks where Walter is looking He is looking off as the car slows Both are gaping off at the front lawn Walter's car pulls up the drive into the foreground and he and the Dude get out His wheelchair hums as he spins it around BANGthe Dude and Walter push through the double doors into Walter reaches around from behind and hoists the big Lebowski out of the wheelchair by his armpits He is crossing to Lebowski The Dude and Walter look He shoves the big Lebowski forward and he crumples to the floor weeping Quintana is bellowing from the lip of the lane and is restrained by O'Brien The dog yaps He makes hipgrinding coital motions as O'Brien leads him away Walter looks at him innocently watch him go Walter his head cocked and the Dude peeking over his shades Walter and the Dude emerge from the alley each holding his leatherette ball satchel Donny The Germans stop conferring The men in black stunned confer amongst themselves in German the Dude addresses the Germans Walter ignores Donny is visibly frightened The Germans confer again in German The Dude is digging into his pocket Walter's eyes burning with hatred are locked on Dieter's With a ring of steel Dieter produces a glinting saber Louder to the Germans as he looks in his wallet The bowling ball thuds into his chest and lifts him off his feet He hurls his leather satchel Watching Dieter's charge is caught offguard In a rage Dieter charges He twists away as Dieter reaches him grabs Dieter's head in both hands draws Dieter's head up to his mouth which closes on Dieter's ear Dieter drops it his leather pants squeaking and popping He rushes Franz but draws up short as Franz sends out karate kicks Awkwardly circling evading Franz's kicks His jaw is still clamped on Dieter's ear With a tearing sound his head and Dieter's separate Still worrying the ear Franz gives a loud cry with each kick Growling as Dieter screams he worries his ear waggling his head with his jaws clamped The Dude also panting the Dude leans back throwing his arms up evading the kicks Donny gasps for air rises and trots over Walter lays a reassuring hand on Donny's shoulder The Dude runs into the lanes"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "the Dude addresses the Germans  The Germans confer again in German  Donny is visibly frightened  Walter's eyes burning with hatred are locked on Dieter's  The Dude is digging into his pocket  Louder to the Germans as he looks in his wallet  With a ring of steel Dieter produces a glinting saber  He hurls his leather satchel  The bowling ball thuds into his chest and lifts him off his feet  In a rage Dieter charges  Watching Dieter's charge is caught offguard  Dieter drops it  He twists away as Dieter reaches him grabs Dieter's head in both hands draws Dieter's head up to his mouth which closes on Dieter's ear  He rushes Franz but draws up short as Franz sends out karate kicks  his leather pants squeaking and popping  His jaw is still clamped on Dieter's ear  Awkwardly circling evading Franz's kicks  Still worrying the ear  With a tearing sound his head and Dieter's separate  Growling as Dieter screams he worries his ear waggling his head with his jaws clamped  Franz gives a loud cry with each kick  the Dude leans back throwing his arms up evading the kicks  The Dude also panting  rises and trots over  Donny gasps for air  The Dude runs into the lanes  Walter lays a reassuring hand on Donny's shoulder They seem very unhappy  The woman speaks to Dieter in German  She is apparently braless and is teutonically pale with birthmarks on her face and arms  Notable is her cameraside leg which ends in a bandageswaddled foot  Dried rustcolored blood stains the tip of the bandage  Walter's eyes are on the road as he listens driving to the Dude whose speech is occasionally punctuated by yaps from the back seat  He is looking off as the car slows  The Dude looks where Walter is looking  Walter's car pulls up the drive into the foreground and he and the Dude get out  Both are gaping off at the front lawn  BANGthe Dude and Walter push through the double doors into  His wheelchair hums as he spins it around  He is crossing to Lebowski  Walter reaches around from behind and hoists the big Lebowski out of the wheelchair by his armpits  He shoves the big Lebowski forward and he crumples to the floor weeping  The Dude and Walter look  The dog yaps  Quintana is bellowing from the lip of the lane and is restrained by O'Brien  Walter looks at him innocently  He makes hipgrinding coital motions as O'Brien leads him away  Walter his head cocked and the Dude peeking over his shades  watch him go  Donny  Walter and the Dude emerge from the alley each holding his leatherette ball satchel  The men in black stunned confer amongst themselves in German  The Germans stop conferring  Walter ignores "
        }
      ]
    }
  ]
}