{
  "ground_truth": "He wears black leather pants and a black leather jacket, open, shirtless, exposing fine blond chest hair and pale skin. One arm trails off into the water; next to it, an empty whiskey bottle bobs. Brandt releases a gale of forced laughter. Brandt nervously takes the Dude by the elbow. The Dude grudgingly allows himself to be led away, still looking at the young woman. He continues to lead away the Dude, who looks back over his shoulder. Scattered by a strike. Donny calls out from the bench. As the Dude walks back to the scoring table he turns to another team in black bowling shirts--the Cavaliers--that shares the lane. He lets the small yapping dog out of the carrier. It scoots around the bowling table, sniffing at bowlers and wagging its tail. Smokey turns from his last roll to look at Walter. Walter takes out a gun. Walter and the Dude walk to the Dude's car. The Pomeranian trots happily behind Walter who totes the empty carrier. As the two men get into the car, Walter is still smug. A large, brilliant Persian rug lies beneath the Dude's beat-up old furniture. At the table next to the answering machine the Dude is mixing kalhua, rum, and milk. A beep. It swings open to reveal a short, hairy, muscular but balding middle-aged man in a black T-shirt and black cut-off jeans. The Dude takes a swig of his kalhua. We are pushing Brandt down the high-ceilinged hallway. Brandt talks back over his shoulder. Distantly, we hear a dolorous soprano. He turns back around and the firelight shows teartracks on his cheeks. He clears his throat. Brandt hastily pulls a flimsy sheet from his clipboard and hands it to the Dude. Brandt tugs at the Dude's shirt and points him back to the hall. The soprano's singing is once again faint. Brandt's voice is hushed. We are looking across the length of the bowling alley at a tall, thin, Hispanic bowler displaying perfect form. He wears an all-in-one dacron-polyester stretch bowling outfit with a racing stripe down each side. CRASH--scattered by a strike, in slow motion. The Dude is staring off towards the bowler. We see Quintana, in pressed jeans and a stretchy sweater, walking up a stoop in a residential neighborhood and zinging the bell. The door swings open and a beer-swilling middle-aged man looks dully out at Quintana, who looks hesitantly up. He slips a little black box out of his shirt pocket. Donny has been watching Quintana. They both look up. Quintana, on his way out, looks down at them from the lip of the lanes. He is holding a fancy black-and-red leather ball satchel (perhaps a Sylvia Wein). Behind him stands his partner, O'Brien, a short fat Irishman with tufted red hair.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He dons ebony hide trousers and an ebony hide coat, open, bare-chested, revealing fine flaxen torso fuzz and pallid complexion. One limb trails off into the liquid; adjacent to it, a vacant whiskey bottle floats. Brandt emits a gust of compelled chuckles. Brandt anxiously grips the Dude by the arm. The Dude reluctantly permits himself to be guided away, still gazing at the youthful woman. He proceeds to guide away the Dude, who glances backward over his shoulder. Dispersed by a hit. Donny calls out from the seat. As the Dude strides back to the scoring area he turns to another squad in ebony bowling garments—the Cavaliers—that shares the lane. He lets the petite yapping canine out of the container. It dashes around the bowling area, sniffing at bowlers and wagging its tail. Smokey turns from his final throw to gaze at Walter. Walter draws out a firearm. Walter and the Dude amble to the Dude's vehicle. The Pomeranian trots joyfully behind Walter who totes the vacant container. As the pair of men enter the car, Walter remains smug. A large, brilliant Iranian carpet lies beneath the Dude's beat-up ancient furnishings. At the table adjacent to the answering device the Dude is blending kalhua, rum, and milk. A beep. It swings open to reveal a short, hairy, muscular but balding middle-aged gentleman in an ebony T-shirt and ebony cut-off jeans. The Dude takes a swig of his kalhua. We are propelling Brandt down the lofty-ceilinged corridor. Brandt speaks back over his shoulder. Distantly, we hear a mournful soprano. He turns back around and the firelight reveals tear streaks on his cheeks. He clears his throat. Brandt hurriedly pulls a flimsy sheet from his clipboard and hands it to the Dude. Brandt tugs at the Dude's shirt and gestures him back to the hall. The soprano's melody is once again faint. Brandt's voice is hushed. We are observing across the span of the bowling alley at a tall, slender, Hispanic bowler demonstrating flawless form. He dons an all-in-one dacron-polyester stretch bowling ensemble with a racing stripe down each side. CRASH—scattered by a hit, in slow motion. The Dude is gazing off towards the bowler. We see Quintana, in pressed jeans and a stretchy pullover, ascending a stoop in a residential area and zinging the chime. The door swings open and a beer-swilling middle-aged man looks dully out at Quintana, who looks hesitantly up. He slips a small ebony box out of his shirt pocket. Donny has been observing Quintana. They both gaze up. Quintana, on his way out, gazes down at them from the rim of the lanes. He is clutching a fancy black-and-red hide ball bag (perhaps a Sylvia Wein). Behind him stands his associate, O'Brien, a short stout Irishman with tufted red hair."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Black leather pants and a black leather jacket are worn by him, open, shirtless, exposing fine blond chest hair and pale skin. The water is trailed into by one arm; next to it, an empty whiskey bottle bobs. A gale of forced laughter is released by Brandt. The Dude is taken nervously by the elbow by Brandt. The Dude grudgingly allows himself to be led away, still looking at the young woman. Away, the Dude is continued to be led by him, who looks back over his shoulder. Scattered a strike. From the bench, Donny calls out. As the Dude walks back to the scoring table, he turns to another team in black bowling shirts—the Cavaliers—that shares the lane. The small yapping dog is let out of the carrier by him. Around the bowling table, it scoots, sniffing at bowlers and wagging its tail. From his last roll, Smokey turns to look at Walter. Out of a gun, Walter takes. Walter and the Dude walk to the Dude's car. Behind Walter, who totes the empty carrier, the Pomeranian trots happily. As the two men get into the car, smugness still defines Walter. Beneath the Dude's beat-up old furniture lies a large, brilliant Persian rug. Kalhua, rum, and milk are mixed by the Dude at the table next to the answering machine. A beep is heard. It swings open to reveal a short, hairy, muscular but balding middle-aged man in a black T-shirt and black cut-off jeans. A swig of his kalhua is taken by the Dude. Down the high-ceilinged hallway, we are pushing Brandt. Over his shoulder, Brandt talks back. A dolorous soprano is heard distantly. Teartracks on his cheeks are shown by the firelight as he turns back around. His throat is cleared. A flimsy sheet is hastily pulled from his clipboard by Brandt and handed to the Dude. At the Dude's shirt, Brandt tugs and points him back to the hall. The soprano's singing once again fades. Brandt's voice is hushed. Across the length of the bowling alley, we are looking at a tall, thin, Hispanic bowler displaying perfect form. An all-in-one dacron-polyester stretch bowling outfit with a racing stripe down each side is worn by him. CRASH—scattered a strike, in slow motion. Off towards the bowler, the Dude is staring. We see Quintana, in pressed jeans and a stretchy sweater, walk up a stoop in a residential neighborhood and zing the bell. The door swings open and out dully looks a beer-swilling middle-aged man at Quintana, who looks hesitantly up. A little black box is slipped out of his shirt pocket by him. Quintana has been watched by Donny. They both look up. Quintana, on his way out, looks down at them from the lip of the lanes. A fancy black-and-red leather ball satchel (perhaps a Sylvia Wein) is held by him. Behind him, his partner, O'Brien, a short fat Irishman with tufted red hair, stands."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Dressed in a black leather jacket and pants, Brandt is shirtless, revealing his pale skin and blond chest hair. One arm dangles in the water near a floating whiskey bottle. Brandt forcefully laughs and nervously grips the Dude's elbow, who reluctantly follows, glancing back at the young woman. As they walk, Donny calls from the bench. The Dude approaches another team, the Cavaliers, in black bowling shirts. A small dog is released from its carrier, eagerly sniffing at bowlers. Smokey finishes his roll and turns to Walter, who reveals a gun. Walter and the Dude head to the car with a happy Pomeranian trailing behind. Under the Dude's worn furniture, a vibrant Persian rug lies. Next to an answering machine, the Dude mixes Kahlua, rum, and milk. A door reveals a muscular, balding man in black attire. The Dude drinks his concoction. They push Brandt down a high-ceilinged hallway while he speaks over his shoulder. In the distance, a soprano's voice echoes. Firelight highlights tear tracks on a man's cheeks as he clears his throat. Brandt pulls a paper from his clipboard for the Dude, directing him back to the hall while the singing fades. We view a tall Hispanic bowler in a one-piece bowling outfit executing a perfect strike. The Dude watches the bowler. Quintana, in pressed jeans and a sweater, rings a doorbell at a residence. A middle-aged man appears, looking at Quintana, who hesitantly removes a small black box. Donny observes Quintana, who then looks at him from the lanes' edge, holding a striking leather ball satchel, with his partner, O'Brien, a short, red-haired Irishman."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He wears black leather pants and jacket, open and shirtless, exposing blond chest hair and pale skin. An arm trails in the water; a whiskey bottle bobs nearby. Brandt releases forced laughter, nervously guiding the Dude away as he looks at the young woman. Donny calls from the bench. The Dude passes the Cavaliers in black bowling shirts sharing the lane. Releasing a small yapping dog, it sniffs bowlers. Smokey turns to Walter, who reveals a gun. Walter and the Dude reach the car, the Pomeranian happily behind. A Persian rug lies beneath the Dude's old furniture. Near the answering machine, he mixes Kahlua, rum, and milk. The door swings open, revealing a short man in a black T-shirt and cut-off jeans. Brandt pulls a sheet from his clipboard, handing it to the Dude, pointing him to the hall. The distant soprano is faint. At the bowling alley, a Hispanic bowler in a dacron-polyester outfit with racing stripes bowls perfectly. CRASH—pins scatter. The Dude watches him. Quintana, in pressed jeans and a stretchy sweater, rings a bell at a residence. A beer-swilling man answers dully. Quintana slips a black box from his pocket, and Donny watches. Quintana exits with a black-and-red ball satchel. His partner, O'Brien, a short Irishman with tufted red hair, stands behind."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He is dressed in striking black leather pants paired with a matching black leather jacket, which he leaves open, revealing his bare chest adorned with fine blond chest hair and pale, almost ethereal skin. One of his arms extends leisurely into the water next to him, where an empty whiskey bottle gently bobs up and down. Brandt releases a boisterous gale of laughter that feels forced. In a nervous gesture, Brandt takes the Dude gently by the elbow. The Dude, although somewhat reluctant, grudgingly allows himself to be guided away, his eyes still lingering on the young woman they are leaving behind. Brandt continues to lead the Dude away, who glances back over his shoulder with curiosity. A strike scatters the pins, causing a commotion. Donny calls out from where he is seated on the bench. As the Dude makes his way back to the scoring table, he turns his attention to another team, who are all dressed in black bowling shirts and are known as the Cavaliers. This team shares the lane with them. He proceeds to let the small, energetic yapping dog out of its carrier. The dog enthusiastically scurries around the bowling table, sniffing at the bowlers and wagging its tail with excitement. Smokey, having just completed his last roll, turns his attention to look at Walter. In a surprising move, Walter takes out a gun. Walter and the Dude then walk towards the Dude's old car. The Pomeranian trots along happily behind Walter, who is now carrying the empty pet carrier. As the two men climb into the car, Walter maintains a smug expression. Underneath the Dude's worn-out, old furniture lies a large, magnificent Persian rug. At the table adjacent to the answering machine, the Dude is busy mixing a concoction of Kahlua, rum, and milk. A beep interrupts the scene. The door swings open to reveal a short, hairy, muscular yet balding middle-aged man dressed in a black T-shirt and black cut-off jeans. The Dude takes a swig of his Kahlua mixture. We are now pushing Brandt down a hallway with high ceilings. As Brandt moves, he speaks back over his shoulder. In the distance, we are able to hear the sound of a mournful soprano singing. Brandt turns back around, and the flickering firelight highlights tear tracks on his cheeks. He clears his throat in an attempt to regain composure. Brandt hastily pulls a flimsy sheet from his clipboard and hands it over to the Dude. Brandt then tugs at the Dude’s shirt and directs him back toward the hallway. Once more, the soprano’s singing becomes faint. Brandt’s voice is now hushed. We find ourselves looking across the expansive length of the bowling alley at a tall, thin, Hispanic bowler who is displaying impeccable form. He is dressed in an all-in-one dacron-polyester stretch bowling outfit that features a racing stripe running down each side. CRASH—the pins are scattered by another strike, this time captured in slow motion. The Dude is staring intently in the bowler’s direction. We see Quintana, clad in pressed jeans and a stretchy sweater, as he walks up to a stoop in a residential neighborhood and confidently rings the bell. The door swings open, revealing a middle-aged man, beer in hand, who looks out at Quintana with a dull expression. Quintana hesitantly looks up at the man. He discreetly slips a little black box out of his shirt pocket. Donny, who has been observing Quintana, looks up as well. As Quintana makes his way out, he glances down at them from the lip of the lanes. He is holding a sophisticated black-and-red leather ball satchel, which could very well be a Sylvia Wein. Standing behind him is his partner, O’Brien, who is a short, fat Irishman with tufted red hair."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He is attired in striking, eye-catching black leather pants, which he has stylishly paired with a matching, equally striking black leather jacket. The jacket is left open, casually unzipping to reveal his bare chest, which is adorned with a fine sprinkling of blond chest hair that contrasts with his pale, almost ethereal skin tone. One of his arms extends leisurely into the water that lies beside him. In the water, an empty whiskey bottle is gently bobbing up and down, riding the small waves. Brandt, in an effort to mask his unease, releases a boisterous gale of laughter that somehow feels rather forced and unnatural. In a nervous gesture, he reaches out, taking the Dude gently by the elbow. The Dude, although clearly somewhat reluctant, grudgingly allows himself to be guided away by Brandt, his eyes still lingering reluctantly on the young woman they are leaving behind. Brandt continues to escort the Dude further away, and the Dude glances back over his shoulder with a sense of curiosity. A strike at the lane causes the pins to scatter dramatically, leading to a commotion. Donny calls out from where he is seated comfortably on the bench. As the Dude makes his way back to the scoring table, his attention shifts to another team nearby. This particular team, known as the Cavaliers, shares the lane with them and is conspicuously dressed in stylish black bowling shirts. He proceeds to release an energetic, small yapping dog from its carrier. The dog enthusiastically scurries around the bowling table, sniffing excitedly at the bowlers and wagging its tail with uncontainable excitement. Smokey, having just completed his last roll, shifts his focus to look over at Walter. In a surprising and startling move, Walter takes out a gun. Walter and the Dude then begin their walk towards the Dude's old, weathered car, with the Pomeranian happily trotting along behind Walter, who is now carrying the empty pet carrier. As the two men climb into the car, Walter maintains a self-satisfied, smug expression. Beneath the Dude's collection of worn-out, aged furniture lies a large, magnificently ornate Persian rug. At the table adjacent to the answering machine, the Dude is busy mixing a decadent concoction of Kahlua, rum, and milk. A beep from the machine interrupts the scene. The door swings open, revealing a short, hairy, muscular yet balding middle-aged man who is dressed in a plain black T-shirt and black cut-off jeans. The Dude takes a swig of his Kahlua mixture, savoring the taste. We are now propelled forward, pushing Brandt down a hallway with impressively high ceilings. As Brandt moves, he speaks back over his shoulder, his voice trailing behind him. In the distance, the sound of a mournful soprano's singing can be faintly heard, adding an emotional undertone. Brandt turns back around, and the flickering firelight catches the tear tracks on his cheeks. He clears his throat, attempting to regain his composure and maintain his dignity. Brandt hastily pulls a flimsy sheet from his clipboard and hands it over to the Dude. Brandt then tugs at the Dude’s shirt and directs him back toward the hallway. Once more, the soprano’s haunting singing becomes faintly audible. Brandt’s voice is now hushed, speaking more softly. We find ourselves looking across the expansive, cavernous length of the bowling alley at a tall, thin Hispanic bowler who is displaying impeccable form and style. He is dressed in a form-fitting all-in-one dacron-polyester stretch bowling outfit that features a sleek racing stripe running boldly down each side. CRASH—the pins are scattered by yet another powerful strike, this time captured in slow motion. The Dude is staring intently in the direction of the bowler. We see Quintana, clad in meticulously pressed jeans and a snug, stretchy sweater, as he approaches a stoop in a residential neighborhood and confidently rings the bell. The door swings open, and a middle-aged man, with a beer in hand, looks out at Quintana with a dull, somewhat uninterested expression. Quintana hesitantly looks up at the man, and he discreetly slips a small, intriguing black box out of his shirt pocket. Donny, who has been quietly observing Quintana, looks up with curiosity as well. As Quintana makes his way out, he glances down at them from the lip of the lanes, holding a sophisticated, stylish black-and-red leather ball satchel, possibly a Sylvia Wein. Standing behind Quintana is his partner, O’Brien, who is a short, stout Irishman with a head of tufted red hair."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He is dressed in black leather pants and a black leather jacket, which he wears open to reveal his shirtless torso, exhibiting a fine blond chest hair and a strikingly pale skin. As he reclines, one arm dangles off the edge and dips into the water below, where an empty whiskey bottle bobs beside his hand. Brandt, trying to mask his anxiety, suddenly erupts into a gale of forced laughter that echoes around them. With a nervous hand, Brandt reaches out and gently takes the Dude by the elbow, the Dude begrudgingly accepting the guidance, although his gaze remains fixed on a young woman nearby. As they move along, Brandt persistently leads the Dude away, prompting him to glance backward over his shoulder in a lingering glimpse. Meanwhile, a bowling ball thunders down the lane, scattering pins in a forceful strike. From a bench, Donny's voice rings out, calling attention to himself. The Dude, upon making his way back to the scoring table, diverts his attention to another team adorned in black bowling shirts, the Cavaliers, who are sharing the lane. In a different setting, he releases a small yapping dog from a carrier, and the little creature enthusiastically scurries around the bowling table, sniffing curiously at bowlers and wagging its tail energetically. As Smokey concludes his last roll, he turns to fix his gaze on Walter, who nonchalantly reaches into his attire and brandishes a gun. Joining Walter, the Dude heads toward his car, while the Pomeranian joyfully trots behind Walter, who carries the now-empty carrier. As both men settle into the car, a sense of smugness still lingers with Walter. In a separate scene, beneath his worn-out old furniture, a large, brilliantly colored Persian rug stretches out. The Dude stands at a table near the answering machine, meticulously concocting a mixture of Kalhua, rum, and milk. A beep interrupts the process. A nearby door swings open, revealing the figure of a short, hairy, muscular yet balding middle-aged man clad in a black T-shirt and black cut-off jeans. As the Dude takes a sizeable swig of his Kalhua concoction, the action shifts to us propelling Brandt down a high-ceilinged hallway. Over his shoulder, Brandt continues to speak, while the faint strains of a dolorous soprano can be heard in the distance. He turns back around, and under the glow of the firelight, tear tracks glisten on his cheeks. Clearing his throat to regain composure, Brandt quickly extracts a flimsy sheet from his clipboard and hands it to the Dude. With urgency, Brandt tugs at the Dude’s shirt, pointing him back toward the hallway where the soprano's singing once again fades to a whisper. Brandt's voice drops to a hushed tone. Our perspective shifts to viewing the bowling alley's length, where a tall, thin Hispanic bowler demonstrates perfect form, clad in an all-in-one Dacron-polyester stretch bowling outfit complete with racing stripes along its sides. In a slow-motion spectacle, a strike sends pins crashing and scattering across the lane. Meanwhile, the Dude's attention drifts off towards the bowler. Quintana appears, clad in pressed jeans and a stretchy sweater, ascending a stoop in a residential area to ring a bell. As the door swings open, a beer-swilling, middle-aged man peers out at Quintana with a dull expression, prompting Quintana to glance hesitantly upwards. With deft fingers, Quintana retrieves a little black box from his shirt pocket. Observing from a distance, Donny fixes his gaze on Quintana as the latter, on his way out, looks down towards them from the edge of the lanes. Clutched in Quintana's hand is a striking black-and-red leather ball satchel, potentially a Sylvia Wein. Behind him, his partner, O'Brien, a short, stout Irishman with tufted red hair, stands by his side."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Brandt sits with a forced laugh, clad in black leather and shirtless, his arm trailing into the water alongside an empty whiskey bottle. Nervously, he guides the Dude away as the Dude glances back at a young woman. Meanwhile, Donny calls from the bench as the Dude approaches the Cavaliers, another bowling team, at the scoring table. He releases a small dog from its carrier, letting it sniff around and wag its tail. Smokey finishes his roll and looks at Walter, who reveals a gun as he and the Dude head to the Dude's car, with the Pomeranian following cheerfully as Walter carries the empty carrier. They settle into the car, Walter still appearing smug.\n\nAt home, the Dude stands on a large Persian rug amidst worn furniture, mixing a drink of Kahlua, rum, and milk. The answering machine beeps as the door opens to reveal a short, muscular man in a black T-shirt and cut-off jeans. Taking a swig, the Dude observes Brandt being led down a high-ceilinged hallway while Brandt speaks back over his shoulder, his voice hushed as a distant soprano sings. With tears visible in the firelight, Brandt clears his throat, hands the Dude a flimsy sheet, and points him back to the hall.\n\nAcross the bowling alley, a skilled Hispanic bowler in a stretch bowling outfit executes a perfect strike. The Dude, watching, spots Quintana—dressed in pressed jeans and a stretchy sweater—ringing a bell in a residential area. A middle-aged man appears at the door as Quintana hesitantly retrieves a small black box from his pocket. Donny watches Quintana, who gazes down at him and O'Brien, his Irish partner with tufted red hair, as he holds a fancy leather ball satchel."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He wears black leather pants and a black leather jacket, open, shirtless, exposing fine blond chest hair and pale skin, much like the fashion style popularized by rock icons in the late 20th century. One arm trails off into the water, reminiscent of the serene canals often found in Venice; next to it, an empty whiskey bottle bobs, a brand favored for its smooth, rich flavor. Brandt releases a gale of forced laughter, echoing through the room like a performance at a comedy club. Brandt nervously takes the Dude by the elbow, a gesture often used to assert control in tense situations. The Dude grudgingly allows himself to be led away, still looking at the young woman, who seems to have an enigmatic air about her, akin to a Mona Lisa smile. He continues to lead away the Dude, who looks back over his shoulder, much like a character in a noir film. Scattered by a strike, the sound of pins crashing fills the bowling alley, a sport with roots tracing back to ancient Egypt. Donny calls out from the bench, his voice bright, cutting through the lively noise of the alley like a beacon. As the Dude walks back to the scoring table, he turns to another team in black bowling shirts—the Cavaliers, named after historic European knights known for their chivalry—that shares the lane. He lets the small yapping dog, a lively Pomeranian often associated with royalty due to its luxurious coat, out of the carrier. It scoots around the bowling table, sniffing at bowlers and wagging its tail with the vigor typical of its breed. Smokey turns from his last roll to look at Walter, a seasoned bowler whose reputation precedes him in local leagues. Walter takes out a gun, reminiscent of a tense standoff in a western film. Walter and the Dude walk to the Dude's car, a vintage model remembered fondly by collectors. The Pomeranian trots happily behind Walter who totes the empty carrier, its gait not unlike that of a show dog on parade. As the two men get into the car, Walter is still smug, exuding an air of self-satisfaction like a poker player who has out-bluffed his opponents. A large, brilliant Persian rug, highly prized for its intricate design and craftsmanship, lies beneath the Dude's beat-up old furniture. At the table next to the answering machine, a relic of the pre-digital era, the Dude is mixing kalhua, rum, and milk to create a White Russian, a cocktail popularized in the late 20th century. A beep signifies a missed call, a routine sound in an era before smartphones. It swings open to reveal a short, hairy, muscular but balding middle-aged man in a black T-shirt and black cut-off jeans, an outfit reminiscent of a casual biker style. The Dude takes a swig of his kalhua, savoring the rich, coffee-flavored liqueur. We are pushing Brandt down the high-ceilinged hallway, reminiscent of the grand corridors in classical mansions. Brandt talks back over his shoulder, his voice carrying the timbre of someone accustomed to issuing orders. Distantly, we hear a dolorous soprano, evoking the haunting beauty of an opera aria. He turns back around and the firelight shows teartracks on his cheeks, like a character from a dramatic play. He clears his throat, a sound echoing softly in the quiet air. Brandt hastily pulls a flimsy sheet from his clipboard and hands it to the Dude, a document that seems official yet lacks substance. Brandt tugs at the Dude's shirt and points him back to the hall, indicating a path often walked by those with pressing matters. The soprano's singing is once again faint, as if carried by the walls of an ancient theater. Brandt's voice is hushed, like a secret shared in confidence. We are looking across the length of the bowling alley, a popular locale for both recreation and competition, at a tall, thin, Hispanic bowler displaying perfect form reminiscent of a professional athlete. He wears an all-in-one dacron-polyester stretch bowling outfit with a racing stripe down each side, a design inspired by mid-century athletic wear. CRASH—scattered by a strike, in slow motion, capturing the impactful climax like a scene from a sports film. The Dude is staring off towards the bowler, captivated by the precision and grace. We see Quintana, in pressed jeans and a stretchy sweater, walking up a stoop in a residential neighborhood typical of suburban architecture, and zinging the bell with the enthusiasm of someone delivering urgent news. The door swings open and a beer-swilling middle-aged man looks dully out at Quintana, who looks hesitantly up, as if assessing the situation for hidden dangers. He slips a little black box out of his shirt pocket, a device that could contain anything from a simple note to a high-tech gadget. Donny has been watching Quintana, intrigued by the unfolding drama. They both look up, their attention caught by a sudden noise. Quintana, on his way out, looks down at them from the lip of the lanes, his posture relaxed like that of an experienced negotiator. He is holding a fancy black-and-red leather ball satchel, perhaps a Sylvia Wein, known for its stylish and functional designs. Behind him stands his partner, O'Brien, a short fat Irishman with tufted red hair, a striking figure reminiscent of a folklore character."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He wears black leather pants and a black leather jacket open shirtless exposing fine blond chest hair and pale skin. One arm trails off into the water. next to it an empty whiskey bottle bobs. Brandt releases a gale of forced laughter. Brandt nervously takes the Dude by the elbow. The Dude grudgingly allows himself to be led away still looking at the young woman. He continues to lead away the Dude who looks back over his shoulder. Scattered by a strike. Donny calls out from the bench. As the Dude walks back to the scoring table he turns to another team in black bowling shirtsthe Cavaliersthat shares the lane. He let us the small yapping dog out of the carrier. It scoots around the bowling table sniffing at bowlers and wagging its tail. Smokey turns from his last roll to look at Walter. Walter takes out a gun. Walter and the Dude walk to the Dude's car. The Pomeranian trots happily behind Walter who totes the empty carrier. As the two men get into the car Walter is still smug. A large brilliant Persian rug lies beneath the Dude's beatup old furniture. At the table next to the answering machine the Dude is mixing kalhua rum and milk. A beep. It swings open to reveal a short hairy muscular but balding middleaged man in a black Tshirt and black cutoff jeans. The Dude takes a swig of his kalhua. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. We are pushing Brandt down the highceilinged hallway. Brandt talks back over his shoulder. Distantly we hear a dolorous soprano. He turns back around and the firelight shows teartracks on his cheeks. He clears his throat. Brandt hastily pulls a flimsy sheet from his clipboard and hands it to the Dude. Brandt tugs at the Dude's shirt and points him back to the hall. The soprano's singing is once again faint. Brandt's voice is hushed. We are looking across the length of the bowling alley at a tall thin Hispanic bowler displaying perfect form. He wears an allinone dacronpolyester stretch bowling outfit with a racing stripe down each side. CRASHscattered by a strike in slow motion. The Dude is staring off towards the bowler. We see Quintana in pressed jeans and a stretchy sweater walking up a stoop in a residential neighborhood and zinging the bell. The door swings open and a beerswilling middleaged man looks dully out at Quintana who looks hesitantly up. He slips a little black box out of his shirt pocket. Donny has been watching Quintana. They both look up. Quintana on his way out looks down at them from the lip of the lanes. He is holding a fancy blackandred leather ball satchel perhaps a Sylvia Wein. Behind him stands his partner. O'Brien a short fat Irishman with tufted red hair."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He wears black leather pants and a black leather jacket open shirtless exposing fine blond chest hair and pale skin. One arm trails off into the water. next to it an empty whiskey bottle bobs. Brandt releases a gale of forced laughter. Brandt nervously takes the Dude by the elbow. The Dude grudgingly allows himself to be led away still looking at the young woman. He continues to lead away the Dude who looks back over his shoulder. Scattered by a strike. Donny calls out from the bench. As the Dude walks back to the scoring table he turns to another team in black bowling shirtsthe Cavaliersthat shares the lane. He let us the small yapping dog out of the carrier. It scoots around the bowling table sniffing at bowlers and wagging its tail. Smokey turns from his last roll to look at Walter. Walter takes out a gun. Walter and the Dude walk to the Dude's car. The Pomeranian trots happily behind Walter who totes the empty carrier. As the two men get into the car Walter is still smug. A large brilliant Persian rug lies beneath the Dude's beatup old furniture. At the table next to the answering machine the Dude is mixing kalhua rum and milk. A beep. It swings open to reveal a short hairy muscular but balding middleaged man in a black Tshirt and black cutoff jeans. The Dude takes a swig of his kalhua. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. We are pushing Brandt down the highceilinged hallway. Brandt talks back over his shoulder. Distantly we hear a dolorous soprano. He turns back around and the firelight shows teartracks on his cheeks. He clears his throat. Brandt hastily pulls a flimsy sheet from his clipboard and hands it to the Dude. Brandt tugs at the Dude's shirt and points him back to the hall. The soprano's singing is once again faint. Brandt's voice is hushed. We are looking across the length of the bowling alley at a tall thin Hispanic bowler displaying perfect form. He wears an allinone dacronpolyester stretch bowling outfit with a racing stripe down each side. CRASHscattered by a strike in slow motion. The Dude is staring off towards the bowler. We see Quintana in pressed jeans and a stretchy sweater walking up a stoop in a residential neighborhood and zinging the bell. The door swings open and a beerswilling middleaged man looks dully out at Quintana who looks hesitantly up. He slips a little black box out of his shirt pocket. Donny has been watching Quintana. They both look up. Quintana on his way out looks down at them from the lip of the lanes. He is holding a fancy blackandred leather ball satchel perhaps a Sylvia Wein. Behind him stands his partner. O'Brien a short fat Irishman with tufted red hair."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He wears black leather pants and a black leather jacket open shirtless exposing fine blond chest hair and pale skin. One arm trails off into the water. next to it an empty whiskey bottle bobs. Brandt releases a gale of forced laughter. Brandt nervously takes the Dude by the elbow. The Dude grudgingly allows himself to be led away still looking at the young woman. He continues to lead away the Dude who looks back over his shoulder. Scattered by a strike. Donny calls out from the bench. As the Dude walks back to the scoring table he turns to another team in black bowling shirtsthe Cavaliersthat shares the lane. He let us the small yapping dog out of the carrier. CRASHscattered by a strike in slow motion. The Dude is staring off towards the bowler. We see Quintana in pressed jeans and a stretchy sweater walking up a stoop in a residential neighborhood and zinging the bell. The door swings open and a beerswilling middleaged man looks dully out at Quintana who looks hesitantly up. He slips a little black box out of his shirt pocket. Donny has been watching Quintana. They both look up. Quintana on his way out looks down at them from the lip of the lanes. He is holding a fancy blackandred leather ball satchel perhaps a Sylvia Wein. Behind him stands his partner. O'Brien a short fat Irishman with tufted red hair."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He wears black leather pants and a black leather jacket open shirtless exposing fine blond chest hair and pale skin. One arm trails off into the water. next to it an empty whiskey bottle bobs. Brandt releases a gale of forced laughter. Brandt nervously takes the Dude by the elbow. Quintana on his way out looks down at them from the lip of the lanes. He is holding a fancy blackandred leather ball satchel perhaps a Sylvia Wein. Behind him stands his partner. O'Brien a short fat Irishman with tufted red hair."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "She dons purple silk trousers and a purple silk blazer, fastened, towel-clad, hiding coarse red arm tattoos and dark scales. One leg dangles into the pond; beside it, a full soda can floats. Angela unleashes a breeze of genuine applause. Angela anxiously grabs the Snail by the wingtip. The Snail willingly lets itself be dragged away, still gawking at the elderly penguin. She keeps dragging away the Snail, who peers back over its shell. Displaced by a gust. Benny chirps out from the hammock. As the Snail slides back to the tournament counter, it glances at another squad in white fishing vests--the Knights--that occupies the dock. She lets the tiny barking cat out of the suitcase. It scrambles around the fishing counter, sniffing at anglers and flicking its whiskers. Sparky spins away from his final toss to glance at Wilma. Wilma pulls out a lasso. Wilma and the Snail drift to the Snail's scooter. The Chihuahua prances contentedly behind Wilma who drags the filled suitcase. As the duo climbs onto the scooter, Wilma is still boastful. A massive, dull Persian tapestry stretches beneath the Snail's beaten-up ancient gadgets. At the shelf beside the fax machine the Snail is blending lemonade, soda, and tea. A clang. It flings wide to disclose a tall, smooth, feeble yet muscular teenage turtle in a white hoodie and white tailored slacks. The Snail gulps some of its lemonade. We are towing Angela along the low-ceilinged passageway. Angela murmurs forward over her arm. Faintly, we catch a melodious tenor. She spins forward and the moonlight shows dirt tracks on her arms. She coughs slightly. Angela quickly pulls a heavy cloth from her backpack and gives it to the Snail. Angela yanks at the Snail's trousers and directs it forward to the corridor. The tenor's melody is again muffled. Angela's tone is muted. We are peeking across the stretch of the fishing pier at a short, stocky, Asian sailor demonstrating flawed technique. He sports a two-piece wool-cashmere elastic fishing ensemble with a lightning bolt down each sleeve. BAM--displaced by a gust, in regular motion. The Snail is gazing off towards the sailor. We observe Ramirez, in crumpled shorts and a stiff parka, skipping up a ladder in a commercial district and bopping the gong. The portal flings wide and a soda-drinking teenage giraffe gazes blankly out at Ramirez, who peeks cautiously up. He draws a large red cube out of his jeans pocket. Benny has been observing Ramirez. They both gaze up. Ramirez, on his exit, peers down at them from the brim of the docks. He is clutching an ornate purple-and-orange velvet racket bag (possibly a Pablo Cruz). Behind him stands his comrade, Flannigan, a tall skinny Canadian with shaved green braids."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Brandt, dressed in black leather, nervously laughs and leads the Dude away from a young woman. The Dude joins his bowling team, the Cavaliers, where a small dog runs around. Smokey and Walter are there, with Walter smugly carrying a gun. As they reach the Dude's car, a Persian rug is seen under his furniture. The Dude mixes a drink while Brandt, in haste, communicates via clipboard and gestures. A distant soprano voice is heard. A Hispanic bowler shows perfect form, and the Dude watches. Quintana, in pressed jeans, rings a doorbell, met by a beer-drinking man. He retrieves a small black box, catching Donny's attention. Quintana departs with a leather ball satchel, accompanied by his partner, O'Brien."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "O'Brien a short fat Irishman with tufted red hair Behind him stands his partner He is holding a fancy blackandred leather ball satchel perhaps a Sylvia Wein Quintana on his way out looks down at them from the lip of the lanes They both look up Donny has been watching Quintana He slips a little black box out of his shirt pocket The door swings open and a beerswilling middleaged man looks dully out at Quintana who looks hesitantly up We see Quintana in pressed jeans and a stretchy sweater walking up a stoop in a residential neighborhood and zinging the bell The Dude is staring off towards the bowler CRASHscattered by a strike in slow motion He wears an allinone dacronpolyester stretch bowling outfit with a racing stripe down each side We are looking across the length of the bowling alley at a tall thin Hispanic bowler displaying perfect form Brandt's voice is hushed The soprano's singing is once again faint Brandt tugs at the Dude's shirt and points him back to the hall Brandt hastily pulls a flimsy sheet from his clipboard and hands it to the Dude He clears his throat He turns back around and the firelight shows teartracks on his cheeks Distantly we hear a dolorous soprano Brandt talks back over his shoulder We are pushing Brandt down the highceilinged hallway The Dude takes a swig of his kalhua It swings open to reveal a short hairy muscular but balding middleaged man in a black Tshirt and black cutoff jeans A beep At the table next to the answering machine the Dude is mixing kalhua rum and milk A large brilliant Persian rug lies beneath the Dude's beatup old furniture As the two men get into the car Walter is still smug The Pomeranian trots happily behind Walter who totes the empty carrier Walter and the Dude walk to the Dude's car Walter takes out a gun Smokey turns from his last roll to look at Walter It scoots around the bowling table sniffing at bowlers and wagging its tail He let us the small yapping dog out of the carrier As the Dude walks back to the scoring table he turns to another team in black bowling shirtsthe Cavaliersthat shares the lane Donny calls out from the bench Scattered by a strike He continues to lead away the Dude who looks back over his shoulder The Dude grudgingly allows himself to be led away still looking at the young woman Brandt nervously takes the Dude by the elbow Brandt releases a gale of forced laughter next to it an empty whiskey bottle bobs One arm trails off into the water He wears black leather pants and a black leather jacket open shirtless exposing fine blond chest hair and pale skin"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "One arm trails off into the water He wears black leather pants and a black leather jacket open shirtless exposing fine blond chest hair and pale skin Brandt releases a gale of forced laughter next to it an empty whiskey bottle bobs The Dude grudgingly allows himself to be led away still looking at the young woman Brandt nervously takes the Dude by the elbow Scattered by a strike He continues to lead away the Dude who looks back over his shoulder As the Dude walks back to the scoring table he turns to another team in black bowling shirtsthe Cavaliersthat shares the lane Donny calls out from the bench It scoots around the bowling table sniffing at bowlers and wagging its tail He let us the small yapping dog out of the carrier Walter takes out a gun Smokey turns from his last roll to look at Walter The Pomeranian trots happily behind Walter who totes the empty carrier Walter and the Dude walk to the Dude's car A large brilliant Persian rug lies beneath the Dude's beatup old furniture As the two men get into the car Walter is still smug A beep At the table next to the answering machine the Dude is mixing kalhua rum and milk The Dude takes a swig of his kalhua It swings open to reveal a short hairy muscular but balding middleaged man in a black Tshirt and black cutoff jeans Brandt talks back over his shoulder We are pushing Brandt down the highceilinged hallway He turns back around and the firelight shows teartracks on his cheeks Distantly we hear a dolorous soprano Brandt hastily pulls a flimsy sheet from his clipboard and hands it to the Dude He clears his throat The soprano's singing is once again faint Brandt tugs at the Dude's shirt and points him back to the hall We are looking across the length of the bowling alley at a tall thin Hispanic bowler displaying perfect form Brandt's voice is hushed CRASHscattered by a strike in slow motion He wears an allinone dacronpolyester stretch bowling outfit with a racing stripe down each side We see Quintana in pressed jeans and a stretchy sweater walking up a stoop in a residential neighborhood and zinging the bell The Dude is staring off towards the bowler He slips a little black box out of his shirt pocket The door swings open and a beerswilling middleaged man looks dully out at Quintana who looks hesitantly up They both look up Donny has been watching Quintana He is holding a fancy blackandred leather ball satchel perhaps a Sylvia Wein Quintana on his way out looks down at them from the lip of the lanes O'Brien a short fat Irishman with tufted red hair Behind him stands his partner"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "We are pushing Brandt down the highceilinged hallway Brandt talks back over his shoulder Distantly we hear a dolorous soprano He turns back around and the firelight shows teartracks on his cheeks He clears his throat Brandt hastily pulls a flimsy sheet from his clipboard and hands it to the Dude Brandt tugs at the Dude's shirt and points him back to the hall The soprano's singing is once again faint Brandt's voice is hushed We are looking across the length of the bowling alley at a tall thin Hispanic bowler displaying perfect form He wears an allinone dacronpolyester stretch bowling outfit with a racing stripe down each side CRASHscattered by a strike in slow motion The Dude is staring off towards the bowler We see Quintana in pressed jeans and a stretchy sweater walking up a stoop in a residential neighborhood and zinging the bell The door swings open and a beerswilling middleaged man looks dully out at Quintana who looks hesitantly up He slips a little black box out of his shirt pocket Donny has been watching Quintana They both look up Quintana on his way out looks down at them from the lip of the lanes He is holding a fancy blackandred leather ball satchel perhaps a Sylvia Wein Behind him stands his partner O'Brien a short fat Irishman with tufted red hair He wears black leather pants and a black leather jacket open shirtless exposing fine blond chest hair and pale skin One arm trails off into the water next to it an empty whiskey bottle bobs Brandt releases a gale of forced laughter Brandt nervously takes the Dude by the elbow The Dude grudgingly allows himself to be led away still looking at the young woman He continues to lead away the Dude who looks back over his shoulder Scattered by a strike Donny calls out from the bench As the Dude walks back to the scoring table he turns to another team in black bowling shirtsthe Cavaliersthat shares the lane He let us the small yapping dog out of the carrier It scoots around the bowling table sniffing at bowlers and wagging its tail Smokey turns from his last roll to look at Walter Walter takes out a gun Walter and the Dude walk to the Dude's car The Pomeranian trots happily behind Walter who totes the empty carrier As the two men get into the car Walter is still smug A large brilliant Persian rug lies beneath the Dude's beatup old furniture At the table next to the answering machine the Dude is mixing kalhua rum and milk A beep It swings open to reveal a short hairy muscular but balding middleaged man in a black Tshirt and black cutoff jeans The Dude takes a swig of his kalhua"
        }
      ]
    }
  ]
}