{
  "ground_truth": "SYLVIE GAUDET, a French woman in her early thirties, joins REGGIE and JEAN-LOUIS from the railing of the sun deck. JEAN-LOUIS scampers off, pleased with the situation. SYLVIE notices REGGIE's lunch of cold chicken, potato salad, rolls and butter, wine, and coffee, as REGGIE starts eating a chicken leg. SYLVIE observes the disarrayed table before following. They pass through a magnificent indoor pool area with ceiling-high windows showing snow-covered mountains, continuing their conversation. An open balcony surrounds the pool with sun-worshippers in deck chairs, and REGGIE and SYLVIE continue their conversation. SYLVIE stops, noticing a strange figure in a grotesque knitted mask covering the face except for the eyes, nose, and mouth. The camera pans down to include JEAN-LOUIS, held by the masked man, and also shows REGGIE and SYLVIE. SYLVIE assesses the situation, stands up, and she and JEAN-LOUIS start to leave, with JEAN-LOUIS squirting PETER with his pistol. The camera shows the Arc de Triomphe at the Avenue's end and pans to a taxi pulling up to a handsome building with REGGIE, SYLVIE, and JEAN-LOUIS inside. REGGIE exits, and the driver begins unloading her suitcases as JEAN-LOUIS sticks his head out the window, and REGGIE looks at SYLVIE, surprised. REGGIE walks toward the house with the driver carrying her cases and presses the button to open the front door. As the elevator rises, REGGIE exits, followed by the driver who places the bags in front of the apartment door and leaves. Sighing, REGGIE takes out her keys to unlock the door and enters the empty Salon, with camera following. The room is stripped bare, with patches of original wall color where paintings once hung, hooks still in place. She rushes to the bedroom, camera lurching behind her, finding it too empty. She hastily opens wardrobe closets revealing only hangers, and finds drawers empty as well. REGGIE is in near-shock. We see a large metal drawer being opened, revealing a familiar shape under a damp muslin sheet, as REGGIE, GRANDPIERRE, and an ATTENDANT look into the drawer. GRANDPIERRE lifts the sheet's corner, revealing a bare foot with a ticket tied to its big toe.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "SYLVIE GAUDET, a Gallic dame in her nascent thirties, unites with REGGIE and JEAN-LOUIS from the banister of the solarium. JEAN-LOUIS dashes away, delighted with the circumstance. SYLVIE perceives REGGIE's repast of chilled poultry, spud salad, buns and margarine, vino, and espresso, as REGGIE commences consuming a poultry limb. SYLVIE remarks the disordered table before trailing. They traverse through a splendid indoor swim area with ceiling-tall panes displaying snow-blanketed peaks, continuing their dialogue. An open veranda encircles the pool with sunbathers in deck recliners, and REGGIE and SYLVIE sustain their discourse. SYLVIE halts, distinguishing a peculiar figure in a bizarre crocheted hood masking the visage except for the optics, proboscis, and maw. The camera tilts downward to include JEAN-LOUIS, gripped by the hooded person, and also displays REGGIE and SYLVIE. SYLVIE evaluates the predicament, rises up, and she and JEAN-LOUIS commence to depart, with JEAN-LOUIS spraying PETER with his water gun. The camera displays the Arc de Triomphe at the Thoroughfare's terminus and sweeps to a cab pulling up to a stately structure with REGGIE, SYLVIE, and JEAN-LOUIS inside. REGGIE vacates, and the chauffeur starts offloading her luggage as JEAN-LOUIS pokes his cranium out the casement, and REGGIE gazes at SYLVIE, astounded. REGGIE strides toward the edifice with the chauffeur hauling her cases and presses the button to unseal the anterior portal. As the lift ascends, REGGIE departs, trailed by the chauffeur who places the parcels in front of the flat portal and leaves. Sighing, REGGIE extracts her keychain to unfasten the entrance and enters the vacant Lounge, with camera pursuing. The chamber is stripped empty, with traces of primal facade hue where artworks once dangled, fasteners still in situ. She dashes to the dormitory, camera staggering behind her, discovering it likewise vacant. She rapidly unlatches wardrobe armoires revealing solely racks, and finds drawers void as well. REGGIE is in near-daze. We observe a sizable metallic drawer being opened, unveiling a familiar silhouette beneath a moist muslin shroud, as REGGIE, GRANDPIERRE, and an ASSISTANT peer into the drawer. GRANDPIERRE raises the shroud's edge, unveiling a naked foot with a label attached to its large toe."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "SYLVIE GAUDET, a French woman in her early thirties, is joined by REGGIE and JEAN-LOUIS from the railing of the sun deck. The situation pleases JEAN-LOUIS, and he scampers off. REGGIE's lunch of cold chicken, potato salad, rolls and butter, wine, and coffee is noticed by SYLVIE, as a chicken leg is started on by REGGIE. The disarrayed table is observed by SYLVIE before she follows. A magnificent indoor pool area with ceiling-high windows showing snow-covered mountains is passed through by them as their conversation continues. An open balcony surrounds the pool with sun-worshippers in deck chairs, and their conversation is continued by REGGIE and SYLVIE. SYLVIE stops, and she notices a strange figure wearing a grotesque knitted mask that covers the face except for the eyes, nose, and mouth. The camera pans down to include JEAN-LOUIS, who is held by the masked man, and it also shows REGGIE and SYLVIE. The situation is assessed by SYLVIE, she stands up, and she and JEAN-LOUIS start to leave, with JEAN-LOUIS squirting PETER with his pistol. The Arc de Triomphe at the Avenue's end is shown by the camera, which pans to a taxi pulling up to a handsome building with REGGIE, SYLVIE, and JEAN-LOUIS inside. REGGIE exits, and her suitcases are begun to be unloaded by the driver as JEAN-LOUIS sticks his head out the window, and SYLVIE is looked at by REGGIE, surprised. REGGIE walks toward the house with the cases carried by the driver, and the button to open the front door is pressed by her. As the elevator rises, REGGIE exits, followed by the driver who places the bags in front of the apartment door and leaves. Sighing, her keys are taken out by REGGIE to unlock the door, and the empty Salon is entered by her, with camera following. The room is stripped bare, with patches of original wall color visible where paintings once hung, hooks still in place. The bedroom is rushed to by her, camera lurching behind her, finding it empty too. Wardrobe closets are hastily opened by her, revealing only hangers, and drawers are found empty as well. Near-shock is felt by REGGIE. A large metal drawer is opened, revealing a familiar shape under a damp muslin sheet, as the drawer is looked into by REGGIE, GRANDPIERRE, and an ATTENDANT. The sheet's corner is lifted by GRANDPIERRE, revealing a bare foot with a ticket tied to its big toe."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "SYLVIE GAUDET, a French woman in her early thirties, joins REGGIE and JEAN-LOUIS at the sun deck railing. JEAN-LOUIS departs happily. SYLVIE notices REGGIE's lunch of cold chicken, potato salad, rolls, butter, wine, and coffee as REGGIE begins eating. Observing the cluttered table, they move on through an indoor pool area with large windows showing snowy mountains, maintaining their conversation. A balcony surrounds the pool with sunbathers. SYLVIE stops, seeing a strange figure in a grotesque knitted mask, revealing only the eyes, nose, and mouth. The camera shows JEAN-LOUIS with the masked figure and REGGIE and SYLVIE. SYLVIE assesses the situation, and she and JEAN-LOUIS prepare to leave, with JEAN-LOUIS squirting PETER with a pistol. The camera shows the Arc de Triomphe, then a taxi arrives at a handsome building with REGGIE, SYLVIE, and JEAN-LOUIS. REGGIE exits, the driver unloads her bags, and JEAN-LOUIS peeks out the window as REGGIE looks at SYLVIE, surprised. REGGIE heads towards the building, the driver carries her luggage, and she opens the front door. As the elevator rises, she exits, and the driver places the bags at the apartment door, then leaves. REGGIE unlocks the door and discovers the empty Salon, followed by the camera. The room is bare, with patches of wall color where paintings once hung. She rushes to the bedroom, finding it empty, opening wardrobes to find only hangers and empty drawers. REGGIE is nearly in shock. A metal drawer opens, revealing a shape under a damp muslin sheet as REGGIE, GRANDPIERRE, and an ATTENDANT look in. GRANDPIERRE lifts the sheet, revealing a bare foot with a ticket tied to its big toe."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "SYLVIE GAUDET, a Frenchwoman in her early thirties, joins REGGIE and JEAN-LOUIS on the sun deck. JEAN-LOUIS, pleased, scampers off. SYLVIE observes REGGIE's lunch—chicken, potato salad, rolls, wine, and coffee—and a messy table. They pass through an indoor pool with sunbathers, conversing. SYLVIE stops at a masked figure holding JEAN-LOUIS. She assesses, then they leave, and JEAN-LOUIS squirts PETER. The camera shows the Arc de Triomphe, then a taxi arrives at a building with REGGIE, SYLVIE, and JEAN-LOUIS. REGGIE exits, surprised at SYLVIE, as the driver unloads luggage. REGGIE enters the building, the driver following with bags. Inside, she finds the now-empty Salon and bedroom. Opening drawers and closets reveals emptiness. REGGIE, shocked, sees a large drawer with a muslin-covered shape. As GRANDPIERRE lifts the sheet, a bare foot with a ticket is revealed."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "SYLVIE GAUDET, a French woman in her early thirties, makes her presence known by joining REGGIE and JEAN-LOUIS from her position at the railing of the sun deck. JEAN-LOUIS takes off, clearly pleased with how things have unfolded. SYLVIE takes note of REGGIE's lunch, which consists of a simple yet satisfying selection: cold chicken, potato salad, freshly baked rolls with creamy butter, accompanied by a fine wine and some coffee. As REGGIE begins to dig into a chicken leg, SYLVIE observes the somewhat chaotic state of the table before she decides to follow along. Together, they move through a luxurious indoor pool area, where ceiling-high windows offer an expansive view of the snow-covered mountains, visible in all their glory. They continue their conversation as they walk. Encircling the pool is an open balcony, occupied by sun-worshippers lounging in deck chairs, soaking up the sun's rays, while REGGIE and SYLVIE continue their engaging discussion.\n\nAs they proceed, SYLVIE suddenly halts, her attention drawn to a peculiar figure wearing a bizarre, knitted mask that grotesquely covers the entire face, leaving only the eyes, nose, and mouth exposed. The camera smoothly pans down to reveal JEAN-LOUIS, who is held by this masked individual, and also captures REGGIE and SYLVIE in the frame. SYLVIE assesses the situation with a sharp glance, and then she and JEAN-LOUIS begin to make their way out, with JEAN-LOUIS playfully squirting water at PETER using his toy pistol. The scene transitions to show a view of the iconic Arc de Triomphe looming at the end of the avenue, then shifts swiftly to a taxi arriving at a handsome, stately building, with REGGIE, SYLVIE, and JEAN-LOUIS seated inside. REGGIE steps out of the vehicle, and the driver diligently begins to unload her luggage. JEAN-LOUIS pops his head out of the window, while REGGIE looks back at SYLVIE, her expression one of surprise.\n\nREGGIE strides toward the house with purpose, the driver following closely behind, burdened with her suitcases. She reaches the front door and firmly presses the button to open it. As the elevator ascends, REGGIE steps out, with the driver trailing her, carefully placing the bags in front of the apartment door before departing. With a sigh, REGGIE retrieves her keys to unlock the door and steps into the Salon, the camera capturing her movements. The room presents a desolate sight, stripped of its former glory, with patches of the original wall color starkly visible where paintings once hung, the hooks left behind as silent witnesses. In a rush, she dashes to the bedroom, the camera jostling to keep up with her urgent pace, only to find it similarly vacant. She hurriedly opens the wardrobe closets, which reveal nothing but bare hangers, and discovers that the drawers are completely empty as well. REGGIE stands there, teetering on the brink of shock. Meanwhile, we are shown a close-up of a large metal drawer being opened, revealing a familiar shape concealed under a damp muslin sheet, as REGGIE, along with GRANDPIERRE and an ATTENDANT, peers into the drawer. GRANDPIERRE carefully lifts the corner of the sheet, unveiling a bare foot with a ticket tied gently to its big toe."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "SYLVIE GAUDET, who is a captivating French woman in the prime of her early thirties, makes her presence distinctly known. She does this by elegantly joining REGGIE and JEAN-LOUIS from her vantage point at the railing of the radiant sun deck. At this point, JEAN-LOUIS takes his leave, clearly quite delighted with the turn of events. SYLVIE, ever observant, takes note of REGGIE's lunch, which is a simple yet immensely satisfying selection. It includes cold chicken, a fresh and creamy potato salad, and rolls that have been freshly baked, accompanied with creamy butter. Alongside this is a fine wine and some freshly brewed coffee. As REGGIE begins to dig into a succulent chicken leg, SYLVIE observes the somewhat disordered state of the table before she opts to follow along. Together, they make their way through a luxurious indoor pool area. Here, ceiling-high windows provide an expansive and unobstructed view of the majestic, snow-covered mountains, visible in all their magnificent glory. They continue their engaging conversation as they walk. Surrounding the pool is an open balcony, which is occupied by sun-worshippers lounging in deck chairs, basking in the sun's warm, inviting rays, while REGGIE and SYLVIE continue their riveting discussion.\n\nAs they proceed, SYLVIE comes to an abrupt halt, her attention suddenly captured by a peculiar figure. This individual is wearing a bizarre, knitted mask that grotesquely envelops the entire face, leaving only the eyes, nose, and mouth exposed. The camera skillfully pans down to reveal JEAN-LOUIS, who is being held by this masked person, and also captures REGGIE and SYLVIE within the frame. SYLVIE assesses the situation with a sharp and discerning glance, after which she and JEAN-LOUIS begin to make their way out. JEAN-LOUIS, in a playful manner, squirts water at PETER using his toy pistol. The scene transitions fluidly to show a view of the iconic Arc de Triomphe looming majestically at the end of the avenue. The scene then shifts swiftly to a taxi arriving at a handsome and stately building, with REGGIE, SYLVIE, and JEAN-LOUIS seated comfortably inside. REGGIE steps out of the vehicle, and the driver diligently begins the task of unloading her luggage. JEAN-LOUIS pops his head out of the window, while REGGIE looks back at SYLVIE, her expression one of surprise and curiosity.\n\nREGGIE strides purposefully toward the house, with the driver closely following behind, burdened with her suitcases. She reaches the front door and firmly presses the button to open it. As the elevator ascends to her destination, REGGIE steps out, with the driver trailing her. He carefully places the bags in front of the apartment door before taking his leave. With a sigh of anticipation, REGGIE retrieves her keys to unlock the door and steps cautiously into the Salon, the camera capturing her every movement. The room presents a desolate sight, stripped of its former glory, with stark patches of the original wall color visible where paintings once hung, the hooks left behind as silent witnesses to what once was. In a rush, she dashes to the bedroom, the camera jostling to keep up with her urgent pace, only to find it similarly vacant and bare. She hurriedly swings open the wardrobe closets, only to reveal nothing but bare hangers, and she discovers that the drawers are completely devoid of contents as well. REGGIE stands there, teetering on the brink of shock and disbelief. Meanwhile, we are shown a close-up of a large metal drawer being solemnly opened, revealing a familiar shape concealed under a damp muslin sheet, as REGGIE, along with GRANDPIERRE and an ATTENDANT, peers into the drawer. GRANDPIERRE carefully lifts the corner of the sheet, unveiling a bare foot with a ticket gently tied to its big toe."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "SYLVIE GAUDET, a French woman in her early thirties, gracefully approaches the railing of the sun deck to join REGGIE and JEAN-LOUIS. As she arrives, JEAN-LOUIS, visibly pleased with the ambiance, scampers away to enjoy the moment elsewhere. SYLVIE takes a moment to observe the scene and notices REGGIE's neatly arranged lunch consisting of cold chicken, potato salad, rolls and butter, alongside a bottle of wine and a cup of coffee, which she observes while REGGIE begins to savor a chicken leg. Her gaze shifts over the somewhat disarrayed table, taking in the scene before deciding to follow along. They walk together, entering a magnificent indoor pool area where towering ceiling-high windows offer a breathtaking view of snow-covered mountains, while they continue their conversation seamlessly amidst the serene beauty. As the conversation flows, they stroll past sun-worshippers leisurely lounging on deck chairs surrounding the open balcony that encloses the pool. Suddenly, SYLVIE halts, her attention captured by a peculiar figure donning a grotesque knitted mask that conceals the face except for the eyes, nose, and mouth. The camera widens the view to reveal JEAN-LOUIS held by the masked man, capturing the full scope of the scene with REGGIE and SYLVIE present. SYLVIE quickly assesses the situation, stands with determination, and motions to leave with JEAN-LOUIS, who, in a playful act, squirts PETER with his toy pistol. The narrative shifts as the camera shows the iconic Arc de Triomphe at the Avenue's end, transitioning smoothly to a taxi arriving at an elegant building, with REGGIE, SYLVIE, and JEAN-LOUIS inside its comfort. The taxi comes to a stop, and REGGIE steps out with purpose while the driver diligently unloads her suitcases. JEAN-LOUIS, full of curiosity, pops his head out the window, while REGGIE, noticing something unexpected, casts a surprised glance at SYLVIE. With determination, REGGIE strides toward the house, accompanied by the driver carrying her luggage, and confidently presses the button that opens the front door. As the scene progresses, the elevator ascends smoothly, and upon its gentle stop, REGGIE steps out with the driver following closely behind, depositing the bags in front of the apartment door before departing. Alone now, REGGIE releases a weary sigh and retrieves her keys, unlocking the door and stepping into the eerily empty Salon, with the camera trailing her movements closely. Her eyes scan the room, noting its stripped state with only discolored patches on the walls where paintings once hung and solitary hooks still in place, evoking a sense of loss. In a rush of urgency, she dashes to the bedroom, with the camera lurching to keep up, only to find it similarly barren. With mounting anxiety, she flings open wardrobe closets, seeing only empty hangers, and discovers drawers completely devoid of belongings, her near-shock palpable. The scene shifts dramatically to a large metal drawer being opened, revealing a familiar outline beneath a damp muslin sheet, with REGGIE, GRANDPIERRE, and an ATTENDANT looking on with varying degrees of composure. In a moment charged with suspense, GRANDPIERRE delicately lifts the sheet's corner, uncovering a bare foot with a ticket tied to its big toe, leaving an indelible mark on their collective memory."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "SYLVIE GAUDET, a French woman in her early thirties, joins REGGIE and JEAN-LOUIS on the sun deck railing. JEAN-LOUIS leaves, satisfied, as SYLVIE notices REGGIE's lunch spread of cold chicken, potato salad, rolls and butter, wine, and coffee. REGGIE starts his meal while SYLVIE observes the untidy table. They proceed through an indoor pool area with impressive windows overlooking snow-covered mountains, engaging in conversation amid sunbathers on deck chairs. SYLVIE suddenly notices a strange figure in a grotesque mask covering the face, except for the eyes, nose, and mouth, and sees JEAN-LOUIS with the masked man. SYLVIE assesses the situation and decides to leave with JEAN-LOUIS, who squirts PETER with his pistol. The scene transitions to a view of the Arc de Triomphe, then to a taxi arriving at a handsome building with REGGIE, SYLVIE, and JEAN-LOUIS inside. REGGIE exits, surprised at SYLVIE, as the driver unloads her suitcases while JEAN-LOUIS looks out the window. REGGIE heads toward the house with the driver carrying her luggage, opens the front door, and enters. Riding the elevator, she exits with the driver, who places the bags at the apartment door and leaves. REGGIE sighs, unlocks the door, and enters the empty Salon. The stripped room shows patches of original wall color where paintings once hung. She rushes to the now-empty bedroom, flinging open wardrobe closets and drawers, finding only hangers and emptiness. In near shock, a large metal drawer is opened to reveal a familiar shape under a damp muslin sheet, which REGGIE, GRANDPIERRE, and an ATTENDANT examine as GRANDPIERRE lifts a corner to reveal a bare foot with a ticket tied to its big toe."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Sylvie Gaudet, a French woman in her early thirties originally from Paris, joins Reggie and Jean-Louis from the railing of the sun deck aboard an elegant ocean liner heading to the scenic coasts of Southern Europe. Jean-Louis, who loves the sea, scampers off, pleased with the situation. Sylvie notices Reggie's lunch of cold chicken, potato salad, freshly baked rolls and creamy butter, a bottle of vintage wine often savored on such voyages, and aromatic coffee, as Reggie starts eating a chicken leg. Sylvie observes the disarrayed table, reminiscent of a leisurely Mediterranean meal, before following. They pass through a magnificent indoor pool area with ceiling-high windows offering splendid views of the snow-covered Alps, continuing their conversation. An open balcony surrounds the pool with sun-worshippers in deck chairs, soaking up the rare winter sun, and Reggie and Sylvie continue their conversation. Sylvie stops, noticing a strange figure in a grotesque knitted mask, similar to those seen in avant-garde street performances, covering the face except for the eyes, nose, and mouth. The camera pans down to include Jean-Louis, now held by the masked man, and also shows Reggie and Sylvie. Sylvie assesses the situation, stands up, and she and Jean-Louis start to leave, with Jean-Louis cheekily squirting Peter, a known prankster, with his toy pistol. The camera shows the iconic Arc de Triomphe at the Avenue des Champs-Élysées' end and pans to a taxi pulling up to a handsome Haussmann-style building with Reggie, Sylvie, and Jean-Louis inside. Reggie exits, and the driver begins unloading her suitcases as Jean-Louis sticks his head out the window, while Reggie looks at Sylvie, surprised by her silent composure. Reggie walks toward the grand entrance of the house with the driver carrying her cases and presses the button to open the ornate front door. As the old-fashioned elevator rises with a slight creak, Reggie exits, followed by the driver who places the bags in front of the apartment door and leaves. Sighing, Reggie takes out her keys to unlock the door and enters the once opulent Salon, with camera following. The room is stripped bare, with patches of original wall color where priceless paintings, likely from the Impressionist era, once hung, hooks still in place. She rushes to the bedroom, camera lurching behind her, finding it too empty. She hastily opens wardrobe closets revealing only hangers, and finds drawers empty as well. Reggie is in near-shock. We see a large metal drawer being opened, revealing a familiar shape under a damp muslin sheet, as Reggie, Inspector Grandpierre known for his thoroughness, and an attendant look into the drawer. Grandpierre lifts the sheet's corner, revealing a bare foot with a morgue ticket tied to its big toe."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "SYLVIE GAUDET a French woman in her early thirties joins REGGIE and JEANLOUIS from the railing of the sun deck. JEANLOUIS scampers off pleased with the situation. SYLVIE notices REGGIE's lunch of cold chicken potato salad rolls and butter wine and coffee as REGGIE starts eating a chicken leg. SYLVIE observes the disarrayed table before following. They pass through a magnificent indoor pool area with ceilinghigh windows showing snowcovered mountains continuing their conversation. An open balcony surrounds the pool with sunworshippers in deck chairs and REGGIE and SYLVIE continue their conversation. SYLVIE stops noticing a strange figure in a grotesque knitted mask covering the face except for the eyes nose and mouth. The camera pans down to include JEANLOUIS held by the masked man and also shows REGGIE and SYLVIE. SYLVIE assesses the situation stands up and she and JEANLOUIS start to leave with JEANLOUIS squirting PETER with his pistol. The camera shows the Arc de Triomphe at the Avenue's end and pans to a taxi pulling up to a handsome building with REGGIE. SYLVIE and JEANLOUIS inside. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. REGGIE exits and the driver begins unloading her suitcases. as JEANLOUIS sticks his head out the window and REGGIE looks at SYLVIE surprised. REGGIE walks toward the house with the driver carrying her cases and presses the button to open the front door. As the elevator rises REGGIE exits followed by the driver who places the bags in front of the apartment door and leaves Sighing. REGGIE takes out her keys to unlock the door and enters the empty Salon with camera following. The room is stripped bare with patches of original wall color where paintings once hung hooks still in place. She rushes to the bedroom camera lurching behind her finding it too empty. She hastily opens wardrobe closets revealing only hangers and finds drawers empty as well. REGGIE is in nearshock. We see a large metal drawer being opened revealing a familiar shape under a damp muslin sheet. as REGGIE GRANDPIERRE and an ATTENDANT look into the drawer. GRANDPIERRE lifts the sheet's corner revealing a bare foot with a ticket tied to its big toe."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "SYLVIE GAUDET a French woman in her early thirties joins REGGIE and JEANLOUIS from the railing of the sun deck. JEANLOUIS scampers off pleased with the situation. SYLVIE notices REGGIE's lunch of cold chicken potato salad rolls and butter wine and coffee as REGGIE starts eating a chicken leg. SYLVIE observes the disarrayed table before following. They pass through a magnificent indoor pool area with ceilinghigh windows showing snowcovered mountains continuing their conversation. An open balcony surrounds the pool with sunworshippers in deck chairs and REGGIE and SYLVIE continue their conversation. SYLVIE stops noticing a strange figure in a grotesque knitted mask covering the face except for the eyes nose and mouth. The camera pans down to include JEANLOUIS held by the masked man and also shows REGGIE and SYLVIE. SYLVIE assesses the situation stands up and she and JEANLOUIS start to leave with JEANLOUIS squirting PETER with his pistol. The camera shows the Arc de Triomphe at the Avenue's end and pans to a taxi pulling up to a handsome building with REGGIE. SYLVIE and JEANLOUIS inside. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. REGGIE exits and the driver begins unloading her suitcases. as JEANLOUIS sticks his head out the window and REGGIE looks at SYLVIE surprised. REGGIE walks toward the house with the driver carrying her cases and presses the button to open the front door. As the elevator rises REGGIE exits followed by the driver who places the bags in front of the apartment door and leaves Sighing. REGGIE takes out her keys to unlock the door and enters the empty Salon with camera following. The room is stripped bare with patches of original wall color where paintings once hung hooks still in place. She rushes to the bedroom camera lurching behind her finding it too empty. She hastily opens wardrobe closets revealing only hangers and finds drawers empty as well. REGGIE is in nearshock. We see a large metal drawer being opened revealing a familiar shape under a damp muslin sheet. as REGGIE GRANDPIERRE and an ATTENDANT look into the drawer. GRANDPIERRE lifts the sheet's corner revealing a bare foot with a ticket tied to its big toe."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "SYLVIE GAUDET a French woman in her early thirties joins REGGIE and JEANLOUIS from the railing of the sun deck. JEANLOUIS scampers off pleased with the situation. SYLVIE notices REGGIE's lunch of cold chicken potato salad rolls and butter wine and coffee as REGGIE starts eating a chicken leg. SYLVIE observes the disarrayed table before following. They pass through a magnificent indoor pool area with ceilinghigh windows showing snowcovered mountains continuing their conversation. An open balcony surrounds the pool with sunworshippers in deck chairs and REGGIE and SYLVIE continue their conversation. She rushes to the bedroom camera lurching behind her finding it too empty. She hastily opens wardrobe closets revealing only hangers and finds drawers empty as well. REGGIE is in nearshock. We see a large metal drawer being opened revealing a familiar shape under a damp muslin sheet. as REGGIE GRANDPIERRE and an ATTENDANT look into the drawer. GRANDPIERRE lifts the sheet's corner revealing a bare foot with a ticket tied to its big toe."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "SYLVIE GAUDET a French woman in her early thirties joins REGGIE and JEANLOUIS from the railing of the sun deck. JEANLOUIS scampers off pleased with the situation. We see a large metal drawer being opened revealing a familiar shape under a damp muslin sheet. as REGGIE GRANDPIERRE and an ATTENDANT look into the drawer. GRANDPIERRE lifts the sheet's corner revealing a bare foot with a ticket tied to its big toe."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "CHIPPER BAKER, an Australian adventurer in his late forties, approaches MANDY and GLENN from the edge of the moonlit pier. GLENN gallops off, thrilled with the encounter. CHIPPER detects MANDY's breakfast of hot pasta, fruit salad, muffins and honey, juice, and tea, as MANDY begins slicing a kiwi. CHIPPER inspects the cluttered counter before trailing. They navigate through an expansive greenhouse with floor-to-ceiling panes displaying flower-filled meadows, maintaining their dialogue. A grand terrace encircles the garden with bird-watchers in hammocks, and MANDY and CHIPPER maintain their dialogue. CHIPPER pauses, observing an eerie silhouette in a bizarre crocheted hat revealing only the ears, chin, and forehead. The shot zooms down to enclose GLENN, embraced by the hatted figure, and also captures MANDY and CHIPPER. CHIPPER evaluates the predicament, rises, and she and GLENN decide to depart, with GLENN spraying NANCY with his water gun. The lens showcases the Eiffel Tower at the Blvd's terminus and shifts to a limousine halting at a quaint cottage with MANDY, CHIPPER, and GLENN aboard. MANDY steps out, and the chauffeur commences removing her backpacks as GLENN leans his nose out the window, and MANDY glances at CHIPPER, astonished. MANDY ambles toward the cabin with the chauffeur hauling her packs and taps the latch to unlock the main gate. As the escalator ascends, MANDY departs, tailed by the chauffeur who places the luggage at the flat's entrance and departs. Groaning, MANDY retrieves her password to secure the entrance and steps into the deserted Lounge, with camera trailing. The chamber is emptied bare, with patches of original ceiling shade where drapery once dangled, nails still present. She hurries to the kitchen, lens stumbling behind her, identifying it equally bare. She quickly opens pantry doors revealing only tins, and finds shelves empty as well. MANDY is in near-bewilderment. We view a large wooden crate being pried open, unveiling a recognizable silhouette beneath a dry burlap blanket, as MANDY, WHITAKER, and a GUIDE gaze into the crate. WHITAKER lifts the blanket's edge, uncovering a bare hand with a label attached to its wrist."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "SYLVIE GAUDET, a French woman in her thirties, joins REGGIE and JEAN-LOUIS on a sun deck. SYLVIE notices REGGIE's lunch and they pass through an indoor pool area with snow-covered mountain views, continuing their conversation. SYLVIE stops when she sees a masked figure holding JEAN-LOUIS, who squirts PETER with a pistol. The camera shifts to the Arc de Triomphe and a taxi arriving at a building with REGGIE, SYLVIE, and JEAN-LOUIS. REGGIE exits, surprised as she looks at SYLVIE. The driver carries her luggage while she enters the building. In her apartment, REGGIE finds stripped walls and empty drawers, near-shocked at the emptiness. The scene shifts to a large metal drawer being opened, revealing a bare foot with a ticket tied to its toe as REGGIE, GRANDPIERRE, and an ATTENDANT look on."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "GRANDPIERRE lifts the sheet's corner revealing a bare foot with a ticket tied to its big toe as REGGIE GRANDPIERRE and an ATTENDANT look into the drawer We see a large metal drawer being opened revealing a familiar shape under a damp muslin sheet REGGIE is in nearshock She hastily opens wardrobe closets revealing only hangers and finds drawers empty as well She rushes to the bedroom camera lurching behind her finding it too empty The room is stripped bare with patches of original wall color where paintings once hung hooks still in place REGGIE takes out her keys to unlock the door and enters the empty Salon with camera following As the elevator rises REGGIE exits followed by the driver who places the bags in front of the apartment door and leaves Sighing REGGIE walks toward the house with the driver carrying her cases and presses the button to open the front door as JEANLOUIS sticks his head out the window and REGGIE looks at SYLVIE surprised REGGIE exits and the driver begins unloading her suitcases SYLVIE and JEANLOUIS inside The camera shows the Arc de Triomphe at the Avenue's end and pans to a taxi pulling up to a handsome building with REGGIE SYLVIE assesses the situation stands up and she and JEANLOUIS start to leave with JEANLOUIS squirting PETER with his pistol The camera pans down to include JEANLOUIS held by the masked man and also shows REGGIE and SYLVIE SYLVIE stops noticing a strange figure in a grotesque knitted mask covering the face except for the eyes nose and mouth An open balcony surrounds the pool with sunworshippers in deck chairs and REGGIE and SYLVIE continue their conversation They pass through a magnificent indoor pool area with ceilinghigh windows showing snowcovered mountains continuing their conversation SYLVIE observes the disarrayed table before following SYLVIE notices REGGIE's lunch of cold chicken potato salad rolls and butter wine and coffee as REGGIE starts eating a chicken leg JEANLOUIS scampers off pleased with the situation SYLVIE GAUDET a French woman in her early thirties joins REGGIE and JEANLOUIS from the railing of the sun deck"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "JEANLOUIS scampers off pleased with the situation SYLVIE GAUDET a French woman in her early thirties joins REGGIE and JEANLOUIS from the railing of the sun deck SYLVIE observes the disarrayed table before following SYLVIE notices REGGIE's lunch of cold chicken potato salad rolls and butter wine and coffee as REGGIE starts eating a chicken leg An open balcony surrounds the pool with sunworshippers in deck chairs and REGGIE and SYLVIE continue their conversation They pass through a magnificent indoor pool area with ceilinghigh windows showing snowcovered mountains continuing their conversation The camera pans down to include JEANLOUIS held by the masked man and also shows REGGIE and SYLVIE SYLVIE stops noticing a strange figure in a grotesque knitted mask covering the face except for the eyes nose and mouth The camera shows the Arc de Triomphe at the Avenue's end and pans to a taxi pulling up to a handsome building with REGGIE SYLVIE assesses the situation stands up and she and JEANLOUIS start to leave with JEANLOUIS squirting PETER with his pistol REGGIE exits and the driver begins unloading her suitcases SYLVIE and JEANLOUIS inside REGGIE walks toward the house with the driver carrying her cases and presses the button to open the front door as JEANLOUIS sticks his head out the window and REGGIE looks at SYLVIE surprised REGGIE takes out her keys to unlock the door and enters the empty Salon with camera following As the elevator rises REGGIE exits followed by the driver who places the bags in front of the apartment door and leaves Sighing She rushes to the bedroom camera lurching behind her finding it too empty The room is stripped bare with patches of original wall color where paintings once hung hooks still in place REGGIE is in nearshock She hastily opens wardrobe closets revealing only hangers and finds drawers empty as well as REGGIE GRANDPIERRE and an ATTENDANT look into the drawer We see a large metal drawer being opened revealing a familiar shape under a damp muslin sheet GRANDPIERRE lifts the sheet's corner revealing a bare foot with a ticket tied to its big toe"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "as JEANLOUIS sticks his head out the window and REGGIE looks at SYLVIE surprised REGGIE walks toward the house with the driver carrying her cases and presses the button to open the front door As the elevator rises REGGIE exits followed by the driver who places the bags in front of the apartment door and leaves Sighing REGGIE takes out her keys to unlock the door and enters the empty Salon with camera following The room is stripped bare with patches of original wall color where paintings once hung hooks still in place She rushes to the bedroom camera lurching behind her finding it too empty She hastily opens wardrobe closets revealing only hangers and finds drawers empty as well REGGIE is in nearshock We see a large metal drawer being opened revealing a familiar shape under a damp muslin sheet as REGGIE GRANDPIERRE and an ATTENDANT look into the drawer GRANDPIERRE lifts the sheet's corner revealing a bare foot with a ticket tied to its big toe SYLVIE GAUDET a French woman in her early thirties joins REGGIE and JEANLOUIS from the railing of the sun deck JEANLOUIS scampers off pleased with the situation SYLVIE notices REGGIE's lunch of cold chicken potato salad rolls and butter wine and coffee as REGGIE starts eating a chicken leg SYLVIE observes the disarrayed table before following They pass through a magnificent indoor pool area with ceilinghigh windows showing snowcovered mountains continuing their conversation An open balcony surrounds the pool with sunworshippers in deck chairs and REGGIE and SYLVIE continue their conversation SYLVIE stops noticing a strange figure in a grotesque knitted mask covering the face except for the eyes nose and mouth The camera pans down to include JEANLOUIS held by the masked man and also shows REGGIE and SYLVIE SYLVIE assesses the situation stands up and she and JEANLOUIS start to leave with JEANLOUIS squirting PETER with his pistol The camera shows the Arc de Triomphe at the Avenue's end and pans to a taxi pulling up to a handsome building with REGGIE SYLVIE and JEANLOUIS inside REGGIE exits and the driver begins unloading her suitcases"
        }
      ]
    }
  ]
}