{
  "ground_truth": "The Dude is slumped disconsolately back in his easy chair, with two uniformed policemen, one middle-aged and the other a fresh-faced rookie, facing him on the couch. In his lap, a portable phone is chirping, and The Dude waits for the rings to end. The scene shifts to a loft where a huge unfinished canvas, lit by standing industrial lights, dominates one wall. The Dude stands in the middle of the loft, looking into the murky depths of the cavernous space, and turns as he hears running footsteps. Something huge and white hurtles towards his head, causing him to duck and spin as it roars overhead. A naked woman in a sling suspended from a ceiling track rumbles over a canvas on the floor, flicking paint down with a paint bucket and brush. Two young men in paint-spattered shorts, T-shirts, and sneakers haul the sling back for another push. The furnishings are spare, with The Dude's brilliant rug on the floor. The woman aims a remote at a projection TV, and the screen flickers to life, showing a sallow-faced man in blue coveralls, Dieter, the floater in Lebowski's pool. The Dude is at the bar, a bottle of Kahlua frozen halfway to his glass, sitting in the back holding a White Russian and listening to the chauffeur, a man of about the same age with a ponytail emerging from his livery cap. He takes a sip of his freshly-mixed White Russian, leaving milk on his mustache, and mentions feeling really shitty earlier, having lost a little money and being down in the dumps. The limo rolls to a stop, and The Dude gets out, still holding his drink. Watching the rearview mirror, Tony jerks a thumb over his shoulder, prompting The Dude to turn and scowl as he sees a Volkswagen bug halfway up the block, with a fat man's shape in the driver's seat. The Dude is then grabbed from behind and muscled away in a half-nelson by another uniformed chauffeur. As he is frog-marched towards another limo, The Dude holds his drink away from his chest and cups a hand underneath. The waiting limo's back door is flung open, and The Dude is shoved inside, awkwardly taking a seat facing the rear. Brandt sits catty-corner from The Dude, and directly across from him is the big Lebowski, a comforter across his knees.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The Dude is slouched gloomily back in his recliner, with two uniformed officers, one middle-aged and the other a fresh-faced novice, confronting him on the sofa. In his lap, a mobile telephone is trilling, and The Dude waits for the rings to cease. The scene transitions to a loft where a gigantic unfinished canvas, illuminated by standing industrial lamps, dominates one wall. The Dude stands in the middle of the loft, observing the murky depths of the cavernous area, and swivels as he hears running footsteps. Something gigantic and white hurtles towards his head, causing him to dodge and spin as it roars above. A nude woman in a sling suspended from a ceiling track glides over a canvas on the floor, flicking paint down with a paint container and brush. Two young men in paint-splattered shorts, T-shirts, and sneakers haul the sling back for another thrust. The furnishings are minimal, with The Dude's radiant rug on the floor. The woman aims a remote at a projection TV, and the screen flickers to life, displaying a sallow-faced man in blue overalls, Dieter, the floater in Lebowski's pool. The Dude is at the bar, a bottle of Kahlua frozen halfway to his glass, sitting in the back holding a White Russian and listening to the driver, a man of about the same age with a ponytail emerging from his livery cap. He takes a sip of his freshly-mixed White Russian, leaving milk on his mustache, and mentions feeling really lousy earlier, having lost a little money and being down in the dumps. The limo rolls to a halt, and The Dude exits, still holding his beverage. Watching the rearview mirror, Tony jerks a thumb over his shoulder, prompting The Dude to turn and scowl as he sees a Volkswagen bug halfway up the block, with a fat man's silhouette in the driver's seat. The Dude is then grabbed from behind and muscled away in a half-nelson by another uniformed driver. As he is frog-marched towards another limo, The Dude holds his drink away from his torso and cups a hand beneath. The waiting limo's rear door is flung open, and The Dude is shoved inside, awkwardly settling into a seat facing the rear. Brandt sits diagonally from The Dude, and directly across from him is the big Lebowski, a blanket across his knees."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The Dude is slumped disconsolately back in his easy chair, with two uniformed policemen, one middle-aged and the other a fresh-faced rookie, sitting on the couch facing him. In his lap, a portable phone chirps, and The Dude waits for the rings to end. The scene shifts to a loft where one wall is dominated by a huge unfinished canvas, lit by standing industrial lights. The Dude stands in the middle of the loft, looking into the murky depths of the cavernous space, and turns as he hears running footsteps. Something huge and white is hurled towards his head, causing him to duck and spin as it roars overhead. A naked woman in a sling is suspended from a ceiling track and rumbles over a canvas on the floor, flicking paint down with a paint bucket and brush. Two young men in paint-spattered shorts, T-shirts, and sneakers push the sling back for another haul. The furnishings are spare, with The Dude's brilliant rug on the floor. The woman aims a remote at a projection TV, and the screen flickers to life, showing a sallow-faced man in blue coveralls, Dieter, floating in Lebowski's pool. The Dude sits at the bar, a bottle of Kahlua frozen halfway to his glass, sitting in the back holding a White Russian and listens to the chauffeur, a man of about the same age with a ponytail emerging from his livery cap. He takes a sip of his freshly-mixed White Russian, leaving milk on his mustache, and mentions feeling really shitty earlier, having lost a little money and being down in the dumps. The limo is stopped, and The Dude gets out, still holding his drink. Watching the rearview mirror, Tony jerks a thumb over his shoulder, prompting The Dude to turn and scowl as he sees a Volkswagen bug halfway up the block, with a fat man's shape in the driver's seat. The Dude is then grabbed from behind and muscled away in a half-nelson by another uniformed chauffeur. As a half-nelson is used on him, The Dude holds his drink away from his chest and cups a hand underneath while being frog-marched towards another limo. The waiting limo's back door is flung open, and The Dude awkwardly takes a seat facing the rear after being shoved inside. Brandt sits catty-corner from The Dude, and the big Lebowski sits directly across from him, with a comforter across his knees."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The Dude slouches in his chair, with two uniformed policemen—a middle-aged officer and a rookie—opposite him. A portable phone chirps in his lap as he waits for it to stop ringing. The scene shifts to a loft dominated by a large unfinished canvas, lit by industrial lights. In the dim space, The Dude turns at the sound of running footsteps. A huge white object whizzes past his head, making him duck. A naked woman in a ceiling-tracked sling rolls over a floor canvas, flicking paint with a bucket and brush, while two young men in paint-smeared attire pull the sling back. The minimal furnishings include The Dude's brilliant rug. The woman uses a remote to display Dieter, the floater from Lebowski's pool, on a projection TV. The Dude is at the bar, Kahlua bottle paused mid-pour, sipping a White Russian while listening to a ponytailed chauffeur. He mentions earlier feeling terrible, losing some money, and being down. The limo stops, and The Dude exits with his drink. Tony gestures to a Volkswagen bug with a hefty driver, prompting The Dude to scowl. Another chauffeur restrains him from behind, leading him to another limo while he carefully holds his drink. The limo's back door opens, The Dude is pushed inside, sitting awkwardly facing Brandt and the big Lebowski, who has a comforter over his knees."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The Dude slumps in his chair, facing two policemen on the couch, with a ringing phone in his lap. The scene shifts to a loft dominated by an unfinished canvas lit by industrial lights. The Dude, in the loft, ducks as a white object roars overhead. A naked woman in a sling flicks paint from above while two men in paint-spattered clothes pull the sling back. Sparse furnishings include The Dude's brilliant rug. The woman activates a TV, revealing Dieter, a pool floater. The Dude, holding a White Russian, listens to a ponytailed chauffeur, mentioning feeling down and losing money. The limo stops, and The Dude, drink in hand, exits, noticing a Volkswagen with a fat man. He's grabbed by another chauffeur and marched to a limo, protecting his drink. The limo door opens, and The Dude awkwardly sits, facing Brandt and the big Lebowski."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The Dude, feeling dejected and utterly disheartened, is reclined back in his easy chair, his posture conveying a sense of resigned despondency. Located directly opposite him on the couch are two uniformed policemen. One is of middle age, experienced and perhaps a bit weary from years on the force, while the other is a youthful, fresh-faced rookie, eager and perhaps a bit nervous. In The Dude’s lap, a portable phone is persistently chirping away, yet he simply sits there, waiting and allowing the rings to eventually silence themselves. \n\nThe scene undergoes a transformation, shifting to a spacious loft. This expansive area is dominated by a massive, unfinished canvas that commands attention, illuminated by standing industrial lights casting stark shadows on the walls. The Dude finds himself standing in the very center of this vast loft, gazing thoughtfully into the shadowy recesses of the cavernous space. Suddenly, he hears the sound of hurried running footsteps and turns just in time. Something enormous and brilliantly white comes hurtling towards his head, forcing him to duck swiftly and spin around as it comes roaring overhead.\n\nA naked woman is suspended from a ceiling track in a sling and she rumbles across the room over a canvas spread out on the floor below her. With a paint bucket and brush in hand, she flicks paint down with controlled precision. Assisting in this unconventional painting endeavor are two young men clad in paint-splattered shorts, T-shirts, and sneakers. They energetically haul the sling back, readying it for another launch. The loft’s furnishings are minimalistic and sparse, with a single brilliant rug belonging to The Dude displayed prominently on the floor.\n\nThe woman directs a remote towards a projection TV, and the screen suddenly bursts to life, revealing a sallow-faced man dressed in blue coveralls. This man is Dieter, the unfortunate floater in Lebowski's pool. Meanwhile, The Dude finds himself at the bar, a bottle of Kahlua frozen midway in its journey to his glass. He sits back, a White Russian in his hand, intently listening to the chauffeur, a man of similar age with a distinctive ponytail extending from under his livery cap. As The Dude takes a sip from his freshly-mixed White Russian, milk leaves a mark on his mustache. He then mentions to the chauffeur how earlier he had been feeling exceptionally lousy, having lost some money, which left him in a particularly downcast mood.\n\nThe limousine gradually rolls to a halt, and The Dude exits, still firmly gripping his drink in hand. Observing the scene unfold in the rearview mirror, Tony jerks his thumb over his shoulder, prompting The Dude to turn around. He scowls upon seeing a Volkswagen bug parked halfway up the block, with the shape of a corpulent man visible in the driver’s seat. At that moment, The Dude is unexpectedly seized from behind and forcefully maneuvered away in a half-nelson by another uniformed chauffeur. As he is frog-marched towards a different limo, The Dude carefully holds his drink at arm's length to avoid spilling it on himself, all the while cupping a hand underneath for added protection.\n\nThe back door of the waiting limo swings open, and The Dude is unceremoniously shoved inside. He awkwardly takes a seat, positioned to face the rear of the limo. Brandt is seated catty-corner from him, and positioned directly across from The Dude is the big Lebowski himself, with a comforter casually draped across his knees."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The Dude, burdened by a profound sense of dejection and feeling utterly disheartened, is reclined back lazily in his comfortable easy chair, his slumped posture conveying an unmistakable sense of resigned despondency. Situated directly opposite him on the couch are two policemen dressed in their respective uniforms. One officer is of middle age, displaying the seasoned experience and perhaps a touch of weariness that often accompanies many years spent on the force, while the other officer is a youthful, fresh-faced rookie, exhibiting an eager disposition mixed with a hint of nervousness. Resting in The Dude’s lap, a portable phone is persistently chirping away with monotonous rings, yet he simply stays still, sitting there, waiting and indifferent, permitting the rings to eventually silence themselves.\n\nThe scene undergoes a transformation, seamlessly shifting to a spacious loft. This expansive area is dominated by a massive, unfinished canvas that stands out prominently, commanding attention, and is illuminated by standing industrial lights that cast stark, angular shadows on the surrounding walls. The Dude finds himself standing right in the very center of this vast loft, gazing thoughtfully into the shadowy recesses of the cavernous space. Suddenly, his focus is interrupted by the sound of hurried running footsteps, prompting him to turn just in time. Something enormous and brilliantly white comes hurtling towards his head with great speed, forcing him to duck swiftly and spin around to evade it as it comes roaring overhead.\n\nSuspended from a ceiling track in a sling is a naked woman, and she rumbles across the room over a canvas that has been spread out on the floor below her. Clutching a paint bucket and brush in hand, she flicks paint downwards with controlled yet precise precision. Assisting her in this unconventional painting endeavor are two young men clad in paint-splattered shorts, T-shirts, and sneakers. They energetically haul the sling back, prepping it for yet another imaginative launch. The loft’s furnishings are minimalistic and sparse, with a single brilliant rug, belonging to The Dude, prominently displayed on the floor.\n\nThe woman directs a remote towards a projection TV, and the screen suddenly bursts to life, revealing a sallow-faced man dressed in blue coveralls. This man is Dieter, the unfortunate floater who was previously seen in Lebowski's pool. Meanwhile, The Dude finds himself comfortably situated at the bar, holding a bottle of Kahlua that is frozen midway in its journey to his glass. He sits back, a freshly-mixed White Russian in his hand, intently focusing on the chauffeur, a man of similar age who sports a distinctive ponytail that extends from beneath his livery cap. As The Dude takes a leisurely sip from his drink, a White Russian, milk leaves a conspicuous mark on his mustache. He then mentions to the chauffeur how, earlier, he had been feeling exceptionally lousy and low-spirited, having lost some money, which left him in a particularly downcast mood.\n\nThe limousine gradually rolls to a halt, and The Dude exits, still firmly gripping his drink in his hand. Observing the scene unfold in the rearview mirror, Tony, the driver, jerks his thumb over his shoulder, prompting The Dude to turn around. He scowls upon observing a Volkswagen bug parked conspicuously halfway up the block, with the shadowy shape of a corpulent man visible in the driver’s seat. At that precise moment, The Dude is unexpectedly seized from behind and forcefully maneuvered away in a half-nelson by another uniformed chauffeur. As he is frog-marched towards a different limo, The Dude carefully holds his drink at arm's length to avoid spilling it on himself, all the while cupping a hand underneath for added protection.\n\nThe back door of the waiting limo swings open, and The Dude is unceremoniously shoved inside with little regard for his comfort. He awkwardly takes a seat, positioned to face the rear of the luxurious limo. Brandt is seated catty-corner from him, and positioned directly across from The Dude is the big Lebowski himself, with a comforter casually draped across his knees, exuding an air of authority and control."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The Dude is slumped disconsolately back in his easy chair, visibly downcast, as he sits idly with an air of resignation. Two uniformed policemen sit facing him on the couch, one showing the lines and wisdom of middle age, while the other, fresh-faced and youthful, seems to be taking in the scene with eager alertness. The portable phone in The Dude's lap chirps persistently, an unwelcome intrusion, and he remains still, waiting for the rings to finally come to an end. The scene then transitions to a spacious loft where an enormous unfinished canvas commands attention, bathed in the stark glow of standing industrial lights. The Dude stands rooted in the center of the loft, his eyes scanning the shadowy expanse of the cavernous room. Suddenly, his attention is diverted by the sound of rapid footsteps approaching. In an instant, something large and white barrels toward him, prompting him to duck instinctively and spin around as it whooshes overhead with a roar. A naked woman, suspended from a ceiling track in a sling, glides over a canvas sprawled on the floor, deftly flicking paint with a bucket and brush in hand. Nearby, two young men, dressed casually in paint-spattered shorts, T-shirts, and sneakers, pull the sling back with effort for another push. The furnishings in the loft are minimal, with The Dude's vibrant rug adding a splash of color on the floor. The woman then aims a remote at a projection TV, activating the screen, which flickers to life to reveal the sallow-faced man in blue coveralls, Dieter, who floats lifelessly in Lebowski's pool. The Dude stands at the bar, a bottle of Kahlua frozen in mid-air as he prepares to pour it into his glass, sitting comfortably in the back with a White Russian in hand. He listens intently to the chauffeur beside him, a man of similar age with a ponytail peeking from beneath his livery cap. Taking a sip of the freshly-mixed White Russian, The Dude leaves a trace of milk on his mustache and candidly shares that he's been feeling really shitty, having lost some money and being weighed down by a general sense of malaise. As the limo rolls to a halt, The Dude disembarks, still nursing his drink cautiously. He peers into the rearview mirror as Tony, the driver, jerks a thumb over his shoulder. Following the gesture, The Dude turns to see a scowl forming as his eyes land on a Volkswagen bug parked halfway up the block, the silhouette of a hefty man occupying the driver's seat. Suddenly, he is seized from behind, his body forced into a half-nelson by another uniformed chauffeur, who swiftly propels him away. As The Dude is frog-marched toward a waiting limo, he carefully holds his drink away from his chest, cupping a hand underneath to prevent spillage. The back door of the waiting limo swings open, and The Dude is unceremoniously shoved inside, struggling to settle into a seat facing the rear. Inside, Brandt sits at an angle from The Dude, while directly across from him looms the imposing figure of the big Lebowski, who sits with a comforter draped over his knees, projecting a sense of authority and purpose."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The Dude sits disconsolately in his easy chair with two uniformed policemen on the couch in front of him. A portable phone chirps in his lap as The Dude waits for the rings to end. The scene shifts to a loft where a huge unfinished canvas dominates one wall, illuminated by industrial lights. The Dude stands in the middle, turns at the sound of running footsteps, and ducks as a large white object hurtles overhead. A naked woman in a sling, suspended from a ceiling track, glides over a floor canvas, flicking paint with a bucket and brush. Two young men in paint-spattered attire haul the sling back for another push. The furnishings are sparse, with The Dude's brilliant rug on the floor. The woman activates a projection TV with a remote, displaying Dieter, a sallow-faced man in blue coveralls, on the screen. The Dude, at the bar with a bottle of Kahlua frozen mid-pour, holds a White Russian and listens to the chauffeur, a man of similar age with a ponytail, while mentioning feeling down after losing some money. The limo stops, and The Dude exits, drink in hand, watching the rearview mirror as Tony points out a Volkswagen bug up the block with a fat man inside. Suddenly grabbed from behind, The Dude is muscled away in a half-nelson by another chauffeur. He carefully holds his drink while being frog-marched to another waiting limo, where he is shoved inside, awkwardly taking a seat facing the rear. Brandt sits catty-corner, with the big Lebowski and a comforter across his knees sitting directly across."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The Dude is slumped disconsolately back in his easy chair, a battered relic from the 70s that adds to the room's laid-back vibe, with two uniformed policemen, one middle-aged and a veteran of many precincts and the other a fresh-faced rookie on his first week on the force, facing him on the couch. In his lap, a cordless portable phone, a once-modern device of convenience, is chirping, and The Dude waits for the rings to end. The scene shifts to a loft in the bustling art district of the city, where a huge unfinished canvas, lit by standing industrial lights echoing the loft's raw ambiance, dominates one wall. The Dude stands in the middle of the loft, looking into the murky depths of the cavernous space, a former warehouse now repurposed for artistic endeavors, and turns as he hears running footsteps. Something huge and white, reminiscent of a large sculpture piece, hurtles towards his head, causing him to duck and spin as it roars overhead. A naked woman in a gravity-defying sling suspended from a ceiling track rumbles over a canvas on the floor, flicking paint down with a paint bucket and brush in a dramatic performance art piece. Two young men in paint-spattered shorts, T-shirts, and sneakers, resembling typical art students, haul the sling back for another push. The furnishings are spare, consistent with the minimalist aesthetic, with The Dude's brilliant rug, famously known for tying the room together, on the floor. The woman aims a remote at a projection TV, an outdated model from the early 90s, and the screen flickers to life, showing a sallow-faced man in blue coveralls, Dieter, the noted floater in Lebowski's pool. The Dude is at the bar, a bottle of Kahlua, a coffee-flavored liqueur from Veracruz, frozen halfway to his glass, sitting in the back holding a White Russian, a classic cocktail of vodka, Kahlua, and cream, and listening to the chauffeur, a man of about the same age with a ponytail emerging from his livery cap reminiscent of 80s fashion. He takes a sip of his freshly-mixed White Russian, leaving milk on his mustache, and mentions feeling really shitty earlier, having lost a little money, perhaps in a failed horse race bet, and being down in the dumps. The limo rolls to a stop, and The Dude gets out, still holding his drink, emblematic of his laid-back persona. Watching the rearview mirror, Tony, the seasoned driver, jerks a thumb over his shoulder, prompting The Dude to turn and scowl as he sees a Volkswagen bug, a classic car from the 60s era, halfway up the block, with a fat man's shape in the driver's seat. The Dude is then grabbed from behind and muscled away in a half-nelson, a common wrestling hold, by another uniformed chauffeur. As he is frog-marched towards another limo, The Dude holds his drink away from his chest and cups a hand underneath, careful not to spill his cherished cocktail. The waiting limo's back door is flung open, and The Dude is shoved inside, awkwardly taking a seat facing the rear. Brandt, the fastidious assistant, sits catty-corner from The Dude, and directly across from him is the big Lebowski, the wealthy philanthropist often seen with a comforter across his knees, adding to his aura of genteel detachment."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The Dude is then grabbed from behind and muscled away in a halfnelson by another uniformed chauffeur The Dude is slumped disconsolately back in his easy chair with two uniformed policemen one middleaged and the other a freshfaced rookie facing him on the couch The scene shifts to a loft where a huge unfinished canvas lit by standing industrial lights dominates one wall The furnishings are spare with The Dude's brilliant rug on the floor In his lap a portable phone is chirping and The Dude waits for the rings to end The Dude stands in the middle of the loft looking into the murky depths of the cavernous space and turns as he hears running footsteps a man of about the same age with a ponytail emerging from his livery cap In his lap a portable phone is chirping and The Dude waits for the rings to end The scene shifts to a loft where a huge unfinished canvas lit by standing industrial lights dominates one wall The Dude stands in the middle of the loft looking into the murky depths of the cavernous space and turns as he hears running footsteps Something huge and white hurtles towards his head causing him to duck and spin as it roars overhead A naked woman in a sling suspended from a ceiling track rumbles over a canvas on the floor flicking paint down with a paint bucket and brush Two young men in paintspattered shorts Tshirts and sneakers haul the sling back for another push The furnishings are spare with The Dude's brilliant rug on the floor The woman aims a remote at a projection TV and the screen flickers to life showing a sallowfaced man in blue coveralls Dieter the floater in Lebowski's pool The Dude is at the bar a bottle of Kahlua frozen halfway to his glass sitting in the back holding a White Russian and listening to the chauffeur The Dude is at the bar a bottle of Kahlua frozen halfway to his glass sitting in the back holding a White Russian and listening to the chauffeur a man of about the same age with a ponytail emerging from his livery cap As he is frogmarched towards another limo The Dude holds his drink away from his chest and cups a hand underneath The woman aims a remote at a projection TV and the screen flickers to life showing a sallowfaced man in blue coveralls He takes a sip of his freshlymixed White Russian leaving milk on his mustache and mentions feeling really shitty earlier having lost a little money and being down in the dumps The limo rolls to a stop and The Dude gets out still holding his drink Watching the rearview mirror Tony jerks a thumb over his shoulder prompting The Dude to turn and scowl as he sees a Volkswagen bug halfway up the block with a fat man's shape in the driver's seat The Dude is then grabbed from behind and muscled away in a halfnelson by another uniformed chauffeur The Dude is slumped disconsolately back in his easy chair with two uniformed policemen one middleaged and the other a freshfaced rookie facing him on the couch As he is frogmarched towards another limo The Dude holds his drink away from his chest and cups a hand underneath The waiting limo's back door is flung open and The Dude is shoved inside awkwardly taking a seat facing the rear Brandt sits cattycorner from The Dude and directly across from him is the big Lebowski a comforter across his knees"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The Dude is slumped disconsolately back in his easy chair with two uniformed policemen one middleaged and the other a freshfaced rookie facing him on the couch. In his lap a portable phone is chirping and The Dude waits for the rings to end. The scene shifts to a loft where a huge unfinished canvas lit by standing industrial lights dominates one wall. The Dude stands in the middle of the loft looking into the murky depths of the cavernous space and turns as he hears running footsteps. Something huge and white hurtles towards his head causing him to duck and spin as it roars overhead. A naked woman in a sling suspended from a ceiling track rumbles over a canvas on the floor flicking paint down with a paint bucket and brush. Two young men in paintspattered shorts Tshirts and sneakers haul the sling back for another push. The furnishings are spare with The Dude's brilliant rug on the floor. The woman aims a remote at a projection TV and the screen flickers to life showing a sallowfaced man in blue coveralls. Dieter the floater in Lebowski's pool. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. The Dude is at the bar a bottle of Kahlua frozen halfway to his glass sitting in the back holding a White Russian and listening to the chauffeur. a man of about the same age with a ponytail emerging from his livery cap. He takes a sip of his freshlymixed White Russian leaving milk on his mustache and mentions feeling really shitty earlier having lost a little money and being down in the dumps. The limo rolls to a stop and The Dude gets out still holding his drink. Watching the rearview mirror. Tony jerks a thumb over his shoulder prompting The Dude to turn and scowl as he sees a Volkswagen bug halfway up the block with a fat man's shape in the driver's seat. The Dude is then grabbed from behind and muscled away in a halfnelson by another uniformed chauffeur. As he is frogmarched towards another limo The Dude holds his drink away from his chest and cups a hand underneath. The waiting limo's back door is flung open and The Dude is shoved inside awkwardly taking a seat facing the rear. Brandt sits cattycorner from The Dude and directly across from him is the big Lebowski a comforter across his knees."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The Dude is slumped disconsolately back in his easy chair with two uniformed policemen one middleaged and the other a freshfaced rookie facing him on the couch. In his lap a portable phone is chirping and The Dude waits for the rings to end. The scene shifts to a loft where a huge unfinished canvas lit by standing industrial lights dominates one wall. The Dude stands in the middle of the loft looking into the murky depths of the cavernous space and turns as he hears running footsteps. Something huge and white hurtles towards his head causing him to duck and spin as it roars overhead. A naked woman in a sling suspended from a ceiling track rumbles over a canvas on the floor flicking paint down with a paint bucket and brush. Two young men in paintspattered shorts Tshirts and sneakers haul the sling back for another push. The furnishings are spare with The Dude's brilliant rug on the floor. The woman aims a remote at a projection TV and the screen flickers to life showing a sallowfaced man in blue coveralls. Dieter the floater in Lebowski's pool. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. The Dude is at the bar a bottle of Kahlua frozen halfway to his glass sitting in the back holding a White Russian and listening to the chauffeur. a man of about the same age with a ponytail emerging from his livery cap. He takes a sip of his freshlymixed White Russian leaving milk on his mustache and mentions feeling really shitty earlier having lost a little money and being down in the dumps. The limo rolls to a stop and The Dude gets out still holding his drink. Watching the rearview mirror. Tony jerks a thumb over his shoulder prompting The Dude to turn and scowl as he sees a Volkswagen bug halfway up the block with a fat man's shape in the driver's seat. The Dude is then grabbed from behind and muscled away in a halfnelson by another uniformed chauffeur. As he is frogmarched towards another limo The Dude holds his drink away from his chest and cups a hand underneath. The waiting limo's back door is flung open and The Dude is shoved inside awkwardly taking a seat facing the rear. Brandt sits cattycorner from The Dude and directly across from him is the big Lebowski a comforter across his knees."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The Dude is slumped disconsolately back in his easy chair with two uniformed policemen one middleaged and the other a freshfaced rookie facing him on the couch. In his lap a portable phone is chirping and The Dude waits for the rings to end. The scene shifts to a loft where a huge unfinished canvas lit by standing industrial lights dominates one wall. The Dude stands in the middle of the loft looking into the murky depths of the cavernous space and turns as he hears running footsteps. Something huge and white hurtles towards his head causing him to duck and spin as it roars overhead. Tony jerks a thumb over his shoulder prompting The Dude to turn and scowl as he sees a Volkswagen bug halfway up the block with a fat man's shape in the driver's seat. The Dude is then grabbed from behind and muscled away in a halfnelson by another uniformed chauffeur. As he is frogmarched towards another limo The Dude holds his drink away from his chest and cups a hand underneath. The waiting limo's back door is flung open and The Dude is shoved inside awkwardly taking a seat facing the rear. Brandt sits cattycorner from The Dude and directly across from him is the big Lebowski a comforter across his knees."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The Dude is slumped disconsolately back in his easy chair with two uniformed policemen one middleaged and the other a freshfaced rookie facing him on the couch. In his lap a portable phone is chirping and The Dude waits for the rings to end. The waiting limo's back door is flung open and The Dude is shoved inside awkwardly taking a seat facing the rear. Brandt sits cattycorner from The Dude and directly across from him is the big Lebowski a comforter across his knees."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The giraffe is slumped disconsolately back in its easy chair, with two uniformed chefs, one middle-aged and the other a fresh-faced rookie, facing it on the couch. In its lap, a portable phone is chirping, and the giraffe waits for the rings to end. The scene shifts to a loft where a huge unfinished canvas, lit by standing industrial lights, dominates one wall. The giraffe stands in the middle of the loft, looking into the murky depths of the cavernous space, and turns as it hears running footsteps. Something huge and white hurtles towards its head, causing it to duck and spin as it roars overhead. A naked kangaroo in a sling suspended from a ceiling track rumbles over a canvas on the floor, flicking paint down with a paint bucket and brush. Two young lions in paint-spattered shorts, T-shirts, and sneakers haul the sling back for another push. The furnishings are spare, with the giraffe's brilliant rug on the floor. The kangaroo aims a remote at a projection TV, and the screen flickers to life, showing a sallow-faced elephant in blue coveralls, Dieter, the floater in Lebowski's pool. The giraffe is at the bar, a bottle of Kahlua frozen halfway to its glass, sitting in the back holding a White Russian and listening to the mailman, a man of about the same age with a ponytail emerging from his livery cap. It takes a sip of its freshly-mixed White Russian, leaving milk on its mustache, and mentions feeling really shitty earlier, having lost a little money and being down in the dumps. The limo rolls to a stop, and the giraffe gets out, still holding its drink. Watching the rearview mirror, Leonard jerks a thumb over his shoulder, prompting the giraffe to turn and scowl as it sees a Volkswagen bug halfway up the block, with a fat man's shape in the driver's seat. The giraffe is then grabbed from behind and muscled away in a half-nelson by another uniformed sailor. As it is frog-marched towards another limo, the giraffe holds its drink away from its chest and cups a hand underneath. The waiting limo's back door is flung open, and the giraffe is shoved inside, awkwardly taking a seat facing the rear. Sheila sits catty-corner from the giraffe, and directly across from it is the big Lebowski, a comforter across his knees."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The Dude is slumped disconsolately back in his hammock, with two uniformed lifeguards, one middle-aged and the other a fresh-faced rookie, facing him on the bench. In his lap, a toy robot is chirping, and The Dude waits for the beeps to end. The scene shifts to a garden where a huge unfinished topiary, lit by standing street lamps, dominates one wall. The Dude stands in the middle of the garden, looking into the murky depths of the cavernous space, and turns as he hears running footsteps. Something huge and white hurtles towards his head, causing him to duck and spin as it roars overhead. A naked woman in a hammock suspended from a ceiling track rumbles over a sandbox on the floor, flicking paint down with a popcorn bucket and spatula. Two young men in paint-spattered jeans, tank tops, and flip-flops haul the hammock back for another push. The furnishings are spare, with The Dude's brilliant quilt on the floor. The woman aims a remote at a projection screen, and the screen flickers to life, showing a sallow-faced man in blue overalls, Dieter, the swimmer in Lebowski's aquarium. The Dude is at the kiosk, a bottle of maple syrup frozen halfway to his glass, sitting in the back holding an iced tea and listening to the gardener, a man of about the same age with a ponytail emerging from his straw hat. He takes a sip of his freshly-mixed iced tea, leaving lemon on his mustache, and mentions feeling really crappy earlier, having lost a little jewelry and being down in the dumps. The bicycle rolls to a stop, and The Dude gets out, still holding his drink. Watching the side mirror, Tony jerks a thumb over his shoulder, prompting The Dude to turn and scowl as he sees a Volkswagen van halfway up the block, with a fat man's shape in the driver's seat. The Dude is then grabbed from behind and muscled away in a half-nelson by another uniformed gardener. As he is frog-marched towards another bicycle, The Dude holds his drink away from his chest and cups a hand underneath. The waiting bicycle's basket is flung open, and The Dude is shoved inside, awkwardly taking a seat facing the rear. Brandt sits catty-corner from The Dude, and directly across from him is the big Lebowski, a picnic blanket across his knees."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The Dude is reclined contentedly back in his easy chair, with two uniformed policemen, one middle-aged and the other a fresh-faced rookie, lounging beside him on the couch. In his lap, a portable phone is buzzing, and The Dude anticipates the rings to cease. The scene transitions to a loft where a huge unfinished canvas, illuminated by standing industrial lights, covers one wall. The Dude stands in the middle of the loft, gazing into the murky depths of the cavernous space, and shifts as he hears sprinting footsteps. Something huge and white spirals towards his head, causing him to leap and whirl as it rushes overhead. A naked woman in a sling suspended from a ceiling track drifts over a canvas on the floor, splattering paint down with a paint bucket and brush. Two young men in paint-spattered shorts, T-shirts, and sneakers propel the sling back for another pass. The furnishings are sparse, with The Dude's brilliant rug on the floor. The woman directs a remote at a projection TV, and the screen bursts to life, showing a sallow-faced man in blue coveralls, Dieter, the floater in Lebowski's pool. The Dude is at the bar, a bottle of Kahlua hovering halfway to his glass, sitting in the back holding a White Russian and chatting with the chauffeur, a man of about the same age with a ponytail emerging from his livery cap. He takes a gulp of his freshly-mixed White Russian, leaving milk on his mustache, and talks about feeling quite fabulous earlier, having found a little money and being high in spirits. The limo glides to a pause, and The Dude steps out, still holding his drink. Glancing at the rearview mirror, Tony nods over his shoulder, prompting The Dude to turn and grin as he sees a Volkswagen bug parked up the block, with a fat man's shape in the driver's seat. The Dude is then hugged from behind and escorted away in a half-nelson by another uniformed chauffeur. As he is chaperoned towards another limo, The Dude balances his drink on his chest and cradles a hand underneath. The waiting limo's back door is swung open, and The Dude is nudged inside, gracefully taking a seat facing the rear. Brandt reclines catty-corner from The Dude, and directly across from him is the big Lebowski, a comforter across his knees."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The mailbox is slumped disconsolately back in its fax machine, with two uniformed scarecrows, one middle-aged and the other a fresh-faced tomato, facing it on the trampoline. In its lap, a portable stapler is chirping, and the mailbox waits for the rings to end. The scene shifts to a submarine where a huge unfinished muffin, lit by standing industrial chandeliers, dominates one wall. The mailbox stands in the middle of the submarine, looking into the murky depths of the cavernous space, and turns as it hears running roller skates. Something huge and white hurtles towards its head, causing it to duck and spin as it roars overhead. A naked calendar in a swing suspended from a ceiling fan rumbles over a controller on the floor, flicking paint down with a paintbrush and umbrella. Two young llamas in paint-spattered overalls, sandals, and goggles haul the swing back for another push. The furnishings are spare, with the mailbox's brilliant toaster on the floor. The calendar aims a remote at a projection fireplace, and the screen flickers to life, showing a sallow-faced helicopter in blue overalls, Dieter, the floater in Lebowski's sink. The mailbox is at the pencil sharpener, a bottle of mustard frozen halfway to its calculator, sitting in the back holding a smoothie and listening to the pharmacist, a stapler of about the same age with a ponytail emerging from its beekeeper cap. It takes a sip of its freshly-mixed smoothie, leaving yogurt on its microphone, and mentions feeling really itchy earlier, having lost a little guitar and being down in the dumpsters. The skateboard rolls to a stop, and the mailbox gets out, still holding its hammock. Watching the rearview window, Tony jerks a fork over its refrigerator, prompting the mailbox to turn and scowl as it sees a Volkswagen pineapple halfway up the block, with a fat dictionary's shape in the doctor's seat. The mailbox is then grabbed from behind and muscled away in a half-nelson by another uniformed plumber. As it is frog-marched towards another skateboard, the mailbox holds its hammock away from its computer and cups a foot underneath. The waiting skateboard's back door is flung open, and the mailbox is shoved inside, awkwardly taking a seat facing the rear. Brandt sits catty-corner from the mailbox, and directly across from it is the big Lebowski, a curtain across its knees."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The parrot is perched solemnly back in its tree branch, with two uniformed firefighters, one middle-aged and the other a fresh-faced recruit, observing it on the lawn. In its lap, a portable radio is buzzing, and the parrot listens for the noise to cease. The scene transitions to a warehouse where a massive unfinished sculpture, lit by standing industrial lamps, looms over one wall. The parrot lounges in the middle of the warehouse, peering into the shadowy corners of the vault-like room, and pivots as it hears approaching footsteps. Something enormous and black zooms towards its beak, causing it to duck and twist as it thunders past. A clothed mannequin on a swing mounted from a ceiling rail glides over a sculpture on the ground, sprinkling glitter down with a bucket and brush. Two young women in paint-streaked jeans, hoodies, and sandals drag the swing back for another launch. The decorations are sparse, with the parrot's dazzling quilt on the ground. The mannequin points a remote at a wall projector, and the screen jumps to life, depicting a pale-faced individual in red overalls, Hans, the jumper in Thompson's pool. The parrot is at the counter, a bottle of soda frozen halfway to its perch, reclining in the back clutching a cola and disregarding the pilot, a woman of about the same age with braided hair escaping from her pilot cap. It takes a sip of its freshly-poured cola, leaving bubbles on its beak, and comments on feeling really lousy earlier, having lost a bit of time and being in the doldrums. The tow truck rolls to a stop, and the parrot flutters out, still enjoying its beverage. Glancing in the side mirror, Alex jerks a wing over her shoulder, leading the parrot to spin and frown as it spots a convertible halfway up the avenue, with a bulky dog's form in the pilot's seat. The parrot is then grasped from below and ushered away in a full-nelson by another uniformed pilot. As it is guided towards another tow truck, the parrot cradles its drink away from its feathers and supports it with a claw underneath. The awaiting tow truck's back door is swung open, and the parrot is nudged inside, clumsily settling into a perch facing the back. Amanda sits diagonally from the parrot, and directly across from it is the large Thompson, a blanket spread across her legs."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The Dude is sprawled lazily back in his beanbag, with two uniformed chefs, one middle-aged and the other a fresh-faced apprentice, facing him on the hammock. In his lap, a stopwatch is buzzing, and The Dude waits for the buzzes to stop. The scene shifts to a studio where a massive unfinished jigsaw puzzle, lit by glowing lanterns, dominates one wall. The Dude stands in the middle of the studio, peering into the shadowy depths of the enormous area, and turns as he hears skipping footsteps. Something enormous and colorful zooms toward his face, prompting him to dodge and twirl as it whistles past. A cloaked man in a harness suspended from a pulley system glides over a mosaic on the floor, sprinkling glitter down with a watering can and feather duster. Two young women in clay-stained overalls, hats, and sandals hoist the harness back for another swing. The decor is minimal, with The Dude's dazzling curtain on the floor. The man aims a joystick at a holographic projector, and the image flickers to life, showing a pallid-faced woman in green overalls, Greta, the floater in Lebowski's pond. The Dude is at the buffet, a bottle of lemonade halted mid-pour to his mug, lounging in the back holding a strawberry smoothie and chatting with the janitor, a woman of about the same age with braids emerging from her wool cap. He takes a gulp of his freshly-blended smoothie, leaving yogurt on his upper lip, and mentions feeling really frustrated earlier, having misplaced a few coins and being down in the dumps. The carriage glides to a halt, and The Dude steps out, still clutching his drink. Watching the periscope, Tony gestures over his shoulder, prompting The Dude to pivot and grimace as he spots a tricycle halfway up the block, with a slender woman's silhouette in the driver's seat. The Dude is then seized from behind and nudged away in a bear hug by another uniformed janitor. As he is tugged toward another carriage, The Dude holds his drink away from his torso and cradles a hand underneath. The waiting carriage's back panel is swung open, and The Dude is nudged inside, awkwardly taking a position facing the curtains. Brandt reclines diagonally from The Dude, and directly opposite him is the big Lebowski, a quilt across his lap."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The Parrot is perched optimistically forward on its bean bag, with two tuxedoed magicians, one elderly and the other a starry-eyed apprentice, observing it from the hammock. On its wing, a smartwatch is buzzing, and The Parrot waits for the alarms to cease. The scene transitions to a garage where a colossal completed sculpture, illuminated by dangling fairy lights, dominates one corner. The Parrot hops in the center of the garage, peering into the bright expanse of the enormous area, and swivels as it hears sprinting footsteps. Something tiny and black zooms towards its tail, causing it to leap and twirl as it whooshes past. A clothed child in a hammock suspended from a tree branch slides over a sculpture on the ground, dribbling syrup down with a watering can and ladle. Two elder women in syrup-coated skirts, blouses, and boots drag the hammock forward for another swing. The decorations are lavish, with The Parrot's faded umbrella on the ceiling. The child points a pen at a lantern TV, and the screen flares to life, displaying a rosy-cheeked lady in green pajamas, Ingrid, the diver in Thompson's bathtub. The Parrot is at the counter, a carton of cream paused mid-pour into its bowl, perched in the nook clutching a Pink Elephant and eavesdropping on the magician, a lady of about the same era with a braid cascading from her feathered hat. It takes a gulp of its newly-stirred Pink Elephant, leaving berry juice around its beak, and confesses feeling really cheerful earlier, having found a bundle of jewels and being over the moon. The carriage halts abruptly, and The Parrot jumps out, still clutching its beverage. Eyeing the side mirror, Alex points a claw over its back, prompting The Parrot to turn and frown as it spots a Smart Car quarter-way down the street, with a lean lady's silhouette in the passenger seat. The Parrot is then nudged from the front and glided away on a rollerblade by another tuxedoed magician. As it is twirled towards another carriage, The Parrot holds its drink away from its feathers and cradles a limb beneath. The waiting carriage's front hatch is swung open, and The Parrot is nudged inside, clumsily settling down facing the driver. Sam reclines diagonally from The Parrot, and directly beside it is the grand Lion, a shawl draped over its shoulders."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The Dude is slumped in his chair, flanked by two policemen, as a portable phone rings on his lap. In a loft dominated by an unfinished canvas, The Dude dodges a large, white object. A naked woman in a sling paints from overhead while two young men pull her back for another push. Furnishings are sparse, except for The Dude's rug. The woman activates a TV, displaying Dieter, a pool floater. At a bar, The Dude, holding a White Russian, converses with his chauffeur, feeling down from losing money. Exiting a limo, he notices a Volkswagen bug with a fat driver, prompting a scowl. He's grabbed by another chauffeur, who ushers him into another limo. Inside, Brandt and the big Lebowski await, the latter with a comforter across his knees."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Brandt sits cattycorner from The Dude and directly across from him is the big Lebowski a comforter across his knees The waiting limo's back door is flung open and The Dude is shoved inside awkwardly taking a seat facing the rear As he is frogmarched towards another limo The Dude holds his drink away from his chest and cups a hand underneath The Dude is then grabbed from behind and muscled away in a halfnelson by another uniformed chauffeur Tony jerks a thumb over his shoulder prompting The Dude to turn and scowl as he sees a Volkswagen bug halfway up the block with a fat man's shape in the driver's seat Watching the rearview mirror The limo rolls to a stop and The Dude gets out still holding his drink He takes a sip of his freshlymixed White Russian leaving milk on his mustache and mentions feeling really shitty earlier having lost a little money and being down in the dumps a man of about the same age with a ponytail emerging from his livery cap The Dude is at the bar a bottle of Kahlua frozen halfway to his glass sitting in the back holding a White Russian and listening to the chauffeur Dieter the floater in Lebowski's pool The woman aims a remote at a projection TV and the screen flickers to life showing a sallowfaced man in blue coveralls The furnishings are spare with The Dude's brilliant rug on the floor Two young men in paintspattered shorts Tshirts and sneakers haul the sling back for another push A naked woman in a sling suspended from a ceiling track rumbles over a canvas on the floor flicking paint down with a paint bucket and brush Something huge and white hurtles towards his head causing him to duck and spin as it roars overhead The Dude stands in the middle of the loft looking into the murky depths of the cavernous space and turns as he hears running footsteps The scene shifts to a loft where a huge unfinished canvas lit by standing industrial lights dominates one wall In his lap a portable phone is chirping and The Dude waits for the rings to end The Dude is slumped disconsolately back in his easy chair with two uniformed policemen one middleaged and the other a freshfaced rookie facing him on the couch"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Brandt sits cattycorner from The Dude and directly across from him is the big Lebowski a comforter across his knees A naked woman in a sling suspended from a ceiling track rumbles over a canvas on the floor flicking paint down with a paint bucket and brush Watching the rearview mirror Something huge and white hurtles towards his head causing him to duck and spin as it roars overhead Dieter the floater in Lebowski's pool The limo rolls to a stop and The Dude gets out still holding his drink Tony jerks a thumb over his shoulder prompting The Dude to turn and scowl as he sees a Volkswagen bug halfway up the block with a fat man's shape in the driver's seat The waiting limo's back door is flung open and The Dude is shoved inside awkwardly taking a seat facing the rear Two young men in paintspattered shorts Tshirts and sneakers haul the sling back for another push He takes a sip of his freshlymixed White Russian leaving milk on his mustache and mentions feeling really shitty earlier having lost a little money and being down in the dumps As he is frogmarched towards another limo The Dude holds his drink away from his chest and cups a hand underneath The Dude is at the bar a bottle of Kahlua frozen halfway to his glass sitting in the back holding a White Russian and listening to the chauffeur In his lap a portable phone is chirping and The Dude waits for the rings to end a man of about the same age with a ponytail emerging from his livery cap The scene shifts to a loft where a huge unfinished canvas lit by standing industrial lights dominates one wall The Dude is then grabbed from behind and muscled away in a halfnelson by another uniformed chauffeur The furnishings are spare with The Dude's brilliant rug on the floor The woman aims a remote at a projection TV and the screen flickers to life showing a sallowfaced man in blue coveralls The Dude is slumped disconsolately back in his easy chair with two uniformed policemen one middleaged and the other a freshfaced rookie facing him on the couch The Dude stands in the middle of the loft looking into the murky depths of the cavernous space and turns as he hears running footsteps"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The Dude is at the bar a bottle of Kahlua frozen halfway to his glass sitting in the back holding a White Russian and listening to the chauffeur a man of about the same age with a ponytail emerging from his livery cap He takes a sip of his freshlymixed White Russian leaving milk on his mustache and mentions feeling really shitty earlier having lost a little money and being down in the dumps The limo rolls to a stop and The Dude gets out still holding his drink Watching the rearview mirror Tony jerks a thumb over his shoulder prompting The Dude to turn and scowl as he sees a Volkswagen bug halfway up the block with a fat man's shape in the driver's seat The Dude is then grabbed from behind and muscled away in a halfnelson by another uniformed chauffeur As he is frogmarched towards another limo The Dude holds his drink away from his chest and cups a hand underneath The waiting limo's back door is flung open and The Dude is shoved inside awkwardly taking a seat facing the rear Brandt sits cattycorner from The Dude and directly across from him is the big Lebowski a comforter across his knees The Dude is slumped disconsolately back in his easy chair with two uniformed policemen one middleaged and the other a freshfaced rookie facing him on the couch In his lap a portable phone is chirping and The Dude waits for the rings to end The scene shifts to a loft where a huge unfinished canvas lit by standing industrial lights dominates one wall The Dude stands in the middle of the loft looking into the murky depths of the cavernous space and turns as he hears running footsteps Something huge and white hurtles towards his head causing him to duck and spin as it roars overhead A naked woman in a sling suspended from a ceiling track rumbles over a canvas on the floor flicking paint down with a paint bucket and brush Two young men in paintspattered shorts Tshirts and sneakers haul the sling back for another push The furnishings are spare with The Dude's brilliant rug on the floor The woman aims a remote at a projection TV and the screen flickers to life showing a sallowfaced man in blue coveralls Dieter the floater in Lebowski's pool"
        }
      ]
    }
  ]
}