{
  "ground_truth": "Lebowski stares at him, dumbstruck. The Dude is encouraged and takes a hurried sip from his drink. Brandt is handing him a letter-sized envelope, which is distended by something inside. The Dude, frowning, untucks its flap, takes out some cotton wadding, and unrolls it. The wadding, undone, reveals a smaller wad of gauze taped up inside. The Dude undoes the tape with his fingernails and starts to unroll the inner package. Between thumb and forefinger, the Dude holds up the contents of the package--a little toe, with emerald green nail polish. The Dude and Walter sit at the counter, both staring off into space, both absently stirring their coffee with little clinking noises. A waitress enters. The Dude has left frame; Walter calls after him as he looks defiantly around. A dripping noise follows. The Dude sits in the bathtub, staring stuporously, a joint pinched in one hand, a washcloth draped over his head. He stares at his toes, which protrude from the soapy water, splayed against the far side of the tub. After the Dude's outgoing message, we hear a dripping noise, and the Dude looks stuporously up, his head swaying. One of them holds a string at the other end of which a small animal skitters excitedly about the floor, as two other men enter behind him. The Dude looks curiously at the small, nattering animal before the man with the string scoops up the marmot and tosses it, screaming, into the bathtub; the Dude screams. The marmot splashes frantically, biting at the Dude in a frenzy of fearful aggression. The three men turn to leave and have reached the Dude's car, where the driver's side exterior has been scraped raw. A policeman hands the Dude a door handle and an exterior rear-view mirror, laughing and agreeing broadly, while the Dude looks sadly through his window at the policeman rocking back on his heels, his raucous laughter muffled by the glass. The Dude, Walter, and Donny sit at the bar, the Dude with a White Russian, Walter with a beer, and Donny eating beer nuts. Walter sadly shakes his head as they leave the Dude sitting morosely at the bar, and he stares. He is middle-aged, amiable, craggily handsome--Sam Elliot, perhaps, with a large Western-style mustache and wearing denims, a yoked shirt, and a cowboy hat. We recognize the voice of The Stranger whose narration opened the movie. The Stranger nods and, waiting for his drink, looks amiably around the bar. His crinkled eyes settle on the Dude, who, still staring down at his drink, shakes his head. The Dude looks at The Stranger as if just now noticing how out of place the cowpoke is, while the Stranger chuckles indulgently and pushes off from the bar.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Lebowski gazes at him, awestruck. The Dude is heartened and takes a hasty sip from his beverage. Brandt is presenting him a letter-sized packet, which is bulging by something inside. The Dude, scowling, untucks its flap, extracts some cotton padding, and unfurls it. The padding, unwrapped, discloses a smaller bundle of gauze taped up inside. The Dude loosens the tape with his fingernails and starts to unfurl the internal bundle. Between thumb and index finger, the Dude holds up the contents of the bundle--a small toe, with emerald green nail lacquer. The Dude and Walter sit at the counter, both gazing off into space, both absentmindedly stirring their coffee with little clinking noises. A waitress enters. The Dude has left frame; Walter calls after him as he looks defiantly around. A dripping noise follows. The Dude sits in the bathtub, staring dazedly, a joint clasped in one hand, a washcloth draped over his head. He gazes at his toes, which jut from the soapy water, spread against the far side of the tub. After the Dude's outgoing message, we hear a dripping noise, and the Dude looks dazedly up, his head swaying. One of them holds a cord at the other end of which a small creature skitters excitedly about the floor, as two other men enter behind him. The Dude looks curiously at the small, chattering creature before the man with the cord scoops up the marmot and tosses it, shrieking, into the bathtub; the Dude shrieks. The marmot splashes frantically, nipping at the Dude in a frenzy of fearful aggression. The three men turn to depart and have reached the Dude's car, where the driver's side exterior has been scraped raw. A policeman hands the Dude a door handle and an exterior rear-view mirror, laughing and agreeing broadly, while the Dude looks sadly through his window at the policeman rocking back on his heels, his boisterous laughter muffled by the glass. The Dude, Walter, and Donny sit at the bar, the Dude with a White Russian, Walter with a beer, and Donny eating beer nuts. Walter sadly shakes his head as they leave the Dude sitting gloomily at the bar, and he gazes. He is middle-aged, affable, ruggedly handsome--Sam Elliot, perhaps, with a large Western-style mustache and wearing denims, a yoked shirt, and a cowboy hat. We recognize the voice of The Stranger whose narration opened the movie. The Stranger nods and, waiting for his drink, looks affably around the bar. His crinkled eyes settle on the Dude, who, still gazing down at his drink, shakes his head. The Dude looks at The Stranger as if just now noticing how out of place the cowpoke is, while the Stranger chuckles indulgently and pushes off from the bar."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Lebowski is stared at by him, dumbstruck. Encouragement is felt by the Dude, and a hurried sip from his drink is taken by him. Brandt hands him a letter-sized envelope, which distends by something inside. The flap is untucked by the Dude, frowning, and some cotton wadding is taken out and unrolled by him. The wadding is undone and a smaller wad of gauze taped up inside is revealed. The tape is undone by the Dude with his fingernails, and the inner package is started to be unrolled by him. The contents of the package--a little toe, with emerald green nail polish--are held up by the Dude between thumb and forefinger. The counter is sat at by the Dude and Walter, both staring off into space, both absently stirring their coffee with little clinking noises. A waitress is entered by her. Frame has been left by the Dude; he is called after by Walter as he looks defiantly around. A dripping noise is followed by him. The bathtub is sat in by the Dude, staring stuporously, a joint pinched in one hand, a washcloth draped over his head. His toes are stared at by him, which protrude from the soapy water, splayed against the far side of the tub. After the Dude's outgoing message, a dripping noise is heard, and his head sways as he looks stuporously up. The string is held by one of them at the other end of which a small animal skitters excitedly about the floor, as two other men enter behind him. The small, nattering animal is looked at curiously by the Dude before the marmot is scooped up by the man with the string and is tossed, screaming, into the bathtub; the Dude screams. Frantic splashing and biting at the Dude in a frenzy of fearful aggression is done by the marmot. The three men turn to leave and reach the Dude's car, where the driver's side exterior has been scraped raw. A door handle and an exterior rear-view mirror are handed to the Dude by a policeman, who laughs and agrees broadly, while sadly looking through his window at the policeman rocking back on his heels, his raucous laughter muffled by the glass. The bar is sat at by the Dude, Walter, and Donny, the Dude with a White Russian, Walter with a beer, and Donny eating beer nuts. Walter shakes his head sadly as the Dude is left sitting morosely at the bar, and he stares. He is middle-aged, amiable, craggily handsome--Sam Elliot, perhaps, with a large Western-style mustache and wearing denims, a yoked shirt, and a cowboy hat. The voice of The Stranger, whose narration opened the movie, is recognized. The Stranger nods and, waiting for his drink, he looks amiably around the bar. His crinkled eyes settle on the Dude, who, still staring down at his drink, is shaken his head. The Stranger is looked at by the Dude as if just now noticing how out of place the cowpoke is, while indulgent chuckling is done by the Stranger as he pushes off from the bar."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Lebowski stares, stunned. The Dude, encouraged, takes a quick sip. Brandt hands him a bulging envelope. The Dude, frowning, untucks its flap, removes some cotton wadding, and unrolls it to reveal a taped gauze wad. He carefully unwraps it to find a small toe with emerald green nail polish. The Dude and Walter sit, staring into space, absentmindedly stirring coffee. A waitress enters. After the Dude exits, Walter defiantly looks around. The Dude sits in the bathtub, staring dazedly, a joint in hand, washcloth over his head. He stares at his toes in the soapy water. A dripping sound follows the Dude's outgoing message. A man holds a string with a small animal skittering on the floor as two others enter. The Dude curiously watches the animal before it’s tossed into the bathtub, prompting him to scream as it splashes frantically. The men leave, reaching the Dude's scraped car. A policeman hands him a door handle and mirror, laughing, while the Dude looks sadly through the window at him. The Dude, Walter, and Donny sit at the bar; Walter sadly shakes his head as they leave the Dude, who stares. A middle-aged, amiable man resembling Sam Elliott with a large mustache—The Stranger—nods, waiting for his drink. His eyes settle on the Dude, who, shaking his head, notices The Stranger, chuckling and leaving the bar."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Lebowski stares, dumbstruck. The Dude takes a hurried sip. Brandt hands him an envelope with something inside. The Dude untucks the flap, removes wadding, revealing gauze. He undoes it, revealing a toe with green nail polish. The Dude and Walter sit, stirring coffee. A waitress enters, and the Dude leaves. A dripping noise follows. The Dude is in a bathtub, joint in hand, staring at his toes. After his message, he hears dripping, then sees a small animal dragged in, which is tossed into the tub, prompting screams. Three men leave, reaching the Dude's scraped car. A policeman hands the Dude a door handle and mirror, laughing, while the Dude looks sadly through the window. The Dude, Walter, and Donny sit at the bar, with respective drinks and nuts. Walter shakes his head, leaving the morose Dude. A middle-aged, amiable man, resembling Sam Elliot, with a Western mustache and attire, recognized as The Stranger, observes the Dude. The Stranger chuckles and leaves the bar."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Lebowski stands there, staring at him, utterly dumbstruck and in disbelief. Encouraged by the moment, the Dude hastily takes a sip from his drink, as if to steady himself. Meanwhile, Brandt is passing him an envelope of letter-sized dimensions, noticeably bulging with something concealed inside. With a furrowed brow, the Dude carefully untucks the flap of the envelope and retrieves some cotton wadding, which he begins to unroll meticulously. As he unravels the wadding, it reveals a smaller bundle of gauze wrapped neatly inside. The Dude then uses his fingernails to undo the tape securing it and starts unrolling this inner package with deliberate care. Pinched between his thumb and forefinger, the Dude holds aloft the contents of the package, which turns out to be a little toe, painted with striking emerald green nail polish.\n\nBoth the Dude and Walter are seated at the counter, their gazes distant and unfocused as each idly stirs their coffee, producing gentle clinking noises that echo in the air. A waitress enters the scene, but the Dude has already left the frame; Walter calls out to him, looking defiantly around, as a dripping noise quietly follows. The Dude now sits in the bathtub, staring in a stupor, with a joint held casually in one hand and a washcloth draping over his head. His eyes are fixed on his toes, which protrude from the soapy water, splayed awkwardly against the far side of the tub.\n\nAfter the Dude's outgoing message plays, that persistent dripping noise echoes again, prompting the Dude to look up in a daze, his head swaying slightly. Nearby, one of the men holds a string, at the end of which a small animal skitters across the floor with eager excitement. As two other men enter behind him, the Dude observes the small, chattering creature with curiosity. Suddenly, the man with the string scoops up the marmot and, with a scream, tosses it into the bathtub; the Dude yells in shock. The marmot splashes about in a panic, biting at the Dude with a frenzy born of fearful aggression. The three men turn to make their exit and have reached the Dude's car, which bears the scars of a scrape along the driver's side exterior.\n\nOutside, a policeman hands the Dude a car door handle and an exterior rear-view mirror, laughing loudly and nodding in agreement, while the Dude looks on sadly from his window. The policeman's laughter, though raucous, is slightly muffled by the glass, contrasting with the Dude's somber reflection. Inside, the Dude, Walter, and Donny sit together at the bar, where the Dude holds a White Russian, Walter sips a beer, and Donny munches on beer nuts. Walter, with a sad shake of his head, gestures as they depart, leaving the Dude to sit forlornly at the bar, staring off into the distance.\n\nThe atmosphere shifts as we focus on a middle-aged man with an amiable demeanor. He is ruggedly handsome and might be Sam Elliot, with a large, Western-style mustache, wearing classic denims, a yoked shirt, and topped with a cowboy hat. This is The Stranger, whose familiar voice narrated the beginning of the movie. The Stranger nods perceptively, and as he waits for his drink, he casts an amiable gaze around the bar. His eyes, crinkled with experience, rest on the Dude, who still stares down at his drink and shakes his head. The Dude glances at The Stranger, as if just realizing how out of place the cowboy figure is in this setting. The Stranger, with a chuckle of indulgence, pushes away from the bar, leaving the Dude to his musings."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Lebowski stands in a state of shock, staring at him with wide eyes, utterly dumbstruck and filled with disbelief at what he sees before him. Riding on the wave of the moment, the Dude hastily takes a sip from his drink, as if hoping the familiar taste will help steady his nerves amidst the confusion. Meanwhile, Brandt is in the process of passing him an envelope of letter-sized dimensions, conspicuously bulging with something concealed inside. With a furrowed brow, the Dude methodically untucks the flap of the envelope and retrieves some cotton wadding, which he begins to unroll with meticulous care. As he continues to unravel the wadding, a smaller bundle of gauze is revealed, wrapped neatly inside. The Dude then uses his fingernails to carefully undo the tape securing it and starts unrolling this inner package, doing so with deliberate and cautious care. Finally, pinched between his thumb and forefinger, the Dude holds aloft the contents of the package, which reveal themselves to be a small toe, painted with striking and garish emerald green nail polish.\n\nBoth the Dude and Walter are seated side by side at the counter, their gazes distant and unfocused, each staring blankly into the void as they idly stir their coffee, producing gentle clinking noises that echo softly in the air around them. A waitress enters the scene, but by this time, the Dude has already left the frame entirely; Walter calls out to him, looking defiantly around the space, as a steady dripping noise quietly follows in the background. The Dude now finds himself sitting in the bathtub, staring ahead in a stupor, with a joint held casually in one hand and a washcloth draped over his head. His eyes are fixed intently on his own toes, which protrude from the soapy water in front of him, splayed awkwardly against the far side of the tub.\n\nAfter the Dude's outgoing message plays, that same persistent dripping noise echoes once again, prompting the Dude to look upward in a daze, his head swaying slightly under the weight of his stupor. Nearby, one of the men holds a string, at the end of which a small animal skitters eagerly across the floor with visible excitement. As two other men enter the room behind him, the Dude observes the small, chattering creature with a sense of growing curiosity. Suddenly, the man with the string swiftly scoops up the marmot and, with a loud scream, tosses it into the bathtub; the Dude responds by yelling in shock. The marmot splashes about in a frenzied panic, biting at the Dude with a frenzy born of fearful aggression. The three men turn to make their brisk exit and have reached the Dude's car, which bears the visible scars of a scrape along the driver's side exterior.\n\nOutside, a policeman approaches and hands the Dude a car door handle and an exterior rear-view mirror, all the while laughing loudly and nodding in agreement, as the Dude looks on sadly from his window. The policeman's laughter, though raucous, is slightly muffled by the glass, contrasting sharply with the Dude's somber, reflective expression. Inside, the Dude, Walter, and Donny are seated together at the bar, where the Dude holds a White Russian, Walter sips a beer, and Donny munches on beer nuts. Walter, with a sad shake of his head, gestures as they prepare to depart, leaving the Dude to sit forlornly at the bar, staring off into the distant space.\n\nThe atmosphere shifts focus to a middle-aged man exuding an amiable demeanor. He is ruggedly handsome, possibly resembling Sam Elliott, with a large, Western-style mustache, clad in classic denims, a yoked shirt, and topped off with a cowboy hat. This is The Stranger, whose familiar voice narrated the beginning of the movie. The Stranger nods perceptively and, as he waits for his drink to arrive, he casts an amiable gaze around the bar. His eyes, crinkled with experience, finally rest on the Dude, who continues to stare down at his drink, shaking his head ever so slightly. The Dude glances at The Stranger, as if only now realizing how out of place the cowboy figure is in this particular setting. The Stranger, with an indulgent chuckle, pushes away from the bar, leaving the Dude to his contemplative musings."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Lebowski fixes his gaze on him, utterly dumbstruck, the surprise evident in his wide eyes and slightly parted lips. As if spurred on by this reaction, the Dude quickly lifts his drink and takes a hurried sip, the liquid rushing past his lips as he swallows. In the meantime, Brandt extends his arm, offering a letter-sized envelope, which appears swollen due to something inside pressing against the paper. The Dude accepts it, his face contorting into a frown as he deftly untucks the flap with his fingers. He pulls out a piece of cotton wadding, feeling its texture as he begins to unroll it with care. As the layers of cotton come undone, they reveal a smaller, tightly wrapped wad of gauze, secured with tape. Using his fingernails, the Dude carefully peels away the tape, the adhesive resisting slightly before yielding. He then starts to meticulously unroll the inner package, section by section, until he finally pinches the contents between his thumb and forefinger—a little toe adorned with emerald green nail polish, which he holds up for closer examination. Later, the Dude and Walter find themselves seated at the counter, both lost in their thoughts, their gazes fixed into space while their hands absentmindedly stir their coffee, producing soft clinking sounds. A waitress enters the scene, but the Dude has already left the frame. Walter, feeling the absence, calls after him, his voice echoing as he defiantly glances around. Meanwhile, a dripping noise serves as the backdrop to the Dude, now sitting in the bathtub, his expression vacant and unfocused. He grips a joint between his fingers, while a washcloth is draped over his head. His eyes drop to his toes, which poke out from the soapy water, splayed against the far side of the tub. As the Dude’s outgoing message plays, the dripping noise becomes more pronounced, prompting him to look up with a glazed expression, his head swaying slightly. A string held by one of them quivers, at the other end of which a small animal scampers with excitement across the floor, just as two other men enter the scene behind him. The Dude's curiosity is piqued as he watches the small creature chatter away, but before he can react, the man with the string swiftly scoops up the marmot and hurls it, screaming, into the bathtub; the Dude lets out a scream in response. The marmot splashes wildly, water flying everywhere as it bites at the Dude in a frenzy born of fear and aggression. Having completed their task, the three men turn and begin to depart, reaching the Dude’s car, where the driver’s side exterior bears the marks of a raw scrape. A policeman approaches the Dude, handing him a door handle and an exterior rear-view mirror, all the while laughing and nodding in agreement with himself. The Dude, his face a mask of desolation, peers through the window at the officer, who rocks back on his heels, his laughter raucous but muffled by the barrier between them. Subsequently, the Dude, Walter, and Donny sit together at the bar, each occupied with their chosen distractions—the Dude with a White Russian, Walter nursing a beer, and Donny munching on beer nuts. Walter, his mood somber, gives a shake of his head as they rise to leave, leaving the Dude behind to sit morosely at the bar, his mind adrift. Into this scene walks a middle-aged man, amiable and ruggedly handsome, possibly resembling Sam Elliott, complete with a large Western-style mustache, denims, a yoked shirt, and a cowboy hat. This man is The Stranger, whose voice had narrated the opening of the movie. As he stands at the bar, he nods politely and waits for his drink, his crinkled eyes scanning the room with a sense of warmth and familiarity until they settle on the Dude. Still staring down at his drink, the Dude subtly shakes his head, acknowledging The Stranger’s presence. Their eyes meet, and the Dude seems to register just how out of place this cowboy figure appears in the setting, while the Stranger responds with a chuckle, full of indulgence, before pushing away from the bar, leaving the interaction suspended in time."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Lebowski stares at him, dumbstruck, while the Dude takes a hurried sip from his drink as Brandt hands him a letter-sized envelope distended by something inside. The Dude frowns, opens the envelope, and uncovers a smaller wad of gauze, which he unwraps to reveal a little toe with emerald green nail polish. Later, the Dude and Walter sit absently stirring their coffee at the counter, lost in thought. The Dude leaves, prompting Walter to call after him as a waitress enters, accompanied by a dripping noise. The Dude sits in the bathtub, stuporously staring at his toes protruding from the soapy water, a joint in hand and a washcloth draped over his head. Following a dripping noise, he looks up dazedly. A man enters with two others, holding a string tied to a small animal, which he then scoops up and tosses into the bathtub, leading the Dude to scream as the marmot splashes and bites in panic. The three men leave and reach the Dude's car, which has a scraped exterior; a policeman hands the Dude a door handle and mirror, laughing as the Dude watches, saddened, through the window. At the bar, the Dude sits morosely with a White Russian, Walter shakes his head sadly, and Donny eats beer nuts. As they leave, the amiable, craggily handsome Stranger, who is middle-aged and dressed in Western attire, nods while waiting for his drink. His eyes settle on the Dude, who, noticing the cowpoke's odd presence, shakes his head while the Stranger chuckles and departs."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Lebowski, a wealthy but seemingly disconnected businessman, stares at him, dumbstruck. The Dude, a laid-back slacker known for his easygoing nature, is encouraged and takes a hurried sip from his drink. Brandt, Lebowski's loyal and anxious assistant, is handing him a letter-sized envelope, which is distended by something inside. The Dude, frowning as he often does when pondering the unexpected, untucks its flap, takes out some cotton wadding, and unrolls it. The wadding, undone, reveals a smaller wad of gauze taped up inside. The Dude undoes the tape with his fingernails, stained slightly from previous endeavors, and starts to unroll the inner package. Between thumb and forefinger, the Dude holds up the contents of the package—a little toe, with emerald green nail polish that suggests a recent pedicure likely at a local salon. The Dude and Walter sit at the counter of a typical 24-hour diner, both staring off into space, both absently stirring their coffee with little clinking noises that echo in the quiet establishment. A waitress, a figure reminiscent of classical Americana, enters. The Dude has left frame; Walter, his Vietnam vet friend who often finds himself in needless confrontations, calls after him as he looks defiantly around, always on guard. A dripping noise follows, reminiscent of the earlier chaos. The Dude sits in the bathtub, staring stuporously, a joint pinched in one hand, a washcloth draped over his head as if to shield from his troubles. He stares at his toes, which protrude from the soapy water, splayed against the far side of the tub in idle relaxation. After the Dude's outgoing message on an outdated answering machine, we hear a dripping noise, and the Dude looks stuporously up, his head swaying dizzily. One of them, a member of a bizarre group entangled in The Dude's misadventures, holds a string at the other end of which a small animal skitters excitedly about the floor, as two other men enter behind him, their demeanor both menacing and absurd. The Dude looks curiously at the small, nattering animal before the man with the string scoops up the marmot, often mistaken for a ferret, and tosses it, screaming, into the bathtub; the Dude screams, caught off guard by the sudden intrusion. The marmot splashes frantically, biting at the Dude in a frenzy of fearful aggression, as the chaos envelops the small bathroom. The three men turn to leave and have reached the Dude's car, an old model bearing the scars of many misadventures, where the driver's side exterior has been scraped raw. A policeman hands the Dude a door handle and an exterior rear-view mirror, remnants of the car's former glory, laughing and agreeing broadly, while the Dude looks sadly through his window at the policeman rocking back on his heels, his raucous laughter muffled by the glass. The Dude, Walter, and Donny, their amiable but somewhat oblivious bowling teammate, sit at the bar, the Dude with a White Russian, his signature drink, Walter with a beer, and Donny eating beer nuts, a simple pleasure. Walter sadly shakes his head as they leave the Dude sitting morosely at the bar, and as he stares. He is middle-aged, amiable, craggily handsome—Sam Elliot, perhaps, with a large Western-style mustache and wearing denims, a yoked shirt, and a cowboy hat, embodying the archetype of the American cowboy. We recognize the voice of The Stranger, a mysterious narrator whose voice opened the movie, adding a touch of folklore to the story. The Stranger nods and, waiting for his drink, looks amiably around the bar, his presence both grounding and enigmatic. His crinkled eyes settle on the Dude, who, still staring down at his drink, shakes his head, reflecting the weight of his peculiar journey. The Dude looks at The Stranger as if just now noticing how out of place the cowpoke is, while the Stranger chuckles indulgently, embodying the timeless observer, and pushes off from the bar."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Lebowski stares at him dumbstruck. The Dude is encouraged and takes a hurried sip from his drink. Brandt is handing him a lettersized envelope which is distended by something inside. The Dude frowning untucks its flap takes out some cotton wadding and unrolls it. The wadding undone reveals a smaller wad of gauze taped up inside. The Dude undoes the tape with his fingernails and starts to unroll the inner package. Between thumb and forefinger the Dude holds up the contents of the packagea little toe with emerald green nail polish. The Dude and Walter sit at the counter both staring off into space both absently stirring their coffee with little clinking noises. A waitress enters. The Dude has left frame. Walter calls after him as he looks defiantly around. A dripping noise follows. The Dude sits in the bathtub staring stuporously. a joint pinched in one hand a washcloth draped over his head. He stares at his toes which protrude from the soapy water splayed against the far side of the tub. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. After the Dude's outgoing message we hear a dripping noise and the Dude looks stuporously up his head swaying. One of them holds a string at the other end of which a small animal skitters excitedly about the floor as two other men enter behind him. The Dude looks curiously at the small nattering animal before the man with the string scoops up the marmot and tosses it screaming into the bathtub. the Dude screams. The marmot splashes frantically biting at the Dude in a frenzy of fearful aggression. The three men turn to leave and have reached the Dude's car where the driver's side exterior has been scraped raw. A policeman hands the Dude a door handle and an exterior rearview mirror laughing and agreeing broadly while the Dude looks sadly through his window at the policeman rocking back on his heels his raucous laughter muffled by the glass. The Dude Walter and Donny sit at the bar the Dude with a White Russian Walter with a beer and Donny eating beer nuts. Walter sadly shakes his head as they leave the Dude sitting morosely at the bar and he stares. He is middleaged amiable craggily handsome. Sam Elliot perhaps with a large Westernstyle mustache and wearing denims a yoked shirt and a cowboy hat. We recognize the voice of The Stranger whose narration opened the movie. The Stranger nods and waiting for his drink looks amiably around the bar. His crinkled eyes settle on the Dude who still staring down at his drink shakes his head. The Dude looks at The Stranger as if just now noticing how out of place the cowpoke is while the Stranger chuckles indulgently and pushes off from the bar."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Lebowski stares at him dumbstruck. The Dude is encouraged and takes a hurried sip from his drink. Brandt is handing him a lettersized envelope which is distended by something inside. The Dude frowning untucks its flap takes out some cotton wadding and unrolls it. The wadding undone reveals a smaller wad of gauze taped up inside. The Dude undoes the tape with his fingernails and starts to unroll the inner package. Between thumb and forefinger the Dude holds up the contents of the packagea little toe with emerald green nail polish. The Dude and Walter sit at the counter both staring off into space both absently stirring their coffee with little clinking noises. A waitress enters. The Dude has left frame. Walter calls after him as he looks defiantly around. A dripping noise follows. The Dude sits in the bathtub staring stuporously. a joint pinched in one hand a washcloth draped over his head. He stares at his toes which protrude from the soapy water splayed against the far side of the tub. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. After the Dude's outgoing message we hear a dripping noise and the Dude looks stuporously up his head swaying. One of them holds a string at the other end of which a small animal skitters excitedly about the floor as two other men enter behind him. The Dude looks curiously at the small nattering animal before the man with the string scoops up the marmot and tosses it screaming into the bathtub. the Dude screams. The marmot splashes frantically biting at the Dude in a frenzy of fearful aggression. The three men turn to leave and have reached the Dude's car where the driver's side exterior has been scraped raw. A policeman hands the Dude a door handle and an exterior rearview mirror laughing and agreeing broadly while the Dude looks sadly through his window at the policeman rocking back on his heels his raucous laughter muffled by the glass. The Dude Walter and Donny sit at the bar the Dude with a White Russian Walter with a beer and Donny eating beer nuts. Walter sadly shakes his head as they leave the Dude sitting morosely at the bar and he stares. He is middleaged amiable craggily handsome. Sam Elliot perhaps with a large Westernstyle mustache and wearing denims a yoked shirt and a cowboy hat. We recognize the voice of The Stranger whose narration opened the movie. The Stranger nods and waiting for his drink looks amiably around the bar. His crinkled eyes settle on the Dude who still staring down at his drink shakes his head. The Dude looks at The Stranger as if just now noticing how out of place the cowpoke is while the Stranger chuckles indulgently and pushes off from the bar."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Lebowski stares at him dumbstruck. The Dude is encouraged and takes a hurried sip from his drink. Brandt is handing him a lettersized envelope which is distended by something inside. The Dude frowning untucks its flap takes out some cotton wadding and unrolls it. The wadding undone reveals a smaller wad of gauze taped up inside. The Dude undoes the tape with his fingernails and starts to unroll the inner package. Between thumb and forefinger the Dude holds up the contents of the packagea little toe with emerald green nail polish. The Dude and Walter sit at the counter both staring off into space both absently stirring their coffee with little clinking noises. Walter sadly shakes his head as they leave the Dude sitting morosely at the bar and he stares. He is middleaged amiable craggily handsome. Sam Elliot perhaps with a large Westernstyle mustache and wearing denims a yoked shirt and a cowboy hat. We recognize the voice of The Stranger whose narration opened the movie. The Stranger nods and waiting for his drink looks amiably around the bar. His crinkled eyes settle on the Dude who still staring down at his drink shakes his head. The Dude looks at The Stranger as if just now noticing how out of place the cowpoke is while the Stranger chuckles indulgently and pushes off from the bar."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Lebowski stares at him dumbstruck. The Dude is encouraged and takes a hurried sip from his drink. Brandt is handing him a lettersized envelope which is distended by something inside. The Stranger nods and waiting for his drink looks amiably around the bar. His crinkled eyes settle on the Dude who still staring down at his drink shakes his head. The Dude looks at The Stranger as if just now noticing how out of place the cowpoke is while the Stranger chuckles indulgently and pushes off from the bar."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Henderson blinks at her, bewildered. The Cat is motivated and takes a quick bite from its sandwich. Vincent is giving her a postcard-sized carton, which is bulging with something inside. The Cat, scowling, loosens its lid, pulls out some wool stuffing, and unravels it. The stuffing, unfurled, exposes a smaller ball of yarn wrapped up inside. The Cat unwraps the yarn with its claws and starts to unwind the inner bundle. Between paw and claw, the Cat holds up the contents of the bundle--a little button, with sapphire blue thread. The Cat and Felix sit at the table, both gazing into the distance, both idly stirring their tea with soft clinking sounds. A chef appears. The Cat has left view; Felix shouts after it as he surveys defiantly around. A ticking noise ensues. The Cat sits in the armchair, gazing hazily, a feather clenched in one paw, a napkin draped over its head. It gazes at its paws, which stick out from the fluffy blanket, stretched against the other side of the armchair. After the Cat's outgoing tune, we hear a ticking noise, and the Cat looks hazily up, its head rocking. One of them grips a ribbon at the other end of which a tiny creature scampers eagerly across the rug, as two other people come in behind him. The Cat looks inquisitively at the tiny, chatterbox creature before the person with the ribbon lifts up the hamster and flings it, shrieking, into the armchair; the Cat yelps. The hamster flails wildly, nibbling at the Cat in a rush of frantic defense. The trio turns to exit and have reached the Cat's bicycle, where the rider's side exterior has been scratched heavily. A firefighter gives the Cat a steering wheel and a side-view mirror, chuckling and nodding heartily, while the Cat gazes wistfully through its sunglasses at the firefighter rocking back on his toes, his boisterous laughter muted by the lenses. The Cat, Felix, and Marty sit at the café, the Cat with a Chocolate Milk, Felix with a lemonade, and Marty munching potato chips. Felix mournfully nods as they leave the Cat sitting gloomily at the café, and it gazes. It is middle-aged, friendly, ruggedly charming--Tim Robbins, perhaps, with a big Sherlock-style monocle and wearing overalls, a pleated shirt, and a fedora. We recognize the voice of The Wanderer whose monologue began the opera. The Wanderer nods and, awaiting his meal, glances kindly around the café. His crinkly stare rests on the Cat, who, still gazing down at its meal, nods its head. The Cat glances at The Wanderer as if just now realizing how misplaced the nomad is, while the Wanderer chuckles warmly and departs from the café."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Lebowski is shocked as The Dude, encouraged, takes a sip of his drink and receives an envelope from Brandt. Inside, The Dude finds a toe with green nail polish. Later, The Dude and Walter are lost in thought at a counter, stirring their coffee. A dripping noise is heard as The Dude sits in a bathtub, spaced out, with a joint in hand. Suddenly, men toss a marmot into the tub, causing chaos. The Dude's car is damaged, and a policeman mockingly presents him with a door handle and mirror. At the bar, The Dude, Walter, and Donny sit silently, each with their drinks. Walter sadly leaves The Dude at the bar. The Stranger, narrator of the film, observes The Dude, who acknowledges the Stranger's out-of-place presence. The Stranger chuckles and leaves, adding an element of bemusement to the scene."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The Dude looks at The Stranger as if just now noticing how out of place the cowpoke is while the Stranger chuckles indulgently and pushes off from the bar His crinkled eyes settle on the Dude who still staring down at his drink shakes his head The Stranger nods and waiting for his drink looks amiably around the bar We recognize the voice of The Stranger whose narration opened the movie Sam Elliot perhaps with a large Westernstyle mustache and wearing denims a yoked shirt and a cowboy hat He is middleaged amiable craggily handsome Walter sadly shakes his head as they leave the Dude sitting morosely at the bar and he stares The Dude Walter and Donny sit at the bar the Dude with a White Russian Walter with a beer and Donny eating beer nuts A policeman hands the Dude a door handle and an exterior rearview mirror laughing and agreeing broadly while the Dude looks sadly through his window at the policeman rocking back on his heels his raucous laughter muffled by the glass The three men turn to leave and have reached the Dude's car where the driver's side exterior has been scraped raw The marmot splashes frantically biting at the Dude in a frenzy of fearful aggression the Dude screams The Dude looks curiously at the small nattering animal before the man with the string scoops up the marmot and tosses it screaming into the bathtub One of them holds a string at the other end of which a small animal skitters excitedly about the floor as two other men enter behind him After the Dude's outgoing message we hear a dripping noise and the Dude looks stuporously up his head swaying He stares at his toes which protrude from the soapy water splayed against the far side of the tub a joint pinched in one hand a washcloth draped over his head The Dude sits in the bathtub staring stuporously A dripping noise follows Walter calls after him as he looks defiantly around The Dude has left frame A waitress enters The Dude and Walter sit at the counter both staring off into space both absently stirring their coffee with little clinking noises Between thumb and forefinger the Dude holds up the contents of the packagea little toe with emerald green nail polish The Dude undoes the tape with his fingernails and starts to unroll the inner package The wadding undone reveals a smaller wad of gauze taped up inside The Dude frowning untucks its flap takes out some cotton wadding and unrolls it Brandt is handing him a lettersized envelope which is distended by something inside The Dude is encouraged and takes a hurried sip from his drink Lebowski stares at him dumbstruck"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The Dude is encouraged and takes a hurried sip from his drink Lebowski stares at him dumbstruck The Dude frowning untucks its flap takes out some cotton wadding and unrolls it Brandt is handing him a lettersized envelope which is distended by something inside The Dude undoes the tape with his fingernails and starts to unroll the inner package The wadding undone reveals a smaller wad of gauze taped up inside The Dude and Walter sit at the counter both staring off into space both absently stirring their coffee with little clinking noises Between thumb and forefinger the Dude holds up the contents of the packagea little toe with emerald green nail polish The Dude has left frame A waitress enters A dripping noise follows Walter calls after him as he looks defiantly around a joint pinched in one hand a washcloth draped over his head The Dude sits in the bathtub staring stuporously After the Dude's outgoing message we hear a dripping noise and the Dude looks stuporously up his head swaying He stares at his toes which protrude from the soapy water splayed against the far side of the tub The Dude looks curiously at the small nattering animal before the man with the string scoops up the marmot and tosses it screaming into the bathtub One of them holds a string at the other end of which a small animal skitters excitedly about the floor as two other men enter behind him The marmot splashes frantically biting at the Dude in a frenzy of fearful aggression the Dude screams A policeman hands the Dude a door handle and an exterior rearview mirror laughing and agreeing broadly while the Dude looks sadly through his window at the policeman rocking back on his heels his raucous laughter muffled by the glass The three men turn to leave and have reached the Dude's car where the driver's side exterior has been scraped raw Walter sadly shakes his head as they leave the Dude sitting morosely at the bar and he stares The Dude Walter and Donny sit at the bar the Dude with a White Russian Walter with a beer and Donny eating beer nuts Sam Elliot perhaps with a large Westernstyle mustache and wearing denims a yoked shirt and a cowboy hat He is middleaged amiable craggily handsome The Stranger nods and waiting for his drink looks amiably around the bar We recognize the voice of The Stranger whose narration opened the movie The Dude looks at The Stranger as if just now noticing how out of place the cowpoke is while the Stranger chuckles indulgently and pushes off from the bar His crinkled eyes settle on the Dude who still staring down at his drink shakes his head"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "After the Dude's outgoing message we hear a dripping noise and the Dude looks stuporously up his head swaying One of them holds a string at the other end of which a small animal skitters excitedly about the floor as two other men enter behind him The Dude looks curiously at the small nattering animal before the man with the string scoops up the marmot and tosses it screaming into the bathtub the Dude screams The marmot splashes frantically biting at the Dude in a frenzy of fearful aggression The three men turn to leave and have reached the Dude's car where the driver's side exterior has been scraped raw A policeman hands the Dude a door handle and an exterior rearview mirror laughing and agreeing broadly while the Dude looks sadly through his window at the policeman rocking back on his heels his raucous laughter muffled by the glass The Dude Walter and Donny sit at the bar the Dude with a White Russian Walter with a beer and Donny eating beer nuts Walter sadly shakes his head as they leave the Dude sitting morosely at the bar and he stares He is middleaged amiable craggily handsome Sam Elliot perhaps with a large Westernstyle mustache and wearing denims a yoked shirt and a cowboy hat We recognize the voice of The Stranger whose narration opened the movie The Stranger nods and waiting for his drink looks amiably around the bar His crinkled eyes settle on the Dude who still staring down at his drink shakes his head The Dude looks at The Stranger as if just now noticing how out of place the cowpoke is while the Stranger chuckles indulgently and pushes off from the bar Lebowski stares at him dumbstruck The Dude is encouraged and takes a hurried sip from his drink Brandt is handing him a lettersized envelope which is distended by something inside The Dude frowning untucks its flap takes out some cotton wadding and unrolls it The wadding undone reveals a smaller wad of gauze taped up inside The Dude undoes the tape with his fingernails and starts to unroll the inner package Between thumb and forefinger the Dude holds up the contents of the packagea little toe with emerald green nail polish The Dude and Walter sit at the counter both staring off into space both absently stirring their coffee with little clinking noises A waitress enters The Dude has left frame Walter calls after him as he looks defiantly around A dripping noise follows The Dude sits in the bathtub staring stuporously a joint pinched in one hand a washcloth draped over his head He stares at his toes which protrude from the soapy water splayed against the far side of the tub"
        }
      ]
    }
  ]
}