{
  "ground_truth": "He is gone. She strides toward us, naked under a robe which she is just cinching shut. The Dude stops between two albums and pulls out an album with a worn sleeve. On it is the group's name, Autobahn, the album name, Nagelbett, and a picture of three young Germans, their foreheads looming below slicked-back hair, gazing upward in thin-lipped epiphany. They are wearing severe but modishly retro suits. A bed of nails is the only set dressing on the cover. The Dude and Walter are pulling up in front of a dilapidated house sitting on a scrubby lot. Parked incongruously in front of the house is a brand new red Corvette. It is opened by a matronly Spanish woman. Larry, a fifteen-year-old, looks at the two men. Walter pops the latches on his attache case and takes out the homework, which is now in a ziploc bag. He holds it out at arm's length, displaying it to Larry. Walter is still holding out the homework. Throughout Walter has been staring at Larry with the homework extended towards him. As he shoves the homework back in the attache case, he is heading for the door. Walter is striding down the lawn with his attache case like an enraged encyclopedia salesman, without looking back at the Dude, who follows. He pops the Dude's trunk, flings in the briefcase, and takes out a tire iron. CRASH! He swings the crowbar into the windshield, which shatters. CRASH! He takes out the driver's window. Lights are going on in houses down the street. A man in a sleeveless T-shirt and boxer shorts has run over behind Walter and grabbed him from behind on a backswing of the crowbar. He wrestles the crowbar away from the startled Walter. He finishes hammering, rises, and grabs a straight-backed chair that stands nearby. When the door is opened—outwards, the chair clatters to the floor. Out of the blackness something is falling toward us. It is a woman, falling in slow motion, her limbs flailing, her mouth contorted by either fear or ecstasy. She is topless. She falls past the camera, leaving blackness, then after a beat reappears, rising into the night sky. A crowd of mostly tanned middle-aged men with blow-dried hair, wearing jogging outfits and other expensively casual attire, are blanket-tossing the squealing young woman in nightmarish slow motion. It is a party, lit by festive beach lights and standing kerosene heaters. A man walks towards the camera through the pools of beach light. He is handsome, fiftyish, wearing cotton twill pants and a Turnbull & Asher shirt with a foulard knotted at the neck. Behind him, the woman rises and falls, appears and disappears.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He is departed. She marches toward us, unclothed under a gown which she is just fastening shut. The Dude halts between two records and extracts an album with a worn cover. On it is the band's designation, Autobahn, the album title, Nagelbett, and an image of three youthful Germans, their brows looming below slicked-back hair, gazing upward in thin-lipped revelation. They are donning severe but stylishly retro attire. A bed of nails is the only set dressing on the cover. The Dude and Walter are pulling up in front of a ramshackle dwelling sitting on a scrubby lot. Parked incongruously in front of the dwelling is a brand new red Corvette. It is opened by a matronly Spanish woman. Larry, a fifteen-year-old, regards the two men. Walter snaps the latches on his briefcase and removes the homework, which is now in a ziploc pouch. He holds it out at arm's length, exhibiting it to Larry. Walter is still holding out the homework. Throughout Walter has been staring at Larry with the homework extended towards him. As he thrusts the homework back in the briefcase, he is heading for the door. Walter is striding down the lawn with his briefcase like an enraged encyclopedia merchant, without looking back at the Dude, who follows. He pops the Dude's trunk, flings in the briefcase, and takes out a tire iron. CRASH! He swings the crowbar into the windshield, which shatters. CRASH! He demolishes the driver's window. Lights are going on in residences down the street. A man in a sleeveless T-shirt and boxer shorts has sprinted over behind Walter and seized him from behind on a backswing of the crowbar. He wrenches the crowbar away from the startled Walter. He finishes hammering, rises, and grabs a straight-backed chair that stands nearby. When the entry is opened—outwards, the chair clatters to the floor. Out of the blackness something is descending toward us. It is a woman, falling in gradual motion, her limbs flailing, her mouth twisted by either fear or ecstasy. She is topless. She falls past the camera, leaving blackness, then after a beat reappears, ascending into the night sky. A gathering of mostly bronzed middle-aged men with blow-dried hair, wearing jogging ensembles and other expensively casual attire, are blanket-tossing the squealing young woman in nightmarish slow motion. It is a gathering, lit by festive beach lights and standing kerosene heaters. A man strides towards the camera through the pools of beach light. He is attractive, fiftyish, wearing cotton twill trousers and a Turnbull & Asher shirt with a foulard knotted at the collar. Behind him, the woman rises and falls, appears and disappears."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He has gone. We are strode toward by her, naked under a robe which is just being cinched shut. An album with a worn sleeve is pulled out by the Dude from between two albums. The group's name, Autobahn, the album name, Nagelbett, and a picture of three young Germans, their foreheads looming below slicked-back hair, gazing upward in thin-lipped epiphany, are on it. Severe but modishly retro suits are worn by them. The only set dressing on the cover is a bed of nails. The Dude and Walter pull up in front of a dilapidated house sitting on a scrubby lot. A brand new red Corvette is parked incongruously in front of the house. A matronly Spanish woman opens it. The two men are looked at by Larry, a fifteen-year-old. The latches on his attache case are popped by Walter, who takes out the homework, now in a ziploc bag. It is held out at arm's length by him, displaying it to Larry. The homework is still held out by Walter. Throughout, Larry is stared at by Walter with the homework extended towards him. As the homework is shoved back into the attache case by him, the door is headed for by him. The lawn is strode down by Walter with his attache case like an enraged encyclopedia salesman, without looking back at the Dude, who follows. The Dude's trunk is popped by him, the briefcase flung in, and a tire iron is taken out. CRASH! The crowbar is swung by him into the windshield, shattering it. CRASH! The driver's window is taken out by him. Houses down the street have lights going on in them. Walter is run over behind by a man in a sleeveless T-shirt and boxer shorts, and he grabs the backswing of the crowbar from behind. The crowbar is wrestled away from the startled Walter by him. Hammering is finished by him; he rises and grabs a straight-backed chair that stands nearby. When the door is opened—outwards, the chair clatters to the floor. Toward us, something is falling out of the blackness. A woman is falling in slow motion, her limbs flailing, her mouth contorted by either fear or ecstasy. She is topless. The camera is fallen past by her, leaving blackness; then, after a beat, she reappears, rising into the night sky. A crowd of mostly tanned middle-aged men with blow-dried hair, wearing jogging outfits and other expensively casual attire, are blanket-tossing the squealing young woman in nightmarish slow motion. A party is being held, lit by festive beach lights and standing kerosene heaters. The camera is walked towards by a man through the pools of beach light. He is handsome, fiftyish, wearing cotton twill pants and a Turnbull & Asher shirt with a foulard knotted at the neck. Behind him, the woman rises and falls, appears, and disappears."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He is gone. She approaches, naked under a robe she's cinching shut. The Dude pauses at two albums, selecting one with a worn sleeve. It features Autobahn, titled Nagelbett, with three young Germans in sleek retro suits below slicked-back hair, gazing upwards. A bed of nails decorates the cover. The Dude and Walter arrive at a rundown house with a new red Corvette out front, opened by a matronly Spanish woman. Larry, a fifteen-year-old, observes the men. Walter opens his case, extracting homework in a ziploc bag, displaying it to Larry. Walter glares at Larry while holding out the homework, then puts it away, heading for the door. Walter strides down the lawn with his case like an irate encyclopedia salesman, ignoring the Dude, who follows. He opens the Dude's trunk, tosses in the briefcase, and grabs a tire iron. CRASH! He smashes the windshield. CRASH! He hits the driver's window. Lights illuminate houses down the street. A man in a sleeveless shirt and boxers runs over, grabbing Walter mid-swing, wrenching the crowbar from him. He finishes hammering and grabs a nearby chair. When the door opens outwards, the chair falls. In the darkness, a woman falls slowly, limbs flailing, mouth twisted in fear or ecstasy. She is topless, falls past the camera, vanishing into blackness, then reappears, rising into the sky. Tanned, middle-aged men in jogging outfits blanket-toss the squealing woman in slow motion. It's a party, lit by beach lights and kerosene heaters. A handsome, fiftyish man in cotton twill pants and a Turnbull & Asher shirt approaches through the beach lights, a foulard knotted at his neck. Behind him, the woman rises and falls, appearing and disappearing."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He is gone. She strides toward us, naked under a just-cinched robe. The Dude stops, pulls an album with a worn sleeve, featuring Autobahn's \"Nagelbett\" and three young Germans in retro suits, with a bed of nails on the cover. The Dude and Walter arrive at a dilapidated house with a new red Corvette. A Spanish woman opens the door. Larry, fifteen, looks at the men. Walter displays homework in a Ziploc bag to Larry, then returns it to his attache case and heads to the door. Walter strides down the lawn, tosses his briefcase into the Dude's trunk, and retrieves a tire iron. CRASH! He smashes the windshield and driver's window. A man in a sleeveless T-shirt grabs Walter, takes the crowbar, and finishes hammering. The door opens, and a chair falls. A topless woman falls in slow motion, flailing, then rises, blanket-tossed by tanned middle-aged men. It's a party with beach lights and heaters. A handsome, fiftyish man in cotton twill pants and a Turnbull & Asher shirt walks toward the camera as the woman rises and falls behind him."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He is no longer here; he is gone. In his absence, she confidently strides toward us, wearing nothing beneath a loose robe, which she is in the midst of cinching shut with deliberate care. The Dude pauses thoughtfully between two albums, and with a discerning eye, he selects an album encased in a sleeve that shows signs of wear and age. Prominently displayed on its cover is the group's name, Autobahn, alongside the album's title, Nagelbett. The artwork features a striking image of three young Germans, each with their foreheads projecting beneath slicked-back hair, their expressions fixed in an upward gaze filled with thin-lipped epiphany. They are clad in severe yet stylishly retro suits that add to their enigmatic aura. The only element adorning the cover, serving as set dressing, is a stark bed of nails.\n\nMeanwhile, the Dude and Walter make their approach, pulling up in front of a house that is in a state of disrepair, situated on a scrubby, unkempt lot. In stark contrast to its surroundings, a brand new, eye-catching red Corvette is parked conspicuously in front of the house. As they arrive, a matronly Spanish woman opens the door. Inside, Larry, a fifteen-year-old boy, studies the two men with curiosity. Walter efficiently pops the latches on his attache case, methodically extracting the homework, now stored securely in a ziploc bag. He extends the homework at arm's length, displaying it prominently for Larry to see. Walter remains in this position, holding out the homework, his gaze unwaveringly fixed on Larry. Eventually, he begins to shove the homework back into the attache case while already making his way toward the exit. Walter strides purposefully down the lawn, carrying his attache case like an enraged encyclopedia salesman, never glancing back at the Dude, who trails behind him. \n\nArriving at the Dude's car, he swiftly opens the trunk, tossing in the briefcase, and retrieves a tire iron. With a resounding CRASH! he swings the crowbar into the car's windshield, shattering it dramatically. CRASH! The driver's side window meets the same fate. In response to the commotion, lights flicker on in houses lining the street. A man, dressed in a sleeveless T-shirt and boxer shorts, quickly rushes over, intercepting Walter from behind during an aggressive backswing of the crowbar. He wrestles the crowbar from a startled Walter's grasp. After finishing his hammering, he stands and grabs a nearby straight-backed chair. When the door is opened outward, the chair clatters noisily to the floor. \n\nEmerging from the blackness, something falls in slow motion towards us. It is a woman, her descent marked by flailing limbs and a mouth distorted by what appears to be either fear or ecstasy. She is topless. As she falls past the camera, she momentarily vanishes into the darkness, only to reappear unexpectedly, rising into the night sky. Nearby, a crowd, composed mainly of tanned middle-aged men with blow-dried hair, dressed in jogging outfits and other expensive casual attire, are in the process of blanket-tossing the squealing young woman in a surreal slow-motion sequence. A lively party atmosphere pervades the scene, illuminated by festive beach lights and standing kerosene heaters. A man strides purposefully towards the camera, moving through the pools of beach light with ease. He is strikingly handsome, around fifty, dressed in cotton twill pants paired with a Turnbull & Asher shirt, a foulard impeccably knotted at his neck. Behind him, the woman continues her rise and fall, appearing and disappearing in a mesmerizing rhythm."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He is no longer present in this space; he has departed. During his absence, she confidently makes her way towards us, elegantly wearing nothing beneath a loose-fitting robe, which she is in the process of carefully cinching shut with deliberate and attentive motions. The Dude pauses thoughtfully between two albums, and after a moment of consideration, he selects an album encased in a well-worn sleeve, showing clear signs of age and use. Prominently featured on its cover is the group's name, Autobahn, alongside the album's title, Nagelbett. The artwork offers a striking and vivid image of three young Germans, each with foreheads prominently projecting beneath slicked-back hair, their expressions collectively fixed in an upward gaze filled with thin-lipped epiphany. They are dressed in severe yet stylishly retro suits that contribute significantly to their enigmatic and intriguing aura. The only other element adorning the cover, serving as set dressing, is a stark and unsettling bed of nails.\n\nMeanwhile, the Dude and Walter steadily make their approach, pulling up in front of a house that is visibly in a state of disrepair, situated on a scrubby and unkempt lot. In stark contrast to its dilapidated surroundings, a brand new, eye-catching red Corvette is conspicuously parked right in front of the house. As they make their arrival, a matronly Spanish woman opens the door to meet them. Inside the house, Larry, a fifteen-year-old boy, observes the two men with a curious gaze. Walter efficiently pops the latches on his attache case, methodically and carefully extracting the homework, now securely stored within a ziploc bag. He extends the homework at arm's length, prominently displaying it for Larry to see. Walter maintains this position, holding out the homework, his gaze unwaveringly fixed on Larry. Eventually, he begins to shove the homework back into the attache case while already making his move toward the exit. Walter strides purposefully down the lawn, carrying his attache case like an enraged encyclopedia salesman, never once glancing back at the Dude, who follows behind him closely.\n\nUpon arriving at the Dude's vehicle, he swiftly proceeds to open the trunk, tossing the briefcase inside with casual ease, and retrieves a tire iron. With a resounding CRASH!, he swings the crowbar into the car's windshield, shattering it in a dramatic and destructive fashion. CRASH! The driver's side window soon meets the same fate. In response to the commotion, lights flicker on in houses lining the street. A man, dressed only in a sleeveless T-shirt and boxer shorts, quickly rushes over, intercepting Walter from behind during an aggressive backswing of the crowbar. He wrestles the crowbar from a startled Walter's grasp, taking control of the situation. After finishing his hammering, he stands and grabs a nearby straight-backed chair. When the door is opened outward, the chair clatters noisily to the floor, creating an additional layer of chaos.\n\nEmerging from the blackness, something falls in slow motion towards us. It is a woman, her rapid descent marked vividly by flailing limbs and a mouth distorted by what appears to be either fear or sheer ecstasy. She is topless, adding to the surreal nature of the scene. As she falls past the camera, she momentarily vanishes into the enveloping darkness, only to reappear unexpectedly, rising into the night sky. Nearby, a crowd, composed mainly of tanned middle-aged men with blow-dried hair, dressed carefully in jogging outfits and other expensive casual attire, are in the process of blanket-tossing the squealing young woman in a surreal slow-motion sequence that seems almost dreamlike. A lively party atmosphere pervades the entire scene, illuminated by festive beach lights and standing kerosene heaters that add warmth and vibrancy. A man strides purposefully towards the camera, moving effortlessly through the pools of beach light with a natural ease. He is strikingly handsome, around fifty years old, dressed in cotton twill pants paired with an elegant Turnbull & Asher shirt, a foulard impeccably knotted at his neck. Behind him, the woman continues her entrancing rise and fall, appearing and disappearing in a mesmerizing and rhythmic pattern."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He is now absent. She walks confidently toward us, her robe loosely hanging over her bare skin, which she proceeds to cinch shut with deliberate precision. The Dude, situated between two sections of albums, carefully selects one, its sleeve noticeably worn with age. The album cover displays the group's name, Autobahn, and album name, Nagelbett, along with a striking image of three youthful Germans. Their foreheads, slicked back with styled hair, project an upward-focused expression of thin-lipped epiphany. They don severe yet stylishly retro suits, while a bed of nails serves as the sole piece of set design on the cover. Transitioning to the Dude and Walter, they arrive and stop their vehicle in front of a run-down house sitting on a sparse plot of land. A striking contrast to the scene is presented by a brand new red Corvette, seemingly out of place, parked in front of the house. A matronly Spanish woman opens the door, revealing Larry, a fifteen-year-old, who fixes his gaze on the two men. Walter, with a decisive motion, unclasps the latches of his attache case and retrieves the homework, now encased in a protective Ziploc bag. He extends it to arm's length, presenting it purposefully to Larry. Walter maintains this posture, unwavering, his gaze locked on Larry as he continues to hold out the homework. As he retracts the homework, securing it back into the attache case, he pivots toward the door, his movements swift. Walter strides purposefully down the lawn, his attache case in hand, adopting the demeanor of an agitated encyclopedia salesman, choosing not to glance back at the Dude, who trails behind. Reaching the Dude's vehicle, he opens the trunk, hurls the briefcase inside, and retrieves a tire iron in one swift movement. With a powerful swing, CRASH! the crowbar connects with the windshield, which shatters under the impact. CRASH! He follows with a strike to the driver's window, obliterating it. Lights flicker on in the surrounding houses, sensing the commotion. A man clad only in a sleeveless T-shirt and boxer shorts rushes over and intercepts Walter from behind as he prepares for another swing of the crowbar. He struggles with Walter, wresting the crowbar from his grasp, who stands momentarily startled. The man finishes the hammering, rises, then seizes a straight-backed chair standing nearby. When the door swings open—outwards—the chair tumbles to the ground with a clatter. Out of the void, something descends towards us; it's a woman, captured in slow motion, her limbs spiraling, her mouth twisted by an expression of either terror or elation. She is without a top. As she tumbles past the camera into the darkness, there is a pause, and then she re-emerges, ascending into the night air. Encircling her is a gathering of mostly tanned, middle-aged men with blow-dried hair, clad in jogging suits and other luxurious casual wear, who are tossing the laughing young woman upward in a distressingly slow-motion manner. The scene reveals itself as a party, illuminated by lively beach lights and kerosene heaters standing throughout. A man directs his steps toward the camera, navigating through pools of beach light. He is attractive, seemingly in his fifties, dressed in cotton twill pants and a Turnbull & Asher shirt, a foulard tied neatly at his neck. Behind him, the woman continues her rise and fall, repeatedly disappearing and reappearing in the frame."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "She approaches us, cinching her robe shut. Meanwhile, the Dude examines an album titled \"Nagelbett\" by Autobahn, featuring three young Germans in retro suits posed with a bed of nails. The Dude and Walter arrive at a rundown house with a new red Corvette parked outside. They are greeted by a matronly Spanish woman, and Walter presents Larry, a fifteen-year-old, with his homework enclosed in a ziplock bag. After an intense stare, Walter shoves the homework back into his attache case and heads for the door, striding down the lawn with the Dude following. Walter retrieves a tire iron from the Dude's trunk and smashes a Corvette windshield, followed by the driver's window, causing lights to flick on in neighboring houses. A man in a sleeveless T-shirt and boxers intervenes, disarming Walter. Amidst the chaos, a topless woman is being blanket-tossed at a beach party attended by middle-aged men in casual attire. A dapper man in cotton twill pants and a Turnbull & Asher shirt moves toward the camera, while the woman continues to rise and fall in slow motion."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He is gone. She strides toward us, naked under a robe which she is just cinching shut, reminiscent of a character in a classic Hollywood noir film, exuding a mysterious allure. The Dude stops between two albums and pulls out an album with a worn sleeve. On it is the group's name, Autobahn, a fictional German band inspired by real techno pioneers Kraftwerk, the album name, Nagelbett, translating to 'bed of nails' in English, and a picture of three young Germans, their foreheads looming below slicked-back hair, gazing upward in thin-lipped epiphany, evoking the austere aesthetic of 1970s European avant-garde music. They are wearing severe but modishly retro suits, a nod to the minimalist fashion of the era. A bed of nails is the only set dressing on the cover, symbolizing the harsh industrial soundscape of their music. The Dude and Walter are pulling up in front of a dilapidated house sitting on a scrubby lot, indicating the economic downturn in the neighborhood. Parked incongruously in front of the house is a brand new red Corvette, a symbol of wealth amidst poverty. It is opened by a matronly Spanish woman, perhaps the housekeeper or caretaker, adding a touch of cultural diversity. Larry, a fifteen-year-old, looks at the two men with the curiosity of youth facing the adult world. Walter pops the latches on his attache case, reminiscent of those carried by business executives, and takes out the homework, which is now in a ziploc bag, protecting it from the elements. He holds it out at arm's length, displaying it to Larry, like evidence in a courtroom. Walter is still holding out the homework. Throughout Walter has been staring at Larry with the homework extended towards him, an act of confrontation or accusation. As he shoves the homework back in the attache case, he is heading for the door, determined and relentless. Walter is striding down the lawn with his attache case like an enraged encyclopedia salesman, without looking back at the Dude, who follows, suggesting their tense but unbreakable partnership. He pops the Dude's trunk, flings in the briefcase, and takes out a tire iron, an improvised tool of justice or destruction. CRASH! He swings the crowbar into the windshield, which shatters with a dramatic finality. CRASH! He takes out the driver's window, an act of rebellion against perceived injustice. Lights are going on in houses down the street, a neighborhood waking to unexpected chaos. A man in a sleeveless T-shirt and boxer shorts, the casual uniform of someone taken by surprise at home, has run over behind Walter and grabbed him from behind on a backswing of the crowbar. He wrestles the crowbar away from the startled Walter, playing the unexpected hero. He finishes hammering, rises, and grabs a straight-backed chair that stands nearby, reminiscent of impromptu weapons in a bar fight. When the door is opened—outwards, the chair clatters to the floor, signaling an interrupting change. Out of the blackness something is falling toward us. It is a woman, falling in slow motion, her limbs flailing, her mouth contorted by either fear or ecstasy, a surreal image of vulnerability or release at a lavish party. She is topless, adding a brazen contrast to the decorum of the surrounding scene. She falls past the camera, leaving blackness, then after a beat reappears, rising into the night sky, as if in a dreamlike ascent or ritual. A crowd of mostly tanned middle-aged men with blow-dried hair, wearing jogging outfits and other expensively casual attire, indicative of a wealthy leisure class, are blanket-tossing the squealing young woman in nightmarish slow motion, a strange practice that blurs the line between entertainment and exploitation. It is a party, lit by festive beach lights and standing kerosene heaters, hinting at a luxurious beachfront location. A man walks towards the camera through the pools of beach light. He is handsome, fiftyish, wearing cotton twill pants and a Turnbull & Asher shirt, known for high-end men's fashion, with a foulard knotted at the neck, suggesting sophistication and attention to detail. Behind him, the woman rises and falls, appears and disappears, a mesmerizing focal point that underscores the surreal atmosphere of the gathering."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He is gone. She strides toward us naked under a robe which she is just cinching shut. The Dude stops between two albums and pulls out an album with a worn sleeve. On it is the group's name Autobahn the album name Nagelbett and a picture of three young Germans their foreheads looming below slickedback hair gazing upward in thinlipped epiphany. They are wearing severe but modishly retro suits. A bed of nails is the only set dressing on the cover. The Dude and Walter are pulling up in front of a dilapidated house sitting on a scrubby lot. Parked incongruously. in front of the house is a brand new red Corvette. It is opened by a matronly Spanish woman. Larry a fifteenyearold looks at the two men. Walter pops the latches on his attache case and takes out the homework which is now in a ziploc bag. He holds it out at arm's length displaying it to Larry. Walter is still holding out the homework. Throughout. Walter has been staring at Larry with the homework extended towards him. As he shoves the homework back in the attache case he is heading for the door. Walter is striding down the lawn with his attache case like an enraged encyclopedia salesman without looking back at the Dude who follows. He pops the Dude's trunk flings in the briefcase and takes out a tire iron. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. CRASH. He swings the crowbar into the windshield which shatters. CRASH. He takes out the driver's window. Lights are going on in houses down the street. A man in a sleeveless Tshirt and boxer shorts has run over behind Walter and grabbed him from behind on a backswing of the crowbar. He wrestles the crowbar away from the startled Walter. He finishes hammering rises and grabs a straightbacked chair that stands nearby. When the door is opened—outwards the chair clatters to the floor. Out of the blackness something is falling toward us. It is a woman falling in slow motion her limbs flailing her mouth contorted by either fear or ecstasy. She is topless. She falls past the camera leaving blackness. then after a beat reappears rising into the night sky. A crowd of mostly tanned middleaged men with blowdried hair wearing jogging outfits and other expensively casual attire are blankettossing the squealing young woman in nightmarish slow motion. It is a party lit by festive beach lights and standing kerosene heaters. A man walks towards the camera through the pools of beach light. He is handsome fiftyish wearing cotton twill pants and a Turnbull  Asher shirt with a foulard knotted at the neck. Behind him the woman rises and falls appears and disappears."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He is gone. She strides toward us naked under a robe which she is just cinching shut. The Dude stops between two albums and pulls out an album with a worn sleeve. On it is the group's name Autobahn the album name Nagelbett and a picture of three young Germans their foreheads looming below slickedback hair gazing upward in thinlipped epiphany. They are wearing severe but modishly retro suits. A bed of nails is the only set dressing on the cover. The Dude and Walter are pulling up in front of a dilapidated house sitting on a scrubby lot. Parked incongruously. in front of the house is a brand new red Corvette. It is opened by a matronly Spanish woman. Larry a fifteenyearold looks at the two men. Walter pops the latches on his attache case and takes out the homework which is now in a ziploc bag. He holds it out at arm's length displaying it to Larry. Walter is still holding out the homework. Throughout. Walter has been staring at Larry with the homework extended towards him. As he shoves the homework back in the attache case he is heading for the door. Walter is striding down the lawn with his attache case like an enraged encyclopedia salesman without looking back at the Dude who follows. He pops the Dude's trunk flings in the briefcase and takes out a tire iron. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. CRASH. He swings the crowbar into the windshield which shatters. CRASH. He takes out the driver's window. Lights are going on in houses down the street. A man in a sleeveless Tshirt and boxer shorts has run over behind Walter and grabbed him from behind on a backswing of the crowbar. He wrestles the crowbar away from the startled Walter. He finishes hammering rises and grabs a straightbacked chair that stands nearby. When the door is opened—outwards the chair clatters to the floor. Out of the blackness something is falling toward us. It is a woman falling in slow motion her limbs flailing her mouth contorted by either fear or ecstasy. She is topless. She falls past the camera leaving blackness. then after a beat reappears rising into the night sky. A crowd of mostly tanned middleaged men with blowdried hair wearing jogging outfits and other expensively casual attire are blankettossing the squealing young woman in nightmarish slow motion. It is a party lit by festive beach lights and standing kerosene heaters. A man walks towards the camera through the pools of beach light. He is handsome fiftyish wearing cotton twill pants and a Turnbull  Asher shirt with a foulard knotted at the neck. Behind him the woman rises and falls appears and disappears."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He is gone. She strides toward us naked under a robe which she is just cinching shut. The Dude stops between two albums and pulls out an album with a worn sleeve. On it is the group's name Autobahn the album name Nagelbett and a picture of three young Germans their foreheads looming below slickedback hair gazing upward in thinlipped epiphany. They are wearing severe but modishly retro suits. A bed of nails is the only set dressing on the cover. The Dude and Walter are pulling up in front of a dilapidated house sitting on a scrubby lot. Parked incongruously. in front of the house is a brand new red Corvette. It is opened by a matronly Spanish woman. It is a woman falling in slow motion her limbs flailing her mouth contorted by either fear or ecstasy. She is topless. She falls past the camera leaving blackness. then after a beat reappears rising into the night sky. A crowd of mostly tanned middleaged men with blowdried hair wearing jogging outfits and other expensively casual attire are blankettossing the squealing young woman in nightmarish slow motion. It is a party lit by festive beach lights and standing kerosene heaters. A man walks towards the camera through the pools of beach light. He is handsome fiftyish wearing cotton twill pants and a Turnbull  Asher shirt with a foulard knotted at the neck. Behind him the woman rises and falls appears and disappears."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He is gone. She strides toward us naked under a robe which she is just cinching shut. The Dude stops between two albums and pulls out an album with a worn sleeve. On it is the group's name Autobahn the album name Nagelbett and a picture of three young Germans their foreheads looming below slickedback hair gazing upward in thinlipped epiphany. It is a party lit by festive beach lights and standing kerosene heaters. A man walks towards the camera through the pools of beach light. He is handsome fiftyish wearing cotton twill pants and a Turnbull  Asher shirt with a foulard knotted at the neck. Behind him the woman rises and falls appears and disappears."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The cat has vanished. A rabbit trots toward our campfire, cloaked beneath a cape which she is just fastening closed. The ghost pauses between two paintings and extracts a painting with a torn frame. Displayed is the artist's pseudonym, Riverbank, the painting's title, Foggy Trail, and an image of three youthful penguins, their beaks towering beneath slicked-back feathers, peering skyward in thin-billed wonder. They are adorned in stark but fashionably vintage jackets. A cactus ensemble is the sole background on the artwork. The ghost and the scarecrow are idling in front of a crumbling castle perched on a rocky hill. Parked absurdly in front of the castle is a sparkling green motorcycle. It is approached by a rugged Australian man. Kevin, a twenty-year-old, glances at the pair. The scarecrow unclasps the locks on his toolbox and retrieves the manuscript, which is now in a paper bag. He extends it at arm's length, showcasing it to Kevin. The scarecrow continues to present the manuscript. Throughout, the scarecrow has been glaring at Kevin with the manuscript projected toward him. As he stuffs the manuscript back in the toolbox, he heads for the gate. The scarecrow is pacing down the meadow with his toolbox like an indignant travel writer, without turning back at the ghost, who lingers. He unlocks the ghost's suitcase, hurls in the toolbox, and retrieves a feather duster. WHACK! He slams the spatula into the windshield, which crumbles. WHACK! He demolishes the passenger window. Candles are flickering in windows down the block. A sailor in a polka-dot bandana and khaki shorts has dashed over beside the scarecrow and seized him from behind on a backstride of the spatula. He snatches the spatula away from the befuddled scarecrow. He concludes pounding, stands, and seizes a three-legged stool that rests nearby. When the gate is unlocked—outwards, the stool tumbles to the ground. Out of the shadows something is cascading toward us. It is a peacock, descending leisurely, its wings fluttering, its beak twisted by either terror or glee. It is featherless. It descends past the lens, leaving shadows, then after a moment re-emerges, soaring into the twilight sky. A gathering of predominantly bronzed elderly parrots with sleek feathers, dressed in swimming ensembles and other opulently informal attire, are rug-tossing the chirping young peacock in ghastly slow motion. It is a festival, illuminated by cheerful tree lanterns and standing gas lamps. A panda strolls towards the lens through the circles of tree light. He is charming, sixtyish, garbed in wool slacks and a Burlington & Croft tunic with a cravat tied at the collar. Behind him, the peacock ascends and descends, materializes and vanishes."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "He is gone. A woman strides toward us, naked under a robe she's cinching shut. The Dude stops and pulls out an album by Autobahn, titled Nagelbett, featuring three young Germans in retro suits. The Dude and Walter arrive at a dilapidated house with a new red Corvette outside. A matronly Spanish woman opens the door, and they meet Larry, a fifteen-year-old. Walter shows Larry homework in a ziploc bag and then angrily puts it back in his case. Leaving, Walter strides down the lawn with the Dude following, pops the trunk, and takes a tire iron. CRASH! He smashes the car's windshield and window before a man in a T-shirt and boxer shorts wrestles the crowbar away. Meanwhile, a woman, topless and in slow motion, falls and rises in a blanket-toss at a party with mostly tanned middle-aged men. Under festive lights, a handsome, fiftyish man walks toward the camera while the woman continues to be tossed."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Behind him the woman rises and falls appears and disappears He is handsome fiftyish wearing cotton twill pants and a Turnbull  Asher shirt with a foulard knotted at the neck A man walks towards the camera through the pools of beach light It is a party lit by festive beach lights and standing kerosene heaters A crowd of mostly tanned middleaged men with blowdried hair wearing jogging outfits and other expensively casual attire are blankettossing the squealing young woman in nightmarish slow motion then after a beat reappears rising into the night sky She falls past the camera leaving blackness She is topless It is a woman falling in slow motion her limbs flailing her mouth contorted by either fear or ecstasy Out of the blackness something is falling toward us When the door is opened—outwards the chair clatters to the floor He finishes hammering rises and grabs a straightbacked chair that stands nearby He wrestles the crowbar away from the startled Walter A man in a sleeveless Tshirt and boxer shorts has run over behind Walter and grabbed him from behind on a backswing of the crowbar Lights are going on in houses down the street He takes out the driver's window CRASH He swings the crowbar into the windshield which shatters CRASH He pops the Dude's trunk flings in the briefcase and takes out a tire iron Walter is striding down the lawn with his attache case like an enraged encyclopedia salesman without looking back at the Dude who follows As he shoves the homework back in the attache case he is heading for the door Walter has been staring at Larry with the homework extended towards him Throughout Walter is still holding out the homework He holds it out at arm's length displaying it to Larry Walter pops the latches on his attache case and takes out the homework which is now in a ziploc bag Larry a fifteenyearold looks at the two men It is opened by a matronly Spanish woman in front of the house is a brand new red Corvette Parked incongruously The Dude and Walter are pulling up in front of a dilapidated house sitting on a scrubby lot A bed of nails is the only set dressing on the cover They are wearing severe but modishly retro suits On it is the group's name Autobahn the album name Nagelbett and a picture of three young Germans their foreheads looming below slickedback hair gazing upward in thinlipped epiphany The Dude stops between two albums and pulls out an album with a worn sleeve She strides toward us naked under a robe which she is just cinching shut He is gone"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "She strides toward us naked under a robe which she is just cinching shut He is gone On it is the group's name Autobahn the album name Nagelbett and a picture of three young Germans their foreheads looming below slickedback hair gazing upward in thinlipped epiphany The Dude stops between two albums and pulls out an album with a worn sleeve A bed of nails is the only set dressing on the cover They are wearing severe but modishly retro suits Parked incongruously The Dude and Walter are pulling up in front of a dilapidated house sitting on a scrubby lot It is opened by a matronly Spanish woman in front of the house is a brand new red Corvette Walter pops the latches on his attache case and takes out the homework which is now in a ziploc bag Larry a fifteenyearold looks at the two men Walter is still holding out the homework He holds it out at arm's length displaying it to Larry Walter has been staring at Larry with the homework extended towards him Throughout Walter is striding down the lawn with his attache case like an enraged encyclopedia salesman without looking back at the Dude who follows As he shoves the homework back in the attache case he is heading for the door CRASH He pops the Dude's trunk flings in the briefcase and takes out a tire iron CRASH He swings the crowbar into the windshield which shatters Lights are going on in houses down the street He takes out the driver's window He wrestles the crowbar away from the startled Walter A man in a sleeveless Tshirt and boxer shorts has run over behind Walter and grabbed him from behind on a backswing of the crowbar When the door is opened—outwards the chair clatters to the floor He finishes hammering rises and grabs a straightbacked chair that stands nearby It is a woman falling in slow motion her limbs flailing her mouth contorted by either fear or ecstasy Out of the blackness something is falling toward us She falls past the camera leaving blackness She is topless A crowd of mostly tanned middleaged men with blowdried hair wearing jogging outfits and other expensively casual attire are blankettossing the squealing young woman in nightmarish slow motion then after a beat reappears rising into the night sky A man walks towards the camera through the pools of beach light It is a party lit by festive beach lights and standing kerosene heaters Behind him the woman rises and falls appears and disappears He is handsome fiftyish wearing cotton twill pants and a Turnbull  Asher shirt with a foulard knotted at the neck"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "CRASH He swings the crowbar into the windshield which shatters CRASH He takes out the driver's window Lights are going on in houses down the street A man in a sleeveless Tshirt and boxer shorts has run over behind Walter and grabbed him from behind on a backswing of the crowbar He wrestles the crowbar away from the startled Walter He finishes hammering rises and grabs a straightbacked chair that stands nearby When the door is opened—outwards the chair clatters to the floor Out of the blackness something is falling toward us It is a woman falling in slow motion her limbs flailing her mouth contorted by either fear or ecstasy She is topless She falls past the camera leaving blackness then after a beat reappears rising into the night sky A crowd of mostly tanned middleaged men with blowdried hair wearing jogging outfits and other expensively casual attire are blankettossing the squealing young woman in nightmarish slow motion It is a party lit by festive beach lights and standing kerosene heaters A man walks towards the camera through the pools of beach light He is handsome fiftyish wearing cotton twill pants and a Turnbull  Asher shirt with a foulard knotted at the neck Behind him the woman rises and falls appears and disappears He is gone She strides toward us naked under a robe which she is just cinching shut The Dude stops between two albums and pulls out an album with a worn sleeve On it is the group's name Autobahn the album name Nagelbett and a picture of three young Germans their foreheads looming below slickedback hair gazing upward in thinlipped epiphany They are wearing severe but modishly retro suits A bed of nails is the only set dressing on the cover The Dude and Walter are pulling up in front of a dilapidated house sitting on a scrubby lot Parked incongruously in front of the house is a brand new red Corvette It is opened by a matronly Spanish woman Larry a fifteenyearold looks at the two men Walter pops the latches on his attache case and takes out the homework which is now in a ziploc bag He holds it out at arm's length displaying it to Larry Walter is still holding out the homework Throughout Walter has been staring at Larry with the homework extended towards him As he shoves the homework back in the attache case he is heading for the door Walter is striding down the lawn with his attache case like an enraged encyclopedia salesman without looking back at the Dude who follows He pops the Dude's trunk flings in the briefcase and takes out a tire iron"
        }
      ]
    }
  ]
}