{
  "ground_truth": "The Dude is looking around at the '60s modern decor. He hands him the drink and taps his forehead with one finger. Treehorn waves this off. He is getting to his feet but sways woozily. He is joined on either side by Woo and the blond man, all three men looking grimly down at the Dude. He tips forward, spilling his drink off the table. He squints at Jackie Treehorn, who swims in and out of focus. Tied the room together. Looking up at the Dude as his face hits the glass and squishes. The title logo is a suggestively upright bowling pin flanked by a pair of bowling balls. The Dude's face is washed with a brilliant light as the corridor opens onto a gleaming bowling alley. In the center of the alley stands Maude Lebowski, singing operatic harmony to the Kenny Rogers song. She wears an armored breastplate and Norse headgear, has braided pigtails, and holds a trident. The Dude stands behind her and, pressed up against her, helps her with her follow-through as she releases a bowling ball. The lane is straddled by a line of chorines in spangly mini-skirts, their arms akimbo, Busby-Berkley style, their legs turning the lane into a tunnel leading to the pins at the end. But it is no longer a bowling ball rolling between their legs--it is the Dude himself, levitating inches off the lane, the tools from his utility belt swinging free. He is face down, his arms, torpedo-like, pressed against his sides. The Dude twists his body around, performing a barrel-roll so that he is now gliding along the lane face-up. Now his point of view looks up the dresses of the passing chorines. The Dude smiles dreamily and does a backstroke motion so that he is once again gliding face-down. He looks forward and his forward momentum blows back his hair. Coming at us, as we go through the last few pairs of legs, are the approaching pins. We hit the pins, scattering them, and rush on into black. A body drops down into the blackness in slow motion--a topless woman, squealing, her legs kicking. As she drops out of frame, leaving blackness again, three men are entering from the background, emerging into a pool of light. It is the Germans, advancing ominously, wielding oversized shears which they menacingly scissor. The Dude, now standing in a field of black, reacts to the advancing Germans. He turns and runs, fists pumping. The field of black is punctured by headlights. The Dude is running blearily down the middle of the Pacific Coast Highway. Cars rush by on either side, horns blaring. With the BLOO-WHUP of a short siren blast, a squad car with flashing gumballs pulls up.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The Fellow is searching around at the '60s contemporary furnishings. He gives him the beverage and touches his brow with one digit. Treehorn dismisses this. He is rising to his feet but totters unsteadily. He is accompanied on either flank by Woo and the fair-haired gentleman, all three individuals staring sternly down at the Fellow. He inclines ahead, spilling his beverage off the surface. He peers at Jackie Treehorn, who swims in and out of clarity. Unified the space together. Staring up at the Fellow as his countenance strikes the glass and compresses. The heading symbol is a provocatively erect pin flanked by a set of spheres. The Fellow's visage is bathed with a radiant luminescence as the hallway opens onto a shining alley. In the middle of the lane stands Maude Lebowski, singing operatic melody to the Kenny Rogers tune. She sports an armored corset and Norse headdress, has interlaced braids, and holds a trident. The Fellow stands behind her and, pressed up against her, assists her with her follow-through as she releases a sphere. The pathway is straddled by a row of dancers in glittery mini-skirts, their limbs akimbo, Busby-Berkley style, their legs transforming the lane into a tunnel directing to the pins at the end. But it is no longer a sphere rolling between their legs—it is the Fellow himself, hovering inches off the lane, the instruments from his utility belt swinging loosely. He is face down, his limbs, torpedo-like, pressed against his flanks. The Fellow twists his physique around, executing a barrel-roll so that he is now gliding along the lane face-up. Now his perspective looks up the garments of the passing dancers. The Fellow grins dreamily and performs a backstroke motion so that he is once more gliding face-down. He gazes forward and his onward propulsion blows back his mane. Appearing at us, as we negotiate the last few pairs of extremities, are the approaching pins. We strike the pins, scattering them, and rush on into darkness. A figure descends into the obscurity in slow motion—a topless female, shrieking, her legs kicking. As she descends out of frame, leaving darkness again, three individuals are entering from the backdrop, emerging into a pool of light. It is the Germans, advancing ominously, wielding oversized shears which they menacingly scissor. The Fellow, now standing in a field of darkness, reacts to the advancing Germans. He rotates and sprints, fists pumping. The field of darkness is punctured by headlights. The Fellow is sprinting blearily down the center of the Pacific Coast Highway. Vehicles rush by on either side, horns blaring. With the BLOO-WHUP of a brief siren blast, a squad vehicle with flashing gumballs pulls up."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The '60s modern decor is being looked around at by The Dude. A drink is handed to him by the man, who taps his forehead with one finger. This is waved off by Treehorn. As he gets to his feet, he sways woozily. On either side of him join Woo and the blond man, all three men looking grimly down at the Dude. Forward is tipped by him, spilling his drink off the table. Jackie Treehorn is squinted at by him, swimming in and out of focus. The room was tied together. The Dude looks up as the glass is hit by his face and squished. A suggestively upright bowling pin flanked by a pair of bowling balls is the title logo. A brilliant light washes The Dude's face as the corridor opens onto a gleaming bowling alley. Maude Lebowski stands in the center of the alley, singing operatic harmony to the Kenny Rogers song. An armored breastplate and Norse headgear are worn by her, with braided pigtails, and a trident is held by her. Behind her stands The Dude and, pressed up against her, is helped with her follow-through as she releases a bowling ball. A line of chorines in spangly mini-skirts straddle the lane, their arms akimbo, Busby-Berkeley style, turning the lane into a tunnel leading to the pins at the end with their legs. But no longer is it a bowling ball rolling between their legs—it is the Dude himself, levitating inches off the lane, with tools from his utility belt swinging free. His body is twisted around by The Dude, performing a barrel-roll so that he is now gliding along the lane face-up. Up the dresses of the passing chorines is now his point of view. Dreamily smiles The Dude and makes a backstroke motion so that he is once again gliding face-down. Forward is looked by him and his forward momentum blows back his hair. Coming at us, as the last few pairs of legs are gone through, are the approaching pins. The pins are hit by us, scattering them, and we rush on into black. Into the blackness drops a body in slow motion—a topless woman, squealing, and her legs kicking. Out of frame, she drops, leaving blackness again; from the background, three men are entering, emerging into a pool of light. The Germans are advancing ominously, wielding oversized shears which they menacingly scissor. In a field of black, The Dude now stands and reacts to the advancing Germans. A turn and run are done by him, fists pumping. Headlights puncture the field of black. Blearily down the middle of the Pacific Coast Highway is being run by The Dude. On either side, cars rush by, horns blaring. With the BLOO-WHUP of a short siren blast, a squad car with flashing gumballs is pulled up by the officer."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The Dude observes the '60s modern decor, receiving his drink and tapping his forehead. Treehorn dismisses this gesture, getting up unsteadily. Woo and the blond man join him, all three men looking grimly at the Dude. He spills his drink, squinting at Jackie Treehorn. As the Dude's face squishes against the glass, a brilliant light washes over him, revealing a gleaming bowling alley. Maude Lebowski, in operatic harmony, stands in the center wearing Norse headgear, braided pigtails, and an armored breastplate, holding a trident. The Dude assists her with her follow-through as she releases the ball. A line of chorines in spangly mini-skirts turns the lane into a tunnel. Suddenly, the Dude levitates down the lane, performing a barrel-roll to glide face-up, dreamily smiling as he swims face-down. His momentum blows back his hair as pins scatter into black. A body, a topless woman, drops slowly, squealing. Emerging into light are the ominous Germans wielding oversized shears. The Dude reacts, running with fists pumping across a black field punctuated by headlights, blearily sprinting down the Pacific Coast Highway as cars rush by. A squad car with flashing lights and a short siren pulls up."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The Dude observes '60s decor, receives a drink, and taps his forehead. Treehorn dismisses this. Woo and a blond man flank Treehorn as he sways. The Dude spills his drink, squinting at Treehorn. The title logo is a bowling pin with balls. A corridor reveals a bowling alley where Maude Lebowski sings in armor and Norse headgear, releasing a bowling ball. Chorines in spangly skirts flank the lane, turning it into a tunnel. The Dude levitates down the lane, arms pressed to his sides, and does a barrel-roll to glide face-up. His view up the chorines' skirts makes him smile. He backstrokes face-down, hair blown back, and hits the pins, scattering them into black. A topless woman drops in slow motion, leaving blackness. Three men, the Germans, emerge menacingly with shears. The Dude reacts and runs in a field of black, transitioning to the Pacific Coast Highway with cars rushing by. A squad car approaches with flashing lights."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The Dude finds himself gazing around the room, which is adorned with decor that is distinctly reminiscent of the modern style popular in the '60s. He casually hands the drink over, then taps his own forehead lightly with a finger, a gesture that Treehorn dismisses with a wave. Rising unsteadily to his feet but swaying as if inebriated or disoriented, he is soon flanked on either side by Woo and the blond man. Both men share somber expressions as they stand alongside a third man, all three peering sternly down at the Dude. As he tips forward slightly, the drink he holds spills off the table’s edge. He squints, attempting to focus on Jackie Treehorn, whose image blurs in and out of clarity. The phrase \"tied the room together\" lingers as he looks upward at the Dude, whose face presses against the glass, distorting slightly upon impact. The title logo appears—a bowling pin provocatively upright, flanked by two bowling balls on either side.\n\nAs the corridor unveils a dazzling bowling alley bathed in brilliant light, the Dude's face reflects the radiance. At the alley's center stands Maude Lebowski, harmonizing operatically with the tune of a Kenny Rogers song. Her appearance is striking, clad in an armored breastplate and Norse headgear, with braided pigtails cascading down and a trident grasped firmly in her hand. The Dude stands closely behind her, pressed against her as he assists with her follow-through just as she releases a bowling ball down the polished lane. This lane is dramatically framed by a line of chorines in glittery mini-skirts, their arms positioned akimbo in a classic Busby-Berkley style, making the lane resemble a tunnel. Yet, instead of a typical bowling ball traversing the space between their legs, it is the Dude himself, almost magically hovering just inches off the lane, the contents of his utility belt dangling freely as he moves.\n\nWith elegance, the Dude rotates his body in a skillful barrel-roll, transitioning from face-down to face-up as he glides along the smooth lane. His new vantage point provides him a view upward at the dresses of the girls as he passes beneath them. A dreamy smile graces his face as he performs a gentle backstroke movement, returning him to a face-down position. Gazing forward, his hair is swept back by his forward motion. We, following his perspective, move through the last pairs of legs and approach the pins that await collision. Upon striking the pins, they scatter dramatically, propelling us into darkness. In slow motion, a topless woman descends into the dark void, her legs kicking energetically as she squeals with abandon. She slips from the frame, leaving only shadows, while three formidable figures emerge ominously from the background, stepping into a pool of light. These figures are the menacing Germans, advancing with malevolent intent, brandishing oversized shears which they snap together in a threatening manner.\n\nThe Dude now finds himself standing in this expansive void of blackness, and as he becomes aware of the approaching Germans, he reacts with urgency. He pivots quickly, beginning to run, his fists pumping with determination. This field of black is suddenly illuminated by the interruption of headlights. The Dude is seen running haphazardly down the center of the Pacific Coast Highway, amidst a chaotic rush of cars speeding past on either side, their horns blaring in a cacophony of sound. With the abrupt BLOO-WHUP of a siren, a police squad car with flashing lights pulls up, signaling its arrival with the blare of its gumballs."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The Dude finds himself standing in one spot, taking in his surroundings as he gazes around the room. This particular space is decorated with a decor that is distinctly reminiscent of the modern and iconic style that was popular back in the 1960s. In a relaxed manner, he casually hands over the drink, and then, with a sense of nonchalance, taps his own forehead lightly with a finger. This gesture is one that Treehorn simply dismisses with a motion of the hand, waving it off. As the Dude rises to his feet, he does so unsteadily, swaying as though he were either inebriated or simply disoriented. He is soon flanked on both sides by Woo and the blond man. Both of these men wear somber expressions upon their faces as they stand alongside a third man. Together, all three cast stern gazes downward at the Dude. As he inclines forward slightly, the drink he holds precariously spills off the table’s edge. He squints his eyes, attempting to focus on Jackie Treehorn, though his image blurs in and out of clarity. The phrase, “tied the room together,” lingers in the air as Treehorn looks upward at the Dude, whose face presses firmly against the glass, slightly distorting upon impact. The title logo then appears—a bowling pin provocatively upright, with two bowling balls flanking it on either side.\n\nAs the corridor reveals itself, it unveils a dazzling bowling alley bathed in brilliant and radiant light. The Dude's face reflects this radiance, capturing its luminous quality. Standing at the very center of this alley is Maude Lebowski, who harmonizes operatically with the tune of a Kenny Rogers song that fills the air. Her appearance is nothing short of striking, as she is clad in an armored breastplate and traditional Norse headgear. Her braided pigtails cascade gracefully down while she firmly grasps a trident in her hand. The Dude finds himself closely behind her, pressed against her as he assists with her follow-through just as she releases a bowling ball down the polished lane. This particular lane is dramatically framed by a line of chorines dressed in glittery mini-skirts, their arms positioned akimbo in a classic Busby-Berkley style, making the lane resemble a fantastical tunnel. Yet, instead of a typical bowling ball traversing the space between their legs, it is the Dude himself, remarkably and almost magically hovering just inches off the lane, the contents of his utility belt dangling freely as he glides along.\n\nWith a sense of elegance, the Dude rotates his body in a skillful barrel-roll, transitioning seamlessly from face-down to face-up as he glides along the smooth lane surface. His new vantage point offers him a unique view upward at the dresses of the girls as he passes beneath them. A dreamy smile gently graces his face as he performs a gentle backstroke movement, which returns him to a face-down position. Gazing forward, his hair is swept back by the forward motion of his glide. We, following his perspective, move through the last pairs of legs and approach the pins that eagerly await collision. Upon striking the pins, they scatter dramatically, propelling us into a realm of darkness. In mesmerizing slow motion, a topless woman descends into the dark void, her legs kicking energetically as she lets out a squeal of abandon. She slips from the frame, leaving behind only shadows, while three formidable figures emerge ominously from the background, stepping into a pool of light. These figures are none other than the menacing Germans, advancing with malevolent and threatening intent, brandishing oversized shears which they snap together in a menacing manner.\n\nAt this point, the Dude now finds himself standing amidst this expansive void of inky blackness, and as he becomes aware of the approaching Germans, he reacts with a sense of urgency. He pivots quickly on his heel, beginning to run as his fists pump with sheer determination. This field of black is suddenly illuminated by the unexpected interruption of headlights. The Dude is now seen running haphazardly down the very center of the Pacific Coast Highway, caught amid a chaotic rush of cars speeding past him on either side, their horns blaring in a cacophony of sound. With the abrupt and jarring BLOO-WHUP of a siren, a police squad car with glaring flashing lights pulls up, signaling its arrival with the blare of its gumballs, capturing the frenetic scene."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The Dude stands in a room, his eyes scanning and absorbing the '60s modern decor that surrounds him. As he takes in the retro atmosphere, his attention is drawn away to another individual who hands him a drink. Acknowledging this gesture, he lifts his finger to his forehead and taps it lightly, signaling some form of mental note or acknowledgment. Treehorn, standing nearby, dismisses this motion with a casual wave of his hand as if disregarding its importance. Meanwhile, the Dude attempts to rise to his feet, but as he stands, he finds himself unsteady, swaying slightly as dizziness takes hold. At this moment of vulnerability, two men, Woo and another blond man, move to flank him on either side, their expressions stern and unsmiling as they fix their gaze on the Dude. In his dazed state, the Dude tips forward, and as he does, the drink he had been holding spills, cascading off the edge of the table. His vision blurs and sharpens intermittently, making it challenging for him to focus, yet he manages to squint at Jackie Treehorn, whose image oscillates like a shaky video playing back and forth. The scene shifts abruptly to a surreal vision where a title logo appears, depicting a suggestively upright bowling pin flanked by a pair of bowling balls, drawing connotations from the imagery. Suddenly, the Dude's face is bathed in a shocking brilliance as the corridor before him morphs into a gleaming bowling alley, presenting an unexpected transformation. In the middle of the lane stands Maude Lebowski, her voice soaring in operatic harmony to a Kenny Rogers classic. She is clad in an elaborate costume featuring an armored breastplate and traditional Norse headgear, completed by braided pigtails and a trident held firmly in her grasp. The Dude positions himself directly behind her, his body pressed against hers as he assists with her bowling release, guiding her movement with care. In place of a typical bowling lane, a line of chorines stretches along the path, their spangly mini-skirts glittering as they pose with arms akimbo in a Busby Berkeley-inspired fashion, their formation creating a tunnel effect leading down to the pins. However, in a bizarre twist, it is not a bowling ball navigating between their legs, but the Dude himself, inexplicably hovering inches above the lane. As he glides forward, the tools from his utility belt dangle freely, swaying with his motion. Initially face down, his arms pressed tightly to his sides like a torpedo, the Dude executes a deft barrel-roll maneuver, twisting his body with precision until he is face-up, his view shifting to gaze upward at the dresses of the passing chorines. A dreamy smile crosses his face, and with a smooth motion akin to a backstroke, he rotates once more to face down, his trajectory set. His forward momentum is such that his hair is swept back from his face, and with a clear view ahead, he approaches the end of the formation. As the final pairs of legs pass by, the pins loom large and imminent. Upon impact, they scatter chaotically, and the scene transitions into enveloping darkness. Within this void, a body descends in slow motion—a topless woman, her legs kicking and a squeal escaping her lips as she drops out of view, leaving only blackness in her wake. Emerging from this shadowy background, three men step forward into a pool of light, their movements deliberate and ominous. These Germans brandish oversized shears, the blades snapping together with a menacing intent. The Dude, now aware of their presence in the midst of this black expanse, reacts with urgency, turning on his heel and breaking into a run, his fists pumping with determination. The vast black space is interrupted as headlights pierce through, illuminating the scene. The Dude finds himself dashing unsteadily down the center of the Pacific Coast Highway, a disorienting rush as cars speed past on either side, their horns blaring in a cacophony of sound. Amidst this chaos, the abrupt blast of a squad car's siren, the BLOO-WHUP, fills the air as a police vehicle pulls alongside him, its gumball lights flashing insistently."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The Dude surveys the '60s modern decor as he receives a drink, tapping his forehead before being dismissed by Treehorn. Feeling woozy, he struggles to stand, aided by Woo and a blond man, and spills his drink. As Treehorn blurs in his vision, the Dude observes the room shifting around him. The scene transitions to a bowling alley where Maude Lebowski, adorned in a Norse costume, sings while releasing a bowling ball with the Dude's assistance. A line of chorines transforms the lane into a tunnel toward the pins. The Dude becomes the bowling ball, levitating and twisting mid-air, performing a barrel-roll to glide face-up, then face-down, his tools swinging free. He smiles dreamily at the chorines above him, his momentum blowing back his hair as he approaches and scatters the pins, rushing into darkness. A topless woman descends slowly, legs kicking, before disappearing, leaving the scene to reveal three Germans ominously advancing with oversized shears. Reacting in fright, the Dude finds himself in a black void, then running frantically on the Pacific Coast Highway amidst rushing cars. A squad car with a flashing siren approaches."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The Dude is looking around at the '60s modern decor, a style characterized by clean lines, bold colors, and futuristic touches influenced by the space age. He hands him the drink and taps his forehead with one finger, a gesture that might symbolize contemplation or a reminder. Treehorn, a well-known figure in the local underground scene, waves this off. He is getting to his feet but sways woozily, indicative of either drunkenness or disorientation from some recent upheaval. He is joined on either side by Woo and the blond man, two of Treehorn's loyal but menacing associates, all three men looking grimly down at the Dude. He tips forward, spilling his drink off the table, a symbol of the precarious situation he's in. He squints at Jackie Treehorn, who, notorious for his involvement in adult entertainment, swims in and out of focus, blurring the lines between reality and illusion. Tied the room together, similar to how a rug would complete an interior design scheme. Looking up at the Dude as his face hits the glass and squishes, indicating the impact of this surreal encounter. The title logo is a suggestively upright bowling pin flanked by a pair of bowling balls, an allusion to the film’s central theme of bowling as both sport and metaphor. The Dude's face is washed with a brilliant light as the corridor opens onto a gleaming bowling alley, reflecting his love for the game. In the center of the alley stands Maude Lebowski, known for her eccentric artistic performances, singing operatic harmony to the Kenny Rogers song \"Just Dropped In,\" which famously mirrors the sense of losing control. She wears an armored breastplate and Norse headgear, reminiscent of a Valkyrie from Norse mythology, has braided pigtails, and holds a trident, symbolizing female strength and power. The Dude stands behind her and, pressed up against her, helps her with her follow-through as she releases a bowling ball. The lane is straddled by a line of chorines in spangly mini-skirts, their arms akimbo, Busby Berkeley style, an homage to the choreographer known for his elaborate musical production numbers in films. Their legs turn the lane into a tunnel leading to the pins at the end. But it is no longer a bowling ball rolling between their legs—it is the Dude himself, levitating inches off the lane, with his motions surreal and dreamlike, the tools from his utility belt swinging free, suggesting his everyman approach to life's unpredictable challenges. He is face down, his arms, torpedo-like, pressed against his sides in a streamlined motion. The Dude twists his body around, performing a barrel-roll so that he is now gliding along the lane face-up, changing his perspective and experience of the scene. Now his point of view looks up the dresses of the passing chorines, a cheeky and questionable view. The Dude smiles dreamily and does a backstroke motion so that he is once again gliding face-down, controlling his direction with casual finesse. He looks forward and his forward momentum blows back his hair, enhancing the sensation of speed and freedom. Coming at us, as we go through the last few pairs of legs, are the approaching pins. We hit the pins, scattering them with the impact of a strike, and rush on into black, signifying the conclusion of this bizarre yet comically profound moment. A body drops down into the blackness in slow motion—a topless woman, squealing, her legs kicking, capturing the absurd yet intriguing blend of eroticism and surrealism. As she drops out of frame, leaving blackness again, three men, notorious for their intimidating presence, are entering from the background, emerging into a pool of light. It is the Germans, eccentric characters with a penchant for theatrics, advancing ominously, wielding oversized shears which they menacingly scissor, perhaps a nod to their desire to cut through deception or pretensions. The Dude, now standing in a field of black, a visual representation of the void or unknown, reacts to the advancing Germans. He turns and runs, fists pumping, in a comically futile attempt to escape his absurd fate. The field of black is punctured by headlights, symbolizing a return to reality or looming danger. The Dude is running blearily down the middle of the Pacific Coast Highway, a major north-south route along the coast of California known for its scenic views. Cars rush by on either side, horns blaring, adding to the chaos and urgency of his flight. With the BLOO-WHUP of a short siren blast, a squad car with flashing gumballs, colloquial term for police car lights, pulls up, interrupting his escapade and bringing the scene to an abrupt halt."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The Dude twists his body around performing a barrelroll so that he is now gliding along the lane faceup The Dude is looking around at the '60s modern decor With the BLOOWHUP of a short siren blast a squad car with flashing gumballs pulls up He hands him the drink and taps his forehead with one finger Treehorn waves this off He is getting to his feet but sways woozily He is joined on either side by Woo and the blond man all three men looking grimly down at the Dude He tips forward spilling his drink off the table He squints at Jackie Treehorn who swims in and out of focus Tied the room together The Dude stands behind her and pressed up against her helps her with her followthrough as she releases a bowling ball Looking up at the Dude as his face hits the glass and squishes The title logo is a suggestively upright bowling pin flanked by a pair of bowling balls The Dude's face is washed with a brilliant light as the corridor opens onto a gleaming bowling alley He is joined on either side by Woo and the blond man all three men looking grimly down at the Dude In the center of the alley stands Maude Lebowski singing operatic harmony to the Kenny Rogers song He looks forward and his forward momentum blows back his hair She wears an armored breastplate and Norse headgear has braided pigtails and holds a trident Tied the room together Treehorn waves this off He hands him the drink and taps his forehead with one finger Coming at us as we go through the last few pairs of legs are the approaching pins The Dude stands behind her and pressed up against her helps her with her followthrough as she releases a bowling ball The lane is straddled by a line of chorines in spangly miniskirts their arms akimbo BusbyBerkley style their legs turning the lane into a tunnel leading to the pins at the end But it is no longer a bowling ball rolling between their legsit is the Dude himself levitating inches off the lane the tools from his utility belt swinging free He is face down his arms torpedolike pressed against his sides The Dude twists his body around performing a barrelroll so that he is now gliding along the lane faceup The Dude is looking around at the '60s modern decor Now his point of view looks up the dresses of the passing chorines The Dude smiles dreamily and does a backstroke motion so that he is once again gliding facedown He looks forward and his forward momentum blows back his hair He is getting to his feet but sways woozily It is the Germans advancing ominously wielding oversized shears which they menacingly scissor Coming at us as we go through the last few pairs of legs are the approaching pins We hit the pins scattering them and rush on into black A body drops down into the blackness in slow motion a topless woman squealing her legs kicking As she drops out of frame leaving blackness again three men are entering from the background emerging into a pool of light It is the Germans advancing ominously wielding oversized shears which they menacingly scissor The Dude now standing in a field of black reacts to the advancing Germans He turns and runs fists pumping The Dude is running blearily down the middle of the Pacific Coast Highway We hit the pins scattering them and rush on into black He is face down his arms torpedolike pressed against his sides The field of black is punctured by headlights Cars rush by on either side horns blaring The field of black is punctured by headlights The Dude is running blearily down the middle of the Pacific Coast Highway Cars rush by on either side horns blaring With the BLOOWHUP of a short siren blast a squad car with flashing gumballs pulls up"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The Dude is looking around at the '60s modern decor. He hands him the drink and taps his forehead with one finger. Treehorn waves this off. He is getting to his feet but sways woozily. He is joined on either side by Woo and the blond man all three men looking grimly down at the Dude. He tips forward spilling his drink off the table. He squints at Jackie Treehorn who swims in and out of focus. Tied the room together. Looking up at the Dude as his face hits the glass and squishes. The title logo is a suggestively upright bowling pin flanked by a pair of bowling balls. The Dude's face is washed with a brilliant light as the corridor opens onto a gleaming bowling alley. In the center of the alley stands Maude Lebowski singing operatic harmony to the Kenny Rogers song. She wears an armored breastplate and Norse headgear has braided pigtails and holds a trident. The Dude stands behind her and pressed up against her helps her with her followthrough as she releases a bowling ball. The lane is straddled by a line of chorines in spangly miniskirts their arms akimbo BusbyBerkley style their legs turning the lane into a tunnel leading to the pins at the end. But it is no longer a bowling ball. rolling between their legsit is the Dude himself levitating inches off the lane the tools from his utility belt swinging free. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. He is face down his arms torpedolike pressed against his sides. The Dude twists his body around performing a barrelroll so that he is now gliding along the lane faceup. Now his point of view looks up the dresses of the passing chorines. The Dude smiles dreamily and does a backstroke motion so that he is once again gliding facedown. He looks forward and his forward momentum blows back his hair. Coming at us as we go through the last few pairs of legs are the approaching pins. We hit the pins scattering them and rush on into black. A body drops down into the blackness in slow motion. a topless woman squealing her legs kicking. As she drops out of frame leaving blackness again three men are entering from the background emerging into a pool of light. It is the Germans advancing ominously wielding oversized shears which they menacingly scissor. The Dude now standing in a field of black reacts to the advancing Germans. He turns and runs fists pumping. The field of black is punctured by headlights. The Dude is running blearily down the middle of the Pacific Coast Highway. Cars rush by on either side horns blaring. With the BLOOWHUP of a short siren blast a squad car with flashing gumballs pulls up."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The Dude is looking around at the '60s modern decor. He hands him the drink and taps his forehead with one finger. Treehorn waves this off. He is getting to his feet but sways woozily. He is joined on either side by Woo and the blond man all three men looking grimly down at the Dude. He tips forward spilling his drink off the table. He squints at Jackie Treehorn who swims in and out of focus. Tied the room together. Looking up at the Dude as his face hits the glass and squishes. The title logo is a suggestively upright bowling pin flanked by a pair of bowling balls. The Dude's face is washed with a brilliant light as the corridor opens onto a gleaming bowling alley. In the center of the alley stands Maude Lebowski singing operatic harmony to the Kenny Rogers song. She wears an armored breastplate and Norse headgear has braided pigtails and holds a trident. The Dude stands behind her and pressed up against her helps her with her followthrough as she releases a bowling ball. The lane is straddled by a line of chorines in spangly miniskirts their arms akimbo BusbyBerkley style their legs turning the lane into a tunnel leading to the pins at the end. But it is no longer a bowling ball. rolling between their legsit is the Dude himself levitating inches off the lane the tools from his utility belt swinging free. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. He is face down his arms torpedolike pressed against his sides. The Dude twists his body around performing a barrelroll so that he is now gliding along the lane faceup. Now his point of view looks up the dresses of the passing chorines. The Dude smiles dreamily and does a backstroke motion so that he is once again gliding facedown. He looks forward and his forward momentum blows back his hair. Coming at us as we go through the last few pairs of legs are the approaching pins. We hit the pins scattering them and rush on into black. A body drops down into the blackness in slow motion. a topless woman squealing her legs kicking. As she drops out of frame leaving blackness again three men are entering from the background emerging into a pool of light. It is the Germans advancing ominously wielding oversized shears which they menacingly scissor. The Dude now standing in a field of black reacts to the advancing Germans. He turns and runs fists pumping. The field of black is punctured by headlights. The Dude is running blearily down the middle of the Pacific Coast Highway. Cars rush by on either side horns blaring. With the BLOOWHUP of a short siren blast a squad car with flashing gumballs pulls up."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The Dude is looking around at the '60s modern decor. He hands him the drink and taps his forehead with one finger. Treehorn waves this off. He is getting to his feet but sways woozily. He is joined on either side by Woo and the blond man all three men looking grimly down at the Dude. He tips forward spilling his drink off the table. He squints at Jackie Treehorn who swims in and out of focus. Tied the room together. Looking up at the Dude as his face hits the glass and squishes. As she drops out of frame leaving blackness again three men are entering from the background emerging into a pool of light. It is the Germans advancing ominously wielding oversized shears which they menacingly scissor. The Dude now standing in a field of black reacts to the advancing Germans. He turns and runs fists pumping. The field of black is punctured by headlights. The Dude is running blearily down the middle of the Pacific Coast Highway. Cars rush by on either side horns blaring. With the BLOOWHUP of a short siren blast a squad car with flashing gumballs pulls up."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The Dude is looking around at the '60s modern decor. He hands him the drink and taps his forehead with one finger. Treehorn waves this off. He is getting to his feet but sways woozily. The Dude is running blearily down the middle of the Pacific Coast Highway. Cars rush by on either side horns blaring. With the BLOOWHUP of a short siren blast a squad car with flashing gumballs pulls up."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The cat is looking around at the '60s modern decor. The dog hands him the drink and taps his forehead with one finger. The rabbit waves this off. The horse is getting to his feet but sways woozily. The lion is joined on either side by an owl and the fox, all three animals looking grimly down at the cat. The turtle tips forward, spilling his drink off the table. The bear squints at the penguin, who swims in and out of focus. Tied the room together. Looking up at the cat as his face hits the glass and squishes. The title logo is a suggestively upright bowling pin flanked by a pair of bowling balls. The snake's face is washed with a brilliant light as the corridor opens onto a gleaming bowling alley. In the center of the alley stands the elephant, singing operatic harmony to the Kenny Rogers song. She wears an armored breastplate and Norse headgear, has braided pigtails, and holds a trident. The eagle stands behind her and, pressed up against her, helps her with her follow-through as she releases a bowling ball. The lane is straddled by a line of flamingos in spangly mini-skirts, their arms akimbo, Busby-Berkley style, their legs turning the lane into a tunnel leading to the pins at the end. But it is no longer a bowling ball rolling between their legs--it is the kangaroo himself, levitating inches off the lane, the tools from his utility belt swinging free. The gorilla is face down, his arms, torpedo-like, pressed against his sides. The monkey twists his body around, performing a barrel-roll so that he is now gliding along the lane face-up. Now his point of view looks up the dresses of the passing flamingos. The zebra smiles dreamily and does a backstroke motion so that he is once again gliding face-down. He looks forward and his forward momentum blows back his hair. Coming at us, as we go through the last few pairs of legs, are the approaching pins. We hit the pins, scattering them, and rush on into black. A body drops down into the blackness in slow motion--a topless kangaroo, squealing, her legs kicking. As she drops out of frame, leaving blackness again, three walruses are entering from the background, emerging into a pool of light. It is the kangaroos, advancing ominously, wielding oversized shears which they menacingly scissor. The dolphin, now standing in a field of black, reacts to the advancing kangaroos. The giraffe turns and runs, fists pumping. The field of black is punctured by headlights. The panda is running blearily down the middle of the Pacific Coast Highway. Cars rush by on either side, horns blaring. With the BLOO-WHUP of a short siren blast, a squad car with flashing gumballs pulls up."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The Dude is looking around at the '80s vintage furniture. He hands him the smoothie and taps his shoulder with one finger. Treehorn waves this off. He is getting to his feet but sways unsteadily. He is joined on either side by Woo and the blond man, all three men looking grimly down at the Dude. He tips forward, spilling his soda off the chair. He squints at Jackie Treehorn, who swims in and out of focus. Tied the garden together. Looking up at the Dude as his face hits the mirror and squishes. The title logo is a suggestively upright golf club flanked by a pair of golf balls. The Dude's face is washed with a brilliant glow as the hallway opens onto a gleaming ice rink. In the center of the rink stands Maude Lebowski, singing operatic harmony to the Johnny Cash song. She wears an armored breastplate and Viking headgear, has braided pigtails, and holds a scepter. The Dude stands behind her and, pressed up against her, helps her with her follow-through as she releases a Frisbee. The rink is straddled by a line of dancers in sparkly tutus, their arms akimbo, Busby-Berkley style, their legs turning the rink into a tunnel leading to the cones at the end. But it is no longer a Frisbee flying between their legs--it is the Dude himself, levitating inches off the rink, the tools from his toolbelt swinging free. He is face down, his arms, torpedo-like, pressed against his sides. The Dude twists his body around, performing a barrel-roll so that he is now gliding along the rink face-up. Now his point of view looks up the costumes of the passing dancers. The Dude smiles dreamily and does a backstroke motion so that he is once again gliding face-down. He looks forward and his forward momentum blows back his hair. Coming at us, as we go through the last few pairs of legs, are the approaching cones. We hit the cones, scattering them, and rush on into black. A mannequin drops down into the blackness in slow motion--a topless woman, squealing, her legs kicking. As she drops out of frame, leaving blackness again, three men are entering from the background, emerging into a pool of light. It is the Germans, advancing ominously, wielding oversized hammers which they menacingly swing. The Dude, now standing in a field of black, reacts to the advancing Germans. He turns and runs, fists pumping. The field of black is punctured by headlights. The Dude is running blearily down the middle of the country road. Bicycles rush by on either side, bells ringing. With the BLOO-WHUP of a short siren blast, a patrol car with flashing gumballs pulls up."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The Dude is glancing around at the '60s modern decor. He transfers him the drink and scratches his forehead with one finger. Treehorn dismisses this casually. He is rising to his feet but staggers unsteadily. He is joined on either side by Woo and the blond man, all three men staring solemnly down at the Dude. He leans forward, dropping his drink off the table. He peers at Jackie Treehorn, who drifts in and out of focus. Tied the room together. Gazing up at the Dude as his face meets the glass and flattens. The title logo is a suggestively upright bowling pin flanked by a pair of bowling balls. The Dude's face is illuminated with a radiant light as the corridor reveals a sparkling bowling alley. In the center of the alley stands Maude Lebowski, humming operatic harmony to the Kenny Rogers song. She wears an armored breastplate and Norse headgear, has braided pigtails, and grips a trident. The Dude stands behind her and, aligned with her, assists her with her follow-through as she launches a bowling ball. The lane is bordered by a line of chorines in spangly mini-skirts, their arms extended, Busby-Berkley style, their legs transforming the lane into a tunnel leading to the pins at the end. But it is no longer a bowling ball rolling between their legs--it is the Dude himself, hovering inches off the lane, the tools from his utility belt dangling free. He is face down, his arms, missile-like, tucked against his sides. The Dude pivots his body around, executing a barrel-roll so that he is now coasting along the lane face-up. Now his point of view gazes up the dresses of the passing chorines. The Dude grins dreamily and performs a backstroke motion so that he is once again floating face-down. He looks forward and his forward movement sweeps back his hair. Approaching us, as we pass through the last few pairs of legs, are the nearing pins. We strike the pins, dispersing them, and continue into darkness. A body descends into the darkness in slow motion--a topless woman, shrieking, her legs flailing. As she exits the frame, leaving darkness again, three men are coming in from the background, emerging into a pool of light. It is the Germans, progressing ominously, brandishing oversized shears which they threateningly open and close. The Dude, now standing in a field of black, responds to the advancing Germans. He pivots and dashes, arms pumping. The field of black is interrupted by headlights. The Dude is jogging blearily down the middle of the Pacific Coast Highway. Cars speed by on either side, horns honking. With the BLOO-WHUP of a brief siren blast, a squad car with flashing gumballs approaches."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The Teapot is glancing around at the '80s futuristic landscape. It passes it the sandwich and taps its shoulder with one claw. The Cactus brushes this off. It is rising to its paws but wobbles dizzily. It is flanked on either side by Rain and the ginger cat, all three animals glaring solemnly down at the Teapot. It leans forward, dropping its sandwich off the bench. It peers at Vincent Cactus, who dances in and out of clarity. Knitted the garden together. Gazing up at the Teapot as its nose hits the mirror and flattens. The closing scene is a suggestively tilted chess piece flanked by a pair of checker pieces. The Teapot's nose is washed with a dazzling glow as the hallway opens onto a shiny checkerboard. In the center of the board stands Wendy Malone, humming jazzy melodies to the Elvis Presley tune. She dons a superhero cape and Viking helmet, has twisted braids, and clutches a scepter. The Teapot stands behind her and, pressed up against her, assists her with her follow-through as she hurls a checker piece. The board is bordered by a row of jazz musicians in glittery blouses, their hands on hips, swing-band style, their feet transforming the board into a tunnel leading to the pieces at the conclusion. But it is no longer a checker piece gliding between their feet—it is the Teapot itself, hovering inches off the board, the gadgets from its utility vest dangling freely. It is face down, its wings, missile-like, pressed against its frame. The Teapot spins its form around, executing a barrel-roll so that it is now floating along the board face-up. Now its perspective gazes up the pants of the passing musicians. The Teapot beams blissfully and performs a sidestroke maneuver so that it is once again drifting face-down. It glances ahead and its forward momentum flutters its ribbon. Approaching us, as we navigate through the last few sets of feet, are the incoming pieces. We strike the pieces, scattering them, and surge on into darkness. A figure descends into the shadow in slow motion—a shirtless man, giggling, its arms flailing. As it slips out of view, leaving darkness once more, three creatures are entering from the horizon, emerging into a splash of glow. It is the Parisians, moving threateningly, wielding oversized knitting needles which they menacingly clack. The Teapot, now standing in a meadow of darkness, responds to the approaching Parisians. It pivots and dashes, wings pumping. The meadow of darkness is broken by flashlights. The Teapot is sprinting groggily down the middle of the Route 66 Highway. Bicycles zoom by on either side, bells ringing. With the WHEE-WHOO of a brief alarm tone, a fire engine with flashing sparklers pulls up."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The Commander is inspecting the vintage '20s art nouveau design. He tosses him the notebook and scratches his chin with one knuckle. Oakfield shrugs this off. He is rising to his knees but staggers unsteadily. He is flanked on either side by Lee and the red-headed woman, all three women gazing solemnly down at the Commander. He leans back, dropping his notebook off the chair. He blinks at Charlie Oakfield, who drifts in and out of clarity. Completed the story arc. Staring up at the Commander as his elbow taps the glass and flattens. The movie logo is a suggestively reclining rocket flanked by a pair of planets. The Commander’s face is flushed with a radiant glow as the hallway expands into a lustrous dance floor. In the center of the floor stands Oscar Vance, humming a jazz ballad to the Frank Sinatra tune. He wears a feathered cape and Egyptian headdress, has twisted curls, and holds a saxophone. The Commander stands beside her and, supporting her firmly, assists her with her follow-through as she releases a frisbee. The floor is edged by a line of acrobats in shimmering leotards, their hands akimbo, Cirque-du-Soleil style, their feet spinning the floor into a tunnel leading to the targets at the end. But it is no longer a frisbee soaring through their arms--it is the Commander himself, drifting feet-high off the floor, the gadgets from his toolkit jiggling freely. He is face up, his legs, missile-like, tucked against his sides. The Commander spins his body around, executing a pirouette so that he is now floating along the floor face-down. Now his viewpoint gazes down the outfits of the hovering acrobats. The Commander grins blissfully and does a butterfly stroke motion so that he is once again floating face-up. He looks back and his backward motion sweeps back his hair. Approaching us, as we pass under the last few pairs of hands, are the looming targets. We strike the targets, scattering them, and continue on into darkness. An object ascends into the void in slow motion--a shirtless man, giggling, his arms flailing. As he ascends out of frame, leaving darkness again, three women are arriving from the background, entering into a halo of illumination. It is the Norwegians, approaching forebodingly, brandishing giant blowtorches which they threateningly ignite. The Commander, now standing in a sea of darkness, reacts to the approaching Norwegians. He turns and dashes, feet striking. The sea of darkness is pierced by starlights. The Commander is sprinting dizzily down the center of the Atlantic Seaboard Bridge. Ships sail past on either side, sirens wailing. With the HONK-WHIR of a brief klaxon burst, a fire truck with swirling beacons draws alongside."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The Dude is observing the '60s modern furniture. He offers him the sandwich and taps his elbow with a spoon. Treehorn dismisses this gesture. He is rising from his seat but stumbles dizzily. He is joined on either side by Woo and the blond man, all three men glaring sternly down at the Dude. He leans forward, dropping his sandwich off the table. He peers at Jackie Treehorn, who jumps in and out of view. United the room together. Looking up at the Dude as his face meets the cushion and flattens. The title logo is a suggestively upright golf club flanked by a pair of golf balls. The Dude's face is illuminated with a dazzling light as the corridor opens onto a sparkling golf course. In the center of the course stands Maude Lebowski, humming melodically to the Kenny Rogers tune. She wears a metallic wristband and Viking helmet, has braided buns, and holds a spear. The Dude stands behind her and, pressed up against her, assists with her swing as she tosses a frisbee. The fairway is bordered by a line of dancers in glittering hot pants, their arms aloft, Busby-Berkley style, their legs transforming the path into a tunnel leading to the hole at the end. But it is no longer a frisbee flying between their legs--it is the Dude himself, hovering inches off the grass, the gadgets from his utility belt dangling freely. He is face down, his arms, rocket-like, pressed against his sides. The Dude twirls his body around, executing a spin so that he is now gliding along the fairway face-up. Now his perspective looks up at the passing dancers’ costumes. The Dude grins dreamily and does a freestyle swim motion so that he is once again gliding face-down. He looks ahead and his forward momentum fans out his hair. Coming at us, as we navigate through the last few pairs of legs, are the approaching flags. We hit the flags, toppling them, and charge on into darkness. A figure floats down into the void in slow motion--a shirtless man, laughing, his arms flailing. As he exits the frame, leaving emptiness again, three men are moving in from the horizon, stepping into a spotlight. It is the Germans, advancing threateningly, brandishing oversized tongs which they ominously clack. The Dude, now standing in a sea of darkness, reacts to the advancing Germans. He pivots and sprints, elbows pumping. The sea of darkness is pierced by streetlights. The Dude is jogging sleepily down the middle of the Atlantic Ocean Highway. Bicycles whiz by on either side, bells ringing. With the WOO-WHEE of a short horn blast, a police van with flashing beacons rolls up."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The Cat is inspecting the '90s vintage wallpaper. She offers him the pastry and scratches her chin with a spoon. Oakbranch brushes this away. She is rising to her paws but wobbles unsteadily. She is flanked on both sides by Leaf and the brunette woman, all three women gazing sternly down at the Cat. She leans backward, knocking her confection to the floor. She peers at John Oakbranch, who drifts in and out of perception. Bound the curtain together. Peering up at the Cat as her paw smacks the curtain and flattens. The title logo is a provocatively tilted umbrella flanked by a pair of teacups. The Cat's expression is lit with a dazzling glow as the corridor reveals a shining salon. In the center of the salon stands Mary Skywalker, humming symphonic melody to the Elvis Presley tune. She sports a jeweled vest and Roman helmet, has twirled whiskers, and grips a fork. The Cat stands beside her and, leaning close to her, assists her with her follow-through as she tosses a frisbee. The path is bordered by a row of dancers in sparkly pantsuits, their arms crossed, Rockettes-style, their feet converting the path into a tunnel leading to the target at the end. But it is no longer a frisbee floating between their feet--it is the Cat itself, hovering inches above the path, the gadgets from her utility belt dangling loosely. She is face down, her paws, missile-like, pressed against her body. The Cat spins her form around, executing a twirl so that she is now sliding along the path face-up. Now her perspective views up the skirts of the passing dancers. The Cat grins blissfully and does a breaststroke movement so that she is once again gliding face-down. She gazes ahead and her forward propulsion lifts her ears. Approaching us, as we move through the final group of feet, are the nearing targets. We hit the targets, scattering them, and sweep onward into obscurity. A figure descends into the shadow in slow motion--a shirtless man, laughing, his arms waving. As he disappears from view, leaving shadow once more, three women are stepping in from the backdrop, entering a circle of radiance. It is the Australians, approaching eerily, clutching mammoth scissors which they threateningly snap. The Cat, now standing in a meadow of shadow, responds to the approaching Australians. She pivots and flees, paws pounding. The meadow of shadow is interrupted by flashlights. The Cat is jogging groggily down the center of the Atlantic Ocean Road. Trucks zoom by on either side, alarms blaring. With the WEE-OO of a brief whistle sound, a patrol van with blinking marbles draws near."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The Dude surveys the '60s style decor, feeling woozy and squinting at Jackie Treehorn. He spills his drink as Woo and a blond man flank him, looking grim. The scene shifts to a gleaming bowling alley where Maude Lebowski sings operatically, clad in Norse gear. The Dude, pressed against her, assists her in releasing a bowling ball. The lane transforms into a tunnel of chorines in mini-skirts as the Dude, now levitating like a bowling ball, glides along. He dreamily observes, performing a barrel-roll, before scattering the pins into darkness. A topless woman descends into the blackness, followed by ominous Germans with oversized shears. The Dude, now on a black field, reacts in panic and flees. He finds himself running down the Pacific Coast Highway, surrounded by blaring horns, as a squad car approaches with flashing lights."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "With the BLOOWHUP of a short siren blast a squad car with flashing gumballs pulls up Cars rush by on either side horns blaring The Dude is running blearily down the middle of the Pacific Coast Highway The field of black is punctured by headlights He turns and runs fists pumping The Dude now standing in a field of black reacts to the advancing Germans It is the Germans advancing ominously wielding oversized shears which they menacingly scissor As she drops out of frame leaving blackness again three men are entering from the background emerging into a pool of light a topless woman squealing her legs kicking A body drops down into the blackness in slow motion We hit the pins scattering them and rush on into black Coming at us as we go through the last few pairs of legs are the approaching pins He looks forward and his forward momentum blows back his hair The Dude smiles dreamily and does a backstroke motion so that he is once again gliding facedown Now his point of view looks up the dresses of the passing chorines The Dude twists his body around performing a barrelroll so that he is now gliding along the lane faceup He is face down his arms torpedolike pressed against his sides rolling between their legsit is the Dude himself levitating inches off the lane the tools from his utility belt swinging free But it is no longer a bowling ball The lane is straddled by a line of chorines in spangly miniskirts their arms akimbo BusbyBerkley style their legs turning the lane into a tunnel leading to the pins at the end The Dude stands behind her and pressed up against her helps her with her followthrough as she releases a bowling ball She wears an armored breastplate and Norse headgear has braided pigtails and holds a trident In the center of the alley stands Maude Lebowski singing operatic harmony to the Kenny Rogers song The Dude's face is washed with a brilliant light as the corridor opens onto a gleaming bowling alley The title logo is a suggestively upright bowling pin flanked by a pair of bowling balls Looking up at the Dude as his face hits the glass and squishes Tied the room together He squints at Jackie Treehorn who swims in and out of focus He tips forward spilling his drink off the table He is joined on either side by Woo and the blond man all three men looking grimly down at the Dude He is getting to his feet but sways woozily Treehorn waves this off He hands him the drink and taps his forehead with one finger The Dude is looking around at the '60s modern decor"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He tips forward spilling his drink off the table Now his point of view looks up the dresses of the passing chorines The Dude smiles dreamily and does a backstroke motion so that he is once again gliding facedown She wears an armored breastplate and Norse headgear has braided pigtails and holds a trident A body drops down into the blackness in slow motion The Dude now standing in a field of black reacts to the advancing Germans But it is no longer a bowling ball The Dude's face is washed with a brilliant light as the corridor opens onto a gleaming bowling alley rolling between their legsit is the Dude himself levitating inches off the lane the tools from his utility belt swinging free In the center of the alley stands Maude Lebowski singing operatic harmony to the Kenny Rogers song As she drops out of frame leaving blackness again three men are entering from the background emerging into a pool of light The lane is straddled by a line of chorines in spangly miniskirts their arms akimbo BusbyBerkley style their legs turning the lane into a tunnel leading to the pins at the end a topless woman squealing her legs kicking The title logo is a suggestively upright bowling pin flanked by a pair of bowling balls Looking up at the Dude as his face hits the glass and squishes He turns and runs fists pumping He squints at Jackie Treehorn who swims in and out of focus Coming at us as we go through the last few pairs of legs are the approaching pins The Dude is looking around at the '60s modern decor Cars rush by on either side horns blaring The Dude stands behind her and pressed up against her helps her with her followthrough as she releases a bowling ball The Dude twists his body around performing a barrelroll so that he is now gliding along the lane faceup Treehorn waves this off The Dude is running blearily down the middle of the Pacific Coast Highway It is the Germans advancing ominously wielding oversized shears which they menacingly scissor He looks forward and his forward momentum blows back his hair He is getting to his feet but sways woozily We hit the pins scattering them and rush on into black He is joined on either side by Woo and the blond man all three men looking grimly down at the Dude The field of black is punctured by headlights With the BLOOWHUP of a short siren blast a squad car with flashing gumballs pulls up He is face down his arms torpedolike pressed against his sides He hands him the drink and taps his forehead with one finger Tied the room together"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He is face down his arms torpedolike pressed against his sides The Dude twists his body around performing a barrelroll so that he is now gliding along the lane faceup Now his point of view looks up the dresses of the passing chorines The Dude smiles dreamily and does a backstroke motion so that he is once again gliding facedown He looks forward and his forward momentum blows back his hair Coming at us as we go through the last few pairs of legs are the approaching pins We hit the pins scattering them and rush on into black A body drops down into the blackness in slow motion a topless woman squealing her legs kicking As she drops out of frame leaving blackness again three men are entering from the background emerging into a pool of light It is the Germans advancing ominously wielding oversized shears which they menacingly scissor The Dude now standing in a field of black reacts to the advancing Germans He turns and runs fists pumping The field of black is punctured by headlights The Dude is running blearily down the middle of the Pacific Coast Highway Cars rush by on either side horns blaring With the BLOOWHUP of a short siren blast a squad car with flashing gumballs pulls up The Dude is looking around at the '60s modern decor He hands him the drink and taps his forehead with one finger Treehorn waves this off He is getting to his feet but sways woozily He is joined on either side by Woo and the blond man all three men looking grimly down at the Dude He tips forward spilling his drink off the table He squints at Jackie Treehorn who swims in and out of focus Tied the room together Looking up at the Dude as his face hits the glass and squishes The title logo is a suggestively upright bowling pin flanked by a pair of bowling balls The Dude's face is washed with a brilliant light as the corridor opens onto a gleaming bowling alley In the center of the alley stands Maude Lebowski singing operatic harmony to the Kenny Rogers song She wears an armored breastplate and Norse headgear has braided pigtails and holds a trident The Dude stands behind her and pressed up against her helps her with her followthrough as she releases a bowling ball The lane is straddled by a line of chorines in spangly miniskirts their arms akimbo BusbyBerkley style their legs turning the lane into a tunnel leading to the pins at the end But it is no longer a bowling ball rolling between their legsit is the Dude himself levitating inches off the lane the tools from his utility belt swinging free"
        }
      ]
    }
  ]
}