{
  "ground_truth": "He puts his arm around her and drags her on. He comes to a small canvas tent with a sign on it - TOILET. He holds her hand. Jody walks inside the canvas flap and vanishes from sight. We can still see his hand, holding Jude's. She leans against the canvas, looking bored. She stands there, listening to the sound of him urinate. Her eyes flick around the carnival. They settle on a tall dark-haired man in a dark jacket. He nods. He staggers out, buttoning up. He goes to kiss her. She turns her head away. She pulls him over toward the water. Jody follows her as she walks backward, drawing him on. He moves his hips to a song as Jude leads him over the beach, under a train trestle. He sinks down on his knees toward her. She wraps her arms around his neck and kisses him. Jody writhes on top of her, fumbling with his belt. Jude cocks one eye upward. A shadow falls across them. A gun is put to his head. He turns around, drunkenly. The gun whacks him across the cheek, and he falls sideways. Jude scrambles to her feet and darts like an animal through a field. Jody feels his cheek. He can see her blond head vanishing among the fields. He looks up and sees a group of men around him. The tallest of them, Fergus, cocks the gun. A mini, driving down a country road. Two men in the front, three in the back. On the floor of the car Jody lies, with three pairs of feet on top of him, a black bag over his head and the barrel of a gun dangling close to his face. Fergus holds the gun. He is smoking a cigarette. His movements are slow and somewhat innocent. Jody pulled through and tied to a chair. Maguire, a small lean man, talks to him through the hood. Jody is motionless under the black hood. All the men are drinking tea. The blond woman comes in with a plate and some food on it. Jody sits as still as a grave, saying nothing. Fergus is sitting by a chair, gun in his hand, watching the prisoner. Jude comes in, with a flashlight. She moves over to him. She prods him in the legs with her foot. Then she lifts the hood ever so slightly, to peer inside. Suddenly the man moves like lightning, jerking his head down so the hood comes off, throwing his body, tied to the chair, over Jude. He pins her to the ground, his body bent with the chair. He writhes on top of her in a grotesque parody of love.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He places his limb around her and hauls her along. He arrives at a little fabric shelter with a placard on it - TOILET. He clutches her hand. Jody strides inside the fabric flap and disappears from view. We can still perceive his hand, gripping Jude's. She leans against the fabric, appearing uninterested. She stands there, heeding the noise of him urinate. Her eyes dart around the fair. They rest on a lofty dark-haired figure in a dark coat. He gestures. He totters out, fastening up. He proceeds to kiss her. She turns her face away. She tugs him over toward the liquid. Jody trails her as she steps backward, pulling him along. He swings his hips to a melody as Jude guides him over the shore, beneath a railway trestle. He falls down on his knees toward her. She winds her limbs around his neck and kisses him. Jody squirms on top of her, fumbling with his strap. Jude tilts one eye upward. A shade descends across them. A firearm is placed to his head. He spins around, drunkenly. The firearm smacks him across the jaw, and he collapses sideways. Jude scrambles to her feet and dashes like a creature through a pasture. Jody touches his jaw. He can perceive her blond head disappearing among the pastures. He gazes up and sees a cluster of men around him. The tallest of them, Fergus, tilts the firearm. A mini, motoring down a rural route. Two men in the front, three in the back. On the bottom of the automobile Jody lies, with three pairs of feet atop him, a dark sack over his head and the muzzle of a firearm dangling close to his visage. Fergus grips the firearm. He is puffing a cigarette. His motions are slow and somewhat naive. Jody hauled through and secured to a seat. Maguire, a little lean man, speaks to him through the cover. Jody is still under the dark cover. All the men are sipping tea. The blond woman enters with a platter and some nourishment on it. Jody sits as immobile as a grave, uttering nothing. Fergus is sitting by a seat, firearm in his hand, observing the captive. Jude enters, with a torch. She moves over to him. She pokes him in the limbs with her foot. Then she raises the cover ever so slightly, to peer inside. Suddenly the man acts like lightning, jerking his head down so the cover comes off, throwing his physique, secured to the seat, over Jude. He pins her to the earth, his physique bent with the seat. He squirms on top of her in a grotesque parody of affection."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He puts his arm around her and drags her on. A small canvas tent with a sign on it - TOILET - is approached by him. Her hand is held by him. The canvas flap is walked inside by Jody and she vanishes from sight. His hand can still be seen by us, holding Jude's. The canvas is leaned against by her, looking bored. There she stands, listening to the sound of him urinate. The carnival is flicked around by her eyes. A tall dark-haired man in a dark jacket is settled on by them. He nods. Buttoning up, he staggers out. A kiss is attempted by him towards her. Her head is turned away by her. Toward the water, he is pulled over by her. As she walks backward, she is followed by Jody, being drawn on. His hips are moved to a song as he is led by Jude over the beach, under a train trestle. He sinks down on his knees toward her. His neck is wrapped around with her arms as she kisses him. Jody writhes on top of her, fumbling with his belt. One eye is cocked upward by Jude. Across them, a shadow falls. A gun is put to his head. Around drunkenly, he turns. The gun whacks him across the cheek, and sideways, he falls. To her feet, Jude scrambles and like an animal through a field, she darts. His cheek is felt by Jody. Her blond head can be seen by him vanishing among the fields. Upward, he looks and sees a group of men around him. The gun is cocked by the tallest of them, Fergus. Down a country road, a mini is driven. In the front, two men, three in the back. On the floor of the car, Jody lies, with three pairs of feet on top of him, a black bag over his head, and the barrel of a gun dangling close to his face. The gun is held by Fergus. A cigarette is smoked by him. His movements are slow and somewhat innocent. Jody, pulled through and tied to a chair, is talked to by Maguire, a small lean man, through the hood. Under the black hood, Jody remains motionless. Tea is being drunk by all the men. The blond woman comes in with a plate and some food on it. Jody, as still as a grave, sits, saying nothing. Fergus, sitting by a chair, has the gun in his hand, watching the prisoner. Jude, with a flashlight, comes in. She moves over to him. His legs are prodded by her with her foot. Then the hood is lifted ever so slightly by her, to peer inside. Suddenly the man moves like lightning, jerking his head down so the hood comes off, throwing his body, tied to the chair, over Jude. To the ground, he pins her, his body bent with the chair. On top of her, he writhes in a grotesque parody of love."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He puts his arm around her and leads her on. They reach a small tent with a TOILET sign. He holds her hand as Jody enters, vanishing from view. Jude, looking bored, listens to him urinate, her eyes scanning the carnival. She notices a tall man in a dark jacket who nods. Jody emerges, buttoning up, and attempts to kiss her. She turns away, pulling him toward the water. Jody follows as she walks backward over the beach, moving under a train trestle. He kneels, she wraps her arms around him, and they kiss. Jody fumbles with his belt. Jude glances upward as a shadow looms over them. A gun is held to Jody's head, and he's struck across the cheek, falling sideways. Jude flees through a field. Jody watches her disappear among the fields, then notices men surrounding him. Fergus, the tallest, holds a gun. A mini drives along a country road with two men in front and three in the back. Jody lies on the floor, a black bag over his head, gun barrel close to his face. Fergus, smoking a cigarette, moves slowly. Jody, bound to a chair, is motionless under the hood as Maguire talks to him. The men drink tea while a blond woman brings food. Jody remains silent. Fergus sits, gun in hand, watching. Jude enters with a flashlight, prodding Jody's legs, lifting the hood slightly. Suddenly, Jody jerks his head, removing the hood, and tumbles over Jude, pinning her with the chair in a grotesque parody of love."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He puts his arm around her and leads her to a small canvas tent labeled TOILET. Holding hands, Jody enters while Jude leans against the tent, looking bored, listening to him urinate. Her gaze shifts around the carnival to a tall man in a dark jacket. He nods. Jody exits, attempting a kiss, but she turns away, pulling him toward the water. He follows, swaying to a song as they head over the beach under a train trestle. He kneels; she embraces and kisses him. Jody fumbles with his belt as a shadow falls. A gun is placed to his head; he turns drunkenly. The gun strikes his cheek, and he collapses. Jude escapes into the field. Jody sees her disappearing blond head before noticing men surrounding him. Fergus cocks the gun. In a car, Jody lies under a black hood, gun barrel near his face. Fergus holds the gun, smoking casually. Jody is tied to a chair, Maguire addresses him through the hood while the men drink tea. A blond woman brings food. Jody remains motionless. Jude enters with a flashlight, prodding him. She slightly lifts the hood, but Jody moves quickly, dislodging it and overturning the chair onto Jude, pinning her grotesquely."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He wraps his arm securely around her shoulders and insistently drags her onward. Their destination is a modest canvas tent that has a sign prominently displayed on it reading - TOILET. Taking her hand in his, he leads her firmly towards it. Jody steps through the canvas flap, disappearing from view. Yet, we are still able to see his hand, firmly grasping Jude’s. She leans casually against the canvas, exuding an air of boredom as she stands there. Her ears pick up the unmistakable sound of him urinating within the tent. Her eyes casually flicker around the bustling carnival scene. Her gaze eventually lands on a tall, dark-haired man clad in a dark jacket. He acknowledges her with a nod. Emerging unsteadily, he buttons up and attempts to kiss her affectionately. She instinctively turns her head away to avoid the kiss. She takes charge and pulls him towards the water. Walking backward, Jude continues to draw him along, and Jody follows her. He sways his hips rhythmically to a song as Jude guides him over the sandy beach and beneath a train trestle. Sinking to his knees before her, he is enveloped in her arms as she lovingly wraps them around his neck and kisses him. Jody writhes on top of her, awkwardly fumbling with his belt. Jude lifts one eye upward, aware of their surroundings. Suddenly, a looming shadow casts over them. A gun is swiftly placed to his head. He turns around in a drunken haze, confused. Without warning, the gun strikes him hard across the cheek, causing him to topple sideways. In a flash, Jude scrambles to her feet and dashes away like a startled animal through the expansive field. Jody, touching his smarting cheek, looks on as her blond head disappears into the distance among the fields. He glances upward and notices a group of men encircling him menacingly. The tallest among them, Fergus, coolly cocks the gun in his hand. A mini car drives along a winding country road, with two men seated in the front and three crammed into the back. On the car’s floor, Jody lies, with three pairs of feet unceremoniously resting on top of him, a suffocating black bag covering his head, and the intimidating barrel of a gun dangling perilously close to his face. Fergus, who is holding the gun, is calmly smoking a cigarette. His movements are deliberate, slow, and almost innocently unperturbed. Eventually, Jody is dragged out and tied firmly to a chair. Maguire, a small yet lean man, speaks to him through the oppressive hood. Jody remains eerily motionless beneath the dark hood, silent and still. Meanwhile, all the men leisurely sip tea. A blond woman enters, carrying a plate adorned with some food. Jody, as still as a grave, utters not a word. Fergus sits in a chair nearby, gun in hand, vigilantly observing the captive. Jude enters carrying a flashlight. She moves purposefully over to him and nudges him in the legs with her foot. Then, she gently lifts the hood ever so slightly to peer inside. Suddenly, with surprising swiftness, the man moves like lightning. He jerks his head downwards, causing the hood to slip off, and throws his tied body over Jude, pinning her to the ground. Bent awkwardly with the chair, he writhes on top of her in a grotesque and unsettling parody of love."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He wraps his arm snugly and securely around her shoulders, persistently pulling her forward with determination. Their ultimate destination is a humble canvas tent, upon which a sign is prominently displayed, reading in bold letters - TOILET. Taking her hand firmly in his, he leads her determinedly towards it. Jody steps through the canvas flap of the tent, swiftly disappearing from view. Yet, we can still see his hand, maintaining a firm grasp on Jude’s. She stands casually against the canvas structure, exuding an unmistakable air of boredom and nonchalance as she occupies her position there. Her ears catch the unmistakable sound of him relieving himself within the confines of the tent. Her eyes idly flicker around, surveying the bustling and lively carnival scene surrounding them. Her gaze eventually comes to rest on a tall, dark-haired man who is clad in a dark jacket. He acknowledges her presence with a subtle nod. Emerging unsteadily, Jody buttons up and makes an attempt to kiss her affectionately. She instinctively turns her head to the side, deliberately avoiding the kiss. Taking charge, she pulls him towards the water. Walking backward, Jude continues to draw him along, with Jody dutifully following her lead. He sways his hips rhythmically to the beat of a distant song as Jude guides him across the sandy beach and under the train trestle. Sinking to his knees before her, he finds himself enveloped in her arms as she gently wraps them around his neck and kisses him tenderly. Jody awkwardly writhes on top of her, clumsily fumbling with his belt. Jude raises one eye upward, remaining acutely aware of their surroundings. Suddenly, a looming shadow is cast over them. A gun is swiftly positioned to his head. He turns around in a drunken haze, utterly confused. Without warning, the gun strikes him hard across the cheek, causing him to topple sideways. In an instant, Jude scrambles to her feet and dashes away with the speed and agility of a startled animal, disappearing into the expansive field. Jody, touching his smarting cheek, watches as her blond head fades into the distance among the fields. He directs his gaze upward and notices a group of men encircling him with a menacing presence. The tallest among them, Fergus, coolly cocks the gun in his hand. A mini car winds its way along a twisting country road, with two men seated in the front and three crammed into the back. On the car’s floor, Jody lies with three pairs of feet unceremoniously resting on top of him, a suffocating black bag covering his head, and the intimidating barrel of a gun dangling perilously close to his face. Fergus, who is holding the gun, calmly smokes a cigarette. His movements are deliberate, slow, and almost innocently unperturbed. Eventually, Jody is dragged out of the car and tied securely to a chair. Maguire, a small yet lean man, speaks to him through the oppressive hood. Jody remains eerily motionless beneath the dark hood, maintaining a silent stillness. Meanwhile, all the men leisurely sip tea. A blond woman enters, carrying a plate adorned with some food. Jody, as still as a grave, maintains his silence and utters not a word. Fergus sits in a chair nearby, gun in hand, vigilantly observing the captive. Jude enters, carrying a flashlight. She moves with purpose over to him and nudges him in the legs with her foot. Then, she gently lifts the hood ever so slightly to peer inside. Suddenly, with surprising swiftness, the man moves like lightning. He jerks his head downwards, causing the hood to slip off, and throws his tied body over Jude, pinning her to the ground. Bent awkwardly with the chair, he writhes on top of her in a grotesque and unsettling parody of love."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He gently places his arm around her shoulders and begins to pull her along with him, guiding her forward. As they approach a small canvas tent, he points out a sign labeled \"TOILET\" and continues to lead her by holding her hand firmly. Jody then steps forward, moving aside the canvas flap of the tent, and enters, disappearing from view, though his hand remains visible as it still grips Jude's. Jude, maintaining her stance outside the tent, leans back casually against the canvas, her posture radiating a sense of boredom as she waits. Her attention drifts, and her eyes roam over the carnival's lively scene until they pause on a tall, dark-haired man clad in a dark jacket, who acknowledges her with a nod. Meanwhile, Jody emerges from the tent, somewhat unsteady as he buttons his clothing, and instinctively leans in to kiss Jude. However, she turns her head away dismissively, evading his advance, and instead beckons him to follow her toward the inviting water's edge. Jude continues to lead him by walking backward, encouraging him with her gaze and gestures. Jody, caught up in the moment, begins to sway his hips in rhythm to a distant song as Jude guides him over the sandy expanse of the beach and beneath a shadowy train trestle. As they find a secluded spot, he gradually lowers himself onto his knees before her. Jude responds by wrapping her arms around his neck, drawing him closer, and they share an intimate kiss. As the kiss deepens, Jody clumsily moves over her, struggling to unfasten his belt with fumbling fingers. Jude, sensing something amiss, subtly shifts her gaze upward, only to notice a shadow looming ominously over them. In an instant, a gun is produced and pressed against Jody's head, prompting him to swivel around in a drunken haze. The gun is then brought down harshly against his cheek, causing him to collapse sideways onto the ground. In a burst of self-preservation, Jude springs to her feet and instinctively bolts away, darting swiftly through the open field like a startled animal. Jody, left dazed, touches his cheek gingerly as he watches her blond figure recede into the distance among the fields. His attention is then captured by the presence of multiple men surrounding him, the tallest of whom, named Fergus, levels a gun with a cold certainty. Meanwhile, a mini navigates along a country road, occupied by two men in the front and three in the back, where Jody is cramped on the floor, his body subjected to the weight of three pairs of feet. A black bag covers his head, and the barrel of a gun hovers precariously close to his face, controlled by Fergus, who placidly smokes a cigarette, his demeanor unhurried and paradoxically naïve. Jody later finds himself forcibly dragged into a room and bound to a chair, where a small, lean man named Maguire addresses him from beyond the hood that obscures Jody's vision. He remains unnervingly still and silent beneath the black fabric that covers his face. The men around him casually drink tea, undisturbed by the situation. The entrance of a blond woman, who brings a plate of food, goes unnoticed by Jody as he remains as silent and motionless as a grave. Fergus sits nearby, vigilantly holding a gun and maintaining a watchful eye on the captive. As Jude enters with a flashlight, she approaches Jody and uses her foot to nudge his legs, checking for any response. She then carefully lifts the hood just enough to peer inside, but in a sudden, explosive movement, Jody jerks his head downward, causing the hood to fall away, and throws his bound body over Jude, pinning her down to the ground in a bizarre and grotesque mimicry of intimacy, his movements constrained yet frenzied within the confines of the chair."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He puts his arm around her, guiding her to a small canvas tent labeled TOILET, holding her hand as she enters while he remains outside, leaving only his hand visible. Jude leans against the canvas, bored, observing the carnival before locking eyes with a dark-haired man in a jacket who nods back. Jody emerges, adjusting his clothes, and attempts to kiss her, but she turns away, leading him toward the water as he dances to a song. They move along the beach and under a train trestle, where he kneels, and she embraces and kisses him. As Jody clumsily fumbles with his belt, a shadow looms over them. A gunman appears, striking Jody with the weapon, causing him to fall. Jude quickly escapes, disappearing into the fields, as Jody watches her flee. He notices a group of men, with the tallest, Fergus, holding a cocked gun. In a mini car on a country road, two men drive while three others sit in the back with Jody lying on the floor, a black bag over his head and a gun close to his face, held by Fergus, who smokes nonchalantly. Jody is restrained and tied to a chair, while Maguire, a small lean man, speaks to him through the hood. Amidst this, the men drink tea and a blond woman brings a plate of food. Jody remains silent and still, watched by Fergus, who holds a gun. Jude enters with a flashlight and approaches Jody, nudging him with her foot before slightly lifting the hood to peek inside. Suddenly, Jody acts swiftly, dislodging the hood as he topples over Jude, pinning her beneath him while still bound to the chair, in a grotesque mimicry of affection."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He puts his arm around her and drags her on, the festive atmosphere of the carnival buzzing around them. He comes to a small canvas tent with a sign on it - TOILET, a common sight at temporary events, providing basic amenities. He holds her hand. Jody walks inside the canvas flap and vanishes from sight. We can still see his hand, holding Jude's, against the background din of laughter and music. She leans against the canvas, looking bored, as if the vibrant colors and sounds no longer amuse her. She stands there, listening to the sound of him urinate, an oddly intimate moment in a public setting. Her eyes flick around the carnival. They settle on a tall dark-haired man in a dark jacket, his presence almost blending into the crowd. He nods. He staggers out, buttoning up, the effects of the night evident in his unsteady movements. He goes to kiss her. She turns her head away, perhaps annoyed by his inebriation. She pulls him over toward the water, the moonlight shimmering on the surface, offering a brief escape from the clamor of the carnival. Jody follows her as she walks backward, drawing him on, her steps light on the sandy terrain. He moves his hips to a song playing faintly in the distance as Jude leads him over the beach, under a train trestle, a structure that provides a rare canopy of quiet. He sinks down on his knees toward her. She wraps her arms around his neck and kisses him. Jody writhes on top of her, fumbling with his belt in a clumsy attempt at intimacy. Jude cocks one eye upward. A shadow falls across them, the darkness suddenly more menacing. A gun is put to his head. He turns around, drunkenly, not fully comprehending the danger. The gun whacks him across the cheek, a brutal awakening, and he falls sideways. Jude scrambles to her feet and darts like an animal through a field, the fear propelling her with speed. Jody feels his cheek, where pain now blooms. He can see her blond head vanishing among the fields, a fleeting hint of safety. He looks up and sees a group of men around him, their silhouettes imposing. The tallest of them, Fergus, cocks the gun, a chilling reminder of their intent. A mini, driving down a country road typical of rural backdrops. Two men in the front, three in the back, tightly packed in the small vehicle. On the floor of the car Jody lies, with three pairs of feet on top of him, a black bag over his head and the barrel of a gun dangling close to his face. Fergus holds the gun, taking on the role of enforcer. He is smoking a cigarette, the smoke curling lazily in the confined space. His movements are slow and somewhat innocent, a stark contrast to the situation. Jody pulled through and tied to a chair, the reality of captivity setting in. Maguire, a small lean man known for his sharp tongue, talks to him through the hood in a voice that lacks sympathy. Jody is motionless under the black hood, silence his only companion. All the men are drinking tea, a strange normalcy amid the tension. The blond woman, previously seen at the carnival, comes in with a plate and some food on it, an offering that feels out of place. Jody sits as still as a grave, saying nothing. Fergus is sitting by a chair, gun in his hand, watching the prisoner, vigilance etched into his posture. Jude comes in, with a flashlight, her expression unreadable. She moves over to him. She prods him in the legs with her foot, testing his response. Then she lifts the hood ever so slightly, to peer inside, curiosity mingling with caution. Suddenly the man moves like lightning, a surge of repressed energy, jerking his head down so the hood comes off, throwing his body, tied to the chair, over Jude. He pins her to the ground, his body bent with the chair, a desperate attempt at freedom. He writhes on top of her in a grotesque parody of love, the scene a twisted mirror of their earlier embrace."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He puts his arm around her and drags her on. He comes to a small canvas tent with a sign on it. TOILET. He holds her hand. Jody walks inside the canvas flap and vanishes from sight. We can still see his hand holding Jude's. She leans against the canvas looking bored. She stands there listening to the sound of him urinate. Her eyes flick around the carnival. They settle on a tall darkhaired man in a dark jacket. He nods. He staggers out buttoning up. He goes to kiss her. She turns her head away. She pulls him over toward the water. Jody follows her as she walks backward drawing him on. He moves his hips to a song as Jude leads him over the beach under a train trestle. He sinks down on his knees toward her. She wraps her arms around his neck and kisses him. Jody writhes on top of her fumbling with his belt. Jude cocks one eye upward. A shadow falls across them. A gun is put to his head. He turns around drunkenly. The gun whacks him across the cheek and he falls sideways. Jude scrambles to her feet and darts like an animal through a field. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. Jody feels his cheek. He can see her blond head vanishing among the fields. He looks up and sees a group of men around him. The tallest of them. Fergus cocks the gun. A mini driving down a country road. Two men in the front three in the back. On the floor of the car. Jody lies with three pairs of feet on top of him. a black bag over his head and the barrel of a gun dangling close to his face. Fergus holds the gun. He is smoking a cigarette. His movements are slow and somewhat innocent. Jody pulled through and tied to a chair. Maguire a small lean man talks to him through the hood. Jody is motionless under the black hood. All the men are drinking tea. The blond woman comes in with a plate and some food on it. Jody sits as still as a grave saying nothing. Fergus is sitting by a chair gun in his hand watching the prisoner. Jude comes in with a flashlight. She moves over to him. She prods him in the legs with her foot. Then she lifts the hood ever so slightly to peer inside. Suddenly the man moves like lightning jerking his head down so the hood comes off throwing his body tied to the chair over Jude. He pins her to the ground his body bent with the chair. He writhes on top of her in a grotesque parody of love."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He puts his arm around her and drags her on. He comes to a small canvas tent with a sign on it. TOILET. He holds her hand. Jody walks inside the canvas flap and vanishes from sight. We can still see his hand holding Jude's. She leans against the canvas looking bored. She stands there listening to the sound of him urinate. Her eyes flick around the carnival. They settle on a tall darkhaired man in a dark jacket. He nods. He staggers out buttoning up. He goes to kiss her. She turns her head away. She pulls him over toward the water. Jody follows her as she walks backward drawing him on. He moves his hips to a song as Jude leads him over the beach under a train trestle. He sinks down on his knees toward her. She wraps her arms around his neck and kisses him. Jody writhes on top of her fumbling with his belt. Jude cocks one eye upward. A shadow falls across them. A gun is put to his head. He turns around drunkenly. The gun whacks him across the cheek and he falls sideways. Jude scrambles to her feet and darts like an animal through a field. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Jody feels his cheek. He can see her blond head vanishing among the fields. He looks up and sees a group of men around him. The tallest of them. Fergus cocks the gun. A mini driving down a country road. Two men in the front three in the back. On the floor of the car. Jody lies with three pairs of feet on top of him. a black bag over his head and the barrel of a gun dangling close to his face. Fergus holds the gun. He is smoking a cigarette. His movements are slow and somewhat innocent. Jody pulled through and tied to a chair. Maguire a small lean man talks to him through the hood. Jody is motionless under the black hood. All the men are drinking tea. The blond woman comes in with a plate and some food on it. Jody sits as still as a grave saying nothing. Fergus is sitting by a chair gun in his hand watching the prisoner. Jude comes in with a flashlight. She moves over to him. She prods him in the legs with her foot. Then she lifts the hood ever so slightly to peer inside. Suddenly the man moves like lightning jerking his head down so the hood comes off throwing his body tied to the chair over Jude. He pins her to the ground his body bent with the chair. He writhes on top of her in a grotesque parody of love."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He puts his arm around her and drags her on. He comes to a small canvas tent with a sign on it. TOILET. He holds her hand. Jody walks inside the canvas flap and vanishes from sight. We can still see his hand holding Jude's. She leans against the canvas looking bored. She stands there listening to the sound of him urinate. Her eyes flick around the carnival. They settle on a tall darkhaired man in a dark jacket. He nods. He staggers out buttoning up. He goes to kiss her. Jody pulled through and tied to a chair. Maguire a small lean man talks to him through the hood. Jody is motionless under the black hood. All the men are drinking tea. The blond woman comes in with a plate and some food on it. Jody sits as still as a grave saying nothing. Fergus is sitting by a chair gun in his hand watching the prisoner. Jude comes in with a flashlight. She moves over to him. She prods him in the legs with her foot. Then she lifts the hood ever so slightly to peer inside. Suddenly the man moves like lightning jerking his head down so the hood comes off throwing his body tied to the chair over Jude. He pins her to the ground his body bent with the chair. He writhes on top of her in a grotesque parody of love."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He puts his arm around her and drags her on. He comes to a small canvas tent with a sign on it. TOILET. He holds her hand. Jody walks inside the canvas flap and vanishes from sight. She moves over to him. She prods him in the legs with her foot. Then she lifts the hood ever so slightly to peer inside. Suddenly the man moves like lightning jerking his head down so the hood comes off throwing his body tied to the chair over Jude. He pins her to the ground his body bent with the chair. He writhes on top of her in a grotesque parody of love."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The cat wraps its tail around the lamp and rolls it away. The crow lands on a large wooden barrel with a poster on it - KITCHEN. The mouse nudges its paw. Alex leaps beneath the wooden lid and disappears from view. We can still glimpse its paw, nudging Jamie's. It leans against the barrel, looking puzzled. The pig rests there, straining to hear the whisper of it scattering seeds. Its ears twitch around the festival. They focus on a tiny blonde cat in a red scarf. It blinks. It totters in, fastening a cap. It tries to hug it. The owl swivels its head away. The owl tugs it away toward the mountain. Alex follows it, stumbling forward, beckoning it on. It swings its arms to a tune as Jamie guides it past the meadow, over a wooden bridge. It collapses on its elbows next to it. The owl drapes its wings over its shoulder and pecks it. Alex squirms beneath it, fumbling with its hat. Jamie squints one beak upward. A cloud drifts above them. A feather is placed on its beak. It twists around, reluctantly. The feather taps it across the nose, and it rolls sideways. Jamie leaps to its wings and flutters like a fish through a pond. Alex brushes its nose. It spies its black feathers vanishing among the woods. It gazes down and spots a herd of sheep beside it. The shortest of them, Finley, waves the feather. A bicycle, cruising down a city street. Two birds in the front, three in the back. Below the seat Alex lies, with four pairs of hooves on top of it, a white sheet over its ears and the stem of a feather bobbing near its nose. Finley grips the feather. It is nibbling a cookie. Its actions are quick and somewhat clumsy. Alex pulled across and fastened to a couch. Rory, a tall round bird, sings to it through the blanket. Alex is restless under the white blanket. All the animals are sipping cocoa. The black crow enters with a dish and some crumbs on it. Alex perches as silent as a whisper, voicing nothing. Finley is perched by a stool, feather in its beak, observing the guest. Jamie appears, with a lantern. It drifts over to it. It taps it on the feet with its wing. Then it tugs the blanket slightly, to peek inside. Suddenly the frog leaps like thunder, tossing its beak upward so the blanket slips off, wrenching its body, fastened to the couch, over Jamie. It pins it to the floor, its body curved with the couch. It contorts beneath it in a bizarre mimicry of play."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Jody and Jude visit a carnival, where Jody leaves for a bathroom break. Jude notices a tall man who later confronts them with a gun. Jody is struck on the cheek and Jude escapes. A group of men, led by Fergus, captures Jody, who lies restrained in a car with a bag over his head. Later, Jody is tied to a chair, silent under a hood as Fergus watches over him. Jude returns, lifting the hood slightly, prompting Jody to violently throw himself, still bound, over her. This action pins Jude to the ground as Jody struggles atop her in a forced, mocking embrace."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He writhes on top of her in a grotesque parody of love He pins her to the ground his body bent with the chair Suddenly the man moves like lightning jerking his head down so the hood comes off throwing his body tied to the chair over Jude Then she lifts the hood ever so slightly to peer inside She prods him in the legs with her foot She moves over to him Jude comes in with a flashlight Fergus is sitting by a chair gun in his hand watching the prisoner Jody sits as still as a grave saying nothing The blond woman comes in with a plate and some food on it All the men are drinking tea Jody is motionless under the black hood Maguire a small lean man talks to him through the hood Jody pulled through and tied to a chair His movements are slow and somewhat innocent He is smoking a cigarette Fergus holds the gun a black bag over his head and the barrel of a gun dangling close to his face Jody lies with three pairs of feet on top of him On the floor of the car Two men in the front three in the back A mini driving down a country road Fergus cocks the gun The tallest of them He looks up and sees a group of men around him He can see her blond head vanishing among the fields Jody feels his cheek Jude scrambles to her feet and darts like an animal through a field The gun whacks him across the cheek and he falls sideways He turns around drunkenly A gun is put to his head A shadow falls across them Jude cocks one eye upward Jody writhes on top of her fumbling with his belt She wraps her arms around his neck and kisses him He sinks down on his knees toward her He moves his hips to a song as Jude leads him over the beach under a train trestle Jody follows her as she walks backward drawing him on She pulls him over toward the water She turns her head away He goes to kiss her He staggers out buttoning up He nods They settle on a tall darkhaired man in a dark jacket Her eyes flick around the carnival She stands there listening to the sound of him urinate She leans against the canvas looking bored We can still see his hand holding Jude's Jody walks inside the canvas flap and vanishes from sight He holds her hand TOILET He comes to a small canvas tent with a sign on it He puts his arm around her and drags her on"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He comes to a small canvas tent with a sign on it He puts his arm around her and drags her on He holds her hand TOILET We can still see his hand holding Jude's Jody walks inside the canvas flap and vanishes from sight She stands there listening to the sound of him urinate She leans against the canvas looking bored They settle on a tall darkhaired man in a dark jacket Her eyes flick around the carnival He staggers out buttoning up He nods She turns her head away He goes to kiss her Jody follows her as she walks backward drawing him on She pulls him over toward the water He sinks down on his knees toward her He moves his hips to a song as Jude leads him over the beach under a train trestle Jody writhes on top of her fumbling with his belt She wraps her arms around his neck and kisses him A shadow falls across them Jude cocks one eye upward He turns around drunkenly A gun is put to his head Jude scrambles to her feet and darts like an animal through a field The gun whacks him across the cheek and he falls sideways He can see her blond head vanishing among the fields Jody feels his cheek The tallest of them He looks up and sees a group of men around him A mini driving down a country road Fergus cocks the gun On the floor of the car Two men in the front three in the back a black bag over his head and the barrel of a gun dangling close to his face Jody lies with three pairs of feet on top of him He is smoking a cigarette Fergus holds the gun Jody pulled through and tied to a chair His movements are slow and somewhat innocent Jody is motionless under the black hood Maguire a small lean man talks to him through the hood The blond woman comes in with a plate and some food on it All the men are drinking tea Fergus is sitting by a chair gun in his hand watching the prisoner Jody sits as still as a grave saying nothing She moves over to him Jude comes in with a flashlight Then she lifts the hood ever so slightly to peer inside She prods him in the legs with her foot He pins her to the ground his body bent with the chair Suddenly the man moves like lightning jerking his head down so the hood comes off throwing his body tied to the chair over Jude He writhes on top of her in a grotesque parody of love"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He can see her blond head vanishing among the fields He looks up and sees a group of men around him The tallest of them Fergus cocks the gun A mini driving down a country road Two men in the front three in the back On the floor of the car Jody lies with three pairs of feet on top of him a black bag over his head and the barrel of a gun dangling close to his face Fergus holds the gun He is smoking a cigarette His movements are slow and somewhat innocent Jody pulled through and tied to a chair Maguire a small lean man talks to him through the hood Jody is motionless under the black hood All the men are drinking tea The blond woman comes in with a plate and some food on it Jody sits as still as a grave saying nothing Fergus is sitting by a chair gun in his hand watching the prisoner Jude comes in with a flashlight She moves over to him She prods him in the legs with her foot Then she lifts the hood ever so slightly to peer inside Suddenly the man moves like lightning jerking his head down so the hood comes off throwing his body tied to the chair over Jude He pins her to the ground his body bent with the chair He writhes on top of her in a grotesque parody of love He puts his arm around her and drags her on He comes to a small canvas tent with a sign on it TOILET He holds her hand Jody walks inside the canvas flap and vanishes from sight We can still see his hand holding Jude's She leans against the canvas looking bored She stands there listening to the sound of him urinate Her eyes flick around the carnival They settle on a tall darkhaired man in a dark jacket He nods He staggers out buttoning up He goes to kiss her She turns her head away She pulls him over toward the water Jody follows her as she walks backward drawing him on He moves his hips to a song as Jude leads him over the beach under a train trestle He sinks down on his knees toward her She wraps her arms around his neck and kisses him Jody writhes on top of her fumbling with his belt Jude cocks one eye upward A shadow falls across them A gun is put to his head He turns around drunkenly The gun whacks him across the cheek and he falls sideways Jude scrambles to her feet and darts like an animal through a field Jody feels his cheek"
        }
      ]
    }
  ]
}