{
  "ground_truth": "She goes inside; he follows. She downs a drink and motions for another. There are tears streaming down her face. He takes his hand and begins to wipe her face. She sits down; he joins her. He wipes the tears from her face with a tissue then dabs the tissue in her drink and wipes some more. Dil's face, staring at him. She allows herself to be led out. Dil and Fergus walking. Fergus stops her by the window. They walk inside. Dil and Fergus standing in the darkness. He sits her down in one of the chairs. Dil nods. Fergus takes up a scissors to snip at her hair. Her head leaps back. She stares at him. She takes a breath. Fergus begins to cut. CLOSE-UP ON DIL'S FACE as her hair is shorn. Tears stream down her cheeks. She looks in the mirror at it in the dark. Dil enters with her new haircut. She goes to turn on the light. He stops her hand. She looks at her hand on his. Her fingers close around his. She brings her lips to his neck. He lets them stay there. His hands travel up to her blouse. He begins to undo the buttons. He raises her to her feet and leads her toward the bed. She stretches languorously down on it. She turns on the bed sexily, her face to the mattress. She is wearing suspender-belts underneath her skirt. But Fergus stands and walks quietly over to the wardrobe where the soldier's things are. Dil on the bed, slowly turns. We see Fergus from her point of view, coming toward her with Jody's white cricket shirt, glowing eerily in the dark. Fergus draws her slowly up to a standing position. He wraps the shirt around her. She kisses him. Fergus leading Dil, dressed in Jody's cricket clothes, down the street and inside. From above, we see the figures of Fergus and Dil, sleeping on a double bed, both fully clothed. Fergus smokes, then puts out the cigarette. The light gradually fills the room. Fergus wakes. Looks at the bedside clock, and very gingerly rises, puts on his coat, and walks out. A car pulls up at the site. Jude gets out. She has a satchel in her hand. Fergus looking down a ladder-staircase at Jude. Fergus climbs down a ladder to Jude; she hands him something from the bag. She kisses him. Fergus looks at her expressionlessly. Fergus opens what Jude has given him--looking inside. There is a gun wrapped in an oilcloth. Fergus enters. The room is empty. He calls. He runs outside. Fergus looks up at her building, but the lights are off in her flat. The sound of feet behind him.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She proceeds inward; he trails. She consumes a beverage and signals for another. There are droplets cascading down her visage. He takes his palm and starts to dry her visage. She sits; he accompanies her. He dries the droplets from her visage with a tissue then dips the tissue in her beverage and dries further. Dil's visage, gazing at him. She permits herself to be guided out. Dil and Fergus strolling. Fergus halts her by the pane. They proceed inward. Dil and Fergus standing in the obscurity. He seats her in one of the chairs. Dil acknowledges. Fergus picks up a shears to trim her tresses. Her cranium jerks back. She gazes at him. She inhales. Fergus starts to trim. CLOSE-UP ON DIL'S VISAGE as her tresses are shorn. Droplets cascade down her cheeks. She observes in the mirror at it in the gloom. Dil enters with her new haircut. She moves to switch on the illumination. He halts her hand. She observes her hand on his. Her digits clasp around his. She presses her lips to his neck. He permits them to linger there. His palms journey up to her blouse. He starts to unfasten the buttons. He lifts her to her feet and guides her toward the bed. She sprawls languidly down on it. She rotates on the bed sensually, her visage to the mattress. She is wearing garter-belts beneath her skirt. But Fergus stands and strides quietly over to the wardrobe where the soldier's items are. Dil on the bed, gradually rotates. We see Fergus from her perspective, approaching her with Jody's white cricket shirt, glowing uncannily in the gloom. Fergus draws her gradually up to a standing posture. He envelops the shirt around her. She embraces him. Fergus guiding Dil, attired in Jody's cricket attire, down the avenue and inward. From above, we see the forms of Fergus and Dil, slumbering on a double bed, both fully attired. Fergus smokes, then extinguishes the cigarette. The illumination progressively fills the chamber. Fergus rouses. Observes the bedside clock, and very cautiously rises, dons his coat, and exits. An automobile draws up at the location. Jude alights. She has a satchel in her hand. Fergus regarding down a ladder-staircase at Jude. Fergus descends a ladder to Jude; she presents him with something from the bag. She embraces him. Fergus regards her impassively. Fergus opens what Jude has provided him--inspecting inside. There is a firearm wrapped in an oilcloth. Fergus enters. The chamber is vacant. He calls. He dashes outside. Fergus regards up at her edifice, but the lights are off in her flat. The sound of feet behind him."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "She is followed inside by him. A drink is downed by her, and another is motioned for. Tears are streaming down her face. His hand is taken to wipe her face. She sits down; she is joined by him. Tears from her face are wiped by him with a tissue then the tissue is dabbed in her drink and some more is wiped. Dil's face stares at him. She is led out by him. Dil and Fergus are walking. She is stopped by Fergus by the window. They go inside. Dil and Fergus stand in the darkness. She is sat down in one of the chairs by him. Dil nods. A scissors is taken up by Fergus to snip at her hair. Back leaps her head. She stares at him. A breath is taken by her. The cutting is begun by Fergus. CLOSE-UP ON DIL'S FACE as her hair is shorn. Down her cheeks, tears stream. At her reflection in the dark, she looks. Her new haircut is entered with by Dil. The light is turned on by her. Her hand is stopped by him. At her hand on his, she looks. Around his, her fingers close. To his neck, she brings her lips. They are let stay there by him. To her blouse, his hands travel. The buttons are begun to be undone by him. To her feet, he raises her and she is led toward the bed by him. Down on it, she stretches languorously. On the bed, she turns sexily, her face to the mattress. Suspender-belts are worn by her underneath her skirt. But Fergus stands and quietly walks to the wardrobe where the soldier's things are. On the bed, Dil slowly turns. From her point of view, we see Fergus, coming toward her with Jody's white cricket shirt, glowing eerily in the dark. She is slowly drawn up to a standing position by Fergus. Around her, the shirt is wrapped by him. She kisses him. Dil, dressed in Jody's cricket clothes, is led down the street and inside by Fergus. From above, Fergus and Dil are seen, sleeping on a double bed, both fully clothed. Fergus smokes, then the cigarette is put out by him. The room is gradually filled with light. Fergus wakes. He looks at the bedside clock, and very gingerly rises, puts on his coat, and walks out. At the site, a car pulls up. Out gets Jude. In her hand, she has a satchel. Fergus looks down a ladder-staircase at Jude. Down a ladder to Jude climbs Fergus; something from the bag is handed to him by her. She kisses him. At her, Fergus looks expressionlessly. What Jude has given him is opened by Fergus--inside, a gun wrapped in an oilcloth. Fergus enters. The room is empty. He calls. Outside, he runs. Up at her building, Fergus looks, but the lights are off in her flat. Behind him, the sound of feet is heard."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "She enters, and he follows. She downs a drink, signaling for another, tears on her face. He uses his hand, then a tissue dipped in her drink, to wipe her tears. She lets him lead her out. Fergus stops her by a window. Inside, he seats her and uses scissors to cut her hair. Tearfully, she watches in a mirror. With her new haircut, she reaches for the light, but he stops her. She holds his hand, kisses his neck, and he unbuttons her blouse. Guiding her to the bed, she stretches out, but Fergus moves to the wardrobe. From her view, he returns with Jody's glowing white cricket shirt, wraps it around her, and she kisses him. They walk down the street with her in Jody's clothes. Seen from above, they sleep fully clothed on a double bed. Fergus puts out a cigarette as morning light fills the room. He rises gingerly, dons his coat, and departs. A car arrives; Jude exits with a satchel. Fergus climbs down to her. She hands him something, kisses him, and he opens the package—a gun wrapped in oilcloth. Returning to an empty room, he calls out, then runs outside. Looking up at her building, the lights are off. Footsteps sound behind him."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "She enters; he follows. She drinks, gestures for more, and cries. He wipes her tears with a tissue dipped in her drink. Dil and Fergus walk, pause by a window, then enter a dark room. He sits her down and starts to cut her hair. She breathes as he snips, tears streaming. She sees her reflection in the dark. Dil, with a new haircut, moves to turn on the light, but he stops her. She holds his hand, kisses his neck, and he unbuttons her blouse. He leads her to the bed, where she lies down. Fergus quietly finds Jody's white cricket shirt, wraps it around her, and they kiss. He leads Dil, in Jody's clothes, down the street. They sleep fully clothed. Fergus smokes, then leaves at dawn, noticing Jude arrive with a satchel. She gives him a gun wrapped in oilcloth. Fergus enters an empty room, calls, then runs outside, looking at her dark apartment. Footsteps sound behind him."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "She steps inside with a sense of urgency, and closely following her footsteps, he enters as well. She quickly consumes a drink and then gestures for another with a silent yet expressive request. Tears stream down her cheeks, cascading in a continuous flow. With a gentle motion, he reaches out his hand and begins to tenderly wipe her tears away. She takes a seat, and he joins her, sharing the moment. With careful attention, he uses a tissue to gently dab at her face, then dips the tissue into her drink to wipe away more of her tears. Dil looks at him intently, her eyes reflecting a complex mix of emotions. She allows herself to be led out by him. As Dil and Fergus walk together, they pause by the window where Fergus momentarily halts her. They proceed to enter together. Standing silently in the enveloping darkness, Fergus guides her to sit down in one of the chairs. With a subtle nod, Dil indicates her consent. Fergus picks up a pair of scissors, preparing to make a deliberate snip at her hair. Her head jerks back in surprise, and she fixes her gaze on him, taking a deep breath to steady herself. Fergus begins to cut, the sound of the scissors slicing through the air. In a CLOSE-UP ON DIL'S FACE, her hair is visibly being shorn, and tears once again stream down her cheeks. She gazes into the mirror, looking at her reflection in the dim light. Dil, now with her new haircut, enters the room and reaches to turn on the light switch. He gently halts her hand. She looks at their hands, the connection palpable, and her fingers close around his. She draws her lips close to his neck, lingering there. He permits them to remain. His hands smoothly glide up to her blouse, slowly beginning to undo the buttons with deliberate care. Raising her to her feet, he guides her toward the waiting bed. She stretches out languorously, settling down on it. She turns on the bed with a sensuous movement, her face pressed into the mattress. Underneath her skirt, she wears suspender-belts, a faint whisper of allure. Yet, Fergus stands, moving softly over to the wardrobe where the soldier's belongings reside. Dil, still on the bed, slowly turns her head. From her perspective, we see Fergus approaching, holding Jody's white cricket shirt, which seems to glow eerily in the shadowed room. Fergus lifts her slowly to a standing position and wraps the shirt around her. She kisses him gently. Leading Dil, now clad in Jody's cricket clothes, they walk down the street and enter inside. From an overhead view, we see Fergus and Dil, slumbering peacefully on a double bed, both fully clothed. Fergus smokes quietly, extinguishing the cigarette with a deliberate motion. Gradually, the light begins to fill the room, signaling the arrival of a new day. Fergus wakes, glances at the clock beside the bed, and very cautiously rises. He dons his coat and steps out quietly. A car arrives, pulling up at the designated spot. Jude emerges, carrying a satchel in her hand. Fergus peers down a ladder-staircase, observing Jude below. He climbs down to meet her, and she hands him an item from her bag. In a brief but intimate gesture, she kisses him. Fergus looks back at her with a blank expression, void of any discernible emotion. Opening what Jude has given him, he finds a gun carefully wrapped in an oilcloth. Fergus enters a room that lies empty, his voice calls out, breaking the silence. He rushes outside, casting his gaze upward at her building, but notices the lights are off in her flat. Suddenly, he hears the sound of footsteps behind him."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a sense of urgency evident in her every step, she quickly makes her way inside, and just behind her, following closely on her heels, he enters the same space. She promptly consumes a drink with notable haste, then gestures for another with a silent yet expressive motion that conveys her intent clearly. Tears begin to stream down her cheeks, cascading in an unending, continuous flow. With a gentle and tender motion, he reaches out his hand and begins to gently wipe the tears from her face. She takes a seat, settling into the chair, and he joins her by her side, sharing the intimate moment together. With careful and precise attention, he uses a tissue to delicately dab at her face, then dips the tissue into her drink to continue wiping away the tears. Dil gazes at him intently, her eyes reflecting a complex and intricate mix of emotions. She allows herself to be led out by him. As Dil and Fergus walk side by side, they momentarily pause by the window where Fergus briefly halts her movement. Together, they proceed to enter the room. In the enveloping darkness, silent and still, Fergus guides her to sit down in one of the available chairs. With a subtle and almost imperceptible nod, Dil indicates her consent. Fergus picks up a pair of scissors, positioning himself to make a deliberate snip at her hair. Her head jerks back in surprise, and she fixes her gaze on him, taking a deep breath to steady herself. Fergus begins the process of cutting, the distinct sound of the scissors slicing through the air. In a CLOSE-UP ON DIL'S FACE, her hair is visibly being shorn, and once again, tears begin to stream down her cheeks. She gazes into the mirror, contemplating her reflection in the dim light. Dil, now sporting her new haircut, enters the room and reaches out to turn on the light switch. He gently halts her hand, stopping her motion. She looks at their intertwined hands, the connection between them palpable, and her fingers close around his with a sense of intimacy. She draws her lips close to his neck, lingering gently there. He allows them to remain. His hands move smoothly upwards to her blouse, slowly beginning to undo the buttons with deliberate and careful intent. Raising her to her feet, he guides her toward the waiting bed. She stretches out languorously, settling down onto it. She turns on the bed with a sensuous movement, her face pressing into the mattress. Beneath her skirt, she wears suspender-belts, whispering faintly of allure. Yet, Fergus stands, moving softly over to the wardrobe where the soldier's belongings reside. Dil, still on the bed, slowly turns her head. From her perspective, we see Fergus approaching, holding Jody's white cricket shirt, which seems to glow with an eerie light in the shadowed room. Fergus lifts her slowly to a standing position and wraps the shirt around her shoulders. She kisses him gently. Leading Dil, now clad in Jody's cricket clothes, they walk together down the street and make their way inside. From an overhead vantage point, we see Fergus and Dil, slumbering peacefully together on a double bed, both fully clothed. Fergus smokes quietly, extinguishing the cigarette with a deliberate motion. Gradually, the light begins to seep into the room, signaling the dawn of a new day. Fergus awakens, glances at the clock beside the bed, and very cautiously rises. He dons his coat and steps out quietly into the morning. A car arrives, pulling up precisely at the designated spot. Jude emerges, carrying a satchel in her hand. Fergus peers down a ladder-staircase, observing Jude below. He climbs down to meet her, and she hands him an item from her bag. In a brief yet intimate gesture, she kisses him. Fergus looks back at her, his expression blank and void of any discernible emotion. Opening what Jude has given him, he finds a gun carefully and meticulously wrapped in an oilcloth. Fergus enters a room that lies completely empty, his voice breaking the silence as he calls out. He rushes outside, casting his gaze upward at her building, but he notices that the lights are off in her flat. Suddenly, the sound of footsteps echoes behind him."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "She steps through the doorway, and he trails closely behind her, matching her pace. Once inside, she quickly consumes a drink and gestures to the bartender, signaling for another with a swift movement of her hand. As she receives the new drink, tears begin to cascade down her face, streaming freely. Observing her distress, he reaches out with a gentle touch and starts to wipe the tears from her face using his hand. She moves to a nearby seat and lowers herself into it, her movements showing a slight heaviness. He follows her, settling into the seat beside her. With a caring motion, he takes a tissue, carefully uses it to wipe her tears, then thoughtfully dips the tissue into her drink, ensuring it's damp enough, and continues to gently wipe more tears from her cheeks. All the while, Dil's expression remains fixed on him, her eyes conveying a silent gratitude. Allowing herself to trust him, she lets him guide her out, trailing alongside him as they walk. Fergus pauses her journey near a window, creating a moment of stillness between the two of them. Together, they step inside another space, the darkness enveloping them. Fergus guides her to sit in one of the chairs, which she does with a nod of acquiescence. In a moment of tender care, Fergus picks up a pair of scissors and prepares to snip at her hair. As the scissors approach, her head jerks back reflexively, her eyes locked onto his with a mixture of apprehension and trust. She inhales deeply, a sign of her gathering courage, as Fergus begins to carefully cut her hair. An intense focus on Dil's face reveals her emotions as her hair falls away, tears cascading down her cheeks anew. She turns her gaze toward the mirror, studying her new reflection amid the dim surroundings. Later, with her new haircut complete, Dil reenters the room, moving to switch on the light. But before she can flick the switch, his hand gently stops hers. She glances down at their joined hands, her fingers curling around his in a tender grip. She leans in closer, pressing her lips softly to his neck, leaving them there as a moment passes between them. His hands gently trace up to her blouse, and he begins to methodically undo the buttons, his touch both careful and deliberate. He gently raises her from her seat, guiding her with him toward the bed. She lowers herself onto it with a languid, sensual motion, turning her body so her face rests against the mattress. In a subtle reveal, suspender-belts peek out from beneath her skirt. Meanwhile, Fergus quietly steps away, heading toward the wardrobe. From her vantage point on the bed, Dil watches him as he returns, carrying a white cricket shirt that once belonged to Jody, its fabric faintly luminous in the dim light. With tenderness, Fergus slowly pulls her to stand, wrapping the shirt around her body with care. She responds with a kiss, her lips meeting his in a soft, lingering gesture. Clad in Jody's cricket clothes, Dil follows Fergus as he leads her down the street and inside another building. Viewed from above, the figures of Fergus and Dil become visible as they lie fully clothed atop a double bed, entwined in sleep. As the first hints of dawn break, Fergus quietly smokes a cigarette, eventually stubbing it out before the room gradually fills with soft morning light. Stirring awake, Fergus glances at the bedside clock, then gingerly rises from the bed. He puts on his coat with quiet precision and makes his way out of the room. Outside, a car approaches the site, coming to a stop as Jude emerges, carrying a satchel. Without a word, Fergus looks down at her from the top of a ladder-staircase and then descends to meet her. Jude reaches into the bag, handing him something with a brief, intimate gesture, then leans in to kiss him. His face remains expressionless as he accepts the object. Opening it, he discovers a gun wrapped securely in an oilcloth, inspecting it with an air of resignation. Re-entering another space, he finds it empty, his voice calling out to no response. With urgency, he rushes outside, casting a glance up at her building, noting the absence of light in her flat. Suddenly, the sound of feet echoes behind him, signaling another presence."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "She enters the room with him following closely. After quickly finishing a drink and requesting another, she begins to cry. He gently wipes her tears and, using a tissue dabbed in her drink, continues to soothe her. She accepts his guidance as he leads her outside for a walk. They stop by a window and then proceed inside. In the dark, he sits her down, nods reassuringly, and begins to cut her hair. Despite her initial hesitation, she allows him to continue. As she sees her reflection, tears fall again. She and Fergus move to turn on the light, but he stops her, their hands lingering together. She kisses his neck, and he starts to undress her, guiding her to the bed where she reclines suggestively. While she reveals her suspender-belts, Fergus is drawn to the wardrobe, retrieving a glowing white cricket shirt. He dresses her in it, and they share a kiss. Clad in the cricket shirt, Fergus and Dil walk down the street together and retreat inside, eventually falling asleep fully clothed on a double bed. At dawn, Fergus carefully rises, dresses, and leaves. Outside, a car arrives with Jude, who hands Fergus a package containing a gun wrapped in oilcloth. After a brief but expressionless interaction, Fergus enters an empty room, calls out, and rushes outside when there is no response. He looks up at her darkened flat, alert to footsteps approaching from behind."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She goes inside; he follows, entering the dimly lit pub known for its late-night patrons. She downs a drink, the whiskey burning her throat, and motions for another. There are tears streaming down her face, glistening under the low-hanging bar lights. He takes his hand and begins to wipe her face gently, his rough skin contrasting with her delicate features. She sits down; he joins her on the old, leather-covered barstool. He wipes the tears from her face with a tissue, one that has a subtle scent of lavender, then dabs the tissue in her drink and wipes some more. Dil's face, staring at him with a mixture of gratitude and despair. She allows herself to be led out through the narrow door that creaks slightly. Dil and Fergus walking down the rain-slicked streets, their footsteps echoing in the night. Fergus stops her by the window of a closed storefront, its display a dim reflection of their silhouettes. They walk inside. Dil and Fergus standing in the darkness, the only light coming from a distant streetlamp. He sits her down in one of the chairs, the wooden frame creaking under her weight. Dil nods, her expression resigned yet trusting. Fergus takes up a scissors, an old pair with slightly rusty blades, to snip at her hair. Her head leaps back in surprise. She stares at him, uncertain yet willing. She takes a breath, a deep, calming inhale. Fergus begins to cut, carefully and with precision. CLOSE-UP ON DIL'S FACE as her hair is shorn, a symbol of transformation and loss. Tears stream down her cheeks, mingling with strands of hair on the floor. She looks in the mirror at it in the dark, the dim reflection barely recognizable. Dil enters with her new haircut, the style reminiscent of a carefree past. She goes to turn on the light. He stops her hand softly, understanding the comfort of the semi-darkness. She looks at her hand on his, feeling the warmth of connection. Her fingers close around his, silently communicating trust. She brings her lips to his neck, a tender gesture of affection. He lets them stay there, savoring the moment. His hands travel up to her blouse, the fabric soft under his touch. He begins to undo the buttons, his fingers deft and patient. He raises her to her feet and leads her toward the bed, a rickety frame with a worn-out mattress. She stretches languorously down on it, relishing the softness. She turns on the bed sexily, her face to the mattress, as if embracing an old lover. She is wearing suspender-belts underneath her skirt, a touch of elegance amidst the chaos. But Fergus stands and walks quietly over to the wardrobe where the soldier's things are, remnants of Jody's presence. Dil on the bed, slowly turns. We see Fergus from her point of view, coming toward her with Jody's white cricket shirt, a reminder of innocence lost, glowing eerily in the dark. Fergus draws her slowly up to a standing position, wrapping the shirt around her like a shroud of memories. She kisses him, sealing the bond between them. Fergus leading Dil, dressed in Jody's cricket clothes, down the street and inside, where the past and present converge. From above, we see the figures of Fergus and Dil, sleeping on a double bed, both fully clothed, their bodies entwined in slumber. Fergus smokes, the cigarette tip glowing dimly before he puts it out. The light gradually fills the room, heralding a new day. Fergus wakes, looks at the bedside clock, and very gingerly rises, putting on his coat that smells faintly of tobacco and leaves. He walks out, careful not to disturb her. A car pulls up at the site, its engine purring softly. Jude gets out, her presence commanding. She has a satchel in her hand, worn leather but sturdy. Fergus looking down a ladder-staircase at Jude, her eyes meeting his with unspoken understanding. Fergus climbs down a ladder to Jude; she hands him something from the bag. She kisses him, a lingering farewell. Fergus looks at her expressionlessly, his thoughts unreadable. Fergus opens what Jude has given him--looking inside. There is a gun wrapped in an oilcloth, cold and heavy in his hands. Fergus enters, the room eerily silent and empty. He calls out, his voice echoing back. He runs outside, urgency in his stride. Fergus looks up at her building, but the lights are off in her flat, a stark reminder of absence. The sound of feet behind him, a prelude to a new chapter."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "She goes inside. he follows. She downs a drink and motions for another. There are tears streaming down her face. He takes his hand and begins to wipe her face. She sits down. he joins her. He wipes the tears from her face with a tissue then dabs the tissue in her drink and wipes some more. Dil's face staring at him. She allows herself to be led out. Dil and Fergus walking. Fergus stops her by the window. They walk inside. Dil and Fergus standing in the darkness. He sits her down in one of the chairs. Dil nods. Fergus takes up a scissors to snip at her hair. Her head leaps back. She stares at him. She takes a breath. Fergus begins to cut CLOSEUP ON DIL'S FACE as her hair is shorn. Tears stream down her cheeks. She looks in the mirror at it in the dark. Dil enters with her new haircut. She goes to turn on the light. He stops her hand. She looks at her hand on his. Her fingers close around his. She brings her lips to his neck. He let us them stay there. His hands travel up to her blouse. He begins to undo the buttons. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. He raises her to her feet and leads her toward the bed. She stretches languorously down on it. She turns on the bed sexily her face to the mattress. She is wearing suspenderbelts underneath her skirt. But Fergus stands and walks quietly over to the wardrobe where the soldier's things are. Dil on the bed slowly turns. We see Fergus from her point of view coming toward her with Jody's white cricket shirt glowing eerily in the dark. Fergus draws her slowly up to a standing position. He wraps the shirt around her. She kisses him. Fergus leading Dil dressed in Jody's cricket clothes down the street and inside. From above we see the figures of Fergus and Dil sleeping on a double bed both fully clothed. Fergus smokes then puts out the cigarette. The light gradually fills the room. Fergus wakes. Looks at the bedside clock and very gingerly rises puts on his coat and walks out. A car pulls up at the site. Jude gets out. She has a satchel in her hand. Fergus looking down a ladderstaircase at Jude. Fergus climbs down a ladder to Jude. she hands him something from the bag. She kisses him. Fergus looks at her expressionlessly. Fergus opens what Jude has given himlooking inside. There is a gun wrapped in an oilcloth. Fergus enters. The room is empty. He calls. He runs outside. Fergus looks up at her building but the lights are off in her flat. The sound of feet behind him."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "She goes inside. he follows. She downs a drink and motions for another. There are tears streaming down her face. He takes his hand and begins to wipe her face. She sits down. he joins her. He wipes the tears from her face with a tissue then dabs the tissue in her drink and wipes some more. Dil's face staring at him. She allows herself to be led out. Dil and Fergus walking. Fergus stops her by the window. They walk inside. Dil and Fergus standing in the darkness. He sits her down in one of the chairs. Dil nods. Fergus takes up a scissors to snip at her hair. Her head leaps back. She stares at him. She takes a breath. Fergus begins to cut CLOSEUP ON DIL'S FACE as her hair is shorn. Tears stream down her cheeks. She looks in the mirror at it in the dark. Dil enters with her new haircut. She goes to turn on the light. He stops her hand. She looks at her hand on his. Her fingers close around his. She brings her lips to his neck. He let us them stay there. His hands travel up to her blouse. He begins to undo the buttons. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. He raises her to her feet and leads her toward the bed. She stretches languorously down on it. She turns on the bed sexily her face to the mattress. She is wearing suspenderbelts underneath her skirt. But Fergus stands and walks quietly over to the wardrobe where the soldier's things are. Dil on the bed slowly turns. We see Fergus from her point of view coming toward her with Jody's white cricket shirt glowing eerily in the dark. Fergus draws her slowly up to a standing position. He wraps the shirt around her. She kisses him. Fergus leading Dil dressed in Jody's cricket clothes down the street and inside. From above we see the figures of Fergus and Dil sleeping on a double bed both fully clothed. Fergus smokes then puts out the cigarette. The light gradually fills the room. Fergus wakes. Looks at the bedside clock and very gingerly rises puts on his coat and walks out. A car pulls up at the site. Jude gets out. She has a satchel in her hand. Fergus looking down a ladderstaircase at Jude. Fergus climbs down a ladder to Jude. she hands him something from the bag. She kisses him. Fergus looks at her expressionlessly. Fergus opens what Jude has given himlooking inside. There is a gun wrapped in an oilcloth. Fergus enters. The room is empty. He calls. He runs outside. Fergus looks up at her building but the lights are off in her flat. The sound of feet behind him."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "She goes inside. he follows. She downs a drink and motions for another. There are tears streaming down her face. He takes his hand and begins to wipe her face. She sits down. he joins her. He wipes the tears from her face with a tissue then dabs the tissue in her drink and wipes some more. Dil's face staring at him. She allows herself to be led out. Dil and Fergus walking. Fergus stops her by the window. They walk inside. Dil and Fergus standing in the darkness. He sits her down in one of the chairs. Dil nods. A car pulls up at the site. Jude gets out. She has a satchel in her hand. Fergus looking down a ladderstaircase at Jude. Fergus climbs down a ladder to Jude. she hands him something from the bag. She kisses him. Fergus looks at her expressionlessly. Fergus opens what Jude has given himlooking inside. There is a gun wrapped in an oilcloth. Fergus enters. The room is empty. He calls. He runs outside. Fergus looks up at her building but the lights are off in her flat. The sound of feet behind him."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "She goes inside. he follows. She downs a drink and motions for another. There are tears streaming down her face. He takes his hand and begins to wipe her face. She sits down. he joins her. Fergus enters. The room is empty. He calls. He runs outside. Fergus looks up at her building but the lights are off in her flat. The sound of feet behind him."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The cat leaps over; a rabbit follows. The cat sips some soup and gestures for more. There are raindrops cascading over its whiskers. The rabbit grabs a paw and starts to dry the whiskers. The cat curls up; the rabbit companions it. The rabbit dries the raindrops with a leaf then dips the leaf in the soup and dries some more. The sun's rays, peeking at the rabbit. The cat allows itself to be guided outside. The sun and moon drifting. The moon halts it by the cloud. They drift inside. The sun and moon hovering in the shadows. The moon settles it onto a branch. The sun nods. The moon picks up a comb to trim the fur. Its head jerks back. It gazes at the moon. It inhales deeply. The moon starts to groom. CLOSE-UP ON THE SUN'S FACE as the fur gets trimmed. Raindrops pour down its cheeks. It gazes into the pond at it in the twilight. The sun arrives with its snazzy fur trim. It moves to flick on the lamp. The moon stops its paw. It gazes at its paw atop the moon's. Its claws tighten around the moon's. It presses its beak to the moon's ear. The moon allows them to rest there. The moon's paws glide toward its jacket. The moon starts to unfasten the zippers. The moon lifts it to its paws and guides it toward the hammock. It stretches lazily onto it. It twists on the hammock gracefully, its whiskers to the leaves. It wears a sash beneath its tunic. But the moon rises and drifts silently over to the crate where the knight's trinkets are. The sun on the hammock, gradually twists. We glimpse the moon from its perspective, approaching with the knight's bright armor, glowing mysteriously in the dusk. The moon elevates it gently to a standing position. The moon drapes the armor around it. It pecks the moon. The moon guiding the sun, clad in the knight's armor, along the path and inside. From up high, we notice the shadows of the moon and sun, dozing on a hammock for two, still in their attire. The moon smokes, then extinguishes the cigarillo. The dawn gradually spreads through the space. The moon stirs. Eyes the wall clock, and hesitantly ascends, dons its cloak, and strides out. A carriage pulls up at the canyon. A fox disembarks. It holds a backpack in its paw. The moon peering down a ladder-ramp at the fox. The moon descends a ladder to the fox; it offers something from the pack. It pecks the moon. The moon gazes at it blankly. The moon unfolds what the fox has passed--peering within. There is a sword swathed in a silk scarf. The moon departs. The space is vacant. It beckons. It dashes outside. The moon glances up at its spire, yet the lanterns are dim in its tower. The echo of hooves behind it."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Dil and Fergus are in a room where Dil is visibly upset. Fergus comforts her, wiping away her tears with a tissue dipped in her drink. He leads her to a chair and starts cutting her hair. Despite her tears, she allows him, looking at her reflection in the dark. With her new haircut, she tries to turn on the light, but Fergus stops her. They share an intimate moment as Fergus begins to undress her, but then grabs a cricket shirt belonging to Jody and wraps it around her. Fergus and Dil walk down the street, and later, they are seen sleeping fully clothed on a double bed. Fergus wakes up, smokes, and leaves quietly. Outside, Jude arrives with a satchel, giving Fergus a gun wrapped in an oilcloth. He enters an empty room, calls out, and runs outside, looking at Dil's darkened flat. Suddenly, he hears footsteps behind him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The sound of feet behind him Fergus looks up at her building but the lights are off in her flat He runs outside He calls The room is empty Fergus enters There is a gun wrapped in an oilcloth Fergus opens what Jude has given himlooking inside Fergus looks at her expressionlessly She kisses him she hands him something from the bag Fergus climbs down a ladder to Jude Fergus looking down a ladderstaircase at Jude She has a satchel in her hand Jude gets out A car pulls up at the site Looks at the bedside clock and very gingerly rises puts on his coat and walks out Fergus wakes The light gradually fills the room Fergus smokes then puts out the cigarette From above we see the figures of Fergus and Dil sleeping on a double bed both fully clothed Fergus leading Dil dressed in Jody's cricket clothes down the street and inside She kisses him He wraps the shirt around her Fergus draws her slowly up to a standing position We see Fergus from her point of view coming toward her with Jody's white cricket shirt glowing eerily in the dark Dil on the bed slowly turns But Fergus stands and walks quietly over to the wardrobe where the soldier's things are She is wearing suspenderbelts underneath her skirt She turns on the bed sexily her face to the mattress She stretches languorously down on it He raises her to her feet and leads her toward the bed He begins to undo the buttons His hands travel up to her blouse He let us them stay there She brings her lips to his neck Her fingers close around his She looks at her hand on his He stops her hand She goes to turn on the light Dil enters with her new haircut She looks in the mirror at it in the dark Tears stream down her cheeks Fergus begins to cut CLOSEUP ON DIL'S FACE as her hair is shorn She takes a breath She stares at him Her head leaps back Fergus takes up a scissors to snip at her hair Dil nods He sits her down in one of the chairs Dil and Fergus standing in the darkness They walk inside Fergus stops her by the window Dil and Fergus walking She allows herself to be led out Dil's face staring at him He wipes the tears from her face with a tissue then dabs the tissue in her drink and wipes some more he joins her She sits down He takes his hand and begins to wipe her face There are tears streaming down her face She downs a drink and motions for another he follows She goes inside"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "he follows She goes inside There are tears streaming down her face She downs a drink and motions for another She sits down He takes his hand and begins to wipe her face He wipes the tears from her face with a tissue then dabs the tissue in her drink and wipes some more he joins her She allows herself to be led out Dil's face staring at him Fergus stops her by the window Dil and Fergus walking Dil and Fergus standing in the darkness They walk inside Dil nods He sits her down in one of the chairs Her head leaps back Fergus takes up a scissors to snip at her hair She takes a breath She stares at him Tears stream down her cheeks Fergus begins to cut CLOSEUP ON DIL'S FACE as her hair is shorn Dil enters with her new haircut She looks in the mirror at it in the dark He stops her hand She goes to turn on the light Her fingers close around his She looks at her hand on his He let us them stay there She brings her lips to his neck He begins to undo the buttons His hands travel up to her blouse She stretches languorously down on it He raises her to her feet and leads her toward the bed She is wearing suspenderbelts underneath her skirt She turns on the bed sexily her face to the mattress Dil on the bed slowly turns But Fergus stands and walks quietly over to the wardrobe where the soldier's things are Fergus draws her slowly up to a standing position We see Fergus from her point of view coming toward her with Jody's white cricket shirt glowing eerily in the dark She kisses him He wraps the shirt around her From above we see the figures of Fergus and Dil sleeping on a double bed both fully clothed Fergus leading Dil dressed in Jody's cricket clothes down the street and inside The light gradually fills the room Fergus smokes then puts out the cigarette Looks at the bedside clock and very gingerly rises puts on his coat and walks out Fergus wakes Jude gets out A car pulls up at the site Fergus looking down a ladderstaircase at Jude She has a satchel in her hand she hands him something from the bag Fergus climbs down a ladder to Jude Fergus looks at her expressionlessly She kisses him There is a gun wrapped in an oilcloth Fergus opens what Jude has given himlooking inside The room is empty Fergus enters He runs outside He calls The sound of feet behind him Fergus looks up at her building but the lights are off in her flat"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He raises her to her feet and leads her toward the bed She stretches languorously down on it She turns on the bed sexily her face to the mattress She is wearing suspenderbelts underneath her skirt But Fergus stands and walks quietly over to the wardrobe where the soldier's things are Dil on the bed slowly turns We see Fergus from her point of view coming toward her with Jody's white cricket shirt glowing eerily in the dark Fergus draws her slowly up to a standing position He wraps the shirt around her She kisses him Fergus leading Dil dressed in Jody's cricket clothes down the street and inside From above we see the figures of Fergus and Dil sleeping on a double bed both fully clothed Fergus smokes then puts out the cigarette The light gradually fills the room Fergus wakes Looks at the bedside clock and very gingerly rises puts on his coat and walks out A car pulls up at the site Jude gets out She has a satchel in her hand Fergus looking down a ladderstaircase at Jude Fergus climbs down a ladder to Jude she hands him something from the bag She kisses him Fergus looks at her expressionlessly Fergus opens what Jude has given himlooking inside There is a gun wrapped in an oilcloth Fergus enters The room is empty He calls He runs outside Fergus looks up at her building but the lights are off in her flat The sound of feet behind him She goes inside he follows She downs a drink and motions for another There are tears streaming down her face He takes his hand and begins to wipe her face She sits down he joins her He wipes the tears from her face with a tissue then dabs the tissue in her drink and wipes some more Dil's face staring at him She allows herself to be led out Dil and Fergus walking Fergus stops her by the window They walk inside Dil and Fergus standing in the darkness He sits her down in one of the chairs Dil nods Fergus takes up a scissors to snip at her hair Her head leaps back She stares at him She takes a breath Fergus begins to cut CLOSEUP ON DIL'S FACE as her hair is shorn Tears stream down her cheeks She looks in the mirror at it in the dark Dil enters with her new haircut She goes to turn on the light He stops her hand She looks at her hand on his Her fingers close around his She brings her lips to his neck He let us them stay there His hands travel up to her blouse He begins to undo the buttons"
        }
      ]
    }
  ]
}