{
  "ground_truth": "He turns and sees Dil walking toward him, a bottle in her hand, and he runs toward her. They are tussling in the darkness of the park, and he takes her arm. Fergus and Dil are on the stairs up to Dil's flat, where Fergus looks at her and shakes her, growing alarmed. He slaps her cheek, and she opens her eyes slowly. He walks in holding her, leans her against the wall, and then goes to the window to check the street outside. She takes a large slug from a bottle of whiskey and points weakly to a cabinet through the open door of the bathroom. He goes and gets the pills while she drinks from the whiskey bottle. She walks around the room drinking, then sits down and looks at Fergus. She stares straight ahead, the bottle clutched in her hands between her knees, as Fergus walks slowly toward the door. She looks at him, standing up, with something incredibly attractive about her, and he walks slowly toward her. He kisses her on the lips, and we see the photograph with the soldier's smiling face. She seems to be in a sweet narcotic haze as she reaches out her hand and strokes his. Fergus sits down on the bed as Dil lies back on it, still stroking his hand. Her voice is dreamily slurred, her eyes far away, and she smiles woozily. She woozily tries to hit him round the face and raises an unsteady hand to point at him. He strokes her cheek as she says something very slowly and sleepily, and her eyes close as she falls into a deep sleep. Fergus looks down at her almost fondly as they lie on the bed together, fully clothed. Dil wakes and rises very quietly, going to his coat thrown across a chair. She searches through the pockets and takes out the gun. Meanwhile, Jude is in bed as an alarm sounds, and she reaches to turn it off. Dil takes several silk stockings out of a drawer and ties them very securely to each corner of the brass bed. She ties them round both of Fergus's feet very gently so as not to wake him. Jude, in front of a mirror getting ready, is fully dressed. Dil ties the other stocking and is drawing it upward when Fergus wakes. She jerks the silk stocking so it is secure and speaks unnaturally quietly. Jude takes a gun from under the bed and slips it into her handbag. Dil crouches beside Fergus, his gun in her hand, and Fergus stares at her, trying to pull on the bindings. She stands up, still pointing the gun at Fergus, while Jude is on the street and Maguire's car pulls up rapidly and she gets inside. Fergus drags at his bindings as the figure of the judge appears in the window.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He rotates and notices Dil strolling toward him, a bottle in her hand, and he dashes toward her. They are grappling in the obscurity of the park, and he grips her arm. Fergus and Dil are on the steps up to Dil's apartment, where Fergus gazes at her and shakes her, becoming apprehensive. He strikes her cheek, and she opens her eyes gradually. He strides in holding her, leans her against the wall, and then proceeds to the window to inspect the street outside. She takes a large swig from a bottle of whiskey and gestures feebly to a cabinet through the open door of the bathroom. He goes and retrieves the pills while she sips from the whiskey bottle. She strolls around the room sipping, then sits down and gazes at Fergus. She stares directly ahead, the bottle gripped in her hands between her knees, as Fergus ambles slowly toward the door. She glances at him, standing up, with something incredibly alluring about her, and he ambles slowly toward her. He kisses her on the lips, and we see the photograph with the soldier's grinning visage. She seems to be in a pleasant narcotic trance as she extends her hand and caresses his. Fergus sits down on the bed as Dil reclines back on it, still caressing his hand. Her voice is dreamily slurred, her eyes distant, and she smiles dizzily. She dizzily attempts to slap him round the face and raises an unsteady hand to indicate at him. He caresses her cheek as she articulates something very slowly and sleepily, and her eyes shut as she drifts into a profound slumber. Fergus gazes down at her almost affectionately as they lie on the bed together, fully clothed. Dil awakens and arises very quietly, going to his coat tossed across a chair. She searches through the pockets and extracts the gun. Meanwhile, Jude is in bed as an alarm blares, and she reaches to turn it off. Dil takes several silk stockings out of a drawer and attaches them very securely to each corner of the brass bed. She ties them round both of Fergus's feet very gently so as not to rouse him. Jude, in front of a mirror preparing, is fully dressed. Dil ties the other stocking and is drawing it upward when Fergus awakens. She jerks the silk stocking so it is secure and speaks unnaturally quietly. Jude takes a gun from beneath the bed and slides it into her handbag. Dil crouches beside Fergus, his gun in her hand, and Fergus stares at her, attempting to tug on the bindings. She stands up, still aiming the gun at Fergus, while Jude is on the street and Maguire's car halts rapidly and she gets inside. Fergus tugs at his bindings as the figure of the judge emerges in the window."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He turns and sees Dil walking toward him, a bottle in her hand, and she is run toward by him. They tussle in the darkness of the park, and her arm is taken by him. Fergus and Dil are on the stairs up to Dil's flat, where she is looked at and shaken by Fergus, who grows alarmed. Her cheek is slapped by him, and her eyes are slowly opened by her. He walks in holding her, leans her against the wall, and then the street outside is checked by him by going to the window. A large slug is taken by her from a bottle of whiskey, and a cabinet is pointed at weakly by her through the open door of the bathroom. The pills are gotten by him while she drinks from the whiskey bottle. Around the room, she walks drinking, then sits down and Fergus is looked at by her. She stares straight ahead, the bottle clutched in her hands between her knees, as the door is walked slowly toward by Fergus. She looks at him, standing up, with something incredibly attractive about her, and she is walked slowly toward by him. She is kissed on the lips by him, and the photograph with the soldier's smiling face is seen. A sweet narcotic haze seems to be in her as his hand is reached out to and stroked by her. Fergus sits down on the bed as the bed is lain back on by Dil, still his hand stroked by her. Her voice is dreamily slurred, her eyes far away, and a woozy smile is given by her. She woozily tries to hit him round the face and points an unsteady hand at him. Her cheek is stroked by him as something very slowly and sleepily is said by her, and into a deep sleep, she falls as her eyes close. Fergus looks down at her almost fondly as they lie on the bed together, fully clothed. Dil wakes and rises very quietly, a coat thrown across a chair is gone to by her. Through the pockets, she searches and the gun is taken out by her. Meanwhile, an alarm sounds as Jude is in bed, and it is reached to and turned off by her. Several silk stockings are taken by Dil out of a drawer and to each corner of the brass bed, they are very securely tied. Fergus's feet are very gently tied round by her so as not to wake him. Jude, fully dressed, is getting ready in front of a mirror. The other stocking is tied by Dil and it is being drawn upward when Fergus wakes. She jerks the silk stocking so it is secure and speaks unnaturally quietly. A gun is taken by Jude from under the bed and slipped into her handbag. Dil crouches beside Fergus, his gun held by her, and he stares at her, trying to pull on the bindings. She stands up, still pointing the gun at Fergus, while the street is on by Jude and Maguire's car rapidly pulls up and she gets inside. Fergus drags at his bindings as the figure of the judge appears in the window."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He sees Dil approaching with a bottle and runs to her. They tussle in the park's darkness, and he grabs her arm. On the stairs to Dil's flat, Fergus shakes her, alarmed, and slaps her cheek until she opens her eyes. Holding her, he leans her against the wall and checks the street. She drinks whiskey and points to a cabinet. He retrieves pills while she drinks. She walks, sits, and stares at Fergus, clutching the bottle. Fergus approaches, kisses her, and we see a soldier's smiling photo. In a narcotic haze, she strokes his hand. Fergus sits on the bed as Dil lies back, slurring dreamily, smiling woozily. She tries to hit him, points unsteadily, and he strokes her cheek as she speaks slowly, falling asleep. Fergus looks at her fondly as they lie clothed. Dil quietly rises, searches his coat, and takes the gun. Jude, in bed, turns off an alarm. Dil ties silk stockings to the bed corners and Fergus's feet gently. Jude, dressed, readies herself. Dil secures the stocking as Fergus wakes. She speaks quietly, and Jude takes a gun from under the bed, slipping it into her handbag. Dil crouches with Fergus's gun, and he struggles with the bindings. She stands, pointing the gun, while Jude gets into Maguire's car. Fergus pulls at his bindings as a judge appears in the window."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He sees Dil approaching with a bottle and runs to her. They tussle in the dark park, and he grabs her arm. On the stairs to Dil's flat, Fergus shakes her, alarmed, and slaps her cheek. She opens her eyes slowly. He supports her against the wall, checks the street, and she drinks whiskey, pointing to a cabinet. He retrieves pills while she drinks. She sits, clutching the bottle, as Fergus approaches the door. She stands, looking attractive, and he kisses her. A soldier's photo is visible. In a narcotic haze, she strokes his hand. Fergus sits on the bed, and Dil lies back, slurring dreamily. She tries to hit him, pointing unsteadily. He strokes her cheek as she speaks slowly, falling asleep. Fergus looks at her fondly. Dil quietly rises, searches his coat, and takes a gun. Jude turns off an alarm. Dil ties silk stockings to the bed, securing Fergus's feet gently. Jude gets ready, fully dressed. Dil ties another stocking as Fergus wakes. She secures it, speaking quietly. Jude takes a gun from under the bed. Dil crouches with Fergus's gun, and he struggles with the bindings. She stands, pointing the gun, as Jude enters Maguire's car. Fergus pulls at his bindings as a judge appears in the window."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He turns around and sees Dil approaching him, a bottle firmly held in her hand, and he immediately starts running toward her. They find themselves grappling in the dimly lit park, and he manages to grab hold of her arm. Fergus and Dil make their way up the stairs leading to Dil's flat, where Fergus looks at her with growing concern and shakes her gently. In a moment of desperation, he slaps her cheek lightly, and she slowly opens her eyes. Supporting her, he walks inside, carefully leaning her against the wall, before moving to the window to peer out at the street below. She takes a large gulp from a bottle of whiskey and weakly gestures toward a cabinet visible through the open bathroom door. He goes to retrieve the pills while she continues to drink from the whiskey bottle. She wanders around the room, sipping from the bottle, then sits down and gazes at Fergus. Her eyes are fixed straight ahead, the bottle clutched tightly between her knees, as Fergus slowly makes his way toward the door. She stands up, looking at him with an allure that is incredibly captivating, and he moves slowly toward her. He kisses her gently on the lips, and we see a photograph of a soldier with a smiling face. She appears to be in a sweet, narcotic haze as she reaches out her hand to stroke his. Fergus sits down on the bed as Dil reclines on it, still caressing his hand. Her voice is dreamily slurred, her eyes distant, and she smiles in a woozy manner. She attempts to hit him playfully on the face, raising an unsteady hand to point at him. He tenderly strokes her cheek as she speaks very slowly and sleepily, her eyes closing as she drifts into a deep sleep. Fergus gazes down at her almost fondly as they lie together on the bed, both fully clothed. Dil awakens and rises very quietly, moving to his coat draped over a chair. She searches through the pockets and retrieves the gun. Meanwhile, Jude is in bed as an alarm sounds, and she reaches over to turn it off. Dil takes several silk stockings from a drawer and ties them securely to each corner of the brass bed. She gently ties them around both of Fergus's feet, careful not to wake him. Jude, standing in front of a mirror and getting ready, is now fully dressed. Dil ties the other stocking and is drawing it upward when Fergus awakens. She jerks the silk stocking to ensure it is secure and speaks in an unnaturally quiet voice. Jude retrieves a gun from under the bed and discreetly slips it into her handbag. Dil crouches beside Fergus, holding his gun in her hand, and Fergus stares at her, struggling against the bindings. She stands up, still pointing the gun at Fergus, while Jude is on the street, and Maguire's car pulls up rapidly, allowing her to get inside. Fergus tugs at his bindings as the figure of the judge appears in the window."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He pivots around swiftly and notices Dil approaching him with a determined stride, a bottle gripped securely in her hand. Without any hesitation, he immediately starts sprinting toward her, driven by an urgent need. In the dimly lit, somewhat shadowy park, they find themselves entangled and grappling intensely. He manages, with some effort, to seize hold of her arm. Together, Fergus and Dil make their way up the slightly worn stairs that lead straight to Dil's flat. Once inside, Fergus gazes at her with growing concern etched on his face and gently shakes her, hoping to rouse her. In a moment fueled by desperation and worry, he lightly slaps her cheek, which prompts her to slowly open her eyes. Supporting her with care, he helps her walk inside, gently leaning her against the wall for support, before he moves to the window to peer out onto the bustling street below them. She takes a large, deliberate gulp from the whiskey bottle and feebly gestures toward a cabinet that is clearly visible through the open door of the bathroom. He obligingly goes to retrieve the pills from the cabinet while she continues to drink deeply from the whiskey bottle. She wanders around the room aimlessly, sipping from the bottle, then eventually sits down, fixing her gaze squarely on Fergus. Her eyes seem to be staring straight ahead, with the bottle clutched tightly between her knees, as Fergus gradually makes his way toward the door. She stands up slowly, looking at him with an allure that is incredibly captivating and difficult to resist, and he moves slowly, almost hesitantly, toward her. He kisses her gently on the lips, creating a tender moment, and we see a photograph of a soldier with a smiling, joyful face. She seems to be enveloped in a sweet, narcotic-like haze as she reaches out her hand to tenderly stroke his. Fergus then sits down on the bed as Dil reclines languidly on it, still caressing his hand with a soft touch. Her voice is dreamily slurred, her eyes gazing distantly, and she smiles with a woozy, almost ethereal manner. She attempts to hit him playfully on the face, raising an unsteady, wavering hand to point at him. He tenderly strokes her cheek as she speaks in a very slow, sleepy manner, her eyes gradually closing as she drifts into a deep, restful sleep. Fergus gazes down at her with an almost fond expression as they lie together on the bed, both still fully clothed. Dil awakens quietly and rises with a silent grace, moving toward his coat that is draped carelessly over a chair. She searches through the coat pockets meticulously and retrieves the gun hidden within. Meanwhile, Jude is in bed as an alarm begins to sound loudly, and she reaches over decisively to turn it off. Dil takes several silk stockings from a drawer and ties them securely, one by one, to each corner of the brass bed. She gently ties them around both of Fergus's feet, being careful and cautious not to wake him. Jude, now standing in front of a mirror and getting ready, is fully dressed for the day. Dil ties the other stocking and is in the process of drawing it upward when Fergus awakens unexpectedly. She jerks the silk stocking sharply to ensure it is secure and speaks in an unnaturally quiet, almost whispering voice. Jude retrieves a gun from under the bed with a practiced motion and discreetly slips it into her handbag. Dil crouches beside Fergus, holding his gun firmly in her hand, and Fergus stares back at her, struggling against the bindings with all his might. She stands up resolutely, still pointing the gun unwaveringly at Fergus, while outside, Jude is on the street, and Maguire's car pulls up rapidly, allowing her to get inside. Fergus tugs at his bindings with renewed vigor as the figure of the judge appears in the window."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He turns his head and his eyes catch sight of Dil walking toward him, a bottle gripped in her hand, prompting him to break into a run in her direction. As they meet in the dimness of the park, they engage in a struggle, and he manages to grasp her arm firmly. The scene shifts to Fergus and Dil ascending the stairs leading to Dil's flat, where Fergus pauses to look at her with growing concern, shaking her gently in an attempt to rouse her. In a moment of desperation, he slaps her cheek lightly, and her eyes flutter open slowly. Supporting her, he walks inside, carefully leaning her against the wall for support, before moving to the window to peer outside and survey the street. Meanwhile, she takes a substantial swig from the whiskey bottle and gestures weakly toward a cabinet visible through the open bathroom door. Responding to her silent request, he retrieves the pills while she continues to drink from the bottle. She paces around the room, sipping from the bottle, then settles into a seat, her gaze fixed on Fergus. Her eyes remain locked straight ahead, the bottle held tightly between her knees, as Fergus begins to walk slowly toward the door. She rises to her feet, an alluring aura about her, and he approaches her with deliberate steps. He leans in to kiss her softly on the lips, and the camera shifts to reveal a photograph of a soldier's smiling face. In a state that seems like a sweet narcotic haze, she extends her hand to gently stroke his. Fergus takes a seat on the bed as Dil reclines back onto it, her hand still caressing his. Her voice emerges, dreamily slurred, her eyes distant, and she smiles with a woozy expression. In a dazed attempt, she tries to swat at his face, her hand unsteadily rising to point at him. He tenderly strokes her cheek as she utters something very slowly and sleepily, her eyes gradually closing as she drifts into a deep sleep. Fergus gazes down at her with an almost fond expression as they lie together on the bed, both fully clothed. Dil awakens quietly and rises, moving stealthily to his coat draped over a chair. She rummages through the pockets and retrieves the gun. Meanwhile, Jude is in bed, and as an alarm sounds, she reaches over to silence it. Dil extracts several silk stockings from a drawer and methodically ties them to each corner of the brass bed, ensuring they are very secure. She gently binds them around both of Fergus's feet, taking care not to disturb his slumber. Jude, now fully dressed, stands in front of a mirror, preparing herself. Dil secures the other stocking and is in the process of drawing it upward when Fergus stirs awake. She quickly jerks the silk stocking to ensure it is tight and speaks in an unnaturally quiet tone. Jude retrieves a gun from beneath the bed and discreetly slips it into her handbag. Dil crouches beside Fergus, holding his gun in her hand, while Fergus stares at her, struggling against the bindings. She rises to her feet, maintaining the gun pointed at Fergus, as Jude steps onto the street and Maguire's car pulls up swiftly, allowing her to get inside. Fergus continues to tug at his bindings as the figure of the judge appears in the window."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Fergus sees Dil approaching with a bottle and runs to her. They tussle in the park's darkness before he takes her arm. On the stairs to Dil's flat, Fergus, alarmed, shakes her until she opens her eyes. Inside, he supports her against the wall, checks the street from the window, and retrieves pills from the bathroom cabinet as she drinks whiskey. Dil moves around the room drinking, then sits and stares ahead while Fergus approaches the door. She stands, exuding an irresistible allure, prompting Fergus to kiss her. A photograph of a smiling soldier is visible as she, in a narcotic haze, strokes his hand. Fergus sits on the bed, and Dil lies back, slurring dreamily and smiling woozily. She attempts to hit him playfully, points at him, and falls into a deep sleep as he strokes her cheek. Fergus watches her fondly as they lie on the bed fully clothed. Dil quietly rises, searches Fergus's coat, and takes his gun. Meanwhile, Jude turns off an alarm and gets ready. Dil secures silk stockings to the bed corners and ties Fergus's feet gently. Jude, now dressed, retrieves a gun from under her bed. As Dil ties the last stocking, Fergus wakes, and she secures it while speaking quietly. Jude leaves with a gun in her handbag as Dil crouches beside Fergus, holding his gun. Fergus struggles with the bindings as Dil stands, still aiming the gun, while Jude gets into Maguire's car on the street. Fergus continues to pull at his bindings as a judge appears in the window."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He turns and sees Dil, an enigmatic and captivating figure known in the local music scene, walking toward him, a bottle in her hand, and he runs toward her. They are tussling in the darkness of the park, which is part of the sprawling urban greenery of London, and he takes her arm. Fergus and Dil are on the stairs up to Dil's flat, located in a quiet, unassuming neighborhood, where Fergus looks at her and shakes her, growing alarmed. He slaps her cheek, and she opens her eyes slowly. He walks in holding her, leans her against the wall, and then goes to the window to check the street outside, a precaution given recent events in the city. She takes a large slug from a bottle of whiskey, the renowned Irish brand known for its smoothness, and points weakly to a cabinet through the open door of the bathroom. He goes and gets the pills, a prescription meant for her unstable condition, while she drinks from the whiskey bottle. She walks around the room drinking, then sits down and looks at Fergus. She stares straight ahead, the bottle clutched in her hands between her knees, as Fergus walks slowly toward the door. She looks at him, standing up, with something incredibly attractive about her, an allure that captivates those who meet her, and he walks slowly toward her. He kisses her on the lips, and we see the photograph with the soldier's smiling face, a memory of a past love lost in conflict. She seems to be in a sweet narcotic haze as she reaches out her hand and strokes his. Fergus sits down on the bed as Dil lies back on it, still stroking his hand. Her voice is dreamily slurred, her eyes far away, and she smiles woozily. She woozily tries to hit him round the face and raises an unsteady hand to point at him. He strokes her cheek as she says something very slowly and sleepily, and her eyes close as she falls into a deep sleep. Fergus looks down at her almost fondly as they lie on the bed together, fully clothed. Dil wakes and rises very quietly, going to his coat thrown across a chair. She searches through the pockets and takes out the gun, a relic from Fergus's past life entangled with dangerous affiliations. Meanwhile, Jude is in bed as an alarm sounds, and she reaches to turn it off, starting another day filled with her secretive occupation. Dil takes several silk stockings, having a fondness for the luxurious feel, out of a drawer and ties them very securely to each corner of the brass bed. She ties them round both of Fergus's feet very gently so as not to wake him. Jude, in front of a mirror getting ready, is fully dressed. Dil ties the other stocking and is drawing it upward when Fergus wakes. She jerks the silk stocking so it is secure and speaks unnaturally quietly. Jude takes a gun from under the bed, ready for anything her day might bring, and slips it into her handbag. Dil crouches beside Fergus, his gun in her hand, and Fergus stares at her, trying to pull on the bindings. She stands up, still pointing the gun at Fergus, while Jude is on the street and Maguire's car pulls up rapidly, a sign of urgency, and she gets inside. Fergus drags at his bindings as the figure of the judge, a crucial player in upcoming decisions, appears in the window."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He turns and sees Dil walking toward him a bottle in her hand and he runs toward her  They are tussling in the darkness of the park and he takes her arm  Fergus and Dil are on the stairs up to Dil's flat where Fergus looks at her and shakes her growing alarmed  He kisses her on the lips and we see the photograph with the soldier's smiling face  She seems to be in a sweet narcotic haze as she reaches out her hand and strokes his  Fergus sits down on the bed as Dil lies back on it still stroking his hand  Her voice is dreamily slurred her eyes far away and she smiles woozily  She woozily tries to hit him round the face and raises an unsteady hand to point at him  He strokes her cheek as she says something very slowly and sleepily and her eyes close as she falls into a deep sleep  Fergus looks down at her almost fondly as they lie on the bed together fully clothed  Dil wakes and rises very quietly going to his coat thrown across a chair  She searches through the pockets and takes out the gun  Meanwhile Jude is in bed as an alarm sounds and she reaches to turn it off  Dil takes several silk stockings out of a drawer and ties them very securely to each corner of the brass bed  She ties them round both of Fergus's feet very gently so as not to wake him  Jude in front of a mirror getting ready is fully dressed  Dil ties the other stocking and is drawing it upward when Fergus wakes  She jerks the silk stocking so it is secure and speaks unnaturally quietly  He slaps her cheek and she opens her eyes slowly  He walks in holding her leans her against the wall and then goes to the window to check the street outside  She takes a large slug from a bottle of whiskey and points weakly to a cabinet through the open door of the bathroom  He goes and gets the pills while she drinks from the whiskey bottle  She walks around the room drinking then sits down and looks at Fergus  She stares straight ahead the bottle clutched in her hands between her knees as Fergus walks slowly toward the door  She looks at him standing up with something incredibly attractive about her and he walks slowly toward her  He kisses her on the lips and we see the photograph with the soldier's smiling face  She seems to be in a sweet narcotic haze as she reaches out her hand and strokes his  Fergus sits down on the bed as Dil lies back on it still stroking his hand  Her voice is dreamily slurred her eyes far away and she smiles woozily  She woozily tries to hit him round the face and raises an unsteady hand to point at him  He strokes her cheek as she says something very slowly and sleepily and her eyes close as she falls into a deep sleep  Fergus looks down at her almost fondly as they lie on the bed together fully clothed  Dil wakes and rises very quietly going to his coat thrown across a chair  She searches through the pockets and takes out the gun  Meanwhile Jude is in bed as an alarm sounds and she reaches to turn it off  Dil takes several silk stockings out of a drawer and ties them very securely to each corner of the brass bed  She ties them round both of Fergus's feet very gently so as not to wake him  Jude in front of a mirror getting ready is fully dressed  Dil ties the other stocking and is drawing it upward when Fergus wakes  She jerks the silk stocking so it is secure and speaks unnaturally quietly  Jude takes a gun from under the bed and slips it into her handbag  Dil crouches beside Fergus his gun in her hand and Fergus stares at her trying to pull on the bindings  She stands up still pointing the gun at Fergus while Jude is on the street and Maguire's car pulls up rapidly and she gets inside  Fergus drags at his bindings as the figure of the judge appears in the window"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He turns and sees Dil walking toward him a bottle in her hand and he runs toward her. They are tussling in the darkness of the park and he takes her arm. Fergus and Dil are on the stairs up to Dil's flat where Fergus looks at her and shakes her growing alarmed. He slaps her cheek and she opens her eyes slowly. He walks in holding her leans her against the wall and then goes to the window to check the street outside. She takes a large slug from a bottle of whiskey and points weakly to a cabinet through the open door of the bathroom. He goes and gets the pills while she drinks from the whiskey bottle. She walks around the room drinking then sits down and looks at Fergus. She stares straight ahead the bottle clutched in her hands between her knees as Fergus walks slowly toward the door. She looks at him standing up with something incredibly attractive about her and he walks slowly toward her. He kisses her on the lips and we see the photograph with the soldier's smiling face. She seems to be in a sweet narcotic haze as she reaches out her hand and strokes his. Fergus sits down on the bed as Dil lies back on it still stroking his hand. Her voice is dreamily slurred her eyes far away and she smiles woozily. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. She woozily tries to hit him round the face and raises an unsteady hand to point at him. He strokes her cheek as she says something very slowly and sleepily and her eyes close as she falls into a deep sleep. Fergus looks down at her almost fondly as they lie on the bed together fully clothed. Dil wakes and rises very quietly going to his coat thrown across a chair. She searches through the pockets and takes out the gun. Meanwhile Jude is in bed as an alarm sounds and she reaches to turn it off. Dil takes several silk stockings out of a drawer and ties them very securely to each corner of the brass bed. She ties them round both of Fergus's feet very gently so as not to wake him. Jude in front of a mirror getting ready is fully dressed. Dil ties the other stocking and is drawing it upward when Fergus wakes. She jerks the silk stocking so it is secure and speaks unnaturally quietly. Jude takes a gun from under the bed and slips it into her handbag. Dil crouches beside Fergus his gun in her hand and Fergus stares at her trying to pull on the bindings. She stands up still pointing the gun at Fergus while Jude is on the street and Maguire's car pulls up rapidly and she gets inside. Fergus drags at his bindings as the figure of the judge appears in the window."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He turns and sees Dil walking toward him a bottle in her hand and he runs toward her. They are tussling in the darkness of the park and he takes her arm. Fergus and Dil are on the stairs up to Dil's flat where Fergus looks at her and shakes her growing alarmed. He slaps her cheek and she opens her eyes slowly. He walks in holding her leans her against the wall and then goes to the window to check the street outside. She takes a large slug from a bottle of whiskey and points weakly to a cabinet through the open door of the bathroom. He goes and gets the pills while she drinks from the whiskey bottle. She walks around the room drinking then sits down and looks at Fergus. She stares straight ahead the bottle clutched in her hands between her knees as Fergus walks slowly toward the door. She looks at him standing up with something incredibly attractive about her and he walks slowly toward her. He kisses her on the lips and we see the photograph with the soldier's smiling face. She seems to be in a sweet narcotic haze as she reaches out her hand and strokes his. Fergus sits down on the bed as Dil lies back on it still stroking his hand. Her voice is dreamily slurred her eyes far away and she smiles woozily. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. She woozily tries to hit him round the face and raises an unsteady hand to point at him. He strokes her cheek as she says something very slowly and sleepily and her eyes close as she falls into a deep sleep. Fergus looks down at her almost fondly as they lie on the bed together fully clothed. Dil wakes and rises very quietly going to his coat thrown across a chair. She searches through the pockets and takes out the gun. Meanwhile Jude is in bed as an alarm sounds and she reaches to turn it off. Dil takes several silk stockings out of a drawer and ties them very securely to each corner of the brass bed. She ties them round both of Fergus's feet very gently so as not to wake him. Jude in front of a mirror getting ready is fully dressed. Dil ties the other stocking and is drawing it upward when Fergus wakes. She jerks the silk stocking so it is secure and speaks unnaturally quietly. Jude takes a gun from under the bed and slips it into her handbag. Dil crouches beside Fergus his gun in her hand and Fergus stares at her trying to pull on the bindings. She stands up still pointing the gun at Fergus while Jude is on the street and Maguire's car pulls up rapidly and she gets inside. Fergus drags at his bindings as the figure of the judge appears in the window."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He turns and sees Dil walking toward him a bottle in her hand and he runs toward her. They are tussling in the darkness of the park and he takes her arm. Fergus and Dil are on the stairs up to Dil's flat where Fergus looks at her and shakes her growing alarmed. He slaps her cheek and she opens her eyes slowly. He walks in holding her leans her against the wall and then goes to the window to check the street outside. She takes a large slug from a bottle of whiskey and points weakly to a cabinet through the open door of the bathroom. He goes and gets the pills while she drinks from the whiskey bottle. She ties them round both of Fergus's feet very gently so as not to wake him. Jude in front of a mirror getting ready is fully dressed. Dil ties the other stocking and is drawing it upward when Fergus wakes. She jerks the silk stocking so it is secure and speaks unnaturally quietly. Jude takes a gun from under the bed and slips it into her handbag. Dil crouches beside Fergus his gun in her hand and Fergus stares at her trying to pull on the bindings. She stands up still pointing the gun at Fergus while Jude is on the street and Maguire's car pulls up rapidly and she gets inside. Fergus drags at his bindings as the figure of the judge appears in the window."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He turns and sees Dil walking toward him a bottle in her hand and he runs toward her. They are tussling in the darkness of the park and he takes her arm. Fergus and Dil are on the stairs up to Dil's flat where Fergus looks at her and shakes her growing alarmed. Dil crouches beside Fergus his gun in her hand and Fergus stares at her trying to pull on the bindings. She stands up still pointing the gun at Fergus while Jude is on the street and Maguire's car pulls up rapidly and she gets inside. Fergus drags at his bindings as the figure of the judge appears in the window."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A kangaroo turns and sees a penguin walking toward it, a bottle in the penguin's hand, and the kangaroo runs toward the penguin. They are tussling in the darkness of the park, and the kangaroo takes the penguin's arm. A squirrel and a penguin are on the stairs up to the penguin's flat, where the squirrel looks at the penguin and shakes the penguin, growing alarmed. The squirrel slaps the penguin's cheek, and the penguin opens its eyes slowly. The kangaroo walks in holding the penguin, leans the penguin against the wall, and then goes to the window to check the street outside. The penguin takes a large slug from a bottle of whiskey and points weakly to a cabinet through the open door of the bathroom. The kangaroo goes and gets the pills while the penguin drinks from the whiskey bottle. The penguin walks around the room drinking, then sits down and looks at the squirrel. The penguin stares straight ahead, the bottle clutched in its hands between its knees, as the squirrel walks slowly toward the door. The penguin looks at the squirrel, standing up, with something incredibly attractive about it, and the squirrel walks slowly toward the penguin. The squirrel kisses the penguin on the lips, and we see the photograph with the soldier's smiling face. The penguin seems to be in a sweet narcotic haze as it reaches out its hand and strokes the squirrel's. The squirrel sits down on the bed as the penguin lies back on it, still stroking the squirrel's hand. The penguin's voice is dreamily slurred, its eyes far away, and it smiles woozily. The penguin woozily tries to hit the squirrel round the face and raises an unsteady hand to point at the squirrel. The squirrel strokes the penguin's cheek as the penguin says something very slowly and sleepily, and its eyes close as it falls into a deep sleep. The squirrel looks down at the penguin almost fondly as they lie on the bed together, fully clothed. The penguin wakes and rises very quietly, going to the squirrel's coat thrown across a chair. The penguin searches through the pockets and takes out the gun. Meanwhile, a giraffe is in bed as an alarm sounds, and the giraffe reaches to turn it off. The penguin takes several silk stockings out of a drawer and ties them very securely to each corner of the brass bed. The penguin ties them round both of the squirrel's feet very gently so as not to wake it. The giraffe, in front of a mirror getting ready, is fully dressed. The penguin ties the other stocking and is drawing it upward when the squirrel wakes. The penguin jerks the silk stocking so it is secure and speaks unnaturally quietly. The giraffe takes a gun from under the bed and slips it into its handbag. The penguin crouches beside the squirrel, the squirrel's gun in its hand, and the squirrel stares at the penguin, trying to pull on the bindings. The penguin stands up, still pointing the gun at the squirrel, while the giraffe is on the street and a hedgehog's car pulls up rapidly and the giraffe gets inside. The squirrel drags at its bindings as the figure of the judge appears in the window."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He turns and sees Dil walking toward him, a bouquet in her hand, and he runs toward her. They are tussling in the darkness of the garden, and he takes her umbrella. Fergus and Dil are on the escalator up to Dil's loft, where Fergus looks at her and shakes her, growing alarmed. He taps her shoulder, and she opens her eyes slowly. He walks in holding her, leans her against the bookshelf, and then goes to the curtain to check the alley outside. She takes a large sip from a bottle of soda and points weakly to a dresser through the open door of the kitchen. He goes and gets the candles while she drinks from the soda bottle. She walks around the room drinking, then sits down and looks at Fergus. She stares straight ahead, the bottle clutched in her hands between her knees, as Fergus walks slowly toward the fireplace. She looks at him, standing up, with something incredibly charming about her, and he walks slowly toward her. He kisses her on the forehead, and we see the painting with the soldier's smiling face. She seems to be in a sweet reverie as she reaches out her hand and strokes his. Fergus sits down on the ottoman as Dil lies back on it, still stroking his hand. Her voice is dreamily slurred, her eyes far away, and she smiles woozily. She woozily tries to hit him round the shoulder and raises an unsteady hand to point at him. He strokes her hair as she says something very slowly and sleepily, and her eyes close as she falls into a deep sleep. Fergus looks down at her almost fondly as they lie on the ottoman together, fully clothed. Dil wakes and rises very quietly, going to his sweater thrown across a stool. She searches through the pockets and takes out the pen. Meanwhile, Jude is in bed as a bell sounds, and she reaches to turn it off. Dil takes several ribbons out of a drawer and ties them very securely to each corner of the wooden bed. She ties them round both of Fergus's ankles very gently so as not to wake him. Jude, in front of a mirror getting ready, is fully dressed. Dil ties the other ribbon and is drawing it upward when Fergus wakes. She jerks the ribbon so it is secure and speaks unnaturally quietly. Jude takes a dagger from under the bed and slips it into her purse. Dil crouches beside Fergus, his pen in her hand, and Fergus stares at her, trying to pull on the bindings. She stands up, still pointing the pen at Fergus, while Jude is on the avenue and Maguire's van pulls up rapidly and she gets inside. Fergus drags at his bindings as the figure of the detective appears in the window."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He pivots and notices Dil strolling toward him, a bottle in her hand, and he dances toward her. They are tumbling in the darkness of the park, and he brushes her arm. Fergus and Dil are on the stairs up to Dil's flat, where Fergus glances at her and nudges her, growing confused. He pats her cheek, and she closes her eyes slowly. He wanders in holding her, props her against the wall, and then heads to the window to glance at the street outside. She takes a small sip from a bottle of whiskey and gestures weakly to a cabinet through the open door of the bathroom. He strolls and grabs the pills while she sips from the whiskey bottle. She paces around the room drinking, then settles down and gazes at Fergus. She gazes straight ahead, the bottle clenched in her hands between her knees, as Fergus ambles slowly toward the door. She glances at him, rising up, with something incredibly intriguing about her, and he ambles slowly toward her. He taps her on the lips, and we see the photograph with the soldier's grinning face. She appears to be in a sweet dreamy haze as she extends her hand and caresses his. Fergus perches on the bed as Dil reclines back on it, still caressing his hand. Her voice is dreamily muddled, her eyes distant, and she grins dreamily. She dreamily tries to nudge him round the face and lifts a shaky hand to gesture at him. He brushes her cheek as she utters something very slowly and drowsily, and her eyes close as she drifts into a deep slumber. Fergus gazes down at her almost adoringly as they rest on the bed together, fully clothed. Dil stirs and rises very quietly, approaching his coat tossed across a chair. She rummages through the pockets and retrieves the gun. Meanwhile, Jude is in bed as an alarm rings, and she stretches to mute it. Dil takes several silk stockings out of a drawer and fastens them very securely to each corner of the brass bed. She secures them round both of Fergus's feet very softly so as not to rouse him. Jude, in front of a mirror getting ready, is fully dressed. Dil fastens the other stocking and is pulling it upward when Fergus stirs. She tugs the silk stocking so it is fast and speaks unnaturally softly. Jude fetches a gun from under the bed and slides it into her handbag. Dil crouches beside Fergus, his gun in her hand, and Fergus glances at her, attempting to tug on the bindings. She rises, still aiming the gun at Fergus, while Jude is on the street and Maguire's car zips up rapidly and she climbs inside. Fergus strains at his bindings as the figure of the judge materializes in the window."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The laptop turns and sees a pineapple walking toward it, a magazine in its paw, and the laptop runs toward the magazine. They are wrestling in the shadows of the library, and the laptop takes the magazine's page. The banana and the pineapple are on the elevator up to the pineapple's attic, where the banana looks at it and shakes it, growing concerned. The banana slaps the pineapple's nose, and it opens its eyes slowly. The banana walks in holding the pineapple, leans the pineapple against the bookshelf, and then goes to the curtain to check the garden outside. The pineapple takes a large bite from a sandwich and points weakly to a suitcase through the open gate of the garage. The banana goes and gets the marbles while the pineapple snacks on the sandwich. The pineapple walks around the attic munching, then sits down and looks at the banana. The pineapple stares straight ahead, the sandwich clutched in its paws between its knees, as the banana walks slowly toward the gate. The pineapple looks at the banana, standing up, with something incredibly fascinating about it, and the banana walks slowly toward the pineapple. The banana kisses the pineapple on the nose, and we see the painting with the gardener's grinning face. The pineapple seems to be in a sweet hypnotic mist as it reaches out its paw and pats the banana's. The banana sits down on the hammock as the pineapple lies back on it, still patting the banana's paw. Its voice is dreamily slurred, its eyes far away, and it smiles drowsily. It drowsily tries to tap the banana round the face and raises an unsteady paw to point at the banana. The banana pats the pineapple's nose as it says something very slowly and sleepily, and its eyes close as it falls into a deep slumber. The banana looks down at the pineapple almost fondly as they lie on the hammock together, fully clothed. The pineapple wakes and rises very quietly, going to its hat tossed across a stool. It searches through the pockets and takes out the spatula. Meanwhile, the book is in bed as a doorbell rings, and it reaches to turn it off. The pineapple takes several silk gloves out of a basket and ties them very securely to each corner of the metal hammock. It ties them round both of the banana's sneakers very gently so as not to wake the banana. The book, in front of an easel getting ready, is fully dressed. The pineapple ties the other glove and is drawing it upward when the banana wakes. It jerks the silk glove so it is secure and speaks unnaturally quietly. The book takes a spatula from under the hammock and slips it into its backpack. The pineapple crouches beside the banana, its spatula in its paw, and the banana stares at it, trying to pull on the bindings. The pineapple stands up, still pointing the spatula at the banana, while the book is on the avenue and the tennis player's helicopter pulls up rapidly and it gets inside. The banana drags at its bindings as the figure of the musician appears in the curtain."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "He rotates and notices Sam gliding toward him, a feather in her hand, and he skips toward her. They are grappling in the shadows of the park, and he nudges her shoulder. Charlie and Sam are on the elevator up to Sam's flat, where Charlie glances at her and nudges her, growing perturbed. He taps her nose, and she blinks her eyes slowly. He strolls in supporting her, props her against the wall, and then meanders to the window to glance at the street outside. She takes a substantial sip from a mug of tea and gestures weakly to a painting through the open door of the kitchen. He ambles and fetches the cookies while she sips from the tea mug. She paces around the room sipping, then perches down and gazes at Charlie. She glares straight ahead, the mug held in her hands between her knees, as Charlie strolls slowly toward the door. She glances at him, rising up, with something incredibly magnetic about her, and he strolls slowly toward her. He pecks her on the forehead, and we see the painting with the sailor's cheerful face. She seems to be in a blissful trance as she extends her hand and caresses his. Charlie reclines on the chair as Sam lies back on it, still caressing his hand. Her voice is dreamily slurred, her eyes distant, and she grins groggily. She groggily attempts to pinch him on the arm and raises an unsteady finger to point at him. He caresses her nose as she mumbles something very slowly and groggily, and her eyes close as she drifts into a deep slumber. Charlie stares down at her almost affectionately as they rest on the chair together, fully dressed. Sam awakens and rises very quietly, drifting to his hat tossed across a table. She rifles through the pockets and extracts the book. Meanwhile, Alice is in the kitchen as a timer dings, and she reaches to silence it. Sam retrieves several silk scarves out of a drawer and wraps them very securely to each corner of the wooden chair. She fastens them round both of Charlie's ankles very gently so as not to disturb him. Alice, before a window preparing breakfast, is fully clothed. Sam secures the other scarf and is adjusting it upward when Charlie stirs. She yanks the silk scarf so it is snug and whispers unnaturally softly. Alice retrieves a book from beside the bed and slips it into her backpack. Sam crouches beside Charlie, his book in her hand, and Charlie peers at her, attempting to tug on the bindings. She stands up, still aiming the book at Charlie, while Alice is on the street and Harrison's bike wheels up swiftly and she climbs aboard. Charlie tugs at his bindings as the figure of the plumber appears in the window."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He spins around and notices Dil strolling in his direction, a lantern in her hand, and he skips toward her. They are wrestling in the shadows of the garden, and he grasps her shoulder. Fergus and Dil are on the escalator up to Dil's room, where Fergus glances at her and nudges her, becoming anxious. He taps her forehead, and she blinks her eyes slowly. He steps inside holding her, rests her against the desk, and then goes to the curtain to spy on the alley outside. She sips deeply from a jug of cider and gestures weakly toward a drawer through the open door of the closet. He fetches the candies while she sips from the cider jug. She paces around the house sipping, then plops down and gazes at Fergus. She gazes directly ahead, the jug clasped in her arms between her legs, as Fergus shuffles gradually toward the exit. She glances at him, rising up, with something remarkably alluring about her, and he strolls leisurely toward her. He pecks her on the forehead, and we notice the painting with the sailor's grinning face. She appears to be in a soothing trance as she extends her hand and pats his. Fergus settles on the couch as Dil reclines on it, still patting his hand. Her voice is lazily slurred, her eyes distant, and she grins drowsily. She sluggishly attempts to flick him on the ear and lifts an unstable hand to gesture at him. He caresses her forehead as she utters something very slowly and sleepily, and her eyes shut as she drifts into a profound rest. Fergus gazes down at her almost tenderly as they lie on the couch together, fully dressed. Dil awakes and ascends very quietly, approaching his jacket draped over a sofa. She rummages through the sleeves and pulls out the radio. Meanwhile, Jude is in bed as a bell rings, and she stretches to turn it off. Dil extracts several velvet ribbons from a box and knots them very securely to each leg of the wooden chair. She ties them around both of Fergus's wrists very gently so as not to stir him. Jude, in front of a mirror preparing, is fully dressed. Dil knots the other ribbon and is tugging it upward when Fergus awakens. She tugs the velvet ribbon so it is secure and speaks unnaturally softly. Jude retrieves a knife from under the pillow and slips it into her purse. Dil crouches beside Fergus, his radio in her hand, and Fergus gawks at her, attempting to tug on the restraints. She rises, still aiming the radio at Fergus, while Jude is on the avenue and Maguire's bike zooms up swiftly and she hops on. Fergus tugs at his restraints as the silhouette of the umpire materializes in the doorway."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "He spins and spots Dawn strolling toward him, a trumpet in her grip, and he leaps toward her. They are wrestling in the twilight of the meadow, and he grabs her elbow. Wyatt and Dawn are on the elevator up to Dawn's loft, where Wyatt glances at her and nudges her, growing distressed. He pats her shoulder, and she opens her eyes lethargically. He strides in holding her, props her against the bookshelf, and then moves to the balcony to survey the alley outside. She takes a big gulp from a jug of lemonade and gestures feebly to a bookshelf through the open arch of the hallway. He goes and retrieves the marbles while she sips from the lemonade jug. She paces around the space sipping, then perches and gazes at Wyatt. She gazes straight ahead, the jug clutched in her fingers between her elbows, as Wyatt ambles steadily toward the exit. She notices him, standing upright, with something incredibly alluring about her, and he ambles steadily toward her. He pecks her on the forehead, and we glimpse the painting with the sailor's grinning countenance. She appears to be in a sweet floral daze as she extends her palm and caresses his. Wyatt reclines on the sofa as Dawn sprawls back on it, still caressing his palm. Her voice is lazily muddled, her eyes distant, and she grins drowsily. She drowsily attempts to tap him across the chin and lifts a wobbly finger to indicate him. He caresses her temple as she murmurs something very sluggishly and drowsily, and her eyes shut as she drifts into a profound slumber. Wyatt peers down at her almost tenderly as they rest on the sofa together, fully clothed. Dawn rouses and rises very softly, going to his sweater tossed across a stool. She rifles through the seams and extracts the spoon. Meanwhile, Claire is in a bunk as a chime rings, and she extends to silence it. Dawn takes several silk scarves out of a chest and fastens them very carefully to each post of the cedar cot. She fastens them around both of Wyatt's ankles very softly so as not to rouse him. Claire, before a mirror preparing, is fully clothed. Dawn fastens the other scarf and is stretching it upward when Wyatt stirs. She tugs the silk scarf so it is tight and whispers unnaturally softly. Claire takes a spoon from beneath the bunk and slides it into her satchel. Dawn crouches beside Wyatt, his spoon in her grip, and Wyatt gazes at her, struggling to pull on the restraints. She stands up, still aiming the spoon at Wyatt, while Claire is on the avenue and Rourke's bus pulls up swiftly and she climbs inside. Wyatt tugs at his restraints as the shadow of the baker emerges in the doorway."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Fergus sees Dil approaching with a bottle in the park and runs to her. As they reach Dil's flat, Fergus is alarmed and slaps her awake. He checks outside and brings her pills as she drinks whiskey. Dil drinks and stares, and Fergus approaches and kisses her. In a daze, she strokes his hand before falling asleep beside him on the bed. She wakes quietly, retrieves a gun from his coat, and ties his feet to the bed with silk stockings. Jude awakens to an alarm, takes a gun, and prepares to leave. When Dil secures Fergus, he awakens and struggles with the bindings. Dil, holding his gun, confronts Fergus, while Jude gets into Maguire's car outside."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Fergus drags at his bindings as the figure of the judge appears in the window She stands up still pointing the gun at Fergus while Jude is on the street and Maguire's car pulls up rapidly and she gets inside  Dil crouches beside Fergus his gun in her hand and Fergus stares at her trying to pull on the bindings  Jude takes a gun from under the bed and slips it into her handbag  She jerks the silk stocking so it is secure and speaks unnaturally quietly  Dil ties the other stocking and is drawing it upward when Fergus wakes  Jude in front of a mirror getting ready is fully dressed  She ties them round both of Fergus's feet very gently so as not to wake him  Dil takes several silk stockings out of a drawer and ties them very securely to each corner of the brass bed  Meanwhile Jude is in bed as an alarm sounds and she reaches to turn it off  She searches through the pockets and takes out the gun  Dil wakes and rises very quietly going to his coat thrown across a chair  Fergus looks down at her almost fondly as they lie on the bed together fully clothed  He strokes her cheek as she says something very slowly and sleepily and her eyes close as she falls into a deep sleep  She woozily tries to hit him round the face and raises an unsteady hand to point at him  Her voice is dreamily slurred her eyes far away and she smiles woozily  Fergus sits down on the bed as Dil lies back on it still stroking his hand  She seems to be in a sweet narcotic haze as she reaches out her hand and strokes his  He kisses her on the lips and we see the photograph with the soldier's smiling face  She looks at him standing up with something incredibly attractive about her and he walks slowly toward her  She stares straight ahead the bottle clutched in her hands between her knees as Fergus walks slowly toward the door  She walks around the room drinking then sits down and looks at Fergus  He goes and gets the pills while she drinks from the whiskey bottle  She takes a large slug from a bottle of whiskey and points weakly to a cabinet through the open door of the bathroom  He walks in holding her leans her against the wall and then goes to the window to check the street outside  He slaps her cheek and she opens her eyes slowly  Fergus and Dil are on the stairs up to Dil's flat where Fergus looks at her and shakes her growing alarmed  They are tussling in the darkness of the park and he takes her arm  He turns and sees Dil walking toward him a bottle in her hand and he runs toward her "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He strokes her cheek as she says something very slowly and sleepily and her eyes close as she falls into a deep sleep  Her voice is dreamily slurred her eyes far away and she smiles woozily  He goes and gets the pills while she drinks from the whiskey bottle  Jude takes a gun from under the bed and slips it into her handbag  She walks around the room drinking then sits down and looks at Fergus  She ties them round both of Fergus's feet very gently so as not to wake him  He turns and sees Dil walking toward him a bottle in her hand and he runs toward her  Dil wakes and rises very quietly going to his coat thrown across a chair  Fergus looks down at her almost fondly as they lie on the bed together fully clothed  She takes a large slug from a bottle of whiskey and points weakly to a cabinet through the open door of the bathroom  She looks at him standing up with something incredibly attractive about her and he walks slowly toward her  She stands up still pointing the gun at Fergus while Jude is on the street and Maguire's car pulls up rapidly and she gets inside  He walks in holding her leans her against the wall and then goes to the window to check the street outside  Dil takes several silk stockings out of a drawer and ties them very securely to each corner of the brass bed  She searches through the pockets and takes out the gun  Fergus drags at his bindings as the figure of the judge appears in the window Dil ties the other stocking and is drawing it upward when Fergus wakes  She woozily tries to hit him round the face and raises an unsteady hand to point at him  They are tussling in the darkness of the park and he takes her arm  She stares straight ahead the bottle clutched in her hands between her knees as Fergus walks slowly toward the door  Meanwhile Jude is in bed as an alarm sounds and she reaches to turn it off  Jude in front of a mirror getting ready is fully dressed  She seems to be in a sweet narcotic haze as she reaches out her hand and strokes his  Dil crouches beside Fergus his gun in her hand and Fergus stares at her trying to pull on the bindings  Fergus sits down on the bed as Dil lies back on it still stroking his hand  Fergus and Dil are on the stairs up to Dil's flat where Fergus looks at her and shakes her growing alarmed  He slaps her cheek and she opens her eyes slowly  He kisses her on the lips and we see the photograph with the soldier's smiling face  She jerks the silk stocking so it is secure and speaks unnaturally quietly "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He strokes her cheek as she says something very slowly and sleepily and her eyes close as she falls into a deep sleep  Fergus looks down at her almost fondly as they lie on the bed together fully clothed  Dil wakes and rises very quietly going to his coat thrown across a chair  She searches through the pockets and takes out the gun  Meanwhile Jude is in bed as an alarm sounds and she reaches to turn it off  Dil takes several silk stockings out of a drawer and ties them very securely to each corner of the brass bed  She ties them round both of Fergus's feet very gently so as not to wake him  Jude in front of a mirror getting ready is fully dressed  Dil ties the other stocking and is drawing it upward when Fergus wakes  She jerks the silk stocking so it is secure and speaks unnaturally quietly  Jude takes a gun from under the bed and slips it into her handbag  Dil crouches beside Fergus his gun in her hand and Fergus stares at her trying to pull on the bindings  She stands up still pointing the gun at Fergus while Jude is on the street and Maguire's car pulls up rapidly and she gets inside  Fergus drags at his bindings as the figure of the judge appears in the window He turns and sees Dil walking toward him a bottle in her hand and he runs toward her  They are tussling in the darkness of the park and he takes her arm  Fergus and Dil are on the stairs up to Dil's flat where Fergus looks at her and shakes her growing alarmed  He slaps her cheek and she opens her eyes slowly  He walks in holding her leans her against the wall and then goes to the window to check the street outside  She takes a large slug from a bottle of whiskey and points weakly to a cabinet through the open door of the bathroom  He goes and gets the pills while she drinks from the whiskey bottle  She walks around the room drinking then sits down and looks at Fergus  She stares straight ahead the bottle clutched in her hands between her knees as Fergus walks slowly toward the door  She looks at him standing up with something incredibly attractive about her and he walks slowly toward her  He kisses her on the lips and we see the photograph with the soldier's smiling face  She seems to be in a sweet narcotic haze as she reaches out her hand and strokes his  Fergus sits down on the bed as Dil lies back on it still stroking his hand  Her voice is dreamily slurred her eyes far away and she smiles woozily  She woozily tries to hit him round the face and raises an unsteady hand to point at him "
        }
      ]
    }
  ]
}