{
  "ground_truth": "The movie begins with an outline of a woman, followed by Jude and Maguire sitting in a car parked across the street as they look toward a paper seller. Meanwhile, Fergus pulls furiously at his bindings and then drives off. Exhausted, Fergus collapses back on the bed while Maguire's car circles around once more. Fergus strains and roars from the bed as Maguire observes the brothel door opening and sees the elderly judge coming out. The judge’s car, occupied by his security men, accelerates toward him. Maguire grabs something from a woman's pocket, throws open the door, and runs across the street. As Fergus continues to pull at his bindings, the judge walks toward his car, assisted by his goon holding the door open. Maguire advances with a gun in hand, prompting the goon to see him. Maguire shoots while running, causing the judge to fall. The goon, hit in the arm, draws an Uzi and returns fire. Maguire is hit but continues shooting, while other goons rush from the car, causing mayhem and screaming. Jude steps on her car's pedal and screeches away, leaving Maguire dead. The scene shifts to Dil dressed in a soldier's cricket clothes, appearing like a sweet little boy, as she approaches Fergus in bed and points a gun at his head. She begins to cry, gently places the gun on his chest, and pulls on his bindings to free him. Two police cars, sirens wailing, pass by as Dil's face is close to Fergus's, with the stockings that bound his hands nearly undone. His arm is freed, and he strokes her hair as she shudders with weeping, accompanied by the music of a song playing in the background. Jude enters through the open door, arms extended and holding a gun, prompting Dil to rise from the bed and aim her gun at Jude. Dil fires and hits Jude, who falls and writhes on the floor. As Dil walks closer, Jude reaches for her gun, grabs it, but Dil shoots again like a child playing with a toy, hitting Jude in her gun shoulder. Jude spins one way, her gun the other, leading Fergus to scream. As Jude raises her gun, Dil shoots repeatedly, causing Fergus to scream again from the bed as he rips free his other arm. Dil shoots Jude in the throat, killing her amidst a cover of blood. Dil then turns the gun on Fergus, squeezing the trigger, but she stops and looks at a picture, walks over, and sits in front of it. She places the gun in her mouth, but Fergus gently removes it and sets it on the table. He lifts her by the shoulders and guides her out the door. Fergus returns to the room, passing Jude's body, and looks out the window to see Dil staggering down the street through the gathering crowd.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The film starts with an outline of a lady, followed by Jude and Maguire seated in a vehicle parked opposite the road as they gaze toward a news vendor. Meanwhile, Fergus tugs furiously at his bonds and then drives away. Weary, Fergus collapses back on the mattress while Maguire's vehicle circles around once more. Fergus strains and bellows from the mattress as Maguire watches the brothel entrance opening and sees the aged magistrate emerging. The magistrate’s vehicle, occupied by his security personnel, accelerates toward him. Maguire grabs something from a lady's pocket, throws open the entrance, and dashes across the road. As Fergus continues to pull at his bonds, the magistrate walks toward his vehicle, assisted by his henchman holding the entrance open. Maguire advances with a pistol in hand, prompting the henchman to spot him. Maguire fires while running, causing the magistrate to topple. The henchman, struck in the limb, draws an Uzi and returns fire. Maguire is struck but continues firing, while other henchmen rush from the vehicle, causing chaos and shouting. Jude presses on her vehicle's accelerator and screeches away, leaving Maguire deceased. The scene shifts to Dil dressed in a soldier's cricket attire, appearing like a sweet little child, as she approaches Fergus in bed and points a pistol at his head. She begins to sob, gently places the pistol on his chest, and tugs on his bonds to release him. Two police vehicles, sirens wailing, pass by as Dil's face is close to Fergus's, with the stockings that bound his hands nearly undone. His limb is freed, and he strokes her hair as she shudders with sobbing, accompanied by the music of a tune playing in the backdrop. Jude enters through the open entrance, arms extended and holding a pistol, prompting Dil to rise from the mattress and aim her pistol at Jude. Dil fires and hits Jude, who falls and writhes on the flooring. As Dil walks closer, Jude reaches for her pistol, grabs it, but Dil fires again like a child playing with a toy, hitting Jude in her pistol shoulder. Jude spins one way, her pistol the other, leading Fergus to scream. As Jude raises her pistol, Dil fires repeatedly, causing Fergus to scream again from the mattress as he rips free his other limb. Dil fires Jude in the throat, killing her amidst a cover of blood. Dil then turns the pistol on Fergus, squeezing the trigger, but she stops and looks at a photograph, walks over, and sits in front of it. She places the pistol in her mouth, but Fergus gently removes it and sets it on the table. He lifts her by the shoulders and guides her out the entrance. Fergus returns to the area, passing Jude's corpse, and looks out the window to see Dil staggering down the road through the gathering crowd."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The movie is begun with an outline of a woman, followed by Jude and Maguire sitting in a car parked across the street as a paper seller is looked toward by them. Meanwhile, Fergus furiously pulls at his bindings and then the car is driven off by him. Exhausted, the bed is collapsed back onto by Fergus while Maguire circles the car around once more. Fergus strains and roars from the bed as Maguire observes the brothel door opening and the elderly judge is seen coming out by him. The judge’s car, occupied by his security men, is accelerated toward him. Something is grabbed by Maguire from a woman's pocket, the door is thrown open by him, and the street is run across. As Fergus continues to pull at his bindings, the goon holding the door open for the judge is assisting him toward his car. With a gun in hand, Maguire advances, prompting the goon to see him. While running, Maguire shoots, causing the judge to fall. Hit in the arm, the goon draws an Uzi and fires back. Maguire is hit but he continues shooting, while other goons rush from the car, causing mayhem and screaming. The pedal of her car is stepped on by Jude, and Maguire is left dead as she screeches away. The scene is shifted to Dil dressed in a soldier's cricket clothes, appearing like a sweet little boy, as Fergus is approached in bed and a gun is pointed at his head by her. She begins to cry, gently places the gun on his chest, and his bindings are pulled on to free him by her. Two police cars, sirens wailing, pass by as Dil's face is close to Fergus's, with the stockings that bound his hands nearly undone. His arm is freed, and her hair is stroked by him as she shudders with weeping, accompanied by the music of a song playing in the background. The open door is entered through by Jude, arms extended and holding a gun, prompting Dil to rise from the bed and her gun is aimed at Jude by her. Dil fires and Jude is hit, who falls and writhes on the floor. As Dil walks closer, Jude reaches for her gun, grabs it, but Dil shoots again like a child playing with a toy, hitting Jude in her gun shoulder. One way is spun by Jude, her gun the other, leading Fergus to scream. As Jude raises her gun, Dil shoots repeatedly, causing Fergus to scream again from the bed as his other arm is ripped free. Jude is shot in the throat by Dil, killing her amidst a cover of blood. Fergus is then turned on by Dil with the gun, the trigger is squeezed by her, but a picture is looked at, walked over to, and sat in front of by her. The gun is placed in her mouth by her, but Fergus gently removes it and sets it on the table. She is lifted by the shoulders by him and guided out the door. Fergus returns to the room, passing Jude's body, and the window is looked out of by him to see Dil staggering down the street through the gathering crowd."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The movie starts with a woman's outline, followed by Jude and Maguire in a car watching a paper seller. Fergus struggles with his bindings and drives off, collapsing on a bed as Maguire's car circles. Fergus roars from the bed while Maguire sees a judge leaving a brothel. The judge's car speeds toward him, and Maguire grabs something from a woman's pocket, runs across the street, and shoots the judge. The goon, hit in the arm, returns fire with an Uzi. Maguire is hit but keeps shooting as chaos ensues. Jude speeds away, leaving Maguire dead. The scene shifts to Dil in soldier's cricket clothes, pointing a gun at Fergus. She cries, places the gun on his chest, and frees him. Police cars pass as Dil's face is close to Fergus's, and he strokes her hair. Jude enters with a gun, prompting Dil to shoot her. Jude falls, and Dil shoots again, hitting Jude's shoulder. Fergus screams as Dil shoots Jude in the throat, killing her. Dil turns the gun on Fergus but stops, looks at a picture, and sits in front of it. She puts the gun in her mouth, but Fergus removes it and guides her out. Fergus returns, passing Jude's body, and sees Dil staggering through the crowd."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The movie starts with a woman's outline, then Jude and Maguire in a car watching a paper seller. Fergus struggles with his bindings and drives off, collapsing on the bed as Maguire's car circles. Fergus roars as Maguire sees a judge leaving a brothel. The judge's car speeds toward him, and Maguire grabs something, runs, and shoots, hitting the judge. The goon returns fire, hitting Maguire, who continues shooting. Jude speeds away, leaving Maguire dead. Dil, dressed in soldier's cricket clothes, approaches Fergus, points a gun, cries, and frees him. Police cars pass as Fergus strokes her hair. Jude enters with a gun, prompting Dil to shoot her. Jude falls, reaches for her gun, but Dil shoots again, hitting Jude's shoulder. Jude spins, and Fergus screams. Dil shoots Jude in the throat, killing her. Dil turns the gun on Fergus but stops, looks at a picture, and puts the gun in her mouth. Fergus removes it, guides her out, and returns to see Dil staggering through a crowd."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The movie opens with a striking silhouette of a woman, setting the stage for the unfolding drama. Shortly thereafter, we see Jude and Maguire seated inside a car that is parked strategically across the street. Their attention is fixed on a paper seller nearby. Meanwhile, Fergus is seen struggling intensely with his bindings, and then he drives off in a hurry. Exhausted from his efforts, Fergus collapses back onto the bed, while Maguire's car makes another pass around the area. From the bed, Fergus strains and lets out a roar as Maguire observes the brothel door opening, revealing an elderly judge stepping out. The judge’s car, filled with his security personnel, speeds toward him. Maguire quickly grabs something from a woman's pocket, flings open the car door, and dashes across the street. As Fergus continues to struggle with his bindings, the judge approaches his car, aided by his goon who holds the door open for him. Maguire advances with a gun in hand, catching the goon's attention. Maguire fires while running, causing the judge to fall to the ground. The goon, wounded in the arm, draws an Uzi and returns fire. Despite being hit, Maguire continues to shoot, while other goons rush out of the car, creating chaos and eliciting screams. Jude slams her foot on the car's pedal and screeches away, leaving Maguire dead behind her. The scene transitions to Dil, who is dressed in a soldier's cricket attire, giving her the appearance of an innocent young boy. She approaches Fergus, who is still in bed, and points a gun at his head. Overcome with emotion, she begins to cry, gently places the gun on his chest, and tugs at his bindings to free him. As two police cars, sirens blaring, speed past, Dil's face is close to Fergus's, with the stockings that bound his hands nearly undone. Once his arm is free, he tenderly strokes her hair as she shudders with sobs, all while a song plays softly in the background. Jude enters through the open door, arms extended and holding a gun, prompting Dil to rise from the bed and aim her gun at Jude. Dil fires and hits Jude, who falls to the floor, writhing in pain. As Dil approaches, Jude reaches for her gun, grabs it, but Dil fires again, like a child playing with a toy, hitting Jude in her gun shoulder. Jude spins in one direction, her gun in another, causing Fergus to scream. As Jude raises her gun once more, Dil fires repeatedly, prompting Fergus to scream again from the bed as he tears free his other arm. Dil shoots Jude in the throat, ending her life in a spray of blood. Dil then turns the gun on Fergus, squeezing the trigger, but she hesitates and looks at a picture, walks over to it, and sits down in front of it. She places the gun in her mouth, but Fergus gently removes it and sets it on the table. He lifts her by the shoulders and guides her out the door. Fergus returns to the room, passing by Jude's lifeless body, and looks out the window to see Dil staggering down the street through the gathering crowd."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The movie begins with an impressive and striking silhouette of a woman, which effectively sets the stage for the drama that is about to unfold. Shortly after this opening scene, we find Jude and Maguire quietly seated inside a car. This car is parked in a calculated manner across the street, positioned strategically for their purposes. Their focus is intently locked onto a nearby paper seller. In the meantime, Fergus is depicted as he struggles mightily with his bindings; and then, driven by urgency, he speeds away in a hasty manner. Worn out from his exertions, Fergus collapses back onto the bed in exhaustion, while Maguire’s car completes another pass around the surrounding area. From his position on the bed, Fergus strains and lets out a loud, frustrated roar as Maguire carefully watches the brothel door open, revealing an elderly judge stepping out into view. The judge’s vehicle, filled with his security personnel, speeds purposefully toward him. Maguire swiftly grabs an item from a woman's pocket, springs the car door open, and makes a dash across the street. As Fergus continues to wrestle and struggle with his bindings, the judge reaches his car, aided by his goon who dutifully holds the door open. Maguire advances with a firearm in hand, catching the attention of the goon. Maguire fires his weapon while running, which causes the judge to collapse to the ground. The goon, wounded in the arm, retrieves an Uzi and returns fire. Despite being struck, Maguire persists in shooting, while additional goons rush out of the vehicle, which creates a scene of chaos, filled with screams. Jude urgently slams her foot down on the car’s pedal and screeches away, leaving the fallen Maguire behind. The scene shifts to Dil, who is uniquely dressed in a soldier's cricket attire, giving her the innocent appearance of a young boy. She approaches Fergus, who remains in bed, and points a firearm at his head. Overcome with emotion, she begins to cry, gently placing the weapon on his chest and proceeds to tug at his bindings in order to free him. As two police cars, with sirens blaring, speed by, Dil’s face is very close to Fergus’s, with the stockings that had bound his hands nearly coming undone. Once he is able to free his arm, he tenderly strokes her hair as she shakes with sobs, all while a soft song plays in the background. Jude enters through the open door, extending her arms while holding a gun, which prompts Dil to rise from the bed and aim her firearm at Jude. Dil fires her weapon, hitting Jude and causing her to collapse to the floor, writhing in pain. As Dil approaches, Jude attempts to reach for her own gun, grabbing hold of it, but Dil fires once again, much like a child playing with a toy, hitting Jude in her gun shoulder. Jude spins in one direction, while her gun spins in another, resulting in Fergus screaming. As Jude attempts to raise her gun once more, Dil fires multiple times, inducing another scream from Fergus on the bed as he manages to free his other arm. Dil delivers a final shot to Jude's throat, ending her life in a dramatic spray of blood. Dil then turns her weapon on Fergus, pulls the trigger, but hesitates, her attention caught by a picture. She walks over to it and sits down in front of it. Dil places the gun in her mouth, but Fergus gently removes it from her grasp and sets it on the table. He lifts her by the shoulders and guides her out of the door. Fergus then returns to the room, walking past Jude's lifeless body, and looks out the window to observe Dil as she staggers down the street through the growing crowd."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The movie begins with the silhouette of a woman, setting the scene as Jude and Maguire sit in a car parked across the street, their eyes fixed on a paper seller. Meanwhile, Fergus, bound and struggling, pulls furiously at his restraints before managing to drive off. Exhausted from his efforts, Fergus collapses back onto the bed, while Maguire's car circles around once more, keeping a watchful eye on the surroundings. Fergus strains and roars from the bed, his frustration palpable, as Maguire observes the brothel door opening and sees the elderly judge emerging. The judge, accompanied by his security men, makes his way to his car, which accelerates toward him. In a swift motion, Maguire grabs something from a woman's pocket, throws open the car door, and dashes across the street. As Fergus continues to struggle with his bindings, the judge approaches his car, assisted by a goon who holds the door open for him. Maguire advances with a gun in hand, catching the attention of the goon, who sees him and reacts. Maguire fires his weapon while running, causing the judge to fall to the ground. The goon, hit in the arm, draws an Uzi and returns fire, creating a chaotic scene. Despite being hit, Maguire continues to shoot, while other goons rush from the car, adding to the mayhem and causing screams to fill the air. Jude, witnessing the chaos, steps on her car's pedal and screeches away, leaving Maguire dead in the street. The scene shifts to Dil, dressed in a soldier's cricket clothes, giving her the appearance of a sweet little boy, as she approaches Fergus, who is still in bed, and points a gun at his head. Overcome with emotion, she begins to cry, gently placing the gun on his chest before pulling on his bindings to free him. As two police cars, sirens wailing, pass by outside, Dil's face is close to Fergus's, with the stockings that bound his hands nearly undone. His arm is finally freed, and he tenderly strokes her hair as she shudders with weeping, the music of a song playing softly in the background. Jude enters through the open door, her arms extended and holding a gun, prompting Dil to rise from the bed and aim her gun at Jude. Dil fires, hitting Jude, who falls to the floor, writhing in pain. As Dil walks closer, Jude reaches for her gun, manages to grab it, but Dil shoots again, like a child playing with a toy, hitting Jude in her gun shoulder. Jude spins one way, her gun flying the other, causing Fergus to scream from the bed. As Jude raises her gun once more, Dil fires repeatedly, prompting Fergus to scream again as he rips free his other arm. Dil shoots Jude in the throat, killing her in a gruesome spray of blood. Dil then turns the gun on Fergus, squeezing the trigger, but she hesitates, her attention caught by a picture. She walks over to it and sits in front of it, placing the gun in her mouth. Fergus gently intervenes, removing the gun from her mouth and setting it on the table. He lifts her by the shoulders, guiding her out the door with care. Fergus returns to the room, passing Jude's lifeless body, and looks out the window to see Dil staggering down the street, weaving through the gathering crowd."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The movie begins with an outline of a woman, followed by Jude and Maguire observing a paper seller from their parked car. Fergus struggles with his bindings and then drives off, collapsing onto a bed as Maguire's car circles back. Maguire watches the brothel door open and sees an elderly judge emerge, heading to his car with security. Maguire grabs something from a woman's pocket, exits the car, and runs across the street with a gun. He shoots the judge, causing chaos as the judge's goon returns fire with an Uzi, hitting Maguire. Despite being wounded, Maguire continues shooting until Jude speeds away, leaving him dead.\n\nThe scene shifts to Dil, dressed in soldier's cricket clothes, approaching Fergus in bed with a gun. She cries, places the gun on his chest, and frees him from his bindings. As police cars pass by, Fergus comforts her. Jude enters with a gun, prompting Dil to shoot her. Jude falls, and as she reaches for her gun, Dil shoots again, hitting Jude in the shoulder. Fergus screams as Dil continues shooting, ultimately killing Jude. Dil then turns the gun on Fergus but stops, distracted by a picture. She places the gun in her mouth, but Fergus gently removes it, guiding her out the door. Fergus returns to the room, passing Jude's body, and watches Dil stagger down the street through the gathering crowd."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The movie begins with an outline of a woman, illuminated by the dim streetlights typical of downtown New York, followed by Jude and Maguire sitting in a car parked across the street as they look toward a paper seller hawking the evening edition. Meanwhile, Fergus, who is in a dimly lit warehouse known for holding captives, pulls furiously at his bindings and then drives off. Exhausted, Fergus collapses back on the bed while Maguire's car, a beat-up sedan often used in undercover operations, circles around once more. Fergus strains and roars from the bed as Maguire observes the brothel door, a notorious spot frequented by the city's elite, opening and sees the elderly judge, a figure embroiled in numerous scandals, coming out. The judge’s car, a sleek black limousine with tinted windows, occupied by his security men, accelerates toward him. Maguire grabs something from a woman's pocket, throws open the door, and runs across the street. As Fergus continues to pull at his bindings in a room filled with a lingering smell of dampness, the judge walks toward his car, assisted by his goon, a burly man widely feared in criminal circles, holding the door open. Maguire advances with a gun in hand, a standard issue Glock 19 often favored by law enforcement, prompting the goon to see him. Maguire shoots while running, causing the judge to fall. The goon, hit in the arm, draws an Uzi, a weapon known for its high rate of fire in close combat, and returns fire. Maguire is hit but continues shooting, while other goons, dressed in tailored suits that conceal their weapons, rush from the car, causing mayhem and screaming. Jude steps on her car's pedal and screeches away, leaving Maguire dead on the pavement. The scene shifts to Dil dressed in a soldier's cricket clothes, reminiscent of the uniforms worn by local youth teams, appearing like a sweet little boy, as she approaches Fergus in bed and points a gun at his head. She begins to cry, gently places the gun on his chest, and pulls on his bindings to free him. Two police cars, sirens wailing and lights flashing, pass by as Dil's face is close to Fergus's, with the stockings that bound his hands nearly undone. His arm is freed, and he strokes her hair as she shudders with weeping, accompanied by the soft strains of a melancholy song playing in the background. Jude enters through the open door, arms extended and holding a gun, prompting Dil to rise from the bed and aim her gun at Jude. Dil fires and hits Jude, who falls and writhes on the floor. As Dil walks closer, Jude reaches for her gun, grabs it, but Dil shoots again like a child playing with a toy, hitting Jude in her gun shoulder. Jude spins one way, her gun the other, leading Fergus to scream in horror. As Jude raises her gun, Dil shoots repeatedly, causing Fergus to scream again from the bed as he rips free his other arm. Dil shoots Jude in the throat, killing her amidst a cover of blood pooling on the cold, hard floor. Dil then turns the gun on Fergus, squeezing the trigger, but she stops and looks at a picture, a faded photograph of happier times, walks over, and sits in front of it. She places the gun in her mouth, but Fergus gently removes it and sets it on the table beside a worn copy of \"The Catcher in the Rye.\" He lifts her by the shoulders and guides her out the door. Fergus returns to the room, passing Jude's lifeless body, and looks out the window to see Dil staggering down the street through the gathering crowd, her path illuminated by flashing neon signs."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The movie begins with an outline of a woman followed by Jude and Maguire sitting in a car parked across the street as they look toward a paper seller. Meanwhile Fergus pulls furiously at his bindings and then drives off. Exhausted Fergus collapses back on the bed while Maguire's car circles around once more. Fergus strains and roars from the bed as Maguire observes the brothel door opening and sees the elderly judge coming out. The judge’s car occupied by his security men accelerates toward him. Maguire grabs something from a woman's pocket throws open the door and runs across the street. As Fergus continues to pull at his bindings the judge walks toward his car assisted by his goon holding the door open. Maguire advances with a gun in hand prompting the goon to see him. Maguire shoots while running causing the judge to fall. The goon hit in the arm draws an Uzi and returns fire. Maguire is hit but continues shooting while other goons rush from the car causing mayhem and screaming. Jude steps on her car's pedal and screeches away leaving Maguire dead. The scene shifts to Dil dressed in a soldier's cricket clothes appearing like a sweet little boy as she approaches Fergus in bed and points a gun at his head. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. She begins to cry gently places the gun on his chest and pulls on his bindings to free him. Two police cars sirens wailing pass by as Dil's face is close to Fergus's with the stockings that bound his hands nearly undone. His arm is freed and he strokes her hair as she shudders with weeping accompanied by the music of a song playing in the background. Jude enters through the open door arms extended and holding a gun prompting Dil to rise from the bed and aim her gun at Jude. Dil fires and hits Jude who falls and writhes on the floor. As Dil walks closer Jude reaches for her gun grabs it but Dil shoots again like a child playing with a toy hitting Jude in her gun shoulder. Jude spins one way her gun the other leading Fergus to scream. As Jude raises her gun Dil shoots repeatedly causing Fergus to scream again from the bed as he rips free his other arm. Dil shoots Jude in the throat killing her amidst a cover of blood. Dil then turns the gun on Fergus squeezing the trigger but she stops and looks at a picture walks over and sits in front of it. She places the gun in her mouth but Fergus gently removes it and sets it on the table. He lifts her by the shoulders and guides her out the door. Fergus returns to the room passing Jude's body and looks out the window to see Dil staggering down the street through the gathering crowd."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The movie begins with an outline of a woman followed by Jude and Maguire sitting in a car parked across the street as they look toward a paper seller. Meanwhile Fergus pulls furiously at his bindings and then drives off. Exhausted Fergus collapses back on the bed while Maguire's car circles around once more. Fergus strains and roars from the bed as Maguire observes the brothel door opening and sees the elderly judge coming out. The judge’s car occupied by his security men accelerates toward him. Maguire grabs something from a woman's pocket throws open the door and runs across the street. As Fergus continues to pull at his bindings the judge walks toward his car assisted by his goon holding the door open. Maguire advances with a gun in hand prompting the goon to see him. Maguire shoots while running causing the judge to fall. The goon hit in the arm draws an Uzi and returns fire. Maguire is hit but continues shooting while other goons rush from the car causing mayhem and screaming. Jude steps on her car's pedal and screeches away leaving Maguire dead. The scene shifts to Dil dressed in a soldier's cricket clothes appearing like a sweet little boy as she approaches Fergus in bed and points a gun at his head. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. She begins to cry gently places the gun on his chest and pulls on his bindings to free him. Two police cars sirens wailing pass by as Dil's face is close to Fergus's with the stockings that bound his hands nearly undone. His arm is freed and he strokes her hair as she shudders with weeping accompanied by the music of a song playing in the background. Jude enters through the open door arms extended and holding a gun prompting Dil to rise from the bed and aim her gun at Jude. Dil fires and hits Jude who falls and writhes on the floor. As Dil walks closer Jude reaches for her gun grabs it but Dil shoots again like a child playing with a toy hitting Jude in her gun shoulder. Jude spins one way her gun the other leading Fergus to scream. As Jude raises her gun Dil shoots repeatedly causing Fergus to scream again from the bed as he rips free his other arm. Dil shoots Jude in the throat killing her amidst a cover of blood. Dil then turns the gun on Fergus squeezing the trigger but she stops and looks at a picture walks over and sits in front of it. She places the gun in her mouth but Fergus gently removes it and sets it on the table. He lifts her by the shoulders and guides her out the door. Fergus returns to the room passing Jude's body and looks out the window to see Dil staggering down the street through the gathering crowd."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The movie begins with an outline of a woman followed by Jude and Maguire sitting in a car parked across the street as they look toward a paper seller. Meanwhile Fergus pulls furiously at his bindings and then drives off. Exhausted Fergus collapses back on the bed while Maguire's car circles around once more. Fergus strains and roars from the bed as Maguire observes the brothel door opening and sees the elderly judge coming out. The judge’s car occupied by his security men accelerates toward him. Maguire grabs something from a woman's pocket throws open the door and runs across the street. As Fergus continues to pull at his bindings the judge walks toward his car assisted by his goon holding the door open. As Jude raises her gun Dil shoots repeatedly causing Fergus to scream again from the bed as he rips free his other arm. Dil shoots Jude in the throat killing her amidst a cover of blood. Dil then turns the gun on Fergus squeezing the trigger but she stops and looks at a picture walks over and sits in front of it. She places the gun in her mouth but Fergus gently removes it and sets it on the table. He lifts her by the shoulders and guides her out the door. Fergus returns to the room passing Jude's body and looks out the window to see Dil staggering down the street through the gathering crowd."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The movie begins with an outline of a woman followed by Jude and Maguire sitting in a car parked across the street as they look toward a paper seller. Meanwhile Fergus pulls furiously at his bindings and then drives off. Exhausted Fergus collapses back on the bed while Maguire's car circles around once more. She places the gun in her mouth but Fergus gently removes it and sets it on the table. He lifts her by the shoulders and guides her out the door. Fergus returns to the room passing Jude's body and looks out the window to see Dil staggering down the street through the gathering crowd."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The story kicks off with a sketch of a cat, followed by Rita and Thompson lounging in a canoe moored by the riverbank as they gaze toward a fruit stand. Meanwhile, Marcus furiously tugs at his shoelaces and then sails away. Tired out, Marcus tumbles back onto the hammock while Thompson's canoe loops around again. Marcus hollers and yells from the hammock as Thompson watches the bakery door swing open and sees the elderly chef emerging. The chef’s tractor, filled with his gardeners, speeds toward him. Thompson snags something from a cat's collar, throws open the trapdoor, and skips across the riverbank. As Marcus keeps pulling at his shoelaces, the chef strolls toward his tractor, assisted by his apprentice holding the gate open. Thompson charges with a violin in hand, alerting the apprentice to his presence. Thompson plays while skipping, causing the chef to trip. The apprentice, struck on the hand, grabs a drum and retaliates. Thompson is tagged but keeps playing, while other apprentices dash from the tractor, triggering chaos and shouting. Rita presses her canoe's rudder and zooms off, leaving Thompson lifeless. The narrative shifts to Sam dressed in a ranger's tennis outfit, resembling a gentle little girl, as she nears Marcus in the hammock and aims a flute at his nose. She begins to laugh, softly places the flute on his lap, and tugs on his shoelaces to untie him. Two fire trucks, alarms blaring, roll by as Sam's cheek is near Marcus's, with the shoelaces that bound his feet nearly undone. His leg is freed, and he pats her shoulder as she quivers with laughter, accompanied by the melody of a song playing in the backdrop. Rita strides through the ajar gate, arms uplifted and wielding a flute, prompting Sam to rise from the hammock and direct her flute at Rita. Sam plays and tags Rita, who tumbles and squirms on the ground. As Sam strides closer, Rita clutches for her flute, snatches it, but Sam plays again like a child with a kazoo, tagging Rita in her flute elbow. Rita twirls one direction, her flute the other, causing Marcus to shout. As Rita raises her flute, Sam plays repetitively, inciting Marcus to shout again from the hammock as he yanks free his other leg. Sam plays at Rita's throat, silencing her amid a splash of confetti. Sam then turns the flute on Marcus, pressing the keys, but she halts and peers at a painting, strolls over, and sits before it. She places the flute in her lap, but Marcus gently takes it and places it on the shelf. He hoists her by the waist and leads her past the gate. Marcus returns to the hammock, walking by Rita's form, and gazes through the window to observe Sam stumbling down the path through the assembling throng."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The movie begins with Jude and Maguire parked in a car, observing a paper seller. Fergus, struggling against his bindings, collapses on a bed as Maguire circles back and sees an elderly judge exit a brothel. The judge is assisted by a goon when Maguire approaches with a gun, prompting a firefight that results in the judge's death and Maguire being killed. Jude flees as chaos erupts. The scene shifts to Dil, dressed in cricket clothes, confronting Fergus by holding a gun to his head. While crying, she frees Fergus's hands just as police cars pass by. Jude enters with a gun, leading Dil to shoot Jude multiple times, killing her. Dil turns the gun on Fergus but stops, moved by a picture. Fergus gently takes the gun from her and guides her out. He returns to the room, passing Jude's body, and watches Dil stagger down the street, disappearing into the crowd."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Fergus returns to the room passing Jude's body and looks out the window to see Dil staggering down the street through the gathering crowd He lifts her by the shoulders and guides her out the door  She places the gun in her mouth but Fergus gently removes it and sets it on the table  Dil then turns the gun on Fergus squeezing the trigger but she stops and looks at a picture walks over and sits in front of it  Dil shoots Jude in the throat killing her amidst a cover of blood  As Jude raises her gun Dil shoots repeatedly causing Fergus to scream again from the bed as he rips free his other arm  Jude spins one way her gun the other leading Fergus to scream  As Dil walks closer Jude reaches for her gun grabs it but Dil shoots again like a child playing with a toy hitting Jude in her gun shoulder  Dil fires and hits Jude who falls and writhes on the floor  Jude enters through the open door arms extended and holding a gun prompting Dil to rise from the bed and aim her gun at Jude  His arm is freed and he strokes her hair as she shudders with weeping accompanied by the music of a song playing in the background  Two police cars sirens wailing pass by as Dil's face is close to Fergus's with the stockings that bound his hands nearly undone  She begins to cry gently places the gun on his chest and pulls on his bindings to free him  The scene shifts to Dil dressed in a soldier's cricket clothes appearing like a sweet little boy as she approaches Fergus in bed and points a gun at his head  Jude steps on her car's pedal and screeches away leaving Maguire dead  Maguire is hit but continues shooting while other goons rush from the car causing mayhem and screaming  The goon hit in the arm draws an Uzi and returns fire  Maguire shoots while running causing the judge to fall  Maguire advances with a gun in hand prompting the goon to see him  As Fergus continues to pull at his bindings the judge walks toward his car assisted by his goon holding the door open  Maguire grabs something from a woman's pocket throws open the door and runs across the street  The judge’s car occupied by his security men accelerates toward him  Fergus strains and roars from the bed as Maguire observes the brothel door opening and sees the elderly judge coming out  Exhausted Fergus collapses back on the bed while Maguire's car circles around once more  Meanwhile Fergus pulls furiously at his bindings and then drives off  The movie begins with an outline of a woman followed by Jude and Maguire sitting in a car parked across the street as they look toward a paper seller "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Meanwhile Fergus pulls furiously at his bindings and then drives off The movie begins with an outline of a woman followed by Jude and Maguire sitting in a car parked across the street as they look toward a paper seller Fergus strains and roars from the bed as Maguire observes the brothel door opening and sees the elderly judge coming out Exhausted Fergus collapses back on the bed while Maguire's car circles around once more Maguire grabs something from a woman's pocket throws open the door and runs across the street The judge’s car occupied by his security men accelerates toward him Maguire advances with a gun in hand prompting the goon to see him As Fergus continues to pull at his bindings the judge walks toward his car assisted by his goon holding the door open The goon hit in the arm draws an Uzi and returns fire Maguire shoots while running causing the judge to fall Jude steps on her car's pedal and screeches away leaving Maguire dead Maguire is hit but continues shooting while other goons rush from the car causing mayhem and screaming She begins to cry gently places the gun on his chest and pulls on his bindings to free him The scene shifts to Dil dressed in a soldier's cricket clothes appearing like a sweet little boy as she approaches Fergus in bed and points a gun at his head His arm is freed and he strokes her hair as she shudders with weeping accompanied by the music of a song playing in the background Two police cars sirens wailing pass by as Dil's face is close to Fergus's with the stockings that bound his hands nearly undone Dil fires and hits Jude who falls and writhes on the floor Jude enters through the open door arms extended and holding a gun prompting Dil to rise from the bed and aim her gun at Jude Jude spins one way her gun the other leading Fergus to scream As Dil walks closer Jude reaches for her gun grabs it but Dil shoots again like a child playing with a toy hitting Jude in her gun shoulder Dil shoots Jude in the throat killing her amidst a cover of blood As Jude raises her gun Dil shoots repeatedly causing Fergus to scream again from the bed as he rips free his other arm She places the gun in her mouth but Fergus gently removes it and sets it on the table Dil then turns the gun on Fergus squeezing the trigger but she stops and looks at a picture walks over and sits in front of it Fergus returns to the room passing Jude's body and looks out the window to see Dil staggering down the street through the gathering crowd He lifts her by the shoulders and guides her out the door"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She begins to cry gently places the gun on his chest and pulls on his bindings to free him  Two police cars sirens wailing pass by as Dil's face is close to Fergus's with the stockings that bound his hands nearly undone  His arm is freed and he strokes her hair as she shudders with weeping accompanied by the music of a song playing in the background  Jude enters through the open door arms extended and holding a gun prompting Dil to rise from the bed and aim her gun at Jude  Dil fires and hits Jude who falls and writhes on the floor  As Dil walks closer Jude reaches for her gun grabs it but Dil shoots again like a child playing with a toy hitting Jude in her gun shoulder  Jude spins one way her gun the other leading Fergus to scream  As Jude raises her gun Dil shoots repeatedly causing Fergus to scream again from the bed as he rips free his other arm  Dil shoots Jude in the throat killing her amidst a cover of blood  Dil then turns the gun on Fergus squeezing the trigger but she stops and looks at a picture walks over and sits in front of it  She places the gun in her mouth but Fergus gently removes it and sets it on the table  He lifts her by the shoulders and guides her out the door  Fergus returns to the room passing Jude's body and looks out the window to see Dil staggering down the street through the gathering crowd The movie begins with an outline of a woman followed by Jude and Maguire sitting in a car parked across the street as they look toward a paper seller  Meanwhile Fergus pulls furiously at his bindings and then drives off  Exhausted Fergus collapses back on the bed while Maguire's car circles around once more  Fergus strains and roars from the bed as Maguire observes the brothel door opening and sees the elderly judge coming out  The judge’s car occupied by his security men accelerates toward him  Maguire grabs something from a woman's pocket throws open the door and runs across the street  As Fergus continues to pull at his bindings the judge walks toward his car assisted by his goon holding the door open  Maguire advances with a gun in hand prompting the goon to see him  Maguire shoots while running causing the judge to fall  The goon hit in the arm draws an Uzi and returns fire  Maguire is hit but continues shooting while other goons rush from the car causing mayhem and screaming  Jude steps on her car's pedal and screeches away leaving Maguire dead  The scene shifts to Dil dressed in a soldier's cricket clothes appearing like a sweet little boy as she approaches Fergus in bed and points a gun at his head "
        }
      ]
    }
  ]
}