{
  "ground_truth": "She is screaming and the room is alive, each man awake, grabbing guns, and screaming. She takes in huge gobs of air and rubs her hand on his chest, sidling closer to him and coming on to him. Fergus walks over to him, lifts the hood up so his mouth is revealed, and pushes the sandwich toward his lips, allowing Jody to eat slowly. Fergus then pushes the last crumbs of the sandwich toward Jody's mouth, and Jody eats the last bits. Jude makes her way from the door toward the greenhouse, carrying a pot of tea and two cups. It is sweltering now in the greenhouse, and the hood is drenched with sweat. Jude comes into view, lays the tea on the ground, and his breathing becomes labored. Fergus gives her the gun, and Jody's head follows Fergus while he leaves. Jude smiles, holding the gun on her lap as Fergus enters. Maguire has a newspaper, which has a headline regarding the kidnapping. Jude drinks tea while looking at Jody sweating. Fergus re-enters and she goes. Fergus walks to Jody and slowly takes the hood off, and Jody looks up at him with his face bathed in sweat, breathing in mighty gulps of air. He smiles, and Fergus smiles back. Fergus pours out a cup of tea and brings it to his lips, drinks, and looks at him. Jody isn't smiling anymore, so Fergus goes back to his seat, drinks his tea, and fingers the gun on his lap. He looks at Fergus, and Fergus holds the gun to his face, fishing inside Jody's inside pocket. Fergus's hand emerges with a wallet containing credit cards and an army identification photograph. Fergus takes out a picture of Jody in cricket whites, smiling, and holding a bat, smiling again himself. Fergus then takes out another picture of Jody and a beautiful black woman smiling, and Jody chuckles. Fergus looks at him, keeping his gaze, and Jody smiles. Fergus leads Jody outside, holding the gun against him, and Jody walks toward it, breathing heavily while Fergus stands motionless in the dark, looking at him. Fergus turns him around, unzips his fly, and Jody takes two steps toward the wall. Fergus holds his hands from behind so Jody can lean forward, and Jody now pisses with immense relief, shakes his body, and steps back. Fergus leads him back toward the greenhouse and back to his chair, and Jody begins to laugh. Fergus also begins to laugh without knowing why, waking Maguire, who is walking out of the house at the sound of laughter. Jody continues to laugh until the hood is suddenly slammed back over his head. Maguire stands there in the dark, looking at Fergus, who gets up slowly and walks toward the door, while Maguire sits with an Armalite in his hands, watching him, as the sun comes up over the low hills around the farmhouse.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Certainly! Here is the text transformed with exact synonyms for non-stop-words:\n\nShe is shrieking and the chamber is animated, each man conscious, clutching firearms, and shrieking. She takes in huge gulps of air and rubs her palm on his torso, edging nearer to him and advancing on to him. Fergus strides over to him, hoists the cowl up so his mouth is uncovered, and shoves the sandwich toward his lips, permitting Jody to consume slowly. Fergus then shoves the last morsels of the sandwich toward Jody's mouth, and Jody consumes the last fragments. Jude makes her way from the entrance toward the conservatory, carrying a pot of tea and two cups. It is sweltering now in the conservatory, and the cowl is soaked with perspiration. Jude comes into view, lays the tea on the ground, and his respiration becomes labored. Fergus gives her the firearm, and Jody's head follows Fergus while he exits. Jude smiles, holding the firearm on her lap as Fergus enters. Maguire has a newspaper, which has a headline regarding the abduction. Jude drinks tea while gazing at Jody perspiring. Fergus re-enters and she departs. Fergus walks to Jody and slowly takes the cowl off, and Jody looks up at him with his visage bathed in perspiration, breathing in mighty draughts of air. He smiles, and Fergus smiles back. Fergus pours out a cup of tea and brings it to his lips, drinks, and gazes at him. Jody isn't smiling anymore, so Fergus goes back to his seat, drinks his tea, and fingers the firearm on his lap. He gazes at Fergus, and Fergus holds the firearm to his visage, fishing inside Jody's inner pocket. Fergus's hand emerges with a wallet containing credit cards and an army identification photograph. Fergus extracts a picture of Jody in cricket whites, smiling, and holding a bat, smiling again himself. Fergus then extracts another picture of Jody and a beautiful black woman smiling, and Jody chuckles. Fergus gazes at him, maintaining his stare, and Jody smiles. Fergus leads Jody outside, holding the firearm against him, and Jody walks toward it, breathing heavily while Fergus stands immobile in the dark, gazing at him. Fergus turns him around, unzips his fly, and Jody takes two steps toward the wall. Fergus holds his hands from behind so Jody can lean forward, and Jody now urinates with immense relief, shakes his body, and steps back. Fergus leads him back toward the conservatory and back to his chair, and Jody begins to laugh. Fergus also begins to laugh without knowing why, waking Maguire, who is walking out of the house at the noise of laughter. Jody continues to laugh until the cowl is suddenly slammed back over his head. Maguire stands there in the dark, gazing at Fergus, who rises slowly and strides toward the entrance, while Maguire sits with an Armalite in his hands, observing him, as the sun rises over the low hills around the farmhouse."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The room is alive and she is heard screaming, with each man awakened, guns being grabbed, and screams echoing. Huge gobs of air are taken in by her, and her hand is rubbed on his chest, as she sidles closer and comes on to him. Fergus walks over to him, the hood is lifted up by him so that the mouth is revealed, and the sandwich is pushed toward his lips, allowing Jody to eat slowly. The last crumbs of the sandwich are then pushed by Fergus toward Jody's mouth, and the last bits are eaten by Jody. Jude makes her way from the door toward the greenhouse, and she carries a pot of tea and two cups. It has now become sweltering in the greenhouse, and sweat drenches the hood. The tea is laid on the ground by Jude as she comes into view, and labored breaths are taken by him. The gun is given to her by Fergus, and Jody's head follows Fergus while he leaves. Jude smiles as she holds the gun on her lap when Fergus enters. A newspaper, which bears a headline regarding the kidnapping, is held by Maguire. Tea is drunk by Jude while she looks at Jody sweating. Fergus re-enters, and she goes. Jody is approached by Fergus, who slowly takes the hood off, and Jody looks up at him with a face bathed in sweat, breathing in mighty gulps of air. Smiles are exchanged between him and Fergus. A cup of tea is poured out by Fergus, brought to his lips, drunk, and he is looked at. As Jody isn't smiling anymore, Fergus goes back to his seat, drinks his tea, and fingers the gun on his lap. Fergus is looked at by Jody, and the gun is held to his face by Fergus, who fishes inside Jody's inside pocket. A wallet containing credit cards and an army identification photograph emerges in Fergus's hand. A picture of Jody in cricket whites, smiling and holding a bat, is taken out by Fergus, who smiles again. Another picture of Jody with a beautiful black woman smiling is taken out by Fergus, and Jody chuckles. A gaze is kept on Jody by Fergus, who looks at him, and Jody smiles. Jody is led outside by Fergus, and the gun is held against him, as Jody walks toward it, breathing heavily while the dark remains still and Fergus looks at him. Jody is turned around by Fergus, who unzips his fly, and two steps are taken by Jody toward the wall. Jody is held by his hands from behind by Fergus so that he can lean forward, and immense relief is felt by Jody as he pisses, shakes his body, and steps back. Jody is led back toward the greenhouse and to his chair by Fergus, and laughter begins with Jody. Laughter also begins with Fergus without knowing why, which wakes Maguire, who walks out of the house upon hearing it. Laughter is continued by Jody until the hood is suddenly slammed back over his head. Maguire stands there in the dark looking at Fergus, who slowly gets up and walks toward the door, while Fergus is watched by Maguire with an Armalite in his hands, as the sun comes up over the low hills around the farmhouse."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The room erupts as she screams; every man awake, grabbing guns. She gasps for air, rubs his chest, and moves closer to him. Fergus lifts the hood, revealing Jody's mouth, allowing him to eat a sandwich slowly. Jude heads to the greenhouse with tea and cups. The stifling heat drenches the hood with sweat. Jude appears, sets down the tea, and his breathing becomes labored. Fergus gives her the gun as he exits. Maguire reads a newspaper about the kidnapping. Jude sips tea, watching Jody sweat. Fergus returns, removes Jody's hood, and they exchange smiles. Fergus serves tea, then checks Jody's wallet, finding credit cards and photos. Fergus finds a picture of Jody in cricket whites and another with a woman, and Jody chuckles. Fergus leads Jody outside with the gun. Jody breathes heavily, and Fergus lets him relieve himself. They laugh, waking Maguire. The laughter stops abruptly when the hood is replaced, and Maguire observes in the dark as Fergus walks away, with the sunrise over the hills."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "She screams, waking the room alive with men grabbing guns. She breathes deeply, rubbing his chest and approaching him. Fergus lifts the hood, revealing Jody's mouth for a sandwich. Jude carries tea to the sweltering greenhouse, setting it down as Fergus hands her the gun and leaves, observed by Jody. Maguire holds a newspaper on the kidnapping, while Jude drinks tea, watching Jody sweat. Fergus removes Jody's hood, exchanging smiles, then drinks tea while fingering a gun. Fergus finds Jody's wallet with pictures inside, sharing smiles over them. Fergus leads Jody outside to relieve himself, then back, where they laugh, waking Maguire. Laughter halts as Jody's hood is replaced. Maguire observes Fergus leaving, Armalite ready, as sunrise brightens the hills."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In the midst of the tumultuous scene, she is screaming with all her might, and the entire room seems to come alive with the sudden commotion. Each man, startled fully awake, hastily grabs for their guns, joining in the cacophony of shouting. She gulps down enormous breaths of air, rubbing her hand deliberately against his chest, moving closer to him in a suggestive manner, trying to connect with him. Fergus approaches, calmly lifting the hood just enough to expose his mouth, and carefully pushes the sandwich toward his lips, giving Jody the chance to eat slowly and deliberately. Fergus then gently nudges the final crumbs of the sandwich toward Jody’s mouth, allowing him to consume the last bits with satisfaction. Meanwhile, Jude makes her way from the door toward the greenhouse, balancing a pot of tea and two cups in her hands. Inside the greenhouse, the heat is intense, the atmosphere sweltering, and the hood is thoroughly soaked with sweat. Jude comes into view, sets the tea on the ground with care, and observes his breathing becoming labored under the oppressive heat. Fergus hands her the gun, and Jody’s gaze follows Fergus as he exits the scene. Jude smiles, cradling the gun on her lap as Fergus reenters. Maguire, meanwhile, is occupied with a newspaper, its front page emblazoned with headlines about the recent kidnapping. Jude sips her tea, her eyes fixed on Jody, who is visibly sweating. Upon Fergus's return, she leaves the scene. With deliberate care, Fergus walks over to Jody and slowly removes the hood, revealing Jody’s face drenched in sweat as he breathes in powerful gulps of air. Jody manages a smile, and Fergus returns the gesture with a smile of his own. Fergus pours tea into a cup, raises it to his lips, takes a drink, and looks across at Jody. Jody’s smile fades, prompting Fergus to return to his seat, sipping his tea thoughtfully, his fingers tracing the outline of the gun resting on his lap. He locks eyes with Fergus, who then holds the gun closer to his face, reaching into Jody’s inside pocket with a deliberate motion. Fergus retrieves a wallet containing credit cards and an army identification photograph. Methodically, Fergus extracts a picture of Jody dressed in crisp cricket whites, smiling broadly and holding a bat, which elicits another smile from Fergus. Fergus then finds another picture of Jody alongside a beautiful black woman, both smiling, and Jody chuckles quietly. Fergus maintains his gaze upon Jody, who responds with a smile. Fergus escorts Jody outside, the gun held firmly against him, and Jody moves slowly toward the destination, his breathing heavy and labored, while Fergus remains motionless in the shadows, observing him intently. Fergus turns Jody around, unzips his fly, and Jody takes two small steps toward the wall. Fergus holds Jody’s hands securely from behind, allowing Jody to lean forward, and Jody releases himself, pissing with palpable relief. He shakes his body slightly, then steps back. Fergus guides him back toward the greenhouse and leads him to his chair, where Jody bursts into laughter. Fergus, somewhat inexplicably, joins in the laughter, shaking with laughter himself, and this awakens Maguire, who emerges from the house, drawn out by the unexpected sound of laughter. Jody’s laughter persists until the hood is abruptly yanked down over his head again. Maguire stands there, shrouded in darkness, staring intently at Fergus, who rises slowly and makes his way toward the door. As Maguire sits with an Armalite clenched in his hands, he watches Fergus intently, as the bright sun begins to rise over the low hills surrounding the farmhouse."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Amidst the chaotic and tumultuous scene unfolding around her, she lets out a scream with all the force she can muster, causing the entire room to come alive with a flurry of sudden commotion and activity. Each and every man, rudely startled wide awake, scrambles to grab their guns, eagerly joining in the cacophony of shouting voices that fills the air. She gulps down enormous, deep breaths of air, deliberately rubbing her hand against his chest, inching closer to him in a suggestive manner, as if trying to forge a deeper connection with him. Fergus approaches with a calm demeanor, gently lifting the hood just enough to reveal his mouth, and carefully pushes the sandwich toward his lips, allowing Jody the opportunity to eat slowly and deliberately. Fergus then lightly nudges the final crumbs of the sandwich toward Jody’s mouth, permitting him to consume the last bits with a sense of satisfaction. Meanwhile, Jude makes her way from the door toward the greenhouse, expertly balancing a pot of tea and two delicate cups in her hands. Inside the greenhouse, the heat is intense, the atmosphere overwhelmingly sweltering, and the hood is thoroughly soaked with perspiration. Jude comes into view, sets the tea on the ground with the utmost care, and observes his breathing becoming increasingly labored under the oppressive heat. Fergus hands her the gun, and Jody’s gaze follows Fergus as he exits the scene. Jude smiles to herself, cradling the gun gently on her lap as Fergus reenters the area. Maguire, on the other hand, occupies himself with a newspaper, its front page boldly emblazoned with headlines about the recent, sensational kidnapping. Jude takes a sip of her tea, her eyes remaining fixed on Jody, who is visibly sweating profusely. Upon Fergus's return, she quietly leaves the scene. With deliberate and careful movements, Fergus walks over to Jody and slowly removes the hood, unveiling Jody’s face, which is drenched in sweat as he breathes in powerful, deep gulps of air. Jody manages to muster a smile, and Fergus returns the gesture with a warm smile of his own. Fergus pours tea into a cup, raises it slowly to his lips, takes a deliberate drink, and looks across at Jody. Jody’s smile begins to fade, prompting Fergus to return to his seat, sipping his tea thoughtfully, his fingers tracing the outline of the gun resting on his lap. He locks eyes with Fergus, who then holds the gun just a bit closer to his face, reaching into Jody’s inside pocket with a careful motion. Fergus retrieves a wallet containing credit cards and an army identification photograph. Methodically, Fergus extracts a picture of Jody dressed impeccably in crisp cricket whites, smiling broadly and holding a bat, which elicits yet another smile from Fergus. Fergus then finds another picture of Jody alongside a stunning, beautiful black woman, both smiling warmly, and Jody chuckles quietly to himself. Fergus maintains his gaze upon Jody, who responds with a gentle smile. Fergus escorts Jody outside, the gun held firmly and securely against him, and Jody moves slowly toward the destination, his breathing heavy and laborious, while Fergus remains motionless in the shadows, observing him with intense focus. Fergus turns Jody around, unzips his fly, and Jody takes two small, careful steps toward the wall. Fergus holds Jody’s hands securely from behind, allowing Jody to lean forward, and Jody releases himself, pissing with palpable relief. He shakes his body slightly, then steps back. Fergus guides him back toward the greenhouse and leads him carefully to his chair, where Jody bursts into laughter. Fergus, somewhat inexplicably, joins him in the laughter, shaking with laughter himself, and this unexpected sound awakens Maguire, who emerges from the house, drawn out by the surprising sound of laughter. Jody’s laughter persists until suddenly, the hood is abruptly yanked down over his head once again. Maguire stands there, shrouded in the darkness of the early morning, staring intently at Fergus, who rises slowly to his feet and makes his way purposefully toward the door. As Maguire sits with an Armalite tightly clenched in his hands, he watches Fergus intently, as the bright and radiant sun begins to rise gloriously over the low hills surrounding the farmhouse."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The air is pierced by her screams, causing the atmosphere in the room to electrify and each man to jolt awake. They scramble for their guns, echoing her screams with their own shouts. In between her frantic breaths, she draws in deep gobs of air and gently places her hand on his chest, inching closer to him with intentions clear in her body language. Meanwhile, Fergus approaches with a sense of purpose, carefully lifting the hood to reveal Jody's mouth, ensuring it is unobstructed, and then deliberately pushing the sandwich toward Jody's lips. Jody begins to eat slowly, savoring each bite. Fergus methodically nudges the last crumbs of the sandwich toward Jody's mouth, ensuring none are wasted, and Jody consumes what remains. Jude, intent on her task, steadily makes her way from the door to the greenhouse, balancing a pot of tea and two cups in her hands. The greenhouse's heat is oppressive, causing the hood to become soaked with sweat, as Jude enters the space, laying the tea on the ground with care. Jody's breathing becomes labored under the intense heat. Fergus hands the gun to her, and Jody's eyes track Fergus's movements as he leaves. Jude’s smile blossoms as she holds the gun on her lap, maintaining a casual posture as Fergus returns. Nearby, Maguire engrosses himself in a newspaper, its headline announcing details of the kidnapping. Jude sips her tea thoughtfully, her gaze fixed on Jody as beads of sweat continue to form on his brow. When Fergus returns, Jude makes her exit. Fergus approaches Jody, meticulously removing the hood, revealing Jody’s face which is dripping with sweat as he gulps air greedily into his lungs. Recognizing the shared moment, Fergus smiles at Jody, who reciprocates the gesture. Fergus then pours a cup of tea with deliberate precision, brings it to his lips, sips thoughtfully, and regards Jody. Noting that Jody's smile has faded, Fergus quietly retreats to his seat, resuming his tea and absentmindedly fondling the gun resting on his lap. Jody's eyes fixate on Fergus, who then dramatically lifts the gun to Jody’s face and begins to search his inside pocket. Fergus's hand reemerges holding a wallet adorned with credit cards and Jody's army identification photograph. From the wallet, Fergus retrieves a picture of Jody clad in cricket whites, proudly holding a bat, and he breaks into a broader smile. Peering deeper, Fergus extracts another photograph capturing Jody alongside a strikingly beautiful black woman, both smiling. The sight prompts Jody to emit a soft chuckle, which does not go unnoticed by Fergus, who maintains eye contact, drawing a smile from Jody. Fergus, with an air of quiet authority, guides Jody outside, ensuring the gun remains pressed against him. Jody walks ahead, his breaths heavy and audible, while Fergus stands vigilantly in the shadows, observing. Without a word, Fergus turns Jody around and carefully unzips his fly, allowing Jody to take a couple of steps forward toward the wall. Fergus, securely holding Jody's hands from behind, ensures Jody can lean forward comfortably. With a palpable sense of relief, Jody begins to urinate, his body relaxing as he shakes off the tension and steps back when he’s finished. Fergus then escorts him back toward the greenhouse and guides him to his chair, where Jody suddenly bursts into laughter. Contagiously, Fergus finds himself laughing, though the reason escapes him. The sound of their laughter drifts through the air, waking Maguire, who starts walking out of the house, drawn by the noise. Jody's laughter continues unabated until abruptly, the hood is thrust back over his head. Maguire stands in the dim light, observing Fergus from the shadows. Fergus, moving slowly, rises and ambles toward the door, while Maguire settles into his seat, an Armalite in hand, vigilantly watching as the first light of dawn spills over the low hills surrounding the farmhouse."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The room erupts in chaos as she screams, waking everyone and causing them to grab their guns. Amidst this, she approaches Fergus, rubbing his chest and attempting to seduce him. Fergus helps Jody eat by lifting his hood and offering him a sandwich, which Jody consumes slowly. Meanwhile, Jude enters the greenhouse with tea, while the intense heat causes Jody to sweat profusely. She sets the tea down, takes the gun from Fergus, and smiles as she watches Jody. Fergus returns, exchanges smiles with Jody, and pours himself tea, noticing Jody's changed demeanor. He retrieves Jody's wallet from his pocket, examines photos that prompt smiles and chuckles from Jody, and then leads him outside. Holding a gun against Jody, Fergus watches him step forward to relieve himself against a wall, and they both share a laugh upon returning to the greenhouse. This laughter wakes Maguire, who exits the house armed, as the hood is abruptly placed back on Jody's head. Fergus slowly leaves the room as Maguire takes his place, watching the dawn break over the hills."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She is screaming, and the room is alive, each man awake, grabbing guns, and screaming. She takes in huge gobs of air and rubs her hand on his chest, sidling closer to him and coming on to him. Fergus, a member of the Irish Republican Army involved in Jody's kidnapping, walks over to him, lifts the hood up so his mouth is revealed, and pushes the sandwich toward his lips, allowing Jody, a captured British soldier, to eat slowly. Fergus then pushes the last crumbs of the sandwich toward Jody's mouth, and Jody eats the last bits. Jude makes her way from the door toward the greenhouse, which serves as an improvised holding area, carrying a pot of tea brewed with Earl Grey leaves and two cups. It is sweltering now in the greenhouse, and the hood is drenched with sweat. Jude comes into view, lays the tea on the ground, and his breathing becomes labored due to the oppressive heat. Fergus gives her the gun, a standard sidearm used by the IRA, and Jody's head follows Fergus while he leaves. Jude smiles, holding the gun on her lap as Fergus enters. Maguire, another IRA member, has a newspaper with a headline regarding the kidnapping that has drawn significant media attention. Jude drinks tea while looking at Jody sweating. Fergus re-enters, and she goes. Fergus walks to Jody and slowly takes the hood off, and Jody looks up at him with his face bathed in sweat, breathing in mighty gulps of air. He smiles, and Fergus smiles back. Fergus pours out a cup of tea and brings it to his lips, drinks, and looks at him. Jody isn't smiling anymore, so Fergus goes back to his seat, drinks his tea, and fingers the gun on his lap, a tense reminder of their precarious situation. He looks at Fergus, and Fergus holds the gun to his face, fishing inside Jody's inside pocket. Fergus's hand emerges with a wallet containing credit cards and an army identification photograph, revealing Jody's rank and unit. Fergus takes out a picture of Jody in cricket whites, an English tradition, smiling and holding a bat, smiling again himself. Fergus then takes out another picture of Jody and a beautiful black woman smiling, and Jody chuckles, recalling a cherished memory. Fergus looks at him, keeping his gaze, and Jody smiles. Fergus leads Jody outside, holding the gun against him, and Jody walks toward it, breathing heavily while Fergus stands motionless in the dark, looking at him. Fergus turns him around, unzips his fly, and Jody takes two steps toward the wall. Fergus holds his hands from behind so Jody can lean forward, and Jody now pisses with immense relief, shakes his body, and steps back. Fergus leads him back toward the greenhouse and back to his chair, and Jody begins to laugh, perhaps at the absurdity of their situation. Fergus also begins to laugh without knowing why, waking Maguire, who is walking out of the house at the sound of laughter. Jody continues to laugh until the hood is suddenly slammed back over his head. Maguire stands there in the dark, observing Fergus with suspicion, who gets up slowly and walks toward the door, while Maguire sits with an Armalite in his hands, a notorious weapon in the conflict, watching him, as the sun comes up over the low hills around the remote farmhouse."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "She is screaming and the room is alive each man awake grabbing guns and screaming. She takes in huge gobs of air and rubs her hand on his chest sidling closer to him and coming on to him. Fergus walks over to him lifts the hood up so his mouth is revealed and pushes the sandwich toward his lips allowing Jody to eat slowly. Fergus then pushes the last crumbs of the sandwich toward Jody's mouth and Jody eats the last bits. Jude makes her way from the door toward the greenhouse carrying a pot of tea and two cups. It is sweltering now in the greenhouse and the hood is drenched with sweat. Jude comes into view lays the tea on the ground and his breathing becomes labored. Fergus gives her the gun and Jody's head follows Fergus while he leaves. Jude smiles holding the gun on her lap as Fergus enters. Maguire has a newspaper which has a headline regarding the kidnapping. Jude drinks tea while looking at Jody sweating. Fergus reenters and she goes. Fergus walks to Jody and slowly takes the hood off and Jody looks up at him with his face bathed in sweat breathing in mighty gulps of air. He smiles and Fergus smiles back. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Fergus pours out a cup of tea and brings it to his lips drinks and looks at him. Jody is not smiling anymore so Fergus goes back to his seat drinks his tea and fingers the gun on his lap. He looks at Fergus and Fergus holds the gun to his face fishing inside Jody's inside pocket. Fergus's hand emerges with a wallet containing credit cards and an army identification photograph. Fergus takes out a picture of Jody in cricket whites smiling and holding a bat smiling again himself. Fergus then takes out another picture of Jody and a beautiful black woman smiling and Jody chuckles. Fergus looks at him keeping his gaze and Jody smiles. Fergus leads Jody outside holding the gun against him and Jody walks toward it breathing heavily while Fergus stands motionless in the dark looking at him. Fergus turns him around unzips his fly and Jody takes two steps toward the wall. Fergus holds his hands from behind so Jody can lean forward and Jody now pisses with immense relief shakes his body and steps back. Fergus leads him back toward the greenhouse and back to his chair and Jody begins to laugh. Fergus also begins to laugh without knowing why waking Maguire who is walking out of the house at the sound of laughter. Jody continues to laugh until the hood is suddenly slammed back over his head. Maguire stands there in the dark looking at Fergus who gets up slowly and walks toward the door while Maguire sits with an Armalite in his hands watching him as the sun comes up over the low hills around the farmhouse."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "She is screaming and the room is alive each man awake grabbing guns and screaming. She takes in huge gobs of air and rubs her hand on his chest sidling closer to him and coming on to him. Fergus walks over to him lifts the hood up so his mouth is revealed and pushes the sandwich toward his lips allowing Jody to eat slowly. Fergus then pushes the last crumbs of the sandwich toward Jody's mouth and Jody eats the last bits. Jude makes her way from the door toward the greenhouse carrying a pot of tea and two cups. It is sweltering now in the greenhouse and the hood is drenched with sweat. Jude comes into view lays the tea on the ground and his breathing becomes labored. Fergus gives her the gun and Jody's head follows Fergus while he leaves. Jude smiles holding the gun on her lap as Fergus enters. Maguire has a newspaper which has a headline regarding the kidnapping. Jude drinks tea while looking at Jody sweating. Fergus reenters and she goes. Fergus walks to Jody and slowly takes the hood off and Jody looks up at him with his face bathed in sweat breathing in mighty gulps of air. He smiles and Fergus smiles back. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. Fergus pours out a cup of tea and brings it to his lips drinks and looks at him. Jody is not smiling anymore so Fergus goes back to his seat drinks his tea and fingers the gun on his lap. He looks at Fergus and Fergus holds the gun to his face fishing inside Jody's inside pocket. Fergus's hand emerges with a wallet containing credit cards and an army identification photograph. Fergus takes out a picture of Jody in cricket whites smiling and holding a bat smiling again himself. Fergus then takes out another picture of Jody and a beautiful black woman smiling and Jody chuckles. Fergus looks at him keeping his gaze and Jody smiles. Fergus leads Jody outside holding the gun against him and Jody walks toward it breathing heavily while Fergus stands motionless in the dark looking at him. Fergus turns him around unzips his fly and Jody takes two steps toward the wall. Fergus holds his hands from behind so Jody can lean forward and Jody now pisses with immense relief shakes his body and steps back. Fergus leads him back toward the greenhouse and back to his chair and Jody begins to laugh. Fergus also begins to laugh without knowing why waking Maguire who is walking out of the house at the sound of laughter. Jody continues to laugh until the hood is suddenly slammed back over his head. Maguire stands there in the dark looking at Fergus who gets up slowly and walks toward the door while Maguire sits with an Armalite in his hands watching him as the sun comes up over the low hills around the farmhouse."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "She is screaming and the room is alive each man awake grabbing guns and screaming. She takes in huge gobs of air and rubs her hand on his chest sidling closer to him and coming on to him. Fergus walks over to him lifts the hood up so his mouth is revealed and pushes the sandwich toward his lips allowing Jody to eat slowly. Fergus then pushes the last crumbs of the sandwich toward Jody's mouth and Jody eats the last bits. Jude makes her way from the door toward the greenhouse carrying a pot of tea and two cups. It is sweltering now in the greenhouse and the hood is drenched with sweat. Jude comes into view lays the tea on the ground and his breathing becomes labored. Fergus leads Jody outside holding the gun against him and Jody walks toward it breathing heavily while Fergus stands motionless in the dark looking at him. Fergus turns him around unzips his fly and Jody takes two steps toward the wall. Fergus holds his hands from behind so Jody can lean forward and Jody now pisses with immense relief shakes his body and steps back. Fergus leads him back toward the greenhouse and back to his chair and Jody begins to laugh. Fergus also begins to laugh without knowing why waking Maguire who is walking out of the house at the sound of laughter. Jody continues to laugh until the hood is suddenly slammed back over his head. Maguire stands there in the dark looking at Fergus who gets up slowly and walks toward the door while Maguire sits with an Armalite in his hands watching him as the sun comes up over the low hills around the farmhouse."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "She is screaming and the room is alive each man awake grabbing guns and screaming. She takes in huge gobs of air and rubs her hand on his chest sidling closer to him and coming on to him. Fergus walks over to him lifts the hood up so his mouth is revealed and pushes the sandwich toward his lips allowing Jody to eat slowly. Fergus also begins to laugh without knowing why waking Maguire who is walking out of the house at the sound of laughter. Jody continues to laugh until the hood is suddenly slammed back over his head. Maguire stands there in the dark looking at Fergus who gets up slowly and walks toward the door while Maguire sits with an Armalite in his hands watching him as the sun comes up over the low hills around the farmhouse."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The cat is yodeling and the forest is buzzing, each tree snoring, grasping shovels, and yodeling. The cat absorbs colossal clouds of dust and flaps her ear on his knee, dancing nearer to him and nodding at him. Oliver crawls over to him, drags the hat down so his ears are visible, and tosses the apple toward his nose, permitting Sam to munch leisurely. Oliver then throws the final seeds of the apple toward Sam's nose, and Sam munches the leftover pieces. Ramona journeys from the window toward the pool, balancing a jar of soup and two plates. It is frigid now in the pool, and the hat is covered with dew. Ramona arrives, drops the soup on the bench, and his coughing becomes intense. Oliver gives her the shovel, and Sam's foot follows Oliver while he vanishes. Ramona grins, placing the shovel on her shoes as Oliver enters. Cassidy has a magazine, which has a headline regarding the parade. Ramona slurps soup while watching Sam shivering. Oliver re-enters and she departs. Oliver crawls to Sam and carefully slides the hat off, and Sam peers up at him with his cheeks drenched in dew, inhaling timid wafts of wind. He grins, and Oliver grins back. Oliver pours out a bowl of soup and carries it to his nose, sips, and glances at him. Sam isn't grinning anymore, so Oliver returns to his hammock, sips his soup, and taps the shovel on his shoes. He gazes at Oliver, and Oliver aims the shovel to his ears, digging inside Sam's outer jacket. Oliver's ear emerges with a notebook containing library cards and a fishing certificate photograph. Oliver extracts a sketch of Sam in tennis shorts, chuckling, and holding a racket, chuckling again himself. Oliver then pulls out another sketch of Sam and a stunning red deer chuckling, and Sam giggles. Oliver peers at him, maintaining his focus, and Sam grins. Oliver guides Sam inside, aiming the shovel against him, and Sam skips toward it, exhaling significantly while Oliver stands motionless in the sunshine, observing him. Oliver spins him around, unties his boot, and Sam leaps two meters toward the meadow. Oliver grips his shoes from below so Sam can lean backward, and Sam now dances with extravagant satisfaction, wiggles his ears, and hops forward. Oliver escorts him back toward the pool and back to his bench, and Sam starts to giggle. Oliver also starts to giggle without understanding why, stirring Cassidy, who is skipping out of the barn at the sound of giggles. Sam continues to giggle until the hat is abruptly yanked over his chin. Cassidy stands there in the sunshine, staring at Oliver, who stands up speedily and skips toward the window, while Cassidy leaps with an umbrella in his feet, observing him, as the moon rises above the high mountains surrounding the meadow."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In a tense room, a woman screams, waking the men who grab their guns. Fergus feeds Jody a sandwich while Jude carries tea through a sweltering greenhouse. As Fergus removes Jody's hood, they exchange smiles. Fergus finds Jody's wallet, revealing photos of him with a cricket bat and with a woman, eliciting smiles from both. Outside, Fergus allows Jody to relieve himself before returning inside, both laughing unexpectedly. Maguire is awakened by their laughter, and after slamming the hood back over Jody's head, he stands guard with a gun as Fergus leaves, watching the sun rise over the farmhouse."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Maguire stands there in the dark looking at Fergus who gets up slowly and walks toward the door while Maguire sits with an Armalite in his hands watching him as the sun comes up over the low hills around the farmhouse Jody continues to laugh until the hood is suddenly slammed back over his head Fergus also begins to laugh without knowing why waking Maguire who is walking out of the house at the sound of laughter Fergus leads him back toward the greenhouse and back to his chair and Jody begins to laugh Fergus holds his hands from behind so Jody can lean forward and Jody now pisses with immense relief shakes his body and steps back Fergus turns him around unzips his fly and Jody takes two steps toward the wall Fergus leads Jody outside holding the gun against him and Jody walks toward it breathing heavily while Fergus stands motionless in the dark looking at him Fergus looks at him keeping his gaze and Jody smiles Fergus then takes out another picture of Jody and a beautiful black woman smiling and Jody chuckles Fergus takes out a picture of Jody in cricket whites smiling and holding a bat smiling again himself Fergus's hand emerges with a wallet containing credit cards and an army identification photograph He looks at Fergus and Fergus holds the gun to his face fishing inside Jody's inside pocket Jody is not smiling anymore so Fergus goes back to his seat drinks his tea and fingers the gun on his lap Fergus pours out a cup of tea and brings it to his lips drinks and looks at him He smiles and Fergus smiles back Fergus walks to Jody and slowly takes the hood off and Jody looks up at him with his face bathed in sweat breathing in mighty gulps of air Fergus reenters and she goes Jude drinks tea while looking at Jody sweating Maguire has a newspaper which has a headline regarding the kidnapping Jude smiles holding the gun on her lap as Fergus enters Fergus gives her the gun and Jody's head follows Fergus while he leaves Jude comes into view lays the tea on the ground and his breathing becomes labored It is sweltering now in the greenhouse and the hood is drenched with sweat Jude makes her way from the door toward the greenhouse carrying a pot of tea and two cups Fergus then pushes the last crumbs of the sandwich toward Jody's mouth and Jody eats the last bits Fergus walks over to him lifts the hood up so his mouth is revealed and pushes the sandwich toward his lips allowing Jody to eat slowly She takes in huge gobs of air and rubs her hand on his chest sidling closer to him and coming on to him She is screaming and the room is alive each man awake grabbing guns and screaming"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "She takes in huge gobs of air and rubs her hand on his chest sidling closer to him and coming on to him She is screaming and the room is alive each man awake grabbing guns and screaming Fergus then pushes the last crumbs of the sandwich toward Jody's mouth and Jody eats the last bits Fergus walks over to him lifts the hood up so his mouth is revealed and pushes the sandwich toward his lips allowing Jody to eat slowly It is sweltering now in the greenhouse and the hood is drenched with sweat Jude makes her way from the door toward the greenhouse carrying a pot of tea and two cups Fergus gives her the gun and Jody's head follows Fergus while he leaves Jude comes into view lays the tea on the ground and his breathing becomes labored Maguire has a newspaper which has a headline regarding the kidnapping Jude smiles holding the gun on her lap as Fergus enters Fergus reenters and she goes Jude drinks tea while looking at Jody sweating He smiles and Fergus smiles back Fergus walks to Jody and slowly takes the hood off and Jody looks up at him with his face bathed in sweat breathing in mighty gulps of air Jody is not smiling anymore so Fergus goes back to his seat drinks his tea and fingers the gun on his lap Fergus pours out a cup of tea and brings it to his lips drinks and looks at him Fergus's hand emerges with a wallet containing credit cards and an army identification photograph He looks at Fergus and Fergus holds the gun to his face fishing inside Jody's inside pocket Fergus then takes out another picture of Jody and a beautiful black woman smiling and Jody chuckles Fergus takes out a picture of Jody in cricket whites smiling and holding a bat smiling again himself Fergus leads Jody outside holding the gun against him and Jody walks toward it breathing heavily while Fergus stands motionless in the dark looking at him Fergus looks at him keeping his gaze and Jody smiles Fergus holds his hands from behind so Jody can lean forward and Jody now pisses with immense relief shakes his body and steps back Fergus turns him around unzips his fly and Jody takes two steps toward the wall Fergus also begins to laugh without knowing why waking Maguire who is walking out of the house at the sound of laughter Fergus leads him back toward the greenhouse and back to his chair and Jody begins to laugh Maguire stands there in the dark looking at Fergus who gets up slowly and walks toward the door while Maguire sits with an Armalite in his hands watching him as the sun comes up over the low hills around the farmhouse Jody continues to laugh until the hood is suddenly slammed back over his head"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Fergus pours out a cup of tea and brings it to his lips drinks and looks at him Jody is not smiling anymore so Fergus goes back to his seat drinks his tea and fingers the gun on his lap He looks at Fergus and Fergus holds the gun to his face fishing inside Jody's inside pocket Fergus's hand emerges with a wallet containing credit cards and an army identification photograph Fergus takes out a picture of Jody in cricket whites smiling and holding a bat smiling again himself Fergus then takes out another picture of Jody and a beautiful black woman smiling and Jody chuckles Fergus looks at him keeping his gaze and Jody smiles Fergus leads Jody outside holding the gun against him and Jody walks toward it breathing heavily while Fergus stands motionless in the dark looking at him Fergus turns him around unzips his fly and Jody takes two steps toward the wall Fergus holds his hands from behind so Jody can lean forward and Jody now pisses with immense relief shakes his body and steps back Fergus leads him back toward the greenhouse and back to his chair and Jody begins to laugh Fergus also begins to laugh without knowing why waking Maguire who is walking out of the house at the sound of laughter Jody continues to laugh until the hood is suddenly slammed back over his head Maguire stands there in the dark looking at Fergus who gets up slowly and walks toward the door while Maguire sits with an Armalite in his hands watching him as the sun comes up over the low hills around the farmhouse She is screaming and the room is alive each man awake grabbing guns and screaming She takes in huge gobs of air and rubs her hand on his chest sidling closer to him and coming on to him Fergus walks over to him lifts the hood up so his mouth is revealed and pushes the sandwich toward his lips allowing Jody to eat slowly Fergus then pushes the last crumbs of the sandwich toward Jody's mouth and Jody eats the last bits Jude makes her way from the door toward the greenhouse carrying a pot of tea and two cups It is sweltering now in the greenhouse and the hood is drenched with sweat Jude comes into view lays the tea on the ground and his breathing becomes labored Fergus gives her the gun and Jody's head follows Fergus while he leaves Jude smiles holding the gun on her lap as Fergus enters Maguire has a newspaper which has a headline regarding the kidnapping Jude drinks tea while looking at Jody sweating Fergus reenters and she goes Fergus walks to Jody and slowly takes the hood off and Jody looks up at him with his face bathed in sweat breathing in mighty gulps of air He smiles and Fergus smiles back"
        }
      ]
    }
  ]
}