{
  "ground_truth": "Fergus enters with a tray and some breakfast, where Maguire is sitting stock-still, and Maguire shakes his head twice and looks hard at him before rising and dragging Fergus out the door. Maguire then goes back to the house where Jody is sitting with the hood on again as Fergus enters without saying anything. Fergus takes a plate, brings it toward Jody, lifts up Jody's hood to expose his mouth, and begins to feed him, saying nothing and shaking his head before feeding himself and then feeding more to Jody. Jody chuckles under his hood as Fergus walks toward him and pulls off the hood, causing Jody to smile up at him and Fergus to laugh. She pulls the hood down over him and whacks him with a pistol, after which Fergus lifts the hood a bit to reveal Jody's mouth bleeding and looks moved. Fergus walks toward him, their faces close as he searches for her picture. The door opens to reveal Maguire with another man, and Fergus turns toward them. Fergus walks toward Maguire, and the other man walks forward and takes his seat, with Maguire, Jude, Fergus, and others around. Maguire lights a cigarette, and Fergus looks at him and nods, then turns back as Fergus leaves. Fergus takes his place in the chair beside Jody, who begins to laugh under the hood. Fergus takes out a cigarette, lights it, and lifts up Jody's hood so he can smoke while Fergus watches him puff the cigarette, the hood just above his lips, and then Jody coughs but keeps the cigarette in his lips. Fergus gently takes the cigarette from his mouth, remaining silent with wet eyes as the farmhouse is covered in mist. Maguire opens the greenhouse door and clicks the chamber of his gun while Fergus has a gun in his hand. Fergus takes Jody, with his hands tied behind his back, by the elbow, and Jody rises as Fergus leads him through the door past Maguire. Fergus turns with sudden fierceness and pulls Jody through the fields, pushing him through a copse of trees with the gun at his back, and then pulls the hood off. Jody looks around him with a cut lip from where Jude struck him and is prodded on by Fergus with the gun; Jody stumbles forward while Fergus is cold and businesslike. Jody suddenly sprints, loosens the ties on his hands, frees them, and runs off like a hare, causing Fergus to scream in fury after him, aim, change his mind, and run. Fergus gains on him, stretches his arm out, but Jody sprints ahead again as if playing with him, laughing in exhilaration as Fergus pants behind him, wheezing and almost laughing.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Fergus enters with a platter and some morning meal, where Maguire is sitting motionless, and Maguire shakes his head twice and gazes intently at him before rising and dragging Fergus out the entrance. Maguire then goes back to the dwelling where Jody is sitting with the hood on again as Fergus enters without saying anything. Fergus takes a dish, brings it toward Jody, lifts up Jody's hood to expose his mouth, and begins to feed him, saying nothing and shaking his head before feeding himself and then feeding more to Jody. Jody chuckles under his hood as Fergus walks toward him and pulls off the hood, causing Jody to smile up at him and Fergus to laugh. She pulls the hood down over him and strikes him with a handgun, after which Fergus lifts the hood a bit to reveal Jody's mouth bleeding and looks moved. Fergus walks toward him, their faces close as he searches for her photograph. The door opens to reveal Maguire with another man, and Fergus turns toward them. Fergus walks toward Maguire, and the other man walks forward and takes his seat, with Maguire, Jude, Fergus, and others around. Maguire lights a cigarette, and Fergus looks at him and nods, then turns back as Fergus departs. Fergus takes his place in the chair beside Jody, who begins to laugh under the hood. Fergus takes out a cigarette, lights it, and lifts up Jody's hood so he can smoke while Fergus watches him puff the cigarette, the hood just above his lips, and then Jody coughs but keeps the cigarette in his lips. Fergus gently takes the cigarette from his mouth, remaining silent with moist eyes as the farmhouse is covered in mist. Maguire opens the greenhouse door and clicks the chamber of his firearm while Fergus has a firearm in his hand. Fergus takes Jody, with his hands tied behind his back, by the elbow, and Jody rises as Fergus leads him through the door past Maguire. Fergus turns with sudden fierceness and pulls Jody through the fields, pushing him through a grove of trees with the firearm at his back, and then pulls the hood off. Jody looks around him with a cut lip from where Jude struck him and is prodded on by Fergus with the firearm; Jody stumbles forward while Fergus is cold and businesslike. Jody suddenly dashes, loosens the bindings on his hands, frees them, and runs off like a hare, causing Fergus to scream in fury after him, aim, change his mind, and run. Fergus gains on him, stretches his arm out, but Jody dashes ahead again as if playing with him, laughing in exhilaration as Fergus pants behind him, wheezing and almost laughing."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Fergus enters with a tray and some breakfast, where Maguire is sitting stock-still, and twice his head is shaken by Maguire, who looks hard at him before rising and dragging Fergus out the door. Maguire then goes back to the house where Jody is sitting with the hood on again as the room is entered by Fergus without saying anything. A plate is taken by Fergus, brought toward Jody, and Jody's hood is lifted up by Fergus to expose his mouth. Nothing is said by him, and his head is shaken before he feeds himself and then more is fed to Jody. Jody chuckles under his hood as the hood is pulled off by Fergus, causing Jody to smile up at him and laughter is shared by Fergus. The hood is pulled down over him by her and a pistol is used to whack him, after which Jody's bleeding mouth is revealed by Fergus lifting the hood a bit, and he looks moved. Toward him walks Fergus, their faces close as a search is conducted by him for her picture. The door opens to reveal Maguire with another man, and toward them, Fergus turns. Toward Maguire walks Fergus, and his seat is taken by the other man, with Maguire, Jude, Fergus, and others around. A cigarette is lit by Maguire, and at him, Fergus looks and nods, then back he turns as his leave is taken by Fergus. His place is taken by Fergus in the chair beside Jody, who begins to laugh under the hood. A cigarette is taken out by Fergus, lit, and Jody's hood is lifted up so he can smoke while the cigarette is puffed by Jody, the hood just above his lips, and then by Jody, a cough is made but the cigarette is kept in his lips. The cigarette is gently taken from his mouth by Fergus, remaining silent with wet eyes as the farmhouse is covered in mist. The greenhouse door is opened by Maguire, and his gun's chamber is clicked while a gun is held by Fergus in his hand. Jody, with hands tied behind his back, is taken by the elbow by Fergus, and Jody rises as he is led through the door past Maguire by Fergus. With sudden fierceness, Fergus turns and Jody is pulled through the fields, pushed through a copse of trees with the gun at his back, and then the hood is pulled off. Jody looks around him with a cut lip from where he was struck by Jude and is prodded on by Fergus with the gun; Jody stumbles forward while cold and businesslike, Fergus stays. Jody suddenly sprints, the ties on his hands are loosened by him, and they are freed as he runs off like a hare, causing Fergus to scream in fury after him, aim, change his mind, and run. On him, Fergus gains, his arm stretches out, but Jody sprints ahead again as if with him he is playing, laughing in exhilaration as panting behind him is done by Fergus, wheezing and almost laughing."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Fergus enters with a breakfast tray. Maguire, sitting still, shakes his head, stares at Fergus, then drags him out. Maguire returns as Fergus silently enters. Fergus uncovers Jody's mouth to feed him, then himself. Jody chuckles; Fergus removes the hood, making Jody smile, and they laugh. Fergus replaces the hood, revealing Jody's bleeding mouth. Maguire arrives with another man, and Fergus joins Jude, Maguire, and others. Maguire lights a cigarette; Fergus nods and leaves. Fergus sits by Jody, who laughs under the hood. Fergus lights a cigarette, lifts Jody's hood so he can smoke. Jody coughs, Fergus taking the cigarette silently, eyes wet, as mist covers the farmhouse. Maguire clicks a gun; Fergus, armed, leads Jody past Maguire. Fergus forcefully pulls Jody through fields, removes his hood, and prods him with a gun. Jody runs, frees his hands, and escapes, with Fergus screaming and chasing him, nearly laughing as Jody sprints ahead, exhilarated."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Fergus enters with breakfast, where Maguire sits motionless and glares at him before dragging Fergus out. Maguire returns to Jody, now hooded, as Fergus silently enters, revealing Jody’s mouth to feed him. Jody chuckles, and Fergus uncovers his face, prompting smiles and laughter. Fergus lowers the hood, revealing Jody’s bleeding mouth after being hit by Jude. Maguire enters with another man; Fergus nods and returns to Jody, who laughs. Fergus lights a cigarette, lets Jody smoke, then gently takes it back, tearfully. Maguire checks his gun as Fergus grabs his, leading the tied Jody outside. As they move through trees, Fergus removes the hood. Jody, with a bleeding lip, is prodded by Fergus’s gun, but suddenly escapes. Fergus yells, aims, but hesitates, then chases. Jody, freed, runs playfully ahead, as Fergus follows, panting and nearly laughing."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Fergus makes his entrance into the room, carefully balancing a tray laden with breakfast items, while Maguire sits completely motionless, looking almost like a statue. Maguire gives a sharp double shake of his head and fixes a piercing gaze on Fergus before standing up, taking hold of Fergus, and unceremoniously dragging him out the door. After this, Maguire walks back toward the house where Jody is seated, his head shrouded by the hood once again. Fergus silently enters the room without uttering a single word. He picks up a plate and moves it toward Jody, gently lifting Jody's hood to reveal his mouth. Fergus then begins to feed him quietly, not saying a word and shaking his head before he takes a moment to feed himself. He then continues to feed more to Jody, who chuckles softly beneath the hood. As Fergus approaches him and removes the hood, Jody smiles up at him, and Fergus lets out a laugh. She lowers the hood back over him and lands a playful yet firm whack with a pistol. Fergus then slightly raises the hood to reveal Jody's mouth now bleeding, looking deeply affected by the sight. Fergus moves closer to him, their faces only inches apart as he searches for her picture. Suddenly, the door opens to reveal Maguire accompanied by another man, prompting Fergus to turn toward them. Fergus strides over to Maguire, while the other man steps forward to take his seat, with Maguire, Jude, Fergus, and several others gathered around. Maguire lights a cigarette, and Fergus looks at him, offering a nod before turning his attention back as Fergus exits the room. Fergus then resumes his position in the chair next to Jody, who begins to laugh quietly under the hood. Fergus retrieves a cigarette, lights it, and lifts Jody's hood so he can have a smoke. Fergus observes him as he takes puffs from the cigarette, with the hood resting just above his lips. Jody begins to cough but manages to keep the cigarette nestled between his lips. Fergus gently removes the cigarette from Jody's mouth, remaining silent with eyes that glisten with unshed tears as mist envelops the farmhouse outside. Maguire opens the door to the greenhouse, clicking the chamber of his gun while Fergus also holds a gun in his hand. Fergus takes Jody, whose hands are bound behind his back, by the elbow, helping him rise as Fergus guides him through the door, passing Maguire. With sudden intensity, Fergus pulls Jody through the fields, urging him forward with a gun pressed at his back, through a cluster of trees, before finally removing the hood. Jody glances around, his lip cut from where Jude struck him, and Fergus prods him onward with the gun. Jody stumbles forward, while Fergus maintains a cold, businesslike demeanor. Suddenly, Jody makes a break for it, loosens the binds on his hands, frees them, and takes off running with the speed of a hare. This provokes Fergus to scream in frustration after him, aiming his gun, but then changing his mind and choosing to run instead. Fergus closes in on Jody, reaching out his arm, but Jody speeds up again as if toying with him, laughing with exhilaration while Fergus pants heavily behind him, almost laughing himself as he wheezes with exertion."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Fergus makes his entrance into the room, navigating carefully and skillfully balancing a tray that is heavily laden with an assortment of breakfast items. Meanwhile, Maguire remains seated, completely motionless, looking almost as if he were a statue carved out of stone. With a quick, sharp double shake of his head, Maguire fixes a piercing, intense gaze on Fergus. Without a word of warning, he stands up, firmly takes hold of Fergus, and unceremoniously drags him out through the door. After this abrupt encounter, Maguire makes his way back toward the house where Jody is seated, his head once again concealed by the hood like a shrouded figure. Fergus re-enters the room silently, without uttering a single word or sound. He picks up a plate and moves it toward Jody, gently lifting Jody's hood just enough to reveal his mouth. Fergus then begins to feed him quietly, not breaking the silence nor speaking, only shaking his head before taking a brief moment to eat for himself. He continues to feed more to Jody, who chuckles softly beneath the concealing hood. As Fergus moves closer to him and lifts the hood, Jody smiles up at him warmly, and Fergus lets out a laugh that slices through the tension. She then lowers the hood back over Jody and lands a playful yet firm whack with the pistol, suggesting both mischief and seriousness. Fergus carefully raises the hood slightly again to reveal that Jody's mouth is now bleeding, visibly moved and deeply affected by the sight. Fergus leans in closer to him, their faces mere inches apart as he searches intently for her picture. Suddenly, the door swings open to reveal Maguire, who is accompanied by another man, prompting Fergus to turn his attention toward them. Fergus strides over purposefully to Maguire, while the other man steps forward confidently to take his seat, with Maguire, Jude, Fergus, and several others gathered around. Maguire lights a cigarette, and Fergus looks at him meaningfully, offering a nod before turning his attention back as Fergus exits the room with a sense of resolve. Fergus then resumes his position in the chair next to Jody, who begins to laugh quietly under the hood, his amusement clear yet restrained. Fergus retrieves a cigarette of his own, lights it with a practiced flick, and lifts Jody's hood so he can indulge in a smoke. Fergus watches him closely as he takes puffs from the cigarette, the hood resting just above his lips while Jody begins to cough, managing to keep the cigarette nestled between his lips. Fergus gently and with quiet care removes the cigarette from Jody's mouth, saying nothing while his eyes glisten with unshed tears as mist envelops the farmhouse outside, casting an eerie ambience. Maguire opens the door to the greenhouse, he clicks the chamber of his gun audibly, while Fergus also holds a gun in his hand, mirroring the tension of the moment. Fergus takes Jody, whose hands are bound securely behind his back, by the elbow, helping him rise gently as Fergus guides him through the door, passing by Maguire. With sudden and unexpected intensity, Fergus pulls Jody through the open fields, urging him forward with the pressure of a gun pressed firmly at his back. They move through a cluster of dense, looming trees before Fergus finally removes the hood. Jody glances around, taking in his surroundings, his lip cut and raw from where Jude struck him, and Fergus prods him onward with the insistent presence of the gun. Jody stumbles forward, while Fergus maintains a cold and businesslike demeanor. Suddenly, Jody makes a break for freedom, loosening the binds on his hands with surprising agility, freeing them, and takes off running with the speed of a startled hare. This provokes Fergus to scream in frustration after him, his voice carrying through the air, as he aims his gun but then reconsiders and decides to run instead. Fergus closes in on Jody, reaching out his arm with determination, but Jody speeds up again as if toying with him, laughing with exhilaration and joy, while Fergus pants heavily behind him, almost laughing himself as he wheezes with exertion and determination."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Fergus enters the room, carefully balancing a tray holding some breakfast, and notices Maguire sitting completely still, almost as if frozen in place. Maguire shifts ever so slightly, shaking his head twice and fixing Fergus with an intense gaze. Without uttering a word, Maguire stands up and, with a firm grip, ushers Fergus out the door. Maguire then makes his way back to the house where Jody is seated, his features obscured beneath a hood. Fergus enters silently, exudes a quiet determination, and picks up a plate, bringing it towards Jody. With a delicate motion, Fergus lifts the hood just enough to reveal Jody's mouth and begins to feed him, his lips sealed in silence and his head shaking as if in thought or denial. After ensuring Jody has eaten, Fergus feeds himself, before returning his attention to Jody and offering him more food. Under the hood, Jody breaks into a soft chuckle, prompting Fergus to move closer, remove the hood entirely, and witness Jody's broad smile, which ignites laughter from Fergus himself. As amusement fills the air, Jude steps in, abruptly pulling the hood back over Jody's head and striking him swiftly with a pistol. Fergus, sympathetically, lifts the hood slightly to see Jody's bleeding mouth, his expression deeply moved by the sight. Moving closer, Fergus searches for a picture, their faces almost touching, but the moment is interrupted as the door swings open to reveal Maguire and another man entering the room. Fergus turns to face them and walks towards Maguire, as the new man strides forward and takes a seat among Maguire, Jude, Fergus, and others standing around. Maguire, with a deliberate slowness, lights a cigarette, and Fergus acknowledges him with a nod before returning to his place beside Jody. The atmosphere is tense as Jody, still under the hood, begins to laugh. Fergus takes out a cigarette, lights it, and, with a gentle hand, lifts Jody's hood enough for him to take a puff. Fergus watches closely, observing the cigarette bob in Jody's lips, until Jody's momentary cough interrupts the silence, yet he maintains his grip on the cigarette. Fergus, maintaining a withdrawn silence, his eyes wet with unspoken emotion, softly takes the cigarette from Jody’s lips as mist envelops the farmhouse. Meanwhile, Maguire enters the greenhouse, the ominous click of his gun's chamber echoing as Fergus stands inside with a gun in hand. With steadfast resolve, Fergus takes Jody, whose hands are tied behind him, by the elbow and gently urges him to stand. Jody complies, and Fergus guides him through the door, leading him past Maguire with measured steps. Suddenly, in a flash of determination, Fergus twists around with fiery intent, pulling Jody across the fields and pushing him through a stand of trees, all the while keeping the gun pressed to his back. Reaching a certain point, Fergus pulls off Jody's hood, exposing a face marred by a cut lip courtesy of Jude's earlier strike, but Jody is quickly nudged forward by the persistent pressure of Fergus's gun. Despite the situation's gravity, Jody seizes an opportunity, abruptly sprinting forward, expertly loosening and freeing his tied hands. With surprising agility, he darts away as fast as a hare, leaving Fergus shouting in frustration, his voice ringing with fury. Fergus raises his gun, but a change of heart stays his hand, and instead, he gives chase. Gaining ground on Jody, Fergus stretches out his arm in pursuit, but Jody, as if playing a game, continues to speed ahead, his laughter echoing in the air. The thrill of the chase draws near to a climax as Fergus pants heavily behind, caught between exertion and the urge to laugh, each breath a testament to the exhilarating pursuit."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Fergus enters with a tray of breakfast to find Maguire sitting motionless. After Maguire shakes his head and gives Fergus a stern look, he rises and escorts him out the door. Maguire returns to the house, where Fergus begins to feed Jody without speaking, gently exposing Jody's mouth by lifting his hood. They share a silent meal, with Jody chuckling under his hood, which Fergus then lifts off, prompting smiles from both. After Jody is hit with a pistol, revealing a bleeding mouth, Fergus appears moved and draws close to Jody. As Maguire and another man enter, Fergus turns to face them and then joins others while acknowledging Maguire, who lights a cigarette. Returning to sit beside Jody, Fergus lights a cigarette for him, lifting his hood to allow him to smoke. Despite a brief cough, Jody keeps the cigarette, and Fergus silently watches with tears in his eyes.\n\nMaguire opens a door, preparing his gun as Fergus, armed himself, leads Jody, with tied hands, through the door and past Maguire. Fergus fiercely pulls Jody through fields and trees, eventually removing his hood. Despite Jody's injured lip, Fergus remains cold and efficient, prodding him forward with the gun. Defiantly, Jody suddenly frees his hands and sprints away, prompting Fergus to chase after him, initially with the intent to shoot but changing his mind. As Jody playfully distances himself, laughing, Fergus follows, breathless yet almost amused by the pursuit."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Fergus enters with a tray and some breakfast, where Maguire, a hardened IRA operative known for his stern demeanor, is sitting stock-still, and Maguire shakes his head twice and looks hard at him before rising and dragging Fergus out the door. Maguire then goes back to the safe house, a secluded place often used by members of the IRA for clandestine activities, where Jody, a captured British soldier, is sitting with the hood on again as Fergus enters without saying anything. Fergus takes a plate, brings it toward Jody, lifts up Jody's hood to expose his mouth, and, maintaining the silent tension characteristic of captor and captive, begins to feed him, saying nothing and shaking his head before feeding himself and then feeding more to Jody. Jody chuckles under his hood as Fergus walks toward him and pulls off the hood, revealing a smile as an unexpected gesture of camaraderie, causing Jody to smile up at him and Fergus to laugh. She, a fellow IRA member with an intimidating presence, pulls the hood down over him and whacks him with a pistol, after which Fergus lifts the hood a bit to reveal Jody's mouth bleeding, a grim reminder of the brutality of their situation, and looks moved. Fergus walks toward him, their faces close as he searches for her picture, a photograph of a woman cherished by Fergus that he keeps as a token of a promise made long ago. The door opens to reveal Maguire with another man, a new recruit brought in to prove his loyalty, and Fergus turns toward them. Fergus walks toward Maguire, and the other man, a local informant providing crucial intel on military movements, walks forward and takes his seat, with Maguire, Jude, Fergus, and others around. Maguire lights a cigarette, an unspoken signal of readiness for grim tasks, and Fergus looks at him and nods, then turns back as Fergus leaves. Fergus takes his place in the chair beside Jody, who begins to laugh under the hood, a desperate attempt to lighten the oppressive mood. Fergus takes out a cigarette, lights it, and lifts up Jody's hood so he can smoke while Fergus watches him puff the cigarette, the hood just above his lips, and then Jody coughs but keeps the cigarette in his lips. Fergus gently takes the cigarette from his mouth, remaining silent with wet eyes, reflecting on the toll of violence, as the farmhouse is covered in mist, an eerie blanket that adds to the tension. Maguire opens the greenhouse door, an entrance to a room repurposed to store weapons, and clicks the chamber of his gun while Fergus has a gun in his hand. Fergus takes Jody, with his hands tied behind his back, by the elbow, and Jody rises as Fergus leads him through the door past Maguire. Fergus turns with sudden fierceness and pulls Jody through the fields, pushing him through a copse of trees, a small wooded area they use for cover, with the gun at his back, and then pulls the hood off. Jody looks around him with a cut lip from where Jude struck him, evidence of earlier violence, and is prodded on by Fergus with the gun; Jody stumbles forward while Fergus is cold and businesslike. Jody suddenly sprints, loosens the ties on his hands, frees them, and runs off like a hare, in a burst of desperate adrenaline, causing Fergus to scream in fury after him, aim, change his mind, and run. Fergus gains on him, stretches his arm out, but Jody sprints ahead again as if playing with him, a brief moment of exhilaration and liberation, laughing in exhilaration as Fergus pants behind him, wheezing and almost laughing."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Jody looks around him with a cut lip from where Jude struck him and is prodded on by Fergus with the gun Fergus enters with a tray and some breakfast where Maguire is sitting stockstill and Maguire shakes his head twice and looks hard at him before rising and dragging Fergus out the door Jody chuckles under his hood as Fergus walks toward him and pulls off the hood causing Jody to smile up at him and Fergus to laugh Jude Fergus and others around Maguire then goes back to the house where Jody is sitting with the hood on again as Fergus enters without saying anything Fergus takes a plate brings it toward Jody lifts up Jody's hood to expose his mouth and begins to feed him saying nothing and shaking his head before feeding himself and then feeding more to Jody She pulls the hood down over him and whacks him with a pistol after which Fergus lifts the hood a bit to reveal Jody's mouth bleeding and looks moved Fergus takes out a cigarette lights it and lifts up Jody's hood so he can smoke while Fergus watches him puff the cigarette the hood just above his lips and then Jody coughs but keeps the cigarette in his lips Maguire then goes back to the house where Jody is sitting with the hood on again as Fergus enters without saying anything Fergus takes a plate brings it toward Jody lifts up Jody's hood to expose his mouth and begins to feed him saying nothing and shaking his head before feeding himself and then feeding more to Jody Jody chuckles under his hood as Fergus walks toward him and pulls off the hood causing Jody to smile up at him and Fergus to laugh She pulls the hood down over him and whacks him with a pistol after which Fergus lifts the hood a bit to reveal Jody's mouth bleeding and looks moved Fergus walks toward him their faces close as he searches for her picture The door opens to reveal Maguire with another man and Fergus turns toward them Fergus walks toward Maguire and the other man walks forward and takes his seat with Maguire Jude Fergus and others around Maguire lights a cigarette and Fergus looks at him and nods then turns back as Fergus leaves Fergus takes his place in the chair beside Jody who begins to laugh under the hood Fergus takes his place in the chair beside Jody who begins to laugh under the hood Fergus takes out a cigarette lights it and lifts up Jody's hood so he can smoke while Fergus watches him puff the cigarette the hood just above his lips and then Jody coughs but keeps the cigarette in his lips Jody stumbles forward while Fergus is cold and businesslike Maguire lights a cigarette and Fergus looks at him and nods Fergus gently takes the cigarette from his mouth remaining silent with wet eyes as the farmhouse is covered in mist Maguire opens the greenhouse door and clicks the chamber of his gun while Fergus has a gun in his hand Fergus takes Jody with his hands tied behind his back by the elbow and Jody rises as Fergus leads him through the door past Maguire Fergus turns with sudden fierceness and pulls Jody through the fields pushing him through a copse of trees with the gun at his back and then pulls the hood off Jody looks around him with a cut lip from where Jude struck him and is prodded on by Fergus with the gun Fergus enters with a tray and some breakfast where Maguire is sitting stockstill and Maguire shakes his head twice and looks hard at him before rising and dragging Fergus out the door Jody stumbles forward while Fergus is cold and businesslike Jody suddenly sprints loosens the ties on his hands frees them and runs off like a hare causing Fergus to scream in fury after him aim change his mind and run Fergus gains on him stretches his arm out but Jody sprints ahead again as if playing with him laughing in exhilaration as Fergus pants behind him wheezing and almost laughing"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Fergus enters with a tray and some breakfast where Maguire is sitting stockstill and Maguire shakes his head twice and looks hard at him before rising and dragging Fergus out the door. Maguire then goes back to the house where Jody is sitting with the hood on again as Fergus enters without saying anything Fergus takes a plate brings it toward Jody lifts up Jody's hood to expose his mouth and begins to feed him saying nothing and shaking his head before feeding himself and then feeding more to Jody. Jody chuckles under his hood as Fergus walks toward him and pulls off the hood causing Jody to smile up at him and Fergus to laugh. She pulls the hood down over him and whacks him with a pistol after which Fergus lifts the hood a bit to reveal Jody's mouth bleeding and looks moved. Fergus walks toward him their faces close as he searches for her picture. The door opens to reveal Maguire with another man and Fergus turns toward them. Fergus walks toward Maguire and the other man walks forward and takes his seat with Maguire. Jude Fergus and others around. Maguire lights a cigarette and Fergus looks at him and nods. then turns back as Fergus leaves. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Fergus takes his place in the chair beside Jody who begins to laugh under the hood. Fergus takes out a cigarette lights it and lifts up Jody's hood so he can smoke while Fergus watches him puff the cigarette the hood just above his lips and then Jody coughs but keeps the cigarette in his lips. Fergus gently takes the cigarette from his mouth remaining silent with wet eyes as the farmhouse is covered in mist. Maguire opens the greenhouse door and clicks the chamber of his gun while Fergus has a gun in his hand. Fergus takes Jody with his hands tied behind his back by the elbow and Jody rises as Fergus leads him through the door past Maguire. Fergus turns with sudden fierceness and pulls Jody through the fields pushing him through a copse of trees with the gun at his back and then pulls the hood off. Jody looks around him with a cut lip from where Jude struck him and is prodded on by Fergus with the gun. Jody stumbles forward while Fergus is cold and businesslike. Jody suddenly sprints loosens the ties on his hands frees them and runs off like a hare causing Fergus to scream in fury after him aim change his mind and run. Fergus gains on him stretches his arm out but Jody sprints ahead again as if playing with him laughing in exhilaration as Fergus pants behind him wheezing and almost laughing."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Fergus enters with a tray and some breakfast where Maguire is sitting stockstill and Maguire shakes his head twice and looks hard at him before rising and dragging Fergus out the door. Maguire then goes back to the house where Jody is sitting with the hood on again as Fergus enters without saying anything Fergus takes a plate brings it toward Jody lifts up Jody's hood to expose his mouth and begins to feed him saying nothing and shaking his head before feeding himself and then feeding more to Jody. Jody chuckles under his hood as Fergus walks toward him and pulls off the hood causing Jody to smile up at him and Fergus to laugh. She pulls the hood down over him and whacks him with a pistol after which Fergus lifts the hood a bit to reveal Jody's mouth bleeding and looks moved. Fergus walks toward him their faces close as he searches for her picture. The door opens to reveal Maguire with another man and Fergus turns toward them. Fergus walks toward Maguire and the other man walks forward and takes his seat with Maguire. Jude Fergus and others around. Maguire lights a cigarette and Fergus looks at him and nods. then turns back as Fergus leaves. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Fergus takes his place in the chair beside Jody who begins to laugh under the hood. Fergus takes out a cigarette lights it and lifts up Jody's hood so he can smoke while Fergus watches him puff the cigarette the hood just above his lips and then Jody coughs but keeps the cigarette in his lips. Fergus gently takes the cigarette from his mouth remaining silent with wet eyes as the farmhouse is covered in mist. Maguire opens the greenhouse door and clicks the chamber of his gun while Fergus has a gun in his hand. Fergus takes Jody with his hands tied behind his back by the elbow and Jody rises as Fergus leads him through the door past Maguire. Fergus turns with sudden fierceness and pulls Jody through the fields pushing him through a copse of trees with the gun at his back and then pulls the hood off. Jody looks around him with a cut lip from where Jude struck him and is prodded on by Fergus with the gun. Jody stumbles forward while Fergus is cold and businesslike. Jody suddenly sprints loosens the ties on his hands frees them and runs off like a hare causing Fergus to scream in fury after him aim change his mind and run. Fergus gains on him stretches his arm out but Jody sprints ahead again as if playing with him laughing in exhilaration as Fergus pants behind him wheezing and almost laughing."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Fergus enters with a tray and some breakfast where Maguire is sitting stockstill and Maguire shakes his head twice and looks hard at him before rising and dragging Fergus out the door. Maguire then goes back to the house where Jody is sitting with the hood on again as Fergus enters without saying anything Fergus takes a plate brings it toward Jody lifts up Jody's hood to expose his mouth and begins to feed him saying nothing and shaking his head before feeding himself and then feeding more to Jody. Jody chuckles under his hood as Fergus walks toward him and pulls off the hood causing Jody to smile up at him and Fergus to laugh. She pulls the hood down over him and whacks him with a pistol after which Fergus lifts the hood a bit to reveal Jody's mouth bleeding and looks moved. Fergus walks toward him their faces close as he searches for her picture. Fergus turns with sudden fierceness and pulls Jody through the fields pushing him through a copse of trees with the gun at his back and then pulls the hood off. Jody looks around him with a cut lip from where Jude struck him and is prodded on by Fergus with the gun. Jody stumbles forward while Fergus is cold and businesslike. Jody suddenly sprints loosens the ties on his hands frees them and runs off like a hare causing Fergus to scream in fury after him aim change his mind and run. Fergus gains on him stretches his arm out but Jody sprints ahead again as if playing with him laughing in exhilaration as Fergus pants behind him wheezing and almost laughing."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Fergus enters with a tray and some breakfast where Maguire is sitting stockstill and Maguire shakes his head twice and looks hard at him before rising and dragging Fergus out the door. Maguire then goes back to the house where Jody is sitting with the hood on again as Fergus enters without saying anything Fergus takes a plate brings it toward Jody lifts up Jody's hood to expose his mouth and begins to feed him saying nothing and shaking his head before feeding himself and then feeding more to Jody. Jody suddenly sprints loosens the ties on his hands frees them and runs off like a hare causing Fergus to scream in fury after him aim change his mind and run. Fergus gains on him stretches his arm out but Jody sprints ahead again as if playing with him laughing in exhilaration as Fergus pants behind him wheezing and almost laughing."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Terrance enters with a tray and some breakfast, where Baxter is sitting stock-still, and Baxter shakes his head twice and looks hard at Terrance before rising and dragging Terrance out the door. Baxter then goes back to the house where Alex is sitting with the hood on again as Terrance enters without saying anything. Terrance takes a plate, brings it toward Alex, lifts up Alex's hood to expose his mouth, and begins to feed him, saying nothing and shaking his head before feeding himself and then feeding more to Alex. Alex chuckles under his hood as Terrance walks toward him and pulls off the hood, causing Alex to smile up at him and Terrance to laugh. She pulls the hood down over him and whacks him with a pistol, after which Terrance lifts the hood a bit to reveal Alex's mouth bleeding and looks moved. Terrance walks toward him, their faces close as he searches for her picture. The door opens to reveal Baxter with another man, and Terrance turns toward them. Terrance walks toward Baxter, and the other man walks forward and takes his seat, with Baxter, Claire, Terrance, and others around. Baxter lights a cigarette, and Terrance looks at him and nods, then turns back as Terrance leaves. Terrance takes his place in the chair beside Alex, who begins to laugh under the hood. Terrance takes out a cigarette, lights it, and lifts up Alex's hood so he can smoke while Terrance watches him puff the cigarette, the hood just above his lips, and then Alex coughs but keeps the cigarette in his lips. Terrance gently takes the cigarette from his mouth, remaining silent with wet eyes as the farmhouse is covered in mist. Baxter opens the greenhouse door and clicks the chamber of his gun while Terrance has a gun in his hand. Terrance takes Alex, with his hands tied behind his back, by the elbow, and Alex rises as Terrance leads him through the door past Baxter. Terrance turns with sudden fierceness and pulls Alex through the fields, pushing him through a copse of trees with the gun at his back, and then pulls the hood off. Alex looks around him with a cut lip from where Claire struck him and is prodded on by Terrance with the gun; Alex stumbles forward while Terrance is cold and businesslike. Alex suddenly sprints, loosens the ties on his hands, frees them, and runs off like a hare, causing Terrance to scream in fury after him, aim, change his mind, and run. Terrance gains on him, stretches his arm out, but Alex sprints ahead again as if playing with him, laughing in exhilaration as Terrance pants behind him, wheezing and almost laughing."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Fergus enters with a skateboard and some tacos, where Maguire is sitting stock-still, and Maguire shakes his head twice and looks hard at him before rising and dragging Fergus out the window. Maguire then goes back to the garage where Jody is sitting with the scarf on again as Fergus enters without saying anything. Fergus takes a frisbee, brings it toward Jody, lifts up Jody's scarf to expose his mouth, and begins to feed him, saying nothing and shaking his head before feeding himself and then feeding more to Jody. Jody chuckles under his scarf as Fergus walks toward him and pulls off the scarf, causing Jody to smile up at him and Fergus to laugh. She pulls the scarf down over him and whacks him with a flashlight, after which Fergus lifts the scarf a bit to reveal Jody's mouth bleeding and looks moved. Fergus walks toward him, their faces close as he searches for her postcard. The skylight opens to reveal Maguire with another woman, and Fergus turns toward them. Fergus walks toward Maguire, and the other woman walks forward and takes her seat, with Maguire, Jude, Fergus, and others around. Maguire lights a lantern, and Fergus looks at him and nods, then turns back as Fergus leaves. Fergus takes his place in the hammock beside Jody, who begins to laugh under the scarf. Fergus takes out a match, lights it, and lifts up Jody's scarf so he can smoke while Fergus watches him puff the match, the scarf just above his lips, and then Jody coughs but keeps the match in his lips. Fergus gently takes the match from his mouth, remaining silent with wet eyes as the park is covered in fog. Maguire opens the barn door and clicks the chamber of his bow while Fergus has a bow in his hand. Fergus takes Jody, with his hands tied behind his back, by the elbow, and Jody rises as Fergus leads him through the window past Maguire. Fergus turns with sudden fierceness and pulls Jody through the streets, pushing him through a maze of bushes with the bow at his back, and then pulls the scarf off. Jody looks around him with a cut lip from where Jude struck him and is prodded on by Fergus with the bow; Jody stumbles forward while Fergus is cold and businesslike. Jody suddenly sprints, loosens the ties on his hands, frees them, and runs off like a fox, causing Fergus to scream in fury after him, aim, change his mind, and run. Fergus gains on him, stretches his arm out, but Jody sprints ahead again as if playing with him, laughing in exhilaration as Fergus pants behind him, wheezing and almost laughing."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Fergus strolls in with a tray and some breakfast, where Maguire is sitting quietly, and Maguire nods his head twice and glances hard at him before rising and nudging Fergus out the door. Maguire then returns to the house where Jody is sitting with the hood on again as Fergus enters without uttering anything. Fergus grabs a plate, places it near Jody, raises Jody's hood to show his mouth, and starts to water him, saying nothing and nodding his head before watering himself and then watering more to Jody. Jody giggles under his hood as Fergus approaches him and tugs off the hood, causing Jody to grin up at him and Fergus to chuckle. She drapes the hood down over him and taps him with a pistol, after which Fergus raises the hood a bit to uncover Jody's mouth bleeding and looks concerned. Fergus heads toward him, their faces close as he searches for her photograph. The door swings open to show Maguire with another man, and Fergus faces them. Fergus strides toward Maguire, and the other man moves forward and claims his seat, with Maguire, Jude, Fergus, and others around. Maguire blows a cigarette, and Fergus glances at him and nods, then turns back as Fergus departs. Fergus settles in the chair beside Jody, who starts to giggle under the hood. Fergus pulls out a cigarette, ignites it, and raises Jody's hood so he can smoke while Fergus observes him puff the cigarette, the hood just above his lips, and then Jody sputters but keeps the cigarette in his lips. Fergus delicately removes the cigarette from his mouth, remaining quiet with misty eyes as the farmhouse is engulfed in mist. Maguire swings open the greenhouse door and snaps the chamber of his gun while Fergus has a gun in his hand. Fergus guides Jody, with his hands bound behind his back, by the elbow, and Jody stands as Fergus ushers him through the door past Maguire. Fergus pivots with sudden intensity and tugs Jody through the fields, steering him through a grove of trees with the gun at his back, and then removes the hood. Jody gazes around him with a bruised lip from where Jude hit him and is urged on by Fergus with the gun; Jody stumbles forward while Fergus remains composed and methodical. Jody suddenly dashes, loosens the ties on his hands, frees them, and sprints off like a deer, causing Fergus to shout in anger after him, aim, reconsider, and bolt. Fergus catches up to him, extends his arm out, but Jody dashes ahead again as if amusing himself, laughing in excitement as Fergus breathes heavily behind him, gasping and almost chuckling."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Gretel enters with a suitcase and some pancakes, where Anderson is sitting stock-still, and Anderson shakes his head twice and looks hard at her before rising and dragging Gretel out the window. Anderson then goes back to the barn where Alex is sitting with the scarf on again as Gretel enters without saying anything. Gretel takes a shovel, brings it toward Alex, lifts up Alex's scarf to expose his nose, and begins to feed him, saying nothing and shaking her head before feeding herself and then feeding more to Alex. Alex chuckles under his scarf as Gretel walks toward him and pulls off the scarf, causing Alex to smile up at her and Gretel to laugh. She pulls the scarf down over him and whacks him with a hammer, after which Gretel lifts the scarf a bit to reveal Alex's nose bleeding and looks moved. Gretel walks toward him, their faces close as she searches for his photograph. The window opens to reveal Anderson with another woman, and Gretel turns toward them. Gretel walks toward Anderson, and the other woman walks forward and takes her perch, with Anderson, Marie, Gretel, and others around. Anderson lights a candle, and Gretel looks at him and nods, then turns back as Gretel leaves. Gretel takes her place on the stool beside Alex, who begins to laugh under the scarf. Gretel takes out a candle, lights it, and lifts up Alex's scarf so he can smoke while Gretel watches him puff the candle, the scarf just above his chin, and then Alex coughs but keeps the candle in his chin. Gretel gently takes the candle from his chin, remaining silent with wet eyes as the outhouse is covered in fog. Anderson opens the cabin window and clicks the chamber of his crossbow while Gretel has a crossbow in her hand. Gretel takes Alex, with his hands tied behind his back, by the ankle, and Alex rises as Gretel leads him through the window past Anderson. Gretel turns with sudden fierceness and pulls Alex through the gardens, pushing him through a clump of bushes with the crossbow at his back, and then pulls the scarf off. Alex looks around him with a bruised chin from where Marie struck him and is prodded on by Gretel with the crossbow; Alex stumbles forward while Gretel is cold and businesslike. Alex suddenly sprints, loosens the ties on his hands, frees them, and runs off like a fox, causing Gretel to scream in fury after him, aim, change her mind, and run. Gretel gains on him, stretches her arm out, but Alex sprints ahead again as if playing with her, laughing in exhilaration as Gretel pants behind him, wheezing and almost laughing."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Gertrude ambles with a violin and some artwork, where Lancelot is reclining lackadaisically, and Lancelot nods his head twice and squints hard at her before standing and nudging Gertrude into the garden. Lancelot then wanders back to the mansion where Sam is lounging with the mask on again as Gertrude strides in without uttering a word. Gertrude grabs a book, brings it toward Sam, lifts up Sam's mask to reveal his eyes, and begins to entertain him, saying nothing and nodding her head before entertaining herself and then entertaining more to Sam. Sam giggles under his mask as Gertrude saunters toward him and removes the mask, causing Sam to grin up at her and Gertrude to giggle. He puts the mask down over him and flicks him with a wand, after which Gertrude lifts the mask a bit to show Sam's eyes brimming and looks touched. Gertrude saunters toward him, their faces close as she searches for his painting. The window opens to reveal Lancelot with another woman, and Gertrude turns toward them. Gertrude saunters toward Lancelot, and the other woman steps forward and takes her spot, with Lancelot, Mary, Gertrude, and others nearby. Lancelot starts a fire, and Gertrude glances at him and nods, then turns back as Gertrude departs. Gertrude takes her position in the hammock beside Sam, who starts to chuckle under the mask. Gertrude plucks out a leaf, ignites it, and lifts up Sam's mask so he can inhale while Gertrude observes him puff the leaf, the mask just above his nose, and then Sam snickers but keeps the leaf in his nostrils. Gertrude softly plucks the leaf from his nose, staying silent with teary eyes as the mansion is shrouded in fog. Lancelot pries open the cellar door and spins the wheel of his cart while Gertrude has a cart in her grip. Gertrude takes Sam, with his hands locked behind his back, by the shoulder, and Sam rises as Gertrude guides him through the window past Lancelot. Gertrude pivots with sudden intensity and guides Sam through the orchards, steering him through a grove of bushes with the cart at his side, and then pulls the mask off. Sam glances around him with a bruised cheek from where Mary tapped him and is urged on by Gertrude with the cart; Sam teeters forward while Gertrude is stern and methodical. Sam suddenly dashes, loosens the straps on his hands, releases them, and bolts off like a deer, causing Gertrude to shout in rage after him, point, reconsider, and chase. Gertrude closes in on him, reaches her hand out, but Sam dashes ahead again as if teasing her, laughing in delight as Gertrude gasps behind him, wheezing and nearly chuckling."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Fergus arrives with a basket and some dinner, where Maguire is sitting quietly, and Maguire turns his head three times and glances softly at him before leaping and pushing Fergus through the window. Maguire then returns to the barn where Jody is lounging with the mask on again as Fergus arrives without uttering a sound. Fergus grabs a bowl, carries it toward Jody, pulls up Jody's mask to uncover his chin, and starts to water him, remaining silent and nodding before watering himself and then watering more to Jody. Jody giggles under his mask as Fergus approaches him and yanks off the mask, prompting Jody to grin at him and Fergus to chuckle. She pulls the mask down over him and taps him with a broom, after which Fergus lifts the mask a bit to show Jody's nose bleeding and appears moved. Fergus approaches him, their noses close as he searches for her drawing. The window opens to reveal Maguire with another woman, and Fergus turns toward them. Fergus approaches Maguire, and the other woman moves forward and takes her spot, with Maguire, Jude, Fergus, and others around. Maguire strikes a match, and Fergus glances at him and winks, then turns back as Fergus departs. Fergus settles in the stool beside Jody, who begins to snicker under the mask. Fergus pulls out a match, strikes it, and lifts Jody's mask so he can laugh while Fergus observes him puff the match, the mask just above his chin, and then Jody sneezes but keeps the match near his chin. Fergus softly takes the match from his chin, staying silent with dry eyes as the meadow is shrouded in fog. Maguire opens the stable door and snaps the thread of his bow while Fergus has a bow in his grasp. Fergus takes Jody, with his arms tied behind his neck, by the shoulder, and Jody leaps as Fergus guides him through the window past Maguire. Fergus turns with sudden gentleness and pushes Jody across the fields, dragging him through a grove of bushes with the bow at his side, and then pulls the mask off. Jody glances around him with a bruised chin from where Jude tapped him and is nudged on by Fergus with the bow; Jody trips forward while Fergus is warm and casual. Jody suddenly hops, loosens the knots on his arms, unfrees them, and skips off like a squirrel, causing Fergus to shout in delight after him, point, change his thought, and skip. Fergus gains on him, stretches his hand out, but Jody skips ahead again as if dancing with him, laughing in freedom as Fergus hops behind him, gasping and almost chuckling."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Barney stumbles with a balloon and some soup, where Hector is standing upside-down, and Hector tosses his cape twice and glances loudly at him before skipping and cartwheeling Barney under the arch. Hector then dances back to the barn where Ruby is standing with the hat on again as Barney stumbles without whispering anything. Barney grabs a spoon, hurls it toward Ruby, tugs up Ruby's hat to cover her ear, and starts to paint her, saying nothing and tossing his cape before painting himself and then painting more on Ruby. Ruby snorts under her hat as Barney skips toward her and flicks off the hat, causing Ruby to grin down at him and Barney to giggle. He flicks the hat up over her and jabs her with a broom, after which Barney tugs the hat a bit to reveal Ruby's ear shining and glances startled. Barney skips toward her, their feet far as he rummages for his ticket. The window closes to cover Hector with another woman, and Barney twists toward them. Barney skips toward Hector, and the other woman skips backward and leaps his bush, with Hector, Clara, Barney, and others upside-down. Hector shakes a trumpet, and Barney glances at him and winks, then twists back as Barney skips. Barney leaps his bush in the swamp beside Ruby, who starts to giggle under the hat. Barney plucks out a trumpet, shakes it, and flicks up Ruby's hat so she can juggle while Barney watches her toss the trumpet, the hat just below her chin, and then Ruby sneezes but keeps the trumpet in her chin. Barney swiftly plucks the trumpet from her chin, staying loud with dry knees as the tower is covered in fog. Hector closes the library window and drums the fish of his violin while Barney has a violin in his palm. Barney juggles Ruby, with her knees tied behind her chest, by the nose, and Ruby skips as Barney pulls her through the window past Hector. Barney twists with sudden gentleness and juggles Ruby through the barns, dragging her through a patch of bushes with the violin at her chest, and then juggles the hat on. Ruby jumps around her with a shiny toe from where Clara poked her and is tugged on by Barney with the violin; Ruby trips backward while Barney is warm and playful. Ruby suddenly strolls, tightens the knots on her knees, loosens them, and strolls off like a squirrel, causing Barney to sob in delight after her, drum, swap his tune, and stroll. Barney stumbles on her, stretches his nose out, but Ruby strolls backward again as if dancing with her, grinning in celebration as Barney whispers behind her, singing and quietly grinning."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Fergus brings breakfast to Maguire, who silently signals him to leave. Fergus returns to Jody, lifting his hood to feed him. Jody laughs when Fergus removes his hood, but after a playful exchange, Fergus accidentally causes Jody's mouth to bleed. They share a moment of silent connection while smoking a cigarette as mist envelops the farmhouse. Maguire, with a gun, arrives with another man. Fergus leads a tied Jody outside, walking through fields, until he suddenly frees himself and runs. Fergus, initially furious, chases Jody, who laughs and sprints ahead despite bleeding, with Fergus almost joining in the laughter amid the pursuit."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Fergus gains on him stretches his arm out but Jody sprints ahead again as if playing with him laughing in exhilaration as Fergus pants behind him wheezing and almost laughing Jody suddenly sprints loosens the ties on his hands frees them and runs off like a hare causing Fergus to scream in fury after him aim change his mind and run Jody stumbles forward while Fergus is cold and businesslike Jody looks around him with a cut lip from where Jude struck him and is prodded on by Fergus with the gun Fergus turns with sudden fierceness and pulls Jody through the fields pushing him through a copse of trees with the gun at his back and then pulls the hood off Fergus takes Jody with his hands tied behind his back by the elbow and Jody rises as Fergus leads him through the door past Maguire Maguire opens the greenhouse door and clicks the chamber of his gun while Fergus has a gun in his hand Fergus gently takes the cigarette from his mouth remaining silent with wet eyes as the farmhouse is covered in mist Fergus takes out a cigarette lights it and lifts up Jody's hood so he can smoke while Fergus watches him puff the cigarette the hood just above his lips and then Jody coughs but keeps the cigarette in his lips Fergus takes his place in the chair beside Jody who begins to laugh under the hood then turns back as Fergus leaves Maguire lights a cigarette and Fergus looks at him and nods Jude Fergus and others around Fergus walks toward Maguire and the other man walks forward and takes his seat with Maguire The door opens to reveal Maguire with another man and Fergus turns toward them Fergus walks toward him their faces close as he searches for her picture She pulls the hood down over him and whacks him with a pistol after which Fergus lifts the hood a bit to reveal Jody's mouth bleeding and looks moved Jody chuckles under his hood as Fergus walks toward him and pulls off the hood causing Jody to smile up at him and Fergus to laugh Maguire then goes back to the house where Jody is sitting with the hood on again as Fergus enters without saying anything Fergus takes a plate brings it toward Jody lifts up Jody's hood to expose his mouth and begins to feed him saying nothing and shaking his head before feeding himself and then feeding more to Jody Fergus enters with a tray and some breakfast where Maguire is sitting stockstill and Maguire shakes his head twice and looks hard at him before rising and dragging Fergus out the door"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Fergus gains on him stretches his arm out but Jody sprints ahead again as if playing with him laughing in exhilaration as Fergus pants behind him wheezing and almost laughing The door opens to reveal Maguire with another man and Fergus turns toward them Fergus takes Jody with his hands tied behind his back by the elbow and Jody rises as Fergus leads him through the door past Maguire Fergus walks toward him their faces close as he searches for her picture then turns back as Fergus leaves Maguire opens the greenhouse door and clicks the chamber of his gun while Fergus has a gun in his hand Fergus turns with sudden fierceness and pulls Jody through the fields pushing him through a copse of trees with the gun at his back and then pulls the hood off Jody suddenly sprints loosens the ties on his hands frees them and runs off like a hare causing Fergus to scream in fury after him aim change his mind and run Fergus walks toward Maguire and the other man walks forward and takes his seat with Maguire Fergus gently takes the cigarette from his mouth remaining silent with wet eyes as the farmhouse is covered in mist Jody stumbles forward while Fergus is cold and businesslike Fergus takes his place in the chair beside Jody who begins to laugh under the hood Maguire then goes back to the house where Jody is sitting with the hood on again as Fergus enters without saying anything Fergus takes a plate brings it toward Jody lifts up Jody's hood to expose his mouth and begins to feed him saying nothing and shaking his head before feeding himself and then feeding more to Jody Fergus takes out a cigarette lights it and lifts up Jody's hood so he can smoke while Fergus watches him puff the cigarette the hood just above his lips and then Jody coughs but keeps the cigarette in his lips Jody chuckles under his hood as Fergus walks toward him and pulls off the hood causing Jody to smile up at him and Fergus to laugh Jody looks around him with a cut lip from where Jude struck him and is prodded on by Fergus with the gun Jude Fergus and others around Maguire lights a cigarette and Fergus looks at him and nods Fergus enters with a tray and some breakfast where Maguire is sitting stockstill and Maguire shakes his head twice and looks hard at him before rising and dragging Fergus out the door She pulls the hood down over him and whacks him with a pistol after which Fergus lifts the hood a bit to reveal Jody's mouth bleeding and looks moved"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Fergus takes his place in the chair beside Jody who begins to laugh under the hood Fergus takes out a cigarette lights it and lifts up Jody's hood so he can smoke while Fergus watches him puff the cigarette the hood just above his lips and then Jody coughs but keeps the cigarette in his lips Fergus gently takes the cigarette from his mouth remaining silent with wet eyes as the farmhouse is covered in mist Maguire opens the greenhouse door and clicks the chamber of his gun while Fergus has a gun in his hand Fergus takes Jody with his hands tied behind his back by the elbow and Jody rises as Fergus leads him through the door past Maguire Fergus turns with sudden fierceness and pulls Jody through the fields pushing him through a copse of trees with the gun at his back and then pulls the hood off Jody looks around him with a cut lip from where Jude struck him and is prodded on by Fergus with the gun Jody stumbles forward while Fergus is cold and businesslike Jody suddenly sprints loosens the ties on his hands frees them and runs off like a hare causing Fergus to scream in fury after him aim change his mind and run Fergus gains on him stretches his arm out but Jody sprints ahead again as if playing with him laughing in exhilaration as Fergus pants behind him wheezing and almost laughing Fergus enters with a tray and some breakfast where Maguire is sitting stockstill and Maguire shakes his head twice and looks hard at him before rising and dragging Fergus out the door Maguire then goes back to the house where Jody is sitting with the hood on again as Fergus enters without saying anything Fergus takes a plate brings it toward Jody lifts up Jody's hood to expose his mouth and begins to feed him saying nothing and shaking his head before feeding himself and then feeding more to Jody Jody chuckles under his hood as Fergus walks toward him and pulls off the hood causing Jody to smile up at him and Fergus to laugh She pulls the hood down over him and whacks him with a pistol after which Fergus lifts the hood a bit to reveal Jody's mouth bleeding and looks moved Fergus walks toward him their faces close as he searches for her picture The door opens to reveal Maguire with another man and Fergus turns toward them Fergus walks toward Maguire and the other man walks forward and takes his seat with Maguire Jude Fergus and others around Maguire lights a cigarette and Fergus looks at him and nods then turns back as Fergus leaves"
        }
      ]
    }
  ]
}