{
  "ground_truth": "He looks out the gap where the window should be and sees Dil in the lift. She passes by a gap in the wall and blows a kiss at him. Fergus walks out of the room and around the scaffolding. Dil sees him and waves, sits on some bricks, opens the hamper, and takes out a thermos to pour him some tea. Fergus smiles in spite of himself. She lowers her head, and he removes her glasses to look at her moist eyes. Fergus stands up suddenly, and Deveroux stares, suddenly chilled. Fergus looks down to Dil and holds out his arm. Dil gathers up her things and takes it, her face wreathed in a smile. Fergus walks her down the scaffolding ramp, and they descend from the site in the lift, which stops with a thud. She leans forward and kisses him. Fergus hears a wail of catcalls behind him and watches Dil go as the lift takes him back up to the site. Fergus stands outside the hair salon, as Dil, inside, throws off her smock and walks toward him with all the girls smiling. Fergus looks from Dil to the girls as they approach, and she takes his arm as they walk off. Fergus hears a car following them and turns around to look. They reach her door, and the car stops. Fergus kisses her and looks at her open lips as if in disbelief at himself. She goes inside, and Fergus walks into the room, turning on a small desk-light. Then he hears a voice and sees Jude sitting in the corner with her hair now dark brown. He stares at her, says nothing as she walks around the room, lies down on the bed beside him, takes off a black leather glove, and puts her hand on his crotch. He takes her hand away, and she looks at him hard. He leaps up from the bed, and she brings her lips close to his so they touch. He grabs her hair and pulls her head back, but she pulls a gun and sticks it between his teeth. Fergus stares at her, then says quietly. She kisses him briefly with the gun at his temple and then goes, leaving Fergus standing in the darkness. Fergus, walking toward the hair salon with flowers in his hand, stands outside watching with the flowers behind his back. Then the chair turns, and we see it is Jude. Fergus freezes, seeing Jude looking at him, smiling brightly, then talking back to Dil. Jude, turning in the chair, smiles brightly at something behind Fergus. He turns and sees Jude is there. Fergus stands suddenly, throws some money on the table, grabs her arm, and frog-marches her out.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He gazes out the aperture where the pane ought to be and observes Dil in the elevator. She moves by an opening in the partition and sends a peck at him. Fergus strides out of the chamber and around the scaffolding. Dil notices him and gestures, sits on some stones, opens the basket, and extracts a flask to serve him some brew. Fergus grins despite himself. She lowers her head, and he removes her spectacles to view her damp eyes. Fergus stands abruptly, and Deveroux gawks, suddenly chilled. Fergus glances down to Dil and extends his limb. Dil collects her belongings and takes it, her face adorned in a grin. Fergus escorts her down the scaffolding slope, and they descend from the location in the elevator, which halts with a thud. She leans forward and kisses him. Fergus hears a wail of whistles behind him and observes Dil depart as the elevator carries him back up to the site. Fergus stands outside the hair salon, as Dil, within, sheds her smock and strides toward him with all the girls beaming. Fergus glances from Dil to the girls as they approach, and she takes his arm as they wander off. Fergus hears an automobile following them and pivots to look. They arrive at her entrance, and the automobile halts. Fergus kisses her and gazes at her ajar lips as though in disbelief at himself. She goes inside, and Fergus enters the chamber, switching on a small desk-light. Then he hears a voice and sees Jude sitting in the corner with her hair now dark brown. He gawks at her, says nothing as she strolls around the chamber, reclines on the bed beside him, removes a black leather glove, and places her hand on his crotch. He takes her hand away, and she gazes at him intently. He leaps up from the bed, and she brings her lips close to his so they touch. He seizes her hair and pulls her head back, but she pulls a firearm and presses it between his teeth. Fergus gawks at her, then says softly. She kisses him briefly with the firearm at his temple and then goes, leaving Fergus standing in the darkness. Fergus, walking toward the hair salon with blossoms in his hand, stands outside watching with the blossoms behind his back. Then the chair spins, and we see it is Jude. Fergus freezes, seeing Jude observing him, smiling brightly, then conversing back to Dil. Jude, turning in the chair, smiles brightly at something behind Fergus. He pivots and sees Jude is there. Fergus stands abruptly, throws some currency on the table, seizes her arm, and frog-marches her out."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He looks out the gap where the window should be and Dil is seen by him in the lift. A gap in the wall is passed by her and a kiss is blown at him by her. The room is walked out of by Fergus and the scaffolding is walked around. He is seen by Dil, who waves, sits on some bricks, opens the hamper, and pours him some tea with a thermos. A smile is formed by Fergus in spite of himself. Her head is lowered, and her glasses are removed by him to look at her moist eyes. Fergus stands up suddenly, and a chill stares Deveroux as he watches. Down to Dil looks Fergus and his arm is held out. Her things are gathered up by Dil and his arm is taken by her, her face wreathed in a smile. Down the scaffolding ramp, she is walked by Fergus, and they are descended from the site in the lift, which thuds to a stop. Forward she leans, and he is kissed by her. A wail of catcalls is heard by Fergus behind him and Dil is watched by him as the lift takes him back up to the site. Outside the hair salon stands Fergus, Dil, inside, throws off her smock and toward him she walks, all the girls smiling. As they approach, Dil is looked at from the girls by Fergus, and his arm is taken by her as they walk off. A car following them is heard by Fergus and he turns around to look. Her door is reached by them, and the car stops. She is kissed by Fergus and her open lips are looked at by him as if in disbelief at himself. Inside she goes, and the room is walked into by Fergus, and a small desk-light is turned on. A voice is then heard by him and Jude is seen by him sitting in the corner with her hair now dark brown. At her, he stares, nothing is said as the room is walked around by her, the bed is laid down on beside him, a black leather glove is taken off, and her hand is put on his crotch. Her hand is taken away by him, and at him, she looks hard. From the bed, he leaps up, and her lips are brought close to his by her so they touch. Her hair is grabbed by him and her head is pulled back, but a gun is pulled by her and stuck between his teeth. At her, Fergus stares, then he quietly speaks. Briefly, she kisses him with the gun at his temple and then goes, Fergus left standing in the darkness. With flowers in his hand, Fergus walks toward the hair salon, standing outside watching with the flowers behind his back. Then the chair turns, and Jude is seen by us. Fergus freezes, seeing Jude looking at him, smiling brightly, then talking back to Dil. Something behind Fergus is smiled at brightly by Jude, turning in the chair. He turns and sees Jude is there. Fergus stands suddenly, some money is thrown on the table by him, her arm is grabbed, and she is frog-marched out."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Fergus looks out the window gap and sees Dil in the lift. She passes a wall gap, blows a kiss, and waves. Fergus exits, and Dil sits on bricks, opens a hamper, and pours tea. Fergus smiles despite himself. He removes her glasses to see her moist eyes. Fergus stands abruptly, and Deveroux is chilled. Fergus extends his arm to Dil, who smiles and takes it. They descend the scaffolding ramp in the lift, which stops with a thud. She kisses him, and Fergus hears catcalls as the lift returns him to the site. Outside the hair salon, Dil throws off her smock, and they walk off arm in arm. Fergus notices a car following them. At her door, the car stops, and Fergus kisses her, surprised at himself. She enters, and Fergus turns on a desk light, hearing Jude's voice. Jude, now with dark brown hair, lies beside him, removes a glove, and touches him. He removes her hand, and she looks hard at him. He jumps up, and she pulls a gun, pressing it to his teeth. Fergus stares, then speaks quietly. She kisses him briefly with the gun at his temple and leaves. Later, Fergus stands outside the salon with flowers, hiding them behind his back. The chair turns, revealing Jude, who smiles at him and talks to Dil. Fergus freezes, then grabs Jude's arm and escorts her out."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He looks out where the window should be and sees Dil in the lift. She passes a gap, blows a kiss. Fergus exits, walks around scaffolding. Dil waves, sits on bricks, opens a hamper, pours tea. Fergus smiles. She lowers her head, he removes her glasses to see her moist eyes. Fergus stands, Deveroux stares, chilled. Fergus holds out his arm, Dil gathers her things, smiling. They descend the scaffolding ramp in the lift, which stops with a thud. She kisses him. Fergus hears catcalls, watches Dil go as the lift takes him back up. Fergus stands outside the hair salon, Dil throws off her smock, approaches with smiling girls. She takes his arm, they walk off. Fergus hears a car, turns. They reach her door, car stops. Fergus kisses her, looks at her open lips, disbelieving. She goes inside, Fergus enters a room, turns on a desk-light. He hears a voice, sees Jude with dark hair. He stares, silent, as she lies beside him, removes a glove, touches him. He removes her hand, she looks hard. He leaps up, she touches his lips, he pulls her hair, she pulls a gun, sticks it in his mouth. Fergus stares, speaks quietly. She kisses him with the gun at his temple, leaves him in darkness. Fergus, with flowers, stands outside the salon. The chair turns, it's Jude. Fergus freezes, sees Jude smiling, talking to Dil. Jude smiles at something behind Fergus. He turns, sees Jude. Fergus stands, throws money, grabs her arm, marches her out."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He gazes out through the gap where the window should be, and his eyes catch sight of Dil in the lift. As she passes by another gap in the wall, she playfully blows a kiss in his direction. Fergus then exits the room and makes his way around the scaffolding. Dil notices him, waves cheerfully, and then sits down on some bricks. She opens the hamper she has with her and takes out a thermos, pouring him a warm cup of tea. Despite himself, Fergus can't help but smile. She lowers her head slightly, and he gently removes her glasses to look into her moist eyes. Suddenly, Fergus stands up, and Deveroux, observing the scene, feels a sudden chill. Fergus looks down at Dil and extends his arm toward her. With a smile spreading across her face, Dil gathers her belongings and takes his offered arm. Together, they walk down the scaffolding ramp, descending from the construction site in the lift, which comes to a stop with a noticeable thud. She leans forward and kisses him tenderly. Fergus hears a chorus of catcalls behind him and watches as Dil departs while the lift carries him back up to the site. \n\nFergus finds himself standing outside the hair salon, observing as Dil, inside, removes her smock and walks toward him, accompanied by the smiles of all the girls around her. Fergus glances from Dil to the girls as they approach, and she takes his arm as they walk away together. As they proceed, Fergus becomes aware of a car following them and turns around to look. They arrive at her door, and the car comes to a halt. Fergus kisses her, gazing at her open lips as if he can't quite believe his own actions. She goes inside, and Fergus enters the room, turning on a small desk-light. Suddenly, he hears a voice and sees Jude sitting in the corner, her hair now a dark brown. He stares at her, remaining silent as she moves around the room, lies down on the bed beside him, removes a black leather glove, and places her hand on his crotch. He takes her hand away, and she looks at him intently. He leaps up from the bed, and she brings her lips close to his, so they touch. He grabs her hair and pulls her head back, but she quickly pulls out a gun and presses it between his teeth. Fergus stares at her, then speaks quietly. She kisses him briefly with the gun at his temple and then leaves, leaving Fergus standing alone in the darkness.\n\nLater, Fergus walks toward the hair salon, holding flowers in his hand, and stands outside, watching with the flowers hidden behind his back. The chair inside turns, revealing Jude. Fergus freezes, seeing Jude looking at him with a bright smile, then turning to talk to Dil. Jude, still in the chair, smiles brightly at something behind Fergus. He turns and sees Jude is there. Fergus stands abruptly, throws some money on the table, grabs her arm, and forcefully escorts her out."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He finds himself gazing out through the empty space where the window should be, his eyes catching sight of Dil as she makes her way up in the elevator. As she moves past another gap in the wall, she playfully sends a kiss in his direction with a flourish. Fergus then decides to leave the room and carefully navigates his way around the maze of scaffolding. Dil notices him, waves with a cheerful enthusiasm, and then settles down on a collection of bricks. She opens up the picnic hamper she has brought along with her, thoughtfully pouring him a steaming cup of tea from the thermos. Despite himself, Fergus can't help but break into a smile. She lowers her head slightly, and he gently removes her glasses to look deeply into her slightly moist eyes. All of a sudden, Fergus stands up, and Deveroux, who has been watching the scene unfold, experiences a sudden chill run through him. Fergus looks down at Dil and extends his arm in her direction. A smile quickly spreads across her face as she gathers her belongings and takes his offered arm with trust. Together, they make their way down the scaffolding ramp, descending from the construction site using the lift, which comes to a stop with a distinct and noticeable thud. She leans forward and kisses him with tender affection. Fergus hears a chorus of catcalls echoing behind him and watches as Dil departs, while the lift carries him back up to the site where his thoughts linger.\n\nFergus soon finds himself standing outside the hair salon, observing intently as Dil, having removed her smock inside, walks toward him, surrounded by the smiles of all the girls around her. Fergus glances from Dil to the smiling girls as they approach together, and she linking arms with him. As they move along, Fergus becomes increasingly aware of the ominous presence of a car following them. He turns around to take a look but continues on. They finally arrive at her doorstep, and the car comes to a halt at that precise moment. Fergus kisses her with intent, gazing at her open lips as if he can't quite believe his own actions in that moment. She enters inside, and Fergus follows her, turning on a small desk-light to illuminate the room. Suddenly, he hears a voice and notices Jude sitting unobtrusively in the corner, her hair now dyed a dark brown. He stares at her, maintaining silence as she moves about the room, lies down beside him on the bed, removes a black leather glove with deliberate slowness, and places her hand provocatively on his crotch. Fergus gently takes her hand away, and she gazes at him with intensity. He abruptly leaps up from the bed, and she leans close, bringing her lips so near to his that they touch. In a sudden motion, he grabs her hair and pulls her head back. Quick as a flash, she pulls out a gun, pressing it alarmingly between his teeth. Fergus looks at her and then speaks in a quiet tone. She kisses him fleetingly, with the gun still at his temple, and then she leaves as suddenly as she came, leaving Fergus standing in the dim darkness alone.\n\nLater on, Fergus makes his way toward the hair salon, holding a bunch of flowers carefully in his hand, standing outside with the flowers hidden thoughtfully behind his back. The chair inside shifts, turning to reveal Jude. Fergus freezes on the spot, seeing Jude looking at him with a bright smile across her face, before she turns to engage in conversation with Dil. Jude, still seated in the chair, smiles brightly at something catching her attention behind Fergus. He turns quickly and sees Jude there once more. Fergus stands abruptly, throws some money hastily on the table, grabs her arm with determination, and escorts her forcefully out."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He gazes out through the gap where the window should be, his eyes catching sight of Dil in the lift. As she moves past a gap in the wall, she playfully blows a kiss in his direction. With a sense of purpose, Fergus exits the room and navigates around the scaffolding. Dil notices him, waves cheerfully, and then settles herself on a pile of bricks. She opens a hamper, retrieves a thermos, and begins to pour him some tea. Despite himself, Fergus can't help but smile. She lowers her head slightly, prompting him to gently remove her glasses to reveal her moist eyes. Suddenly, Fergus stands up, and Deveroux, observing the scene, feels a sudden chill. Fergus looks down at Dil, extending his arm toward her. With a smile spreading across her face, Dil gathers her belongings and takes his arm. Together, they walk down the scaffolding ramp, descending from the site in the lift, which halts with a noticeable thud. Leaning forward, she kisses him, and Fergus hears a chorus of catcalls from behind. He watches as Dil departs, the lift carrying him back up to the site. Standing outside the hair salon, Fergus observes as Dil, inside, removes her smock and approaches him, accompanied by the smiles of all the girls. As they draw near, Fergus shifts his gaze between Dil and the girls, and she takes his arm as they walk away together. A car follows them, prompting Fergus to turn and look. Upon reaching her door, the car comes to a stop. Fergus kisses her, momentarily lost in disbelief at his own actions as he gazes at her open lips. She steps inside, and Fergus enters the room, switching on a small desk-light. A voice catches his attention, and he sees Jude sitting in the corner, her hair now a dark brown. He stares silently as she moves around the room, lies down beside him on the bed, removes a black leather glove, and places her hand on his crotch. He gently removes her hand, and she fixes him with a hard look. He leaps up from the bed, and she brings her lips close to his, allowing them to touch. He grabs her hair, pulling her head back, but she swiftly draws a gun, pressing it between his teeth. Fergus stares at her, speaking quietly. She kisses him briefly, the gun still at his temple, and then departs, leaving Fergus standing alone in the darkness. Later, Fergus approaches the hair salon, flowers in hand, and stands outside, concealing the flowers behind his back. The chair inside turns, revealing Jude, and Fergus freezes, taken aback by Jude's bright smile as she converses with Dil. Jude, turning in the chair, smiles brightly at something behind Fergus. He turns to see Jude there, and with sudden resolve, he stands, throws some money on the table, grabs her arm, and forcefully escorts her out."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Fergus looks out through the gap where the window should be and sees Dil in the lift. As she passes by a gap in the wall, she blows him a kiss. He exits the room, navigates the scaffolding, and approaches Dil, who waves, sits on some bricks, and pours him tea from a thermos. Despite himself, Fergus smiles. He removes her glasses to see her moist eyes, then suddenly stands, catching Deveroux's attention. Fergus extends his arm to Dil, who gathers her things and takes it, smiling. They descend the scaffolding ramp and take the lift down, where she leans forward to kiss him. Fergus hears catcalls behind him as the lift returns him to the site, and he watches Dil leave.\n\nOutside the hair salon, Fergus sees Dil throw off her smock and walk toward him, accompanied by smiling girls. As they walk off together, Fergus notices a car following them. They reach her door, and the car stops. He kisses her, then watches her go inside before entering a room and turning on a desk light. He hears a voice and sees Jude, now with dark brown hair, sitting in the corner. She lies beside him, removes a glove, and places her hand on his crotch. He removes her hand, and she looks at him intently. He jumps up, and she brings her lips close, but he pulls her hair back. Jude then pulls a gun, pressing it between his teeth. Fergus stares at her and speaks quietly. She kisses him briefly with the gun at his temple before leaving him in darkness.\n\nLater, Fergus approaches the hair salon with flowers, hiding them behind his back as he watches. The chair turns, revealing Jude, who smiles brightly at him and talks to Dil. Jude turns in the chair, smiling at something behind Fergus. He turns, sees Jude, and suddenly stands, throws money on the table, grabs her arm, and escorts her out."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He looks out the gap where the window should be in the unfinished building set against the skyline of a bustling city and sees Dil in the lift, an old freight elevator repurposed for construction site use. She passes by a gap in the wall and blows a kiss at him, a gesture reminiscent of classic romantic films. Fergus walks out of the room and around the scaffolding, a temporary structure of metal poles and wood boards designed for workers. Dil sees him and waves, sits on some bricks left from late-night construction work, opens the hamper like the kind used for charming picnics in the countryside, and takes out a thermos to pour him some tea, a comforting ritual passed down through British culture. Fergus smiles in spite of himself, charmed by the simplicity of the moment. She lowers her head, and he removes her glasses, delicate frames that softened her gaze, to look at her moist eyes filled with unspoken words. Fergus stands up suddenly, and Deveroux, a figure associated with their past indiscretions, stares, suddenly chilled by the unexpected development. Fergus looks down to Dil and holds out his arm, a gentlemanly invitation. Dil gathers up her things with the air of someone used to quick departures and takes it, her face wreathed in a smile that seemed as if she’d won a small victory. Fergus walks her down the scaffolding ramp, and they descend from the site in the lift, which stops with a thud characteristic of its overuse. She leans forward and kisses him, a moment that felt suspended in time. Fergus hears a wail of catcalls, a common occurrence among construction workers, behind him and watches Dil go as the lift takes him back up to the site. Fergus stands outside the hair salon, a local favorite for its trendy styles, as Dil, inside, throws off her smock to reveal a stylish dress and walks toward him with all the girls smiling, camaraderie evident in their eyes. Fergus looks from Dil to the girls as they approach, and she takes his arm with the confidence of someone who knew her place in the world as they walk off. Fergus hears a car, its engine rumbling ominously, following them and turns around to look. They reach her door, an entrance adorned with blooming flowers, and the car stops, giving it an air of foreboding. Fergus kisses her and looks at her open lips, as if in disbelief at himself, aware of the invisible line he might have crossed. She goes inside, and Fergus walks into the room, turning on a small desk-light, a beacon of warmth in the otherwise dim space. Then he hears a voice and sees Jude sitting in the corner with her hair now dark brown, a drastic change symbolizing her desire to escape the past. He stares at her, says nothing as she walks around the room, lies down on the bed beside him, takes off a black leather glove, reminiscent of a femme fatale from noir films, and puts her hand on his crotch, a forward gesture that defied the tension in the air. He takes her hand away, and she looks at him hard, challenging him silently. He leaps up from the bed, and she brings her lips close to his so they touch, a clash of wills as much as a physical act. He grabs her hair and pulls her head back, but she pulls a gun, a small but deadly weapon, and sticks it between his teeth. Fergus stares at her, then says quietly, an acknowledgment of past alliances gone awry. She kisses him briefly with the gun at his temple and then goes, leaving Fergus standing in the darkness, a silence that echoed the decisions yet to be made. Fergus, walking toward the hair salon with flowers in his hand, a peace offering or perhaps a symbol of new beginnings, stands outside watching with the flowers behind his back. Then the chair turns, and we see it is Jude, her presence as unsettling as a thunderstorm on a clear day. Fergus freezes, seeing Jude looking at him, smiling brightly, a facade masking her true intentions, then talking back to Dil. Jude, turning in the chair, smiles brightly at something behind Fergus, a smile that could cut through the tension like a knife. He turns and sees Jude is there, her presence seemingly everywhere. Fergus stands suddenly, throws some money on the table in a gesture of finality, grabs her arm, and frog-marches her out, an act of determination to confront the unresolved chaos they left behind."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He looks out the gap where the window should be and sees Dil in the lift  Dil sees him and waves sits on some bricks opens the hamper and takes out a thermos to pour him some tea  Fergus smiles in spite of himself  She lowers her head and he removes her glasses to look at her moist eyes  Fergus stands up suddenly and Deveroux stares suddenly chilled  Fergus looks down to Dil and holds out his arm  Dil gathers up her things and takes it her face wreathed in a smile  Fergus walks her down the scaffolding ramp and they descend from the site in the lift which stops with a thud  She leans forward and kisses him  Fergus hears a wail of catcalls behind him and watches Dil go as the lift takes him back up to the site  Fergus stands outside the hair salon as Dil inside throws off her smock and walks toward him with all the girls smiling  Fergus looks from Dil to the girls as they approach and she takes his arm as they walk off  Fergus hears a car following them and turns around to look  They reach her door and the car stops  Fergus kisses her and looks at her open lips as if in disbelief at himself  She goes inside and Fergus walks into the room turning on a small desklight  Then he hears a voice and sees Jude sitting in the corner with her hair now dark brown  She passes by a gap in the wall and blows a kiss at him  Fergus walks out of the room and around the scaffolding  Dil sees him and waves sits on some bricks opens the hamper and takes out a thermos to pour him some tea  Fergus smiles in spite of himself  She lowers her head and he removes her glasses to look at her moist eyes  Fergus stands up suddenly and Deveroux stares suddenly chilled  Fergus looks down to Dil and holds out his arm  Dil gathers up her things and takes it her face wreathed in a smile  Fergus walks her down the scaffolding ramp and they descend from the site in the lift which stops with a thud  She leans forward and kisses him  Fergus hears a wail of catcalls behind him and watches Dil go as the lift takes him back up to the site  Fergus stands outside the hair salon as Dil inside throws off her smock and walks toward him with all the girls smiling  Fergus looks from Dil to the girls as they approach and she takes his arm as they walk off  Fergus hears a car following them and turns around to look  They reach her door and the car stops  Fergus kisses her and looks at her open lips as if in disbelief at himself  She goes inside and Fergus walks into the room turning on a small desklight  Then he hears a voice and sees Jude sitting in the corner with her hair now dark brown  He stares at her says nothing as she walks around the room lies down on the bed beside him takes off a black leather glove and puts her hand on his crotch  He takes her hand away and she looks at him hard  He leaps up from the bed and she brings her lips close to his so they touch  He grabs her hair and pulls her head back but she pulls a gun and sticks it between his teeth  Fergus stares at her then says quietly  She kisses him briefly with the gun at his temple and then goes leaving Fergus standing in the darkness  Fergus walking toward the hair salon with flowers in his hand stands outside watching with the flowers behind his back  Then the chair turns and we see it is Jude  Fergus freezes seeing Jude looking at him smiling brightly then talking back to Dil  Jude turning in the chair smiles brightly at something behind Fergus  He turns and sees Jude is there  Fergus stands suddenly throws some money on the table grabs her arm and frogmarches her out"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He looks out the gap where the window should be and sees Dil in the lift. She passes by a gap in the wall and blows a kiss at him. Fergus walks out of the room and around the scaffolding. Dil sees him and waves sits on some bricks opens the hamper and takes out a thermos to pour him some tea. Fergus smiles in spite of himself. She lowers her head and he removes her glasses to look at her moist eyes. Fergus stands up suddenly and Deveroux stares suddenly chilled. Fergus looks down to Dil and holds out his arm. Dil gathers up her things and takes it her face wreathed in a smile. Fergus walks her down the scaffolding ramp and they descend from the site in the lift which stops with a thud. She leans forward and kisses him. Fergus hears a wail of catcalls behind him and watches Dil go as the lift takes him back up to the site. Fergus stands outside the hair salon as Dil inside throws off her smock and walks toward him with all the girls smiling. Fergus looks from Dil to the girls as they approach and she takes his arm as they walk off. Fergus hears a car following them and turns around to look. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. They reach her door and the car stops. Fergus kisses her and looks at her open lips as if in disbelief at himself. She goes inside and Fergus walks into the room turning on a small desklight. Then he hears a voice and sees Jude sitting in the corner with her hair now dark brown. He stares at her says nothing as she walks around the room lies down on the bed beside him takes off a black leather glove and puts her hand on his crotch. He takes her hand away and she looks at him hard. He leaps up from the bed and she brings her lips close to his so they touch. He grabs her hair and pulls her head back but she pulls a gun and sticks it between his teeth. Fergus stares at her then says quietly. She kisses him briefly with the gun at his temple and then goes leaving Fergus standing in the darkness. Fergus walking toward the hair salon with flowers in his hand stands outside watching with the flowers behind his back. Then the chair turns and we see it is Jude. Fergus freezes seeing Jude looking at him smiling brightly then talking back to Dil. Jude turning in the chair smiles brightly at something behind Fergus. He turns and sees Jude is there. Fergus stands suddenly throws some money on the table grabs her arm and frogmarches her out."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He looks out the gap where the window should be and sees Dil in the lift. She passes by a gap in the wall and blows a kiss at him. Fergus walks out of the room and around the scaffolding. Dil sees him and waves sits on some bricks opens the hamper and takes out a thermos to pour him some tea. Fergus smiles in spite of himself. She lowers her head and he removes her glasses to look at her moist eyes. Fergus stands up suddenly and Deveroux stares suddenly chilled. Fergus looks down to Dil and holds out his arm. Dil gathers up her things and takes it her face wreathed in a smile. Fergus walks her down the scaffolding ramp and they descend from the site in the lift which stops with a thud. She leans forward and kisses him. Fergus hears a wail of catcalls behind him and watches Dil go as the lift takes him back up to the site. Fergus stands outside the hair salon as Dil inside throws off her smock and walks toward him with all the girls smiling. Fergus looks from Dil to the girls as they approach and she takes his arm as they walk off. Fergus hears a car following them and turns around to look. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. They reach her door and the car stops. Fergus kisses her and looks at her open lips as if in disbelief at himself. She goes inside and Fergus walks into the room turning on a small desklight. Then he hears a voice and sees Jude sitting in the corner with her hair now dark brown. He stares at her says nothing as she walks around the room lies down on the bed beside him takes off a black leather glove and puts her hand on his crotch. He takes her hand away and she looks at him hard. He leaps up from the bed and she brings her lips close to his so they touch. He grabs her hair and pulls her head back but she pulls a gun and sticks it between his teeth. Fergus stares at her then says quietly. She kisses him briefly with the gun at his temple and then goes leaving Fergus standing in the darkness. Fergus walking toward the hair salon with flowers in his hand stands outside watching with the flowers behind his back. Then the chair turns and we see it is Jude. Fergus freezes seeing Jude looking at him smiling brightly then talking back to Dil. Jude turning in the chair smiles brightly at something behind Fergus. He turns and sees Jude is there. Fergus stands suddenly throws some money on the table grabs her arm and frogmarches her out."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He looks out the gap where the window should be and sees Dil in the lift. She passes by a gap in the wall and blows a kiss at him. Fergus walks out of the room and around the scaffolding. Dil sees him and waves sits on some bricks opens the hamper and takes out a thermos to pour him some tea. Fergus smiles in spite of himself. She lowers her head and he removes her glasses to look at her moist eyes. Fergus stands up suddenly and Deveroux stares suddenly chilled. Fergus looks down to Dil and holds out his arm. Fergus stares at her then says quietly. She kisses him briefly with the gun at his temple and then goes leaving Fergus standing in the darkness. Fergus walking toward the hair salon with flowers in his hand stands outside watching with the flowers behind his back. Then the chair turns and we see it is Jude. Fergus freezes seeing Jude looking at him smiling brightly then talking back to Dil. Jude turning in the chair smiles brightly at something behind Fergus. He turns and sees Jude is there. Fergus stands suddenly throws some money on the table grabs her arm and frogmarches her out."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He looks out the gap where the window should be and sees Dil in the lift. She passes by a gap in the wall and blows a kiss at him. Fergus walks out of the room and around the scaffolding. Fergus freezes seeing Jude looking at him smiling brightly then talking back to Dil. Jude turning in the chair smiles brightly at something behind Fergus. He turns and sees Jude is there. Fergus stands suddenly throws some money on the table grabs her arm and frogmarches her out."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dog looks out the gap where the window should be and sees the lion in the lift. The rabbit passes by a gap in the wall and blows a kiss at the dog. The penguin walks out of the room and around the scaffolding. The lion sees the penguin and waves, sits on some bricks, opens the hamper, and takes out a thermos to pour the penguin some tea. The penguin smiles in spite of itself. The rabbit lowers its head, and the penguin removes the rabbit's glasses to look at its moist eyes. The penguin stands up suddenly, and the squirrel stares, suddenly chilled. The penguin looks down to the lion and holds out its arm. The lion gathers up its things and takes it, its face wreathed in a smile. The penguin walks the lion down the scaffolding ramp, and they descend from the site in the lift, which stops with a thud. The rabbit leans forward and kisses the penguin. The penguin hears a wail of catcalls behind it and watches the lion go as the lift takes the penguin back up to the site. The penguin stands outside the hair salon, as the lion, inside, throws off its smock and walks toward the penguin with all the girls smiling. The penguin looks from the lion to the girls as they approach, and the lion takes the penguin's arm as they walk off. The penguin hears a car following them and turns around to look. They reach the rabbit's door, and the car stops. The penguin kisses the rabbit and looks at its open lips as if in disbelief at itself. The rabbit goes inside, and the penguin walks into the room, turning on a small desk-light. Then the penguin hears a voice and sees the cat sitting in the corner with its hair now dark brown. The penguin stares at the cat, says nothing as the cat walks around the room, lies down on the bed beside the penguin, takes off a black leather glove, and puts its hand on the penguin's crotch. The penguin takes the cat's hand away, and the cat looks at the penguin hard. The penguin leaps up from the bed, and the cat brings its lips close to the penguin's so they touch. The penguin grabs the cat's hair and pulls its head back, but the cat pulls a gun and sticks it between the penguin's teeth. The penguin stares at the cat, then says quietly. The cat kisses the penguin briefly with the gun at its temple and then goes, leaving the penguin standing in the darkness. The penguin, walking toward the hair salon with flowers in its hand, stands outside watching with the flowers behind its back. Then the chair turns, and we see it is the cat. The penguin freezes, seeing the cat looking at it, smiling brightly, then talking back to the lion. The cat, turning in the chair, smiles brightly at something behind the penguin. It turns and sees the cat is there. The penguin stands suddenly, throws some money on the table, grabs the cat's arm, and frog-marches it out."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He looks out the gap where the porthole should be and sees Dil in the elevator. She passes by a gap in the barrier and blows a kiss at him. Fergus walks out of the cabin and around the framework. Dil sees him and waves, sits on some crates, opens the satchel, and takes out a flask to pour him some lemonade. Fergus smiles in spite of himself. She lowers her head, and he removes her earrings to look at her moist eyes. Fergus stands up suddenly, and Deveroux stares, suddenly chilled. Fergus looks down to Dil and holds out his arm. Dil gathers up her belongings and takes it, her face wreathed in a smile. Fergus walks her down the framework ramp, and they descend from the ship in the elevator, which stops with a thud. She leans forward and kisses him. Fergus hears a wail of whistles behind him and watches Dil go as the elevator takes him back up to the ship. Fergus stands outside the bakery, as Dil, inside, throws off her apron and walks toward him with all the girls smiling. Fergus looks from Dil to the girls as they approach, and she takes his arm as they walk off. Fergus hears a motorcycle following them and turns around to look. They reach her gate, and the motorcycle stops. Fergus kisses her and looks at her open lips as if in disbelief at himself. She goes inside, and Fergus walks into the lounge, turning on a small lantern. Then he hears a voice and sees Jude sitting in the corner with her hair now auburn. He stares at her, says nothing as she walks around the lounge, lies down on the couch beside him, takes off a red velvet glove, and puts her hand on his thigh. He takes her hand away, and she looks at him hard. He leaps up from the couch, and she brings her lips close to his so they touch. He grabs her collar and pulls her head back, but she pulls a dagger and sticks it between his teeth. Fergus stares at her, then says quietly. She kisses him briefly with the dagger at his temple and then goes, leaving Fergus standing in the dimness. Fergus, walking toward the bakery with balloons in his hand, stands outside watching with the balloons behind his back. Then the chair turns, and we see it is Jude. Fergus freezes, seeing Jude looking at him, smiling brightly, then talking back to Dil. Jude, turning in the chair, smiles brightly at something behind Fergus. He turns and sees Jude is there. Fergus stands suddenly, throws some tokens on the counter, grabs her arm, and frog-marches her out."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He peers through the gap where the window should be and spots Dil in the lift. She walks past a gap in the wall and winks at him. Fergus exits the room and meanders around the scaffolding. Dil notices him and nods, reclines on some bricks, unpacks the hamper, and extracts a thermos to offer him some tea. Fergus chuckles involuntarily. She tilts her head, and he adjusts her glasses to observe her shining eyes. Fergus jumps up abruptly, and Deveroux gazes, suddenly perplexed. Fergus glances down to Dil and stretches out his arm. Dil collects her things and accepts it, her face adorned with a smile. Fergus guides her down the scaffolding ramp, and they ascend from the site in the lift, which halts with a jolt. She leans forward and pats him. Fergus catches a chorus of whistles behind him and observes Dil leave as the lift transports him back up to the site. Fergus stands outside the hair salon, as Dil, inside, removes her smock and approaches him with all the girls grinning. Fergus glances from Dil to the girls as they converge, and she clutches his arm as they stroll away. Fergus detects a car trailing them and spins around to see. They arrive at her door, and the car halts. Fergus embraces her and gazes at her parted lips as if stunned at himself. She enters inside, and Fergus strides into the room, flicking on a small desk-light. Then he hears a voice and spots Jude seated in the corner with her hair now dark brown. He gawks at her, stays silent as she circumnavigates the room, reclines on the bed beside him, removes a black leather glove, and places her hand on his shoulder. He pushes her hand away, and she regards him intensely. He springs up from the bed, and she brings her lips near to his so they graze. He tugs her hair and tilts her head back, but she draws a gun and presses it to his chin. Fergus gawks at her, then speaks quietly. She pecks him quickly with the gun at his brow and then departs, leaving Fergus standing in the shadows. Fergus, ambling toward the hair salon with flowers in his hand, pauses outside gazing with the flowers hidden behind his back. Then the chair rotates, and we discover it is Jude. Fergus halts, witnessing Jude beaming at him, grinning widely, then chatting back to Dil. Jude, swiveling in the chair, grins widely at something behind Fergus. He pivots and sees Jude is there. Fergus stands abruptly, flings some money on the table, clutches her arm, and escorts her out."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The apple looks out the chasm where the curtain should be and sees a banana in the elevator. It passes by a hole in the roof and blows a whistle at the apple. The suitcase walks out of the cave and around the ladder. The banana sees it and waves, sits on some stones, opens the basket, and takes out a lantern to pour it some juice. The suitcase smiles in spite of itself. It lowers its head, and the suitcase removes its headphones to look at its shiny wings. The suitcase stands up suddenly, and the rubber duck stares, suddenly frozen. The suitcase looks down to the banana and holds out its elbow. The banana gathers up its items and takes it, its face wreathed in a laugh. The suitcase walks it down the ladder slide, and they descend from the pit in the elevator, which stops with a thud. It leans forward and whistles at it. The suitcase hears a wail of bells behind it and watches the banana go as the elevator takes it back up to the pit. The suitcase stands outside the candy shop, as the banana, inside, throws off its scarf and walks toward it with all the penguins smiling. The suitcase looks from the banana to the penguins as they approach, and it takes its elbow as they walk off. The suitcase hears a bicycle following them and turns around to look. They reach its window, and the bicycle stops. The suitcase whistles at it and looks at its open buttons as if in disbelief at itself. It goes inside, and the suitcase walks into the cave, turning on a small desk-clock. Then it hears a melody and sees a pear sitting in the corner with its hat now bright red. It stares at it, says nothing as it walks around the cave, lies down on the couch beside it, takes off a black leather shoe, and puts its foot on its shoulder. It takes its foot away, and it looks at it hard. It leaps up from the couch, and it brings its eyes close to its so they touch. It grabs its hat and pulls its head back, but it pulls a broom and sticks it between its buttons. The suitcase stares at it, then says quietly. It whistles at it briefly with the broom at its collar and then goes, leaving the suitcase standing in the shadows. The suitcase, walking toward the candy shop with balloons in its hand, stands outside watching with the balloons behind its back. Then the couch turns, and we see it is a pear. The suitcase freezes, seeing the pear looking at it, smiling brightly, then speaking back to the banana. The pear, turning in the couch, smiles brightly at something behind the suitcase. It turns and sees the pear is there. The suitcase stands suddenly, throws some confetti on the table, grabs its elbow, and frog-marches it out."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "He peers out the gap where the window should be and spots a raccoon in the lift. The raccoon glides past a gap in the wall and tosses a wink at him. A giraffe shuffles out of the room and navigates around the scaffolding. The raccoon notices and salutes, perches on some bricks, unseals the hamper, and retrieves a thermos to pour him some lemonade. The giraffe giggles in spite of itself. The raccoon dips its head, and the giraffe removes the raccoon's hat to gaze at its glittering eyes. The giraffe bounds up abruptly, and a penguin glares, suddenly intrigued. The giraffe peeks down to the raccoon and stretches out its hoof. The raccoon bundles up its belongings and grabs it, its face adorned with a grin. The giraffe escorts the raccoon down the scaffolding ramp, and they climb down from the site in the lift, which halts with a clunk. The raccoon tilts forward and nuzzles him. The giraffe registers a chorus of whistles behind it and observes the raccoon depart as the lift transports it back up to the site. The giraffe lingers outside the ice cream shop, as the raccoon, inside, tosses off its apron and shuffles toward him with all the otters beaming. The giraffe glances from the raccoon to the otters as they near, and it hooks its hoof with his as they meander off. The giraffe detects a skateboard tailing them and pivots around to glance. They arrive at its burrow, and the skateboard halts. The giraffe embraces it and peers at its parted lips as though bewildered by itself. The raccoon slips inside, and the giraffe ambles into the den, flicking on a small lantern. Then it notices an echo and discerns a kangaroo nestled in the corner with its fur now dark beige. It gapes at the kangaroo, utters nothing as it paces around the den, reclines on the bed beside it, peels off a brown leather glove, and places its paw on its snout. It removes the paw, and the kangaroo gazes at it intently. It springs up from the bed, and the kangaroo draws its whiskers near so they brush. It yanks the kangaroo's mane and tilts its head back, but the kangaroo retrieves a lollipop and wedges it between its teeth. The giraffe gapes at the kangaroo, then murmurs softly. The kangaroo pecks it fleetingly with the lollipop at its forehead and then departs, leaving the giraffe poised in the twilight. The giraffe, wandering toward the ice cream shop with clovers in its mouth, lingers outside gazing with the clovers tucked behind its neck. Then the chair swivels, and we discover it is the kangaroo. The giraffe freezes, spotting the kangaroo regarding it, beaming warmly, then chatting back to the raccoon. The kangaroo, pivoting in the chair, grins radiantly at something behind the giraffe. It rotates and discerns the kangaroo is present. The giraffe leaps abruptly, tosses some acorns on the table, snatches its paw, and strolls it outside."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He peeks through the slit where the door should be and notices Dil in the hallway. She glides past an opening in the ceiling and tosses a wink at him. Fergus slips out of the alcove and weaves around the hedges. Dil catches sight of him and nods, perches on some logs, unzips the backpack, and pulls out a flute to offer him some lemonade. Fergus chuckles despite himself. She tilts her head, and he adjusts her scarf to admire her twinkling eyes. Fergus leaps up abruptly, and Deveroux glances, suddenly uneasy. Fergus peers down to Dil and extends his hand. Dil collects her belongings and accepts it, her face illuminated with a grin. Fergus guides her down the pathway bridge, and they slide from the site via the ladder, which lands with a thump. She tilts forward and hugs him. Fergus hears a chorus of cheers behind him and watches Dil leave as the ladder lifts him back up to the site. Fergus stands outside the bakery, as Dil, inside, shrugs off her apron and strolls toward him with all the people chuckling. Fergus glances from Dil to the people as they advance, and she loops her arm through his as they wander off. Fergus hears a bicycle trailing them and spins around to glance. They reach her porch, and the bicycle halts. Fergus embraces her and gazes at her parted lips as if bewildered by himself. She steps inside, and Fergus enters the chamber, flicking on a small table-lamp. Then he notices a murmur and sees Jude lounging in the corner with her hair now fiery red. He gapes at her, remains silent as she saunters around the chamber, reclines on the chair beside him, removes a woolen mitten, and places her hand on his shoulder. He brushes her hand away, and she scrutinizes him intently. He vaults from the chair, and she angles her lips near his so they brush. He seizes her wrist and tilts her head back, but she unsheathes a knife and presses it to his throat. Fergus gawks at her, then murmurs softly. She pecks him fleetingly with the knife at his cheek and then departs, leaving Fergus standing in the dimness. Fergus, ambling toward the bakery with chocolates in his hand, pauses outside observing with the chocolates behind his back. Then the seat spins, and we see it is Jude. Fergus halts, perceiving Jude eyeing him, grinning broadly, then conversing back to Dil. Jude, whirling in the seat, grins broadly at something behind Fergus. He pivots and sees Jude is there. Fergus rises abruptly, tosses some change on the counter, clutches her wrist, and ushers her out."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "He gazes out the chasm where the curtain should be and spots Biff on the escalator. He saunters past a fissure in the facade and tosses a paper plane at her. Derek meanders out of the hall and along the catwalk. Biff notices her and nods, perches on a log, unfurls the blanket, and extracts a sandwich to offer her some soup. Derek chuckles despite herself. He tilts his head, and she removes his hat to peer at his gleaming ears. Derek leaps up abruptly, and Lafayette gawks, suddenly startled. Derek glances down to Biff and extends his foot. Biff gathers her items and takes it, her face adorned with a grin. Derek escorts her down the catwalk slope, and they ascend from the park in the escalator, which halts with a jolt. He leans sideways and bumps into her. Derek catches a noise of applause behind her and watches Biff leave as the escalator returns her to the park. Derek stands outside the bakery, as Biff, inside, flings off his apron and strides toward her with all the boys beaming. Derek looks from Biff to the boys as they approach, and he takes her foot as they saunter off. Derek hears a bicycle trailing them and pivots around to see. They arrive at his gate, and the bicycle pauses. Derek bumps into her and glances at his closed eyes as if amazed at himself. He enters inside, and Derek strolls into the chamber, illuminating a tiny floor-lamp. Then she catches a tune and notices Clayton lounging in the alcove with his hair now jet black. She gazes at him, utters nothing as he prowls around the chamber, reclines on the sofa beside her, removes a red woolen mitten, and places his foot on her shoulder. She removes his foot, and he glares at her intently. He vaults off the sofa, and he nudges her lips close to hers so they graze. She tugs his hair and jerks his chin back, but he draws a knife and presses it against her cheek. Derek gapes at him, then murmurs softly. He grazes her lightly with the knife at his temple before departing, leaving Derek lingering in the twilight. Derek, ambling toward the bakery with balloons in her hand, stands outside observing with the balloons behind his shoulder. Then the couch swivels, revealing it's Clayton. Derek halts, spotting Clayton watching her, grinning widely, then chatting back to Biff. Clayton, twirling in the couch, grins widely at something beyond Derek. She pivots and notices Clayton is present. Derek stands abruptly, tosses some coins on the stool, grips his shoulder, and drags him outside."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Fergus observes Dil from a construction site and smiles when she pours him tea. After descending to her with the lift, they share a kiss despite nearby catcalls. Fergus later meets Dil at a hair salon, where she joyfully joins him as they leave together. As they approach her door, Fergus notices a car following them, kisses her, and enters a room alone. Inside, he encounters Jude with dark hair, who confronts him by lying beside him and pulling a gun when he resists her advances. She briefly kisses him before leaving him in shock. Fergus later arrives at the hair salon with flowers, only to see Jude in the salon, smiling at him. Alarmed, he quickly moves to escort her outside."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Fergus stands suddenly throws some money on the table grabs her arm and frogmarches her out He turns and sees Jude is there  Jude turning in the chair smiles brightly at something behind Fergus  Fergus freezes seeing Jude looking at him smiling brightly then talking back to Dil  Then the chair turns and we see it is Jude  Fergus walking toward the hair salon with flowers in his hand stands outside watching with the flowers behind his back  She kisses him briefly with the gun at his temple and then goes leaving Fergus standing in the darkness  Fergus stares at her then says quietly  He grabs her hair and pulls her head back but she pulls a gun and sticks it between his teeth  He leaps up from the bed and she brings her lips close to his so they touch  He takes her hand away and she looks at him hard  He stares at her says nothing as she walks around the room lies down on the bed beside him takes off a black leather glove and puts her hand on his crotch  Then he hears a voice and sees Jude sitting in the corner with her hair now dark brown  She goes inside and Fergus walks into the room turning on a small desklight  Fergus kisses her and looks at her open lips as if in disbelief at himself  They reach her door and the car stops  Fergus hears a car following them and turns around to look  Fergus looks from Dil to the girls as they approach and she takes his arm as they walk off  Fergus stands outside the hair salon as Dil inside throws off her smock and walks toward him with all the girls smiling  Fergus hears a wail of catcalls behind him and watches Dil go as the lift takes him back up to the site  She leans forward and kisses him  Fergus walks her down the scaffolding ramp and they descend from the site in the lift which stops with a thud  Dil gathers up her things and takes it her face wreathed in a smile  Fergus looks down to Dil and holds out his arm  Fergus stands up suddenly and Deveroux stares suddenly chilled  She lowers her head and he removes her glasses to look at her moist eyes  Fergus smiles in spite of himself  Dil sees him and waves sits on some bricks opens the hamper and takes out a thermos to pour him some tea  Fergus walks out of the room and around the scaffolding  She passes by a gap in the wall and blows a kiss at him  He looks out the gap where the window should be and sees Dil in the lift "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He grabs her hair and pulls her head back but she pulls a gun and sticks it between his teeth  Fergus walks her down the scaffolding ramp and they descend from the site in the lift which stops with a thud  Fergus looks down to Dil and holds out his arm  Then he hears a voice and sees Jude sitting in the corner with her hair now dark brown  He leaps up from the bed and she brings her lips close to his so they touch  He looks out the gap where the window should be and sees Dil in the lift  Fergus walking toward the hair salon with flowers in his hand stands outside watching with the flowers behind his back  He takes her hand away and she looks at him hard  She lowers her head and he removes her glasses to look at her moist eyes  Fergus freezes seeing Jude looking at him smiling brightly then talking back to Dil  They reach her door and the car stops  Fergus stands suddenly throws some money on the table grabs her arm and frogmarches her out Then the chair turns and we see it is Jude  Fergus kisses her and looks at her open lips as if in disbelief at himself  She goes inside and Fergus walks into the room turning on a small desklight  Fergus hears a car following them and turns around to look  She passes by a gap in the wall and blows a kiss at him  Jude turning in the chair smiles brightly at something behind Fergus  He stares at her says nothing as she walks around the room lies down on the bed beside him takes off a black leather glove and puts her hand on his crotch  Fergus hears a wail of catcalls behind him and watches Dil go as the lift takes him back up to the site  Fergus stares at her then says quietly  Fergus stands outside the hair salon as Dil inside throws off her smock and walks toward him with all the girls smiling  Fergus walks out of the room and around the scaffolding  Dil sees him and waves sits on some bricks opens the hamper and takes out a thermos to pour him some tea  He turns and sees Jude is there  She kisses him briefly with the gun at his temple and then goes leaving Fergus standing in the darkness  Fergus stands up suddenly and Deveroux stares suddenly chilled  Fergus smiles in spite of himself  Dil gathers up her things and takes it her face wreathed in a smile  She leans forward and kisses him  Fergus looks from Dil to the girls as they approach and she takes his arm as they walk off "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Fergus kisses her and looks at her open lips as if in disbelief at himself  She goes inside and Fergus walks into the room turning on a small desklight  Then he hears a voice and sees Jude sitting in the corner with her hair now dark brown  He stares at her says nothing as she walks around the room lies down on the bed beside him takes off a black leather glove and puts her hand on his crotch  He takes her hand away and she looks at him hard  He leaps up from the bed and she brings her lips close to his so they touch  He grabs her hair and pulls her head back but she pulls a gun and sticks it between his teeth  Fergus stares at her then says quietly  She kisses him briefly with the gun at his temple and then goes leaving Fergus standing in the darkness  Fergus walking toward the hair salon with flowers in his hand stands outside watching with the flowers behind his back  Then the chair turns and we see it is Jude  Fergus freezes seeing Jude looking at him smiling brightly then talking back to Dil  Jude turning in the chair smiles brightly at something behind Fergus  He turns and sees Jude is there  Fergus stands suddenly throws some money on the table grabs her arm and frogmarches her out He looks out the gap where the window should be and sees Dil in the lift  She passes by a gap in the wall and blows a kiss at him  Fergus walks out of the room and around the scaffolding  Dil sees him and waves sits on some bricks opens the hamper and takes out a thermos to pour him some tea  Fergus smiles in spite of himself  She lowers her head and he removes her glasses to look at her moist eyes  Fergus stands up suddenly and Deveroux stares suddenly chilled  Fergus looks down to Dil and holds out his arm  Dil gathers up her things and takes it her face wreathed in a smile  Fergus walks her down the scaffolding ramp and they descend from the site in the lift which stops with a thud  She leans forward and kisses him  Fergus hears a wail of catcalls behind him and watches Dil go as the lift takes him back up to the site  Fergus stands outside the hair salon as Dil inside throws off her smock and walks toward him with all the girls smiling  Fergus looks from Dil to the girls as they approach and she takes his arm as they walk off  Fergus hears a car following them and turns around to look  They reach her door and the car stops "
        }
      ]
    }
  ]
}