{
  "ground_truth": "His eyes open suddenly. The view pulls back slowly from a close-up of a television screen with snow on it to reveal a long row of television sets along the ceiling of the aircraft. Pulling back from the close-up of Ben reveals a row of passengers staring straight ahead with their headsets on. Ben has not moved. The bed on which he is lying moves as though someone has sat down upon it next to him. As Ben speaks, the door to the bedroom opens, and Mrs. Braddock looks in. They move out of the door, with Mr. Braddock steering Ben. Phil and Mimi Carlson are coming up the stairs as the Braddocks move down. Mrs. Carlson gives Ben a broad wink, and Ben tries to smile and return the wink politely. They reach the hall at the bottom of the stairs. Ben moves to the front door and opens it. Mr. Loomis steps into the house and grabs Ben's hand. Mr. Loomis closes the door and pushes Ben back down the hall. Mr. Loomis turns and goes into the dining room. Ben moves back to the stairway as three ladies come out of the living room. One lady takes Ben's right hand, another lady his left, and the third fingers the front of his jacket. Mr. McQuire appears behind Ben, and they look at each other for a moment. Mr. McQuire turns and walks back into the house. The people at the other end of the yard look toward Ben. Ben goes into the house through the back door. Through the windows of the house, Ben makes his way through people trying to stop him and speak to him as he goes through rooms, up the stairs, and to his room. There is the sound of a door slamming. Ben stands with his back against the door. A long shot over Ben shows the pool area and people below. The door opens, and Ben turns to see Mrs. Robinson enter the room. They stand for a moment, looking at each other. Mrs. Robinson moves into the room and sits on the edge of the bed. She takes a cigarette from her purse, lights it, blows out the match, and puts it down carefully on the bedspread. Ben picks up a wastebasket, walks over to the bed, picks up the match, and puts it in the wastebasket. Ben reaches into his pocket and hands Mrs. Robinson a set of car keys. Mrs. Robinson looks at him, shakes her head, and throws the keys to him. Ben gets out and goes around to her side, opens the door, and they move to the door. She takes out her key and opens the door.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "His optics open abruptly. The panorama pulls back gradually from a close-up of a television display with static on it to disclose a lengthy line of television sets along the ceiling of the airplane. Pulling back from the close-up of Ben unveils a row of travelers gazing directly forward with their headsets on. Ben has not shifted. The cot on which he is reclining shifts as though someone has perched down upon it next to him. As Ben speaks, the portal to the chamber opens, and Mrs. Braddock peeks in. They proceed out of the portal, with Mr. Braddock guiding Ben. Phil and Mimi Carlson are ascending the staircase as the Braddocks descend. Mrs. Carlson gives Ben a wide wink, and Ben attempts to grin and return the wink courteously. They arrive at the corridor at the base of the staircase. Ben advances to the entrance door and opens it. Mr. Loomis steps into the domicile and seizes Ben's hand. Mr. Loomis shuts the door and thrusts Ben back down the corridor. Mr. Loomis rotates and enters the dining chamber. Ben moves back to the stairwell as three women emerge from the living room. One woman clasps Ben's right hand, another woman his left, and the third manipulates the front of his blazer. Mr. McQuire appears behind Ben, and they gaze at each other for a moment. Mr. McQuire pivots and strolls back into the domicile. The individuals at the opposite extremity of the yard glance toward Ben. Ben enters the domicile through the rear door. Through the panes of the domicile, Ben navigates his way through individuals attempting to halt him and converse with him as he passes through chambers, up the staircase, and to his chamber. There is the noise of a portal slamming. Ben stands with his spine against the portal. A lengthy shot over Ben displays the pool vicinity and individuals below. The portal opens, and Ben rotates to see Mrs. Robinson ingress the chamber. They stand for a moment, observing each other. Mrs. Robinson progresses into the chamber and perches on the brim of the cot. She extracts a cigarette from her handbag, ignites it, extinguishes the match, and places it down carefully on the bedspread. Ben picks up a wastebasket, strides over to the cot, retrieves the match, and places it in the wastebasket. Ben reaches into his pocket and hands Mrs. Robinson a set of automobile keys. Mrs. Robinson observes him, shakes her head, and tosses the keys to him. Ben exits and goes around to her side, opens the portal, and they proceed to the portal. She takes out her key and opens the portal."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Suddenly, his eyes are opened. The view is pulled back slowly from a close-up of a television screen with snow on it to reveal a long row of television sets along the ceiling of the aircraft. The close-up of Ben pulls back to reveal a row of passengers staring straight ahead with their headsets on. Moving has not been done by Ben. The bed on which he is lying is moved as though someone has sat down upon it next to him. As Ben speaks, the door to the bedroom is opened by Mrs. Braddock, who looks in. They are moved out of the door, with Mr. Braddock steering Ben. Phil and Mimi Carlson come up the stairs as the Braddocks move down. A broad wink is given to Ben by Mrs. Carlson, and he tries to smile and return the wink politely. The hall at the bottom of the stairs is reached by them. The front door is moved to by Ben and opened. Into the house steps Mr. Loomis, who grabs Ben's hand. The door is closed by Mr. Loomis, who pushes Ben back down the hall. Mr. Loomis turns and goes into the dining room. The stairway is moved back to by Ben as three ladies come out of the living room. Ben's right hand is taken by one lady, another takes his left, and the third fingers the front of his jacket. Mr. McQuire appears behind Ben, and each other is looked at by them for a moment. Mr. McQuire turns and walks back into the house. The people at the other end of the yard look toward Ben. The house is entered by Ben through the back door. Through the windows of the house, his way is made by Ben through people trying to stop him and speak to him as he goes through rooms, up the stairs, and to his room. There is the sound of a door being slammed. With his back against the door, Ben stands. A long shot over Ben shows the pool area and people below. The door is opened, and Mrs. Robinson is seen by Ben as she enters the room. For a moment, each other is looked at by them. Into the room moves Mrs. Robinson and sits on the edge of the bed. A cigarette is taken from her purse, lit, and the match is blown out and carefully put down on the bedspread by her. A wastebasket is picked up by Ben, who walks over to the bed, picks up the match, and puts it in the wastebasket. Into his pocket reaches Ben and hands Mrs. Robinson a set of car keys. At him, Mrs. Robinson looks, shakes her head, and throws the keys to him. Ben gets out, goes around to her side, opens the door, and the door is moved to by them. Her key is taken out by her, and the door is opened."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "His eyes open suddenly. The view shifts from a close-up of a snow-filled TV screen to a long row of television sets along the aircraft's ceiling. As the camera pulls back from Ben, passengers sit with headsets on, staring ahead. Ben hasn't moved. The bed shifts as if someone has sat next to him. As Ben speaks, the bedroom door opens, and Mrs. Braddock appears. They exit, with Mr. Braddock guiding Ben. Phil and Mimi Carlson ascend the stairs as the Braddocks descend. Mrs. Carlson winks at Ben, who attempts a polite return. At the bottom, Ben opens the front door, and Mr. Loomis enters, shaking Ben's hand before leading him back down the hall into the dining room. Ben returns to the stairway as three ladies emerge from the living room, taking his hands and touching his jacket. Mr. McQuire appears, and they exchange glances before McQuire walks back. People in the yard look toward Ben as he enters the house through the back door. Navigating through rooms and avoiding conversations, Ben makes his way to his room, closing the door behind him. A long shot reveals the pool area and guests below. The door opens as Mrs. Robinson enters. They stand, staring for a moment before she sits on the bed and lights a cigarette. Ben picks up the match and places it in a wastebasket, then hands her car keys. Mrs. Robinson shakes her head and tosses the keys back. Ben exits, opens the door for her, and they move to the door. She uses her key to open it."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "His eyes open suddenly. The camera pulls back from a snowy TV screen to reveal televisions on the aircraft's ceiling. Passengers, including Ben, stare ahead with headsets on. The bed beneath Ben shifts. As he speaks, Mrs. Braddock looks in from an open door. The Braddocks move out, passing Phil and Mimi Carlson on the stairs. Mrs. Carlson winks at Ben, who attempts to smile and wink back. At the bottom, Ben opens the front door for Mr. Loomis, who shakes Ben's hand and pushes him back. Mr. Loomis enters the dining room as Ben returns to the hallway. Three ladies exit the living room, each grabbing Ben's hands or jacket. Mr. McQuire appears, they exchange glances, and he walks away. Ben enters through the back door, maneuvering past people who try to talk to him, heading upstairs to his room. A door slams as Ben stands against it. A shot shows the pool and people below. Mrs. Robinson enters; they exchange looks. She sits on the bed, lights a cigarette, and discards the match on the bedspread. Ben picks it up and puts it in a wastebasket. He gives Mrs. Robinson car keys, but she shakes her head and throws them back. Ben exits, opens her door, and they move outside. She uses her key to open the door."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Without warning, his eyes open abruptly, breaking the stillness of his earlier slumber. The camera lens retreats gradually from an up-close shot of a television screen flickering with white static, revealing the long, continuous row of television sets that are strategically placed along the aircraft's ceiling. As the lens pulls away from the close-up of Ben, it unveils a line of passengers sitting rigidly, eyes fixed straight ahead, each wearing their headsets. Despite the activity around him, Ben remains entirely motionless. The bed beneath him shifts slightly, suggesting that someone has seated themselves beside him. At the very moment Ben begins to speak, the door leading to the bedroom swings open, and Mrs. Braddock peers in. They move gracefully out through the door together, with Mr. Braddock gently guiding Ben along. Meanwhile, Phil and Mimi Carlson are ascending the stairs as the Braddocks make their way downward. Mrs. Carlson gives Ben an exaggerated wink, to which Ben endeavors to respond with a polite smile and his own earnest, though slightly awkward, wink. Upon reaching the hallway at the bottom of the stairs, Ben strides over to the front door and opens it with purpose. Mr. Loomis steps inside the house, extending his hand to grasp Ben's firmly. After closing the door behind him, Mr. Loomis propels Ben back along the hall. He then pivots and steps into the dining room. Ben retraces his steps to the stairway just as three women emerge from the living room. One woman clasps Ben’s right hand, another takes his left, and the third fiddles with the front of his jacket. Mr. McQuire appears unexpectedly behind Ben, and they exchange a brief, meaningful glance. Mr. McQuire then turns away and retreats back into the house. Observers at the far end of the yard cast their gaze toward Ben. He reenters the house through the back door. Through the windows of the house, Ben navigates his way through the throng, people pausing to stop him and engage him in conversation as he weaves through rooms, ascends the stairs, and reaches his own room. Suddenly, the sharp sound of a door slamming resonates through the air. Ben stands with his back pressed firmly against the door. A wide shot over Ben’s shoulder captures the expansive pool area and the people gathered below. The door opens quietly, and Ben turns his head to see Mrs. Robinson entering the room. They pause, locking eyes for a poignant moment. Mrs. Robinson advances into the room and gracefully settles on the edge of the bed. She retrieves a cigarette from her purse, lights it, exhales the match's light with a gentle breath, and carefully places it on the bedspread. Ben, taking note, picks up a nearby wastebasket, strides over to the bed, picks up the used match, and disposes of it in the wastebasket. Reaching into his pocket, Ben hands Mrs. Robinson a set of car keys. She looks at him with a knowing expression, shakes her head slightly, and tosses the keys back to him. Ben then exits the room, circles around to her side, opens the door for her, and together they move toward the door. She retrieves her key and opens the door, allowing them both to step through."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Without any prior indication or forewarning, his eyes suddenly open wide, breaking the serene stillness of the restful slumber he was in just moments before. The camera lens, which was previously fixed in an intimate, up-close shot of a television screen flickering with white static, now begins to gradually pull back. As it retreats, it reveals a long, continuous row of television sets strategically installed along the ceiling of the aircraft. As the lens continues to move away from the close-up view of Ben, it unveils a line of passengers sitting in neatly arranged rows. Each passenger sits rigidly, eyes steadfastly fixed straight ahead, all donning headsets that cover their ears. Despite the ongoing activity around him, Ben remains completely motionless, seemingly unaffected by his surroundings. The bed beneath him shifts slightly, subtly suggesting that someone has taken a seat beside him. Just at the precise moment Ben starts to speak, the door leading into the bedroom swings open with a gentle creak, and Mrs. Braddock peers in from the doorway. Together, they move gracefully out through the door, with Mr. Braddock gently guiding Ben along with a supportive hand. Meanwhile, Phil and Mimi Carlson are in the process of ascending the stairs as the Braddocks make their way downward. Mrs. Carlson casts an exaggerated wink in Ben's direction, to which he endeavors to respond with a polite smile and his own earnest, albeit slightly awkward, wink. As they reach the hallway at the bottom of the stairs, Ben strides purposefully toward the front door and opens it with determination. Mr. Loomis steps inside the house, extending his hand to grasp Ben's firmly in a cordial handshake. After carefully closing the door behind them, Mr. Loomis propels Ben back along the hall with an assertive guiding hand. He then pivots and confidently steps into the dining room. Ben retraces his steps toward the stairway just as three women emerge from the living room area. One woman clasps Ben’s right hand with warmth, another takes his left in a gentle grip, and the third fusses with adjusting the front of his jacket. Mr. McQuire appears unexpectedly, emerging from behind Ben, and they exchange a brief, meaningful glance filled with unspoken understanding. Mr. McQuire then turns away and retreats back into the depths of the house. Observers positioned at the far end of the yard cast their watchful gaze toward Ben as he reenters the house through the back door. Through the many windows of the house, Ben navigates his way through the crowd, interacting with people who pause to stop him and engage him in brief conversation as he weaves through various rooms, ascends the stairs, and finally reaches his own room. Suddenly, the sharp and abrupt sound of a door slamming shut echoes and resonates through the air. Ben stands with his back pressed firmly against the door, his posture tense. With a wide shot over Ben's shoulder, the expansive pool area outside and the people gathered below come into view. The door behind him opens quietly, and Ben turns his head slightly to see Mrs. Robinson making her entrance into the room. They pause in mutual understanding, locking eyes for a poignant and meaningful moment. Mrs. Robinson advances into the room with a certain graceful ease and settles herself comfortably on the edge of the bed. From her purse, she retrieves a cigarette, lights it, and then exhales the match's light with a gentle, practiced breath, carefully placing it on the bedspread. Observant, Ben picks up a nearby wastebasket, strides over to the bed, picks up the used match, and responsibly disposes of it in the wastebasket. Reaching into his pocket, Ben hands Mrs. Robinson a set of car keys. She looks at him with a knowing expression, shakes her head slightly in a gesture of refusal, and tosses the keys back to him with a casual flick of her wrist. Ben then exits the room, circles around to her side, opens the door for her with a courteous gesture, and together they move toward the door. She retrieves her key with practiced familiarity, unlocking the door to allow them both to step through into whatever awaits beyond."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "His eyes open suddenly, jolting him into awareness as they fixate on the static-filled television screen, displaying nothing but snow. As the camera's perspective gradually widens, revealing a long row of television sets mounted along the aircraft's ceiling, the focus shifts from the individual screen to encompass the entire row. The scene then transitions from the close-up of Ben's face to unveil a line of passengers, each seated with their headsets snugly covering their ears, their gazes fixed forward in silent attentiveness. Despite the activity around him, Ben remains motionless. The bed beneath him shifts subtly as if responding to an unseen weight, suggesting someone has sat beside him. As Ben begins to speak, the bedroom door swings open, and Mrs. Braddock peeks in with an air of curiosity. Together, they exit the room, with Mr. Braddock gently guiding Ben with a supportive hand. As they descend the stairs, Phil and Mimi Carlson appear, ascending with a casual air. Mrs. Carlson, spotting Ben, offers him a playful wink, prompting him to muster a polite smile and a reciprocated wink. Reaching the bottom of the stairs, they move into the hall. Ben approaches the front door, opening it to reveal Mr. Loomis, who steps inside with a firm handshake for Ben. After closing the door with a decisive gesture, Mr. Loomis ushers Ben back down the hallway, exuding a sense of urgency. Mr. Loomis then veers off into the dining room, while Ben returns to the stairway, encountering three ladies emerging from the living room. One lady takes hold of Ben's right hand with a friendly grasp, another captures his left, and the third delicately touches the front of his jacket, adjusting it with care. Mr. McQuire appears behind Ben, and they share a brief moment of silent communication through their eyes before Mr. McQuire turns and retreats back into the house. The people gathered at the far end of the yard cast their eyes toward Ben, perhaps in expectation. Ben turns, re-enters the house via the back door, and navigates through the bustling interior, dodging individuals eager to converse with him. He weaves through the crowded rooms, ascends the staircase, and finally reaches the sanctity of his own room. The sound of a door slamming reverberates, marking his entry. Standing with his back pressed against the door, Ben surveys the scene through a long shot, taking in the sprawling pool area and the people milling about below. The door quietly eases open, capturing Ben's attention, and he watches as Mrs. Robinson steps into the room. They share a moment of silent recognition and intrigue before Mrs. Robinson saunters further in, gracefully perching on the edge of the bed. From her purse, she retrieves a cigarette, lighting it with practiced ease, and expertly extinguishes the match, placing it down gently on the bedspread. Observing this, Ben picks up a nearby wastebasket, approaches the bed, and retrieves the discarded match, depositing it promptly into the wastebasket. Reaching into his pocket, Ben produces a set of car keys, handing them over to Mrs. Robinson in a gesture laden with unspoken intent. She regards him with a discerning eye, shakes her head with quiet resolve, and lightly tosses the keys back. With a sense of determination, Ben exits and circles around to her side, courteously opening the door. They move toward the door together, and she produces a key from her belongings, inserting it into the lock to open the door, leading them onward."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Ben's eyes open suddenly to reveal a view of a long row of television sets along the aircraft's ceiling, pulling back from a close-up of a snowy TV screen. Passengers sit motionless, headsets on, while Ben also remains still. The bed shifts as if someone has joined him. As he speaks, the bedroom door opens to reveal Mrs. Braddock, who enters, and they exit together with Mr. Braddock guiding Ben. On the stairs, they encounter Phil and Mimi Carlson; Mrs. Carlson gives Ben a wink, which he attempts to return with a polite smile. Reaching the hall, Ben opens the front door to Mr. Loomis, who shakes his hand, closes the door, and nudges Ben back down the hall before heading into the dining room. Ben returns to the stairway, where three ladies emerge from the living room, greeting him warmly. Mr. McQuire appears, and they exchange glances before he retreats within the house. Observed by people in the yard, Ben slips through the back door, navigating through guests trying to engage him as he heads upstairs to his room, slamming the door behind him. Standing against the door, he surveys the pool area below. The door opens, and Mrs. Robinson enters. They regard each other briefly before she moves to sit on the bed, lights a cigarette, and rests the match on the bedspread. Ben discards the match in a wastebasket and hands her a set of car keys. Shaking her head, Mrs. Robinson tosses the keys back, and Ben exits the room, escorting her to the door, where she uses her key to open it."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "His eyes open suddenly. The view pulls back slowly from a close-up of a television screen with snow on it, reminiscent of static interference before digital broadcasting, to reveal a long row of television sets along the ceiling of the aircraft, a Boeing 747 known for its spacious layout during transatlantic flights in the 1970s. Pulling back from the close-up of Ben reveals a row of passengers staring straight ahead with their headsets on, likely listening to the in-flight audio channels popular during long journeys. Ben has not moved. The bed on which he is lying moves as though someone has sat down upon it next to him. As Ben speaks, the door to the bedroom, indicative of a first-class private suite, opens, and Mrs. Braddock looks in, wearing an elegant outfit typical of affluent travelers of the era. They move out of the door, with Mr. Braddock steering Ben, guiding him as a concerned parent would. Phil and Mimi Carlson are coming up the stairs, their summer home known for hosting lavish gatherings, as the Braddocks move down. Mrs. Carlson gives Ben a broad wink, a gesture of camaraderie from an old family friend, and Ben tries to smile and return the wink politely. They reach the hall at the bottom of the stairs. Ben moves to the front door and opens it. Mr. Loomis, a business associate of Ben's father with a reputation for being stern, steps into the house and grabs Ben's hand in a firm handshake. Mr. Loomis closes the door and pushes Ben back down the hall with authority. Mr. Loomis turns and goes into the dining room, where conversations about investments often take place. Ben moves back to the stairway as three ladies, part of the local socialite circle, come out of the living room. One lady takes Ben's right hand, another lady his left, and the third fingers the front of his jacket, adjusting it with the care of a mother straightening her son's suit. Mr. McQuire appears behind Ben, an old friend who used to coach Ben's high school soccer team, and they look at each other for a moment, sharing a silent understanding. Mr. McQuire turns and walks back into the house. The people at the other end of the yard, guests at the summer party, look toward Ben. Ben goes into the house through the back door, a shortcut often used by family members. Through the windows of the house, Ben makes his way through people trying to stop him and speak to him as he goes through rooms, up the stairs, and to his room, a refuge lined with trophies from his academic and athletic achievements. There is the sound of a door slamming, echoing Ben's need for solitude. Ben stands with his back against the door. A long shot over Ben shows the pool area and people below, gathered for an afternoon barbecue. The door opens, and Ben turns to see Mrs. Robinson, a close family friend with a mysterious allure, enter the room. They stand for a moment, looking at each other. Mrs. Robinson moves into the room and sits on the edge of the bed, upholstered in rich fabrics. She takes a cigarette from her purse, a sign of the era's social habits, lights it, blows out the match, and puts it down carefully on the bedspread. Ben picks up a wastebasket, walks over to the bed, picks up the match, and puts it in the wastebasket, a gesture of caution. Ben reaches into his pocket and hands Mrs. Robinson a set of car keys, her car being a sleek, stylish convertible. Mrs. Robinson looks at him, shakes her head, and throws the keys back to him, indicating her refusal. Ben gets out and goes around to her side, opens the door, and they move to the door, walking together with a shared understanding. She takes out her key and opens the door, leading the way with confidence."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "His eyes open suddenly. The view pulls back slowly from a closeup of a television screen with snow on it to reveal a long row of television sets along the ceiling of the aircraft. Pulling back from the closeup of Ben reveals a row of passengers staring straight ahead with their headsets on. Ben has not moved. The bed on which he is lying moves as though someone has sat down upon it next to him. As Ben speaks the door to the bedroom opens and Mrs Braddock looks in. They move out of the door with Mr Braddock steering Ben. Phil and Mimi Carlson are coming up the stairs as the Braddocks move down. Mrs Carlson gives Ben a broad wink and Ben tries to smile and return the wink politely. They reach the hall at the bottom of the stairs. Ben moves to the front door and opens it. Mr Loomis steps into the house and grabs Ben's hand. Mr Loomis closes the door and pushes Ben back down the hall. Mr Loomis turns and goes into the dining room. Ben moves back to the stairway as three ladies come out of the living room. One lady takes Ben's right hand another lady his left and the third fingers the front of his jacket. Mr McQuire appears behind Ben and they look at each other for a moment. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Mr McQuire turns and walks back into the house. The people at the other end of the yard look toward Ben. Ben goes into the house through the back door. Through the windows of the house Ben makes his way through people trying to stop him and speak to him as he goes through rooms up the stairs and to his room. There is the sound of a door slamming. Ben stands with his back against the door. A long shot over Ben shows the pool area and people below. The door opens and Ben turns to see Mrs Robinson enter the room. They stand for a moment looking at each other. Mrs Robinson moves into the room and sits on the edge of the bed. She takes a cigarette from her purse lights it blows out the match and puts it down carefully on the bedspread. Ben picks up a wastebasket walks over to the bed picks up the match and puts it in the wastebasket. Ben reaches into his pocket and hands Mrs Robinson. a set of car keys. Mrs Robinson looks at him shakes her head and throws the keys to him. Ben gets out and goes around to her side opens the door and they move to the door. She takes out her key and opens the door."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "His eyes open suddenly. The view pulls back slowly from a closeup of a television screen with snow on it to reveal a long row of television sets along the ceiling of the aircraft. Pulling back from the closeup of Ben reveals a row of passengers staring straight ahead with their headsets on. Ben has not moved. The bed on which he is lying moves as though someone has sat down upon it next to him. As Ben speaks the door to the bedroom opens and Mrs Braddock looks in. They move out of the door with Mr Braddock steering Ben. Phil and Mimi Carlson are coming up the stairs as the Braddocks move down. Mrs Carlson gives Ben a broad wink and Ben tries to smile and return the wink politely. They reach the hall at the bottom of the stairs. Ben moves to the front door and opens it. Mr Loomis steps into the house and grabs Ben's hand. Mr Loomis closes the door and pushes Ben back down the hall. Mr Loomis turns and goes into the dining room. Ben moves back to the stairway as three ladies come out of the living room. One lady takes Ben's right hand another lady his left and the third fingers the front of his jacket. Mr McQuire appears behind Ben and they look at each other for a moment. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. Mr McQuire turns and walks back into the house. The people at the other end of the yard look toward Ben. Ben goes into the house through the back door. Through the windows of the house Ben makes his way through people trying to stop him and speak to him as he goes through rooms up the stairs and to his room. There is the sound of a door slamming. Ben stands with his back against the door. A long shot over Ben shows the pool area and people below. The door opens and Ben turns to see Mrs Robinson enter the room. They stand for a moment looking at each other. Mrs Robinson moves into the room and sits on the edge of the bed. She takes a cigarette from her purse lights it blows out the match and puts it down carefully on the bedspread. Ben picks up a wastebasket walks over to the bed picks up the match and puts it in the wastebasket. Ben reaches into his pocket and hands Mrs Robinson. a set of car keys. Mrs Robinson looks at him shakes her head and throws the keys to him. Ben gets out and goes around to her side opens the door and they move to the door. She takes out her key and opens the door."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "His eyes open suddenly. The view pulls back slowly from a closeup of a television screen with snow on it to reveal a long row of television sets along the ceiling of the aircraft. Pulling back from the closeup of Ben reveals a row of passengers staring straight ahead with their headsets on. Ben has not moved. The bed on which he is lying moves as though someone has sat down upon it next to him. As Ben speaks the door to the bedroom opens and Mrs Braddock looks in. They move out of the door with Mr Braddock steering Ben. Phil and Mimi Carlson are coming up the stairs as the Braddocks move down. Mrs Carlson gives Ben a broad wink and Ben tries to smile and return the wink politely. Mrs Robinson moves into the room and sits on the edge of the bed. She takes a cigarette from her purse lights it blows out the match and puts it down carefully on the bedspread. Ben picks up a wastebasket walks over to the bed picks up the match and puts it in the wastebasket. Ben reaches into his pocket and hands Mrs Robinson. a set of car keys. Mrs Robinson looks at him shakes her head and throws the keys to him. Ben gets out and goes around to her side opens the door and they move to the door. She takes out her key and opens the door."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "His eyes open suddenly. The view pulls back slowly from a closeup of a television screen with snow on it to reveal a long row of television sets along the ceiling of the aircraft. Pulling back from the closeup of Ben reveals a row of passengers staring straight ahead with their headsets on. Ben has not moved. Mrs Robinson looks at him shakes her head and throws the keys to him. Ben gets out and goes around to her side opens the door and they move to the door. She takes out her key and opens the door."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Her fingers twitch abruptly. The lens zooms out briskly from a close-up of a radio dial with static to unveil a long line of radios along the wall of the submarine. Zooming out from the close-up of Carla reveals a row of sailors glancing straight ahead with their goggles on. Carla has not budged. The hammock on which she is resting sways as if someone has plopped down upon it beside her. As Carla mumbles, the curtain to the cabin slides open, and Captain Morgan peeks in. They step out of the curtain, with Captain Sparrow guiding Carla. Ted and Linda Harper are descending the elevator as the Morgans climb up. Mrs. Harper gives Carla a sly nudge, and Carla attempts to grin and return the nudge courteously. They arrive at the corridor at the top of the elevator. Carla strides to the gate and unlatches it. Mr. Jenkins strides into the bungalow and shakes Carla's shoulder. Mr. Jenkins bolts the gate and nudges Carla back up the corridor. Mr. Jenkins swivels and strolls into the kitchen. Carla retreats to the elevator nook as three gentlemen emerge from the parlor. One gentleman clasps Carla's left shoulder, another gentleman her right, and the third tweaks the hem of her sweater. Mr. Simmons materializes behind Carla, and they gaze at each other briefly. Mr. Simmons pivots and saunters back into the bungalow. The folks at the opposite side of the courtyard peer toward Carla. Carla slips into the bungalow via the front gate. Through the portals of the bungalow, Carla navigates through acquaintances attempting to halt her and chat with her as she passes through halls, down the elevator, and to her alcove. There is the echo of a gate shutting. Carla stands with her spine against the gate. A wide-angle shot over Carla reveals the garden area and folks beneath. The gate swings open, and Carla turns to spot Mrs. Smith enter the alcove. They pause for an instant, observing each other. Mrs. Smith glides into the alcove and perches on the corner of the hammock. She extracts gum from her handbag, unwraps it, chews it thoughtfully, and places it gingerly on the quilt. Carla hoists a basket, strolls over to the hammock, scoops up the gum, and disposes of it in the basket. Carla delves into her backpack and offers Mrs. Smith a pair of sunglasses. Mrs. Smith regards her, shakes her head, and tosses the sunglasses back to her. Carla exits and circles around to her side, unlatches the gate, and they proceed to the gate. She extracts her code card and unlatches the gate."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Ben awakens abruptly on an aircraft with rows of passengers around him. As he speaks, Mrs. Braddock enters, and they exit the room with Mr. Braddock guiding him. On their way down the stairs, they encounter Mr. Loomis, who shakes Ben's hand and leads him into the house. Ben then navigates through a crowd of people, exchanging brief interactions, before retreating up to his room and shutting the door. He observes the pool area outside and is soon joined by Mrs. Robinson, who enters and sits on the bed. After an exchange involving car keys, they share a tense moment before Mrs. Robinson opens the door with her key."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She takes out her key and opens the door Ben gets out and goes around to her side opens the door and they move to the door Mrs Robinson looks at him shakes her head and throws the keys to him a set of car keys Ben reaches into his pocket and hands Mrs Robinson Ben picks up a wastebasket walks over to the bed picks up the match and puts it in the wastebasket She takes a cigarette from her purse lights it blows out the match and puts it down carefully on the bedspread Mrs Robinson moves into the room and sits on the edge of the bed They stand for a moment looking at each other The door opens and Ben turns to see Mrs Robinson enter the room A long shot over Ben shows the pool area and people below Ben stands with his back against the door There is the sound of a door slamming Through the windows of the house Ben makes his way through people trying to stop him and speak to him as he goes through rooms up the stairs and to his room Ben goes into the house through the back door The people at the other end of the yard look toward Ben Mr McQuire turns and walks back into the house Mr McQuire appears behind Ben and they look at each other for a moment One lady takes Ben's right hand another lady his left and the third fingers the front of his jacket Ben moves back to the stairway as three ladies come out of the living room Mr Loomis turns and goes into the dining room Mr Loomis closes the door and pushes Ben back down the hall Mr Loomis steps into the house and grabs Ben's hand Ben moves to the front door and opens it They reach the hall at the bottom of the stairs Mrs Carlson gives Ben a broad wink and Ben tries to smile and return the wink politely Phil and Mimi Carlson are coming up the stairs as the Braddocks move down They move out of the door with Mr Braddock steering Ben As Ben speaks the door to the bedroom opens and Mrs Braddock looks in The bed on which he is lying moves as though someone has sat down upon it next to him Ben has not moved Pulling back from the closeup of Ben reveals a row of passengers staring straight ahead with their headsets on The view pulls back slowly from a closeup of a television screen with snow on it to reveal a long row of television sets along the ceiling of the aircraft His eyes open suddenly"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The view pulls back slowly from a closeup of a television screen with snow on it to reveal a long row of television sets along the ceiling of the aircraft His eyes open suddenly Ben has not moved Pulling back from the closeup of Ben reveals a row of passengers staring straight ahead with their headsets on As Ben speaks the door to the bedroom opens and Mrs Braddock looks in The bed on which he is lying moves as though someone has sat down upon it next to him Phil and Mimi Carlson are coming up the stairs as the Braddocks move down They move out of the door with Mr Braddock steering Ben They reach the hall at the bottom of the stairs Mrs Carlson gives Ben a broad wink and Ben tries to smile and return the wink politely Mr Loomis steps into the house and grabs Ben's hand Ben moves to the front door and opens it Mr Loomis turns and goes into the dining room Mr Loomis closes the door and pushes Ben back down the hall One lady takes Ben's right hand another lady his left and the third fingers the front of his jacket Ben moves back to the stairway as three ladies come out of the living room Mr McQuire turns and walks back into the house Mr McQuire appears behind Ben and they look at each other for a moment Ben goes into the house through the back door The people at the other end of the yard look toward Ben There is the sound of a door slamming Through the windows of the house Ben makes his way through people trying to stop him and speak to him as he goes through rooms up the stairs and to his room A long shot over Ben shows the pool area and people below Ben stands with his back against the door They stand for a moment looking at each other The door opens and Ben turns to see Mrs Robinson enter the room She takes a cigarette from her purse lights it blows out the match and puts it down carefully on the bedspread Mrs Robinson moves into the room and sits on the edge of the bed Ben reaches into his pocket and hands Mrs Robinson Ben picks up a wastebasket walks over to the bed picks up the match and puts it in the wastebasket Mrs Robinson looks at him shakes her head and throws the keys to him a set of car keys She takes out her key and opens the door Ben gets out and goes around to her side opens the door and they move to the door"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Mr McQuire turns and walks back into the house The people at the other end of the yard look toward Ben Ben goes into the house through the back door Through the windows of the house Ben makes his way through people trying to stop him and speak to him as he goes through rooms up the stairs and to his room There is the sound of a door slamming Ben stands with his back against the door A long shot over Ben shows the pool area and people below The door opens and Ben turns to see Mrs Robinson enter the room They stand for a moment looking at each other Mrs Robinson moves into the room and sits on the edge of the bed She takes a cigarette from her purse lights it blows out the match and puts it down carefully on the bedspread Ben picks up a wastebasket walks over to the bed picks up the match and puts it in the wastebasket Ben reaches into his pocket and hands Mrs Robinson a set of car keys Mrs Robinson looks at him shakes her head and throws the keys to him Ben gets out and goes around to her side opens the door and they move to the door She takes out her key and opens the door His eyes open suddenly The view pulls back slowly from a closeup of a television screen with snow on it to reveal a long row of television sets along the ceiling of the aircraft Pulling back from the closeup of Ben reveals a row of passengers staring straight ahead with their headsets on Ben has not moved The bed on which he is lying moves as though someone has sat down upon it next to him As Ben speaks the door to the bedroom opens and Mrs Braddock looks in They move out of the door with Mr Braddock steering Ben Phil and Mimi Carlson are coming up the stairs as the Braddocks move down Mrs Carlson gives Ben a broad wink and Ben tries to smile and return the wink politely They reach the hall at the bottom of the stairs Ben moves to the front door and opens it Mr Loomis steps into the house and grabs Ben's hand Mr Loomis closes the door and pushes Ben back down the hall Mr Loomis turns and goes into the dining room Ben moves back to the stairway as three ladies come out of the living room One lady takes Ben's right hand another lady his left and the third fingers the front of his jacket Mr McQuire appears behind Ben and they look at each other for a moment"
        }
      ]
    }
  ]
}