{
  "ground_truth": "Ben and Elaine are walking along in front of one of the outside animal cages, with Ben a step or two behind her. Carl strides up to them, takes the pipe out of his mouth, and puts it in his pocket, reaching out to take Elaine's hands. Carl frowns and looks over Elaine's shoulder at Ben, who smiles and steps forward to grasp Carl's hand. Carl steps back and puts an arm around Elaine's shoulder. The three of them look at each other for a moment. There is another KNOCK, and Elaine is standing in the hall. Ben nods, moves in behind her, and puts his hand on her arm as several boys gather in the hallway trying to see into the room. Ben edges through the door into the hallway, opens the door a little way, and they all try to see in. The boys start back to their rooms, leaving Mr. McCleery and Ben standing and looking at each other for a few seconds before Mr. McCleery turns away, walks down the hall, and starts down the stairs. Ben turns and goes back into the room where Elaine sits in a chair, watching him as he goes to the bureau, takes some shirts from a drawer, and puts them in the suitcase before going back to the bureau. He gets down on his knees to look under the bureau, then returns to the bureau to get some socks and underwear, carrying them to the suitcase. He goes back to the bureau again, opens a drawer, takes out some T-shirts and the beer can, and carries them to the suitcase. Elaine gets up, goes to the door, and opens it, walking out and shutting the door behind her. Ben crosses to the window, and through the window, we see Elaine walking away, the length of the street until she disappears. Ben is asleep in his bed and suddenly sits up, standing in the darkness by the door. He gets out of bed, goes to her, and they kiss. She shakes her head, nods, goes to the door, opens it, and steps into the hall. He goes to the door as students move quickly from building to building. Ben is walking alongside Elaine as they move up the steps of a classroom building. Ben pushes through a lot of students to keep up with Elaine as they walk down a corridor with open doors on each side to classrooms with students filing into each of them. Elaine turns into one of the doors, leaving Ben in the hall as all the classroom doors close, and he leans against the wall.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Ben and Elaine are strolling along in front of one of the exterior creature enclosures, with Ben a pace or two behind her. Carl strides up to them, removes the pipe from his mouth, and places it in his pocket, extending a hand to take Elaine's hands. Carl scowls and looks over Elaine's shoulder at Ben, who grins and steps forward to grasp Carl's hand. Carl steps back and places an arm around Elaine's shoulder. The three of them gaze at each other for a moment. There is another KNOCK, and Elaine is standing in the hallway. Ben nods, moves in behind her, and places his hand on her arm as several boys congregate in the corridor attempting to see into the room. Ben edges through the door into the hallway, opens the door slightly, and they all attempt to see in. The boys start back to their rooms, leaving Mr. McCleery and Ben standing and looking at each other for a few seconds before Mr. McCleery turns away, marches down the hallway, and starts down the stairs. Ben turns and goes back into the room where Elaine sits in a chair, observing him as he goes to the dresser, takes some shirts from a drawer, and places them in the suitcase before going back to the dresser. He kneels to look under the dresser, then returns to the dresser to get some socks and underwear, carrying them to the suitcase. He goes back to the dresser again, opens a drawer, takes out some T-shirts and the beer can, and carries them to the suitcase. Elaine rises, goes to the door, and opens it, exiting and shutting the door behind her. Ben crosses to the window, and through the window, we see Elaine walking away, the length of the street until she vanishes. Ben is asleep in his bed and suddenly sits up, standing in the darkness by the door. He gets out of bed, goes to her, and they kiss. She shakes her head, nods, goes to the door, opens it, and steps into the hallway. He goes to the door as students move swiftly from building to building. Ben is strolling alongside Elaine as they move up the steps of a classroom building. Ben pushes through a swarm of students to keep pace with Elaine as they walk down a passageway with open doors on each side to classrooms with students filing into each one. Elaine turns into one of the doors, leaving Ben in the hallway as all the classroom doors close, and he leans against the wall."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Ben and Elaine are being walked along by Carl in front of one of the outside animal cages, with Elaine a step or two in front of him. Carl strides up to them, takes the pipe out of his mouth, and puts it in his pocket while Elaine's hands are taken by him. A frown is given by Carl, and Elaine's shoulder is looked over by him at Ben, who is smiled at and stepped forward by Carl to have his hand grasped. An arm is put around Elaine's shoulder by Carl, who steps back. They are looked at by the three of them for a moment. Another KNOCK is heard, and the hall is stood in by Elaine. A nod is given by Ben, who moves in behind her and places a hand on her arm as several boys gather in the hallway to try to see into the room. Through the door, Ben edges into the hallway, opens the door a little way, and attempts are made by them all to see in. The boys start back to their rooms, leaving Mr. McCleery and Ben standing and looking at each other for a few seconds before Mr. McCleery turns away, walks down the hall, and begins going down the stairs. The room is returned to by Ben where Elaine is sitting in a chair, watching him as he goes to the bureau, removes some shirts from a drawer, and puts them in the suitcase before going back to the bureau. His knees are gotten down on by him to look under the bureau, then the bureau is returned to by him to get some socks and underwear, carrying them to the suitcase. The bureau is approached by him again, a drawer is opened, and T-shirts and the beer can are taken out and carried to the suitcase. Elaine gets up, goes to the door, opens it, and walks out, shutting the door behind her. The window is crossed to by Ben, and through the window, Elaine is seen walking away, the length of the street until she disappears. The bed is slept in by Ben, and suddenly he sits up, standing in the darkness by the door. The bed is gotten out of by him, he goes to her, and a kiss is exchanged by them. Her head is shaken, then a nod is given by her, she goes to the door, opens it, and steps into the hall. The door is approached by him as students move quickly from building to building. Elaine is walked alongside by Ben as they move up the steps of a classroom building. A lot of students are pushed through by Ben to keep up with Elaine as a corridor is walked down by them with open doors on each side to classrooms students are filing into. Elaine turns into one of the doors, leaving Ben in the hall as all the classroom doors are closed, and he leans against the wall."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Ben and Elaine walk in front of an animal cage, with Ben slightly behind. Carl approaches, removes his pipe, and shakes Elaine's hands, then looks at Ben, who smiles and shakes Carl's hand. Carl puts an arm around Elaine. After a knock, Elaine is in the hall, and Ben follows, placing his hand on her arm as boys gather. As Ben and Mr. McCleery exchange glances, the boys leave, and Mr. McCleery departs. Inside, Ben packs clothes into a suitcase while Elaine watches. She leaves, and Ben sees her walk away through the window. Ben, initially asleep, awakes, approaches Elaine, and they kiss. She nods and exits into the hall. Ben follows her among students moving between buildings. They ascend classroom steps, and Elaine enters a room, leaving Ben in the hall as the doors close behind her."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Ben and Elaine walk in front of an animal cage, with Ben a step behind. Carl approaches, removes his pipe, and shakes Elaine's hands, frowning at Ben. Ben smiles, shakes Carl's hand, and Carl puts an arm around Elaine. They pause, then Elaine stands in the hall. Ben follows, putting his hand on her arm as boys gather, trying to see inside. Ben enters the hallway, opens the door slightly, and the boys retreat, leaving Ben and Mr. McCleery exchanging glances before McCleery departs. Ben returns to Elaine, packs shirts, socks, and T-shirts, and places a beer can in his suitcase. Elaine leaves the room, and Ben watches her walk away through the window. Ben, asleep, suddenly awakens and kisses her before she exits into the hall. Students move quickly as Ben keeps up with Elaine, walking into a classroom building. She enters a classroom, leaving Ben in the hallway, leaning against the wall as doors close."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Ben and Elaine are casually strolling together in front of one of the outdoor animal cages, with Ben trailing just a step or two behind her. As they continue their leisurely walk, Carl strides confidently up to them, removing the pipe from his mouth and slipping it into his pocket. He reaches out to take hold of Elaine's hands with a friendly gesture. Carl frowns slightly and casts a glance over Elaine's shoulder in the direction of Ben, who responds with a cheerful smile and steps forward to clasp Carl's hand warmly. Carl then steps back, placing a comforting arm around Elaine's shoulder. The three of them exchange looks for a brief moment, silently acknowledging each other's presence.\n\nSuddenly, there is another distinct KNOCK, and Elaine is now standing in the hallway. Ben gives a nod, moves to position himself behind her, and gently places his hand on her arm as several boys gather in the hallway, curiously trying to peer into the room. As Ben deftly edges through the door into the hallway, he opens it slightly, and they all collectively attempt to catch a glimpse inside. Eventually, the boys start retreating back to their rooms, leaving Mr. McCleery and Ben standing and exchanging glances for a few seconds before Mr. McCleery turns away, walks down the length of the hall, and begins his descent down the stairs.\n\nBen then turns and re-enters the room where Elaine is seated in a chair, watching intently as he approaches the bureau. He takes several shirts from a drawer and places them in the suitcase, then returns to the bureau. Getting down on his knees, Ben peers beneath the bureau before standing back up and retrieving some socks and underwear, which he carries over to the suitcase. He makes another trip back to the bureau, opens a drawer, and takes out some T-shirts along with a beer can, which he also adds to the suitcase. Elaine rises from her chair, walks to the door, opens it, and steps out, closing the door gently behind her.\n\nBen crosses over to the window, and through the glass, we can see Elaine walking away down the length of the street until she completely disappears from sight. Later, Ben is asleep in his bed but suddenly sits up, standing silently in the darkness by the door. He gets out of bed, approaches her, and they share a kiss. She shakes her head, nods in understanding, and goes to the door, opening it and stepping into the hall. He follows her to the door as students are bustling around, moving swiftly from one building to another. Ben is once again walking alongside Elaine as they ascend the steps of a classroom building. He pushes his way through a crowd of students to keep up with Elaine as they make their way down a corridor lined with classrooms, with doors open on each side as students file into them. Elaine turns into one of these doors, leaving Ben standing in the hallway as all the classroom doors close in unison, and he leans against the wall, taking a moment to reflect."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Ben and Elaine are casually strolling together, with Elaine leading by just a step or two, as they make their way in front of one of the intriguing outdoor animal cages. As they continue their leisurely walk, Carl confidently strides up to them with a purposeful air, carefully removing the pipe from his mouth and slipping it into his pocket for safekeeping. With a friendly gesture, he reaches out to warmly take hold of Elaine's hands. Carl frowns slightly, casting a glance over Elaine's shoulder in the direction of Ben. In response, Ben offers a cheerful smile, stepping forward to warmly clasp Carl's hand in a friendly manner. Carl then steps back, placing a comforting arm gently around Elaine's shoulder. For a brief moment, the three of them exchange meaningful looks, silently acknowledging each other's presence in this shared moment.\n\nSuddenly, a distinct KNOCK breaks the silence, and Elaine finds herself standing in the hallway. Ben gives a knowing nod, moves smoothly to position himself behind her, and gently places his hand on her arm. Several curious boys gather in the hallway, trying to peer into the room with a mix of eagerness and intrigue. As Ben deftly edges through the door into the hallway, he opens it slightly, creating a small opening as they all collectively attempt to catch a glimpse inside. Gradually, the boys begin to retreat back to their respective rooms, leaving Mr. McCleery and Ben standing there, exchanging glances for a few seconds before Mr. McCleery turns away. He walks down the length of the hall with measured steps and begins his descent down the stairs, leaving Ben standing quietly.\n\nBen then turns and re-enters the room where Elaine is seated comfortably in a chair, watching intently as he approaches the bureau with a focused demeanor. He steadily takes several shirts from a drawer and places them neatly in the suitcase, then returns to the bureau. Getting down on his knees, Ben peers beneath the bureau, searching carefully before standing back up. He retrieves some socks and underwear, which he carries over to the suitcase with a sense of purpose. He makes another trip back to the bureau, opens a drawer, and takes out some T-shirts along with a beer can, which he also adds to the growing contents of the suitcase. Elaine rises gracefully from her chair, walks to the door with quiet determination, opens it, and steps out, closing the door gently behind her with a sense of finality.\n\nBen crosses over to the window, and through the glass, we see Elaine walking away down the length of the street, continuing on her path until she completely disappears from sight. Later, Ben is asleep in his bed but suddenly sits up, standing silently in the darkness by the door. He gets out of bed and approaches her with quiet intensity, and they share a heartfelt kiss. She shakes her head, nods in understanding, and goes to the door, opening it and stepping into the hall with a sense of purpose. He follows her to the door as students are bustling around energetically, moving swiftly from one building to another. Ben is once again walking alongside Elaine as they ascend the steps of a bustling classroom building. He pushes his way through a crowd of students with determination to keep up with Elaine as they make their way down a corridor lined with classrooms, with doors open on each side as students file into them. Elaine turns into one of these doors, leaving Ben standing in the hallway as all the classroom doors close in unison. He leans against the wall, taking a thoughtful moment to reflect on everything that has transpired."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Ben and Elaine are walking side by side in front of one of the outside animal cages, with Ben trailing a step or two behind her, maintaining a close distance. Carl approaches them with a confident stride, removing the pipe from his mouth with one hand and smoothly slipping it into his pocket before extending his arm to gently take hold of Elaine's hands. Carl's expression changes to a frown as he shifts his gaze over Elaine's shoulder, directing a scrutinizing look towards Ben. In response to Carl's gaze, Ben offers a friendly smile and promptly steps forward, closing the distance to firmly grasp Carl's hand in a gesture of camaraderie. Carl then takes a step back, withdrawing slightly before draping his arm affectionately around Elaine's shoulder, bringing the three of them into a moment of silent exchange as they all look at each other, conveying unspoken understanding. Suddenly, the sound of a knock echoes through the scene, and Elaine finds herself standing in the hall. Ben acknowledges the situation with a nod, moves in closer behind Elaine, and gently places his hand on her arm for reassurance as a curious group of boys assembles in the hallway, their interest piqued as they try to peer into the room. Ben maneuvers himself through the narrow opening of the door into the hallway, cautiously pushing the door ajar to allow a vantage point as the group collectively attempts to glimpse inside. The boys, sensing the need to retreat, begin their trek back to their respective rooms, leaving Mr. McCleery and Ben momentarily standing opposite each other, exchanging a brief, silent look. This moment is interrupted as Mr. McCleery turns to leave, navigating his way down the hall and then descending the stairs. Ben watches him go before redirecting his attention and reentering the room where Elaine sits calmly in a chair, her eyes following Ben as he approaches the bureau. He opens a drawer, selecting some shirts and carefully placing them into an open suitcase before returning to the bureau. Kneeling, he peers under it for anything he might have missed, and then rises to collect some socks and underwear, methodically adding them to the suitcase. Returning once more to the bureau, he opens another drawer, extracting a stack of T-shirts and a beer can, which he deposits into the suitcase. Meanwhile, Elaine rises from her chair, moves towards the door, and with quiet resolve, opens it and exits the room, shutting the door softly behind her. Ben crosses the room to the window where he observes Elaine walking away, following her with his eyes as she continues the length of the street until she eventually vanishes from view. Later, as Ben lies asleep in his bed, he abruptly awakens, sitting up with a start before standing in the darkness near the door. He quickly gets out of bed, approaches Elaine, and they share a kiss. Elaine pulls back slightly, signaling her decision with a shake of her head followed by a nod, then makes her way to the door, opens it, and steps into the hall. Ben follows her to the door as a stream of students rushes by, moving swiftly from one building to another. Now, Ben walks alongside Elaine as they climb the steps toward a classroom building. As Elaine leads the way, Ben weaves through the crowd of students, determinedly keeping pace with her as they navigate down a corridor lined with open doors leading to classrooms where students are filing in. Elaine makes a decisive turn into one of the classrooms, leaving Ben standing alone in the hall as the surrounding classroom doors close synchronously, and he leans against the wall, momentarily left to his thoughts."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Ben and Elaine stroll past the outside animal cages, with Ben slightly trailing. Carl approaches, removes the pipe from his mouth, pockets it, and takes Elaine's hands. He frowns at Ben, who smiles and steps forward to shake Carl's hand, prompting Carl to step back and place an arm around Elaine. After a brief, mutual glance, a knock occurs, and Elaine stands in the hall. Ben nods, follows her, and places a hand on her arm as several boys gather to peer into the room. Ben maneuvers into the hallway, slightly opens the door, and they all attempt to see inside. The boys retreat to their rooms, leaving Mr. McCleery and Ben to exchange a look before Mr. McCleery departs down the hall and stairs. Ben returns to the room where Elaine watches him pack shirts, socks, underwear, T-shirts, and a beer can into his suitcase after rummaging through the bureau. Elaine exits the room, shutting the door as Ben watches her walk away through the window until she disappears down the street. Ben, initially asleep, sits up, then stands by the door in the dark. He rises, goes to Elaine, and they share a kiss. She shakes her head, nods, and exits into the hall, with Ben following to the door as students bustle between buildings. Ben and Elaine head up classroom building steps together. As Elaine enters a classroom, Ben, left in the hall, navigates through students and leans against the wall after classroom doors close behind her."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Ben and Elaine are walking along in front of one of the outside animal cages, likely at the city zoo known for its exotic species collection, with Ben a step or two behind her. Carl strides up to them, a known figure in the community who often visits the zoo, takes the pipe out of his mouth, and puts it in his pocket, reaching out to take Elaine's hands in a warm greeting. Carl frowns, a reflection of his protective nature, and looks over Elaine's shoulder at Ben, who smiles and steps forward to grasp Carl's hand, signaling camaraderie. Carl steps back and puts an arm around Elaine's shoulder, showing a familial bond. The three of them look at each other for a moment, sharing a silent connection. There is another KNOCK, echoing through the building’s quiet corridors, and Elaine is standing in the hall of the college dormitory. Ben nods, moves in behind her, and puts his hand on her arm as several boys gather in the hallway trying to see into the room, hoping to catch a glimpse of the commotion. Ben edges through the door into the hallway, opens the door a little way, and they all try to see in, curiosity piqued by the event. The boys start back to their rooms, leaving Mr. McCleery, the dormitory's resident advisor known for his strict but fair demeanor, and Ben standing and looking at each other for a few seconds before Mr. McCleery, with a nod of approval, turns away, walks down the hall, and starts down the stairs. Ben turns and goes back into the room where Elaine sits in a chair, watching him as he goes to the bureau, an antique piece passed down through generations, takes some shirts from a drawer, and puts them in the suitcase before going back to the bureau. He gets down on his knees to look under the bureau, checking for anything missed, then returns to the bureau to get some socks and underwear, carrying them to the suitcase. He goes back to the bureau again, opens a drawer, takes out some T-shirts and the beer can, a souvenir from a memorable college party, and carries them to the suitcase. Elaine gets up, goes to the door, and opens it, walking out and shutting the door behind her with a sense of finality. Ben crosses to the window, and through the window, we see Elaine walking away, the length of the street lined with autumn trees until she disappears into the distance. Ben is asleep in his bed and suddenly sits up, standing in the darkness by the door, feeling the weight of unspoken words. He gets out of bed, goes to her, and they kiss, a tender moment of reconciliation. She shakes her head, nods, a silent agreement passing between them, goes to the door, opens it, and steps into the hall that echoes with the sounds of students. He goes to the door as students move quickly from building to building, a typical day on campus. Ben is walking alongside Elaine as they move up the steps of a classroom building, part of the historic quadrangle known for its Neo-Gothic architecture. Ben pushes through a lot of students to keep up with Elaine as they walk down a corridor with open doors on each side to classrooms with students filing into each of them, each door marking a new possibility. Elaine turns into one of the doors, leaving Ben in the hall as all the classroom doors close, and he leans against the wall, contemplating the path ahead."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Ben edges through the door into the hallway opens the door a little way and they all try to see in He goes to the door as students move quickly from building to building Ben and Elaine are walking along in front of one of the outside animal cages with Ben a step or two behind her She shakes her head nods goes to the door opens it and steps into the hall The boys start back to their rooms leaving Mr McCleery and Ben standing and looking at each other for a few seconds before Mr McCleery turns away walks down the hall and starts down the stairs Carl strides up to them takes the pipe out of his mouth and puts it in his pocket reaching out to take Elaine's hands Elaine turns into one of the doors leaving Ben in the hall as all the classroom doors close and he leans against the wall Carl frowns and looks over Elaine's shoulder at Ben who smiles and steps forward to grasp Carl's hand He goes back to the bureau again opens a drawer takes out some Tshirts and the beer can and carries them to the suitcase Carl frowns and looks over Elaine's shoulder at Ben who smiles and steps forward to grasp Carl's hand Carl steps back and puts an arm around Elaine's shoulder The three of them look at each other for a moment There is another KNOCK and Elaine is standing in the hall Ben nods moves in behind her and puts his hand on her arm as several boys gather in the hallway trying to see into the room Ben edges through the door into the hallway opens the door a little way and they all try to see in The boys start back to their rooms leaving Mr McCleery and Ben standing and looking at each other for a few seconds before Mr McCleery turns away walks down the hall and starts down the stairs Ben turns and goes back into the room where Elaine sits in a chair watching him as he goes to the bureau takes some shirts from a drawer and puts them in the suitcase before going back to the bureau Carl strides up to them takes the pipe out of his mouth and puts it in his pocket reaching out to take Elaine's hands He gets down on his knees to look under the bureau then returns to the bureau to get some socks and underwear carrying them to the suitcase He goes back to the bureau again opens a drawer takes out some Tshirts and the beer can and carries them to the suitcase He gets down on his knees to look under the bureau then returns to the bureau to get some socks and underwear carrying them to the suitcase Ben and Elaine are walking along in front of one of the outside animal cages with Ben a step or two behind her Elaine gets up goes to the door and opens it walking out and shutting the door behind her Ben crosses to the window and through the window we see Elaine walking away the length of the street until she disappears Ben is asleep in his bed and suddenly sits up standing in the darkness by the door He gets out of bed goes to her and they kiss She shakes her head nods goes to the door opens it and steps into the hall Carl steps back and puts an arm around Elaine's shoulder He goes to the door as students move quickly from building to building Ben is walking alongside Elaine as they move up the steps of a classroom building Ben pushes through a lot of students to keep up with Elaine as they walk down a corridor with open doors on each side to classrooms with students filing into each of them Elaine turns into one of the doors leaving Ben in the hall as all the classroom doors close and he leans against the wall"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Ben and Elaine are walking along in front of one of the outside animal cages with Ben a step or two behind her. Carl strides up to them takes the pipe out of his mouth and puts it in his pocket reaching out to take Elaine's hands. Carl frowns and looks over Elaine's shoulder at Ben who smiles and steps forward to grasp Carl's hand. Carl steps back and puts an arm around Elaine's shoulder. The three of them look at each other for a moment. There is another KNOCK and Elaine is standing in the hall. Ben nods moves in behind her and puts his hand on her arm as several boys gather in the hallway trying to see into the room. Ben edges through the door into the hallway opens the door a little way and they all try to see in. The boys start back to their rooms leaving Mr McCleery and Ben standing and looking at each other for a few seconds before Mr McCleery turns away walks down the hall and starts down the stairs. Ben turns and goes back into the room where Elaine sits in a chair watching him as he goes to the bureau takes some shirts from a drawer and puts them in the suitcase before going back to the bureau. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. He gets down on his knees to look under the bureau then returns to the bureau to get some socks and underwear carrying them to the suitcase. He goes back to the bureau again opens a drawer takes out some Tshirts and the beer can and carries them to the suitcase. Elaine gets up goes to the door and opens it walking out and shutting the door behind her. Ben crosses to the window and through the window we see Elaine walking away the length of the street until she disappears. Ben is asleep in his bed and suddenly sits up standing in the darkness by the door. He gets out of bed goes to her and they kiss. She shakes her head nods goes to the door opens it and steps into the hall. He goes to the door as students move quickly from building to building. Ben is walking alongside Elaine as they move up the steps of a classroom building. Ben pushes through a lot of students to keep up with Elaine as they walk down a corridor with open doors on each side to classrooms with students filing into each of them. Elaine turns into one of the doors leaving Ben in the hall as all the classroom doors close and he leans against the wall."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Ben and Elaine are walking along in front of one of the outside animal cages with Ben a step or two behind her. Carl strides up to them takes the pipe out of his mouth and puts it in his pocket reaching out to take Elaine's hands. Carl frowns and looks over Elaine's shoulder at Ben who smiles and steps forward to grasp Carl's hand. Carl steps back and puts an arm around Elaine's shoulder. The three of them look at each other for a moment. There is another KNOCK and Elaine is standing in the hall. Ben nods moves in behind her and puts his hand on her arm as several boys gather in the hallway trying to see into the room. Ben edges through the door into the hallway opens the door a little way and they all try to see in. The boys start back to their rooms leaving Mr McCleery and Ben standing and looking at each other for a few seconds before Mr McCleery turns away walks down the hall and starts down the stairs. Ben turns and goes back into the room where Elaine sits in a chair watching him as he goes to the bureau takes some shirts from a drawer and puts them in the suitcase before going back to the bureau. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. He gets down on his knees to look under the bureau then returns to the bureau to get some socks and underwear carrying them to the suitcase. He goes back to the bureau again opens a drawer takes out some Tshirts and the beer can and carries them to the suitcase. Elaine gets up goes to the door and opens it walking out and shutting the door behind her. Ben crosses to the window and through the window we see Elaine walking away the length of the street until she disappears. Ben is asleep in his bed and suddenly sits up standing in the darkness by the door. He gets out of bed goes to her and they kiss. She shakes her head nods goes to the door opens it and steps into the hall. He goes to the door as students move quickly from building to building. Ben is walking alongside Elaine as they move up the steps of a classroom building. Ben pushes through a lot of students to keep up with Elaine as they walk down a corridor with open doors on each side to classrooms with students filing into each of them. Elaine turns into one of the doors leaving Ben in the hall as all the classroom doors close and he leans against the wall."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Ben and Elaine are walking along in front of one of the outside animal cages with Ben a step or two behind her. Carl strides up to them takes the pipe out of his mouth and puts it in his pocket reaching out to take Elaine's hands. Carl frowns and looks over Elaine's shoulder at Ben who smiles and steps forward to grasp Carl's hand. Carl steps back and puts an arm around Elaine's shoulder. The three of them look at each other for a moment. He gets out of bed goes to her and they kiss. She shakes her head nods goes to the door opens it and steps into the hall. He goes to the door as students move quickly from building to building. Ben is walking alongside Elaine as they move up the steps of a classroom building. Ben pushes through a lot of students to keep up with Elaine as they walk down a corridor with open doors on each side to classrooms with students filing into each of them. Elaine turns into one of the doors leaving Ben in the hall as all the classroom doors close and he leans against the wall."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Ben and Elaine are walking along in front of one of the outside animal cages with Ben a step or two behind her. Carl strides up to them takes the pipe out of his mouth and puts it in his pocket reaching out to take Elaine's hands. Ben is walking alongside Elaine as they move up the steps of a classroom building. Ben pushes through a lot of students to keep up with Elaine as they walk down a corridor with open doors on each side to classrooms with students filing into each of them. Elaine turns into one of the doors leaving Ben in the hall as all the classroom doors close and he leans against the wall."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The giraffe and the panda are walking along in front of one of the outside animal cages, with the giraffe a step or two behind the panda. The elephant strides up to them, takes the pipe out of its mouth, and puts it in its pocket, reaching out to take the panda's hands. The elephant frowns and looks over the panda's shoulder at the giraffe, who smiles and steps forward to grasp the elephant's hand. The elephant steps back and puts an arm around the panda's shoulder. The three of them look at each other for a moment. There is another KNOCK, and the panda is standing in the hall. The giraffe nods, moves in behind the panda, and puts its hand on its arm as several zebras gather in the hallway trying to see into the room. The giraffe edges through the door into the hallway, opens the door a little way, and they all try to see in. The zebras start back to their rooms, leaving Mr. Kangaroo and the giraffe standing and looking at each other for a few seconds before Mr. Kangaroo turns away, walks down the hall, and starts down the stairs. The giraffe turns and goes back into the room where the panda sits in a chair, watching it as it goes to the bureau, takes some shirts from a drawer, and puts them in the suitcase before going back to the bureau. It gets down on its knees to look under the bureau, then returns to the bureau to get some socks and underwear, carrying them to the suitcase. It goes back to the bureau again, opens a drawer, takes out some T-shirts and the beer can, and carries them to the suitcase. The panda gets up, goes to the door, and opens it, walking out and shutting the door behind it. The giraffe crosses to the window, and through the window, we see the panda walking away, the length of the street until it disappears. The giraffe is asleep in its bed and suddenly sits up, standing in the darkness by the door. It gets out of bed, goes to the panda, and they kiss. It shakes its head, nods, goes to the door, opens it, and steps into the hall. It goes to the door as students move quickly from building to building. The giraffe is walking alongside the panda as they move up the steps of a classroom building. The giraffe pushes through a lot of students to keep up with the panda as they walk down a corridor with open doors on each side to classrooms with students filing into each of them. The panda turns into one of the doors, leaving the giraffe in the hall as all the classroom doors close, and it leans against the wall."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Ben and Elaine are walking along in front of one of the outside botanical gardens, with Ben a step or two behind her. Carl strides up to them, takes the harmonica out of his mouth, and puts it in his pocket, reaching out to take Elaine's hands. Carl frowns and looks over Elaine's shoulder at Ben, who smiles and steps forward to grasp Carl's hand. Carl steps back and puts an arm around Elaine's shoulder. The three of them look at each other for a moment. There is another CHIME, and Elaine is standing in the atrium. Ben nods, moves in behind her, and puts his hand on her elbow as several cats gather in the atrium trying to see into the conservatory. Ben edges through the door into the atrium, opens the door a little way, and they all try to see in. The cats start back to their spots, leaving Mr. McCleery and Ben standing and looking at each other for a few seconds before Mr. McCleery turns away, walks down the atrium, and starts down the ramp. Ben turns and goes back into the conservatory, where Elaine sits in a hammock, watching him as he goes to the trunk, takes some scarves from a bin, and puts them in the backpack before going back to the trunk. He gets down on his knees to look under the trunk, then returns to the trunk to get some ties and gloves, carrying them to the backpack. He goes back to the trunk again, opens a bin, takes out some hats and the thermos, and carries them to the backpack. Elaine gets up, goes to the entrance, and opens it, walking out and shutting the entrance behind her. Ben crosses to the balcony, and through the balcony, we see Elaine walking away, the length of the park until she disappears. Ben is asleep in his hammock and suddenly sits up, standing in the moonlight by the entrance. He gets out of the hammock, goes to her, and they embrace. She shakes her head, nods, goes to the entrance, opens it, and steps into the atrium. He goes to the entrance as tourists move quickly from courtyard to courtyard. Ben is walking alongside Elaine as they move up the steps of a library building. Ben pushes through a lot of tourists to keep up with Elaine as they walk down a corridor with open archways on each side to reading rooms with tourists filing into each of them. Elaine turns into one of the archways, leaving Ben in the atrium as all the reading room doors close, and he leans against the railing."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Ben and Elaine are strolling along in front of one of the outside animal cages, with Ben a step or two behind her. Carl marches up to them, removes the pipe from his mouth, and slips it into his pocket, reaching out to shake Elaine's hands. Carl squints and glances over Elaine's shoulder at Ben, who grins and strides forward to pat Carl's hand. Carl retreats and places an arm on Elaine's shoulder. The three of them glance at each other for a moment. There is another KNOCK, and Elaine is standing in the hall. Ben winks, slides in behind her, and places his hand on her arm as several boys assemble in the hallway trying to peer into the room. Ben slips through the door into the hallway, cracks the door a little way, and they all attempt to peer in. The boys drift back to their rooms, leaving Mr. McCleery and Ben standing and gazing at each other for a few seconds before Mr. McCleery shifts away, strolls down the hall, and heads down the stairs. Ben turns and returns to the room where Elaine sits in a chair, observing him as he moves to the bureau, grabs some shirts from a drawer, and deposits them in the suitcase before returning to the bureau. He crouches on his knees to peek under the bureau, then returns to the bureau to grab some socks and underwear, transporting them to the suitcase. He heads back to the bureau again, opens a drawer, grabs some T-shirts and the beer can, and takes them to the suitcase. Elaine stands up, moves to the door, and opens it, exiting and closing the door behind her. Ben crosses to the window, and through the window, we see Elaine wandering away, the length of the street until she vanishes. Ben is napping in his bed and suddenly jerks upright, standing in the darkness by the door. He gets out of bed, approaches her, and they hug. She shrugs her head, nods, walks to the door, opens it, and steps into the hall. He goes to the door as students hustle quickly from building to building. Ben is ambling alongside Elaine as they ascend the steps of a classroom building. Ben nudges through a lot of students to keep pace with Elaine as they proceed down a corridor with open doors on each side to classrooms with students pouring into each of them. Elaine veers into one of the doors, leaving Ben in the hall as all the classroom doors shut, and he leans against the wall."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Doug and Rachel are strolling along in front of one of the outside guitar cases, with Doug a step or two behind her. Trevor strides up to them, takes the pen out of his cap, and puts it in his backpack, reaching out to take Rachel's elbows. Trevor frowns and looks over Rachel's shoulder at Doug, who smiles and steps forward to grasp Trevor's foot. Trevor steps back and puts a knee around Rachel's elbow. The three of them look at each other for a moment. There is another CLAP, and Rachel is standing in the garden. Doug nods, moves in behind her, and puts his ear on her leg as several cats gather in the garden trying to see into the stage. Doug edges through the door into the garden, opens the window a little way, and they all try to see in. The cats start back to their porches, leaving Mr. Smith and Doug standing and looking at each other for a few seconds before Mr. Smith turns away, walks down the bridge, and starts down the ramp. Doug turns and goes back into the stage where Rachel sits on a couch, watching him as he goes to the cabinet, takes some hats from a shelf, and puts them in the backpack before going back to the cabinet. He gets down on his knees to look under the cabinet, then returns to the cabinet to get some sandals and scarves, carrying them to the backpack. He goes back to the cabinet again, opens a shelf, takes out some jackets and the water bottle, and carries them to the backpack. Rachel gets up, goes to the window, and opens it, walking out and shutting the window behind her. Doug crosses to the curtain, and through the curtain, we see Rachel walking away, the length of the field until she disappears. Doug is asleep on his couch and suddenly sits up, standing in the light by the curtain. He gets out of bed, goes to her, and they hug. She shakes her elbow, nods, goes to the curtain, opens it, and steps into the garden. He goes to the curtain as teachers move quickly from tree to tree. Doug is walking alongside Rachel as they move up the trails of a library building. Doug pushes through a lot of teachers to keep up with Rachel as they walk down a corridor with open windows on each side to libraries with teachers filing into each of them. Rachel turns into one of the windows, leaving Doug in the garden as all the library windows close, and he leans against the post."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Rick and Sally are skipping along in front of one of the outside amusement rides, with Rick a step or two behind her. Dave gallops up to them, removes the hat from his head, and tucks it in his pocket, reaching out to tickle Sally's hands. Dave grimaces and glances over Sally's shoulder at Rick, who grins and hops forward to pat Dave's hand. Dave jumps back and drapes an arm around Sally's shoulder. The three of them gaze at each other for a moment. There is another BELL, and Sally is standing in the lobby. Rick winks, slides in beside her, and places his foot on her ankle as several girls gather in the hallway trying to peek into the room. Rick squeezes through the door into the hallway, nudges the door ajar, and they all try to peek in. The girls hurry back to their rooms, leaving Mr. Thompson and Rick staring at each other for a few seconds before Mr. Thompson spins around, skips down the hall, and hops down the stairs. Rick pivots and strolls back into the room where Sally is perched in a chair, eyeing him as he saunters to the bureau, plucks some scarves from a drawer, and tosses them in the suitcase before sauntering back to the bureau. He crouches to peer under the bureau, then returns to the bureau to grab some hats and socks, lugging them to the suitcase. He returns to the bureau again, slides open a drawer, snatches out some jackets and the soda can, and hauls them to the suitcase. Sally rises, strides to the door, unlatches it, and glides out while shutting the door behind her. Rick meanders to the window, and through the window, we see Sally strolling away, the length of the street until she vanishes. Rick is napping in his bed and suddenly leaps up, standing in the moonlight by the door. He clambers out of bed, approaches her, and they hug. She nods, shakes her head, marches to the door, unlatches it, and steps into the hall. He approaches the door as teachers hurry briskly from building to building. Rick is skipping next to Sally as they ascend the steps of a classroom building. Rick shuffles through a lot of teachers to keep pace with Sally as they trot down a corridor with open doors on each side to classrooms with teachers settling into each of them. Sally pivots into one of the doors, leaving Rick in the hall as all the classroom doors shut, and he props himself against the wall."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Ben and Elaine are skipping along in front of one of the outside bookcases, with Ben a step or two behind her. Carl bounces up to them, takes the pencil out of his mouth, and puts it in his pocket, reaching out to take Elaine’s backpack. Carl scowls and looks over Elaine’s shoulder at Ben, who grins and steps forward to grab Carl's wrist. Carl leaps back and puts an arm around Elaine’s waist. The three of them glance at each other for a moment. There is another BARK, and Elaine is standing in the garden. Ben winks, sidles in behind her, and places his hand on her hat as several cats gather in the garden trying to see into the shed. Ben slips through the gate into the garden, pushes the gate slightly closed, and they all try to see in. The cats scamper back to their bushes, leaving Mr. McCleery and Ben standing and staring at each other for a few seconds before Mr. McCleery turns away, skips down the garden, and begins up the ladder. Ben turns and goes back into the shed where Elaine sits on a stool, observing him as he goes to the bookshelf, takes some apples from a basket, and puts them in the backpack before going back to the bookshelf. He crouches to look under the bookshelf, then returns to the bookshelf to fetch some scarves and belts, carrying them to the backpack. He goes back to the bookshelf again, opens a cabinet, takes out some flip-flops and the water bottle, and carries them to the backpack. Elaine stands up, goes to the gate, and opens it, marching out and closing the gate behind her. Ben crosses to the window, and through the window, we see Elaine strolling away, the length of the park until she vanishes. Ben is napping on his couch and suddenly sits up, standing in the dim light by the exit. He gets off the couch, goes to her, and they hug. She tilts her head, shrugs, goes to the exit, opens it, and steps into the garden. He goes to the exit as birds flit quickly from tree to tree. Ben is skipping alongside Elaine as they hop up the steps of a library building. Ben pushes through a crowd of birds to keep up with Elaine as they stroll down an aisle with open windows on each side to libraries with birds fluttering into each of them. Elaine turns into one of the windows, leaving Ben in the aisle as all the library windows close, and he leans against the bookshelf."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Tom and Linda are skipping beside one of the indoor fish tanks, with Tom a leap or two ahead of her. Jerry marches towards them, removes the feather from his hat, and places it in his backpack, reaching out to tickle Linda's toes. Jerry scowls and peers past Linda’s elbow at Tom, who giggles and lunges forward to swat Jerry's elbow. Jerry shuffles backward and sets an ankle around Linda’s waist. The three of them stare at one another for a moment. There is another CHIME, and Linda is lounging in the garden. Tom winks, slides in front of her, and places his nose on her elbow as several cats gather in the garden trying to peek into the greenhouse. Tom shuffles through the arch into the garden, swings the gateway slightly ajar, and they all attempt to peek inside. The cats slink back to their nooks, leaving Mr. Hedges and Tom staring at each other for a few seconds before Mr. Hedges spins away, skips through the garden, and begins leaping down the ladder. Tom twirls and prances back into the greenhouse where Linda perches on a stool, observing him as he skips to the dresser, extracts some scarves from a compartment, and tucks them into the backpack before skipping back to the dresser. He kneels on his elbows to peer under the dresser, then skips back to the dresser to grab some gloves and hats, ferrying them to the backpack. He skips back to the dresser again, pries open a compartment, extracts some mittens and the soda bottle, and ferries them to the backpack. Linda hops up, saunters to the portal, and swings it open, skipping out and closing the portal behind her. Tom prances to the skylight, and through the skylight, we see Linda skipping away, the length of the avenue until she vanishes. Tom is dozing on his sofa and suddenly bounces up, standing in the shadows by the gateway. He jumps off the sofa, skips to her, and they hug. She tilts her head, nods, skips to the gateway, swings it open, and hops into the meadow. He hops to the gateway as dancers twirl swiftly from structure to structure. Tom is skipping beside Linda as they hop up the ramp of a dormitory building. Tom bumps through a crowd of dancers to keep pace with Linda as they skip down a corridor with ajar portals on each side to dormitories with dancers shuffling into each of them. Linda veers into one of the portals, abandoning Tom in the corridor as all the dormitory portals swing shut, and he slumps against the beam."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Ben and Elaine walk in front of an animal cage, with Ben trailing slightly. Carl approaches, puts away his pipe, and greets them by taking Elaine's hands. Carl, Ben, and Elaine exchange a tense glance before a knock interrupts them, prompting Ben to guide Elaine through a crowded hallway where boys try to peer into a room. Mr. McCleery and Ben share a brief look before McCleery leaves, and Ben packs clothes into a suitcase. After Elaine exits, Ben watches her walk away through the window. Later, Ben wakes suddenly in bed, goes to Elaine, and they kiss before she leaves. Ben accompanies Elaine to a classroom building, struggling to keep up. They part ways as Elaine enters a classroom, leaving Ben alone in the hall as the doors close around him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Elaine turns into one of the doors leaving Ben in the hall as all the classroom doors close and he leans against the wall Ben pushes through a lot of students to keep up with Elaine as they walk down a corridor with open doors on each side to classrooms with students filing into each of them Ben is walking alongside Elaine as they move up the steps of a classroom building He goes to the door as students move quickly from building to building She shakes her head nods goes to the door opens it and steps into the hall He gets out of bed goes to her and they kiss Ben is asleep in his bed and suddenly sits up standing in the darkness by the door Ben crosses to the window and through the window we see Elaine walking away the length of the street until she disappears Elaine gets up goes to the door and opens it walking out and shutting the door behind her He goes back to the bureau again opens a drawer takes out some Tshirts and the beer can and carries them to the suitcase He gets down on his knees to look under the bureau then returns to the bureau to get some socks and underwear carrying them to the suitcase Ben turns and goes back into the room where Elaine sits in a chair watching him as he goes to the bureau takes some shirts from a drawer and puts them in the suitcase before going back to the bureau The boys start back to their rooms leaving Mr McCleery and Ben standing and looking at each other for a few seconds before Mr McCleery turns away walks down the hall and starts down the stairs Ben edges through the door into the hallway opens the door a little way and they all try to see in Ben nods moves in behind her and puts his hand on her arm as several boys gather in the hallway trying to see into the room There is another KNOCK and Elaine is standing in the hall The three of them look at each other for a moment Carl steps back and puts an arm around Elaine's shoulder Carl frowns and looks over Elaine's shoulder at Ben who smiles and steps forward to grasp Carl's hand Carl strides up to them takes the pipe out of his mouth and puts it in his pocket reaching out to take Elaine's hands Ben and Elaine are walking along in front of one of the outside animal cages with Ben a step or two behind her"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Ben pushes through a lot of students to keep up with Elaine as they walk down a corridor with open doors on each side to classrooms with students filing into each of them There is another KNOCK and Elaine is standing in the hall Ben is asleep in his bed and suddenly sits up standing in the darkness by the door The three of them look at each other for a moment Ben turns and goes back into the room where Elaine sits in a chair watching him as he goes to the bureau takes some shirts from a drawer and puts them in the suitcase before going back to the bureau Ben crosses to the window and through the window we see Elaine walking away the length of the street until she disappears He gets out of bed goes to her and they kiss Ben is walking alongside Elaine as they move up the steps of a classroom building Ben nods moves in behind her and puts his hand on her arm as several boys gather in the hallway trying to see into the room Elaine gets up goes to the door and opens it walking out and shutting the door behind her He goes to the door as students move quickly from building to building He gets down on his knees to look under the bureau then returns to the bureau to get some socks and underwear carrying them to the suitcase Carl strides up to them takes the pipe out of his mouth and puts it in his pocket reaching out to take Elaine's hands He goes back to the bureau again opens a drawer takes out some Tshirts and the beer can and carries them to the suitcase Carl frowns and looks over Elaine's shoulder at Ben who smiles and steps forward to grasp Carl's hand She shakes her head nods goes to the door opens it and steps into the hall Ben edges through the door into the hallway opens the door a little way and they all try to see in The boys start back to their rooms leaving Mr McCleery and Ben standing and looking at each other for a few seconds before Mr McCleery turns away walks down the hall and starts down the stairs Ben and Elaine are walking along in front of one of the outside animal cages with Ben a step or two behind her Carl steps back and puts an arm around Elaine's shoulder Elaine turns into one of the doors leaving Ben in the hall as all the classroom doors close and he leans against the wall"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He goes back to the bureau again opens a drawer takes out some Tshirts and the beer can and carries them to the suitcase Elaine gets up goes to the door and opens it walking out and shutting the door behind her Ben crosses to the window and through the window we see Elaine walking away the length of the street until she disappears Ben is asleep in his bed and suddenly sits up standing in the darkness by the door He gets out of bed goes to her and they kiss She shakes her head nods goes to the door opens it and steps into the hall He goes to the door as students move quickly from building to building Ben is walking alongside Elaine as they move up the steps of a classroom building Ben pushes through a lot of students to keep up with Elaine as they walk down a corridor with open doors on each side to classrooms with students filing into each of them Elaine turns into one of the doors leaving Ben in the hall as all the classroom doors close and he leans against the wall Ben and Elaine are walking along in front of one of the outside animal cages with Ben a step or two behind her Carl strides up to them takes the pipe out of his mouth and puts it in his pocket reaching out to take Elaine's hands Carl frowns and looks over Elaine's shoulder at Ben who smiles and steps forward to grasp Carl's hand Carl steps back and puts an arm around Elaine's shoulder The three of them look at each other for a moment There is another KNOCK and Elaine is standing in the hall Ben nods moves in behind her and puts his hand on her arm as several boys gather in the hallway trying to see into the room Ben edges through the door into the hallway opens the door a little way and they all try to see in The boys start back to their rooms leaving Mr McCleery and Ben standing and looking at each other for a few seconds before Mr McCleery turns away walks down the hall and starts down the stairs Ben turns and goes back into the room where Elaine sits in a chair watching him as he goes to the bureau takes some shirts from a drawer and puts them in the suitcase before going back to the bureau He gets down on his knees to look under the bureau then returns to the bureau to get some socks and underwear carrying them to the suitcase"
        }
      ]
    }
  ]
}