{
  "ground_truth": "Standing poised by the door, the classroom doors open and students start to file out. Elaine comes out of the classroom and starts walking down the corridor towards the exit door, with Ben following her, moving out of the way of the other students. Elaine and twenty other girls are in basketball uniforms as Elaine sits on the bench, watching. Ben stands behind her, and she turns and looks at him. Elaine jumps up, applauding a shot, and several other girls run onto the court while a number of girls run off the court to the bench. Later, Ben is seated across a study table from Elaine with many other students scattered around the room. She starts to get up and begins to move away. Ben and Elaine are standing at the entrance, and Ben remains standing in exactly the same position. After a few moments, the door opens, Elaine comes out, steps quickly to Ben, kisses him, then runs back inside. Ben turns and starts away from the door as a tall bearded man comes out and goes past Ben. Through the window of a hippy jewelry store, a saleswoman is modeling a ring for Ben. He nods, she takes it off, puts it in a box and gives it to him. He pays for it and exits past the camera, whistling. Ben enters carrying four oddly shaped boxes and some flowers, whistling happily as he runs up the stairs two at a time. He opens the door to his room and steps in; the room is dark and the figure of a man is silhouetted against the window. Ben freezes just inside the door before taking a step forward. Mr. Robinson stands at the door, opens it, and starts into the hall, then turns back from the hall. Mr. Robinson starts down the stairs, where Mr. McCleery is standing on the stairway, listening. Mr. Robinson turns and goes down the stairs, past Mr. McCleery, who looks up at Ben. Ben walks to the door, looks out into the hall at Mr. McCleery, then shuts the door. He stuffs the money back in his pocket and runs down the stairs and out of the building. Through the door, we see him run down the street and out of sight, with Ben reacting. The elevator at the end of the hall opens, and a fat girl walks toward us with an envelope in her hand, then walks into the camera. Ben is driving his car as the sound of an envelope being read is heard. Ben follows her through the hall into Mrs. Robinson's room, where Mrs. Robinson, without stopping, puts Elaine's clothes down next to a half-packed open suitcase on her bed and moves to a telephone on the night table.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Standing balanced by the entryway, the classroom portals open and pupils begin to file out. Elaine emerges from the classroom and starts strolling down the hallway towards the egress door, with Ben trailing her, shifting out of the path of the other pupils. Elaine and twenty other girls are in basketball attire as Elaine perches on the seat, observing. Ben stands behind her, and she rotates and gazes at him. Elaine leaps up, applauding a basket, and several other girls dash onto the court while a number of girls sprint off the court to the seat. Later, Ben is sitting across a study table from Elaine with many other pupils scattered around the chamber. She starts to rise and initiates to move away. Ben and Elaine are standing at the entrance, and Ben remains standing in precisely the same stance. After a few moments, the door opens, Elaine emerges, steps quickly to Ben, kisses him, then runs back indoors. Ben rotates and starts away from the door as a tall bearded gentleman emerges and goes past Ben. Through the window of a hippy jewelry shop, a saleswoman is displaying a ring for Ben. He nods, she removes it, places it in a box and hands it to him. He pays for it and departs past the camera, whistling. Ben enters carrying four oddly shaped cartons and some blossoms, whistling joyfully as he ascends the stairs two at a time. He opens the door to his chamber and steps in; the chamber is dark and the silhouette of a gentleman is outlined against the window. Ben freezes just inside the door before taking a step forward. Mr. Robinson stands at the door, opens it, and starts into the corridor, then rotates back from the corridor. Mr. Robinson starts down the stairs, where Mr. McCleery is standing on the stairway, listening. Mr. Robinson rotates and descends the stairs, past Mr. McCleery, who glances up at Ben. Ben walks to the door, gazes out into the corridor at Mr. McCleery, then closes the door. He stuffs the cash back in his pocket and dashes down the stairs and out of the edifice. Through the door, we see him dash down the street and out of view, with Ben reacting. The elevator at the end of the corridor opens, and an overweight girl walks toward us with an envelope in her hand, then walks into the camera. Ben is driving his vehicle as the sound of an envelope being read is heard. Ben follows her through the corridor into Mrs. Robinson's chamber, where Mrs. Robinson, without pausing, places Elaine's garments down next to a half-packed open suitcase on her bed and moves to a telephone on the nightstand."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Poised by the door, the classroom doors are opened and students are started to be filed out. The classroom is exited by Elaine, and she is followed down the corridor towards the exit door by Ben, who is moved out of the way of the other students. Basketball uniforms are worn by Elaine and twenty other girls as she is seated on the bench, watching. Elaine is stood behind by Ben, and she is looked at by him as she turns. A shot is applauded by Elaine as she jumps up, and the court is run onto by several other girls while the bench is run off to by a number of girls. Later, Ben sits across a study table from Elaine with many other students scattered around the room. She gets up and moves away. At the entrance, Ben and Elaine stand, with Ben remaining in exactly the same position. After a few moments, the door is opened, Elaine comes out, quickly steps to Ben, kisses him, then runs back inside. The door is started away from by Ben as it is exited by a tall bearded man who goes past Ben. Through the window of a hippy jewelry store, a ring is modeled for Ben by a saleswoman. He nods, it is taken off by her, put in a box, and given to him. He pays for it and is exited past the camera by him, whistling. Ben enters, carrying four oddly shaped boxes and some flowers, whistling happily as the stairs are run up by him two at a time. The door to his room is opened by him and he steps in; the room is dark, and the figure of a man is silhouetted against the window. Ben freezes just inside the door before a step is taken forward by him. The door is stood at by Mr. Robinson, opened, and he starts into the hall, then turns back from the hall. The stairs are started down by Mr. Robinson, where Mr. McCleery is standing on the stairway, listening. The stairs are turned and gone down by Mr. Robinson, past Mr. McCleery, who looks up at Ben. The door is walked to by Ben, and he looks out into the hall at Mr. McCleery, then shuts the door. The money is stuffed back in his pocket, and the stairs and out of the building are run down by him. He is seen through the door running down the street and out of sight, with Ben reacting. The elevator at the end of the hall is opened, a fat girl walks toward us with an envelope in her hand, then the camera is walked into by her. Ben is driven by his car as the sound of an envelope being read is heard. Her is followed by Ben through the hall into Mrs. Robinson's room, where Elaine's clothes are put down by Mrs. Robinson, without stopping, next to a half-packed open suitcase on her bed, and she moves to a telephone on the night table."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "As students file out, Elaine exits the classroom and walks down the corridor with Ben following, avoiding other students. She and twenty girls in basketball uniforms head to the bench. Elaine applauds a shot as girls run on and off the court. Later, at a study table, Ben sits with Elaine and other students. Elaine gets up, moves away, and at the entrance, kisses Ben before running back. Ben leaves as a tall bearded man passes him. In a jewelry store, a saleswoman models a ring for Ben, who nods, purchases it, and exits, whistling. Holding four boxes and flowers, Ben happily runs upstairs, enters his dark room to find a silhouette of a man. Mr. Robinson enters the hall, turns back, heads downstairs past Mr. McCleery, who watches Ben. Ben shuts the door, pockets his money, and runs out. He disappears down the street. An elevator opens, and a girl with an envelope walks into the camera. Ben drives as an envelope is read aloud. He follows into Mrs. Robinson's room, where she places Elaine's clothes by a suitcase and moves to the phone."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Students exit the classroom as Elaine walks down the corridor toward the exit, with Ben following. Elaine and twenty girls in basketball uniforms transition to a court scene. Later, Ben and Elaine study together before she leaves briefly, returns to kiss Ben, and runs back inside. Ben encounters a bearded man, visits a jewelry store, and buys a ring. He joyfully carries boxes and flowers upstairs, only to find a silhouetted figure in his dark room. Mr. Robinson enters and departs a hall, passing Mr. McCleery. Ben rushes out, seen running down the street. A girl with an envelope approaches the camera. Ben drives as an envelope is read, leading him through the hall into Mrs. Robinson's room, where Elaine's clothes lay beside a suitcase while Mrs. Robinson uses the phone."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Standing poised and ready by the door, the classroom doors slowly swing open, allowing students to begin filing out in an organized manner. Elaine emerges from the classroom's bustling interior and starts walking at a steady pace down the corridor toward the exit door, with Ben following closely behind her, carefully moving aside to avoid colliding with the other students making their way through. Elaine, along with twenty other girls, is dressed in vibrant basketball uniforms, and she soon takes her seat on the bench, watching the game unfold. Ben stands attentively behind her, catching her gaze as she turns to look at him. Suddenly, Elaine leaps up, cheering and applauding an impressive shot, as several other enthusiastic girls dash energetically onto the court while a number of players run off to take a break on the bench. \n\nLater, Ben is seated across a crowded study table from Elaine, surrounded by many other diligent students scattered throughout the room. Elaine begins to rise from her seat and starts moving away. Ben and Elaine find themselves standing at the entrance, with Ben remaining motionless, rooted in exactly the same position. After a brief pause, the door opens, and Elaine steps out briskly, quickly heading toward Ben. She reaches him, kisses him warmly, then swiftly retreats back inside. Ben turns around and starts moving away from the door just as a tall, bearded man emerges and passes by him. In front of a window belonging to a hippy jewelry store, a saleswoman is modeling a ring for Ben. He nods in approval, and she carefully removes it, places it into a small box, and hands it over to him. Ben promptly pays for the item and exits past the camera, whistling a cheerful tune.\n\nBen enters his building, carrying four oddly shaped boxes and a bouquet of flowers, whistling with joy as he bounds up the stairs two steps at a time. Upon reaching the door to his room, he pushes it open and steps inside to find the room shrouded in darkness, with the silhouette of a man outlined against the dimly lit window. Ben pauses just inside the threshold before cautiously taking a step forward. Mr. Robinson appears at the door, opens it, and starts toward the hall, only to turn back momentarily. Mr. Robinson then begins his descent down the stairs, where Mr. McCleery is stationed on the stairway, listening intently. Mr. Robinson continues his way down past Mr. McCleery, who glances up at Ben. Ben approaches the door, peering out into the hall to catch sight of Mr. McCleery, before closing the door firmly.\n\nHe quickly stuffs the money back into his pocket and bursts down the stairs, rushing out of the building. Through the door, we see him sprinting down the street, vanishing out of view, with Ben reacting to the events unfolding. The elevator at the end of the hall opens, and a heavyset girl walks toward the camera with an envelope in her hand and then walks right into the frame abruptly. Meanwhile, Ben is driving his car, and we hear the sound of an envelope being read aloud. Ben trails after her, following through the hall into Mrs. Robinson's room, where Mrs. Robinson, without missing a beat, places Elaine's clothes next to a half-packed, open suitcase resting on her bed and moves toward a telephone situated on the night table."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Standing poised and ready by the door, the classroom doors gradually swing open, allowing a stream of diligent students to begin filing out in a remarkably organized manner. Elaine emerges gracefully from the bustling interior of the classroom and commences walking serenely at a steady pace down the long corridor, making her way toward the exit door. Trailing closely behind her is Ben, who is carefully maneuvering to avoid colliding with the other students as they continue to make their way through the busy hallway. Elaine, along with twenty other girls, is dressed in vibrant and eye-catching basketball uniforms. Soon, she finds her place on the bench, attentively watching the game unfold with great interest. Ben stands attentively behind her, meeting her gaze as she turns to look at him briefly. Suddenly, Elaine leaps up with enthusiasm, cheering and applauding an impressive shot. In response, several other enthusiastic girls dash energetically onto the court while a number of players run off to take a break on the bench.\n\nLater on, Ben finds himself seated across from Elaine at a crowded study table, surrounded by many other diligent students scattered throughout the room, each engrossed in their own tasks. Elaine slowly begins to rise from her seat and starts moving away. Ben and Elaine eventually find themselves standing together at the entrance of the room, with Ben remaining motionless, rooted exactly in the same position as before. After a brief pause, the door swings open, and Elaine steps out briskly, quickly making her way toward Ben. She reaches him and, with affectionate warmth, kisses him before swiftly retreating back inside. Ben then turns around and begins to move away from the door just as a tall, bearded man emerges, walking past him. In front of a window belonging to a hippy jewelry store, a saleswoman is intently modeling a ring for Ben's consideration. He nods approvingly and, with care, she removes it, placing it into a small box before handing it over to him with a smile. Ben promptly pays for the item and exits, passing by the camera while whistling a cheerful and upbeat tune.\n\nBen enters his building carrying four oddly shaped boxes along with a bouquet of flowers, whistling with joy as he bounds up the stairs, taking two steps at a time with energetic enthusiasm. Upon reaching the door to his room, he pushes it open and steps inside, only to find the space shrouded in darkness, with a mysterious silhouette of a man outlined against the dimly lit window. Ben pauses momentarily just inside the threshold before cautiously taking a step forward. Mr. Robinson appears at the door, opens it wide, and starts toward the hall, momentarily turning back for a brief second. Mr. Robinson subsequently begins his descent down the stairs, where Mr. McCleery is attentively stationed on the stairway, listening closely. Mr. Robinson continues his way down past Mr. McCleery, who glances up at Ben. Ben approaches the door and peers out into the hall to catch sight of Mr. McCleery before closing the door firmly behind him.\n\nHe quickly stuffs the money back into his pocket and bursts down the stairs, rushing out of the building with urgency. Through the door's glass pane, we can see him sprinting down the street, vanishing rapidly out of view, with Ben reacting to the swift unfolding of events. The elevator at the end of the hall opens, and a heavyset girl walks determinedly toward the camera with an envelope in her hand, entering the frame abruptly. Meanwhile, Ben is driving his car, and we hear the distinct sound of an envelope being read aloud. Ben trails after her, following through the hall and into Mrs. Robinson's room, where Mrs. Robinson, without missing a beat, places Elaine's clothes neatly next to a half-packed, open suitcase resting on her bed. She then moves toward a telephone situated conveniently on the nearby night table."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Standing still and composed by the door, the classroom doors swing open, prompting a steady stream of students to begin filing out of the classroom in a seemingly endless line. Elaine emerges from the classroom amidst the crowd and makes her way down the corridor toward the exit door with a purposeful stride, with Ben close behind, skillfully maneuvering his way around the throng of students bustling all around. Elaine and a group of around twenty girls, all clad in matching basketball uniforms, make their way into the gym. As Elaine settles onto the bench, she intently observes the ongoing game, while Ben stands quietly behind her. Noticing his presence, she turns her head to look at him. In a burst of excitement, Elaine leaps up from the bench and applauds enthusiastically as a shot is successfully made, causing several girls to rush onto the court while another group dashes off the court toward the bench. Transitioning to a quieter setting, Ben is now seated across a study table from Elaine, surrounded by a plethora of other students scattered throughout the room, deeply engrossed in their various assignments. Elaine begins to rise from her seat, making her way toward the exit. Shortly thereafter, Ben and Elaine find themselves standing together at the entrance, with Ben remaining rooted to the spot, his position unchanged. After a brief interval, the door swings open, and Elaine steps out briskly, closes the distance to Ben, plants a quick kiss on him, and then swiftly retreats back inside. Ben turns away from the door and begins to walk down the hall just as a tall, bearded man exits through the same doorway and passes by Ben. Moving to a different scene, Ben peers through the window of a hippy jewelry store where a saleswoman is meticulously modeling a ring for him. Satisfied, he nods, prompting the saleswoman to remove the ring, place it carefully into a box, and hand it over to him. After completing the payment, he exits the store, carrying the box with an air of satisfaction, whistling contentedly as he passes by the camera. Bursting with energy, Ben enters another building, juggling an assortment of four oddly shaped boxes along with some flowers, still whistling in high spirits as he bounds up the stairs two at a time. He reaches his room, opens the door, and steps inside, only to be greeted by near darkness, where the silhouette of a man looms against the window, casting an eerie shadow. Frozen momentarily just inside the threshold, Ben then gathers his composure and takes a cautious step forward. Mr. Robinson, standing by the door, opens it and begins to make his way into the hallway, only to pause, turn back from the hall, and proceed down the stairs. On the stairway, Mr. McCleery stands, listening intently. Mr. Robinson continues his descent, passing by Mr. McCleery, who in turn glances up toward Ben. Ben approaches the door, peers out into the hallway at Mr. McCleery, and then firmly shuts the door behind him. With haste, Ben stuffs the money back into his pocket, rushes down the stairs, and bolts out of the building, leaving a sense of urgency in his wake. Through the door's glass panel, he can be seen sprinting down the street until he vanishes from sight, the scene capturing Ben's reaction. Farther down the hallway, the elevator doors slide open, and a rotund girl emerges, making her way toward the camera with an envelope clutched in her hand, eventually walking directly into the frame. Shifting to a different situation, Ben is now behind the wheel of his car, with the sound of an envelope being read aloud echoing around him as he listens. Following her through the hall, Ben makes his way into Mrs. Robinson's room, where unperturbed, Mrs. Robinson places Elaine's clothes carefully next to a half-packed open suitcase on her bed and smoothly transitions over to the telephone resting on the night table nearby."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Standing poised by the door, Elaine exits the classroom along with other students, making her way down the corridor toward the exit, closely followed by Ben. Elaine, along with twenty other girls in basketball uniforms, sits on the bench watching the game while Ben stands behind her. Elaine jumps up to applaud a shot as several girls swap places on the court. Later, Ben and Elaine are seated across a study table among other students. Elaine rises and moves away. At the entrance, Ben stands waiting, and as Elaine quickly steps out, she kisses him before returning inside. Ben turns to leave just as a tall bearded man passes by. In a hippy jewelry store, Ben purchases a ring after approving it, exits whistling, and carries four oddly shaped boxes and flowers as he happily ascends the stairs to his room. Inside the dimly lit room, he momentarily freezes upon seeing a silhouetted figure by the window before stepping forward. Mr. Robinson appears at the door, starts toward the hall, then changes course and descends the stairs past Mr. McCleery, who watches Ben intently. Ben shuts the door, pockets his money, and sprints out of the building and down the street. The elevator opens to reveal a girl approaching with an envelope. Ben drives his car, his thoughts occupied with the contents of the envelope, and follows the girl into Mrs. Robinson's room, where Mrs. Robinson places Elaine's clothes next to a half-packed suitcase and answers the phone."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Standing poised by the door, the classroom doors open as the last bell of the day rings and students start to file out. Elaine comes out of the classroom and starts walking down the corridor of Jefferson High School, a place known for its state championship-winning teams, towards the exit door, with Ben following her, skillfully moving out of the way of the other students. Elaine and twenty other girls, who are part of the school's prestigious basketball team, are in basketball uniforms as Elaine sits on the bench, watching the heated practice match. Ben, her long-time friend since elementary school, stands behind her, and she turns and looks at him. Elaine jumps up, applauding a shot that was reminiscent of their recent game, and several other girls run onto the court to continue the practice while a number of girls run off the court to the bench. Later, Ben is seated across a study table from Elaine, which is covered in books and notes, in the bustling university library with many other students scattered around the room. She starts to get up and begins to move away, needing to attend her next class. Ben and Elaine are standing at the entrance, a common meeting spot for students, and Ben remains standing in exactly the same position. After a few moments, the door opens, Elaine comes out, steps quickly to Ben, kisses him with the affection of a long-term relationship, then runs back inside. Ben turns and starts away from the door as a tall bearded man, a professor known for his eccentric lectures, comes out and goes past Ben. Through the window of a hippy jewelry store known for its eclectic collection, a saleswoman with an eye for matching her customers to perfect pieces is modeling a ring for Ben. He nods, she takes it off, puts it in a box and gives it to him. He pays for it and exits past the camera, whistling a tune from his favorite band. Ben enters carrying four oddly shaped boxes from the local bakery and some flowers from the florist, whistling happily as he runs up the stairs two at a time, eager to surprise Elaine. He opens the door to his room and steps in; the room is dark and the figure of a man, familiar from an earlier encounter, is silhouetted against the window. Ben freezes just inside the door before taking a step forward. Mr. Robinson, Elaine’s father with a stern reputation, stands at the door, opens it, and starts into the hall, then turns back from the hall. Mr. Robinson starts down the stairs, where Mr. McCleery, their nosy neighbor known for always being in the wrong place at the wrong time, is standing on the stairway, listening. Mr. Robinson turns and goes down the stairs, past Mr. McCleery, who looks up at Ben with curiosity. Ben walks to the door, looks out into the hall at Mr. McCleery, then shuts the door hastily. He stuffs the money meant for the surprise celebration back in his pocket and runs down the stairs and out of the building, deciding to avoid any more confrontations. Through the door, we see him run down the street, a common escape route for him, and out of sight, with Ben reacting to the rush of adrenaline. The elevator at the end of the hall opens, and a fat girl, a well-known local courier who delivers messages with discretion, walks toward us with an envelope in her hand, then walks into the camera. Ben is driving his car as the sound of an envelope being read, with Elaine's familiar handwriting, is heard. Ben follows her through the hall into Mrs. Robinson's room, where Mrs. Robinson, who is often absorbed in her own world, without stopping, puts Elaine's clothes down next to a half-packed open suitcase on her bed and moves to a telephone on the night table, perhaps to make a last-minute call."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Elaine and twenty other girls are in basketball uniforms as Elaine sits on the bench watching Standing poised by the door the classroom doors open and students start to file out After a few moments the door opens Elaine comes out of the classroom and starts walking down the corridor towards the exit door with Ben following her moving out of the way of the other students Mr Robinson turns and goes down the stairs past Mr McCleery who looks up at Ben Elaine and twenty other girls are in basketball uniforms as Elaine sits on the bench watching Ben stands behind her and she turns and looks at him Elaine jumps up applauding a shot and several other girls run onto the court while a number of girls run off the court to the bench Ben stands behind her and she turns and looks at him Standing poised by the door the classroom doors open and students start to file out He pays for it and exits past the camera whistling Later Ben is seated across a study table from Elaine with many other students scattered around the room She starts to get up and begins to move away Ben and Elaine are standing at the entrance and Ben remains standing in exactly the same position Ben and Elaine are standing at the entrance and Ben remains standing in exactly the same position After a few moments the door opens Elaine jumps up applauding a shot and several other girls run onto the court while a number of girls run off the court to the bench Elaine comes out steps quickly to Ben kisses him then runs back inside Ben turns and starts away from the door as a tall bearded man comes out and goes past Ben Ben freezes just inside the door before taking a step forward Through the window of a hippy jewelry store a saleswoman is modeling a ring for Ben Ben enters carrying four oddly shaped boxes and some flowers whistling happily as he runs up the stairs two at a time He nods she takes it off puts it in a box and gives it to him Through the door we see him run down the street and out of sight with Ben reacting He pays for it and exits past the camera whistling Ben enters carrying four oddly shaped boxes and some flowers whistling happily as he runs up the stairs two at a time He opens the door to his room and steps in the room is dark and the figure of a man is silhouetted against the window The elevator at the end of the hall opens and a fat girl walks toward us with an envelope in her hand then walks into the camera Ben freezes just inside the door before taking a step forward Mr Robinson stands at the door opens it and starts into the hall then turns back from the hall Mr Robinson starts down the stairs where Mr McCleery is standing on the stairway listening Ben walks to the door looks out into the hall at Mr McCleery then shuts the door Ben is driving his car as the sound of an envelope being read is heard Mr Robinson turns and goes down the stairs past Mr McCleery who looks up at Ben Ben walks to the door looks out into the hall at Mr McCleery then shuts the door He stuffs the money back in his pocket and runs down the stairs and out of the building Through the door we see him run down the street and out of sight with Ben reacting The elevator at the end of the hall opens and a fat girl walks toward us with an envelope in her hand then walks into the camera Ben is driving his car as the sound of an envelope being read is heard Ben follows her through the hall into Mrs Robinson's room where Mrs Robinson without stopping puts Elaine's clothes down next to a halfpacked open suitcase on her bed and moves to a telephone on the night table"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Standing poised by the door the classroom doors open and students start to file out. Elaine comes out of the classroom and starts walking down the corridor towards the exit door with Ben following her moving out of the way of the other students. Elaine and twenty other girls are in basketball uniforms as Elaine sits on the bench watching. Ben stands behind her and she turns and looks at him. Elaine jumps up applauding a shot and several other girls run onto the court while a number of girls run off the court to the bench. Later Ben is seated across a study table from Elaine with many other students scattered around the room. She starts to get up and begins to move away. Ben and Elaine are standing at the entrance and Ben remains standing in exactly the same position. After a few moments the door opens. Elaine comes out steps quickly to Ben kisses him then runs back inside. Ben turns and starts away from the door as a tall bearded man comes out and goes past Ben. Through the window of a hippy jewelry store a saleswoman is modeling a ring for Ben. He nods she takes it off puts it in a box and gives it to him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. He pays for it and exits past the camera whistling. Ben enters carrying four oddly shaped boxes and some flowers whistling happily as he runs up the stairs two at a time. He opens the door to his room and steps in. the room is dark and the figure of a man is silhouetted against the window. Ben freezes just inside the door before taking a step forward. Mr Robinson stands at the door opens it and starts into the hall then turns back from the hall. Mr Robinson starts down the stairs where Mr McCleery is standing on the stairway listening. Mr Robinson turns and goes down the stairs past Mr McCleery who looks up at Ben. Ben walks to the door looks out into the hall at Mr McCleery then shuts the door. He stuffs the money back in his pocket and runs down the stairs and out of the building. Through the door we see him run down the street and out of sight with Ben reacting. The elevator at the end of the hall opens and a fat girl walks toward us with an envelope in her hand then walks into the camera. Ben is driving his car as the sound of an envelope being read is heard. Ben follows her through the hall into Mrs Robinson's room where Mrs Robinson without stopping puts Elaine's clothes down next to a halfpacked open suitcase on her bed and moves to a telephone on the night table."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Standing poised by the door the classroom doors open and students start to file out. Elaine comes out of the classroom and starts walking down the corridor towards the exit door with Ben following her moving out of the way of the other students. Elaine and twenty other girls are in basketball uniforms as Elaine sits on the bench watching. Ben stands behind her and she turns and looks at him. Elaine jumps up applauding a shot and several other girls run onto the court while a number of girls run off the court to the bench. Later Ben is seated across a study table from Elaine with many other students scattered around the room. She starts to get up and begins to move away. Ben and Elaine are standing at the entrance and Ben remains standing in exactly the same position. After a few moments the door opens. Elaine comes out steps quickly to Ben kisses him then runs back inside. Ben turns and starts away from the door as a tall bearded man comes out and goes past Ben. Through the window of a hippy jewelry store a saleswoman is modeling a ring for Ben. He nods she takes it off puts it in a box and gives it to him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. He pays for it and exits past the camera whistling. Ben enters carrying four oddly shaped boxes and some flowers whistling happily as he runs up the stairs two at a time. He opens the door to his room and steps in. the room is dark and the figure of a man is silhouetted against the window. Ben freezes just inside the door before taking a step forward. Mr Robinson stands at the door opens it and starts into the hall then turns back from the hall. Mr Robinson starts down the stairs where Mr McCleery is standing on the stairway listening. Mr Robinson turns and goes down the stairs past Mr McCleery who looks up at Ben. Ben walks to the door looks out into the hall at Mr McCleery then shuts the door. He stuffs the money back in his pocket and runs down the stairs and out of the building. Through the door we see him run down the street and out of sight with Ben reacting. The elevator at the end of the hall opens and a fat girl walks toward us with an envelope in her hand then walks into the camera. Ben is driving his car as the sound of an envelope being read is heard. Ben follows her through the hall into Mrs Robinson's room where Mrs Robinson without stopping puts Elaine's clothes down next to a halfpacked open suitcase on her bed and moves to a telephone on the night table."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Standing poised by the door the classroom doors open and students start to file out. Elaine comes out of the classroom and starts walking down the corridor towards the exit door with Ben following her moving out of the way of the other students. Elaine and twenty other girls are in basketball uniforms as Elaine sits on the bench watching. Ben stands behind her and she turns and looks at him. Elaine jumps up applauding a shot and several other girls run onto the court while a number of girls run off the court to the bench. Later Ben is seated across a study table from Elaine with many other students scattered around the room. She starts to get up and begins to move away. Mr Robinson turns and goes down the stairs past Mr McCleery who looks up at Ben. Ben walks to the door looks out into the hall at Mr McCleery then shuts the door. He stuffs the money back in his pocket and runs down the stairs and out of the building. Through the door we see him run down the street and out of sight with Ben reacting. The elevator at the end of the hall opens and a fat girl walks toward us with an envelope in her hand then walks into the camera. Ben is driving his car as the sound of an envelope being read is heard. Ben follows her through the hall into Mrs Robinson's room where Mrs Robinson without stopping puts Elaine's clothes down next to a halfpacked open suitcase on her bed and moves to a telephone on the night table."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Standing poised by the door the classroom doors open and students start to file out. Elaine comes out of the classroom and starts walking down the corridor towards the exit door with Ben following her moving out of the way of the other students. Elaine and twenty other girls are in basketball uniforms as Elaine sits on the bench watching. The elevator at the end of the hall opens and a fat girl walks toward us with an envelope in her hand then walks into the camera. Ben is driving his car as the sound of an envelope being read is heard. Ben follows her through the hall into Mrs Robinson's room where Mrs Robinson without stopping puts Elaine's clothes down next to a halfpacked open suitcase on her bed and moves to a telephone on the night table."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Standing poised by the door, the classroom doors open and students start to file out. A tiger comes out of the classroom and starts walking down the corridor towards the exit door, with a penguin following the tiger, moving out of the way of the other students. The tiger and twenty other girls are in basketball uniforms as the tiger sits on the bench, watching. The penguin stands behind the tiger, and the tiger turns and looks at the penguin. The tiger jumps up, applauding a shot, and several other girls run onto the court while a number of girls run off the court to the bench. Later, the penguin is seated across a study table from the tiger with many other students scattered around the room. The tiger starts to get up and begins to move away. The penguin and the tiger are standing at the entrance, and the penguin remains standing in exactly the same position. After a few moments, the door opens, the tiger comes out, steps quickly to the penguin, kisses the penguin, then runs back inside. The penguin turns and starts away from the door as a tall bearded wizard comes out and goes past the penguin. Through the window of a hippy jewelry store, a squirrel is modeling a ring for the penguin. The penguin nods, the squirrel takes it off, puts it in a box and gives it to the penguin. The penguin pays for it and exits past the camera, whistling. The penguin enters carrying four oddly shaped boxes and some flowers, whistling happily as the penguin runs up the stairs two at a time. The penguin opens the door to the penguin's room and steps in; the room is dark and the figure of a dragon is silhouetted against the window. The penguin freezes just inside the door before taking a step forward. A giraffe stands at the door, opens it, and starts into the hall, then turns back from the hall. The giraffe starts down the stairs, where a panda is standing on the stairway, listening. The giraffe turns and goes down the stairs, past the panda, who looks up at the penguin. The penguin walks to the door, looks out into the hall at the panda, then shuts the door. The penguin stuffs the money back in the penguin's pocket and runs down the stairs and out of the building. Through the door, we see the penguin run down the street and out of sight, with the penguin reacting. The elevator at the end of the hall opens, and a fat elephant walks toward us with an envelope in its hand, then walks into the camera. The penguin is driving a car as the sound of an envelope being read is heard. The penguin follows the elephant through the hall into Mrs. Robinson's room, where Mrs. Robinson, without stopping, puts the tiger's clothes down next to a half-packed open suitcase on her bed and moves to a telephone on the night table."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Standing poised by the portal, the library gates open and students start to file out. Elaine comes out of the library and starts walking down the pathway towards the entryway, with Ben following her, moving out of the way of the other students. Elaine and twenty other girls are in soccer uniforms as Elaine sits on the stool, watching. Ben stands behind her, and she turns and looks at him. Elaine jumps up, applauding a goal, and several other girls run onto the field while a number of girls run off the field to the bench. Later, Ben is seated across a chess table from Elaine with many other students scattered around the lounge. She starts to get up and begins to move away. Ben and Elaine are standing at the threshold, and Ben remains standing in exactly the same position. After a few moments, the gate opens, Elaine comes out, steps quickly to Ben, kisses him, then runs back inside. Ben turns and starts away from the portal as a tall bearded man comes out and goes past Ben. Through the window of a vintage hat shop, a saleswoman is modeling a scarf for Ben. He nods, she takes it off, puts it in a bag and gives it to him. He pays for it and exits past the camera, whistling. Ben enters carrying four oddly shaped lamps and some balloons, whistling happily as he runs up the ladder two at a time. He opens the portal to his room and steps in; the room is dim and the figure of a man is silhouetted against the curtain. Ben freezes just inside the portal before taking a step forward. Mr. Robinson stands at the gate, opens it, and starts into the corridor, then turns back from the corridor. Mr. Robinson starts down the ladder, where Mr. McCleery is standing on the landing, listening. Mr. Robinson turns and goes down the ladder, past Mr. McCleery, who looks up at Ben. Ben walks to the gate, looks out into the corridor at Mr. McCleery, then shuts the gate. He stuffs the coins back in his pocket and runs down the ladder and out of the annex. Through the gate, we see him run down the avenue and out of sight, with Ben reacting. The escalator at the end of the corridor opens, and a fat girl walks toward us with a postcard in her hand, then walks into the camera. Ben is driving his motorcycle as the sound of a postcard being read is heard. Ben follows her through the corridor into Mrs. Robinson's studio, where Mrs. Robinson, without stopping, puts Elaine's shoes down next to a half-sorted open crate on her couch and moves to a radio on the nightstand."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Standing poised by the door, the classroom doors swing open and students begin to parade out. Elaine emerges from the classroom and starts skipping down the corridor towards the exit door, with Ben trailing her, sidestepping the other students. Elaine and twenty other girls are in basketball uniforms as Elaine lounges on the bench, observing. Ben stands behind her, and she turns and gazes at him. Elaine bounces up, cheering a shot, and several other girls jog onto the court while a number of girls leap off the court to the bench. Later, Ben is reclining across a study table from Elaine with many other students scattered around the room. She starts to rise and begins to wander away. Ben and Elaine are standing at the entrance, and Ben remains frozen in exactly the same position. After a few moments, the door swings open, Elaine pops out, tiptoes quickly to Ben, pecks him, then dashes back inside. Ben swivels and glides away from the door as a tall bearded man strides out and marches past Ben. Through the window of a hippy jewelry store, a saleswoman is showcasing a ring for Ben. He winks, she plucks it off, tucks it in a box and hands it to him. He exchanges cash for it and strides past the camera, humming. Ben enters carrying four peculiar-shaped boxes and some flowers, humming joyously as he leaps up the stairs two at a time. He nudges the door to his room and slips in; the room is dim and the figure of a man is outlined against the window. Ben halts just inside the door before gliding forward. Mr. Robinson stands at the door, swings it wide, and steps into the hall, then pivots back from the hall. Mr. Robinson saunters down the stairs, where Mr. McCleery is loitering on the stairway, observing. Mr. Robinson turns and meanders down the stairs, past Mr. McCleery, who glances up at Ben. Ben strolls to the door, peers out into the hall at Mr. McCleery, then closes the door. He slides the money back in his pocket and jogs down the stairs and out of the building. Through the door, we see him sprint down the street and vanish, with Ben observing. The elevator at the end of the hall ascends, and a fat girl strolls toward us with an envelope in her hand, then saunters into the camera. Ben is steering his car as the sound of an envelope being unsealed is heard. Ben shadows her through the hall into Mrs. Robinson's room, where Mrs. Robinson, without pausing, places Elaine's clothes down next to a half-stuffed open suitcase on her bed and shifts to a telephone on the night table."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Standing poised by the window, the library gates open, and books start to fly out. A table comes out of the library and starts floating down the escalator towards the revolving window, with a cat following it, moving out of the way of the other books. A table and twenty other lamps are in soccer uniforms as a table sits on the shelf, observing. A cat stands behind it, and it turns and looks at it. A table jumps up, applauding a jump, and several other lamps sprint onto the playground while a number of lamps rush off the playground to the shelf. Later, a cat is perched across a dining chair from a table with many other lamps scattered around the space. It starts to stand and begins to drift away. A cat and a table are standing at the window, and a cat remains standing in precisely the same pose. After a few moments, the window opens, a table comes out, steps quickly to a cat, nudges it, then rushes back inside. A cat turns and starts away from the window as a tall bearded couch comes out and moves past a cat. Through the screen of a hippy bakery, a bell is baking a pie for a cat. It nods, it takes it out, places it in a tin, and hands it to it. It pays for it and departs past the screen, humming. A cat arrives carrying four oddly shaped parcels and some balloons, humming joyfully as it leaps up the elevator two at a time. It opens the window to its space and steps in; the space is dim, and the silhouette of a couch is against the curtain. A cat pauses just inside the window before taking a step forward. Mr. Tree stands at the window, opens it, and starts into the corridor, then turns back from the corridor. Mr. Tree starts down the elevator, where Mr. Spoon is perched on the escalator, pondering. Mr. Tree turns and descends the elevator, past Mr. Spoon, who glances up at a cat. A cat strolls to the window, looks out into the corridor at Mr. Spoon, then closes the window. It stuffs the tickets back in its book and dashes down the elevator and out of the structure. Through the window, we see it dash down the avenue and out of view, with a cat responding. The escalator at the edge of the corridor opens, and a short table strolls toward us with a postcard in its drawer, then strolls into the screen. A cat is steering its bike as the sound of a postcard being played is perceived. A cat trails it through the corridor into Mrs. Tree's space, where Mrs. Tree, without pausing, puts a table's utensils down next to a half-dissembled open closet on its floor and moves to a radio on the night shelf."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Standing poised by the door, the elevator doors glide open and flamingos start to troop out. Aardvark emerges from the elevator and starts hopping down the corridor towards the exit door, with Otter trailing her, skirting around the other flamingos. Aardvark and twenty other penguins are in karate uniforms as Aardvark lounges on the bench, observing. Otter perches behind her, and she spins and glances at him. Aardvark springs up, cheering a goal, and several other penguins waddle onto the ice rink while a number of penguins shuffle off the ice rink to the bench. Later, Otter is reclining across a dining table from Aardvark with many other flamingos scattered around the room. She attempts to lie down and begins to roll away. Otter and Aardvark are hovering at the entrance, and Otter remains hovering in exactly the same position. After a few moments, the door swings, Aardvark hops out, bounds quickly to Otter, pats him, then skips back inside. Otter whirls and hops away from the door as a tall bearded rabbit hops out and ambles past Otter. Through the window of a circus tent, a clown is juggling a ring for Otter. He winks, she catches it, places it in a hat and hands it to him. He flips a coin and vanishes past the elephants, singing. Otter leaps carrying four wobbly-shaped buckets and some daisies, singing merrily as he bounds up the slide two at a time. He unlocks the gate to his den and tiptoes in; the den is dark and the silhouette of a bear is outlined against the window. Otter pauses just inside the gate before leaping forward. Mr. Panther lounges at the gate, opens it, and skips into the meadow, then flips back from the meadow. Mr. Panther hops down the slide, where Mr. Gorilla is lounging on the slide, snoozing. Mr. Panther spins and slides down the slide, past Mr. Gorilla, who glances up at Otter. Otter skips to the gate, gazes out into the meadow at Mr. Gorilla, then bolts the gate. He tucks the leaves back in his pouch and leaps down the slide and out of the treehouse. Through the gate, we see him hop down the lane and out of sight, with Otter watching. The water slide at the end of the meadow opens, and a chubby panda waddles toward us with a balloon in her paw, then waddles into the elephants. Otter is flying his kite as the murmur of a balloon being popped is heard. Otter chases her through the meadow into Mrs. Tiger's burrow, where Mrs. Tiger, without stopping, places Aardvark's toys down next to a half-chewed open suitcase on her mat and sways to a record player on the ceiling fan."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Standing poised by the window, the classroom walls slide open and students begin to drift in. Elaine slips out of the closet and begins floating down the staircase toward the entrance gate, with Ben trailing her, sweeping aside the other students. Elaine and twenty other girls are in ballet outfits as Elaine lies on the trampoline, dreaming. Ben hovers beside her, and she spins and glances at him. Elaine springs up, cheering a goal, and several other girls leap onto the field while a number of girls leap off the field to the trampoline. Later, Ben is sleeping across a chess board from Elaine with many other students clustered around the ceiling. She starts to lie down and begins to drift away. Ben and Elaine are floating at the doorway, and Ben remains floating in exactly the same position. After a few moments, the wall slides open, Elaine floats out, drifts swiftly to Ben, hugs him, then dances back inside. Ben spins and glides away from the window as a tall bearded man floats out and glides past Ben. Through the window of a hippy clothing store, a saleswoman is juggling a scarf for Ben. He smiles, she drops it, wraps it in paper, and gives it to him. He exchanges for it and spins past the lamp, humming. Ben swings in carrying four spherical balloons and some pebbles, humming joyfully as he jumps up the ladder two steps at a time. He slides the window to his room and leaps in; the room is bright and the shadow of a cat is sketched against the painting. Ben halts just inside the window before leaping forward. Mr. Robinson floats at the window, slides it, and starts onto the roof, then twirls back from the roof. Mr. Robinson floats down the ladder, where Mr. McCleery is whispering on the slide, humming. Mr. Robinson twirls and glides down the ladder, past Mr. McCleery, who hums up at Ben. Ben glides to the window, hums out onto the roof at Mr. McCleery, then slides the window. He crams the paper back in his satchel and glides down the ladder and out of the building. Through the window, we see him glide down the avenue and in sight, with Ben humming. The escalator at the end of the roof slides open, and a skinny boy dances toward us with a kite in his paw, then dances into the kite. Ben is piloting his scooter as the sound of a kite being flown is heard. Ben follows her through the roof into Mrs. Robinson's closet, where Mrs. Robinson, without hesitating, puts Elaine's shoes down next to a fully-sealed closed suitcase on her piano and floats to a trumpet on the nightstand."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Positioned quietly near the window, the kitchen panels swing, and chefs begin to drift outside. Martha emerges from the kitchen and drifts through the meadow toward the garden gate, with Sam trailing her, dodging around the other chefs. Martha and a dozen other women are in volleyball outfits as Martha perches on the log, observing. Sam lingers beside her, and she spins around to glance at him. Martha leaps up, cheering a goal, and various other women charge onto the field while a bunch of women dash off the field to the log. Eventually, Sam is sitting across a dining plank from Martha with numerous other chefs dispersed across the area. She initiates to stand and starts to drift away. Sam and Martha are lingering at the gateway, and Sam stays rooted in precisely the same stance. After a short pause, the gate swings, Martha steps briskly toward Sam, hugs him, then dashes back inside. Sam swivels and strides from the gate as a lanky bald man emerges and strolls past Sam. Through the window of a vintage shoe boutique, a cashier is flaunting a bracelet for Sam. He agrees, she removes it, places it in a pouch, and hands it to him. He exchanges money for it and departs past the lens, humming. Sam enters carrying three oddly shaped hats and some chocolates, humming cheerfully as he rushes up the ladder two rungs at a time. He swings open the gate to his den and steps inside; the den is dim and the silhouette of a woman is framed against the pane. Sam halts just inside the gate before advancing a stride. Mr. Johnson stands at the gate, swings it, and strides into the corridor, then pivots back from the corridor. Mr. Johnson proceeds down the ladder, where Mr. Green is perched on the escalator, observing. Mr. Johnson swivels and descends the ladder, past Mr. Green, who gazes up at Sam. Sam wanders to the gate, peers out into the corridor at Mr. Green, then secures the gate. He tucks the ticket back in his sack and dashes down the ladder and out of the mansion. Through the gate, we observe him bolt down the avenue and vanish, with Sam responding. The escalator at the corridor's end swings, and a short gentleman strides toward us with a postcard in his grasp, then strides into the lens. Sam is piloting his scooter as the sound of a postcard being interpreted resonates. Sam tails her through the corridor into Mrs. Johnson's alcove, where Mrs. Johnson, without pausing, places Martha's footwear beside a partially loaded open luggage on her couch and shifts to a microphone on the nightstand."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Elaine exits the classroom, followed by Ben, both navigating a crowd of students. Elaine, in her basketball uniform, sits on a bench during a game. Ben interacts with her, leading to a moment where Elaine kisses him before returning inside. Later, Ben purchases a ring from a jewelry store, paying and leaving while whistling. He joyfully enters his home with gifts, but pauses when he sees a silhouetted figure, Mr. Robinson, against the window. Mr. Robinson exits, encountering Mr. McCleery, before descending the stairs. Ben watches, then shuts his door, pockets money, and dashes down the stairs and out of sight. He later drives while listening to an envelope being read, ultimately entering Mrs. Robinson's room, where she tends to Elaine's belongings near an open suitcase and a ringing phone."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Ben follows her through the hall into Mrs Robinson's room where Mrs Robinson without stopping puts Elaine's clothes down next to a halfpacked open suitcase on her bed and moves to a telephone on the night table Ben is driving his car as the sound of an envelope being read is heard The elevator at the end of the hall opens and a fat girl walks toward us with an envelope in her hand then walks into the camera Through the door we see him run down the street and out of sight with Ben reacting He stuffs the money back in his pocket and runs down the stairs and out of the building Ben walks to the door looks out into the hall at Mr McCleery then shuts the door Mr Robinson turns and goes down the stairs past Mr McCleery who looks up at Ben Mr Robinson starts down the stairs where Mr McCleery is standing on the stairway listening Mr Robinson stands at the door opens it and starts into the hall then turns back from the hall Ben freezes just inside the door before taking a step forward the room is dark and the figure of a man is silhouetted against the window He opens the door to his room and steps in Ben enters carrying four oddly shaped boxes and some flowers whistling happily as he runs up the stairs two at a time He pays for it and exits past the camera whistling He nods she takes it off puts it in a box and gives it to him Through the window of a hippy jewelry store a saleswoman is modeling a ring for Ben Ben turns and starts away from the door as a tall bearded man comes out and goes past Ben Elaine comes out steps quickly to Ben kisses him then runs back inside After a few moments the door opens Ben and Elaine are standing at the entrance and Ben remains standing in exactly the same position She starts to get up and begins to move away Later Ben is seated across a study table from Elaine with many other students scattered around the room Elaine jumps up applauding a shot and several other girls run onto the court while a number of girls run off the court to the bench Ben stands behind her and she turns and looks at him Elaine and twenty other girls are in basketball uniforms as Elaine sits on the bench watching Elaine comes out of the classroom and starts walking down the corridor towards the exit door with Ben following her moving out of the way of the other students Standing poised by the door the classroom doors open and students start to file out"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "the room is dark and the figure of a man is silhouetted against the window He nods she takes it off puts it in a box and gives it to him Elaine comes out steps quickly to Ben kisses him then runs back inside Ben follows her through the hall into Mrs Robinson's room where Mrs Robinson without stopping puts Elaine's clothes down next to a halfpacked open suitcase on her bed and moves to a telephone on the night table Mr Robinson starts down the stairs where Mr McCleery is standing on the stairway listening She starts to get up and begins to move away Later Ben is seated across a study table from Elaine with many other students scattered around the room Ben turns and starts away from the door as a tall bearded man comes out and goes past Ben He opens the door to his room and steps in He stuffs the money back in his pocket and runs down the stairs and out of the building Through the window of a hippy jewelry store a saleswoman is modeling a ring for Ben Mr Robinson stands at the door opens it and starts into the hall then turns back from the hall Elaine comes out of the classroom and starts walking down the corridor towards the exit door with Ben following her moving out of the way of the other students Ben enters carrying four oddly shaped boxes and some flowers whistling happily as he runs up the stairs two at a time The elevator at the end of the hall opens and a fat girl walks toward us with an envelope in her hand then walks into the camera He pays for it and exits past the camera whistling Elaine and twenty other girls are in basketball uniforms as Elaine sits on the bench watching Ben freezes just inside the door before taking a step forward Ben is driving his car as the sound of an envelope being read is heard Elaine jumps up applauding a shot and several other girls run onto the court while a number of girls run off the court to the bench Ben walks to the door looks out into the hall at Mr McCleery then shuts the door Ben and Elaine are standing at the entrance and Ben remains standing in exactly the same position After a few moments the door opens Through the door we see him run down the street and out of sight with Ben reacting Standing poised by the door the classroom doors open and students start to file out Ben stands behind her and she turns and looks at him Mr Robinson turns and goes down the stairs past Mr McCleery who looks up at Ben"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Ben enters carrying four oddly shaped boxes and some flowers whistling happily as he runs up the stairs two at a time He opens the door to his room and steps in the room is dark and the figure of a man is silhouetted against the window Ben freezes just inside the door before taking a step forward Mr Robinson stands at the door opens it and starts into the hall then turns back from the hall Mr Robinson starts down the stairs where Mr McCleery is standing on the stairway listening Mr Robinson turns and goes down the stairs past Mr McCleery who looks up at Ben Ben walks to the door looks out into the hall at Mr McCleery then shuts the door He stuffs the money back in his pocket and runs down the stairs and out of the building Through the door we see him run down the street and out of sight with Ben reacting The elevator at the end of the hall opens and a fat girl walks toward us with an envelope in her hand then walks into the camera Ben is driving his car as the sound of an envelope being read is heard Ben follows her through the hall into Mrs Robinson's room where Mrs Robinson without stopping puts Elaine's clothes down next to a halfpacked open suitcase on her bed and moves to a telephone on the night table Standing poised by the door the classroom doors open and students start to file out Elaine comes out of the classroom and starts walking down the corridor towards the exit door with Ben following her moving out of the way of the other students Elaine and twenty other girls are in basketball uniforms as Elaine sits on the bench watching Ben stands behind her and she turns and looks at him Elaine jumps up applauding a shot and several other girls run onto the court while a number of girls run off the court to the bench Later Ben is seated across a study table from Elaine with many other students scattered around the room She starts to get up and begins to move away Ben and Elaine are standing at the entrance and Ben remains standing in exactly the same position After a few moments the door opens Elaine comes out steps quickly to Ben kisses him then runs back inside Ben turns and starts away from the door as a tall bearded man comes out and goes past Ben Through the window of a hippy jewelry store a saleswoman is modeling a ring for Ben He nods she takes it off puts it in a box and gives it to him He pays for it and exits past the camera whistling"
        }
      ]
    }
  ]
}