{
  "ground_truth": "DYLE shrugs. She offers him her cone, thrusting it forward with enough force to dislodge the ice-cream, and it lands right next to his lapel, over his outside breast pocket, including the Cathedral of NOTRE DAME in the background as REGGIE and DYLE step from the elevator. He goes into his room and she goes into hers. She enters, fixes her hair in the mirror, then goes to the door connecting her room with DYLE's. She unlocks it, tries to open it, but finds it locked. Disappointed, she knocks. He calls to her through the closed door as he empties his pockets. He sits down to take off his shoes but is interrupted by the sound of REGGIE screaming. He races for the connecting door, pulls back the bolt and rushes in. As DYLE enters, he wheels as the door is slammed and REGGIE, who had been standing behind it, locks it and pockets the key. He goes to the door leading to the hall and finds that locked as well. She smiles at him. DYLE looks at her, then sits down and starts to remove his shoes. Testing the water with his hand, he now steps in fully dressed. REGGIE can't believe her eyes. She goes to the open door for a closer look as he takes out his handkerchief and rinses it. He opens his coat and reads a label inside. He flicks a little water in her face, then takes the nail-brush and scrubs his watch and watch-band. He holds up his wrist so she can see the watch. He begins unbuttoning his suit. She turns and leaves, slamming the door after her. The PHONE rings and she answers it. CLOSE SHOT -- REGGIE on the phone, looking like the rug has been pulled out from under her. REGGIE slowly lowers the phone to its cradle, a worried expression on her face. Then the bathroom door opens and DYLE appears dressed in a large bath towel. She shakes her head. The large motor launch, moving along the river, gaily ablaze with lights. At a table for two by the rail, the city slowly passing in the b.g. They walk back to the table, where a WAITER is busy putting food on it, mostly on REGGIE's side. REGGIE reacts in surprise. She looks at him with happy amazement, then pushes her plate away. The lights go out. A searchlight near the boat's bridge has gone on and now begins sweeping the river banks. On benches by the water's edge, lovers are surprised by the bright light which suddenly and without warning discovers them in various attitudes of mutual affection. Some are embarrassed, some are amused and some (the most intimate) damn annoyed.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "DYLE shrugs. She provides him her cone, thrusting it forward with sufficient force to dislodge the ice-cream, and it lands right adjacent to his lapel, over his outer breast pocket, including the Cathedral of NOTRE DAME in the backdrop as REGGIE and DYLE step from the elevator. He goes into his chamber and she goes into hers. She enters, fixes her hair in the mirror, then goes to the door connecting her room with DYLE's. She unlocks it, attempts to open it, but finds it locked. Disappointed, she knocks. He calls to her through the closed door as he empties his pockets. He sits down to take off his shoes but is interrupted by the sound of REGGIE screaming. He races for the connecting door, pulls back the bolt and rushes in. As DYLE enters, he wheels as the door is slammed and REGGIE, who had been standing behind it, locks it and pockets the key. He goes to the door leading to the hall and finds that locked as well. She smiles at him. DYLE looks at her, then sits down and starts to remove his shoes. Testing the water with his hand, he now steps in fully dressed. REGGIE can't believe her eyes. She goes to the open door for a nearer look as he takes out his handkerchief and rinses it. He opens his coat and reads a label inside. He flicks a little liquid in her face, then takes the nail-brush and scrubs his watch and watch-band. He holds up his wrist so she can see the watch. He begins unbuttoning his suit. She turns and departs, slamming the door after her. The PHONE rings and she answers it. CLOSE SHOT -- REGGIE on the phone, looking like the rug has been removed out from under her. REGGIE slowly lowers the phone to its cradle, a worried expression on her face. Then the bathroom door opens and DYLE appears dressed in a large bath towel. She shakes her head. The large motor launch, moving along the river, gaily ablaze with lights. At a table for two by the rail, the city slowly passing in the b.g. They walk back to the table, where a WAITER is busy putting nourishment on it, mostly on REGGIE's side. REGGIE reacts in surprise. She looks at him with happy amazement, then pushes her plate away. The lights go out. A searchlight near the boat's bridge has gone on and now begins sweeping the river banks. On benches by the water's edge, lovers are surprised by the bright light which suddenly and without warning discovers them in various attitudes of mutual affection. Some are embarrassed, some are amused and some (the most intimate) damn annoyed."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "DYLE is shrugged at. Her cone is offered by her to him, thrusting it forward with enough force for the ice-cream to be dislodged, and it lands by his lapel, over his outside breast pocket, with the Cathedral of NOTRE DAME in the background as the elevator is exited by REGGIE and DYLE. His room is entered by him and hers is entered by her. The hair is fixed by her in the mirror, then she goes to the door connecting her room with DYLE's. It is unlocked by her, and she tries to open it, but the lock on it is found by her. Disappointed, a knock is given by her. He calls to her through the closed door as his pockets are emptied by him. His shoes are sat down to be taken off by him, but the sound of REGGIE screaming interrupts him. He races for the connecting door, pulls back the bolt, and rushes in. As DYLE enters, he wheels as the door is slammed and REGGIE, who stood behind it, locks it and pockets the key. The door leading to the hall is checked by him and it is found locked as well. She smiles at him. She is looked at by DYLE, then he sits down and his shoes are started to be removed. The water is tested by him with his hand, and he now steps in fully dressed. REGGIE's eyes can't believe it. To the open door she goes for a closer look as his handkerchief is taken out and rinsed by him. His coat is opened and a label inside is read by him. A little water is flicked by him in her face, then the nail-brush is taken by him and he scrubs his watch and watch-band. His wrist is held up by him so that she can see the watch. His suit is begun to be unbuttoned by him. She turns and leaves, and the door is slammed after her. The PHONE rings and it is answered by her. CLOSE SHOT -- REGGIE on the phone, looking like the rug has pulled out from under her. The phone is slowly lowered to its cradle by REGGIE, a worried expression on her face. Then the bathroom door is opened and DYLE appears dressed in a large bath towel. Her head is shaken by her. The large motor launch, moving along the river, is gaily ablaze with lights. At a table for two by the rail, the city slowly passes in the b.g. The table is walked back to, where a WAITER is busy putting food on it, mostly on REGGIE's side. REGGIE reacts in surprise. He is looked at by her with happy amazement, then her plate is pushed away. The lights go out. A searchlight near the boat's bridge is turned on and now begins sweeping the river banks. Lovers on benches by the water's edge are surprised by the bright light which suddenly and without warning discovers them in various attitudes of mutual affection. Some are embarrassed, some are amused, and some (the most intimate) damn annoyed."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "DYLE shrugs as she thrusts her cone at him, dislodging the ice cream, which lands near his lapel over his outer breast pocket, with the Cathedral of NOTRE DAME visible as they exit the elevator. He enters his room; she goes into hers, fixes her hair in the mirror, and unlocks the connecting door, but it’s locked. Disappointed, she knocks. He responds while emptying his pockets and sits to remove his shoes when REGGIE screams. He bolts through the connecting door, which she slams shut, locking it and pocketing the key. The hallway door is also locked. She smiles; he sits and resumes removing his shoes. Testing the water, he steps in fully dressed. Shocked, REGGIE watches him rinse his handkerchief, read his coat label, flick water at her, then scrub his watch with a nail-brush. Showing her his wrist, he unbuttons his suit. She exits, slamming the door. The PHONE rings; she answers, visibly shaken, and slowly hangs up, clearly worried. DYLE emerges from the bathroom in a large towel. She shakes her head. A large motor launch glides along the river, glowing with lights. At a table for two, the city drifts past. A WAITER sets most of the food on REGGIE's side. She reacts, amazed, then pushes her plate away. The lights go out. A searchlight from the bridge scans the riverbanks, surprising couples on benches. Some are embarrassed, some laugh, and the more intimate ones are clearly annoyed."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "DYLE shrugs and she offers him her cone, thrusting it so the ice cream lands by his lapel, with NOTRE DAME in the background as they exit the elevator. He enters his room, she hers, fixes her hair, and tries the connecting door, but it's locked. Disappointed, she knocks. He calls through the door while emptying his pockets, sits to remove his shoes, but hears REGGIE scream. He rushes to the door, opens it, but REGGIE locks it behind him, pocketing the key. The hall door is also locked. She smiles, and DYLE sits to remove his shoes, steps into the water fully dressed, surprising REGGIE. She watches as he rinses his handkerchief, reads a label inside his coat, flicks water at her, scrubs his watch, and begins unbuttoning his suit. She leaves, slamming the door. The phone rings, and REGGIE answers, looking worried. DYLE emerges in a bath towel. She shakes her head. A motor launch moves along the river, lights ablaze. At a table for two, the city passes by. A WAITER serves mostly on REGGIE's side, surprising her. She looks at him happily, then pushes her plate away. The lights go out, and a searchlight sweeps the riverbanks, surprising lovers in various attitudes of affection."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "DYLE gives a nonchalant shrug. She extends her ice cream cone towards him with such vigor that the ice cream itself becomes dislodged, landing precariously close to his lapel, right over his outside breast pocket. In the background, the majestic Cathedral of NOTRE DAME stands as REGGIE and DYLE step out from the elevator. He proceeds into his room while she heads into hers. Upon entering, she takes a moment to adjust her hair in the mirror before moving towards the door that connects her room with DYLE's. She unlocks it and attempts to open it, only to find it securely locked. Feeling a sense of disappointment, she knocks on the door. From the other side, he calls out to her while he empties the contents of his pockets. He sits down, intending to remove his shoes, but is suddenly interrupted by the sound of REGGIE's scream. He quickly races to the connecting door, pulls back the bolt, and rushes in. As DYLE enters, he spins around just as the door is slammed shut, and REGGIE, who had been standing behind it, locks it and slips the key into her pocket. He then moves to the door leading to the hallway, only to discover that it is locked as well. She smiles at him with a knowing look. DYLE gazes at her, then sits down and begins to take off his shoes. Testing the water with his hand, he steps in fully clothed, much to REGGIE's disbelief. She approaches the open door for a closer inspection as he takes out his handkerchief and rinses it. He opens his coat to read a label inside, flicks a bit of water playfully in her direction, and then takes the nail-brush to scrub his watch and watch-band. He holds up his wrist to show her the watch. He starts unbuttoning his suit, prompting her to turn and leave, slamming the door behind her. The PHONE rings, and she answers it. In a CLOSE SHOT, REGGIE is seen on the phone, appearing as if the rug has been pulled out from under her. With a worried expression, she slowly lowers the phone back to its cradle. Then, the bathroom door opens, and DYLE emerges, wrapped in a large bath towel. She shakes her head in disbelief. Meanwhile, a large motor launch moves along the river, brightly illuminated with lights. At a table for two by the rail, the city slowly drifts by in the background. They return to the table, where a WAITER is busily arranging food, mostly on REGGIE's side. REGGIE reacts with surprise, looking at him with happy amazement before pushing her plate away. Suddenly, the lights go out. A searchlight near the boat's bridge switches on and begins sweeping the riverbanks. On benches by the water's edge, lovers are caught off guard by the bright light that unexpectedly reveals them in various states of mutual affection. Some are embarrassed, some find it amusing, and others, the most intimate among them, are quite annoyed."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "DYLE offers a nonchalant shrug, conveying an air of indifference. With surprising vigor, she thrusts her ice cream cone in his direction, causing the ice cream part to become dislodged and land with a precarious wobble alarmingly close to his lapel, right over the outside breast pocket of his suit. In the picturesque background, the majestic and iconic Cathedral of NOTRE DAME stands serenely as both REGGIE and DYLE step out from the confines of the elevator. He makes his way into his room, taking deliberate steps, while she heads purposefully into hers. Once inside, she pauses momentarily to adjust her hair in front of the mirror, ensuring everything is in place, before moving towards the door that connects her room with DYLE's adjacent one. She unlocks this connecting door and attempts to open it, only to discover it is securely locked from the other side. Feeling a sense of disappointment wash over her, she knocks on the door. On the other side of the door, he calls out to her casually while he empties the contents of his pockets, preparing to settle in. He sits down, intending to remove his shoes, but his actions are suddenly interrupted by the sound of REGGIE's unexpected scream. He quickly races to the connecting door, urgency in his movements, pulls back the bolt, and rushes in without hesitation. As DYLE enters, he spins around just as the door is slammed shut behind him, and REGGIE, who had been standing strategically behind it, locks it and slyly slips the key into her pocket. He then moves toward the door that leads to the hallway, only to discover that it is locked as well. She smiles at him with a knowing, almost mischievous look. DYLE gazes at her, then nonchalantly sits down and begins to remove his shoes. Testing the water with his hand, he decides to step in fully clothed, a move that leaves REGGIE in a state of disbelief. She approaches the open door for a closer inspection of his actions as he takes out his handkerchief and begins to rinse it. He then opens his coat, glancing at a label inside, and playfully flicks a bit of water in her direction. He takes the nail-brush to scrub his watch and watch-band meticulously, holding up his wrist to show her the watch as if presenting a trophy. He starts to unbutton his suit, a gesture that prompts her to turn and leave the scene, slamming the door behind her for effect. The PHONE rings, disrupting the moment, and she answers it promptly. In a CLOSE SHOT, REGGIE is seen holding the phone, appearing as though the rug has been pulled out from under her, her face painted with worry. With a concerned expression, she slowly lowers the phone back to its cradle. Then, the bathroom door opens, and DYLE emerges, wrapped snugly in a large bath towel. She shakes her head, still in disbelief over the unfolding events. Meanwhile, a large motor launch glides along the river, brightly illuminated with a dazzling array of lights. At a table for two situated by the rail, the cityscape slowly drifts by and serves as a moving backdrop. They return to the table, where a diligent WAITER is busily arranging an assortment of food, mostly on REGGIE's side of the table. REGGIE reacts with surprise, looking at him with a mixture of happiness and amazement before she playfully pushes her plate away. Suddenly, without warning, the lights go out. A searchlight positioned near the boat's bridge switches on and begins sweeping across the riverbanks. On benches by the water's edge, lovers are caught off guard, suddenly bathed in the bright light that reveals them in various states of mutual affection. Some couples are embarrassed, some find the situation amusing, while others, especially the most intimately engaged pairs among them, are visibly annoyed."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "DYLE gives a casual shrug, and in response, she extends her arm to offer him her ice cream cone, thrusting it forward with such force that the ice cream becomes dislodged and lands precariously close to his lapel, right over his outside breast pocket. This scene unfolds with the majestic Cathedral of NOTRE DAME serving as a picturesque backdrop as REGGIE and DYLE step out from the elevator. Once they reach their respective rooms, he enters his, and she enters hers. Inside her room, she takes a moment to fix her hair in the mirror, ensuring every strand is in place, before making her way to the door that connects her room with DYLE's. She carefully unlocks it and attempts to open it, only to discover that it is locked from the other side. Feeling a wave of disappointment, she knocks on the door. Meanwhile, on the other side, he hears her knock and calls out to her through the closed door while simultaneously emptying his pockets. He then sits down with the intention of removing his shoes but is abruptly interrupted by the sound of REGGIE screaming. Reacting swiftly, he races to the connecting door, pulls back the bolt with urgency, and rushes into her room. As DYLE enters, he quickly turns around just as the door is slammed shut, and REGGIE, who had been standing behind it, locks it and slyly pockets the key. He then moves to the door leading to the hall, only to find it locked as well. She smiles at him, and DYLE, taking in the situation, looks at her before deciding to sit down and resume removing his shoes. Testing the water with his hand, he then steps into the bath fully dressed, much to REGGIE's disbelief. She approaches the open door to get a closer look as he takes out his handkerchief and rinses it in the water. He opens his coat to read a label inside, then playfully flicks a little water in her face. He proceeds to take the nail-brush and scrub his watch and watch-band, holding up his wrist to show her the watch. He begins to unbutton his suit, prompting her to turn and leave, slamming the door behind her. The PHONE rings, and she answers it, her expression shifting to one of shock as if the rug has been pulled out from under her. REGGIE slowly lowers the phone back to its cradle, a worried look etched on her face. Just then, the bathroom door opens, and DYLE emerges, wrapped in a large bath towel. She shakes her head in disbelief. Meanwhile, a large motor launch moves along the river, its lights gaily ablaze. At a table for two by the rail, the city slowly passes by in the background. They walk back to the table, where a WAITER is busy arranging food, mostly on REGGIE's side. REGGIE reacts with surprise, looking at him with happy amazement before pushing her plate away. Suddenly, the lights go out, and a searchlight near the boat's bridge switches on, beginning to sweep the riverbanks. On benches by the water's edge, lovers are caught off guard by the bright light, which suddenly and without warning discovers them in various attitudes of mutual affection. Some are embarrassed, some are amused, and some, particularly the most intimate, are damn annoyed."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "DYLE shrugs and accepts her ice cream cone, but she accidentally dislodges the ice cream, which lands near his lapel as they step from the elevator with the Cathedral of NOTRE DAME in the background. They part ways to their respective rooms. REGGIE enters her room, tidies her hair, and attempts to open the connecting door to DYLE's room, only to find it locked. Disappointed, she knocks, and DYLE responds while emptying his pockets. As he begins to remove his shoes, REGGIE's scream interrupts him. He rushes to the connecting door, unlocks it, and enters, only for REGGIE to lock it behind him and pocket the key. Finding the hall door locked as well, DYLE sits down to remove his shoes. He then steps into the water fully dressed, surprising REGGIE, who approaches to watch him rinse his handkerchief and scrub his watch. He shows her the watch, begins unbuttoning his suit, and flicks water at her, prompting her to leave and slam the door. The phone rings, and REGGIE answers, looking shocked as she hangs up. DYLE emerges from the bathroom in a large bath towel, and she shakes her head. Later, on a brightly lit motor launch moving along the river, they sit at a table for two by the rail, with the city passing in the background. A WAITER serves food mostly on REGGIE's side, surprising her. She looks at DYLE with happy amazement and pushes her plate away. The lights go out as a searchlight from the boat's bridge sweeps the riverbanks, catching lovers by surprise, eliciting reactions ranging from embarrassment to amusement to annoyance."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "DYLE shrugs, a telltale sign of his nonchalant demeanor. She offers him her cone, thrusting it forward with enough force to dislodge the ice-cream, and it lands right next to his lapel, over his outside breast pocket, including the Cathedral of NOTRE DAME, a renowned example of French Gothic architecture completed in the 14th century, in the background as REGGIE and DYLE step from the elevator of the historic Hôtel de Ville in Paris. He goes into his room and she goes into hers. She enters, fixes her hair in the mirror, a vintage piece framed in ornate gold typical of classic Parisian style, then goes to the door connecting her room with DYLE's. She unlocks it, tries to open it, but finds it locked. Disappointed, she knocks. He calls to her through the closed door as he empties his pockets of Euros and loose change. He sits down to take off his shoes but is interrupted by the sound of REGGIE screaming. He races for the connecting door, pulls back the bolt and rushes in. As DYLE enters, he wheels as the door is slammed and REGGIE, who had been standing behind it, locks it and pockets the key, a small brass skeleton key often used in Parisian hotels. He goes to the door leading to the hall and finds that locked as well. She smiles at him, her expression a mix of teasing and mischief. DYLE looks at her, then sits down and starts to remove his shoes. Testing the water with his hand in the luxurious clawfoot tub, he now steps in fully dressed, reminiscent of a scene from a playful silent film. REGGIE can't believe her eyes. She goes to the open door for a closer look as he takes out his handkerchief, monogrammed with his initials, and rinses it. He opens his coat and reads a label inside, checking for any damage. He flicks a little water in her face, then takes the nail-brush, an antique toiletry item found in older hotels, and scrubs his watch and watch-band. He holds up his wrist so she can see the watch, a classic timepiece by a renowned Swiss maker. He begins unbuttoning his suit with a calm precision. She turns and leaves, slamming the door after her. The PHONE, an old-fashioned rotary, rings and she answers it. CLOSE SHOT -- REGGIE on the phone, looking like the rug has been pulled out from under her, perhaps receiving troubling news. REGGIE slowly lowers the phone to its cradle, a worried expression on her face. Then the bathroom door opens and DYLE appears dressed in a large bath towel, a humorous picture of casual confidence. She shakes her head. The large motor launch, moving along the Seine River, gaily ablaze with lights during a popular evening cruise. At a table for two by the rail, the city, including the Eiffel Tower illuminated in the distance, slowly passes in the b.g. They walk back to the table, where a WAITER is busy putting food on it, mostly on REGGIE's side, an array of gourmet French dishes. REGGIE reacts in surprise. She looks at him with happy amazement, then pushes her plate away, feeling overwhelmed. The lights go out. A searchlight near the boat's bridge, used for navigational purposes, has gone on and now begins sweeping the river banks. On benches by the water's edge, lovers are surprised by the bright light which suddenly and without warning discovers them in various attitudes of mutual affection. Some are embarrassed, some are amused and some (the most intimate) damn annoyed, creating a tableau of spontaneous reactions."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "DYLE shrugs. She offers him her cone thrusting it forward with enough force to dislodge the icecream and it lands right next to his lapel over his outside breast pocket including the Cathedral of NOTRE DAME in the background. as REGGIE and DYLE step from the elevator. He goes into his room and she goes into hers. She enters fixes her hair in the mirror then goes to the door connecting her room with DYLE's. She unlocks it tries to open it but finds it locked. Disappointed she knocks. He calls to her through the closed door as he empties his pockets. He sits down to take off his shoes but is interrupted by the sound of REGGIE screaming. He races for the connecting door pulls back the bolt and rushes in. As DYLE enters he wheels as the door is slammed and REGGIE who had been standing behind it locks it and pockets the key. He goes to the door leading to the hall and finds that locked as well. She smiles at him. DYLE looks at her then sits down and starts to remove his shoes. Testing the water with his hand he now steps in fully dressed. REGGIE cannot believe her eyes. She goes to the open door for a closer look as he takes out his handkerchief and rinses it. He opens his coat and reads a label inside. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. He flicks a little water in her face then takes the nailbrush and scrubs his watch and watchband. He holds up his wrist so she can see the watch. He begins unbuttoning his suit. She turns and leaves slamming the door after her. The PHONE rings and she answers it. CLOSE SHOT. REGGIE on the phone looking like the rug has been pulled out from under her. REGGIE slowly lowers the phone to its cradle a worried expression on her face. Then the bathroom door opens and DYLE appears dressed in a large bath towel. She shakes her head. The large motor launch moving along the river gaily ablaze with lights. At a table for two by the rail the city slowly passing in the bg. They walk back to the table where a WAITER is busy putting food on it mostly on REGGIE's side. REGGIE reacts in surprise. She looks at him with happy amazement then pushes her plate away. The lights go out. A searchlight near the boat's bridge has gone on and now begins sweeping the river banks. On benches by the water's edge lovers are surprised by the bright light which suddenly and without warning discovers them in various attitudes of mutual affection. Some are embarrassed some are amused and some the most intimate damn annoyed."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "DYLE shrugs. She offers him her cone thrusting it forward with enough force to dislodge the icecream and it lands right next to his lapel over his outside breast pocket including the Cathedral of NOTRE DAME in the background. as REGGIE and DYLE step from the elevator. He goes into his room and she goes into hers. She enters fixes her hair in the mirror then goes to the door connecting her room with DYLE's. She unlocks it tries to open it but finds it locked. Disappointed she knocks. He calls to her through the closed door as he empties his pockets. He sits down to take off his shoes but is interrupted by the sound of REGGIE screaming. He races for the connecting door pulls back the bolt and rushes in. As DYLE enters he wheels as the door is slammed and REGGIE who had been standing behind it locks it and pockets the key. He goes to the door leading to the hall and finds that locked as well. She smiles at him. DYLE looks at her then sits down and starts to remove his shoes. Testing the water with his hand he now steps in fully dressed. REGGIE cannot believe her eyes. She goes to the open door for a closer look as he takes out his handkerchief and rinses it. He opens his coat and reads a label inside. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. He flicks a little water in her face then takes the nailbrush and scrubs his watch and watchband. He holds up his wrist so she can see the watch. He begins unbuttoning his suit. She turns and leaves slamming the door after her. The PHONE rings and she answers it. CLOSE SHOT. REGGIE on the phone looking like the rug has been pulled out from under her. REGGIE slowly lowers the phone to its cradle a worried expression on her face. Then the bathroom door opens and DYLE appears dressed in a large bath towel. She shakes her head. The large motor launch moving along the river gaily ablaze with lights. At a table for two by the rail the city slowly passing in the bg. They walk back to the table where a WAITER is busy putting food on it mostly on REGGIE's side. REGGIE reacts in surprise. She looks at him with happy amazement then pushes her plate away. The lights go out. A searchlight near the boat's bridge has gone on and now begins sweeping the river banks. On benches by the water's edge lovers are surprised by the bright light which suddenly and without warning discovers them in various attitudes of mutual affection. Some are embarrassed some are amused and some the most intimate damn annoyed."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "DYLE shrugs. She offers him her cone thrusting it forward with enough force to dislodge the icecream and it lands right next to his lapel over his outside breast pocket including the Cathedral of NOTRE DAME in the background. as REGGIE and DYLE step from the elevator. He goes into his room and she goes into hers. She enters fixes her hair in the mirror then goes to the door connecting her room with DYLE's. She unlocks it tries to open it but finds it locked. Disappointed she knocks. He calls to her through the closed door as he empties his pockets. He sits down to take off his shoes but is interrupted by the sound of REGGIE screaming. She shakes her head. The large motor launch moving along the river gaily ablaze with lights. At a table for two by the rail the city slowly passing in the bg. They walk back to the table where a WAITER is busy putting food on it mostly on REGGIE's side. REGGIE reacts in surprise. She looks at him with happy amazement then pushes her plate away. The lights go out. A searchlight near the boat's bridge has gone on and now begins sweeping the river banks. On benches by the water's edge lovers are surprised by the bright light which suddenly and without warning discovers them in various attitudes of mutual affection. Some are embarrassed some are amused and some the most intimate damn annoyed."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "DYLE shrugs. She offers him her cone thrusting it forward with enough force to dislodge the icecream and it lands right next to his lapel over his outside breast pocket including the Cathedral of NOTRE DAME in the background. as REGGIE and DYLE step from the elevator. He goes into his room and she goes into hers. The lights go out. A searchlight near the boat's bridge has gone on and now begins sweeping the river banks. On benches by the water's edge lovers are surprised by the bright light which suddenly and without warning discovers them in various attitudes of mutual affection. Some are embarrassed some are amused and some the most intimate damn annoyed."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "SHERMAN cackles. He presents her his sock, tossing it backward with enough zeal to jostle the hat, and it lands right next to her slipper, over her inside vest pocket, including the Statue of LIBERTY in the distance as LEE and SHERMAN glide from the submarine. She creeps into her cabin and he sneaks into his. He arrives, twists his scarf in the window, then sneaks to the portal linking his cabin with SHERMAN's. He bolts it, attempts to shut it, but finds it unbolted. Frustrated, he shouts. She whispers to him through the open window as she fills her gloves. She stands up to put on her hat but is startled by the sound of LEE giggling. She strolls for the linking window, slides back the curtain and strolls through. As SHERMAN creeps in, he spins as the window is swung and LEE, who had been crouching beneath it, unlocks it and dangles the opener. She strolls to the window leading to the deck and finds that unbolted as well. He smirks at her. SHERMAN glances at him, then stands up and commences to remove her hat. Sipping the water with her elbow, she then strolls through fully armored. LEE can’t imagine his ears. He arrives at the shut window for a distant sniff as she pulls out her sponge and shakes it. She closes her jacket and scrawls a ticket inside. She splashes a little air in his foot, then grasps the comb and strokes her shoe and shoe-sole. She raises up her head so he can hear the shoe. She finishes buttoning her boots. He spins and arrives, swinging the window before him. The RADIO pings and he ignores it. FAR SHOT -- LEE on the radio, feeling like the chair has been pulled out from beside him. LEE swiftly raises the radio to its shelf, an elated expression on his ear. Then the kitchen window swings and SHERMAN glides clothed in a giant night robe. He nods his ear. The tiny bicycle taxi, prancing down the highway, brightly adorned with flags. Under a couch for eight by the shore, the forest swiftly rushing in the f.g. They jump back under the couch, where a DOCTOR is hastily peeling soup on it, mostly on LEE's edge. LEE laughs in horror. He listens to her with angry disbelief, then tugs his shoe away. The flags flicker on. A flashlight beneath the taxi’s tire has flickered off and then proceeds ignoring the highway fences. On trees by the road's corner, farmers are angered by the dim darkness which instantly and with boredom discovers them in various poses of individual suspicion. Several are infuriated, several are confused, and several (the least annoyed) cheer wildly."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "DYLE reluctantly takes an offered ice cream from REGGIE, accidentally dropping it near his pocket. They part ways after leaving the elevator, REGGIE entering her room and attempting to connect with DYLE through an adjoining door. Finding it locked, she knocks, prompting him to open it. REGGIE screams, prompting DYLE to rush in, only for her to trap him by locking the door. DYLE sits calmly, removes his shoes, and unexpectedly steps into the water fully dressed to REGGIE's surprise. She investigates, and he cleans his watch, flicks water at her face, and begins undressing. Annoyed, she leaves to answer a phone call that leaves her worried. DYLE emerges in a towel. Later, they dine on a riverboat as a searchlight surprises couples along the banks, leaving some embarrassed and others amused."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Some are embarrassed some are amused and some the most intimate damn annoyed lovers are surprised by the bright light which suddenly and without warning discovers them in various attitudes of mutual affection  On benches by the water's edge  A searchlight near the boat's bridge has gone on and now begins sweeping the river banks  The lights go out  She looks at him with happy amazement then pushes her plate away  REGGIE reacts in surprise  They walk back to the table where a WAITER is busy putting food on it mostly on REGGIE's side  At a table for two by the rail the city slowly passing in the bg  The large motor launch moving along the river gaily ablaze with lights  She shakes her head  Then the bathroom door opens and DYLE appears dressed in a large bath towel  REGGIE slowly lowers the phone to its cradle a worried expression on her face  REGGIE on the phone looking like the rug has been pulled out from under her  CLOSE SHOT   The PHONE rings and she answers it  She turns and leaves slamming the door after her  He begins unbuttoning his suit  He holds up his wrist so she can see the watch  He flicks a little water in her face then takes the nailbrush and scrubs his watch and watchband  He opens his coat and reads a label inside  She goes to the open door for a closer look as he takes out his handkerchief and rinses it  REGGIE can't believe her eyes  Testing the water with his hand he now steps in fully dressed  DYLE looks at her then sits down and starts to remove his shoes  She smiles at him  He goes to the door leading to the hall and finds that locked as well  As DYLE enters he wheels as the door is slammed and REGGIE who had been standing behind it locks it and pockets the key  He races for the connecting door pulls back the bolt and rushes in  He sits down to take off his shoes but is interrupted by the sound of REGGIE screaming  He calls to her through the closed door as he empties his pockets  Disappointed she knocks  She unlocks it tries to open it but finds it locked  She enters fixes her hair in the mirror then goes to the door connecting her room with DYLE's  He goes into his room and she goes into hers  as REGGIE and DYLE step from the elevator  She offers him her cone thrusting it forward with enough force to dislodge the icecream and it lands right next to his lapel over his outside breast pocket including the Cathedral of NOTRE DAME in the background  DYLE shrugs "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "She offers him her cone thrusting it forward with enough force to dislodge the icecream and it lands right next to his lapel over his outside breast pocket including the Cathedral of NOTRE DAME in the background DYLE shrugs He goes into his room and she goes into hers as REGGIE and DYLE step from the elevator She unlocks it tries to open it but finds it locked She enters fixes her hair in the mirror then goes to the door connecting her room with DYLE's He calls to her through the closed door as he empties his pockets Disappointed she knocks He races for the connecting door pulls back the bolt and rushes in He sits down to take off his shoes but is interrupted by the sound of REGGIE screaming He goes to the door leading to the hall and finds that locked as well As DYLE enters he wheels as the door is slammed and REGGIE who had been standing behind it locks it and pockets the key DYLE looks at her then sits down and starts to remove his shoes She smiles at him REGGIE cannot believe her eyes Testing the water with his hand he now steps in fully dressed He opens his coat and reads a label inside She goes to the open door for a closer look as he takes out his handkerchief and rinses it He holds up his wrist so she can see the watch He flicks a little water in her face then takes the nailbrush and scrubs his watch and watchband She turns and leaves slamming the door after her He begins unbuttoning his suit CLOSE SHOT The PHONE rings and she answers it REGGIE slowly lowers the phone to its cradle a worried expression on her face REGGIE on the phone looking like the rug has been pulled out from under her She shakes her head Then the bathroom door opens and DYLE appears dressed in a large bath towel At a table for two by the rail the city slowly passing in the bg The large motor launch moving along the river gaily ablaze with lights REGGIE reacts in surprise They walk back to the table where a WAITER is busy putting food on it mostly on REGGIE's side The lights go out She looks at him with happy amazement then pushes her plate away On benches by the water's edge lovers are surprised by the bright light which suddenly and without warning discovers them in various attitudes of mutual affection A searchlight near the boat's bridge has gone on and now begins sweeping the river banks Some are embarrassed some are amused and some the most intimate damn annoyed"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He holds up his wrist so she can see the watch  He begins unbuttoning his suit  She turns and leaves slamming the door after her  The PHONE rings and she answers it  CLOSE SHOT   REGGIE on the phone looking like the rug has been pulled out from under her  REGGIE slowly lowers the phone to its cradle a worried expression on her face  Then the bathroom door opens and DYLE appears dressed in a large bath towel  She shakes her head  The large motor launch moving along the river gaily ablaze with lights  At a table for two by the rail the city slowly passing in the bg  They walk back to the table where a WAITER is busy putting food on it mostly on REGGIE's side  REGGIE reacts in surprise  She looks at him with happy amazement then pushes her plate away  The lights go out  A searchlight near the boat's bridge has gone on and now begins sweeping the river banks  On benches by the water's edge  lovers are surprised by the bright light which suddenly and without warning discovers them in various attitudes of mutual affection  Some are embarrassed some are amused and some the most intimate damn annoyed DYLE shrugs  She offers him her cone thrusting it forward with enough force to dislodge the icecream and it lands right next to his lapel over his outside breast pocket including the Cathedral of NOTRE DAME in the background  as REGGIE and DYLE step from the elevator  He goes into his room and she goes into hers  She enters fixes her hair in the mirror then goes to the door connecting her room with DYLE's  She unlocks it tries to open it but finds it locked  Disappointed she knocks  He calls to her through the closed door as he empties his pockets  He sits down to take off his shoes but is interrupted by the sound of REGGIE screaming  He races for the connecting door pulls back the bolt and rushes in  As DYLE enters he wheels as the door is slammed and REGGIE who had been standing behind it locks it and pockets the key  He goes to the door leading to the hall and finds that locked as well  She smiles at him  DYLE looks at her then sits down and starts to remove his shoes  Testing the water with his hand he now steps in fully dressed  REGGIE can't believe her eyes  She goes to the open door for a closer look as he takes out his handkerchief and rinses it  He opens his coat and reads a label inside  He flicks a little water in her face then takes the nailbrush and scrubs his watch and watchband "
        }
      ]
    }
  ]
}