{
  "ground_truth": "Ben turns and walks down the hall, then they enter the sunroom. She nods, and he looks at her as she pours herself a drink and hands him one. She turns on the phonograph, and Ben looks at her. They look at each other, and Ben is half standing. He puts his hand up and retreats around the other side of the chair. She looks at him, then Mrs. Robinson and Ben move out of the sunroom, into the hall, up the stairs, and along the hall to the doorway of Elaine's room. Ben moves into the room and looks up at the portrait while Mrs. Robinson watches him in the background. He steps back, and she turns her back. Ben reaches forward and pulls the zipper down, and Mrs. Robinson lets her dress fall to the floor. Benjamin walks out of the door and down the hall as the camera pushes with him to the door. We see the entire stairway and part of the downstairs hall as Ben gets to the stairs and starts down. She walks out of the shot, and Ben starts back up the stairs. Ben slowly climbs the stairs, gets to the top, and starts slowly down the hall. Ben walks quickly into Elaine's room, crosses to the bed, and puts the purse down. As he starts to turn back, he looks up at Elaine's portrait and notices a movement reflected in the glass. He turns quickly to see Mrs. Robinson, naked, shutting the door to the bedroom behind her. She smiles, and Ben leaps at the door, pushes Mrs. Robinson aside, struggles with the door, gets it open, runs into the hall, and down the stairs. Ben rushes into the sunroom and sits down, then jumps up to get the glass he had been drinking from and sits down again. There is the sound of the front door opening and closing, and footsteps approach the sunroom. Mr. Robinson enters, reaches for Ben's glass, takes it from him, then turns his back to Ben to mix the drinks. Mr. Robinson turns and brings Ben the drink, but Ben shakes his head and then nods. Mrs. Robinson enters, now wearing the dress she wore earlier. Ben starts to get up, then sits back down as Mrs. Robinson nods. He stands, and Mr. Robinson stands up with him as they start out of the sunroom. Ben nods and continues to walk toward us as the sun shines brightly. Standing and sitting around the pool are Mr. and Mrs. Braddock, their friends Mr. and Mrs. Arnold, and the Arnold children, Peter and Louise, who are eight or nine, while watching from across the fence on one side of the house are the young girl from next door and her boyfriend.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Ben rotates and strides down the corridor, then they enter the conservatory. She acknowledges, and he gazes at her as she pours herself a beverage and hands him one. She activates the record player, and Ben glances at her. They gaze at each other, and Ben is half-standing. He raises his hand and withdraws around the other side of the seat. She glances at him, then Mrs. Robinson and Ben move out of the conservatory, into the corridor, up the steps, and along the corridor to the entrance of Elaine's chamber. Ben moves into the chamber and glances up at the likeness while Mrs. Robinson observes him in the backdrop. He steps back, and she rotates her back. Ben extends forward and pulls the zipper down, and Mrs. Robinson lets her gown drop to the ground. Benjamin strides out of the portal and down the corridor as the camera advances with him to the portal. We observe the entire staircase and part of the lower corridor as Ben arrives at the steps and begins descending. She strides out of the frame, and Ben begins back up the steps. Ben slowly ascends the steps, reaches the top, and begins slowly down the corridor. Ben strides swiftly into Elaine's chamber, traverses to the cot, and places the handbag down. As he starts to rotate back, he glances up at Elaine's likeness and perceives a movement reflected in the glass. He rotates quickly to see Mrs. Robinson, unclothed, shutting the portal to the chamber behind her. She grins, and Ben lunges at the portal, pushes Mrs. Robinson aside, wrestles with the portal, gets it open, sprints into the corridor, and down the steps. Ben dashes into the conservatory and sits down, then leaps up to get the goblet he had been drinking from and sits down again. There is the noise of the front portal opening and closing, and footsteps approach the conservatory. Mr. Robinson enters, reaches for Ben's goblet, takes it from him, then rotates his back to Ben to mix the beverages. Mr. Robinson rotates and brings Ben the beverage, but Ben shakes his head and then nods. Mrs. Robinson enters, now wearing the gown she wore earlier. Ben starts to rise, then sits back down as Mrs. Robinson nods. He stands, and Mr. Robinson stands up with him as they start out of the conservatory. Ben nods and continues to walk toward us as the sun beams brilliantly. Standing and sitting around the pool are Mr. and Mrs. Braddock, their companions Mr. and Mrs. Arnold, and the Arnold offspring, Peter and Louise, who are eight or nine, while watching from across the barrier on one side of the dwelling are the young girl from next door and her sweetheart."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Ben turns and walks down the hall, then the sunroom is entered by them. She nods, and Ben is looked at by her as a drink is poured by her for herself and one is handed to him. The phonograph is turned on by her, and she is looked at by Ben. They look at each other, and Ben is half standing. His hand is put up by him, and the other side of the chair is retreated around by him. She looks at him, then the sunroom is moved out of by Mrs. Robinson and Ben, into the hall, up the stairs, and along the hall to the doorway of Elaine's room. The room is moved into by Ben, and the portrait is looked up at by him while he is watched by Mrs. Robinson in the background. He steps back, and her back is turned by her. Forward is reached by Ben, and the zipper is pulled down and the dress is let by Mrs. Robinson fall to the floor. The door is walked out of by Benjamin, and the hall is walked down by him as the camera is pushed with him to the door. The entire stairway and part of the downstairs hall are seen by us as the stairs are gotten to by Ben, and he starts down. The shot is walked out of by her, and the stairs are started back up by Ben. The stairs are slowly climbed by Ben, the top is reached, and the hall is slowly started down. Elaine's room is quickly walked into by Ben, who crosses to the bed and the purse is put down. The turn is started back by him, then Elaine's portrait is looked up at, and movement is noticed by him reflected in the glass. He quickly turns to see Mrs. Robinson, naked, shutting the door to the bedroom behind her. A smile is given by her, and the door is leaped at by Ben, Mrs. Robinson is pushed aside, the door is struggled with, it is opened, and the hall is run into by him and then down the stairs. The sunroom is rushed into by Ben and he sits down, then the glass he had been drinking from is jumped up to get, and he sits down again. The sound of the front door opening and closing is heard, and footsteps approach the sunroom. Mr. Robinson enters, reaches for Ben's glass, takes it from him, then he turns his back to Ben to mix the drinks. The drink is brought to Ben by Mr. Robinson, but his head is shaken by Ben and then he nods. Mrs. Robinson enters, now wearing the dress she wore earlier. Ben starts to get up, then he sits back down as Mrs. Robinson nods. He stands, and Mr. Robinson stands up with him as they start out of the sunroom. A nod is given by Ben, and he continues to walk toward us as the sun shines brightly. Standing and sitting around the pool are Mr. and Mrs. Braddock, their friends Mr. and Mrs. Arnold, and the Arnold children, Peter and Louise, who are eight or nine, while watching from across the fence on one side of the house are the young girl from next door and her boyfriend."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Ben walks down the hall into the sunroom. He and she exchange nods as she pours drinks, handing one to him. She turns on the phonograph, and as Ben half-stands, they exchange looks. Ben retreats around the chair, and Mrs. Robinson and Ben move out to the hallway, up the stairs, and to Elaine’s room. Ben enters, looks at the portrait, and Mrs. Robinson observes. She turns away, and Ben unzips her dress, which falls to the floor. Ben exits, goes down the hall with the camera following to the stairs, descending. He heads back up, down the hall, and into Elaine’s room, placing a purse on the bed. Noticing movement in the portrait reflection, he turns to see a naked Mrs. Robinson closing the door. Smiling, she is pushed aside as Ben rushes out and downstairs. In the sunroom, Ben sits, then rises for his drink before sitting again. The front door is heard, footsteps approach, and Mr. Robinson enters, takes Ben’s glass, and mixes drinks. Ben refuses the offered drink, nodding. Mrs. Robinson enters wearing her earlier dress. Ben starts to rise, hesitates, then stands with Mr. Robinson, and they leave the sunroom. Ben continues forward in the bright sun. At the pool are Mr. and Mrs. Braddock, their friends the Arnolds, with their children Peter and Louise, while watching nearby are the neighbor girl and her boyfriend."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Ben walks down the hall into the sunroom, where she nods and hands him a drink. She starts the phonograph, and they exchange looks. Ben stands, raises his hand, and retreats around the chair. Ben and Mrs. Robinson leave the sunroom, move up the stairs to Elaine's doorway, and Ben enters while Mrs. Robinson watches him. He steps back, she turns, and he pulls her zipper down; her dress falls. Ben exits, heading downstairs, and the camera follows. He returns upstairs, goes to Elaine's room, places the purse on the bed, then notices a movement reflected in the portrait. He sees Mrs. Robinson, naked, shutting the door. Ben struggles to open it, pushes her aside, and runs downstairs to the sunroom, where he sits, takes his glass, and listens to approaching footsteps. Mr. Robinson enters, takes Ben's glass, mixes drinks, and offers Ben one. Ben shakes his head, nods, and stands as Mrs. Robinson enters dressed. Mr. Robinson stands with Ben, they start out of the sunroom, and Ben walks toward us. At the pool, Mr. and Mrs. Braddock, Mr. and Mrs. Arnold, and their children Peter and Louise are gathered, while the neighbor girl and her boyfriend watch from across the fence."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Ben makes a decisive turn and walks purposefully down the long hallway, eventually guiding them into the bright, inviting sunroom. She acknowledges him with a nod, and he returns her gaze attentively as she graciously pours herself a drink and generously hands him one. She then proceeds to turn on the phonograph, creating a gentle ambiance, while Ben continues to look at her with a mix of curiosity and thoughtfulness. They exchange glances, and Ben, only half-standing, raises his hand in a hesitant gesture before retreating around the other side of the chair. She fixes her gaze on him for a moment before Mrs. Robinson and Ben quietly exit the sunroom. They move seamlessly into the hallway, ascend the staircase, and make their way along the corridor to the entrance of Elaine's room. Once inside, Ben steps forward and observes the portrait with a sense of contemplation as Mrs. Robinson silently watches him from the background. Ben steps back, and she turns away from him. Summoning a bold resolve, Ben reaches forward and unzips her dress, allowing Mrs. Robinson to let it fall effortlessly to the floor. Benjamin then exits through the doorway, retracing his steps down the hall as the camera follows his path to the door. The scene reveals the entire stairway and a portion of the downstairs hall as Ben reaches the stairs and begins his descent. She steps out of view, and Ben changes his mind, turning to climb the stairs again. Ben slowly makes his way up, arrives at the top, and begins his cautious journey down the hall. With a sense of urgency, Ben briskly enters Elaine's room, crosses over to the bed, and places the purse down. As he pivots to leave, his attention is caught by a movement reflected in the glass of Elaine's portrait. He swiftly turns to discover Mrs. Robinson, completely naked, discreetly closing the bedroom door behind her. She smiles, and Ben, panicked, darts toward the door, pushing Mrs. Robinson aside in his haste, struggling momentarily with the door before getting it open, and quickly runs into the hallway and down the stairs. In a rush, Ben enters the sunroom and hastily sits down, then jumps up to retrieve the glass he had been drinking from, settling into his seat once more. The sound of the front door opening and closing is audible, followed by approaching footsteps towards the sunroom. Mr. Robinson enters the scene, reaches for Ben's glass, takes it from him, and turns his back to Ben, expertly mixing the drinks. Mr. Robinson turns around to hand Ben the drink he's prepared, but Ben, uncertain, first shakes his head and then nods in acknowledgment. At that moment, Mrs. Robinson enters the room, now wearing the dress she had on earlier. Ben begins to rise but reconsiders and sits back down as Mrs. Robinson gives a subtle nod. He stands up once more, prompting Mr. Robinson to rise as well, as they head out of the sunroom together. Ben nods again and continues to walk toward the viewer as the sun shines brightly overhead. Gathered around the pool are Mr. and Mrs. Braddock, accompanied by their friends Mr. and Mrs. Arnold, and the Arnold children, Peter and Louise, who appear to be around eight or nine years old. Meanwhile, watching with interest from across the fence, on one side of the house, are the neighbor's young girl and her boyfriend."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Ben decisively makes a sharp turn and begins walking purposefully down the extensive, seemingly endless hallway, eventually guiding them with intent into the sunlit, inviting sunroom that radiates warmth and hospitality. She acknowledges his presence with a respectful nod, and he attentively returns her gaze, watching closely as she graciously pours herself a drink before generously handing one over to him. With a serene air, she proceeds to activate the phonograph, carefully creating a gentle ambiance that fills the room with a soothing atmosphere. Meanwhile, Ben continues to watch her with a mixture of curiosity and thoughtful contemplation. Their eyes meet in a brief exchange of glances, and Ben, only partially standing, raises his hand in a hesitant gesture—a moment of impulsive indecision—before retreating around to the other side of the chair. She fixes her gaze on him, observing him intently for a moment before Mrs. Robinson and Ben quietly exit the sunroom together. They move fluidly and seamlessly into the adjoining hallway, ascend the staircase with ease, and make their way along the corridor, eventually reaching the entrance of Elaine's room. Once inside, Ben steps forward and observes the portrait with a deep sense of contemplation, while Mrs. Robinson silently watches him from the background, not saying a word. Ben then steps back as she turns away from him. Summoning a bold and daring resolve, Ben reaches forward and unzips her dress, allowing Mrs. Robinson to let it fall gracefully and effortlessly to the floor. Benjamin then exits through the doorway, retracing his steps down the hall as the camera follows and captures his path to the door. The scene reveals the entire stairway along with a portion of the downstairs hall as Ben reaches the stairs and begins his descent. She steps out of view, and Ben experiences a change of mind, choosing to turn around and climb the stairs yet again. Ben slowly makes his way up, arrives at the top, and begins his cautious journey down the hall once more. With a sense of urgency and determination, Ben briskly enters Elaine's room, crosses over to the bed, and carefully places the purse down. As he pivots to leave, something catches his attention—a movement reflected in the glass of Elaine's portrait. He swiftly turns around to discover Mrs. Robinson, completely unclothed, discreetly closing the bedroom door behind her. She smiles with a hint of mischief, and Ben, panicked and perhaps a bit startled, darts toward the door, pushing Mrs. Robinson aside in his haste. He struggles momentarily with the door before managing to get it open and quickly runs into the hallway and down the stairs, his footsteps echoing in his wake. In a rush, Ben enters the sunroom with haste and hastily sits down as if to collect himself, only to jump up quickly to retrieve the glass he had been drinking from, eventually settling back into his seat once more. The sound of the front door opening and closing is audible, followed by the approach of footsteps getting closer to the sunroom. Mr. Robinson enters the scene, reaches for Ben's glass, takes it from him, and turns his back to Ben, expertly mixing the drinks with practiced ease. Mr. Robinson then turns around to hand Ben the drink he’s prepared for him, but Ben, filled with uncertainty, first shakes his head and then nods in acknowledgment. At that moment, Mrs. Robinson enters the room, now wearing the dress she had on earlier. Ben begins to stand, feeling an urge to leave, but reconsiders and sits back down as Mrs. Robinson gives a subtle nod of understanding. He stands up once more, prompting Mr. Robinson to rise as well, as they all head out of the sunroom together as a group. Ben nods again, continuing to walk toward the viewer as the bright sun shines brilliantly overhead. Gathered around the inviting pool are Mr. and Mrs. Braddock, accompanied by their friends, Mr. and Mrs. Arnold, and the Arnold children, Peter and Louise, who appear to be approximately eight or nine years old. Meanwhile, observing with interest from across the fence on one side of the house are the neighbor’s young girl and her boyfriend, both watching with curiosity."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Ben pivots on his heel and proceeds down the hallway, each step echoing slightly off the walls, until he reaches the entrance to the sunroom. He and Mrs. Robinson cross the threshold together into the sunlit space. She acknowledges him with a slight nod, an unspoken communication that he reciprocates by holding her gaze. As she carefully selects a glass and pours herself a drink with a practiced motion, she simultaneously extends a second glass to him, which he takes. Without a word, she moves to the phonograph, her fingers deftly turning the knob to start the music. Ben's eyes remain on her, observing her every action. For a moment, they exchange looks, a silent interaction hangs between them, while Ben remains partially seated, balancing on the edge of the chair. He raises his hand in a gesture that suggests a pause or retreat, then maneuvers around the chair to create some distance. Her eyes follow him, assessing the situation. Together, they exit the sunroom, retracing their steps into the hallway, then proceed up the stairs with a deliberate pace. Her footsteps are measured as they continue along the upstairs corridor until they reach the doorway of Elaine's room. Ben advances into the room, allowing his gaze to rise and fixate on the portrait that decorates the wall. In the background, Mrs. Robinson's presence lingers as she watches him intently. Slowly, Ben steps back, creating space between himself and the portrait, prompting Mrs. Robinson to turn her back to him. With a slight forward lean, Ben extends his hand, his fingers finding the zipper on her dress, which he draws down with a steady hand. She allows the dress to slide gracefully to the floor, pooling around her feet. In response, Ben exits through the door, moving back into the hallway. The camera traces his journey, capturing the expanse of the stairway and part of the downstairs hall as Ben reaches the top of the stairs and begins his descent. As he goes, she exits the frame, prompting Ben to reverse his course and climb the stairs once more, this time with deliberate slowness. Reaching the top, he continues at an unhurried pace down the hall's length. With a sudden burst of urgency, Ben strides into Elaine's room, quickly crosses to the bed, and places the purse down with a determined motion. As he begins to turn away, his eyes inadvertently rise to meet Elaine's portrait, where he catches a flicker of movement reflected in the glass. Instinctively, he spins around to confront Mrs. Robinson, who stands there nude, as she quietly shuts the bedroom door behind her. Her lips curl into a smile as Ben, suddenly panicked, leaps toward the door. He pushes Mrs. Robinson aside with a sense of frantic urgency, wrestles with the door until it swings open, and dashes into the hallway, his feet pounding against the floorboards as he descends the stairs. Upon reaching the sunroom, Ben collapses into a seat, then quickly springs up to reclaim the glass from which he had been sipping and settles down again. The audible click of the front door opening and then shutting tight punctuates the air, followed by the measured approach of footsteps towards the sunroom. Mr. Robinson enters the room, extends a hand towards Ben's glass, taking it with ease, and momentarily turns away to mix the drinks. Pivoting back, Mr. Robinson offers Ben a fresh drink. Ben, however, signals a 'no' with a shake of his head before reconsidering and nodding. As Mrs. Robinson re-enters, now clad once more in the dress she previously wore, Ben instinctively begins to rise from his seat, only to hesitate and sink back down as Mrs. Robinson acknowledges him with a nod. Finally, he stands in unison with Mr. Robinson as they make their way out of the sunroom. Ben nods one last time and continues to move forward, advancing toward the viewer as the sunlight intensifies, casting a bright glow over the scene. Around the pool, standing and lounging are Mr. and Mrs. Braddock, surrounded by their friends, Mr. and Mrs. Arnold, and the Arnold children, Peter and Louise, who appear to be around eight or nine years old. Observing from a distance, across the fence on one side of the house, are the neighboring young girl and her boyfriend."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Ben and Mrs. Robinson walk from the hall into the sunroom, where she nods and hands him a drink after pouring herself one. She turns on the phonograph, and they exchange glances before Ben retreats around a chair. They move out of the sunroom and make their way upstairs to Elaine's room. Inside, Ben examines a portrait while Mrs. Robinson watches. He steps back, unzips her dress, and as it falls, he exits the room and heads down the stairs. Mrs. Robinson follows, and Ben ascends the stairs again, returning to Elaine's room. There, he places a purse on the bed, notices movement in Elaine's portrait, and swiftly confronts Mrs. Robinson, who is naked and has shut the bedroom door. He quickly maneuvers past her and dashes downstairs into the sunroom. After briefly sitting, he retrieves his glass and sits again as Mr. Robinson enters, takes the glass, and mixes drinks. Mr. Robinson hands Ben a drink, which he ambiguously accepts. Mrs. Robinson re-enters, now dressed, and after brief deliberation, Ben stands with Mr. Robinson, and they exit the sunroom. Outside, the sun illuminates as Mr. and Mrs. Braddock, along with friends and their children, sit around the pool, watched by a neighboring young couple."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Ben turns and walks down the hall, decorated in the classic mid-century style typical of affluent homes in the 1960s, then they enter the sunroom, a space designed to capture natural light for most of the day. She nods, and he looks at her as she pours herself a drink and hands him one, the choice of bourbon suggesting a preference common among adults at the time. She turns on the phonograph, playing a carefully curated collection of jazz records popular in that era, and Ben looks at her. They look at each other, and Ben is half standing, unsure and filled with internal conflict. He puts his hand up and retreats around the other side of the chair, an act signaling his hesitation. She looks at him, then Mrs. Robinson, noted for her iconic seduction scene from the film \"The Graduate,\" and Ben move out of the sunroom, into the hall, up the stairs, and along the hall to the doorway of Elaine's room, which is decorated with youthful, feminine touches like floral patterns and pastel colors reflecting a young woman's presence. Ben moves into the room and looks up at the portrait, a dignified image capturing Elaine in a moment of poise, while Mrs. Robinson watches him in the background. He steps back, and she turns her back. Ben reaches forward and pulls the zipper down, and Mrs. Robinson lets her dress fall to the floor, an audacious act revealing her bold and unreserved nature. Benjamin walks out of the door and down the hall as the camera, in a deliberate cinematic technique, pushes with him to the door. We see the entire stairway and part of the downstairs hall as Ben gets to the stairs and starts down, symbolizing his descent into a more complicated personal situation. She walks out of the shot, and Ben starts back up the stairs, driven by his conflicting emotions. Ben slowly climbs the stairs, gets to the top, and starts slowly down the hall, each step echoing his anxiety. Ben walks quickly into Elaine's room, crosses to the bed, and puts the purse down. As he starts to turn back, he looks up at Elaine's portrait and notices a movement reflected in the glass. He turns quickly to see Mrs. Robinson, naked, shutting the door to the bedroom behind her, a moment charged with tension. She smiles, a gesture both inviting and unnerving, and Ben leaps at the door, pushes Mrs. Robinson aside, struggles with the door, gets it open, runs into the hall, and down the stairs, overwhelmed by the situation. Ben rushes into the sunroom and sits down, then jumps up to get the glass he had been drinking from and sits down again, attempting to regain his composure. There is the sound of the front door opening and closing, a dramatic cue of another's presence, and footsteps approach the sunroom. Mr. Robinson enters, a figure of patriarchal authority, reaches for Ben's glass, takes it from him, then turns his back to Ben to mix the drinks, a ritual of hospitality and control. Mr. Robinson turns and brings Ben the drink, but Ben shakes his head and then nods, a gesture filled with indecision. Mrs. Robinson enters, now wearing the dress she wore earlier, reclaiming her poised exterior. Ben starts to get up, then sits back down as Mrs. Robinson nods. He stands, and Mr. Robinson stands up with him as they start out of the sunroom. Ben nods and continues to walk toward us as the sun shines brightly, symbolizing clarity or exposure. Standing and sitting around the pool are Mr. and Mrs. Braddock, wealthy and socially influential figures, their friends Mr. and Mrs. Arnold, and the Arnold children, Peter and Louise, who are eight or nine, energetically playing, while watching from across the fence on one side of the house are the young girl from next door and her boyfriend, representing the innocence and curiosity of youth."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Ben turns and walks down the hall then they enter the sunroom. She nods and he looks at her as she pours herself a drink and hands him one. She turns on the phonograph and Ben looks at her. They look at each other and Ben is half standing. He puts his hand up and retreats around the other side of the chair. She looks at him. then Mrs Robinson and Ben move out of the sunroom into the hall up the stairs and along the hall to the doorway of Elaine's room. Ben moves into the room and looks up at the portrait while Mrs Robinson watches him in the background. He steps back and she turns her back. Ben reaches forward and pulls the zipper down and Mrs Robinson let us her dress fall to the floor. Benjamin walks out of the door and down the hall as the camera pushes with him to the door. We see the entire stairway and part of the downstairs hall as Ben gets to the stairs and starts down. She walks out of the shot and Ben starts back up the stairs. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Ben slowly climbs the stairs gets to the top and starts slowly down the hall. Ben walks quickly into Elaine's room crosses to the bed and puts the purse down. As he starts to turn back he looks up at Elaine's portrait and notices a movement reflected in the glass. He turns quickly to see Mrs Robinson naked shutting the door to the bedroom behind her. She smiles and Ben leaps at the door pushes Mrs Robinson aside struggles with the door gets it open runs into the hall and down the stairs. Ben rushes into the sunroom and sits down then jumps up to get the glass he had been drinking from and sits down again. There is the sound of the front door opening and closing and footsteps approach the sunroom. Mr Robinson enters reaches for Ben's glass takes it from him then turns his back to Ben to mix the drinks. Mr Robinson turns and brings Ben the drink but Ben shakes his head and then nods. Mrs Robinson enters now wearing the dress she wore earlier. Ben starts to get up then sits back down as Mrs Robinson nods. He stands and Mr Robinson stands up with him as they start out of the sunroom. Ben nods and continues to walk toward us as the sun shines brightly. Standing and sitting around the pool are Mr and Mrs Braddock their friends Mr and Mrs Arnold and the Arnold children Peter and Louise who are eight or nine while watching from across the fence on one side of the house are the young girl from next door and her boyfriend."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Ben turns and walks down the hall then they enter the sunroom. She nods and he looks at her as she pours herself a drink and hands him one. She turns on the phonograph and Ben looks at her. They look at each other and Ben is half standing. He puts his hand up and retreats around the other side of the chair. She looks at him. then Mrs Robinson and Ben move out of the sunroom into the hall up the stairs and along the hall to the doorway of Elaine's room. Ben moves into the room and looks up at the portrait while Mrs Robinson watches him in the background. He steps back and she turns her back. Ben reaches forward and pulls the zipper down and Mrs Robinson let us her dress fall to the floor. Benjamin walks out of the door and down the hall as the camera pushes with him to the door. We see the entire stairway and part of the downstairs hall as Ben gets to the stairs and starts down. She walks out of the shot and Ben starts back up the stairs. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. Ben slowly climbs the stairs gets to the top and starts slowly down the hall. Ben walks quickly into Elaine's room crosses to the bed and puts the purse down. As he starts to turn back he looks up at Elaine's portrait and notices a movement reflected in the glass. He turns quickly to see Mrs Robinson naked shutting the door to the bedroom behind her. She smiles and Ben leaps at the door pushes Mrs Robinson aside struggles with the door gets it open runs into the hall and down the stairs. Ben rushes into the sunroom and sits down then jumps up to get the glass he had been drinking from and sits down again. There is the sound of the front door opening and closing and footsteps approach the sunroom. Mr Robinson enters reaches for Ben's glass takes it from him then turns his back to Ben to mix the drinks. Mr Robinson turns and brings Ben the drink but Ben shakes his head and then nods. Mrs Robinson enters now wearing the dress she wore earlier. Ben starts to get up then sits back down as Mrs Robinson nods. He stands and Mr Robinson stands up with him as they start out of the sunroom. Ben nods and continues to walk toward us as the sun shines brightly. Standing and sitting around the pool are Mr and Mrs Braddock their friends Mr and Mrs Arnold and the Arnold children Peter and Louise who are eight or nine while watching from across the fence on one side of the house are the young girl from next door and her boyfriend."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Ben turns and walks down the hall then they enter the sunroom. She nods and he looks at her as she pours herself a drink and hands him one. She turns on the phonograph and Ben looks at her. They look at each other and Ben is half standing. He puts his hand up and retreats around the other side of the chair. She looks at him. then Mrs Robinson and Ben move out of the sunroom into the hall up the stairs and along the hall to the doorway of Elaine's room. Mr Robinson enters reaches for Ben's glass takes it from him then turns his back to Ben to mix the drinks. Mr Robinson turns and brings Ben the drink but Ben shakes his head and then nods. Mrs Robinson enters now wearing the dress she wore earlier. Ben starts to get up then sits back down as Mrs Robinson nods. He stands and Mr Robinson stands up with him as they start out of the sunroom. Ben nods and continues to walk toward us as the sun shines brightly. Standing and sitting around the pool are Mr and Mrs Braddock their friends Mr and Mrs Arnold and the Arnold children Peter and Louise who are eight or nine while watching from across the fence on one side of the house are the young girl from next door and her boyfriend."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Ben turns and walks down the hall then they enter the sunroom. She nods and he looks at her as she pours herself a drink and hands him one. She turns on the phonograph and Ben looks at her. He stands and Mr Robinson stands up with him as they start out of the sunroom. Ben nods and continues to walk toward us as the sun shines brightly. Standing and sitting around the pool are Mr and Mrs Braddock their friends Mr and Mrs Arnold and the Arnold children Peter and Louise who are eight or nine while watching from across the fence on one side of the house are the young girl from next door and her boyfriend."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Tom pivots and skips down the corridor, then they hop into the greenhouse. He waves, and she gazes at him as he brews himself a tea and presents her one. He flicks on the jukebox, and Tom glances at him. They glance at one another, and Tom is half crouching. She lifts her arm and advances around the opposite side of the sofa. He glances at her, then Miss Green and Tom wander out of the greenhouse, into the corridor, down the ladder, and through the corridor to the entrance of Oliver's office. Tom saunters into the office and stares at the sculpture while Miss Green observes him from the background. She steps forward, and he spins his front. Tom leans backwards and zips the suitcase closed, and Miss Green lets her hat drop to the carpet. Thomas strolls out of the window and up the hallway as the spotlight pulls with him to the window. We observe the entire elevator and part of the upstairs corridor as Tom reaches the elevator and descends. He dances out of the frame, and Tom strides back up the elevator. Tom cautiously descends the elevator, reaches the bottom, and saunters slowly through the corridor. Tom darts briskly into Oliver's office, strolls to the table, and sets the folder down. As he begins to spin around, he catches sight of Oliver's sculpture and watches a shadow mirrored in the mirror. He spins swiftly to spot Miss Green, dressed, closing the entrance to the office behind her. He grins, and Tom dashes at the entrance, pulls Miss Green aside, juggles with the entrance, gets it ajar, sprints through the corridor, and up the elevator. Tom dashes into the greenhouse and lies down, then leaps up to grab the mug she had been sipping from and lies down again. There is the noise of the back window sliding and locking, and footsteps approach the greenhouse. Mr. Green arrives, grasps Tom's mug, takes it from him, then spins his front to Tom to brew the teas. Mr. Green spins and carries Tom the tea, but Tom nods his chin and then shakes. Miss Green arrives, now wearing the coat she wore earlier. Tom begins to sit down, then rises back up as Miss Green shakes. She crouches, and Mr. Green crouches with her as they retreat out of the greenhouse. Tom shakes and continues to skip away from us as the rain falls darkly. Crouching and lying around the fountain are Mr. and Mrs. White, their colleagues Mr. and Mrs. Smith, and the Smith offspring, Jamie and Linda, who are twelve or thirteen, while observing from beyond the hedge on the opposite side of the garden are the young boy from next door and his sibling."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Ben and Mrs. Robinson enter the sunroom, where she offers him a drink and plays the phonograph. As they exchange glances, Ben hesitates, retreats, but then follows her upstairs to Elaine's room. Mrs. Robinson watches as he studies a portrait, then seductively lets her dress fall, prompting Ben to leave quickly. He encounters Mr. Robinson in the sunroom, who offers him a drink. Mrs. Robinson reenters fully dressed. Ben stands briefly, then exits the sunroom. Outside, by the pool, Mr. and Mrs. Braddock, the Arnolds with their children, and neighbors watch Ben as he walks toward them."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Standing and sitting around the pool are Mr and Mrs Braddock their friends Mr and Mrs Arnold and the Arnold children Peter and Louise who are eight or nine while watching from across the fence on one side of the house are the young girl from next door and her boyfriend Ben nods and continues to walk toward us as the sun shines brightly He stands and Mr Robinson stands up with him as they start out of the sunroom Ben starts to get up then sits back down as Mrs Robinson nods Mrs Robinson enters now wearing the dress she wore earlier Mr Robinson turns and brings Ben the drink but Ben shakes his head and then nods Mr Robinson enters reaches for Ben's glass takes it from him then turns his back to Ben to mix the drinks There is the sound of the front door opening and closing and footsteps approach the sunroom Ben rushes into the sunroom and sits down then jumps up to get the glass he had been drinking from and sits down again She smiles and Ben leaps at the door pushes Mrs Robinson aside struggles with the door gets it open runs into the hall and down the stairs He turns quickly to see Mrs Robinson naked shutting the door to the bedroom behind her As he starts to turn back he looks up at Elaine's portrait and notices a movement reflected in the glass Ben walks quickly into Elaine's room crosses to the bed and puts the purse down Ben slowly climbs the stairs gets to the top and starts slowly down the hall She walks out of the shot and Ben starts back up the stairs We see the entire stairway and part of the downstairs hall as Ben gets to the stairs and starts down Benjamin walks out of the door and down the hall as the camera pushes with him to the door Ben reaches forward and pulls the zipper down and Mrs Robinson let us her dress fall to the floor He steps back and she turns her back Ben moves into the room and looks up at the portrait while Mrs Robinson watches him in the background then Mrs Robinson and Ben move out of the sunroom into the hall up the stairs and along the hall to the doorway of Elaine's room She looks at him He puts his hand up and retreats around the other side of the chair They look at each other and Ben is half standing She turns on the phonograph and Ben looks at her She nods and he looks at her as she pours herself a drink and hands him one Ben turns and walks down the hall then they enter the sunroom"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "She nods and he looks at her as she pours herself a drink and hands him one Ben turns and walks down the hall then they enter the sunroom They look at each other and Ben is half standing She turns on the phonograph and Ben looks at her She looks at him He puts his hand up and retreats around the other side of the chair Ben moves into the room and looks up at the portrait while Mrs Robinson watches him in the background then Mrs Robinson and Ben move out of the sunroom into the hall up the stairs and along the hall to the doorway of Elaine's room Ben reaches forward and pulls the zipper down and Mrs Robinson let us her dress fall to the floor He steps back and she turns her back We see the entire stairway and part of the downstairs hall as Ben gets to the stairs and starts down Benjamin walks out of the door and down the hall as the camera pushes with him to the door Ben slowly climbs the stairs gets to the top and starts slowly down the hall She walks out of the shot and Ben starts back up the stairs As he starts to turn back he looks up at Elaine's portrait and notices a movement reflected in the glass Ben walks quickly into Elaine's room crosses to the bed and puts the purse down She smiles and Ben leaps at the door pushes Mrs Robinson aside struggles with the door gets it open runs into the hall and down the stairs He turns quickly to see Mrs Robinson naked shutting the door to the bedroom behind her There is the sound of the front door opening and closing and footsteps approach the sunroom Ben rushes into the sunroom and sits down then jumps up to get the glass he had been drinking from and sits down again Mr Robinson turns and brings Ben the drink but Ben shakes his head and then nods Mr Robinson enters reaches for Ben's glass takes it from him then turns his back to Ben to mix the drinks Ben starts to get up then sits back down as Mrs Robinson nods Mrs Robinson enters now wearing the dress she wore earlier Ben nods and continues to walk toward us as the sun shines brightly He stands and Mr Robinson stands up with him as they start out of the sunroom Standing and sitting around the pool are Mr and Mrs Braddock their friends Mr and Mrs Arnold and the Arnold children Peter and Louise who are eight or nine while watching from across the fence on one side of the house are the young girl from next door and her boyfriend"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Ben walks quickly into Elaine's room crosses to the bed and puts the purse down As he starts to turn back he looks up at Elaine's portrait and notices a movement reflected in the glass He turns quickly to see Mrs Robinson naked shutting the door to the bedroom behind her She smiles and Ben leaps at the door pushes Mrs Robinson aside struggles with the door gets it open runs into the hall and down the stairs Ben rushes into the sunroom and sits down then jumps up to get the glass he had been drinking from and sits down again There is the sound of the front door opening and closing and footsteps approach the sunroom Mr Robinson enters reaches for Ben's glass takes it from him then turns his back to Ben to mix the drinks Mr Robinson turns and brings Ben the drink but Ben shakes his head and then nods Mrs Robinson enters now wearing the dress she wore earlier Ben starts to get up then sits back down as Mrs Robinson nods He stands and Mr Robinson stands up with him as they start out of the sunroom Ben nods and continues to walk toward us as the sun shines brightly Standing and sitting around the pool are Mr and Mrs Braddock their friends Mr and Mrs Arnold and the Arnold children Peter and Louise who are eight or nine while watching from across the fence on one side of the house are the young girl from next door and her boyfriend Ben turns and walks down the hall then they enter the sunroom She nods and he looks at her as she pours herself a drink and hands him one She turns on the phonograph and Ben looks at her They look at each other and Ben is half standing He puts his hand up and retreats around the other side of the chair She looks at him then Mrs Robinson and Ben move out of the sunroom into the hall up the stairs and along the hall to the doorway of Elaine's room Ben moves into the room and looks up at the portrait while Mrs Robinson watches him in the background He steps back and she turns her back Ben reaches forward and pulls the zipper down and Mrs Robinson let us her dress fall to the floor Benjamin walks out of the door and down the hall as the camera pushes with him to the door We see the entire stairway and part of the downstairs hall as Ben gets to the stairs and starts down She walks out of the shot and Ben starts back up the stairs Ben slowly climbs the stairs gets to the top and starts slowly down the hall"
        }
      ]
    }
  ]
}