{
  "ground_truth": "Across the fence on the other side of the house, a quartet of adults, formally dressed as though for a cocktail party, are holding drinks and watching, with one of them holding a baby. The Braddocks, the Arnolds, and their children are dressed in California Contemporary Sport Style, with the adults in styles infinitely too young for them and the children in styles infinitely too old for them. Mr. Braddock stands alone at the end of the pool near the house, while the others are more or less grouped at the other end. Mr. Braddock is hamming it up, and he has moved over by one of the windows of the house, the window into the kitchen. He speaks quickly, in a fake sotto voce, towards the window, but he has already moved away from the window and is readdressing his audience. They laugh as Mrs. Arnold makes a face at Mr. Arnold, who grinningly acknowledges the response to his snappy comeback. Mr. Braddock darts back to the window and then moves to the screen door, pushing it open so it slams against the wall inside. At the back of the hall, inside the house, stands Ben, dressed in a full-length skin diver's wet suit, flippers on his feet, an oxygen tank strapped to his back, the mask pushed up his forehead, and the air hose dangling. He holds a spear gun in his hand, and the people in the backyard applaud. His father stands just outside the screen door as Ben's arms come into view and pull the mask down. We are now looking through the mask as we move forward down the hall, with everything slightly distorted through the glass. Ben's hand comes up again with the breathing apparatus in it, and we move out of the door and toward the pool. Mr. Braddock is running back and forth, clapping his hands and delivering his now soundless pitch. We move down the steps and into the shallow end of the pool, with Mr. Braddock moving along the side of the pool and motioning toward us to come down to the deep end. He joins Mr. Arnold at the far end of the pool, and they both begin to motion us toward them. We get to the deep end of the pool, where he has a big smile. We surface again and pan around for a last look at the figures, through the slightly distorted glass of the mask, of Mrs. Arnold and Mrs. Braddock watching and smiling, the neighbors on each side of the house looking over their fences and laughing and pointing, Mr. Arnold nodding encouragement and talking, and Mr. Braddock on his knees, smiling and trying to reach out far enough to push us under.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Across the barrier on the opposite flank of the domicile, a foursome of grown-ups, formally attired as though for a cocktail gathering, are clutching beverages and observing, with one of them holding an infant. The Braddocks, the Arnolds, and their offspring are attired in California Contemporary Sport Fashion, with the grown-ups in fashions infinitely too youthful for them and the offspring in fashions infinitely too mature for them. Mr. Braddock stands solitary at the extremity of the pool near the domicile, while the others are more or less clustered at the opposite extremity. Mr. Braddock is overacting, and he has shifted over by one of the panes of the domicile, the pane into the galley. He speaks hastily, in a fabricated sotto voce, towards the pane, but he has already shifted away from the pane and is readdressing his group. They chuckle as Mrs. Arnold makes a grimace at Mr. Arnold, who smilingly acknowledges the reply to his witty retort. Mr. Braddock darts back to the pane and then moves to the screen door, pushing it ajar so it bangs against the partition inside. At the rear of the corridor, inside the domicile, stands Ben, clad in a full-length skin diver's wet suit, flippers on his feet, an oxygen tank fastened to his back, the mask shoved up his forehead, and the air tube dangling. He holds a spear gun in his hand, and the individuals in the backyard applaud. His father stands just outside the screen door as Ben's arms come into sight and pull the mask down. We are now peering through the mask as we advance forward down the corridor, with everything slightly distorted through the glass. Ben's hand comes up again with the breathing apparatus in it, and we move out of the door and toward the pool. Mr. Braddock is running back and forth, clapping his hands and delivering his now soundless spiel. We move down the steps and into the shallow extremity of the pool, with Mr. Braddock moving along the flank of the pool and gesturing toward us to come down to the profound extremity. He joins Mr. Arnold at the far extremity of the pool, and they both commence to gesture us toward them. We get to the profound extremity of the pool, where he has a big grin. We surface again and pan around for a last glance at the forms, through the slightly distorted glass of the mask, of Mrs. Arnold and Mrs. Braddock observing and smiling, the neighbors on each flank of the domicile peering over their barriers and chuckling and pointing, Mr. Arnold nodding encouragement and conversing, and Mr. Braddock on his knees, grinning and attempting to extend out far enough to push us under."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Across the fence on the other side of the house, drinks are being held and a baby is being held by a quartet of adults formally dressed as though for a cocktail party. The Braddocks, the Arnolds, and their children dress in California Contemporary Sport Style, with styles infinitely too young worn by the adults and styles infinitely too old worn by the children. At the end of the pool near the house, Mr. Braddock stands alone, while the others group more or less at the other end. Mr. Braddock hams it up, and he has moved over by one of the windows of the house, the window into the kitchen. Towards the window, he speaks quickly, in a fake sotto voce, but he has already moved away from the window and readdresses his audience. Laughter follows as a face is made at Mr. Arnold by Mrs. Arnold, who grinningly acknowledges his snappy comeback. Mr. Braddock darts back to the window and then pushes the screen door open so it slams against the wall inside. Ben, dressed in a full-length skin diver's wet suit, flippers on his feet, an oxygen tank strapped to his back, the mask pushed up his forehead, and the air hose dangling, stands at the back of the hall, inside the house. In the backyard, applause is given by the people as Ben's arms come into view and pull the mask down. Now we are looking through the mask as we move forward down the hall, with everything slightly distorted through the glass. With the breathing apparatus in his hand, Ben comes up again, and we move out of the door and toward the pool. Mr. Braddock runs back and forth, clapping his hands and delivering his now soundless pitch. We are moved down the steps and into the shallow end of the pool, with Mr. Braddock moving along the side of the pool and motioning toward us to come down to the deep end. He joins Mr. Arnold at the far end of the pool, and they both begin to motion us toward them. At the deep end of the pool, we surface again and pan around for a last look at the figures: Mrs. Arnold and Mrs. Braddock are watched and smiled at, the neighbors on each side of the house look over their fences and laugh and point, encouragement is nodded by Mr. Arnold, and on his knees, Mr. Braddock smiles and tries to reach out far enough to push us under."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Across the fence, four formally dressed adults hold drinks and watch, with one holding a baby. The Braddocks, the Arnolds, and their children wear California Contemporary Sport Style, mismatched by age. Mr. Braddock stands at the pool's end, performing near the house window. He speaks in a fake sotto voce but moves to reengage his audience, who laugh as Mrs. Arnold reacts playfully to Mr. Arnold's comeback. Mr. Braddock returns to the window, then pushes the screen door open, slamming it inside. Inside, Ben stands in a full-length diver's wetsuit, flippers, and an oxygen tank. Holding a spear gun, his mask is pushed up, and the audience applauds. His father stands by the door as Ben adjusts his mask. Viewing through the distorted glass, Ben moves toward the pool. Mr. Braddock claps silently, and we enter the shallow end, while he directs us to the deep end, joining Mr. Arnold. Smiling, we reach the deep end, surface, and see Mrs. Arnold and Mrs. Braddock smiling, neighbors leaning over fences, and Mr. Arnold nodding. Mr. Braddock, smiling, tries to push us under."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "On the other side of the house, four adults, dressed for a cocktail party, hold drinks while one carries a baby. The Braddocks, Arnolds, and their children wear California Contemporary Sport Style, with adults in too-young styles and children in too-old styles. Mr. Braddock stands at the pool's end near the house, acting out by the kitchen window and readdressing his audience, who laugh at Mrs. Arnold’s response to Mr. Arnold's joke. Mr. Braddock returns to the window, opens the screen door forcefully, and inside, Ben emerges in a full-length wet suit, flippers, oxygen tank, mask pushed up, air hose dangling, and holding a spear gun. Applauded by the backyard crowd, Ben's father watches as Ben pulls his mask down, and we see through it, moving down the hall and out the door to the pool. Mr. Braddock claps and motions us to the deep end, joining Mr. Arnold in signaling us. At the deep end, Mr. Braddock smiles as we surface, viewing Mrs. Arnold and Mrs. Braddock smiling, neighbors laughing, Mr. Arnold encouraging us, and Mr. Braddock trying to push us under."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Across the tall, wooden fence on the opposite side of the house, a small group of four adults, elegantly attired as if they were attending a sophisticated cocktail party, are leisurely holding their drinks and watching the scene unfold. Among them, one individual is gently cradling a baby in their arms. The Braddocks, the Arnolds, and their children are wearing outfits that epitomize the California Contemporary Sport Style. Interestingly, the adults are dressed in fashions that seem far too youthful for their age, while the children are clad in attire that is remarkably mature for their young years. Mr. Braddock stands apart from the group, positioned alone at the end of the swimming pool closest to the house, while the rest of the gathering is more or less clustered together at the opposite end of the pool area. Mr. Braddock is engaging in theatrics, playfully performing near one of the windows of the house, specifically the window that looks into the kitchen. He begins to speak in a rapid manner, adopting a humorous fake sotto voce directed toward the window, although he soon moves away from the window to address his audience once again. Laughter erupts as Mrs. Arnold playfully makes a face at Mr. Arnold, who acknowledges her gesture with a grin in response to his witty remark. \n\nMr. Braddock quickly dashes back to the window before proceeding to open the screen door with a vigorous push, causing it to slam loudly against the wall inside. Positioned at the back of the hallway within the house, Ben stands outfitted in an entire full-length skin diver’s wet suit. Attached to his feet are flippers, and an oxygen tank is securely strapped to his back. The mask rests pushed up on his forehead, and the air hose dangles freely. In his hand, he holds a spear gun, and as he steps into view, the people gathered in the backyard erupt into applause. Ben's father remains standing just outside the screen door, watching as Ben's arms come into view, and he skillfully pulls the mask down over his face. As we now look through the mask, we begin to move forward down the hallway, with the view slightly distorted through the glass. Ben’s hand reattaches the breathing apparatus, and as we exit the house, we head toward the inviting pool. Mr. Braddock energetically runs back and forth, clapping his hands in delight while delivering what is now a soundless pitch. \n\nWe descend the steps and enter the shallow end of the pool, with Mr. Braddock moving energetically alongside the pool, eagerly motioning us to head toward the deeper end. He soon joins Mr. Arnold at the far end of the pool, and together, they both begin motioning us in their direction with enthusiasm. As we arrive at the deep end of the pool, a broad smile greets us. We resurface and take a sweeping glance around for one last look at the figures, all observed through the slightly distorted glass of the mask. Mrs. Arnold and Mrs. Braddock are watching and smiling, the neighbors positioned on each side of the house peering over their fences, laughing and pointing playfully. Mr. Arnold nods in encouragement, continuing to speak animatedly, while Mr. Braddock finds himself on his knees, smiling broadly as he attempts to reach out just far enough to give us a playful push back under the water."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "On the opposite side of the house, just across the tall wooden fence that stands imposingly, a small group comprising four adults is gathered. They are elegantly attired, as if they were attending a sophisticated cocktail party, each person leisurely holding their drink while observing the unfolding scene with a sense of curious engagement. Among these adults, one individual stands out gently cradling a baby in their arms, adding a tender touch to the sophisticated atmosphere. Within the group, the Braddocks, the Arnolds, and their children are decked out in outfits that perfectly exemplify the California Contemporary Sport Style. There's an interesting juxtaposition in their fashion choices: the adults are dressed in clothing that seems strikingly youthful for their age, while the children don garments that are remarkably mature for their tender years. \n\nMr. Braddock, meanwhile, is positioned separately from the group, standing alone at the portion of the swimming pool that is nearest to the house. In contrast, the remainder of the gathering is more or less clustered together at the opposite end of the pool area, creating a lively yet relaxed social setting. In a display of theatrics, Mr. Braddock is playfully performing near one of the windows of the house, specifically choosing the window that offers a view into the kitchen. He begins to speak in a rapid fashion, adopting a humorously fake sotto voce directed toward the window. However, he soon departs from this entertainment to focus on his audience once again. As laughter bursts from the group, Mrs. Arnold playfully makes a face at Mr. Arnold, who responds with a grin, acknowledging her gesture in reaction to his witty remark.\n\nWithout hesitation, Mr. Braddock quickly dashes back to the window and then proceeds to dramatically open the screen door with a vigorous push, causing it to slam loudly against the interior wall. Meanwhile, positioned at the back of the hallway within the house, Ben makes an appearance, outfitted in a complete full-length skin diver’s wet suit. Flippers are attached to his feet, and an oxygen tank is securely strapped to his back, adding an element of adventure to this scene. The mask he wears rests pushed up on his forehead, and the air hose dangles freely, revealing his face. In his hand, he firmly holds a spear gun. As he steps into view, the people gathered in the backyard erupt into applause, acknowledging his appearance. Ben's father remains standing just outside the screen door, watching attentively as Ben's arms become visible, and he skillfully pulls the mask down over his face. As we now peer through the mask, we begin to move forward down the hallway, with our view intriguingly distorted through the glass. Ben's hand carefully reattaches the breathing apparatus, and as we emerge from the house, we head toward the inviting waters of the pool. Mr. Braddock is energetically running back and forth, clapping his hands in delight while delivering what has now become a soundless pitch, adding to the playful atmosphere.\n\nWe make our way down the steps and enter the pool at the shallow end, with Mr. Braddock moving energetically alongside the pool, eagerly motioning for us to head toward the deeper end. He soon joins Mr. Arnold at the far end, and together, they both begin motioning us in their direction with enthusiasm and encouragement. As we arrive at the deep end of the pool, a broad smile welcomes us. We resurface and take a sweeping glance around for one last look at the figures, all observed through the slightly distorted glass of the mask. Mrs. Arnold and Mrs. Braddock are watching intently, smiling warmly, while the neighbors positioned on each side of the house are peering over their fences, laughing and pointing in playful amusement. Mr. Arnold nods in encouragement, continuing to speak animatedly, while Mr. Braddock finds himself on his knees, smiling broadly as he attempts to reach out just far enough to give us a playful push back under the water, adding to the lively ambiance of the scene."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "On the other side of the house, across the fence, a quartet of adults dressed in formal attire, much like they are attending a cocktail party, hold their drinks with one among them cradling a baby, intently observing the scene. The Braddocks, the Arnolds, and their children are adorned in California Contemporary Sport Style clothing, with the adults wearing outfits that seem a tad too youthful for their age, while the children don styles that appear a bit too mature for them. Mr. Braddock stands isolated at the end of the pool closest to the house, while the rest of the group is more or less clustered at the opposite end. Mr. Braddock engages theatrically, maneuvering his way next to one of the windows of the house, specifically the one that looks into the kitchen. He rapidly speaks in a contrived sotto voce toward the window, effectively capturing attention before swiftly withdrawing to refocus on his audience. Their laughter is prompted as Mrs. Arnold humorously contorts her face at Mr. Arnold, who, with a grin, acknowledges the amusement sparked by his sharp retort. Mr. Braddock then swiftly darts back to the window before heading to the screen door, which he swings open with enough force that it collides with the wall inside. Inside the house, at the far end of the hall, stands Ben, clad entirely in a skin diver's wet suit complete with flippers on his feet, an oxygen tank secured on his back, and a mask perched atop his forehead while the air hose dangles freely. He grasps a spear gun, and the spectators in the backyard break into applause. As Ben's father positions himself just outside the screen door, Ben's arms come into view, pulling the mask down over his face. Now peering through the mask, we advance forward down the hallway, viewing everything through the slightly warped glass. Ben raises his hand again, now holding the breathing apparatus, and we exit through the door, making our way toward the pool. Mr. Braddock scurries back and forth energetically, clapping his hands and continuing his now silent pitch. As we descend the steps and enter the shallow end of the pool, Mr. Braddock moves alongside the pool's edge, gesturing for us to proceed to the deep end. Rejoining Mr. Arnold at the far end, both of them beckon us with their gestures. Reaching the deep end, we encounter Mr. Arnold's wide smile. We resurface and take a final panoramic glance at the scene through the slightly distorted glass of the mask. Mrs. Arnold and Mrs. Braddock remain, watching and smiling, while neighbors from either side of the house peer over their fences, laughing and pointing. Mr. Arnold nods in encouragement and speaks, while Mr. Braddock, down on his knees, wears a smile and playfully attempts to stretch far enough to push us underwater."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Across the fence on the opposite side of the house, a group of formally dressed adults, resembling guests at a cocktail party, casually hold drinks while one cradles a baby. The Braddocks, Arnolds, and their children sport California Contemporary Sport Style attire, with adults and children ironically dressed in age-inappropriate styles. Mr. Braddock stands alone near the house end of the pool, theatrically engaging his audience before shifting to a position near a kitchen window to deliver a comedic aside. His banter prompts laughter, with Mrs. Arnold responding humorously to Mr. Arnold's witticism. Mr. Braddock then moves to the screen door, dramatically pushing it open. Inside, Ben stands in a full-length skin diver's wetsuit, complete with flippers, an oxygen tank, mask, and a spear gun, drawing applause from the backyard crowd. Moving forward, we see through Ben's mask as he pulls it down and makes his way toward the pool. Mr. Braddock energetically gestures and claps, encouraging Ben to join him at the deep end. As Ben enters the pool and moves underwater, Mr. Braddock and Mr. Arnold continue signaling from the far end. Surfacing at the deep end, we observe Mrs. Arnold and Mrs. Braddock smiling, neighbors looking over fences with amusement, and Mr. Braddock enthusiastically reaching out, all visible through the mask's slightly distorted glass."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Across the fence on the other side of the house, a quartet of adults, formally dressed as though for a cocktail party reminiscent of mid-20th century social gatherings, are holding drinks and watching, with one of them holding a baby whose soft cooing adds a gentle background to the scene. The Braddocks, the Arnolds, and their children are dressed in California Contemporary Sport Style, a fashion trend characterized by its casual yet stylish flair, with the adults in styles infinitely too young for them, often opting for bright colors and trendy cuts, and the children in styles infinitely too old for them, drawing inspiration from high-end designer wear. Mr. Braddock stands alone at the end of the pool near the house, while the others are more or less grouped at the other end, reminiscent of a scene from a classic Hollywood film. Mr. Braddock is hamming it up, embodying an exaggerated theatrical performance, and he has moved over by one of the windows of the house, the window into the kitchen where a bustling scene of meal preparation could be taking place. He speaks quickly, in a fake sotto voce, towards the window, but he has already moved away from the window and is readdressing his audience, evoking the charm of a seasoned entertainer. They laugh as Mrs. Arnold makes a face at Mr. Arnold, who grinningly acknowledges the response to his snappy comeback, a testament to their enduring playful rapport. Mr. Braddock darts back to the window and then moves to the screen door, pushing it open so it slams against the wall inside with a sound that echoes like a cue in a comedic skit. At the back of the hall, inside the house, stands Ben, dressed in a full-length skin diver's wet suit, a nod to the popular diving culture in California's coastal areas, flippers on his feet, an oxygen tank strapped to his back, the mask pushed up his forehead, and the air hose dangling like a carefree whimsy. He holds a spear gun in his hand, reminiscent of an adventurer ready for an underwater expedition, and the people in the backyard applaud, adding a sense of communal excitement to the unfolding spectacle. His father stands just outside the screen door as Ben's arms come into view and pull the mask down, a ritualistic preparation for his impending plunge. We are now looking through the mask as we move forward down the hall, with everything slightly distorted through the glass, like peering into an aquatic world. Ben's hand comes up again with the breathing apparatus in it, and we move out of the door and toward the pool, a symbolic journey into the unknown. Mr. Braddock is running back and forth, clapping his hands and delivering his now soundless pitch, much like an enthusiastic coach urging his team on. We move down the steps and into the shallow end of the pool, with Mr. Braddock moving along the side of the pool and motioning toward us to come down to the deep end, where the water holds both mystery and allure. He joins Mr. Arnold at the far end of the pool, and they both begin to motion us toward them, as if guiding us to a deeper understanding. We get to the deep end of the pool, where he has a big smile that radiates warmth and encouragement. We surface again and pan around for a last look at the figures, through the slightly distorted glass of the mask, of Mrs. Arnold and Mrs. Braddock watching and smiling, embodying the essence of supportive companionship, the neighbors on each side of the house looking over their fences and laughing and pointing, adding a sense of neighborhood camaraderie, Mr. Arnold nodding encouragement and talking, his voice a gentle reassurance, and Mr. Braddock on his knees, smiling and trying to reach out far enough to push us under, transforming the scene into a playful yet poignant moment of shared joy."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Across the fence on the other side of the house a quartet of adults formally dressed as though for a cocktail party are holding drinks and watching with one of them holding a baby. The Braddocks the Arnolds and their children are dressed in California Contemporary Sport Style with the adults in styles infinitely too young for them and the children in styles infinitely too old for them. Mr Braddock stands alone at the end of the pool near the house while the others are more or less grouped at the other end. Mr Braddock is hamming it up and he has moved over by one of the windows of the house the window into the kitchen. He speaks quickly in a fake sotto voce towards the window but he has already moved away from the window and is readdressing his audience. They laugh as Mrs Arnold makes a face at Mr Arnold who grinningly acknowledges the response to his snappy comeback. Mr Braddock darts back to the window and then moves to the screen door pushing it open so it slams against the wall inside. At the back of the hall inside the house stands Ben dressed in a fulllength skin diver's wet suit flippers on his feet an oxygen tank strapped to his back the mask pushed up his forehead and the air hose dangling. He holds a spear gun in his hand and the people in the backyard applaud. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. His father stands just outside the screen door as Ben's arms come into view and pull the mask down. We are now looking through the mask as we move forward down the hall with everything slightly distorted through the glass. Ben's hand comes up again with the breathing apparatus in it and we move out of the door and toward the pool. Mr Braddock is running back and forth clapping his hands and delivering his now soundless pitch. We move down the steps and into the shallow end of the pool with Mr Braddock moving along the side of the pool and motioning toward us to come down to the deep end. He joins Mr Arnold at the far end of the pool and they both begin to motion us toward them. We get to the deep end of the pool where he has a big smile. We surface again and pan around for a last look at the figures through the slightly distorted glass of the mask of Mrs Arnold and Mrs Braddock watching and smiling. the neighbors on each side of the house looking over their fences and laughing and pointing. Mr Arnold nodding encouragement and talking and Mr Braddock on his knees smiling and trying to reach out far enough to push us under."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Across the fence on the other side of the house a quartet of adults formally dressed as though for a cocktail party are holding drinks and watching with one of them holding a baby. The Braddocks the Arnolds and their children are dressed in California Contemporary Sport Style with the adults in styles infinitely too young for them and the children in styles infinitely too old for them. Mr Braddock stands alone at the end of the pool near the house while the others are more or less grouped at the other end. Mr Braddock is hamming it up and he has moved over by one of the windows of the house the window into the kitchen. He speaks quickly in a fake sotto voce towards the window but he has already moved away from the window and is readdressing his audience. They laugh as Mrs Arnold makes a face at Mr Arnold who grinningly acknowledges the response to his snappy comeback. Mr Braddock darts back to the window and then moves to the screen door pushing it open so it slams against the wall inside. At the back of the hall inside the house stands Ben dressed in a fulllength skin diver's wet suit flippers on his feet an oxygen tank strapped to his back the mask pushed up his forehead and the air hose dangling. He holds a spear gun in his hand and the people in the backyard applaud. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. His father stands just outside the screen door as Ben's arms come into view and pull the mask down. We are now looking through the mask as we move forward down the hall with everything slightly distorted through the glass. Ben's hand comes up again with the breathing apparatus in it and we move out of the door and toward the pool. Mr Braddock is running back and forth clapping his hands and delivering his now soundless pitch. We move down the steps and into the shallow end of the pool with Mr Braddock moving along the side of the pool and motioning toward us to come down to the deep end. He joins Mr Arnold at the far end of the pool and they both begin to motion us toward them. We get to the deep end of the pool where he has a big smile. We surface again and pan around for a last look at the figures through the slightly distorted glass of the mask of Mrs Arnold and Mrs Braddock watching and smiling. the neighbors on each side of the house looking over their fences and laughing and pointing. Mr Arnold nodding encouragement and talking and Mr Braddock on his knees smiling and trying to reach out far enough to push us under."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Across the fence on the other side of the house a quartet of adults formally dressed as though for a cocktail party are holding drinks and watching with one of them holding a baby. The Braddocks the Arnolds and their children are dressed in California Contemporary Sport Style with the adults in styles infinitely too young for them and the children in styles infinitely too old for them. Mr Braddock stands alone at the end of the pool near the house while the others are more or less grouped at the other end. Mr Braddock is hamming it up and he has moved over by one of the windows of the house the window into the kitchen. He speaks quickly in a fake sotto voce towards the window but he has already moved away from the window and is readdressing his audience. He joins Mr Arnold at the far end of the pool and they both begin to motion us toward them. We get to the deep end of the pool where he has a big smile. We surface again and pan around for a last look at the figures through the slightly distorted glass of the mask of Mrs Arnold and Mrs Braddock watching and smiling. the neighbors on each side of the house looking over their fences and laughing and pointing. Mr Arnold nodding encouragement and talking and Mr Braddock on his knees smiling and trying to reach out far enough to push us under."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Across the fence on the other side of the house a quartet of adults formally dressed as though for a cocktail party are holding drinks and watching with one of them holding a baby. The Braddocks the Arnolds and their children are dressed in California Contemporary Sport Style with the adults in styles infinitely too young for them and the children in styles infinitely too old for them. the neighbors on each side of the house looking over their fences and laughing and pointing. Mr Arnold nodding encouragement and talking and Mr Braddock on his knees smiling and trying to reach out far enough to push us under."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Beyond the meadow on the opposite side of the barn, a troupe of giraffes, casually adorned as if for a garden tea, are juggling oranges and snoozing, with one of them balancing a hamster. The Spencers, the Thompsons, and their parrots are adorned in Victorian Automotive Casual Attire, with the giraffes in outfits entirely too vibrant for them and the parrots in outfits entirely too muted for them. Ms. Spencer lounges singularly at the edge of the lagoon near the barn, while the others are more or less clustered at the opposite edge. Ms. Spencer is clowning around, and she has sidled over to one of the barn's windows, the window into the attic. She gestures dramatically, in a faux baritone whisper, at the window, but she has already sidled away from the window and is gesticulating to her spectators. They chuckle as Mrs. Thompson grimaces at Mr. Thompson, who chucklingly accepts the reaction to his witty retort. Ms. Spencer charges back to the window and then saunters to the trapdoor, nudging it open so it slaps against the wall inside. At the back of the den, inside the barn, stands Alex, clad in a full-length astronaut's flight suit, skis on his feet, a parachute strapped to his back, the helmet tilted atop his head, and the parachute cord dangling. He grips a fishing rod in his hand, and the creatures in the meadow cheer. His uncle stands just outside the trapdoor as Alex's legs come into view and pull the helmet down. We are now peering through the helmet as we float forward down the den, with everything slightly distorted through the visor. Alex's hand rises again with the scuba gear in it, and we float out of the trapdoor and toward the lagoon. Ms. Spencer is skipping in zigzags, thumping her feet and projecting her now silent speech. We glide down the ramp and into the shallow edge of the lagoon, with Ms. Spencer skipping along the edge of the lagoon and beckoning toward us to float down to the deep edge. She joins Mr. Thompson at the distant edge of the lagoon, and they both start to beckon us toward them. We float to the deep edge of the lagoon, where he has a broad grin. We surface again and rotate for a final glance at the forms, through the slightly distorted visor of the helmet, of Mrs. Thompson and Mrs. Spencer snoozing and grinning, the giraffes on each side of the barn peeking over their meadows and giggling and gesturing, Mr. Thompson nodding assurance and humming, and Ms. Spencer on her paws, grinning and attempting to reach out far enough to shove us under."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "At a cocktail party, adults, including the Braddocks and Arnolds, are dressed inappropriately for their age. Mr. Braddock is amusing the group near a pool, while Ben, inside the house, appears in a full-length diving suit with gear, to the guests' applause. As he moves down the hall, the mask slightly distorts his view. Mr. Braddock enthusiastically signals Ben to dive in, and along with Mr. Arnold, encourages him to swim to the deep end. The scene ends with smiling adults and neighbors watching the pool activity through Ben's mask."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Mr Arnold nodding encouragement and talking and Mr Braddock on his knees smiling and trying to reach out far enough to push us under the neighbors on each side of the house looking over their fences and laughing and pointing We surface again and pan around for a last look at the figures through the slightly distorted glass of the mask of Mrs Arnold and Mrs Braddock watching and smiling We get to the deep end of the pool where he has a big smile He joins Mr Arnold at the far end of the pool and they both begin to motion us toward them We move down the steps and into the shallow end of the pool with Mr Braddock moving along the side of the pool and motioning toward us to come down to the deep end Mr Braddock is running back and forth clapping his hands and delivering his now soundless pitch Ben's hand comes up again with the breathing apparatus in it and we move out of the door and toward the pool We are now looking through the mask as we move forward down the hall with everything slightly distorted through the glass His father stands just outside the screen door as Ben's arms come into view and pull the mask down He holds a spear gun in his hand and the people in the backyard applaud At the back of the hall inside the house stands Ben dressed in a fulllength skin diver's wet suit flippers on his feet an oxygen tank strapped to his back the mask pushed up his forehead and the air hose dangling Mr Braddock darts back to the window and then moves to the screen door pushing it open so it slams against the wall inside They laugh as Mrs Arnold makes a face at Mr Arnold who grinningly acknowledges the response to his snappy comeback He speaks quickly in a fake sotto voce towards the window but he has already moved away from the window and is readdressing his audience Mr Braddock is hamming it up and he has moved over by one of the windows of the house the window into the kitchen Mr Braddock stands alone at the end of the pool near the house while the others are more or less grouped at the other end The Braddocks the Arnolds and their children are dressed in California Contemporary Sport Style with the adults in styles infinitely too young for them and the children in styles infinitely too old for them Across the fence on the other side of the house a quartet of adults formally dressed as though for a cocktail party are holding drinks and watching with one of them holding a baby"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The Braddocks the Arnolds and their children are dressed in California Contemporary Sport Style with the adults in styles infinitely too young for them and the children in styles infinitely too old for them Across the fence on the other side of the house a quartet of adults formally dressed as though for a cocktail party are holding drinks and watching with one of them holding a baby Mr Braddock is hamming it up and he has moved over by one of the windows of the house the window into the kitchen Mr Braddock stands alone at the end of the pool near the house while the others are more or less grouped at the other end They laugh as Mrs Arnold makes a face at Mr Arnold who grinningly acknowledges the response to his snappy comeback He speaks quickly in a fake sotto voce towards the window but he has already moved away from the window and is readdressing his audience At the back of the hall inside the house stands Ben dressed in a fulllength skin diver's wet suit flippers on his feet an oxygen tank strapped to his back the mask pushed up his forehead and the air hose dangling Mr Braddock darts back to the window and then moves to the screen door pushing it open so it slams against the wall inside His father stands just outside the screen door as Ben's arms come into view and pull the mask down He holds a spear gun in his hand and the people in the backyard applaud Ben's hand comes up again with the breathing apparatus in it and we move out of the door and toward the pool We are now looking through the mask as we move forward down the hall with everything slightly distorted through the glass We move down the steps and into the shallow end of the pool with Mr Braddock moving along the side of the pool and motioning toward us to come down to the deep end Mr Braddock is running back and forth clapping his hands and delivering his now soundless pitch We get to the deep end of the pool where he has a big smile He joins Mr Arnold at the far end of the pool and they both begin to motion us toward them the neighbors on each side of the house looking over their fences and laughing and pointing We surface again and pan around for a last look at the figures through the slightly distorted glass of the mask of Mrs Arnold and Mrs Braddock watching and smiling Mr Arnold nodding encouragement and talking and Mr Braddock on his knees smiling and trying to reach out far enough to push us under"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "We are now looking through the mask as we move forward down the hall with everything slightly distorted through the glass Ben's hand comes up again with the breathing apparatus in it and we move out of the door and toward the pool Mr Braddock is running back and forth clapping his hands and delivering his now soundless pitch We move down the steps and into the shallow end of the pool with Mr Braddock moving along the side of the pool and motioning toward us to come down to the deep end He joins Mr Arnold at the far end of the pool and they both begin to motion us toward them We get to the deep end of the pool where he has a big smile We surface again and pan around for a last look at the figures through the slightly distorted glass of the mask of Mrs Arnold and Mrs Braddock watching and smiling the neighbors on each side of the house looking over their fences and laughing and pointing Mr Arnold nodding encouragement and talking and Mr Braddock on his knees smiling and trying to reach out far enough to push us under Across the fence on the other side of the house a quartet of adults formally dressed as though for a cocktail party are holding drinks and watching with one of them holding a baby The Braddocks the Arnolds and their children are dressed in California Contemporary Sport Style with the adults in styles infinitely too young for them and the children in styles infinitely too old for them Mr Braddock stands alone at the end of the pool near the house while the others are more or less grouped at the other end Mr Braddock is hamming it up and he has moved over by one of the windows of the house the window into the kitchen He speaks quickly in a fake sotto voce towards the window but he has already moved away from the window and is readdressing his audience They laugh as Mrs Arnold makes a face at Mr Arnold who grinningly acknowledges the response to his snappy comeback Mr Braddock darts back to the window and then moves to the screen door pushing it open so it slams against the wall inside At the back of the hall inside the house stands Ben dressed in a fulllength skin diver's wet suit flippers on his feet an oxygen tank strapped to his back the mask pushed up his forehead and the air hose dangling He holds a spear gun in his hand and the people in the backyard applaud His father stands just outside the screen door as Ben's arms come into view and pull the mask down"
        }
      ]
    }
  ]
}