{
  "ground_truth": "The series of scenes begins with Ben sinking to the bottom of a pool, observed by people standing around it. Transitioning to a phone booth located in the entrance area of a hotel between the lobby and the driveway, Ben holds the receiver to his ear before hanging up slowly. He stands up, looks around, moves uncomfortably, removes his jacket, carries it folded across his arm, leaves the phone booth, and heads toward the main lobby. As he is about to enter, a group of very old people comes out, filling the doorway, muttering, and helping each other down the steps. Ben holds the door open politely for them and, as they pass, starts to move inside. At that moment, a dozen young people dressed for a high school dance push past him into the lobby. He holds the other door open for them, smiles politely, but they ignore him. He follows them into the lobby, approaching the front desk with them. A boy at the front of the group converses with the clerk, who points across the lobby and gives directions. Terror and disbelief appear in Ben's eyes as he looks helplessly at the clerk. Miss DeWitte takes Ben's hand for a handshake, followed by a twelve-year-old boy's, and then Mr. Singleman's hand, while Mrs. Singleman looks at a seating list. Ben backs out of the seating area, quickly rises as they sit down, attempts a smile, then looks out the window and at the table center. Noticing a passing waiter, Ben raises his hand, then looks apologetically at Mrs. Robinson. The waiter stops, turns, approaches their table, looks at Mrs. Robinson, and moves away, with Ben watching him go and shaking his head. Ben then exits the Veranda Room and walks into the lobby, proceeding to the front desk where he stands.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The sequence of episodes starts with Ben descending to the base of a basin, witnessed by individuals standing around it. Shifting to a call booth situated in the entrance area of a hotel between the lobby and the driveway, Ben grasps the handset to his ear before placing it back slowly. He rises, glances around, shifts uncomfortably, takes off his blazer, carries it folded across his arm, exits the call booth, and proceeds toward the main lobby. As he is about to enter, a group of very elderly people emerges, filling the doorway, murmuring, and assisting each other down the steps. Ben holds the door open courteously for them and, as they pass, begins to move inside. At that instant, a dozen youthful people attired for a secondary school dance shove past him into the lobby. He holds the other door open for them, grins courteously, but they disregard him. He follows them into the lobby, approaching the front desk with them. A boy at the head of the group converses with the attendant, who gestures across the lobby and provides instructions. Horror and incredulity appear in Ben's eyes as he gazes helplessly at the attendant. Miss DeWitte takes Ben's hand for a handshake, followed by a twelve-year-old boy's, and then Mr. Singleman's hand, while Mrs. Singleman looks at a seating list. Ben retreats from the seating area, swiftly rises as they sit down, tries a grin, then looks out the window and at the table center. Observing a passing server, Ben raises his hand, then looks apologetically at Mrs. Robinson. The server halts, turns, approaches their table, looks at Mrs. Robinson, and moves away, with Ben watching him depart and shaking his head. Ben then leaves the Veranda Room and walks into the lobby, advancing to the front desk where he stands."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The series of scenes begins with Ben sinking to the bottom of a pool, and he is observed by people standing around it. Transitioning to a phone booth located in the entrance area of a hotel between the lobby and the driveway, the receiver is held to his ear by Ben before he slowly hangs up. He stands up, looks around, moves uncomfortably, removes his jacket, carries it folded across his arm, leaves the phone booth, and heads toward the main lobby. As he is about to enter, a group of very old people fills the doorway, mutter, and help each other down the steps while coming out. The door is held open politely by Ben for them, and as they pass, he starts to move inside. At that moment, a dozen young people dressed for a high school dance push past him into the lobby. The other door is held open by him for them, and he smiles politely, but they ignore him. He follows them into the lobby and approaches the front desk with them. A boy at the front of the group converses with the clerk, who points across the lobby and gives directions. Terror and disbelief appear in Ben's eyes as he helplessly looks at the clerk. Miss DeWitte shakes Ben's hand, followed by a twelve-year-old boy, and then Mr. Singleman, while a seating list is looked at by Mrs. Singleman. Ben backs out of the seating area, quickly rises as they sit down, attempts a smile, then looks out the window and at the table center. Noticing a passing waiter, Ben raises his hand, then looks apologetically at Mrs. Robinson. The waiter is stopped, turned, and approached by their table, looks at Mrs. Robinson, and moves away, as Ben watches him go and shakes his head. Ben then exits the Veranda Room and walks into the lobby, where he proceeds to stand at the front desk."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The scene begins with Ben sinking to the pool's bottom, observed by onlookers. In a hotel entrance phone booth, Ben holds the receiver, then hangs up slowly. He stands, looks around, shifts uncomfortably, removes his jacket, carries it on his arm, exits the booth, and heads to the lobby. As he approaches, a group of elderly people exits, filling the doorway and helping each other. Ben politely holds the door for them. Just then, teens dressed for a dance push past him into the lobby; he holds the door for them too but is ignored. He follows them to the front desk, where a boy talks to the clerk, who points and gives directions. Ben, filled with disbelief, watches helplessly. Miss DeWitte shakes his hand, followed by a boy and Mr. Singleman, while Mrs. Singleman checks a seating list. Ben backs away, rising quickly as they sit, attempts to smile, and glances at the window and table. Spotting a waiter, Ben signals him, then gives Mrs. Robinson an apologetic look. The waiter approaches, looks at Mrs. Robinson, then leaves, with Ben watching and shaking his head. Ben exits the Veranda Room and heads to the front desk."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The scenes start with Ben sinking in a pool, watched by observers. He transitions to a phone booth in a hotel entrance, holds, then hangs up the receiver, and, after looking around uncomfortably, removes his jacket, carrying it folded. He leaves the booth for the main lobby, holding the door for elderly people exiting, then gets pushed aside by high schoolers entering. Smiling politely, he's ignored as he joins them at the front desk. A boy talks to the clerk, while Ben appears terrified and helpless. Miss DeWitte shakes his hand, followed by a boy and Mr. Singleman, as Mrs. Singleman checks a seating list. Ben backs out, stands as they sit, attempts a smile, then looks out the window. He signals a waiter passing by, looks apologetically at Mrs. Robinson, and watches the waiter leave, shaking his head. Ben exits the Veranda Room, walks into the lobby, and heads to the front desk."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The sequence of scenes commences with Ben slowly sinking to the very bottom of a swimming pool, observed from above by several people casually standing around its perimeter. The scene then transitions to a phone booth situated conveniently in the entrance area of a grand hotel, strategically positioned between the lively lobby and the bustling driveway. Here, Ben, holding the telephone receiver to his ear, listens intently before methodically hanging it up with a deliberate slowness. Following this, he stands up and casts a wary glance around the area, shifting uncomfortably on his feet. He then removes his jacket, folds it carefully over his arm, and, carrying it with him, exits the phone booth, making his way toward the main lobby of the hotel.\n\nAs Ben approaches the entrance to the lobby, he encounters a group of very elderly individuals who are making their way out. They move together, obstructing the doorway as they mutter to each other and offer assistance while descending the steps. Demonstrating politeness, Ben holds the door open for them, and as they file past, he begins to move inside. At precisely that moment, a dozen young people, all dressed in attire suitable for a high school dance, rush past him into the lobby. Maintaining his courteous demeanor, he holds the second door open and offers them a polite smile, but they proceed to ignore his gesture. Undeterred, he follows them into the lobby, eventually finding himself approaching the front desk as part of their group.\n\nPositioned at the head of the group, a boy engages in conversation with the clerk, who points across the bustling lobby while providing directions. Ben's eyes express a mixture of terror and disbelief as he gazes helplessly at the clerk. Miss DeWitte then takes Ben's hand in a formal handshake, followed by a twelve-year-old boy's hand, and subsequently by Mr. Singleman's hand, while Mrs. Singleman attentively examines a seating list. Ben awkwardly backs out of the seating area and quickly stands as they take their seats. Attempting to maintain composure, he offers a tentative smile, then diverts his attention to gaze out the window and at the center of the table. Observing a passing waiter, Ben raises his hand to signal, only to turn and offer an apologetic glance at Mrs. Robinson. The waiter pauses, turns around, approaches the table, glances at Mrs. Robinson, and subsequently departs, with Ben watching his retreat and shaking his head in resigned acknowledgment. Ben then leaves the Veranda Room, walking with determined steps into the lobby and making his way toward the front desk, where he comes to a standstill."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The sequence of unfolding scenes begins with Ben slowly descending to the deepest part of a swimming pool, his movements being observed by several individuals who are casually positioned around the pool's perimeter. The scene seamlessly transitions to the setting of a phone booth, conveniently located in the entrance area of an expansive, grand hotel. The booth strategically lies between the lively, bustling lobby of the hotel and its busy driveway. In this setting, Ben is seen holding the telephone receiver to his ear, listening intently. After a moment of deep focus, he methodically places the receiver back in its cradle with deliberate slowness. Once finished, he stands up, casting cautious glances around the area while shifting uncomfortably on his feet. He then removes his jacket and carefully folds it over his arm, holding it securely as he exits the phone booth, making his way with purpose toward the main lobby of the hotel.\n\nAs Ben moves closer to the entrance of the lobby, he encounters a group of elderly individuals, all moving together as they make their way out of the hotel. They obstruct the doorway with their slow movements, muttering to each other and offering assistance as they carefully descend the steps. Demonstrating genuine politeness, Ben holds the door open for them, allowing them to pass. As they eventually file past, he steps forward to enter the building. At that precise moment, a dozen young people, all dressed in lively attire suitable for a high school dance, rush past him into the lobby. Despite their haste, Ben maintains his courteous demeanor, holding the second door open and offering them a polite smile. However, they proceed inside, completely ignoring his thoughtful gesture. Undeterred by their lack of acknowledgment, he follows them into the vibrant lobby and eventually finds himself approaching the front desk as part of the group.\n\nPositioned at the forefront of the group, a boy strikes up a conversation with the clerk, who gestures across the bustling lobby while giving directions. Ben's expression conveys a mixture of terror and disbelief as his eyes helplessly seek an answer from the clerk. Miss DeWitte then engages Ben in a formal handshake, followed by a handshake with a twelve-year-old boy, and subsequently with Mr. Singleman, while Mrs. Singleman attentively examines a seating list. Trying to avoid any awkwardness, Ben awkwardly backs out of the seating area and stands quickly as they settle into their seats. Attempting to maintain his composure, he offers a tentative smile before diverting his attention to gaze out the window and at the center of the table. Spotting a passing waiter, Ben raises his hand to signal; however, he turns and offers an apologetic glance at Mrs. Robinson. The waiter pauses, turns around, approaches their table, glances at Mrs. Robinson, and subsequently departs, with Ben watching his retreat while shaking his head in resigned acknowledgment. Subsequently, Ben exits the Veranda Room, walking determinedly back into the lobby, where he makes his way steadily toward the front desk, eventually coming to a standstill."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The series of scenes unfolds with Ben gradually descending to the bottom of a pool, his body sinking slowly while people situated around the pool observe him intently from above. As the scene transitions, Ben is positioned within a phone booth located strategically between the lobby and driveway of a hotel entrance area. He holds the receiver against his ear, maintaining the connection momentarily before deliberately replacing the receiver back onto its cradle with a slow and deliberate motion. Rising from his seated position, Ben casts a look around his surroundings, his expression revealing discomfort as he shifts slightly and moves awkwardly in place. He then makes the decision to remove his jacket, carefully folding it and draping it across his arm. Exiting the confines of the phone booth, Ben begins his journey toward the main lobby of the hotel. As he approaches the entrance with the intention of entering, he is met by a group of elderly individuals emerging from within, occupying the doorway entirely as they assist each other with mutterings and tentative steps down the stairs. Ben courteously holds the door open for them, standing aside patiently until they have all passed through. As they move past him, he makes his way inside, only to be suddenly brushed aside by a bustling group of young people, dressed in attire suitable for a high school dance, who push past him to gain entry to the lobby. Maintaining his composure, Ben holds the other door open for this new group, offering them a polite smile which goes unnoticed as they continue past him unacknowledged. With the group now inside, Ben trails behind them and makes his way to the front desk. There, a boy at the forefront engages in a conversation with the desk clerk, prompting the clerk to extend his arm and point across the lobby while providing directions. Observing this interaction, a look of terror and disbelief begins to manifest in Ben's eyes, conveying his sense of helplessness as he glances pleadingly at the clerk. In the midst of this, Miss DeWitte approaches Ben, taking his hand for a handshake, which is followed sequentially by a twelve-year-old boy doing the same, and finally by Mr. Singleman, all while Mrs. Singleman is preoccupied with examining a seating list. As these interactions unfold, Ben instinctively begins to retreat from the seating area, rising quickly as the group settles into their seats. Attempting to manage a smile, he casts a glance out the window before shifting his gaze towards the center of the table. Spotting a waiter moving past, Ben swiftly raises his hand to catch his attention and follows this motion by directing an apologetic look at Mrs. Robinson. The waiter, noticing Ben's signal, halts his steps, pivots on his heel, and approaches their table, acknowledging Mrs. Robinson before ultimately proceeding away, with Ben watching his departure and shaking his head in resignation. Following this sequence, Ben leaves the Veranda Room and transitions into the lobby once more, methodically making his way to stand before the front desk where he pauses."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The series of scenes begins with Ben sinking to the pool's bottom, observed by onlookers. In a transition to a hotel phone booth, Ben holds the receiver, hangs up, and, feeling uneasy, removes his jacket, carries it folded across his arm, and exits toward the lobby. As he approaches the entrance, he politely holds the door for a group of elderly people assisting each other down the steps. Just as he starts inside, a dozen high school dance attendees push past him. He opens the other door for them, smiling politely despite being ignored, and follows them to the front desk. There, a boy from the group receives directions from the clerk, leaving Ben with an expression of terror and disbelief. In a sequence of handshakes with Miss DeWitte, a twelve-year-old, and Mr. Singleman, Ben observes Mrs. Singleman checking a seating list. He backs out of the seating area as they settle in, attempts a smile, and glances out the window and at the table. Spotting a passing waiter, Ben raises his hand, then looks apologetically at Mrs. Robinson. The waiter stops, acknowledges Mrs. Robinson, and leaves, prompting Ben to shake his head as he watches. Ben then exits the Veranda Room, enters the lobby, and proceeds to stand at the front desk."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The series of scenes begins with Ben sinking to the bottom of a pool, possibly reflecting his feelings of being overwhelmed, observed by people standing around it. Transitioning to a phone booth located in the entrance area of a grand hotel between the opulent lobby and the bustling driveway, Ben holds the receiver to his ear before hanging up slowly. He stands up, looks around, moves uncomfortably, removes his jacket, carries it folded across his arm, leaves the phone booth, and heads toward the main lobby. As he is about to enter, a group of very old people, likely hotel guests who are part of a bus tour often seen in such establishments, comes out, filling the doorway, muttering, and helping each other down the steps. Ben holds the door open politely for them and, as they pass, starts to move inside. At that moment, a dozen young people dressed for a high school dance push past him, buzzing with excitement for their evening, into the lobby. He holds the other door open for them, smiles politely, but they ignore him, caught in their own world. He follows them into the lobby, approaching the front desk with them. A boy at the front of the group converses with the clerk, who points across the lobby, likely indicating the ballroom reserved for their event, and gives directions. Terror and disbelief appear in Ben's eyes as he looks helplessly at the clerk, perhaps realizing he is out of place. Miss DeWitte, a socialite known for her frequent attendance at upscale gatherings, takes Ben's hand for a handshake, followed by a twelve-year-old boy's, clearly a child of one of the guests, and then Mr. Singleman's hand, while Mrs. Singleman looks at a seating list, possibly sorting out arrangements. Ben backs out of the seating area, quickly rises as they sit down, attempts a smile, then looks out the window and at the table center, feeling increasingly disoriented. Noticing a passing waiter, Ben raises his hand, then looks apologetically at Mrs. Robinson, whom he might have unintentionally disturbed. The waiter stops, turns, approaches their table, looks at Mrs. Robinson, once a regular customer known for her discerning taste, and moves away, with Ben watching him go and shaking his head, feeling out of sync with the setting. Ben then exits the Veranda Room, a place offering sweeping views and elegant dining, and walks into the lobby, proceeding to the front desk where he stands, unsure of his next move."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The series of scenes begins with Ben sinking to the bottom of a pool observed by people standing around it. Transitioning to a phone booth located in the entrance area of a hotel between the lobby and the driveway Ben holds the receiver to his ear before hanging up slowly. He stands up looks around moves uncomfortably removes his jacket carries it folded across his arm leaves the phone booth and heads toward the main lobby. As he is about to enter a group of very old people comes out filling the doorway muttering and helping each other down the steps. Ben holds the door open politely for them and as they pass starts to move inside. At that moment a dozen young people dressed for a high school dance push past him into the lobby. He holds the other door open for them smiles politely but they ignore him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. He follows them into the lobby approaching the front desk with them. A boy at the front of the group converses with the clerk who points across the lobby and gives directions. Terror and disbelief appear in Ben's eyes as he looks helplessly at the clerk. Miss DeWitte takes Ben's hand for a handshake followed by a twelveyearold boy's and then Mr Singleman's hand while Mrs Singleman looks at a seating list. Ben backs out of the seating area quickly rises as they sit down attempts a smile then looks out the window and at the table center. Noticing a passing waiter Ben raises his hand then looks apologetically at Mrs Robinson. The waiter stops turns approaches their table looks at Mrs Robinson and moves away with Ben watching him go and shaking his head. Ben then exits the Veranda Room and walks into the lobby proceeding to the front desk where he stands."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The series of scenes begins with Ben sinking to the bottom of a pool observed by people standing around it. Transitioning to a phone booth located in the entrance area of a hotel between the lobby and the driveway Ben holds the receiver to his ear before hanging up slowly. He stands up looks around moves uncomfortably removes his jacket carries it folded across his arm leaves the phone booth and heads toward the main lobby. As he is about to enter a group of very old people comes out filling the doorway muttering and helping each other down the steps. Ben holds the door open politely for them and as they pass starts to move inside. At that moment a dozen young people dressed for a high school dance push past him into the lobby. He holds the other door open for them smiles politely but they ignore him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. He follows them into the lobby approaching the front desk with them. A boy at the front of the group converses with the clerk who points across the lobby and gives directions. Terror and disbelief appear in Ben's eyes as he looks helplessly at the clerk. Miss DeWitte takes Ben's hand for a handshake followed by a twelveyearold boy's and then Mr Singleman's hand while Mrs Singleman looks at a seating list. Ben backs out of the seating area quickly rises as they sit down attempts a smile then looks out the window and at the table center. Noticing a passing waiter Ben raises his hand then looks apologetically at Mrs Robinson. The waiter stops turns approaches their table looks at Mrs Robinson and moves away with Ben watching him go and shaking his head. Ben then exits the Veranda Room and walks into the lobby proceeding to the front desk where he stands."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The series of scenes begins with Ben sinking to the bottom of a pool observed by people standing around it. Transitioning to a phone booth located in the entrance area of a hotel between the lobby and the driveway Ben holds the receiver to his ear before hanging up slowly. He stands up looks around moves uncomfortably removes his jacket carries it folded across his arm leaves the phone booth and heads toward the main lobby. As he is about to enter a group of very old people comes out filling the doorway muttering and helping each other down the steps. Ben backs out of the seating area quickly rises as they sit down attempts a smile then looks out the window and at the table center. Noticing a passing waiter Ben raises his hand then looks apologetically at Mrs Robinson. The waiter stops turns approaches their table looks at Mrs Robinson and moves away with Ben watching him go and shaking his head. Ben then exits the Veranda Room and walks into the lobby proceeding to the front desk where he stands."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The series of scenes begins with Ben sinking to the bottom of a pool observed by people standing around it. The waiter stops turns approaches their table looks at Mrs Robinson and moves away with Ben watching him go and shaking his head. Ben then exits the Veranda Room and walks into the lobby proceeding to the front desk where he stands."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The sequence of events commences with a cat drifting to the top of a mountain, watched by giraffes flying above it. Transitioning to a barn located in the attic area of a school between the gym and the playground, the cat holds the hammer to its paw before dropping it swiftly. It sits down, gazes around, fidgets nervously, puts on its scarf, drapes it unfolded across its leg, exits the barn, and strolls toward the cafeteria. As it is about to leave, a bunch of very young penguins trots in, blocking the hallway, humming, and tickling each other up the ramp. The cat swings the gate closed lazily for them and, as they waddle, spins to sprint outside. At that instant, a score of old turtles clad for a jazz concert crawl past it into the cafeteria. It swings the latch shut for them, nods eagerly, but they overlook it. It tracks them into the cafeteria, racing toward the salad bar with them. A kangaroo at the rear of the pack debates with the manager, who gestures up the stairs and provides instructions. Amusement and confidence flash in the cat's tail as it grins powerfully at the manager. Mr. Jenkins shakes the cat's foot for a high-five, followed by a ninety-year-old girl's, and then Miss Pepper's paw, while Mr. Pepper glares at a dance card. The cat darts into the kitchen area, slowly lands as they stand up, frowns deeply, then peeks through the ceiling and at the bookshelf corner. Observing a floating chef, the cat lowers its tail, then glances proudly at Mr. Turner. The chef floats, spins, drifts past their table, winks at Mr. Turner, and floats away, with the cat observing him depart and wagging its paw. The cat then enters the Jungle Gym and jumps out of the cafeteria, skipping to the backyard where it sits."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The scenes open with Ben sinking in a pool, observed by onlookers. In a hotel, Ben awkwardly exits a phone booth near the lobby, removes his jacket, and heads towards the entrance. A group of elderly people exits, and Ben holds the door open for them. As he enters, a group of teenagers heading to a dance rushes past, ignoring his polite gesture. Following them into the lobby, Ben approaches the desk with the group. He feels terror and disbelief as he helplessly watches the interaction. After a handshake sequence with Miss DeWitte, a boy, and Mr. Singleman, Ben backs away and scans the room. He signals a waiter, who approaches but then leaves, with Ben watching in dismay. Ben exits the Veranda Room and stands at the front desk."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Ben then exits the Veranda Room and walks into the lobby proceeding to the front desk where he stands The waiter stops turns approaches their table looks at Mrs Robinson and moves away with Ben watching him go and shaking his head Noticing a passing waiter Ben raises his hand then looks apologetically at Mrs Robinson Ben backs out of the seating area quickly rises as they sit down attempts a smile then looks out the window and at the table center Miss DeWitte takes Ben's hand for a handshake followed by a twelveyearold boy's and then Mr Singleman's hand while Mrs Singleman looks at a seating list Terror and disbelief appear in Ben's eyes as he looks helplessly at the clerk A boy at the front of the group converses with the clerk who points across the lobby and gives directions He follows them into the lobby approaching the front desk with them He holds the other door open for them smiles politely but they ignore him At that moment a dozen young people dressed for a high school dance push past him into the lobby Ben holds the door open politely for them and as they pass starts to move inside As he is about to enter a group of very old people comes out filling the doorway muttering and helping each other down the steps He stands up looks around moves uncomfortably removes his jacket carries it folded across his arm leaves the phone booth and heads toward the main lobby Transitioning to a phone booth located in the entrance area of a hotel between the lobby and the driveway Ben holds the receiver to his ear before hanging up slowly The series of scenes begins with Ben sinking to the bottom of a pool observed by people standing around it"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Transitioning to a phone booth located in the entrance area of a hotel between the lobby and the driveway Ben holds the receiver to his ear before hanging up slowly The series of scenes begins with Ben sinking to the bottom of a pool observed by people standing around it As he is about to enter a group of very old people comes out filling the doorway muttering and helping each other down the steps He stands up looks around moves uncomfortably removes his jacket carries it folded across his arm leaves the phone booth and heads toward the main lobby At that moment a dozen young people dressed for a high school dance push past him into the lobby Ben holds the door open politely for them and as they pass starts to move inside He follows them into the lobby approaching the front desk with them He holds the other door open for them smiles politely but they ignore him Terror and disbelief appear in Ben's eyes as he looks helplessly at the clerk A boy at the front of the group converses with the clerk who points across the lobby and gives directions Ben backs out of the seating area quickly rises as they sit down attempts a smile then looks out the window and at the table center Miss DeWitte takes Ben's hand for a handshake followed by a twelveyearold boy's and then Mr Singleman's hand while Mrs Singleman looks at a seating list The waiter stops turns approaches their table looks at Mrs Robinson and moves away with Ben watching him go and shaking his head Noticing a passing waiter Ben raises his hand then looks apologetically at Mrs Robinson Ben then exits the Veranda Room and walks into the lobby proceeding to the front desk where he stands"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "A boy at the front of the group converses with the clerk who points across the lobby and gives directions Terror and disbelief appear in Ben's eyes as he looks helplessly at the clerk Miss DeWitte takes Ben's hand for a handshake followed by a twelveyearold boy's and then Mr Singleman's hand while Mrs Singleman looks at a seating list Ben backs out of the seating area quickly rises as they sit down attempts a smile then looks out the window and at the table center Noticing a passing waiter Ben raises his hand then looks apologetically at Mrs Robinson The waiter stops turns approaches their table looks at Mrs Robinson and moves away with Ben watching him go and shaking his head Ben then exits the Veranda Room and walks into the lobby proceeding to the front desk where he stands The series of scenes begins with Ben sinking to the bottom of a pool observed by people standing around it Transitioning to a phone booth located in the entrance area of a hotel between the lobby and the driveway Ben holds the receiver to his ear before hanging up slowly He stands up looks around moves uncomfortably removes his jacket carries it folded across his arm leaves the phone booth and heads toward the main lobby As he is about to enter a group of very old people comes out filling the doorway muttering and helping each other down the steps Ben holds the door open politely for them and as they pass starts to move inside At that moment a dozen young people dressed for a high school dance push past him into the lobby He holds the other door open for them smiles politely but they ignore him He follows them into the lobby approaching the front desk with them"
        }
      ]
    }
  ]
}