{
  "ground_truth": "He pushes the card and a pen toward Ben, who writes his name on the card, stares at it for a moment, crumples it up, and fills out a second card. Ben reaches for the key and is handed the key. A waiter stands next to the table with a telephone as Mrs. Robinson turns in her chair to look through the glass into the lobby where Ben is in a phone booth no more than twenty feet away. Over Ben's shoulder, his face is reflected in the glass door, through which Mrs. Robinson is visible sitting in the Veranda Room. Ben hangs up, leaves the phone booth, walks back into the main lobby, and, as he passes the desk on his way to the elevator, starts to pat his breast pocket, making the desk clerk look up. He clears his throat and then kisses her. Ben opens the closet door as she turns her back, and he undoes the zipper at her neck. She turns and looks at him, leading him to back away and slam the bathroom door shut, causing the light in the room to disappear. The midsummer sun beats down on the Braddock swimming pool and on Ben, who lies on a rubber raft in the middle of the pool, wearing dark glasses, deeply tanned, and holding a beer can in one hand. Ben opens his eyes and moves his head slightly as Mr. Braddock is passionately stoking a barbecue fire and Mrs. Braddock approaches from the house carrying some ominously large thing wrapped in tinfoil. Ben rolls off the raft, swims to the end of the pool, climbs out, walks to the back door, takes his shirt from a chair, starts to put it on, opens the back door, and goes through. Ben has just shut the bathroom door behind him, wearing his shirt, buttoned, and no trousers. PAN WITH BEN as he walks across the room past Mrs. Robinson, who stands in front of the bureau taking off her bracelet and watch. He moves to a chair and sits as Mrs. Robinson kneels in front of him and starts to unbutton his shirt. Behind Ben, the door that leads from the Braddock den, where Ben is sitting, reveals Mr. and Mrs. Braddock in the dining room, having dinner and looking through the doorways toward Ben. Ben stands, crosses back to the den door, shuts it, and returns to the chair to sit. A television set facing the chair is on as Ben picks up a can of beer and drinks from it.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He thrusts the card and a pen toward Ben, who scribes his name on the card, gazes at it for a moment, crumples it up, and completes a second card. Ben stretches for the key and is given the key. A server stands next to the table with a phone as Mrs. Robinson turns in her chair to look through the glass into the lobby where Ben is in a phone booth no more than twenty feet away. Over Ben's shoulder, his visage is reflected in the glass door, through which Mrs. Robinson is visible sitting in the Veranda Room. Ben hangs up, exits the phone booth, walks back into the main lobby, and, as he passes the desk on his way to the elevator, starts to pat his breast pocket, making the desk clerk glance up. He clears his throat and then kisses her. Ben opens the closet door as she turns her back, and he undoes the zipper at her neck. She turns and gazes at him, leading him to recoil and slam the bathroom door shut, causing the light in the room to vanish. The midsummer sun beats down on the Braddock swimming pool and on Ben, who reclines on a rubber raft in the middle of the pool, wearing dark glasses, deeply tanned, and clutching a beer can in one hand. Ben opens his eyes and moves his head slightly as Mr. Braddock is fervently stoking a barbecue fire and Mrs. Braddock approaches from the house bearing some ominously large object wrapped in tinfoil. Ben rolls off the raft, swims to the end of the pool, climbs out, walks to the back door, takes his shirt from a chair, starts to don it, opens the back door, and goes through. Ben has just shut the bathroom door behind him, wearing his shirt, fastened, and no trousers. PAN WITH BEN as he walks across the room past Mrs. Robinson, who stands in front of the dresser removing her bracelet and watch. He moves to a chair and sits as Mrs. Robinson kneels in front of him and starts to unfasten his shirt. Behind Ben, the door that leads from the Braddock den, where Ben is sitting, reveals Mr. and Mrs. Braddock in the dining room, having dinner and looking through the doorways toward Ben. Ben stands, crosses back to the den door, shuts it, and returns to the chair to sit. A television set facing the chair is on as Ben picks up a can of beer and sips from it."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The card and a pen are pushed toward Ben by him, and Ben's name is written on the card by Ben. He stares at it for a moment, crumples it up, and a second card is filled out by him. The key is reached for by Ben, and the key is handed to him. Next to the table, a waiter stands with a telephone as Mrs. Robinson, who is turned in her chair, looks through the glass into the lobby where Ben is in a phone booth no more than twenty feet away. Over Ben's shoulder, his face is reflected in the glass door, through which Mrs. Robinson, sitting in the Veranda Room, is visible. The receiver is hung up by Ben, who leaves the phone booth, walks back into the main lobby, and, as the desk is passed by him on his way to the elevator, his breast pocket is patted, causing the desk clerk to look up. Her throat is cleared by him, and then she is kissed by him. The closet door is opened by Ben as she turns her back, and the zipper at her neck is undone by him. She turns and looks at him, leading him to back away and the bathroom door is slammed shut by him, causing the light in the room to disappear. The Braddock swimming pool and Ben, who lies on a rubber raft in the middle of the pool, wearing dark glasses, deeply tanned, and holding a beer can in one hand, are beaten down upon by the midsummer sun. Ben's eyes are opened, and his head is moved slightly by him as Mr. Braddock, who passionately stokes a barbecue fire, is approached by Mrs. Braddock carrying some ominously large thing wrapped in tinfoil from the house. The raft is rolled off by Ben, who swims to the end of the pool, climbs out, walks to the back door, takes his shirt from a chair, starts to put it on, opens the back door, and goes through. The bathroom door behind him is just shut by Ben, who wears his shirt, buttoned, and no trousers. BEN is panned with as he walks across the room past Mrs. Robinson, who stands in front of the bureau taking off her bracelet and watch. He moves to a chair and sits, as Mrs. Robinson, kneeling in front of him, starts to unbutton his shirt. Behind Ben, the door that leads from the Braddock den, where Ben is sitting, reveals Mr. and Mrs. Braddock having dinner in the dining room and looking through the doorways toward Ben. Ben stands, the den door is crossed back to and shut by him, and he returns to the chair to sit. A television set facing the chair is on, and a can of beer is picked up by Ben, who drinks from it."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He slides the card and pen to Ben, who signs, pauses, crumples it, and fills out another. Ben takes the key. A waiter stands by with a phone as Mrs. Robinson turns to see Ben in a booth twenty feet away. In the reflection of the glass door, Ben and Mrs. Robinson can see each other. Ben hangs up, leaves the booth, walks through the lobby, and pats his pocket, catching the desk clerk's attention. He clears his throat, kisses her, opens the closet as she turns, unzips her dress, then backs away and slams the bathroom door, dimming the light. The sun beats on the Braddock pool and Ben, who is on a raft with dark glasses and a beer. Ben opens his eyes as Mr. Braddock tends the barbecue and Mrs. Braddock brings something wrapped in foil. Ben rolls off the raft, swims, exits the pool, grabs his shirt, and goes inside. In the bathroom, he wears a buttoned shirt but no pants. Ben walks past Mrs. Robinson, who removes her jewelry, sits, and lets her unbutton his shirt. Behind him, Mr. and Mrs. Braddock are dining, watching. Ben shuts the den door, returns to his seat, and drinks from a beer can as the TV is on."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He pushes a card and pen to Ben, who signs, crumples the card, then fills out another. Ben takes the key. A waiter stands by as Mrs. Robinson watches Ben from the Veranda Room. Reflecting in the glass, Ben hangs up, exits the booth, and heads to the elevator, patting his pocket, making the clerk look up. He clears his throat, kisses her, opens the closet, unzips her neck, and slams the bathroom door, darkening the room. The midsummer sun hits the Braddock pool as tanned Ben lies on a raft, wearing sunglasses, holding a beer. He sees Mr. Braddock at the barbecue and Mrs. Braddock with foil-wrapped food. Ben swims to the pool's edge, leaves, wears a shirt, but no trousers, and shuts the bathroom door. He walks past Mrs. Robinson, sits, while she unbuttons his shirt. The den's door reveals the Braddocks dining and looking toward Ben, who shuts the door, returns, and drinks beer from a can."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He casually pushes both the card and a pen toward Ben, his actions smooth and deliberate, prompting Ben to pick up the pen and write his name neatly on the card. Ben pauses to stare at it contemplatively for a moment, then decisively crumples the card, rendering it unusable, and begins to fill out a second one. With a steady hand, Ben reaches out for the key, which is promptly handed to him by the attendant. Nearby, a waiter stands attentively next to the table, holding a telephone with an air of readiness, as Mrs. Robinson, with a graceful turn of her chair, gazes through the clear glass pane into the lobby. There, Ben is situated inside a phone booth, no more than a short twenty feet away. Over Ben's shoulder, his reflection is captured in the glass door, through which Mrs. Robinson is visible, sitting elegantly in the Veranda Room. After finishing his call, Ben hangs up the phone, steps out of the booth, and re-enters the main lobby. As he walks past the desk on his way to the elevator, he absentmindedly pats his breast pocket, an action that catches the desk clerk's attention and causes him to glance up. He clears his throat, then kisses her lightly. Ben then opens the closet door as she turns her back, and he skillfully undoes the zipper at the nape of her neck. She turns around to face him, prompting him to withdraw and quickly slam the bathroom door shut behind him, causing the light in the room to vanish. The midsummer sun blazes intensely down upon the Braddock swimming pool and upon Ben, who is leisurely lying on a rubber raft floating in the center of the pool. Adorned with dark sunglasses and a deep tan, he holds a beer can comfortably in one hand. Ben opens his eyes slightly and tilts his head as Mr. Braddock fervently stokes the barbecue fire, while Mrs. Braddock approaches from the house, carrying an ominously large item wrapped in shimmering tinfoil. Ben rolls off the raft smoothly, swims to the edge of the pool, climbs out with ease, then strolls to the back door, takes his shirt from a nearby chair, starts to put it on, opens the back door, and goes inside. Ben has just closed the bathroom door behind him, wearing his shirt, which is fully buttoned, yet conspicuously missing trousers. As he strides confidently, the camera PANS WITH BEN as he moves across the room, past Mrs. Robinson, who stands elegantly in front of the bureau, carefully removing her bracelet and watch. He approaches a chair and sits down as Mrs. Robinson gracefully kneels before him and begins the delicate task of unbuttoning his shirt. Behind Ben, the open door leading from the Braddock den, where Ben is seated, reveals Mr. and Mrs. Braddock in the dining room, eating dinner and gazing through the doorways toward where Ben sits. Ben rises to his feet, crosses back to the den door, closes it securely, and then returns to his previous seat. A television set, facing his chair, is turned on, casting a gentle glow, as Ben picks up a can of beer and takes a sip."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He casually and smoothly pushes both the card and a pen toward Ben, his actions deliberate and measured, encouraging Ben to pick up the pen and neatly inscribe his name on the card. Taking a moment's pause, Ben stares contemplatively at the card before making a decisive choice to crumple it, rendering it unusable, and begins anew by filling out a second one. With steady determination, Ben reaches out for the key, which the attendant promptly hands to him. Nearby, a waiter stands attentively by the table, holding a telephone with an air of readiness, as Mrs. Robinson, with a graceful swivel of her chair, gazes thoughtfully through the clear glass pane into the lobby. There, Ben is situated within the confines of a phone booth, no more than a short twenty feet away. Over Ben's shoulder, his reflection is captured in the glass door, through which Mrs. Robinson is viewable, sitting elegantly in the Veranda Room. After completing his call, Ben hangs up the phone, steps out of the booth, and re-enters the spacious main lobby. As he casually walks past the desk on his way to the elevator, he absentmindedly pats his breast pocket, an action that catches the keen attention of the desk clerk, causing him to glance upward. He clears his throat, then kisses her lightly and tenderly. Ben then opens the closet door as she gracefully turns her back, and he skillfully undoes the zipper located at the nape of her neck. She turns around to face him, prompting him to withdraw quickly and slam the bathroom door shut behind him with speed, causing the light in the room to vanish instantaneously. The midsummer sun blazes intensely and brightly down upon the Braddock swimming pool, where Ben is leisurely lying on a rubber raft that floats gently in the center of the pool. Adorned with dark sunglasses and a deep, golden tan, he holds a beer can comfortably in one hand. Ben opens his eyes slightly, tilting his head as Mr. Braddock fervently stokes the barbecue fire with great care, while Mrs. Braddock approaches from the house, carrying an ominously large item wrapped in shimmering tinfoil. Ben rolls off the raft smoothly, swims with ease to the edge of the pool, climbs out effortlessly, then strolls to the back door, takes his shirt from a nearby chair, starts to put it on, opens the back door, and proceeds to go inside. Ben has just closed the bathroom door behind him, having put on his shirt, which is fully buttoned but conspicuously missing trousers. As he strides confidently forward, the camera pans gracefully with Ben as he moves across the room, past Mrs. Robinson, who stands elegantly in front of the bureau, carefully removing her bracelet and watch with delicate precision. He approaches a chair nearby and sits down as Mrs. Robinson gracefully kneels before him and begins the careful, deliberate task of unbuttoning his shirt. Behind Ben, the open door leading from the Braddock den, where he is seated, reveals Mr. and Mrs. Braddock in the dining room, eating dinner and gazing curiously through the doorways toward where Ben sits. Ben then rises to his feet, crosses the room to the den door, closes it securely and quietly, and then returns confidently to his previous seat. A television set, facing his chair, is turned on, casting a gentle glow in the dim light, as Ben picks up a can of beer and takes a sip with relaxed ease."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He pushes the card and a pen deliberately across the table toward Ben, ensuring they are within easy reach. Ben reaches out to grasp the card and pen, positioning the card flat before him. He carefully writes his name on the card, concentrating as he forms each letter. For a moment, he pauses, staring thoughtfully at his handiwork, as if contemplating its significance. Suddenly, he decides to crumple the card in his hand, feeling the paper compress under his fingers, and dismisses it entirely before grabbing a second card. He fills out the new card with swift, determined strokes, correcting the previous effort. With a decisive motion, Ben extends his hand toward the key, and once his palm is open, the key is placed into it by another hand. Meanwhile, a waiter stands attentively next to the table, holding a telephone, poised for action. At the same time, Mrs. Robinson shifts in her chair, turning her body slightly to peer through the glass window into the lobby. Her gaze locks onto Ben, who is enclosed within a phone booth no more than twenty feet away, visible under the lobby's muted lighting. Over Ben's shoulder, his face subtly appears as a reflection in the glass door, creating a dual image that includes Mrs. Robinson, seen clearly sitting in the Veranda Room. Concluding his phone conversation with a resolute click, Ben hangs up the phone and steps out of the booth. With measured strides, he crosses back into the main lobby, moving deliberately towards the elevator. As he nears the desk, he instinctively pats his breast pocket, prompting the desk clerk to glance up in acknowledgment. Upon reaching his destination, he clears his throat, signaling a shift in intentions, and leans forward to place a gentle, unexpected kiss. Subsequently, Ben approaches the closet, feeling the cool surface of the door as he opens it. Meanwhile, Mrs. Robinson, with her back turned, presents the zipper at her neck. Ben's fingers deftly work to undo it, the sound of the zipper filling the room briefly. She turns her head, catching his eye, prompting him to retreat quickly and slam the bathroom door shut, plunging the room into darkness. Outside, the midsummer sun blazes fiercely, casting golden rays upon the Braddock swimming pool. Ben lies on a rubber raft at the pool's center, comfortably stretched out, his skin deeply tanned. He wears dark sunglasses, a can of beer loosely clutched in one hand. His closed eyes open slowly, reacting to the bright sunlight as Mr. Braddock tends enthusiastically to a barbecue fire. Observing the scene, Mrs. Braddock approaches from the house, holding something wrapped in tinfoil that hints at its imposing size and mystery. Ben senses a change and rolls off the raft into the cool water, swimming with steady strokes to the pool's edge. Upon reaching it, he clambers out nimbly, water dripping from his tanned skin, and makes his way across the yard to the back door. Finding his shirt draped over a chair, he lifts it, starts to put it on, and then opens the back door to enter the house. Now wearing his shirt, buttoned but without trousers, Ben has shut the bathroom door securely behind him. His movements are tracked as he walks across the room where Mrs. Robinson stands before the bureau, methodically removing her bracelet and watch. He moves toward a chair, lowering himself into it as Mrs. Robinson kneels gracefully in front of him and begins to unbutton his shirt. Behind him, the door leading from the Braddock den stands ajar, framing Mr. and Mrs. Braddock dining quietly, their gazes fixated through the doorways toward Ben. Realizing the intrusion, Ben rises, crosses back to the den door, and closes it firmly before returning to his chair to sit again. The television set, positioned directly facing him, flickers with a muted glow. Ben casually picks up a can of beer and drinks from it, the cool liquid a comforting, familiar presence."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He pushes the card and a pen toward Ben, who writes his name, crumples up the card, and fills out a second one before receiving the key. A waiter stands by with a telephone as Mrs. Robinson glimpses Ben in a nearby phone booth. Ben's reflection is visible over his shoulder, aligning with Mrs. Robinson sitting in the Veranda Room. After the call, Ben returns to the lobby, pats his breast pocket near the desk, and clears his throat before kissing her. He opens a closet door, starts undoing her zipper, and then retreats to slam the bathroom door, plunging the room into darkness. Meanwhile, the midsummer sun shines on Ben, who lies tanned on a raft in the pool with a beer in hand. As Mr. Braddock tends to the barbecue and Mrs. Braddock approaches with a large foil-wrapped item, Ben rolls off the raft, swims, exits the pool, dons his shirt, and enters the house. Inside, he walks past Mrs. Robinson, who is removing her jewelry, sits in a chair, and allows her to unbutton his shirt as Mr. and Mrs. Braddock observe from the dining room through open doorways. Ben stands to close the den door before returning to his seat, drinking from a beer while the television is on."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He pushes the card and a pen toward Ben, who writes his name on the card, likely as part of a check-in process at a hotel, stares at it for a moment, crumples it up, and fills out a second card. Ben reaches for the key that grants access to his hotel room and is handed the key. A waiter, dressed in a crisp uniform symbolizing the hotel's high standards, stands next to the table with a vintage rotary telephone as Mrs. Robinson turns in her chair to look through the glass into the lobby where Ben, who was visiting for the weekend, is in a phone booth no more than twenty feet away. Over Ben's shoulder, his face is reflected in the glass door, through which Mrs. Robinson is visible sitting in the Veranda Room, a part of the hotel known for its elegant afternoon teas. Ben hangs up, leaves the phone booth, walks back into the bustling main lobby, and, as he passes the desk on his way to the elevator, starts to pat his breast pocket, making the desk clerk, known for his attentiveness, look up. He clears his throat and then kisses her, a gesture that surprises the few onlookers in the lobby. Ben opens the closet door of his hotel room as she turns her back, and he undoes the zipper at her neck, a moment charged with tension and silence. She turns and looks at him, leading him to back away and slam the bathroom door shut, causing the light in the room to disappear, leaving only the glow of city lights from outside. The midsummer sun in California beats down on the Braddock swimming pool and on Ben, who lies on a rubber raft in the middle of the pool, wearing dark glasses, deeply tanned, and holding a beer can in one hand, embodying a leisure typical of suburban life in the 1960s. Ben opens his eyes and moves his head slightly as Mr. Braddock is passionately stoking a barbecue fire, a weekend ritual he takes pride in, and Mrs. Braddock approaches from the house carrying some ominously large thing wrapped in tinfoil, perhaps a surprise dish for the afternoon gathering. Ben rolls off the raft, swims to the end of the pool with the ease of someone who has spent many summers here, climbs out, walks to the back door, takes his shirt from a chair, starts to put it on, opens the back door, and goes through. Ben has just shut the bathroom door behind him, wearing his shirt, buttoned, and no trousers, reminiscent of a disheveled appearance of someone in a hurry. PAN WITH BEN as he walks across the room past Mrs. Robinson, who stands in front of the antique bureau taking off her bracelet and watch, which glint with the last rays of setting sun. He moves to a chair and sits as Mrs. Robinson kneels in front of him and starts to unbutton his shirt, a scene both intimate and complex. Behind Ben, the door that leads from the Braddock den, a family room filled with memories, where Ben is sitting, reveals Mr. and Mrs. Braddock in the dining room, having dinner and looking through the doorways toward Ben, their curiosity piqued by the scene unfolding. Ben stands, crosses back to the den door, shuts it with a click that resonates in the quiet house, and returns to the chair to sit. A television set facing the chair is on, tuned to a popular variety show of the era, as Ben picks up a can of beer and drinks from it, seeking a moment of distraction."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "He pushes the card and a pen toward Ben who writes his name on the card stares at it for a moment crumples it up and fills out a second card. Ben reaches for the key and is handed the key. A waiter stands next to the table with a telephone as Mrs Robinson turns in her chair to look through the glass into the lobby where Ben is in a phone booth no more than twenty feet away. Over Ben's shoulder his face is reflected in the glass door through which Mrs Robinson is visible sitting in the Veranda Room. Ben hangs up leaves the phone booth walks back into the main lobby and as he passes the desk on his way to the elevator starts to pat his breast pocket making the desk clerk look up. He clears his throat and then kisses her. Ben opens the closet door as she turns her back and he undoes the zipper at her neck. She turns and looks at him leading him to back away and slam the bathroom door shut causing the light in the room to disappear. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. The midsummer sun beats down on the Braddock swimming pool and on Ben who lies on a rubber raft in the middle of the pool wearing dark glasses deeply tanned and holding a beer can in one hand. Ben opens his eyes and moves his head slightly as Mr Braddock is passionately stoking a barbecue fire and Mrs Braddock approaches from the house carrying some ominously large thing wrapped in tinfoil. Ben rolls off the raft swims to the end of the pool climbs out walks to the back door takes his shirt from a chair starts to put it on opens the back door and goes through. Ben has just shut the bathroom door behind him wearing his shirt buttoned and no trousers. PAN WITH BEN as he walks across the room past Mrs Robinson who stands in front of the bureau taking off her bracelet and watch. He moves to a chair and sits as Mrs Robinson kneels in front of him and starts to unbutton his shirt. Behind Ben the door that leads from the Braddock den where Ben is sitting reveals Mr and Mrs Braddock in the dining room having dinner and looking through the doorways toward Ben. Ben stands crosses back to the den door shuts it and returns to the chair to sit. A television set facing the chair is on as Ben picks up a can of beer and drinks from it."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "He pushes the card and a pen toward Ben who writes his name on the card stares at it for a moment crumples it up and fills out a second card. Ben reaches for the key and is handed the key. A waiter stands next to the table with a telephone as Mrs Robinson turns in her chair to look through the glass into the lobby where Ben is in a phone booth no more than twenty feet away. Over Ben's shoulder his face is reflected in the glass door through which Mrs Robinson is visible sitting in the Veranda Room. Ben hangs up leaves the phone booth walks back into the main lobby and as he passes the desk on his way to the elevator starts to pat his breast pocket making the desk clerk look up. He clears his throat and then kisses her. Ben opens the closet door as she turns her back and he undoes the zipper at her neck. She turns and looks at him leading him to back away and slam the bathroom door shut causing the light in the room to disappear. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. The midsummer sun beats down on the Braddock swimming pool and on Ben who lies on a rubber raft in the middle of the pool wearing dark glasses deeply tanned and holding a beer can in one hand. Ben opens his eyes and moves his head slightly as Mr Braddock is passionately stoking a barbecue fire and Mrs Braddock approaches from the house carrying some ominously large thing wrapped in tinfoil. Ben rolls off the raft swims to the end of the pool climbs out walks to the back door takes his shirt from a chair starts to put it on opens the back door and goes through. Ben has just shut the bathroom door behind him wearing his shirt buttoned and no trousers. PAN WITH BEN as he walks across the room past Mrs Robinson who stands in front of the bureau taking off her bracelet and watch. He moves to a chair and sits as Mrs Robinson kneels in front of him and starts to unbutton his shirt. Behind Ben the door that leads from the Braddock den where Ben is sitting reveals Mr and Mrs Braddock in the dining room having dinner and looking through the doorways toward Ben. Ben stands crosses back to the den door shuts it and returns to the chair to sit. A television set facing the chair is on as Ben picks up a can of beer and drinks from it."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "He pushes the card and a pen toward Ben who writes his name on the card stares at it for a moment crumples it up and fills out a second card. Ben reaches for the key and is handed the key. A waiter stands next to the table with a telephone as Mrs Robinson turns in her chair to look through the glass into the lobby where Ben is in a phone booth no more than twenty feet away. Over Ben's shoulder his face is reflected in the glass door through which Mrs Robinson is visible sitting in the Veranda Room. PAN WITH BEN as he walks across the room past Mrs Robinson who stands in front of the bureau taking off her bracelet and watch. He moves to a chair and sits as Mrs Robinson kneels in front of him and starts to unbutton his shirt. Behind Ben the door that leads from the Braddock den where Ben is sitting reveals Mr and Mrs Braddock in the dining room having dinner and looking through the doorways toward Ben. Ben stands crosses back to the den door shuts it and returns to the chair to sit. A television set facing the chair is on as Ben picks up a can of beer and drinks from it."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "He pushes the card and a pen toward Ben who writes his name on the card stares at it for a moment crumples it up and fills out a second card. Ben reaches for the key and is handed the key. Ben stands crosses back to the den door shuts it and returns to the chair to sit. A television set facing the chair is on as Ben picks up a can of beer and drinks from it."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The owl nudges the suitcase and a candle toward Sam, who sketches his initials on the suitcase, glances at it for a while, shreds it, and decorates a second suitcase. Sam reaches for the spoon and is handed the spoon. A gardener hovers beside the couch with a trumpet as Ms. Harris swivels in her seat to peer through the curtain into the atrium where Sam is in an igloo barely more than twenty inches away. Over Sam's arm, his silhouette is mirrored in the glass window, through which Ms. Harris is discernible lounging in the Sunroom. Sam hangs up, exits the igloo, saunters back into the main atrium, and, as he passes the counter on his way to the escalator, begins to tap his hip pocket, prompting the counter manager to glance up. He clears his throat and then tickles her. Sam unlatches the bookshelf door as she adjusts her hat, and he loosens the shoelace at her ankle. She turns and gazes at him, prompting him to retreat and slam the wardrobe door shut, causing the lamp in the corner to extinguish. The wintry moon glows down on the Thompson ice rink and on Sam, who floats on a wooden plank in the center of the rink, wearing a ski mask, lightly dusted with snow, and clutching a juice box in one hand. Sam opens his eyes and tilts his head slightly as Mr. Thompson is fervently icing a cake and Mrs. Thompson approaches from the shed carrying some humorously small something cloaked in velvet. Sam rolls off the plank, skates to the edge of the rink, climbs out, strides to the front gate, grabs his coat from a hook, begins to don it, opens the front gate, and strolls through. Sam has just secured the wardrobe door behind him, donning his coat, buttoned, and no boots. SLIDE WITH SAM as he glides across the lounge past Ms. Harris, who stands before the closet removing her necklace and earrings. He drifts to a stool and perches as Ms. Harris crouches before him and begins to fasten his scarf. Behind Sam, the entry that opens from the Thompson den, where Sam is perching, exposes Mr. and Mrs. Thompson in the study, dining and gazing through the passages at Sam. Sam stands, ambles back to the den entry, seals it, and ambles back to the stool to perch. A radio positioned toward the stool is playing as Sam picks up a carton of milk and sips from it."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Ben signs a card and obtains a key before entering a phone booth in view of Mrs. Robinson, who watches him from the Veranda Room. After a brief call, he returns to the lobby and heads to the elevator. Later, Ben finds himself in a room with Mrs. Robinson, where he nervously backs away after beginning to undress her, accidentally slamming the bathroom door and plunging the room into darkness. On a summer day, Ben lounges on a raft in the Braddock swimming pool, watching Mr. Braddock at the barbecue and Mrs. Braddock with a large foil-wrapped item. Ben disembarks the raft, heads inside, and puts on a shirt without trousers. Later, in a room with Mrs. Robinson, she starts to unbutton his shirt. Meanwhile, Mr. and Mrs. Braddock glance at them through a door from their dining room. Ben closes the door for privacy, sits back down, and drinks beer while watching TV."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "A television set facing the chair is on as Ben picks up a can of beer and drinks from it Ben stands crosses back to the den door shuts it and returns to the chair to sit Behind Ben the door that leads from the Braddock den where Ben is sitting reveals Mr and Mrs Braddock in the dining room having dinner and looking through the doorways toward Ben He moves to a chair and sits as Mrs Robinson kneels in front of him and starts to unbutton his shirt PAN WITH BEN as he walks across the room past Mrs Robinson who stands in front of the bureau taking off her bracelet and watch Ben has just shut the bathroom door behind him wearing his shirt buttoned and no trousers Ben rolls off the raft swims to the end of the pool climbs out walks to the back door takes his shirt from a chair starts to put it on opens the back door and goes through Ben opens his eyes and moves his head slightly as Mr Braddock is passionately stoking a barbecue fire and Mrs Braddock approaches from the house carrying some ominously large thing wrapped in tinfoil The midsummer sun beats down on the Braddock swimming pool and on Ben who lies on a rubber raft in the middle of the pool wearing dark glasses deeply tanned and holding a beer can in one hand She turns and looks at him leading him to back away and slam the bathroom door shut causing the light in the room to disappear Ben opens the closet door as she turns her back and he undoes the zipper at her neck He clears his throat and then kisses her Ben hangs up leaves the phone booth walks back into the main lobby and as he passes the desk on his way to the elevator starts to pat his breast pocket making the desk clerk look up Over Ben's shoulder his face is reflected in the glass door through which Mrs Robinson is visible sitting in the Veranda Room A waiter stands next to the table with a telephone as Mrs Robinson turns in her chair to look through the glass into the lobby where Ben is in a phone booth no more than twenty feet away Ben reaches for the key and is handed the key He pushes the card and a pen toward Ben who writes his name on the card stares at it for a moment crumples it up and fills out a second card"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Ben reaches for the key and is handed the key He pushes the card and a pen toward Ben who writes his name on the card stares at it for a moment crumples it up and fills out a second card Over Ben's shoulder his face is reflected in the glass door through which Mrs Robinson is visible sitting in the Veranda Room A waiter stands next to the table with a telephone as Mrs Robinson turns in her chair to look through the glass into the lobby where Ben is in a phone booth no more than twenty feet away He clears his throat and then kisses her Ben hangs up leaves the phone booth walks back into the main lobby and as he passes the desk on his way to the elevator starts to pat his breast pocket making the desk clerk look up She turns and looks at him leading him to back away and slam the bathroom door shut causing the light in the room to disappear Ben opens the closet door as she turns her back and he undoes the zipper at her neck Ben opens his eyes and moves his head slightly as Mr Braddock is passionately stoking a barbecue fire and Mrs Braddock approaches from the house carrying some ominously large thing wrapped in tinfoil The midsummer sun beats down on the Braddock swimming pool and on Ben who lies on a rubber raft in the middle of the pool wearing dark glasses deeply tanned and holding a beer can in one hand Ben has just shut the bathroom door behind him wearing his shirt buttoned and no trousers Ben rolls off the raft swims to the end of the pool climbs out walks to the back door takes his shirt from a chair starts to put it on opens the back door and goes through He moves to a chair and sits as Mrs Robinson kneels in front of him and starts to unbutton his shirt PAN WITH BEN as he walks across the room past Mrs Robinson who stands in front of the bureau taking off her bracelet and watch Ben stands crosses back to the den door shuts it and returns to the chair to sit Behind Ben the door that leads from the Braddock den where Ben is sitting reveals Mr and Mrs Braddock in the dining room having dinner and looking through the doorways toward Ben A television set facing the chair is on as Ben picks up a can of beer and drinks from it"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Ben opens his eyes and moves his head slightly as Mr Braddock is passionately stoking a barbecue fire and Mrs Braddock approaches from the house carrying some ominously large thing wrapped in tinfoil Ben rolls off the raft swims to the end of the pool climbs out walks to the back door takes his shirt from a chair starts to put it on opens the back door and goes through Ben has just shut the bathroom door behind him wearing his shirt buttoned and no trousers PAN WITH BEN as he walks across the room past Mrs Robinson who stands in front of the bureau taking off her bracelet and watch He moves to a chair and sits as Mrs Robinson kneels in front of him and starts to unbutton his shirt Behind Ben the door that leads from the Braddock den where Ben is sitting reveals Mr and Mrs Braddock in the dining room having dinner and looking through the doorways toward Ben Ben stands crosses back to the den door shuts it and returns to the chair to sit A television set facing the chair is on as Ben picks up a can of beer and drinks from it He pushes the card and a pen toward Ben who writes his name on the card stares at it for a moment crumples it up and fills out a second card Ben reaches for the key and is handed the key A waiter stands next to the table with a telephone as Mrs Robinson turns in her chair to look through the glass into the lobby where Ben is in a phone booth no more than twenty feet away Over Ben's shoulder his face is reflected in the glass door through which Mrs Robinson is visible sitting in the Veranda Room Ben hangs up leaves the phone booth walks back into the main lobby and as he passes the desk on his way to the elevator starts to pat his breast pocket making the desk clerk look up He clears his throat and then kisses her Ben opens the closet door as she turns her back and he undoes the zipper at her neck She turns and looks at him leading him to back away and slam the bathroom door shut causing the light in the room to disappear The midsummer sun beats down on the Braddock swimming pool and on Ben who lies on a rubber raft in the middle of the pool wearing dark glasses deeply tanned and holding a beer can in one hand"
        }
      ]
    }
  ]
}