{
  "ground_truth": "Eddie leaves the car parked at the gas station and heads for the bar. Armstead's is a typical small-town pool hall with a bar, a short order counter, a skee-ball machine, and pool tables for small, friendly games. The few people in Armstead's this day are not playing; they sit and read the papers. Charlie and Eddie are at the bar, drinking straight bourbon. Charlie rises from his barstool, and Eddie is already at the table. Charlie joins Eddie as the game is in mid-progress, and it's Eddie's shot. He downs his bourbon, weaves a bit, bends over the table, and awkwardly pokes at the white cue ball with his stick, missing an easy shot. Several more townspeople have come in from the street and are following the play. The bartender refills the glasses as soon as they are emptied. Two balls lay side by side on the table. Eddie peers at them, trying to figure his shot, blinking his eyes to focus better. Some of the onlookers seem skeptical, but Eddie pats the corner pocket confidently, leans over, and raps out his shot. The ball banks in, and he pounds his pal Charlie on the shoulder and collapses into a nearby chair. Stung, Eddie lies across the table and sets them up himself. They toss their money on the table, and Eddie shoots, but his shot is too hard and his ball leaps over the side of the table. The bartender cannot contain his staccato laughter. Eddie pauses, smiling. Sheepishly, the bartender replaces the balls in their original positions. Eddie chalks up his cue, waiting impatiently for the bartender to return with the money from the cash register. Then he downs his drink and quickly strokes out his shot, the ball banking crisply and directly into the corner pocket. There is a cocky leer on his face as he reaches for the dollar bills. The door of the Packard coupe slams shut. Eddie Felson holds up his stuffed billfold for his pal, Charlie Burns, to see. He tosses it on the seat beside him and turns on the ignition. Henry nods, then steps up on a stool to fix the minute hand of the clock. It now stands at ten o'clock. It is twelve-thirty when Eddie Felson and Charlie Burns first enter into Ames. Only one table is in use; the hall is empty. In Eddie's hand is his leather cue case. They stand before the swinging doors and look around. They saunter over to the cashier's cage. A sign on the brass bar reads NO GAMBLING ALLOWED. Eddie's arrival is noted by Big John and Preacher, a gambler and an addict, who hang out at Ames at all hours, waiting for action.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Eddie departs the automobile stationed at the petrol depot and advances toward the tavern. Armstead's is a quintessential diminutive-town billiard saloon with a tavern, a brief order counter, a skee-ball apparatus, and billiard tables for minor, congenial matches. The few patrons in Armstead's this day are not participating; they rest and peruse the periodicals. Charlie and Eddie are at the tavern, consuming unadulterated bourbon. Charlie ascends from his barstool, and Eddie is already at the table. Charlie joins Eddie as the match is in mid-progress, and it's Eddie's attempt. He finishes his bourbon, sways a tad, leans over the table, and clumsily jabs at the white cue sphere with his cue, missing a simple attempt. Several more townsfolk have entered from the avenue and are observing the play. The barkeep replenishes the glasses as soon as they are vacated. Two spheres lie side by side on the table. Eddie gazes at them, attempting to deduce his attempt, blinking his eyes to concentrate better. Some of the spectators appear dubious, but Eddie pats the corner pocket assuredly, leans over, and snaps out his attempt. The sphere banks in, and he pounds his friend Charlie on the shoulder and collapses into a nearby chair. Frustrated, Eddie drapes across the table and arranges them up himself. They toss their currency on the table, and Eddie attempts, but his attempt is too forceful and his sphere vaults over the edge of the table. The barkeep cannot restrain his rapid laughter. Eddie hesitates, grinning. Bashfully, the barkeep restores the spheres in their original locations. Eddie chalks up his cue, waiting restlessly for the barkeep to return with the currency from the cash register. Then he finishes his beverage and swiftly strokes out his attempt, the sphere banking crisply and directly into the corner pocket. There is a cocky smirk on his face as he grasps for the dollar bills. The portal of the Packard coupe slams shut. Eddie Felson holds up his stuffed wallet for his friend, Charlie Burns, to observe. He tosses it on the seat beside him and activates the ignition. Henry nods, then steps up on a stool to adjust the minute hand of the clock. It now stands at ten o'clock. It is twelve-thirty when Eddie Felson and Charlie Burns first enter into Ames. Only one table is in use; the hall is vacant. In Eddie's hand is his leather cue case. They stand before the swinging doors and survey the surroundings. They stroll over to the cashier's enclosure. A sign on the brass rail reads NO GAMBLING ALLOWED. Eddie's arrival is observed by Big John and Preacher, a gambler and an addict, who linger at Ames at all hours, anticipating action."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The car is left parked at the gas station by Eddie, and the bar is headed for by him. Armstead's is described as a typical small-town pool hall with a bar, a short order counter, a skee-ball machine, and pool tables for small, friendly games. No games are played by the few people in Armstead's this day; they sit and read the papers. The bar is occupied by Charlie and Eddie, who drink straight bourbon. The barstool is vacated by Charlie, and Eddie has already been at the table. Charlie is joined by Eddie as the game progresses, and it is Eddie's shot. His bourbon is downed by him, a bit of weaving occurs, he bends over the table, and the white cue ball is awkwardly poked at by him with his stick, an easy shot being missed. Several more townspeople come in from the street and follow the play. The glasses are refilled by the bartender as soon as they are emptied. Two balls lie side by side on the table. Eddie peers at them, trying to figure his shot, blinking his eyes to focus better. Skepticism is shown by some of the onlookers, but the corner pocket is confidently patted by Eddie, he leans over, and his shot is rapped out. The ball is banked in, and Charlie is pounded on the shoulder by him, then he collapses into a nearby chair. Stung, the table is laid across by Eddie, who sets them up himself. Their money is tossed on the table, and Eddie shoots, but the side of the table is leapt over by his ball due to his shot being too hard. Staccato laughter cannot be contained by the bartender. A pause is made by Eddie, smiling. Sheepishly, the balls are replaced in their original positions by the bartender. His cue is chalked up by Eddie, who waits impatiently for the money to be returned by the bartender from the cash register. Then his drink is downed by him, and his shot is quickly stroked out, the ball banking crisply and directly into the corner pocket. A cocky leer is on his face as the dollar bills are reached for by him. The door of the Packard coupe is slammed shut. The stuffed billfold is held up by Eddie Felson for his pal, Charlie Burns, to see. It is tossed on the seat beside him, and the ignition is turned on by him. A nod is given by Henry, then he steps up on a stool to fix the minute hand of the clock. It now stands at ten o'clock. It is Eddie Felson and Charlie Burns who first enter into Ames at twelve-thirty. Only one table is used; the hall is empty. In Eddie's hand is his leather cue case. They stand before the swinging doors and look around. The cashier's cage is sauntered over to by them. NO GAMBLING ALLOWED reads a sign on the brass bar. Eddie's arrival is noted by Big John and Preacher, a gambler and an addict, who hang out at Ames at all hours, waiting for action."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Eddie leaves his car at the gas station and heads to Armstead's, a small-town pool hall with a bar, a short-order counter, a skee-ball machine, and pool tables. Inside, a few patrons are reading papers. Charlie and Eddie are at the bar drinking bourbon. Charlie joins Eddie mid-game, where Eddie, slightly unsteady, misses an easy shot. More townspeople arrive to watch. The bartender refills their drinks as Eddie studies his shot with determination. He confidently banks the ball into the pocket, celebrating with Charlie, but collapses in a chair. Eddie sets up again and, after a wild shot sends the ball off the table, the bartender laughs. Eddie waits for his winnings, downs his drink, and makes a precise bank shot with a smug grin. He shows his full wallet to Charlie, tosses it on the car seat, and starts the ignition. They drive to Ames, arriving at twelve-thirty. Only one table is in use. Eddie, holding his leather cue case, and Charlie note a NO GAMBLING sign. Big John and Preacher, regulars, notice Eddie's entrance."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Eddie parks at the gas station and heads to Armstead's, a small-town pool hall with a bar, skee-ball, and pool tables. Inside, few play; most read. Charlie and Eddie drink bourbon at the bar. Charlie joins Eddie mid-game; Eddie awkwardly misses a shot, attracting a small crowd. The bartender refills drinks quickly. Two balls lie on the table; Eddie, focusing hard, confidently hits one into a pocket and celebrates with Charlie. After a failed shot, the bartender laughs. Eddie resets the game. He impatiently waits for the bartender to bring money, then succeeds with a crisp shot, smirking. Leaving, Eddie flaunts his full wallet to Charlie. They drive to Ames, entering with Eddie's cue case. Inside, a NO GAMBLING ALLOWED sign is present, but Big John and Preacher, regulars at Ames, notice Eddie's arrival."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Eddie, who's feeling quite determined, leaves the car parked resolutely at the gas station and heads directly for the bar with a purposeful stride. Armstead's is a quintessential small-town pool hall, complete with a welcoming bar, a short order counter offering quick bites, a skee-ball machine for some light-hearted fun, and several pool tables designed for small, friendly games enjoyed by the patrons. On this particular day, the few people present in Armstead's are not engaged in any games; instead, they sit quietly and immerse themselves in reading the newspapers, seemingly content. At the bar, Charlie and Eddie are seated, enjoying straight bourbon together. As Charlie rises slowly from his barstool, Eddie is already at the pool table, ready to play. Charlie, noticing the game is in mid-progress, joins Eddie just as it's Eddie's turn to make a shot. He finishes his bourbon in one swift motion, sways slightly, bends over the pool table, and awkwardly attempts to hit the white cue ball with his stick, unfortunately missing an easy shot.\n\nMeanwhile, more townspeople have come in from the street, casually gathering to watch the evolving play. The bartender, diligent in his duties, refills the empty glasses as quickly as they are drained. Two pool balls lay side by side on the table, and Eddie peers at them, thoughtfully trying to plan his next shot. He blinks his eyes, attempting to focus more sharply. Some of the onlookers, watching intently, appear skeptical, but Eddie, exuding confidence, pats the corner pocket as if to signal his next intention. He leans over the table with determination and decisively executes his shot. The ball banks in successfully, prompting Eddie to pound his pal Charlie on the shoulder in triumphant celebration before collapsing contentedly into a nearby chair.\n\nFeeling a bit stung, Eddie lies across the pool table and sets the balls up himself for the next round. They toss their money onto the table casually, and Eddie takes his shot; however, his overzealous execution causes the ball to leap over the table's side. The bartender, unable to contain himself, bursts into staccato laughter. Eddie pauses, smiles ruefully, and the bartender, still chuckling, replaces the balls in their original positions. Eddie, now more focused, chalks up his cue, waiting impatiently for the bartender to return with their winnings from the cash register. He then downs his drink in one go and skillfully strokes out his shot, the ball banking crisply and heading directly into the corner pocket. A cocky leer spreads across his face as he reaches for the freshly won dollar bills.\n\nThe sound of the Packard coupe's door slamming shut resonates. Eddie Felson holds up his stuffed billfold for his pal, Charlie Burns, to see, with a clear sense of pride. He casually tosses it onto the seat beside him and turns on the ignition, ready to drive. Henry acknowledges this and then steps up on a stool to adjust the minute hand of the clock, ensuring it accurately reads ten o'clock. It is twelve-thirty when Eddie Felson and Charlie Burns make their first entrance into Ames. Only one pool table is currently in use, and the hall is otherwise empty. Eddie carries his leather cue case confidently in his hand, and they stand before the swinging doors, taking a moment to look around. They saunter over to the cashier's cage, where a sign firmly declares NO GAMBLING ALLOWED, catching their attention. Eddie's arrival does not go unnoticed by Big John and Preacher, well-known figures at Ames, an ever-present gambler and an addict, who spend their time waiting for some action to unfold at all hours."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Eddie, harboring a strong sense of determination and resolve, finds himself leaving his car parked with confidence at the local gas station. With this task completed, he strides purposefully and directly toward Armstead's, a place that truly embodies the essence of a small-town pool hall. Armstead's offers a warm and inviting atmosphere, complete with a friendly bar, a short order counter serving quick, appetizing bites, a skee-ball machine for those desiring some light-hearted amusement, and several pool tables carefully arranged for small, enjoyable games that patrons often indulge in. On this particular day, however, the scant few individuals present in Armstead's choose not to engage in any gaming activities; instead, they sit quietly and are deeply engrossed in their newspapers, appearing quite content with this leisurely activity.\n\nAt the bar counter, both Charlie and Eddie find themselves seated comfortably, enjoying straight bourbon together. As the moment arises for Charlie to slowly lift himself from his barstool, Eddie has already moved to the pool table, ready and eager to play. Observing that the game is already in motion, Charlie joins Eddie at the table just as Eddie is about to take his next shot. Charlie, in one swift motion, finishes his bourbon, sways gently for a moment, bends over the pool table, and awkwardly attempts to strike the white cue ball with his stick. Sadly, he misses what should have been an easy shot.\n\nSimultaneously, more residents from the town gradually make their way inside from the street, gathering with a casual demeanor to observe the developing play. The bartender, always attentive and diligent in his duties, promptly refills any empty glasses as swiftly as they are emptied. On the table, two pool balls lie side by side, and Eddie, peering intently at them, thoughtfully calculates how best to approach his next shot. Blinking his eyes in an effort to sharpen his focus, some of the onlookers watch with a keen interest, while others seem somewhat skeptical. Eddie, nevertheless exuding a confident air, pats the corner pocket with a sense of purpose, as if signaling his next move. Leaning over the table with determination, he executes his shot with decisiveness. The ball banks successfully into the pocket, leading Eddie to triumphantly pound Charlie on the shoulder in celebration before he collapses contentedly into a nearby chair.\n\nDespite feeling a bit of a sting from the earlier events, Eddie lies across the pool table and takes it upon himself to set up the balls for the next round. They casually toss their money onto the table, eager to continue the game. Eddie takes his next shot; however, his overenthusiastic execution causes the ball to unexpectedly leap over the table's edge. Witnessing this amusing mishap, the bartender bursts into a series of staccato laughter. Eddie pauses for a brief moment, then smiles ruefully. Meanwhile, the bartender, still chuckling, diligently replaces the balls in their initial positions. With renewed focus, Eddie chalks up his cue, waiting with some impatience for the bartender to return with their winnings from the cash register. He subsequently consumes his drink in one go and skillfully executes another shot, with the ball crisply banking and heading straight into the corner pocket. A cocky leer gradually spreads across his face as he reaches for the freshly won dollar bills.\n\nThe distinct sound of the Packard coupe's door slamming shut reverberates through the air. Eddie Felson, brimming with a sense of pride, holds up his rather stuffed billfold for his friend, Charlie Burns, to see. Casually, he tosses it onto the seat next to him and turns on the car's ignition, preparing to drive away. Henry takes note of this and then steps up onto a stool to carefully adjust the minute hand of the clock, ensuring it accurately reads ten o'clock. By twelve-thirty, Eddie Felson and Charlie Burns make their initial entrance into Ames. Currently, only one pool table is in use, leaving the remainder of the hall otherwise empty. Eddie enters with confidence, holding his leather cue case firmly in hand, and they pause for a moment before the swinging doors, taking in their surroundings. They saunter over to the cashier's cage, where a sign firmly declares NO GAMBLING ALLOWED, a notice that clearly captures their attention. Eddie's arrival doesn't escape the notice of Big John and Preacher, two well-known figures at Ames, with the former being an ever-present gambler and the latter an addict, both perpetually waiting for any action to unfold at all hours of the day."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Eddie eases his car into a parking spot at the gas station and exits, leaving it behind as he strides purposefully toward the familiar destination of Armstead's bar. This small-town pool hall welcomes him with its unassuming charm, complete with a bar, a short order counter serving quick bites, a skee-ball machine for those seeking lighthearted diversion, and pool tables inviting players for small, friendly games. Inside, only a handful of people are present, choosing to sit and engross themselves in their newspapers rather than engage in the action. At the bar, Eddie finds his friend Charlie, and they both indulge in glasses of straight bourbon. Charlie gradually rises from his barstool, taking a moment to steady himself before heading over to where Eddie is already stationed at the pool table. As the game is underway with Eddie in the spotlight, he confidently finishes his bourbon, though it causes him to weave slightly. He bends over the table, trying to steady himself, and awkwardly attempts to strike the white cue ball with his stick but misses what ought to have been a straightforward shot. Meanwhile, more townspeople trickle in from the street, gathering to observe the unfolding match with keen interest. The bartender, ever attentive, is swift in refilling their glasses each time they are emptied. Staring intently at the pool table, Eddie scrutinizes two balls lying in close proximity, blinking to sharpen his focus. Despite some skeptics among the onlookers, Eddie taps the corner pocket with assurance, leans over, and executes his shot. The ball obediently banks into the pocket, prompting Eddie to jubilantly pat Charlie on the shoulder before collapsing into a nearby chair. Undeterred by the setback, Eddie props himself up and prepares the table for the next play, placing the balls back into their starting positions as they toss money onto the table to up the stakes. With determination, Eddie takes another shot, but his eagerness results in too much force, propelling the ball off the table. The bartender erupts into boisterous laughter that echoes around the pool hall. Eddie pauses, grins broadly, and, with an air of good-natured resignation, observes as the bartender dutifully returns the balls to their original positions. While waiting for the bartender to fetch the money from the cash register, Eddie attentively chalks his cue, impatiently anticipating his next move. He swiftly downs another drink, steadies himself, and with precision, sends the ball banking neatly and decisively into the corner pocket. A smug leer spreads across his face as he collects the dollar bills in victory. In the aftermath, the door of the Packard coupe slams shut with a definitive thud. Eddie Felson holds up his now bulging billfold for his pal Charlie Burns to admire before tossing it casually onto the seat beside him and turning the ignition on. Meanwhile, Henry, a diligent employee, steps onto a nearby stool to adjust the minute hand of the clock, reflecting the passage of time to ten o'clock. It is twelve-thirty when Eddie Felson and Charlie Burns make their entrance into Ames. The hall is notably empty, with only one table occupied. Eddie grips his leather cue case in hand as they pause before the swinging doors, casting a calculating glance around the room. They stroll over to the cashier's cage, where a prominently displayed sign on the brass bar reads \"NO GAMBLING ALLOWED.\" Their arrival does not go unnoticed by Big John and Preacher, two regulars who spend countless hours at Ames, perpetually on the lookout for the next opportunity for action."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Eddie leaves his car at the gas station and heads to Armstead's, a typical small-town pool hall with a bar and several games. Inside, he and Charlie drink straight bourbon as Eddie begins a game at the pool table. Charlie joins in mid-game, and as Eddie takes his shot, more townspeople gather to watch. Despite the drinks, Eddie confidently banks a shot, celebrating with Charlie before setting up another game. As they continue, Eddie's shot goes astray, drawing laughter from the bartender, who resets the balls. Undeterred, Eddie makes a successful shot, collecting his winnings with a smug expression. Later, the two friends head to Ames, arriving at twelve-thirty with Eddie's cue case in hand. They survey the scene, noting the hall's quiet atmosphere and a sign prohibiting gambling. Big John and Preacher, regulars at Ames, take note of Eddie's arrival, anticipating the potential for action."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Eddie leaves the car parked at the gas station, a common spot for travelers to pause along rural routes for refueling and quick snacks, and heads for the bar. Armstead's is a typical small-town pool hall with a bar, a short order counter that serves classic American diner fare, a skee-ball machine reminiscent of those found at seaside arcades, and pool tables for small, friendly games. The few people in Armstead's this day are not playing; they sit and read the papers, perhaps catching up on local news or sports scores. Charlie and Eddie are at the bar, drinking straight bourbon, a whiskey known for its strong, distinctive flavor. Charlie rises from his barstool, and Eddie is already at the table. Charlie joins Eddie as the game is in mid-progress, and it's Eddie's shot. He downs his bourbon, weaves a bit, bends over the table, and awkwardly pokes at the white cue ball with his stick, the cue he brought from home, missing an easy shot. Several more townspeople have come in from the street, drawn by the prospect of witnessing a tense game, and are following the play. The bartender, a local fixture known for his quick refills, refills the glasses as soon as they are emptied. Two balls lay side by side on the table. Eddie peers at them, trying to figure his shot, blinking his eyes to focus better under the dim, smoky light. Some of the onlookers seem skeptical, but Eddie pats the corner pocket confidently, leans over, and raps out his shot. The ball banks in, and he pounds his pal Charlie on the shoulder and collapses into a nearby chair. Stung, Eddie lies across the table and sets them up himself. They toss their money on the table, engaging in the time-honored tradition of small-stakes gambling, and Eddie shoots, but his shot is too hard and his ball leaps over the side of the table. The bartender cannot contain his staccato laughter, a sound familiar to regular patrons. Eddie pauses, smiling. Sheepishly, the bartender replaces the balls in their original positions. Eddie chalks up his cue, waiting impatiently for the bartender to return with the money from the cash register, which he plans to add to his night's winnings. Then he downs his drink and quickly strokes out his shot, the ball banking crisply and directly into the corner pocket. There is a cocky leer on his face as he reaches for the dollar bills. The door of the Packard coupe, an iconic American automobile of the era, slams shut. Eddie Felson holds up his stuffed billfold for his pal, Charlie Burns, to see as evidence of their lucrative evening. He tosses it on the seat beside him and turns on the ignition. Henry, an old acquaintance who occasionally fixes things around the hall, nods, then steps up on a stool to fix the minute hand of the clock, a task he often performs since the clock sticks frequently. It now stands at ten o'clock. It is twelve-thirty when Eddie Felson and Charlie Burns first enter into Ames, a nearby town known for its vibrant pool halls. Only one table is in use; the hall is empty. In Eddie's hand is his leather cue case, worn from years of use. They stand before the swinging doors and look around, assessing the room for potential competitors. They saunter over to the cashier's cage. A sign on the brass bar reads NO GAMBLING ALLOWED, a rule often more honored in the breach than the observance. Eddie's arrival is noted by Big John and Preacher, a gambler and an addict whose days and nights revolve around the pool hall, who hang out at Ames at all hours, waiting for action."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Eddie leaves the car parked at the gas station and heads for the bar. Armstead's is a typical smalltown pool hall with a bar a short order counter a skeeball machine and pool tables for small friendly games. The few people in Armstead's this day are not playing. they sit and read the papers. Charlie and Eddie are at the bar drinking straight bourbon. Charlie rises from his barstool and Eddie is already at the table. Charlie joins Eddie as the game is in midprogress and it is Eddie's shot. He downs his bourbon weaves a bit bends over the table and awkwardly pokes at the white cue ball with his stick missing an easy shot. Several more townspeople have come in from the street and are following the play. The bartender refills the glasses as soon as they are emptied. Two balls lay side by side on the table. Eddie peers at them trying to figure his shot blinking his eyes to focus better. Some of the onlookers seem skeptical but Eddie pats the corner pocket confidently leans over and raps out his shot. The ball banks in and he pounds his pal Charlie on the shoulder and collapses into a nearby chair. Stung. Eddie lies across the table and sets them up himself. They toss their money on the table and Eddie shoots but his shot is too hard and his ball leaps over the side of the table. The bartender cannot contain his staccato laughter. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Eddie pauses smiling. Sheepishly the bartender replaces the balls in their original positions. Eddie chalks up his cue waiting impatiently for the bartender to return with the money from the cash register. Then he downs his drink and quickly strokes out his shot the ball banking crisply and directly into the corner pocket. There is a cocky leer on his face as he reaches for the dollar bills. The door of the Packard coupe slams shut. Eddie Felson holds up his stuffed billfold for his pal Charlie Burns to see. He tosses it on the seat beside him and turns on the ignition. Henry nods then steps up on a stool to fix the minute hand of the clock. It now stands at ten of the clock. It is twelvethirty when Eddie Felson and Charlie Burns first enter into Ames. Only one table is in use. the hall is empty. In Eddie's hand is his leather cue case. They stand before the swinging doors and look around. They saunter over to the cashier's cage. A sign on the brass bar reads. NO GAMBLING ALLOWED. Eddie's arrival is noted by Big John and Preacher a gambler and an addict who hang out at Ames at all hours waiting for action."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Eddie leaves the car parked at the gas station and heads for the bar. Armstead's is a typical smalltown pool hall with a bar a short order counter a skeeball machine and pool tables for small friendly games. The few people in Armstead's this day are not playing. they sit and read the papers. Charlie and Eddie are at the bar drinking straight bourbon. Charlie rises from his barstool and Eddie is already at the table. Charlie joins Eddie as the game is in midprogress and it is Eddie's shot. He downs his bourbon weaves a bit bends over the table and awkwardly pokes at the white cue ball with his stick missing an easy shot. Several more townspeople have come in from the street and are following the play. The bartender refills the glasses as soon as they are emptied. Two balls lay side by side on the table. Eddie peers at them trying to figure his shot blinking his eyes to focus better. Some of the onlookers seem skeptical but Eddie pats the corner pocket confidently leans over and raps out his shot. The ball banks in and he pounds his pal Charlie on the shoulder and collapses into a nearby chair. Stung. Eddie lies across the table and sets them up himself. They toss their money on the table and Eddie shoots but his shot is too hard and his ball leaps over the side of the table. The bartender cannot contain his staccato laughter. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Eddie pauses smiling. Sheepishly the bartender replaces the balls in their original positions. Eddie chalks up his cue waiting impatiently for the bartender to return with the money from the cash register. Then he downs his drink and quickly strokes out his shot the ball banking crisply and directly into the corner pocket. There is a cocky leer on his face as he reaches for the dollar bills. The door of the Packard coupe slams shut. Eddie Felson holds up his stuffed billfold for his pal Charlie Burns to see. He tosses it on the seat beside him and turns on the ignition. Henry nods then steps up on a stool to fix the minute hand of the clock. It now stands at ten of the clock. It is twelvethirty when Eddie Felson and Charlie Burns first enter into Ames. Only one table is in use. the hall is empty. In Eddie's hand is his leather cue case. They stand before the swinging doors and look around. They saunter over to the cashier's cage. A sign on the brass bar reads. NO GAMBLING ALLOWED. Eddie's arrival is noted by Big John and Preacher a gambler and an addict who hang out at Ames at all hours waiting for action."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Eddie leaves the car parked at the gas station and heads for the bar. Armstead's is a typical smalltown pool hall with a bar a short order counter a skeeball machine and pool tables for small friendly games. The few people in Armstead's this day are not playing. they sit and read the papers. Charlie and Eddie are at the bar drinking straight bourbon. Charlie rises from his barstool and Eddie is already at the table. Charlie joins Eddie as the game is in midprogress and it is Eddie's shot. He downs his bourbon weaves a bit bends over the table and awkwardly pokes at the white cue ball with his stick missing an easy shot. Several more townspeople have come in from the street and are following the play. It now stands at ten of the clock. It is twelvethirty when Eddie Felson and Charlie Burns first enter into Ames. Only one table is in use. the hall is empty. In Eddie's hand is his leather cue case. They stand before the swinging doors and look around. They saunter over to the cashier's cage. A sign on the brass bar reads. NO GAMBLING ALLOWED. Eddie's arrival is noted by Big John and Preacher a gambler and an addict who hang out at Ames at all hours waiting for action."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Eddie leaves the car parked at the gas station and heads for the bar. Armstead's is a typical smalltown pool hall with a bar a short order counter a skeeball machine and pool tables for small friendly games. The few people in Armstead's this day are not playing. they sit and read the papers. They saunter over to the cashier's cage. A sign on the brass bar reads. NO GAMBLING ALLOWED. Eddie's arrival is noted by Big John and Preacher a gambler and an addict who hang out at Ames at all hours waiting for action."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Clara abandons the bicycle parked by the bakery and marches toward the library. Thompson's is an ordinary urban gallery with a library, a small art display, a pinball machine, and gallery seats for modest, welcoming viewings. The few visitors in Thompson's this evening are not observing; they stand and skim through the magazines. Larry and Clara are at the library, sipping cold lemonade. Larry hops off his chair, and Clara is already at the mural. Larry accompanies Clara as the mural is half-finished, and it's Clara's task. She gulps her lemonade, stumbles slightly, leans against the mural, and clumsily dabs at the canvas with her brush, missing an obvious stroke. Several more villagers have wandered in from the alley and are eyeing the creation. The librarian refills the cups as soon as they are drained. Two brushes lie side by side on the tray. Clara squints at them, trying to plan her stroke, squinting her eyes to focus better. Some of the watchers look doubtful, but Clara taps the frame confidently, crouches down, and traces her stroke. The brush sweeps over, and she jabs her buddy Larry on the elbow and collapses into a nearby couch. Flustered, Clara stretches across the mural and arranges them herself. They toss their paintbrushes on the tray, and Clara strokes, but her stroke is too forceful and her brush tumbles over the edge of the tray. The librarian cannot hold back her chortling snort. Clara pauses, grinning. Bashfully, the librarian returns the brushes to their starting points. Clara dips her brush, waiting impatiently for the librarian to return with the sketchbook from the shelves. Then she gulps her drink and swiftly swipes out her stroke, the brush sweeping smoothly and directly across the frame. There is a playful smirk on her face as she reaches for the colored pencils. The door of the Volkswagen sedan clicks shut. Clara Appleton holds up her overflowing sketchbook for her buddy, Larry Brown, to admire. She tosses it on the dash beside her and flips on the headlights. Marco nods, then climbs up on a ladder to set the hour hand of the watch. It now indicates six o'clock. It is nine-thirty when Clara Appleton and Larry Brown first stroll into Hudson's. Only one canvas is visible; the gallery is vacant. In Clara's grip is her velvet paint case. They pause before the swinging gates and look around. They amble over to the artist's booth. A sign on the wooden frame reads NO PAINTING PERMITTED. Clara's presence is observed by Tall Mike and Preacher, a painter and a critic, who linger at Hudson's at all hours, searching for inspiration."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Eddie parks at the gas station and heads to Armstead's, a small-town bar with pool tables. He and his friend Charlie drink bourbon while Eddie awkwardly plays pool. Despite missing an easy shot, Eddie confidently attempts another, successfully banking the ball in, and celebrates with Charlie. After some stumbling, he wins money from pool bets, revealing a cocky grin. Eddie flaunts his winnings to Charlie and leaves the bar. Later, they arrive at Ames, a pool hall where signs warn against gambling. Noticed by Big John and Preacher, regulars at Ames seeking action, Eddie's leather cue case suggests he's ready for serious play."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Eddie's arrival is noted by Big John and Preacher a gambler and an addict who hang out at Ames at all hours waiting for action NO GAMBLING ALLOWED A sign on the brass bar reads They saunter over to the cashier's cage They stand before the swinging doors and look around In Eddie's hand is his leather cue case the hall is empty Only one table is in use It is twelvethirty when Eddie Felson and Charlie Burns first enter into Ames It now stands at ten of the clock Henry nods then steps up on a stool to fix the minute hand of the clock He tosses it on the seat beside him and turns on the ignition Eddie Felson holds up his stuffed billfold for his pal Charlie Burns to see The door of the Packard coupe slams shut There is a cocky leer on his face as he reaches for the dollar bills Then he downs his drink and quickly strokes out his shot the ball banking crisply and directly into the corner pocket Eddie chalks up his cue waiting impatiently for the bartender to return with the money from the cash register Sheepishly the bartender replaces the balls in their original positions Eddie pauses smiling The bartender cannot contain his staccato laughter They toss their money on the table and Eddie shoots but his shot is too hard and his ball leaps over the side of the table Eddie lies across the table and sets them up himself Stung The ball banks in and he pounds his pal Charlie on the shoulder and collapses into a nearby chair Some of the onlookers seem skeptical but Eddie pats the corner pocket confidently leans over and raps out his shot Eddie peers at them trying to figure his shot blinking his eyes to focus better Two balls lay side by side on the table The bartender refills the glasses as soon as they are emptied Several more townspeople have come in from the street and are following the play He downs his bourbon weaves a bit bends over the table and awkwardly pokes at the white cue ball with his stick missing an easy shot Charlie joins Eddie as the game is in midprogress and it is Eddie's shot Charlie rises from his barstool and Eddie is already at the table Charlie and Eddie are at the bar drinking straight bourbon they sit and read the papers The few people in Armstead's this day are not playing Armstead's is a typical smalltown pool hall with a bar a short order counter a skeeball machine and pool tables for small friendly games Eddie leaves the car parked at the gas station and heads for the bar"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Armstead's is a typical smalltown pool hall with a bar a short order counter a skeeball machine and pool tables for small friendly games Eddie leaves the car parked at the gas station and heads for the bar they sit and read the papers The few people in Armstead's this day are not playing Charlie rises from his barstool and Eddie is already at the table Charlie and Eddie are at the bar drinking straight bourbon He downs his bourbon weaves a bit bends over the table and awkwardly pokes at the white cue ball with his stick missing an easy shot Charlie joins Eddie as the game is in midprogress and it is Eddie's shot The bartender refills the glasses as soon as they are emptied Several more townspeople have come in from the street and are following the play Eddie peers at them trying to figure his shot blinking his eyes to focus better Two balls lay side by side on the table The ball banks in and he pounds his pal Charlie on the shoulder and collapses into a nearby chair Some of the onlookers seem skeptical but Eddie pats the corner pocket confidently leans over and raps out his shot Eddie lies across the table and sets them up himself Stung The bartender cannot contain his staccato laughter They toss their money on the table and Eddie shoots but his shot is too hard and his ball leaps over the side of the table Sheepishly the bartender replaces the balls in their original positions Eddie pauses smiling Then he downs his drink and quickly strokes out his shot the ball banking crisply and directly into the corner pocket Eddie chalks up his cue waiting impatiently for the bartender to return with the money from the cash register The door of the Packard coupe slams shut There is a cocky leer on his face as he reaches for the dollar bills He tosses it on the seat beside him and turns on the ignition Eddie Felson holds up his stuffed billfold for his pal Charlie Burns to see It now stands at ten of the clock Henry nods then steps up on a stool to fix the minute hand of the clock Only one table is in use It is twelvethirty when Eddie Felson and Charlie Burns first enter into Ames In Eddie's hand is his leather cue case the hall is empty They saunter over to the cashier's cage They stand before the swinging doors and look around NO GAMBLING ALLOWED A sign on the brass bar reads Eddie's arrival is noted by Big John and Preacher a gambler and an addict who hang out at Ames at all hours waiting for action"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Sheepishly the bartender replaces the balls in their original positions Eddie chalks up his cue waiting impatiently for the bartender to return with the money from the cash register Then he downs his drink and quickly strokes out his shot the ball banking crisply and directly into the corner pocket There is a cocky leer on his face as he reaches for the dollar bills The door of the Packard coupe slams shut Eddie Felson holds up his stuffed billfold for his pal Charlie Burns to see He tosses it on the seat beside him and turns on the ignition Henry nods then steps up on a stool to fix the minute hand of the clock It now stands at ten of the clock It is twelvethirty when Eddie Felson and Charlie Burns first enter into Ames Only one table is in use the hall is empty In Eddie's hand is his leather cue case They stand before the swinging doors and look around They saunter over to the cashier's cage A sign on the brass bar reads NO GAMBLING ALLOWED Eddie's arrival is noted by Big John and Preacher a gambler and an addict who hang out at Ames at all hours waiting for action Eddie leaves the car parked at the gas station and heads for the bar Armstead's is a typical smalltown pool hall with a bar a short order counter a skeeball machine and pool tables for small friendly games The few people in Armstead's this day are not playing they sit and read the papers Charlie and Eddie are at the bar drinking straight bourbon Charlie rises from his barstool and Eddie is already at the table Charlie joins Eddie as the game is in midprogress and it is Eddie's shot He downs his bourbon weaves a bit bends over the table and awkwardly pokes at the white cue ball with his stick missing an easy shot Several more townspeople have come in from the street and are following the play The bartender refills the glasses as soon as they are emptied Two balls lay side by side on the table Eddie peers at them trying to figure his shot blinking his eyes to focus better Some of the onlookers seem skeptical but Eddie pats the corner pocket confidently leans over and raps out his shot The ball banks in and he pounds his pal Charlie on the shoulder and collapses into a nearby chair Stung Eddie lies across the table and sets them up himself They toss their money on the table and Eddie shoots but his shot is too hard and his ball leaps over the side of the table The bartender cannot contain his staccato laughter Eddie pauses smiling"
        }
      ]
    }
  ]
}