{
  "ground_truth": "His cheek is pressed against the glass, with the foggy silhouettes of the others behind him. Eddie's mouth is open as he screams horribly. He screams again, and they let go of his arms, causing him to slump to the floor. The bartender turns and goes back to the bar in the front room as the ship's horn is heard again. There is a knock at the door. Sarah sits alone in the darkened room, dressed in her robe and slip, lost in a drunken half-sleep. She goes to the door and opens it, her eyes puffy and her face covered with perspiration. She looks up to see him leaning against the wall, his arms tucked into his chest, with one hand covering the other. Sarah is stunned and moves to him, taking him in her arms. He starts to cry, and she holds him. Sarah watches as Eddie, both hands encased in plaster casts, tries to sleep and moves his arms as if trying to defend himself. Sarah rises, joins him, and strokes his head. They are seated at the breakfast table, where Sarah pours him some coffee. He tries to bring the cup to his lips but cannot manage it, and in disgust, he drops the cup on the floor and gets up from the table. Sarah bends down and patiently wipes up the spilled coffee. The apartment is now clean and neat, and Sarah is sober. She is at her table typing, while Eddie stands at the window, trying to reach over his shoulder to scratch his back. He comes over to the table and picks a cigarette out of the pack with his mouth, looking quickly at her without asking directly for the match. She lights it, and as she does, he glances at the sheet in the typewriter. He starts to unbutton his shirt, but when Sarah immediately gets up to help, he holds her off. She watches him struggle with the button for a while, then spreads his arms in a gesture of helplessness. As she unbuttons his shirt for him, he takes her face in his hands and kisses her. Sarah and Eddie emerge from the doorway. It is a warm, beautiful day, and Sarah has a basket with her. Eddie seems happy to be out with her, almost as if he has forgotten the casts on his hands. They stop at a spot that overlooks the river and spread out a blanket. Eddie leans back on the grass and looks at Sarah, and they both seem easy and relaxed in the sunshine together. Eddie lowers his eyes and leans back, then just stares at her before he is about to knock on the door to Sarah's apartment.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "His visage is pressed against the pane, with the misty outlines of the others behind him. Eddie's mouth is ajar as he shrieks dreadfully. He shrieks again, and they release his limbs, causing him to slump to the ground. The barkeep turns and goes back to the counter in the front chamber as the vessel's horn is audible again. There is a rapping at the entrance. Sarah sits solitary in the dimmed room, attired in her gown and slip, lost in a drunken half-slumber. She goes to the entrance and opens it, her eyes swollen and her face coated with perspiration. She gazes up to see him leaning against the partition, his arms tucked into his chest, with one hand covering the other. Sarah is astonished and moves to him, taking him in her embrace. He starts to weep, and she holds him. Sarah observes as Eddie, both hands encased in plaster casts, attempts to sleep and moves his limbs as if trying to defend himself. Sarah rises, joins him, and caresses his head. They are seated at the breakfast table, where Sarah pours him some java. He tries to bring the mug to his lips but cannot manage it, and in frustration, he drops the mug on the floor and gets up from the table. Sarah bends down and patiently wipes up the spilled java. The flat is now clean and tidy, and Sarah is sober. She is at her table typing, while Eddie stands at the casement, trying to reach over his shoulder to scratch his back. He comes over to the table and picks a cigarette out of the pack with his mouth, looking quickly at her without asking directly for the match. She ignites it, and as she does, he glances at the sheet in the typewriter. He starts to unbutton his shirt, but when Sarah immediately rises to assist, he holds her off. She watches him struggle with the button for a while, then spreads his arms in a gesture of helplessness. As she unbuttons his shirt for him, he takes her face in his hands and kisses her. Sarah and Eddie emerge from the entryway. It is a warm, gorgeous day, and Sarah has a basket with her. Eddie seems content to be out with her, almost as if he has forgotten the casts on his hands. They stop at a spot that overlooks the river and spread out a blanket. Eddie reclines back on the grass and gazes at Sarah, and they both seem easy and relaxed in the sunshine together. Eddie lowers his eyes and reclines back, then just stares at her before he is about to knock on the door to Sarah's flat."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "His cheek is pressed against the glass, with the foggy silhouettes of the others behind him. Eddie's mouth is open as a horrible scream is let out by him. A scream is let out by him again, and his arms are let go of, causing him to slump to the floor. The bartender turns and goes back to the bar in the front room as the ship's horn sounds again. There is a knock at the door. Sarah sits alone in the darkened room, dressed in her robe and slip, lost in a drunken half-sleep. The door is opened by her, her eyes puffy and her face covered with perspiration. She looks up to see him leaning against the wall, his arms tucked into his chest, with one hand covering the other. Sarah is stunned and moves to him, taking him in her arms. He starts to cry, and she holds him. Sarah watches as Eddie, with both hands encased in plaster casts, tries to sleep and moves his arms as if trying to defend himself. Rising, Sarah joins him and strokes his head. They are seated at the breakfast table, where he is poured some coffee by Sarah. He tries to bring the cup to his lips but cannot manage it, and in disgust, the cup is dropped on the floor by him and he gets up from the table. The spilled coffee is wiped up patiently by Sarah. The apartment is now clean and neat, and Sarah is sober. At her table, she types, while Eddie stands at the window, trying to reach over his shoulder to scratch his back. He comes over to the table and picks a cigarette out of the pack with his mouth, looking quickly at her without directly asking for the match. It is lit by her, and as she does, the sheet in the typewriter is glanced at by him. He starts to unbutton his shirt, but when Sarah immediately gets up to help, she is held off by him. She watches him struggle with the button for a while, then his arms are spread in a gesture of helplessness by him. As his shirt is unbuttoned by her, her face is taken in his hands and he kisses her. Sarah and Eddie emerge from the doorway. It is a warm, beautiful day, and Sarah has a basket with her. Out with her, Eddie seems happy, almost as if the casts on his hands have been forgotten by him. They stop at a spot that overlooks the river and a blanket is spread out by them. Leaning back on the grass, Eddie looks at Sarah, and they both seem easy and relaxed in the sunshine together. Lowering his eyes, Eddie leans back, then just stares at her before he is about to knock on the door to the apartment of Sarah."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "His cheek is pressed against the glass, with foggy silhouettes behind him. Eddie screams horribly, and when they release his arms, he slumps to the floor. The bartender returns to the bar as the ship's horn sounds. There's a knock at the door. Sarah, in a drunken half-sleep, opens it, her eyes puffy and face sweaty. She sees him leaning against the wall, arms tucked in, and moves to embrace him as he cries. Sarah watches Eddie, with plaster-cast hands, trying to sleep and defend himself. She joins him, stroking his head. At breakfast, Sarah pours coffee, but Eddie can't drink it and drops the cup in frustration. Sarah patiently cleans up. The apartment is now tidy, and Sarah is sober, typing at her table. Eddie stands at the window, trying to scratch his back, then picks a cigarette from the pack. She lights it, and he glances at her typing. He struggles with his shirt buttons, and when Sarah offers help, he initially resists but then lets her unbutton it. He takes her face in his hands and kisses her. They emerge from the doorway on a warm day, Sarah with a basket. Eddie seems happy, almost forgetting his casts. They stop by the river, spread a blanket, and relax in the sunshine. Eddie leans back, gazing at Sarah, then lowers his eyes before knocking on her apartment door."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "His cheek is pressed against the glass, with foggy silhouettes behind him. Eddie screams horribly, and when they release his arms, he slumps to the floor. The bartender returns to the bar as the ship's horn sounds. There's a knock at the door. Sarah, in a drunken half-sleep, opens it, her face sweaty and eyes puffy. She sees him leaning against the wall, arms tucked, and moves to embrace him as he cries. Sarah watches Eddie, hands in plaster casts, trying to sleep and defend himself. She joins him, stroking his head. At breakfast, Sarah pours coffee, but Eddie can't drink it and drops the cup in frustration. Sarah cleans up patiently. The apartment is now tidy, and Sarah is sober, typing at her table. Eddie, at the window, struggles to scratch his back, then picks a cigarette with his mouth. Sarah lights it, and he glances at her work. He starts unbuttoning his shirt, but when Sarah offers help, he declines. Eventually, she assists, and he kisses her. They emerge on a warm day, Sarah with a basket. Eddie seems happy, almost forgetting his casts. They spread a blanket by the river, relax in the sunshine, and Eddie stares at Sarah before knocking on her apartment door."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "His cheek is firmly pressed against the cold, unyielding glass, with the foggy, indistinct silhouettes of the others looming behind him like ghostly figures. Eddie's mouth is wide open as he lets out a horrible, piercing scream. He screams once more, and they finally release their grip on his arms, causing him to slump helplessly to the floor. The bartender, seemingly unfazed, turns away and returns to his duties at the bar in the front room, just as the ship's horn blares again, echoing through the space. There is a sudden knock at the door. Sarah sits alone in the dimly lit room, dressed in her robe and slip, lost in a state of drunken half-sleep. She rises to answer the door, her eyes puffy and her face glistening with perspiration. She looks up to see him leaning heavily against the wall, his arms tucked protectively into his chest, with one hand covering the other. Sarah is taken aback and moves toward him, enveloping him in her arms. He begins to cry, and she holds him close. Sarah watches intently as Eddie, with both hands encased in cumbersome plaster casts, tries to find sleep and moves his arms as if attempting to defend himself from unseen threats. Sarah rises from her seat, joins him, and gently strokes his head. They are now seated at the breakfast table, where Sarah carefully pours him some coffee. He attempts to bring the cup to his lips but finds himself unable to manage it, and in frustration, he drops the cup onto the floor and abruptly gets up from the table. Sarah bends down with patience and wipes up the spilled coffee. The apartment is now clean and orderly, and Sarah is sober. She is seated at her table, typing diligently, while Eddie stands by the window, awkwardly trying to reach over his shoulder to scratch an itch on his back. He approaches the table and deftly picks a cigarette out of the pack with his mouth, casting a quick glance at her without directly asking for a match. She lights it for him, and as she does, he glances at the sheet in the typewriter. He begins to unbutton his shirt, but when Sarah immediately rises to assist him, he gently holds her off. She watches him struggle with the button for a while, then he spreads his arms in a gesture of helplessness. As she unbuttons his shirt for him, he tenderly takes her face in his hands and kisses her. Sarah and Eddie emerge from the doorway into the world outside. It is a warm, beautiful day, and Sarah carries a basket with her. Eddie seems genuinely happy to be out with her, almost as if he has momentarily forgotten the restrictive casts on his hands. They stop at a picturesque spot that overlooks the river and spread out a blanket. Eddie leans back on the soft grass and gazes at Sarah, and they both appear easy and relaxed in the sunshine together. Eddie lowers his eyes and leans back, then just stares at her before he is about to knock on the door to Sarah's apartment."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "His cheek is firmly pressed against the cold, unyielding surface of the glass, with the foggy, indistinct silhouettes of the others looming ominously behind him like ghostly figures emerging from the shadows. Eddie's mouth is wide open as he lets out a horrible, piercing scream that resonates through the space. He screams once more, his voice carrying a sense of desperation, and they finally release their grip on his arms, causing him to slump helplessly to the hard floor. The bartender, seemingly unfazed by the unfolding drama, nonchalantly turns away and returns to his duties at the bar situated in the front room, just as the ship's horn blares once again, echoing through the entire room. There is a sudden, unexpected knock at the door. Sarah sits alone in the dimly lit room, dressed casually in her robe and slip, lost in a state of drunken half-sleep. She slowly rises to answer the door, her eyes puffy and her face glistening with a light sheen of perspiration. She looks up to see him, leaning heavily against the wall for support, his arms tucked protectively into his chest, with one hand carefully covering the other. Sarah is taken aback and moves toward him, enveloping him affectionately in her comforting arms. He begins to cry softly, and she holds him close, providing silent reassurance. Sarah watches intently as Eddie, with both hands encased in cumbersome plaster casts, tries to find sleep and moves his arms as if attempting to defend himself from unseen threats or shadows lurking in his mind. Sarah rises from her seat, joins him where he lies, and gently strokes his head with care. They are now seated together at the breakfast table, where Sarah carefully pours him a steaming cup of coffee. He attempts to bring the cup to his lips but finds himself unable to manage it, and in a fit of frustration, he drops the cup onto the floor and abruptly gets up from the table. Sarah bends down with patience and wipes up the spilled coffee, unfazed by the incident. The apartment is now clean and orderly, and Sarah is sober, her demeanor calm and collected. She is seated at her table, typing diligently, while Eddie stands by the window, awkwardly trying to reach over his shoulder to scratch an itch on his back, hindered by his casts. He approaches the table with determination and deftly picks a cigarette out of the pack using his mouth, casting a quick, hopeful glance at her without directly asking for a match. She lights it for him, and as she does so, he briefly glances at the sheet in the typewriter, considering its contents. He begins to unbutton his shirt, but when Sarah immediately rises to assist him, he gently holds her off with a soft gesture. She watches him struggle with the button for a while, then he spreads his arms in a gesture of helplessness, silently asking for assistance. As she unbuttons his shirt for him, he tenderly takes her face in his hands and kisses her gently. Sarah and Eddie emerge from the doorway, stepping into the world outside. It is a warm, beautiful day, full of promise, and Sarah carries a basket with her, ready for an outing. Eddie seems genuinely happy to be out with her, almost as if he has momentarily forgotten the restrictive casts on his hands. They stop at a picturesque spot that overlooks the sparkling river and spread out a blanket. Eddie leans back on the soft grass and gazes at Sarah, and they both appear easy and relaxed, basking in the sunshine together. Eddie lowers his eyes and leans back, then just stares at her with affection before he is about to knock on the door to Sarah's apartment once again."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "His cheek is pressed firmly against the cold glass, and through the foggy pane, the indistinct silhouettes of others loom behind him. Eddie's mouth is wide open as he emits a piercing, horrible scream that echoes through the space. He screams once more, his voice filled with desperation, prompting those holding him to release their grip on his arms, causing him to slump helplessly to the floor. The bartender, having witnessed the scene, turns away and makes his way back to the bar in the front room, just as the ship's horn blares again, resonating through the air. A knock sounds at the door, breaking the silence. Sarah sits alone in the dimly lit room, enveloped in her robe and slip, teetering on the edge of a drunken half-sleep. She rouses herself, moving slowly to the door, and opens it, revealing her puffy eyes and a face glistening with perspiration. As she looks up, she sees him leaning against the wall, his arms drawn tightly to his chest, with one hand protectively covering the other. Stunned by his presence, Sarah moves toward him, wrapping him in her arms. He begins to cry, and she holds him close, offering comfort. Sarah watches intently as Eddie, with both hands encased in cumbersome plaster casts, struggles to find rest, his arms twitching as if he is trying to defend himself even in sleep. Sarah rises from her seat, joins him, and gently strokes his head, offering solace. They find themselves seated at the breakfast table, where Sarah carefully pours him a cup of coffee. Eddie attempts to bring the cup to his lips, but the casts hinder his efforts, and in frustration, he lets the cup slip from his grasp, allowing it to crash to the floor. Disgusted, he rises abruptly from the table, while Sarah bends down with patience, meticulously wiping up the spilled coffee. The apartment, once chaotic, is now clean and orderly, and Sarah is sober, focused at her table, typing diligently. Meanwhile, Eddie stands by the window, awkwardly trying to reach over his shoulder to scratch an itch on his back. He approaches the table, deftly picking a cigarette from the pack with his mouth, casting a quick glance at Sarah, silently requesting a light without uttering a word. She obliges, lighting the cigarette for him, and as she does, he takes a moment to glance at the sheet in the typewriter. He begins to unbutton his shirt, but when Sarah immediately rises to assist him, he gently holds her off, determined to manage on his own. She watches him struggle with the button for a while until he finally spreads his arms wide in a gesture of helplessness. As she steps in to unbutton his shirt for him, he tenderly takes her face in his hands and kisses her. Together, Sarah and Eddie emerge from the doorway into the warmth of a beautiful day, with Sarah carrying a basket by her side. Eddie appears content to be outside with her, momentarily forgetting the encumbrance of the casts on his hands. They find a spot overlooking the river, where they spread out a blanket on the grass. Eddie leans back, basking in the sunshine, and gazes at Sarah, both of them exuding a sense of ease and relaxation in each other's company. Eddie lowers his eyes, leans back further, and just stares at her, a moment of tranquility before he is about to knock on the door to Sarah's apartment."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Eddie's cheek is pressed against the glass, screaming horribly until his arms are released, causing him to slump to the floor. The bartender returns to the bar as the ship's horn sounds. Meanwhile, Sarah, in a drunken half-sleep, opens the door to find Eddie leaning against the wall, arms tucked in, one hand covering the other. Stunned, she embraces him as he begins to cry. Later, Sarah watches Eddie, with both hands in plaster casts, struggle to sleep, moving his arms defensively. She joins him, stroking his head. At breakfast, Sarah pours him coffee, but when he can't manage the cup, he drops it in frustration. She patiently cleans up the spill. The apartment is now tidy, and Sarah, sober, types at her table while Eddie, at the window, struggles to scratch his back. He picks a cigarette from the pack with his mouth, and Sarah lights it for him. As he glances at her work, he starts to unbutton his shirt but gestures helplessly when Sarah offers to help. She unbuttons it for him, and he kisses her. On a warm, beautiful day, Sarah and Eddie, with a basket, enjoy a picnic by the river. Eddie, seemingly forgetting his casts, relaxes on the grass, sharing a moment of ease and relaxation with Sarah in the sunshine. He lowers his eyes and stares at her before knocking on her apartment door."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "His cheek is pressed against the glass, which vibrated slightly from the ship's movement through the harbor, with the foggy silhouettes of the others behind him. Eddie's mouth is open as he screams horribly, a sound echoing like a siren used to warn of danger. He screams again, and they let go of his arms, causing him to slump to the floor in the dimly lit room underscored by flickering fluorescent lights. The bartender, a former sailor familiar with rough nights, turns and goes back to the bar in the front room as the ship's horn, a deep and resonant sound used to signal departures, is heard again. There is a knock at the door. Sarah sits alone in the darkened room, dressed in her robe and slip, lost in a drunken half-sleep brought on by an evening of solitude. She goes to the door and opens it, her eyes puffy and her face covered with perspiration, remnants of earlier tears. She looks up to see him leaning against the wall in their narrow hallway, his arms tucked into his chest, with one hand covering the other as though trying to protect himself. Sarah is stunned and moves to him, taking him in her arms. He starts to cry, and she holds him as his sobs quiet in the embrace. Sarah watches as Eddie, both hands encased in plaster casts, a result of his recent accident, tries to sleep and moves his arms as if trying to defend himself against unseen threats. Sarah rises, joins him, and strokes his head as a gesture of comfort. They are seated at the breakfast table, where Sarah pours him some coffee, a ritual of morning solace. He tries to bring the cup to his lips but cannot manage it, and in disgust, he drops the cup on the floor and gets up from the table. Sarah bends down and patiently wipes up the spilled coffee, the aroma filling the small kitchen. The apartment is now clean and neat, and Sarah is sober, having decided to abandon her nightly drinks. She is at her table typing, her fingers dancing over keys with a story she hopes to finish soon, while Eddie stands at the window, trying to reach over his shoulder to scratch his back beneath the plaster. He comes over to the table and picks a cigarette out of the pack with his mouth, looking quickly at her without asking directly for the match, a silent communication they've developed. She lights it, and as she does, he glances at the sheet in the typewriter, intrigued by her words. He starts to unbutton his shirt, but when Sarah immediately gets up to help, he holds her off, determined to exert some independence despite his injury. She watches him struggle with the button for a while, then spreads his arms in a gesture of helplessness. As she unbuttons his shirt for him, he takes her face in his hands and kisses her, a silent thank you. Sarah and Eddie emerge from the doorway, stepping into a world bathed in warmth. It is a warm, beautiful day, and Sarah has a basket with her, filled with their favorite picnic foods. Eddie seems happy to be out with her, almost as if he has forgotten the casts on his hands, savoring the freedom of the open air. They stop at a spot that overlooks the river, a place they often visited in happier times, and spread out a blanket. Eddie leans back on the grass and looks at Sarah, and they both seem easy and relaxed in the sunshine together, finally finding a moment of peace. Eddie lowers his eyes and leans back, a moment of contemplation washing over him, then just stares at her before he is about to knock on the door to Sarah's apartment, a place of refuge and shared history."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "His cheek is pressed against the glass with the foggy silhouettes of the others behind him  Eddie's mouth is open as he screams horribly  He screams again and they let go of his arms causing him to slump to the floor  Sarah watches as Eddie both hands encased in plaster casts tries to sleep and moves his arms as if trying to defend himself  Sarah rises joins him and strokes his head  They are seated at the breakfast table where Sarah pours him some coffee  He tries to bring the cup to his lips but cannot manage it and in disgust he drops the cup on the floor and gets up from the table  Sarah bends down and patiently wipes up the spilled coffee  The apartment is now clean and neat and Sarah is sober  She is at her table typing while Eddie stands at the window trying to reach over his shoulder to scratch his back  He comes over to the table and picks a cigarette out of the pack with his mouth looking quickly at her without asking directly for the match  She lights it and as she does he glances at the sheet in the typewriter  He starts to unbutton his shirt but when Sarah immediately gets up to help he holds her off  She watches him struggle with the button for a while then spreads his arms in a gesture of helplessness  As she unbuttons his shirt for him he takes her face in his hands and kisses her  Sarah and Eddie emerge from the doorway  It is a warm beautiful day and Sarah has a basket with her  The bartender turns and goes back to the bar in the front room as the ship's horn is heard again  There is a knock at the door  Sarah sits alone in the darkened room dressed in her robe and slip lost in a drunken halfsleep  She goes to the door and opens it her eyes puffy and her face covered with perspiration  She looks up to see him leaning against the wall his arms tucked into his chest with one hand covering the other  Sarah is stunned and moves to him taking him in her arms  He starts to cry and she holds him  Sarah watches as Eddie both hands encased in plaster casts tries to sleep and moves his arms as if trying to defend himself  Sarah rises joins him and strokes his head  They are seated at the breakfast table where Sarah pours him some coffee  He tries to bring the cup to his lips but cannot manage it and in disgust he drops the cup on the floor and gets up from the table  Sarah bends down and patiently wipes up the spilled coffee  The apartment is now clean and neat and Sarah is sober  She is at her table typing while Eddie stands at the window trying to reach over his shoulder to scratch his back  He comes over to the table and picks a cigarette out of the pack with his mouth looking quickly at her without asking directly for the match  She lights it and as she does he glances at the sheet in the typewriter  He starts to unbutton his shirt but when Sarah immediately gets up to help he holds her off  She watches him struggle with the button for a while then spreads his arms in a gesture of helplessness  As she unbuttons his shirt for him he takes her face in his hands and kisses her  Sarah and Eddie emerge from the doorway  It is a warm beautiful day and Sarah has a basket with her  Eddie seems happy to be out with her almost as if he has forgotten the casts on his hands  They stop at a spot that overlooks the river and spread out a blanket  Eddie leans back on the grass and looks at Sarah and they both seem easy and relaxed in the sunshine together  Eddie lowers his eyes and leans back then just stares at her before he is about to knock on the door to Sarah's apartment"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "His cheek is pressed against the glass with the foggy silhouettes of the others behind him. Eddie's mouth is open as he screams horribly. He screams again and they let go of his arms causing him to slump to the floor. The bartender turns and goes back to the bar in the front room as the ship's horn is heard again. There is a knock at the door. Sarah sits alone in the darkened room dressed in her robe and slip lost in a drunken halfsleep. She goes to the door and opens it her eyes puffy and her face covered with perspiration. She looks up to see him leaning against the wall his arms tucked into his chest with one hand covering the other. Sarah is stunned and moves to him taking him in her arms. He starts to cry and she holds him. Sarah watches as Eddie both hands encased in plaster casts tries to sleep and moves his arms as if trying to defend himself. Sarah rises joins him and strokes his head. They are seated at the breakfast table where Sarah pours him some coffee. He tries to bring the cup to his lips but cannot manage it and in disgust he drops the cup on the floor and gets up from the table. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Sarah bends down and patiently wipes up the spilled coffee. The apartment is now clean and neat and Sarah is sober. She is at her table typing while Eddie stands at the window trying to reach over his shoulder to scratch his back. He comes over to the table and picks a cigarette out of the pack with his mouth looking quickly at her without asking directly for the match. She lights it and as she does he glances at the sheet in the typewriter. He starts to unbutton his shirt but when Sarah immediately gets up to help he holds her off. She watches him struggle with the button for a while then spreads his arms in a gesture of helplessness. As she unbuttons his shirt for him he takes her face in his hands and kisses her. Sarah and Eddie emerge from the doorway. It is a warm beautiful day and Sarah has a basket with her. Eddie seems happy to be out with her almost as if he has forgotten the casts on his hands. They stop at a spot that overlooks the river and spread out a blanket. Eddie leans back on the grass and looks at Sarah and they both seem easy and relaxed in the sunshine together. Eddie lowers his eyes and leans back then just stares at her before he is about to knock on the door to Sarah's apartment."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "His cheek is pressed against the glass with the foggy silhouettes of the others behind him. Eddie's mouth is open as he screams horribly. He screams again and they let go of his arms causing him to slump to the floor. The bartender turns and goes back to the bar in the front room as the ship's horn is heard again. There is a knock at the door. Sarah sits alone in the darkened room dressed in her robe and slip lost in a drunken halfsleep. She goes to the door and opens it her eyes puffy and her face covered with perspiration. She looks up to see him leaning against the wall his arms tucked into his chest with one hand covering the other. Sarah is stunned and moves to him taking him in her arms. He starts to cry and she holds him. Sarah watches as Eddie both hands encased in plaster casts tries to sleep and moves his arms as if trying to defend himself. Sarah rises joins him and strokes his head. They are seated at the breakfast table where Sarah pours him some coffee. He tries to bring the cup to his lips but cannot manage it and in disgust he drops the cup on the floor and gets up from the table. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. Sarah bends down and patiently wipes up the spilled coffee. The apartment is now clean and neat and Sarah is sober. She is at her table typing while Eddie stands at the window trying to reach over his shoulder to scratch his back. He comes over to the table and picks a cigarette out of the pack with his mouth looking quickly at her without asking directly for the match. She lights it and as she does he glances at the sheet in the typewriter. He starts to unbutton his shirt but when Sarah immediately gets up to help he holds her off. She watches him struggle with the button for a while then spreads his arms in a gesture of helplessness. As she unbuttons his shirt for him he takes her face in his hands and kisses her. Sarah and Eddie emerge from the doorway. It is a warm beautiful day and Sarah has a basket with her. Eddie seems happy to be out with her almost as if he has forgotten the casts on his hands. They stop at a spot that overlooks the river and spread out a blanket. Eddie leans back on the grass and looks at Sarah and they both seem easy and relaxed in the sunshine together. Eddie lowers his eyes and leans back then just stares at her before he is about to knock on the door to Sarah's apartment."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "His cheek is pressed against the glass with the foggy silhouettes of the others behind him. Eddie's mouth is open as he screams horribly. He screams again and they let go of his arms causing him to slump to the floor. The bartender turns and goes back to the bar in the front room as the ship's horn is heard again. There is a knock at the door. Sarah sits alone in the darkened room dressed in her robe and slip lost in a drunken halfsleep. She goes to the door and opens it her eyes puffy and her face covered with perspiration. As she unbuttons his shirt for him he takes her face in his hands and kisses her. Sarah and Eddie emerge from the doorway. It is a warm beautiful day and Sarah has a basket with her. Eddie seems happy to be out with her almost as if he has forgotten the casts on his hands. They stop at a spot that overlooks the river and spread out a blanket. Eddie leans back on the grass and looks at Sarah and they both seem easy and relaxed in the sunshine together. Eddie lowers his eyes and leans back then just stares at her before he is about to knock on the door to Sarah's apartment."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "His cheek is pressed against the glass with the foggy silhouettes of the others behind him. Eddie's mouth is open as he screams horribly. He screams again and they let go of his arms causing him to slump to the floor. They stop at a spot that overlooks the river and spread out a blanket. Eddie leans back on the grass and looks at Sarah and they both seem easy and relaxed in the sunshine together. Eddie lowers his eyes and leans back then just stares at her before he is about to knock on the door to Sarah's apartment."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Her cheek is pressed against the glass, with the foggy silhouettes of the others behind her. The dog’s mouth is open as it screams horribly. It screams again, and they let go of its arms, causing it to slump to the floor. The llama turns and goes back to the bar in the front room as the ship's horn is heard again. There is a knock at the door. The giraffe sits alone in the darkened room, dressed in its robe and slip, lost in a drunken half-sleep. It goes to the door and opens it, its eyes puffy and its face covered with perspiration. It looks up to see the mouse leaning against the wall, its arms tucked into its chest, with one hand covering the other. The giraffe is stunned and moves to the mouse, taking it in its arms. The mouse starts to cry, and the giraffe holds it. The giraffe watches as the dog, both hands encased in plaster casts, tries to sleep and moves its arms as if trying to defend itself. The giraffe rises, joins the dog, and strokes its head. They are seated at the breakfast table, where the giraffe pours the dog some coffee. The dog tries to bring the cup to its lips but cannot manage it, and in disgust, it drops the cup on the floor and gets up from the table. The giraffe bends down and patiently wipes up the spilled coffee. The apartment is now clean and neat, and the giraffe is sober. It is at its table typing, while the dog stands at the window, trying to reach over its shoulder to scratch its back. The dog comes over to the table and picks a cigarette out of the pack with its mouth, looking quickly at the giraffe without asking directly for the match. The giraffe lights it, and as it does, the dog glances at the sheet in the typewriter. The dog starts to unbutton its shirt, but when the giraffe immediately gets up to help, it holds the giraffe off. The giraffe watches the dog struggle with the button for a while, then spreads its arms in a gesture of helplessness. As the giraffe unbuttons the dog's shirt for it, the dog takes the giraffe’s face in its hands and kisses it. The giraffe and the dog emerge from the doorway. It is a warm, beautiful day, and the giraffe has a basket with it. The dog seems happy to be out with the giraffe, almost as if it has forgotten the casts on its hands. They stop at a spot that overlooks the river and spread out a blanket. The dog leans back on the grass and looks at the giraffe, and they both seem easy and relaxed in the sunshine together. The dog lowers its eyes and leans back, then just stares at the giraffe before the mouse is about to knock on the door to the giraffe’s apartment."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "His cheek is pressed against the curtain, with the foggy silhouettes of the others behind him. Eddie's mouth is open as he screams horribly. He screams again, and they let go of his arms, causing him to slump to the carpet. The bartender turns and goes back to the counter in the front room as the train's whistle is heard again. There is a knock at the window. Sarah sits alone in the dimmed room, dressed in her hoodie and jeans, lost in a drowsy half-sleep. She goes to the window and opens it, her eyes puffy and her face covered with perspiration. She looks up to see him leaning against the bookshelf, his arms tucked into his chest, with one hand covering the other. Sarah is stunned and moves to him, taking him in her arms. He starts to cry, and she holds him. Sarah watches as Eddie, both hands encased in mittens, tries to sleep and moves his arms as if trying to defend himself. Sarah rises, joins him, and strokes his head. They are seated at the dining table, where Sarah pours him some tea. He tries to bring the cup to his lips but cannot manage it, and in disgust, he drops the cup on the carpet and gets up from the table. Sarah bends down and patiently wipes up the spilled tea. The flat is now clean and neat, and Sarah is alert. She is at her desk writing, while Eddie stands at the balcony, trying to reach over his shoulder to scratch his back. He comes over to the desk and picks a candy out of the bowl with his mouth, looking quickly at her without asking directly for the lighter. She lights it, and as she does, he glances at the sheet in the notebook. He starts to unbutton his hoodie, but when Sarah immediately gets up to help, he holds her off. She watches him struggle with the zipper for a while, then spreads his arms in a gesture of helplessness. As she unzips his hoodie for him, he takes her face in his hands and kisses her. Sarah and Eddie emerge from the staircase. It is a warm, beautiful day, and Sarah has a backpack with her. Eddie seems happy to be out with her, almost as if he has forgotten the mittens on his hands. They stop at a spot that overlooks the meadow and spread out a sheet. Eddie leans back on the bench and looks at Sarah, and they both seem easy and relaxed in the sunshine together. Eddie lowers his eyes and leans back, then just stares at her before he is about to knock on the window to Sarah's flat."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "His cheek is nestled against the glass, with the hazy silhouettes of the others behind him. Eddie's mouth is open as he whispers softly. He whispers again, and they release his arms, prompting him to glide to the floor. The bartender turns and strolls back to the bar in the front room as the ship's horn resonates again. There is a rap at the door. Sarah lounges alone in the dimly lit room, dressed in her robe and slip, lost in a dreamy half-sleep. She shuffles to the door and unlocks it, her eyes puffy and her face covered with perspiration. She glances up to see him leaning against the wall, his arms wrapped around his chest, with one hand perched over the other. Sarah is taken aback and tiptoes to him, pulling him into her embrace. He begins to chuckle, and she embraces him. Sarah observes as Eddie, both hands wrapped in plaster casts, attempts to nap and shifts his arms as if trying to hug himself. Sarah rises, approaches him, and pats his head. They are seated at the breakfast table, where Sarah hands him some coffee. He attempts to bring the cup to his lips but cannot manage it, and in frustration, he sets the cup on the floor and rises from the table. Sarah crouches down and diligently mops up the spilled coffee. The apartment is now tidy and orderly, and Sarah is sober. She is at her table sketching, while Eddie stands at the window, trying to reach over his shoulder to stretch his back. He strides over to the table and plucks a cigarette out of the pack with his mouth, glancing quickly at her without requesting directly for the match. She ignites it, and as she does, he peers at the sheet in the typewriter. He starts to zip up his jacket, but when Sarah immediately rises to assist, he waves her off. She watches him fumble with the zipper for a while, then spreads his arms in a gesture of exasperation. As she zips up his jacket for him, he takes her face in his hands and pecks her forehead. Sarah and Eddie step out from the doorway. It is a warm, beautiful day, and Sarah has a basket with her. Eddie seems pleased to be out with her, almost as if he has disregarded the casts on his hands. They pause at a spot that overlooks the river and unroll a blanket. Eddie reclines on the grass and glances at Sarah, and they both seem easy and relaxed in the sunshine together. Eddie lowers his eyes and reclines, then just observes her before he is about to ring the doorbell to Sarah's apartment."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Its leaf is pressed against the mirror, with the misty outlines of the chairs behind it. The radio's dial is open as it yells horribly. It yells again, and they let go of its strings, causing it to slump to the rug. The painter spins and goes back to the couch in the side room as the airplane's engine is heard again. There is a tap at the window. The lamp sits alone in the dimmed closet, dressed in its hat and glove, lost in a sleepy half-dream. It goes to the window and opens it, its screens blurry and its shade covered with dust. It looks up to see the speaker leaning against the fence, its wires tucked into its bracket, with one button covering the other. The lamp is stunned and moves to the speaker, taking it in its brackets. It starts to beep, and the lamp holds it. The lamp watches as the radio, both buttons encased in plastic shells, tries to sleep and moves its dials as if trying to protect itself. The lamp rises, joins it, and strokes its dial. They are seated at the dinner plate, where the lamp pours it some tea. It tries to bring the saucer to its note but cannot manage it, and in disgust, it drops the saucer on the rug and gets up from the plate. The lamp bends down and patiently wipes up the spilled tea. The attic is now tidy and organized, and the lamp is aware. It is at its plate scribbling, while the radio stands at the curtain, trying to reach over its circuit to scratch its plug. It comes over to the plate and picks a needle out of the box with its button, looking quickly at it without asking directly for the flame. It flicks it, and as it does, it glances at the sheet in the stapler. It starts to untie its cable, but when the lamp immediately gets up to assist, it holds it off. It watches it wrestle with the cord for a while, then spreads its wires in a gesture of defenselessness. As it unties its cable for it, it takes its shade in its buttons and beeps it. The lamp and the radio emerge from the gate. It is a breezy, stunning night, and the lamp has a parcel with it. The radio seems thrilled to be out with it, almost as if it has forgotten the shells on its buttons. They stop at a spot that overlooks the mountain and spread out a scarf. The radio leans back on the earth and looks at the lamp, and they both seem easy and relaxed in the starlight together. The radio lowers its buttons and leans back, then just stares at it before it is about to tap on the window to the lamp's attic."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "His forehead is pressed against the curtain, with the blurry outlines of the birds behind him. Alex's mouth is open as he whispers softly. He whispers again, and they release his legs, causing him to collapse onto the carpet. The librarian spins and returns to the shelf in the side room as the train's whistle is heard again. There is a tap at the window. Linda lounges alone in the dim room, clad in her dress and jacket, consumed in a tipsy half-drowse. She trots to the window and lifts it, her eyes swollen and her forehead slick with sweat. She peers up to see him reclining against the banister, his feet tucked into his chest, with one finger tapping the other. Linda is baffled and shifts to him, enveloping him in her arms. He starts to laugh, and she supports him. Linda observes as Alex, both arms encased in woolen wraps, tries to rest and moves his feet as if trying to protect himself. Linda stands, accompanies him, and pats his arm. They are positioned at the dining table, where Linda serves him some juice. He attempts to bring the glass to his chin but fails, and in frustration, he tosses the glass on the carpet and walks away from the table. Linda crouches down and carefully wipes up the spilled juice. The room is now tidy and orderly, and Linda is alert. She is at her desk sketching, while Alex lounges by the balcony, trying to reach over his shoulder to pat his back. He strides over to the desk and snatches a pen from the holder with his teeth, glancing briefly at her without openly requesting the paper. She hands it, and as she does, he glances at the canvas on the easel. He starts to remove his jacket, but when Linda promptly stands to assist, he waves her off. She observes him grapple with the zipper for a moment, then spreads his arms in a gesture of resignation. As she unzips his jacket for him, he takes her hand in his and hugs her. Linda and Alex exit from the archway. It is a mild, delightful day, and Linda has a satchel with her. Alex appears pleased to be out with her, almost as if he has forgotten the wraps on his arms. They pause at a spot that overlooks the meadow and lay out a quilt. Alex reclines on the grass and gazes at Linda, and they both seem calm and content in the sunlight together. Alex lowers his gaze and reclines, then just watches her before he is about to tap on the window to Linda's room."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "His cheek is pressed against the wood, with the blurry figures of the others beside him. Eddie's mouth is open as he giggles loudly. He giggles again, and they release his legs, causing him to slide to the floor. The bartender turns and walks back to the shelf in the back room as the train's whistle is heard again. There is a ding at the window. Sarah sits alone in the dimly-lit room, dressed in her coat and scarf, engulfed in a dreamy half-slumber. She goes to the window and slides it open, her eyes red and her face covered with dust. She looks up to see him leaning against the railing, his legs tucked against his chest, with one foot covering the other. Sarah is surprised and moves to him, pulling him in her arms. He starts to laugh, and she holds him. Sarah observes as Eddie, both feet wrapped in woolen socks, tries to nap and waves his legs as if trying to run away. Sarah rises, joins him, and pats his shoulder. They are seated at the dinner table, where Sarah pours him some tea. He tries to bring the mug to his lips but cannot manage it, and in frustration, he tosses the mug on the floor and stands up from the table. Sarah crouches down and carefully mops up the spilled tea. The apartment is now cluttered and chaotic, and Sarah is alert. She is at her easel painting, while Eddie stands at the balcony, trying to reach over his shoulder to scratch his neck. He comes over to the easel and picks a pencil out of the jar with his mouth, glancing quickly at her without asking directly for the eraser. She sharpens it, and as she does, he glances at the paper in the easel. He starts to untie his shoe, but when Sarah immediately gets up to assist, he waves her off. She watches him fumble with the shoelace for a while, then spreads his hands in a gesture of frustration. As she unties his shoe for him, he takes her hand in his and hugs her. Sarah and Eddie step out from the garden gate. It is a cool, breezy morning, and Sarah has a backpack with her. Eddie seems delighted to be out with her, almost as if he has forgotten the socks on his feet. They stop at a bench that overlooks the lake and spread out a towel. Eddie leans back on the sand and looks at Sarah, and they both seem calm and content in the breeze together. Eddie lowers his eyes and leans back, then just gazes at her before he is about to ring the bell to Sarah's apartment."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Her elbow rests on the curtain, with the blurry outlines of the statues in front of her. Lucy's eyes are wide as she laughs quietly. She laughs once more, and they release her feet, causing her to tumble to the chair. The librarian spins and heads back to the table in the back chamber as the bell's chime is heard once more. There is a ring at the gate. Tom stands alone in the bright corridor, dressed in his coat and tie, lost in a groggy dream-state. He walks to the gate and swings it open, his eyes red and his hands covered with ink. He gazes down to find her lounging on the bench, her legs tucked into her lap, with one shoe covering the other. Tom is amazed and rushes to her, pulling her to his shoulder. She begins to whisper, and he listens closely. Tom observes as Lucy, both feet wrapped in woolen socks, attempts to wake and moves her legs as though trying to run. Tom stands, approaches her, and pats her shoulder. They are seated at the dinner carpet, where Tom hands her some tea. She attempts to bring the glass to her teeth but cannot achieve it, and in frustration, she places the glass on the carpet and rises from the blanket. Tom kneels down and carefully picks up the toppled tea. The villa is now tidy and cheerful, and Tom is alert. He is at his chair sketching, while Lucy lounges by the door, attempting to reach around her side to scratch her shoulder. She strolls over to the chair and selects an apple out of the bowl with her hand, glancing momentarily at him without requesting directly for a knife. He slices it, and as he does, she peeks at the drawing on the paper. She begins to tie her scarf, but when Tom swiftly stands to assist, she holds him back. He observes her wrestle with the knot for a moment, then raises her hands in a sign of defeat. As he knots her scarf for her, she takes his hand in her own and whispers softly. Tom and Lucy step from the archway. It is a cool, serene evening, and Tom has a backpack with him. Lucy appears pleased to be out with him, almost as if she has ignored the slippers on her feet. They pause at a location that overlooks the meadow and unfurl a shawl. Lucy reclines on the stones and gazes at Tom, and both seem calm and content in the moonlight together. Lucy lifts her chin and reclines, then merely gazes at him before she intends to tap on the wall of Tom's villa."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Eddie screams with his cheek pressed against the glass, but when his arms are released, he slumps to the floor. The bartender returns to the bar as the ship's horn sounds. Sarah, alone and drowsy from alcohol, opens the door to a puffy-eyed Eddie leaning against the wall with plaster-cast hands. She embraces him as he cries. At breakfast, frustrated by his inability to drink coffee, Eddie spills it, and Sarah cleans patiently. Later, the apartment is tidy, and Sarah sober, types while Eddie struggles with his shirt buttons; they share a tender moment when she helps him. On a warm day, they picnic by the river, enjoying each other's company, seemingly forgetting his casts. Eddie looks at Sarah affectionately before preparing to knock on her apartment door."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Eddie lowers his eyes and leans back then just stares at her before he is about to knock on the door to Sarah's apartment Eddie leans back on the grass and looks at Sarah and they both seem easy and relaxed in the sunshine together  They stop at a spot that overlooks the river and spread out a blanket  Eddie seems happy to be out with her almost as if he has forgotten the casts on his hands  It is a warm beautiful day and Sarah has a basket with her  Sarah and Eddie emerge from the doorway  As she unbuttons his shirt for him he takes her face in his hands and kisses her  She watches him struggle with the button for a while then spreads his arms in a gesture of helplessness  He starts to unbutton his shirt but when Sarah immediately gets up to help he holds her off  She lights it and as she does he glances at the sheet in the typewriter  He comes over to the table and picks a cigarette out of the pack with his mouth looking quickly at her without asking directly for the match  She is at her table typing while Eddie stands at the window trying to reach over his shoulder to scratch his back  The apartment is now clean and neat and Sarah is sober  Sarah bends down and patiently wipes up the spilled coffee  He tries to bring the cup to his lips but cannot manage it and in disgust he drops the cup on the floor and gets up from the table  They are seated at the breakfast table where Sarah pours him some coffee  Sarah rises joins him and strokes his head  Sarah watches as Eddie both hands encased in plaster casts tries to sleep and moves his arms as if trying to defend himself  He starts to cry and she holds him  Sarah is stunned and moves to him taking him in her arms  She looks up to see him leaning against the wall his arms tucked into his chest with one hand covering the other  She goes to the door and opens it her eyes puffy and her face covered with perspiration  Sarah sits alone in the darkened room dressed in her robe and slip lost in a drunken halfsleep  There is a knock at the door  The bartender turns and goes back to the bar in the front room as the ship's horn is heard again  He screams again and they let go of his arms causing him to slump to the floor  Eddie's mouth is open as he screams horribly  His cheek is pressed against the glass with the foggy silhouettes of the others behind him "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Sarah and Eddie emerge from the doorway  He starts to cry and she holds him  She looks up to see him leaning against the wall his arms tucked into his chest with one hand covering the other  She lights it and as she does he glances at the sheet in the typewriter  As she unbuttons his shirt for him he takes her face in his hands and kisses her  His cheek is pressed against the glass with the foggy silhouettes of the others behind him  They stop at a spot that overlooks the river and spread out a blanket  She watches him struggle with the button for a while then spreads his arms in a gesture of helplessness  Sarah sits alone in the darkened room dressed in her robe and slip lost in a drunken halfsleep  Eddie lowers his eyes and leans back then just stares at her before he is about to knock on the door to Sarah's apartment The apartment is now clean and neat and Sarah is sober  He tries to bring the cup to his lips but cannot manage it and in disgust he drops the cup on the floor and gets up from the table  Eddie leans back on the grass and looks at Sarah and they both seem easy and relaxed in the sunshine together  She is at her table typing while Eddie stands at the window trying to reach over his shoulder to scratch his back  He comes over to the table and picks a cigarette out of the pack with his mouth looking quickly at her without asking directly for the match  Sarah bends down and patiently wipes up the spilled coffee  Eddie's mouth is open as he screams horribly  Sarah is stunned and moves to him taking him in her arms  He starts to unbutton his shirt but when Sarah immediately gets up to help he holds her off  Sarah rises joins him and strokes his head  It is a warm beautiful day and Sarah has a basket with her  They are seated at the breakfast table where Sarah pours him some coffee  He screams again and they let go of his arms causing him to slump to the floor  The bartender turns and goes back to the bar in the front room as the ship's horn is heard again  Sarah watches as Eddie both hands encased in plaster casts tries to sleep and moves his arms as if trying to defend himself  Eddie seems happy to be out with her almost as if he has forgotten the casts on his hands  She goes to the door and opens it her eyes puffy and her face covered with perspiration  There is a knock at the door "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Sarah bends down and patiently wipes up the spilled coffee  The apartment is now clean and neat and Sarah is sober  She is at her table typing while Eddie stands at the window trying to reach over his shoulder to scratch his back  He comes over to the table and picks a cigarette out of the pack with his mouth looking quickly at her without asking directly for the match  She lights it and as she does he glances at the sheet in the typewriter  He starts to unbutton his shirt but when Sarah immediately gets up to help he holds her off  She watches him struggle with the button for a while then spreads his arms in a gesture of helplessness  As she unbuttons his shirt for him he takes her face in his hands and kisses her  Sarah and Eddie emerge from the doorway  It is a warm beautiful day and Sarah has a basket with her  Eddie seems happy to be out with her almost as if he has forgotten the casts on his hands  They stop at a spot that overlooks the river and spread out a blanket  Eddie leans back on the grass and looks at Sarah and they both seem easy and relaxed in the sunshine together  Eddie lowers his eyes and leans back then just stares at her before he is about to knock on the door to Sarah's apartment His cheek is pressed against the glass with the foggy silhouettes of the others behind him  Eddie's mouth is open as he screams horribly  He screams again and they let go of his arms causing him to slump to the floor  The bartender turns and goes back to the bar in the front room as the ship's horn is heard again  There is a knock at the door  Sarah sits alone in the darkened room dressed in her robe and slip lost in a drunken halfsleep  She goes to the door and opens it her eyes puffy and her face covered with perspiration  She looks up to see him leaning against the wall his arms tucked into his chest with one hand covering the other  Sarah is stunned and moves to him taking him in her arms  He starts to cry and she holds him  Sarah watches as Eddie both hands encased in plaster casts tries to sleep and moves his arms as if trying to defend himself  Sarah rises joins him and strokes his head  They are seated at the breakfast table where Sarah pours him some coffee  He tries to bring the cup to his lips but cannot manage it and in disgust he drops the cup on the floor and gets up from the table "
        }
      ]
    }
  ]
}