{
  "ground_truth": "In the movie, a man stops to look at his hands and realizes the casts are off. He knocks on a door with his wrist as if the casts were still on. When the door opens, he holds up his hands boyishly, and a woman kisses them. Eddie flexes his fingers and tries a shot on Johnny's pool table, using an open hand bridge for support, as Bert Gordon enters and watches him play, smiling at Eddie. Later, Eddie and Sarah enter a quiet, elegant restaurant with soft piano music and subdued lighting, a place they passed on the day they first met. Sarah wears a new dress, while Eddie, looking a little uneasy, wears a suit and tie. The headwaiter seats them, and they exchange smiles. A waiter approaches, and Sarah suddenly laughs. The waiter returns with a bottle of sherry for Eddie's approval, leading to a long pause before Eddie responds. The waiter pours the sherry as Eddie and Sarah stare at each other over their glasses, until Eddie looks away. Sarah proposes a toast, and they touch glasses. The waiter brings the check, and Eddie nods, drinking the last of his brandy as the waiter leaves. Sarah notices Eddie's somber demeanor and, picking up her purse and gloves, she leaves. It is raining heavily as Sarah emerges from the building, leaning wearily against the awning. Eddie quickly pays the bill and follows her, catching up to take her by the arm and stepping out to hail a cab. Sarah angrily breaks away and walks into the rain, but Eddie pulls her back under the awning, and they enter a building, both drenched. She walks to a chair, limping noticeably, and he reaches over to pull her close, burying his face in her head. Bert Gordon leans on a cab, his expression dropping at the sight of Eddie and Sarah approaching. Eddie carries two suitcases and a leather cue case, setting the suitcases on the curb for the cab driver to take. Bert courteously opens the taxi door, and Sarah eyes Bert distrustfully as she gets in. Eddie, Sarah, and Bert then squeeze through the door of a train compartment as a redcap exits with their luggage, and Eddie shuts the door, with Bert and Sarah sitting across from each other.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "In the film, a gentleman pauses to gaze at his palms and perceives the splints are removed. He raps on a portal with his forearm as if the splints were still attached. When the portal opens, he raises his palms mischievously, and a lady kisses them. Eddie bends his digits and attempts a stroke on Johnny's billiard table, using an open palm bridge for support, as Bert Gordon enters and observes him engage, grinning at Eddie. Subsequently, Eddie and Sarah enter a tranquil, refined bistro with gentle forte music and muted illumination, a site they passed on the occasion they initially encountered. Sarah dons a fresh gown, while Eddie, appearing somewhat uneasy, dons a suit and cravat. The maitre d' seats them, and they swap grins. A servitor approaches, and Sarah abruptly chuckles. The servitor returns with a vessel of sherry for Eddie's endorsement, leading to a prolonged pause before Eddie replies. The servitor decants the sherry as Eddie and Sarah gaze at one another over their goblets, until Eddie averts his gaze. Sarah suggests a tribute, and they clink goblets. The servitor brings the bill, and Eddie nods, consuming the remainder of his cognac as the servitor departs. Sarah notices Eddie's solemn demeanor and, picking up her handbag and mittens, she departs. It is pouring heavily as Sarah emerges from the edifice, leaning wearily against the canopy. Eddie swiftly settles the account and follows her, catching up to take her by the arm and venturing out to hail a cab. Sarah irately pulls away and strides into the rain, but Eddie draws her back under the canopy, and they enter an edifice, both soaked. She proceeds to a seat, hobbling noticeably, and he reaches over to pull her close, burying his visage in her head. Bert Gordon leans on a taxi, his expression dropping at the sight of Eddie and Sarah arriving. Eddie carries two suitcases and a leather cue case, placing the suitcases on the curb for the cab driver to retrieve. Bert courteously opens the cab door, and Sarah eyes Bert distrustfully as she boards. Eddie, Sarah, and Bert then squeeze through the portal of a train compartment as a redcap exits with their luggage, and Eddie closes the portal, with Bert and Sarah sitting across from each other."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "In the movie, a man stops to look at his hands and realizes the casts have been taken off. A door is knocked on by him with his wrist as if the casts were still on. When the door is opened, his hands are held up boyishly, and a woman kisses them. Eddie's fingers are flexed and a shot is tried on Johnny's pool table by him, using an open hand bridge for support, as Bert Gordon enters and watches him play, smiling at Eddie. Later, a quiet, elegant restaurant with soft piano music and subdued lighting is entered by Eddie and Sarah, a place they passed on the day they first met. A new dress is worn by Sarah, while Eddie, looking a little uneasy, wears a suit and tie. They are seated by the headwaiter, and smiles are exchanged. A waiter approaches, and Sarah suddenly laughs. A bottle of sherry is returned with by the waiter for Eddie's approval, leading to a long pause before Eddie responds. As the sherry is poured by the waiter, Eddie and Sarah stare at each other over their glasses, until Eddie looks away. A toast is proposed by Sarah, and glasses are touched. The check is brought by the waiter, and Eddie nods, drinking the last of his brandy as the waiter leaves. Eddie's somber demeanor is noticed by Sarah and, picking up her purse and gloves, she leaves. It is raining heavily as Sarah emerges from the building, leaning wearily against the awning. The bill is quickly paid by Eddie and he follows her, catching up to take her by the arm and stepping out to hail a cab. Sarah angrily breaks away and walks into the rain, but she is pulled back by Eddie under the awning, and they enter a building, both drenched. She walks to a chair, limping noticeably, and he reaches over to pull her close, burying his face in her head. Bert Gordon leans on a cab, his expression dropping at the sight of Eddie and Sarah approaching. Two suitcases and a leather cue case are carried by Eddie, setting the suitcases on the curb for the cab driver to take. The taxi door is courteously opened by Bert, and Sarah eyes Bert distrustfully as she gets in. The door of a train compartment is squeezed through by Eddie, Sarah, and Bert as a redcap exits with their luggage, and the door is shut by Eddie, with Bert and Sarah sitting across from each other."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "In the film, a man sees his casts are off and knocks on a door with his wrist, as if they were still on. A woman kisses his hands, and Eddie flexes his fingers, trying a shot on Johnny's pool table while Bert Gordon watches, smiling. Later, Eddie and Sarah enter a quiet, elegant restaurant with soft piano music, where they passed the day they met. Sarah wears a new dress, and Eddie, uneasy, wears a suit. The headwaiter seats them, they exchange smiles, and Sarah laughs when a waiter returns with sherry. Eddie approves the sherry, and they toast, staring at each other until Eddie looks away. When the waiter brings the check, Eddie nods, finishes his brandy, and Sarah, noticing his somber mood, leaves with her purse and gloves. In the rain, Sarah leans against the awning, and Eddie hurriedly pays the bill, catching up to her. She breaks away angrily, but Eddie pulls her back under the awning, and they enter a building, soaked. She limps to a chair, and he pulls her close, burying his face in her head. Bert Gordon, leaning on a cab, frowns as Eddie and Sarah approach. Eddie sets two suitcases for the cab driver. Bert opens the taxi door, and Sarah distrustfully eyes Bert as she enters. Eddie, Sarah, and Bert squeeze into a train compartment while a redcap exits with their luggage, and Eddie shuts the door, with Bert and Sarah sitting across from each other."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "In the film, a man notices his casts are off and knocks on a door with his wrist. A woman kisses his hands when the door opens. Eddie flexes his fingers and takes a shot on Johnny's pool table as Bert Gordon watches, smiling. Later, Eddie and Sarah visit an elegant restaurant with piano music and dim lighting, wearing a suit and new dress. They exchange smiles, and Sarah laughs when a waiter brings sherry for Eddie's approval. They toast with sherry, and Eddie finishes his brandy as Sarah notices his somber mood. She leaves, grabbing her purse, and Eddie pays, following her into the rain. Sarah angrily walks away, but Eddie guides her back, and they enter a building soaked. Sarah limps to a chair, and Eddie embraces her. Bert Gordon's expression drops as he sees them approaching. Eddie carries their suitcases, and Bert opens the taxi door. Sarah eyes Bert distrustfully as she enters. Eddie, Sarah, and Bert enter a train compartment, and a redcap leaves with their luggage as Eddie closes the door, with Bert and Sarah sitting across from each other."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In the captivating movie, there is a poignant scene where a man pauses to examine his hands and comes to the realization that the casts which once bound them have finally been removed. With a bit of muscle memory still lingering, he taps on a door using his wrist as though the casts were still wrapped around it. As the door swings open, he lifts his hands in a somewhat boyish fashion, prompting a woman to greet them with a tender kiss. Eddie, feeling liberated, flexes his fingers experimentally before attempting a shot on Johnny's pool table. He uses an open hand bridge to steady himself as Bert Gordon enters the room, observing Eddie’s play with a knowing smile, clearly impressed.\n\nLater in the narrative, Eddie and Sarah make their way into a serene, sophisticated restaurant, known for its tranquil ambiance characterized by the gentle notes of piano music and the dim, intimate lighting. This spot holds particular significance as it is a place they had passed by on the day their paths first crossed. Sarah adorns a brand new, elegant dress, while Eddie sports a suit and tie, looking slightly on edge. As the headwaiter approaches to seat them, they share a tender exchange of smiles. A moment later, a waiter comes over, prompting Sarah to break into sudden laughter. Soon after, the waiter returns carrying a bottle of sherry, presenting it to Eddie for his approval, which he contemplates before giving a response. The sherry is poured, and Eddie and Sarah lock eyes over the rims of their glasses until Eddie eventually diverts his gaze. Sarah proposes a toast, and their glasses clink softly together. Once the waiter discreetly delivers the check, Eddie signals with a nod, finishing off the remainder of his brandy just as the waiter departs. Observing Eddie's somber attitude, Sarah gathers her purse and gloves and quietly leaves the table. As she emerges from the building into a downpour, she leans tiredly against the awning, trying to shield herself from the relentless rain. Eddie promptly settles the bill and rushes after her, catching up to offer his support by taking her arm as they step out to hail a cab. In a moment of frustration, Sarah pulls away and strides into the heavy rain, but Eddie swiftly brings her back under the shelter of the awning, and together they enter a building, both completely soaked. Inside, Sarah limps noticeably as she moves towards a chair, and Eddie reaches out to draw her close, burying his face tenderly in her hair.\n\nMeanwhile, outside, Bert Gordon stands leaning against a cab, his expression turning slightly crestfallen at the sight of Eddie and Sarah approaching. Eddie is burdened with two suitcases and a leather cue case, which he sets down on the curb for the cab driver to handle. With a gesture of politeness, Bert opens the taxi door, but Sarah looks at him with an air of mistrust as she steps inside. In a somewhat cramped sequence, Eddie, Sarah, and Bert all squeeze through the narrow opening of a train compartment, just as a redcap exits with their luggage. Eddie closes the door behind them, with Bert and Sarah taking seats across from each other, setting the stage for the next chapter of their intertwining journey."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In the captivating movie, there exists a particularly poignant scene in which a man, solemnly pausing, turns his gaze to his hands. In this moment of reflection, he comes to the profound realization that the casts which once ensnared and bound them have finally been removed, a symbol of newfound freedom. Despite this liberation, a bit of muscle memory still lingers, and he instinctively taps on a nearby door using his wrist as though the familiar casts were still wrapped snugly around it. As the door creaks and swings open, he lifts his hands in a somewhat youthful and boyish fashion, prompting a woman to greet the exposed hands with a tender and affectionate kiss. Feeling liberated from past restraints, Eddie flexes his fingers experimentally, marveling at the sensation before making an attempt at a shot on Johnny's pool table. He employs an open hand bridge to steady himself for the shot as Bert Gordon enters the room. Observing Eddie’s play with an experienced, knowing smile, Bert is clearly impressed.\n\nLater in the narrative, Eddie and Sarah make their way into a serene, sophisticated restaurant. This well-regarded establishment is known for its tranquil ambiance, characterized by the gentle, soothing notes of piano music and the dim, intimate lighting that envelops the space. The restaurant holds particular significance for them, as it is a place they had passed by on the day their paths first crossed in a fateful encounter. Sarah adorns a brand-new, elegant dress, radiating charm and grace, while Eddie sports a suit and tie, appearing slightly on edge and perhaps a bit nervous. As the headwaiter approaches with a professional air to seat them, they share a tender, knowing exchange of smiles. A moment later, a waiter comes over to their table, prompting Sarah to break into a sudden burst of laughter. Soon after, the waiter returns, carefully carrying a bottle of sherry, which he presents to Eddie for his approval—a decision he contemplates thoughtfully before finally giving a response. The sherry is poured, and Eddie and Sarah lock eyes over the rims of their glasses, holding the gaze until Eddie eventually diverts his eyes. Sarah proposes a heartfelt toast, and their glasses clink softly together, signaling a shared moment of connection. Once the waiter discreetly places the check on the table, Eddie signals with a subtle nod, finishing off the remainder of his brandy just as the waiter departs. Observing Eddie's somber demeanor, Sarah, sensing his mood, gathers her purse and gloves, and quietly leaves the table. As she emerges from the building into a sudden downpour, she leans tiredly against the awning, trying to shield herself from the relentless onslaught of rain. Eddie quickly settles the bill and rushes after her, catching up to offer his support by gently taking her arm as they step out to hail a cab. In a moment of frustration, Sarah pulls away and strides defiantly into the heavy rain, but Eddie swiftly brings her back under the protective shelter of the awning, and together they enter the nearest building, both completely soaked from the rain. Inside, Sarah limps noticeably as she moves towards a chair, and Eddie reaches out to her, drawing her close and burying his face tenderly in her hair as he offers comfort.\n\nMeanwhile, outside in the rain-soaked street, Bert Gordon stands leaning against a cab, his expression shifting to one of slight crestfallenness at the sight of Eddie and Sarah approaching together. Eddie is burdened with two suitcases along with a leather cue case, which he sets down carefully on the curb for the cab driver to handle. With a gesture of politeness and perhaps unspoken words, Bert opens the taxi door, but Sarah casts a glance at him full of air of mistrust as she steps inside. In a somewhat cramped sequence, Eddie, Sarah, and Bert all squeeze through the narrow opening of a train compartment, just as a redcap exits, taking care of their luggage. Eddie closes the compartment door behind them, with Bert and Sarah taking seats across from each other, setting the stage for the next chapter of their intertwining journey."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "In the movie, a man halts his movements to examine his outstretched hands closely and suddenly comes to the realization that the casts that once encased them have been removed. He then approaches a door and, with a sense of muscle memory, uses his wrist to knock on it as though the casts are still present. When the door swings open, the man lifts his hands in a playful, almost childlike manner, prompting a woman to lean forward and plant gentle kisses upon them. Savoring the newfound freedom of movement, Eddie begins to flex his fingers experimentally before stepping up to Johnny's pool table. He positions himself for a shot, carefully forming an open hand bridge to support the cue as he lines up the shot, all while Bert Gordon makes his entrance, casually observing Eddie's game with a smile spreading across his face. Later, Eddie and Sarah find themselves stepping into a serene, elegantly appointed restaurant. The ambiance is set with soft piano melodies and dim lighting, and it is a place that feels familiar because they had walked by it together on the day their paths first crossed. Sarah, exuding confidence in her new dress, accompanies Eddie, who appears slightly uneasy in his suit and tie. As they reach their designated table, the headwaiter guides them to their seats where they exchange warm smiles. A waiter then approaches their table, and Sarah spontaneously bursts into laughter. Shortly thereafter, the waiter returns, presenting a bottle of sherry for Eddie's approval. This moment hangs in the air as Eddie pauses, contemplating the situation, before finally acknowledging it. The waiter proceeds to pour the sherry, and as Eddie and Sarah lock eyes over their glasses, an unspoken exchange occurs until Eddie breaks the gaze. In a lighthearted gesture, Sarah proposes a toast, and they gently clink their glasses together. When the waiter places the check on the table, Eddie gives a slight nod, downing the last of his brandy as the waiter discreetly departs. Observing Eddie's shift to a more somber mood, Sarah gathers her purse and gloves before rising to leave. As she steps out into the heavy rain, she leans tiredly against the awning for support. Eddie, acting swiftly, settles the bill before chasing after her, reaching out to take her arm as they step forward to flag down a cab. In a moment driven by frustration, Sarah pulls away sharply and strides into the downpour, but Eddie seizes her, drawing her back under the protection of the awning, and together they seek refuge inside a building, both thoroughly drenched. Inside, Sarah limps over to a chair, the strain evident, as Eddie moves to her side, pulling her close and letting his weariness show by burying his face in her hair. Outside, Bert Gordon leans against a cab, his demeanor shifting to dismay as he notices Eddie and Sarah approaching. Eddie lugs two hefty suitcases along with a leather cue case, setting the suitcases down on the curb for the cab driver to collect. With a gesture of politeness, Bert opens the cab door, and Sarah, casting a wary glance in Bert's direction, climbs into the vehicle. The scene transitions to Eddie, Sarah, and Bert navigating the narrow doorway of a train compartment, squeezing through as a redcap exits, carrying their luggage. Once inside, Eddie secures the door shut while Bert and Sarah settle into seats opposite each other."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "In the movie, a man realizes his casts are off, knocks on a door, and a woman kisses his hands. Eddie flexes his fingers, plays pool using an open hand bridge, and is observed by Bert Gordon, who smiles. Later, Eddie and Sarah visit an elegant restaurant they once passed, where Sarah wears a new dress and Eddie appears slightly uneasy in a suit. After being seated by the headwaiter, they share a smile, and Sarah laughs as a waiter presents sherry for Eddie's approval, leading to a moment of contemplation. They toast, but Eddie's mood turns somber. Sarah notices this and leaves with her belongings. Outside, in the heavy rain, she leans against the awning until Eddie pays the bill and follows her, catching up to guide her back. They enter a building drenched, and Eddie comforts Sarah, who limps toward a chair. Meanwhile, Bert Gordon watches from a cab, his expression changing as Eddie and Sarah approach with luggage. Eddie hands the suitcases to the cab driver while Bert opens the taxi door, prompting a wary look from Sarah before they all squeeze into a train compartment, with Bert and Sarah seated across from each other."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "In the movie, a man stops to look at his hands and realizes the casts, which he wore after an accident that sidelined his pool career for months, are off. He knocks on a door with his wrist as if the casts were still on. When the door opens, he holds up his hands boyishly, and a woman, his longtime partner who supported him through his recovery, kisses them. Eddie flexes his fingers and tries a shot on Johnny's pool table, a renowned venue in their town known for hosting underground tournaments, using an open hand bridge for support, as Bert Gordon, a shrewd gambler with a keen interest in Eddie's comeback, enters and watches him play, smiling at Eddie. Later, Eddie and Sarah enter a quiet, elegant restaurant with soft piano music and subdued lighting, a place they passed on the day they first met in the vibrant district of the city. Sarah wears a new dress, an elegant piece she bought for the occasion, while Eddie, looking a little uneasy, wears a suit and tie that he last wore at an important match. The headwaiter, who recognizes regular patrons, seats them, and they exchange smiles. A waiter approaches, and Sarah suddenly laughs, remembering a shared joke. The waiter returns with a bottle of sherry for Eddie's approval, leading to a long pause before Eddie, who is often indecisive about choices outside of pool, responds. The waiter pours the sherry as Eddie and Sarah stare at each other over their glasses, until Eddie looks away, his thoughts distracted by memories of recent challenges. Sarah proposes a toast, a tradition from their first anniversary, and they touch glasses. The waiter brings the check, and Eddie nods, drinking the last of his brandy as the waiter leaves, noticing Eddie's contemplative mood. Sarah notices Eddie's somber demeanor and, picking up her purse and gloves, she leaves, her mind racing with concerns. It is raining heavily as Sarah emerges from the building, leaning wearily against the awning that offers minimal shelter. Eddie quickly pays the bill and follows her, catching up to take her by the arm and stepping out to hail a cab. Sarah angrily breaks away, overwhelmed by emotions, and walks into the rain, but Eddie pulls her back under the awning, and they enter a building, both drenched, seeking refuge from the storm. She walks to a chair, limping noticeably from an old injury, and he reaches over to pull her close, burying his face in her head, seeking solace. Bert Gordon leans on a cab, his expression dropping at the sight of Eddie and Sarah approaching, as he anticipated a different outcome. Eddie carries two suitcases and a leather cue case, a prized possession signifying his commitment to the game, setting the suitcases on the curb for the cab driver to take. Bert courteously opens the taxi door, and Sarah eyes Bert distrustfully, aware of his reputation, as she gets in. Eddie, Sarah, and Bert then squeeze through the door of a train compartment as a redcap, an attendant who aids passengers with their luggage, exits with their belongings, and Eddie shuts the door, with Bert and Sarah sitting across from each other, the tension between them palpable."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "In the movie a man stops to look at his hands and realizes the casts are off. He knocks on a door with his wrist as if the casts were still on. When the door opens he holds up his hands boyishly and a woman kisses them. Eddie flexes his fingers and tries a shot on Johnny's pool table using an open hand bridge for support as Bert Gordon enters and watches him play smiling at Eddie. Later Eddie and Sarah enter a quiet elegant restaurant with soft piano music and subdued lighting a place they passed on the day they first met. Sarah wears a new dress while Eddie looking a little uneasy wears a suit and tie. The headwaiter seats them and they exchange smiles. A waiter approaches and Sarah suddenly laughs. The waiter returns with a bottle of sherry for Eddie's approval leading to a long pause before Eddie responds. The waiter pours the sherry as Eddie and Sarah stare at each other over their glasses until Eddie looks away. Sarah proposes a toast and they touch glasses. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. The waiter brings the check and Eddie nods drinking the last of his brandy. as the waiter leaves. Sarah notices Eddie's somber demeanor and picking up her purse and gloves. she leaves. It is raining heavily as Sarah emerges from the building leaning wearily against the awning. Eddie quickly pays the bill and follows her catching up to take her by the arm and stepping out to hail a cab. Sarah angrily breaks away and walks into the rain but Eddie pulls her back under the awning and they enter a building both drenched. She walks to a chair limping noticeably and he reaches over to pull her close burying his face in her head. Bert Gordon leans on a cab his expression dropping at the sight of Eddie and Sarah approaching. Eddie carries two suitcases and a leather cue case setting the suitcases on the curb for the cab driver to take Bert courteously opens the taxi door and Sarah eyes Bert distrustfully as she gets in Eddie. Sarah and Bert then squeeze through the door of a train compartment as a redcap exits with their luggage and Eddie shuts the door with Bert and Sarah sitting across from each other."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "In the movie a man stops to look at his hands and realizes the casts are off. He knocks on a door with his wrist as if the casts were still on. When the door opens he holds up his hands boyishly and a woman kisses them. Eddie flexes his fingers and tries a shot on Johnny's pool table using an open hand bridge for support as Bert Gordon enters and watches him play smiling at Eddie. Later Eddie and Sarah enter a quiet elegant restaurant with soft piano music and subdued lighting a place they passed on the day they first met. Sarah wears a new dress while Eddie looking a little uneasy wears a suit and tie. The headwaiter seats them and they exchange smiles. A waiter approaches and Sarah suddenly laughs. The waiter returns with a bottle of sherry for Eddie's approval leading to a long pause before Eddie responds. The waiter pours the sherry as Eddie and Sarah stare at each other over their glasses until Eddie looks away. Sarah proposes a toast and they touch glasses. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. The waiter brings the check and Eddie nods drinking the last of his brandy. as the waiter leaves. Sarah notices Eddie's somber demeanor and picking up her purse and gloves. she leaves. It is raining heavily as Sarah emerges from the building leaning wearily against the awning. Eddie quickly pays the bill and follows her catching up to take her by the arm and stepping out to hail a cab. Sarah angrily breaks away and walks into the rain but Eddie pulls her back under the awning and they enter a building both drenched. She walks to a chair limping noticeably and he reaches over to pull her close burying his face in her head. Bert Gordon leans on a cab his expression dropping at the sight of Eddie and Sarah approaching. Eddie carries two suitcases and a leather cue case setting the suitcases on the curb for the cab driver to take Bert courteously opens the taxi door and Sarah eyes Bert distrustfully as she gets in Eddie. Sarah and Bert then squeeze through the door of a train compartment as a redcap exits with their luggage and Eddie shuts the door with Bert and Sarah sitting across from each other."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "In the movie a man stops to look at his hands and realizes the casts are off. He knocks on a door with his wrist as if the casts were still on. When the door opens he holds up his hands boyishly and a woman kisses them. Eddie flexes his fingers and tries a shot on Johnny's pool table using an open hand bridge for support as Bert Gordon enters and watches him play smiling at Eddie. Later Eddie and Sarah enter a quiet elegant restaurant with soft piano music and subdued lighting a place they passed on the day they first met. Sarah wears a new dress while Eddie looking a little uneasy wears a suit and tie. Sarah angrily breaks away and walks into the rain but Eddie pulls her back under the awning and they enter a building both drenched. She walks to a chair limping noticeably and he reaches over to pull her close burying his face in her head. Bert Gordon leans on a cab his expression dropping at the sight of Eddie and Sarah approaching. Eddie carries two suitcases and a leather cue case setting the suitcases on the curb for the cab driver to take Bert courteously opens the taxi door and Sarah eyes Bert distrustfully as she gets in Eddie. Sarah and Bert then squeeze through the door of a train compartment as a redcap exits with their luggage and Eddie shuts the door with Bert and Sarah sitting across from each other."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "In the movie a man stops to look at his hands and realizes the casts are off. He knocks on a door with his wrist as if the casts were still on. When the door opens he holds up his hands boyishly and a woman kisses them. Eddie carries two suitcases and a leather cue case setting the suitcases on the curb for the cab driver to take Bert courteously opens the taxi door and Sarah eyes Bert distrustfully as she gets in Eddie. Sarah and Bert then squeeze through the door of a train compartment as a redcap exits with their luggage and Eddie shuts the door with Bert and Sarah sitting across from each other."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "In the cartoon, a cat pauses to gaze at its paws and realizes the mittens are gone. It taps on a window with its elbow as if the mittens were still on. When the window slides open, it raises its paws sheepishly, and a rabbit nuzzles them. Max stretches his toes and attempts a toss on Paul's golf course, using an open claw grip for balance, as Fred Jenkins strolls in and observes him swing, chuckling at Max. Later, Max and Lisa wander into a noisy, rustic cabin with loud trumpet tunes and bright lighting, a place they bypassed on the evening they first argued. Lisa sports an old coat, while Max, looking a tad awkward, dons a hoodie and jeans. The hostess escorts them, and they trade grins. A chef sidles up, and Lisa suddenly snorts. The chef returns with a glass of cider for Max's tasting, causing a brief silence before Max reacts. The chef pours the cider as Max and Lisa glare at each other over their mugs, until Max glances aside. Lisa suggests a salute, and they clink mugs. The chef delivers the bill, and Max shrugs, sipping the last of his soda as the chef departs. Lisa observes Max's cheerful demeanor and, grasping her bag and hat, she departs. It is snowing lightly as Lisa steps from the gazebo, lounging comfortably against the fence. Max casually settles the ticket and follows her, catching up to nudge her by the shoulder and stepping in to summon a bus. Lisa joyfully skips away and prances into the snow, but Max steers her back under the fence, and they jump into a gazebo, both shivering. She wanders to a bench, hobbling slightly, and he leans over to hold her tight, resting his chin on her shoulder. Fred Jenkins sits on a bicycle, his mood lifting at the sight of Max and Lisa arriving. Max hauls two backpacks and a cardboard box, placing the backpacks on the street for the bus driver to grab. Fred obligingly shuts the bus door, and Lisa watches Fred cautiously as she hops in. Max, Lisa, and Fred then slide through the entrance of a boat cabin as a bellhop carries their parcels, and Max locks the entrance, with Fred and Lisa lounging opposite each other."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In the movie, a man named Eddie realizes his casts are off and tries a shot on a pool table as Bert Gordon watches, smiling. Eddie and Sarah enter a quiet restaurant they had passed when they first met. While dining, Sarah laughs, and they exchange a toast. When the check arrives, Eddie appears somber, prompting Sarah to leave. Eddie follows into the rain, catching up to her, and they reconcile under an awning. Bert Gordon waits by a cab as Eddie and Sarah approach, with Eddie carrying suitcases. Sarah eyes Bert distrustfully as they enter a cab. Eddie, Sarah, and Bert then board a train compartment, the redcap handling their luggage."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Sarah and Bert then squeeze through the door of a train compartment as a redcap exits with their luggage and Eddie shuts the door with Bert and Sarah sitting across from each other Eddie carries two suitcases and a leather cue case setting the suitcases on the curb for the cab driver to take Bert courteously opens the taxi door and Sarah eyes Bert distrustfully as she gets in Eddie Bert Gordon leans on a cab his expression dropping at the sight of Eddie and Sarah approaching She walks to a chair limping noticeably and he reaches over to pull her close burying his face in her head Sarah angrily breaks away and walks into the rain but Eddie pulls her back under the awning and they enter a building both drenched Eddie quickly pays the bill and follows her catching up to take her by the arm and stepping out to hail a cab It is raining heavily as Sarah emerges from the building leaning wearily against the awning she leaves Sarah notices Eddie's somber demeanor and picking up her purse and gloves as the waiter leaves The waiter brings the check and Eddie nods drinking the last of his brandy Sarah proposes a toast and they touch glasses The waiter pours the sherry as Eddie and Sarah stare at each other over their glasses until Eddie looks away The waiter returns with a bottle of sherry for Eddie's approval leading to a long pause before Eddie responds A waiter approaches and Sarah suddenly laughs The headwaiter seats them and they exchange smiles Sarah wears a new dress while Eddie looking a little uneasy wears a suit and tie Later Eddie and Sarah enter a quiet elegant restaurant with soft piano music and subdued lighting a place they passed on the day they first met Eddie flexes his fingers and tries a shot on Johnny's pool table using an open hand bridge for support as Bert Gordon enters and watches him play smiling at Eddie When the door opens he holds up his hands boyishly and a woman kisses them He knocks on a door with his wrist as if the casts were still on In the movie a man stops to look at his hands and realizes the casts are off"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He knocks on a door with his wrist as if the casts were still on In the movie a man stops to look at his hands and realizes the casts are off Eddie flexes his fingers and tries a shot on Johnny's pool table using an open hand bridge for support as Bert Gordon enters and watches him play smiling at Eddie When the door opens he holds up his hands boyishly and a woman kisses them Sarah wears a new dress while Eddie looking a little uneasy wears a suit and tie Later Eddie and Sarah enter a quiet elegant restaurant with soft piano music and subdued lighting a place they passed on the day they first met A waiter approaches and Sarah suddenly laughs The headwaiter seats them and they exchange smiles The waiter pours the sherry as Eddie and Sarah stare at each other over their glasses until Eddie looks away The waiter returns with a bottle of sherry for Eddie's approval leading to a long pause before Eddie responds The waiter brings the check and Eddie nods drinking the last of his brandy Sarah proposes a toast and they touch glasses Sarah notices Eddie's somber demeanor and picking up her purse and gloves as the waiter leaves It is raining heavily as Sarah emerges from the building leaning wearily against the awning she leaves Sarah angrily breaks away and walks into the rain but Eddie pulls her back under the awning and they enter a building both drenched Eddie quickly pays the bill and follows her catching up to take her by the arm and stepping out to hail a cab Bert Gordon leans on a cab his expression dropping at the sight of Eddie and Sarah approaching She walks to a chair limping noticeably and he reaches over to pull her close burying his face in her head Sarah and Bert then squeeze through the door of a train compartment as a redcap exits with their luggage and Eddie shuts the door with Bert and Sarah sitting across from each other Eddie carries two suitcases and a leather cue case setting the suitcases on the curb for the cab driver to take Bert courteously opens the taxi door and Sarah eyes Bert distrustfully as she gets in Eddie"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The waiter brings the check and Eddie nods drinking the last of his brandy as the waiter leaves Sarah notices Eddie's somber demeanor and picking up her purse and gloves she leaves It is raining heavily as Sarah emerges from the building leaning wearily against the awning Eddie quickly pays the bill and follows her catching up to take her by the arm and stepping out to hail a cab Sarah angrily breaks away and walks into the rain but Eddie pulls her back under the awning and they enter a building both drenched She walks to a chair limping noticeably and he reaches over to pull her close burying his face in her head Bert Gordon leans on a cab his expression dropping at the sight of Eddie and Sarah approaching Eddie carries two suitcases and a leather cue case setting the suitcases on the curb for the cab driver to take Bert courteously opens the taxi door and Sarah eyes Bert distrustfully as she gets in Eddie Sarah and Bert then squeeze through the door of a train compartment as a redcap exits with their luggage and Eddie shuts the door with Bert and Sarah sitting across from each other In the movie a man stops to look at his hands and realizes the casts are off He knocks on a door with his wrist as if the casts were still on When the door opens he holds up his hands boyishly and a woman kisses them Eddie flexes his fingers and tries a shot on Johnny's pool table using an open hand bridge for support as Bert Gordon enters and watches him play smiling at Eddie Later Eddie and Sarah enter a quiet elegant restaurant with soft piano music and subdued lighting a place they passed on the day they first met Sarah wears a new dress while Eddie looking a little uneasy wears a suit and tie The headwaiter seats them and they exchange smiles A waiter approaches and Sarah suddenly laughs The waiter returns with a bottle of sherry for Eddie's approval leading to a long pause before Eddie responds The waiter pours the sherry as Eddie and Sarah stare at each other over their glasses until Eddie looks away Sarah proposes a toast and they touch glasses"
        }
      ]
    }
  ]
}