{
  "ground_truth": "The Kentucky-bound train rolls down the track while Bert and Eddie finish their breakfast coffee in the dining room. Sarah is in the washroom and then makes her way down the aisle to join them at the table, where she stands silently, absorbing an insult. Bert gets up and reaches into his pocket for his billfold as Eddie and Sarah just stare at him. Later, they are at a table sipping drinks, with Bert shuffling a deck of cards as he talks and Eddie, like a schoolboy, listening intently, while Sarah sits apart, watching them both. Eddie glances at Sarah, who stares mutely at Bert, and then he reaches across to light Bert's cigarette with the lighter Sarah gave him while Bert's own lighter is on the table before him. Sarah sees it, picks it up, and sparks it into flame as Bert goes back to shuffling his deck of cards. The lobby is thronged with gamblers, their women, sportsmen, and tourists, all there for the Derby, with a jazz combo audible over the din of their voices. Eddie, looking excited, leads Sarah through the crowd with Bert behind them, his face now shaded by dark glasses, as he follows a bellhop to the main desk, forcing his way through people to get there and displaying a neatly folded wad of money in his hand. Eddie laughs and moves toward the open door leading to the billiard rooms, his face glowing as he watches the flow of men moving in and out of the crowded room, and hears the sound of clicking pool balls while tucking his cue case under his arm. He then turns to Bert and Sarah, who join him, before Sarah turns toward the elevators with Bert behind her, jiggling his keys. The bellboy unlocks the door, allowing Sarah to enter as the doors to the other suite are open. As she catches sight of Bert arranging things with the bellboy, she closes one door, and the bellboy leaves as she moves to close the other. Bert comes to the door, holding it open, and then turns away, leading to a long pause as he glares at her before going back into his room. Sarah closes the door and leans against it as screams are heard while the horses jerk out of the starting gate to begin their runs. Eddie cashes in a winning ticket and moves through the ornate racetrack bar to join Sarah at a table, where she has been drinking. As she puts the money in her purse, Bert sits down, and we see Findley studying his program and holding a drink, appearing tall and refined, with a pale, debauched, yet oddly youthful face that some men over forty sometimes have, while a cork-tipped cigarette dangles from his fingers.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The Kentucky-bound locomotive rolls down the rail while Bert and Eddie conclude their morning beverage in the dining chamber. Sarah is in the lavatory and then makes her path down the corridor to join them at the table, where she stands wordlessly, absorbing an affront. Bert rises and reaches into his pocket for his wallet as Eddie and Sarah just gaze at him. Later, they are at a table sipping beverages, with Bert shuffling a pack of cards as he converses and Eddie, like a schoolboy, listening attentively, while Sarah sits apart, observing them both. Eddie glances at Sarah, who stares silently at Bert, and then he reaches across to light Bert's cigarette with the lighter Sarah gave him while Bert's own lighter is on the table before him. Sarah sees it, picks it up, and ignites it into flame as Bert goes back to shuffling his pack of cards. The foyer is thronged with gamblers, their women, sportsmen, and sightseers, all there for the Derby, with a jazz ensemble audible over the clamor of their voices. Eddie, looking exhilarated, leads Sarah through the crowd with Bert behind them, his face now shaded by dark spectacles, as he follows a bellhop to the main counter, forcing his path through people to get there and displaying a neatly folded bundle of currency in his hand. Eddie laughs and moves toward the open entrance leading to the billiard chambers, his face glowing as he watches the flow of men moving in and out of the crowded room, and hears the sound of clicking pool balls while tucking his cue case under his arm. He then turns to Bert and Sarah, who join him, before Sarah turns toward the elevators with Bert behind her, jiggling his keys. The bellboy unlocks the door, allowing Sarah to enter as the doors to the other suite are open. As she catches sight of Bert arranging things with the bellboy, she closes one door, and the bellboy departs as she moves to close the other. Bert comes to the door, holding it ajar, and then turns aside, leading to a long break as he glares at her before going back into his chamber. Sarah closes the door and leans against it as cries are heard while the horses jerk out of the starting gate to commence their runs. Eddie cashes in a winning voucher and moves through the ornate racetrack bar to join Sarah at a table, where she has been imbibing. As she puts the currency in her handbag, Bert sits down, and we see Findley studying his program and holding a beverage, appearing tall and refined, with a pale, debauched, yet oddly youthful visage that some men over forty sometimes have, while a cork-tipped cigarette dangles from his fingers."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The train headed for Kentucky is rolled down the track by the conductor while breakfast coffee is finished by Bert and Eddie in the dining room. Sarah is washing in the washroom and then makes her way down the aisle to join them at the table, where an insult is absorbed by her silently. Bert gets up, and a reach into his pocket is made for his billfold as he is stared at by Eddie and Sarah. Later, drinks are sipped at a table by them, with a deck of cards being shuffled by Bert as he talks, and Eddie, like a schoolboy, listens intently, while they are watched by Sarah, who sits apart. Sarah is glanced at by Eddie, while Bert is stared at mutely by her, and then Bert's cigarette is lit by Eddie with the lighter that was given to him by Sarah while Bert's own lighter is on the table before him. It is seen by Sarah, picked up, and sparked into flame by her as Bert goes back to card shuffling. The lobby throngs with gamblers, their women, sportsmen, and tourists, all gathered there for the Derby, with a jazz combo heard over the din of their voices. Eddie, looking excited, leads Sarah through the crowd, and Bert is behind them, his face shaded by dark glasses, as a bellhop is followed by him to the main desk, forcing his way through people to get there, and displays a neatly folded wad of money in his hand. Eddie laughs and moves toward the open door leading to the billiard rooms, his face glowing as the flow of men moving in and out of the crowded room is watched by him, and the sound of clicking pool balls is heard while his cue case is tucked under his arm. He then turns to Bert and Sarah, who join him, before the elevators are turned toward by Sarah with Bert behind her, keys jiggling. The door is unlocked by the bellboy, allowing Sarah to enter as the doors to the other suite are open. Bert is caught sight of by her while he arranges things with the bellboy, and one door is closed by her, and the bellboy leaves as she moves to close the other. The door is approached by Bert, held open, and then he turns away, leading to a long pause as she is glared at by him before his room is re-entered. Sarah closes the door and leans against it as screams are heard while the horses jerk out of the starting gate to begin their runs. A winning ticket is cashed in by Eddie, and through the ornate racetrack bar, he moves to join Sarah at a table, where drinks have been had by her. As the money is put into her purse by her, Bert sits down, and Findley is seen studying his program and holding a drink, appearing tall and refined, with a pale, debauched, yet oddly youthful face that some men over forty sometimes have, while a cork-tipped cigarette dangles from his fingers."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The Kentucky-bound train rolls down the track as Bert and Eddie finish their breakfast coffee. Sarah joins them after leaving the washroom and silently endures an insult. Bert stands and searches for his billfold, while Eddie and Sarah watch. Later, they are drinking at a table with Bert shuffling cards and Eddie, attentive like a schoolboy. Sarah observes them quietly, and Eddie lights Bert's cigarette with Sarah's lighter, though Bert's lighter is on the table. Sarah lights it before Bert resumes shuffling. The lobby is bustling with gamblers, sportsmen, and tourists for the Derby, with a jazz combo playing. Eddie, excited, leads Sarah through the crowd, with Bert, wearing dark glasses, behind them. Bert follows a bellhop to the main desk, displaying a neat wad of cash. Eddie laughs, heading towards the billiard rooms, listening to the pool balls and carrying his cue. He turns to Bert and Sarah, who join him before Sarah heads to the elevators, with Bert jingling his keys. A bellboy unlocks a door for Sarah as Bert arranges things, but she closes it when the bellboy leaves. Bert holds the door open, glares at her, and retreats into his room. Sarah leans against the door as horses start their race. Eddie cashes a winning ticket and joins Sarah at the racetrack bar. She puts money in her purse as Bert sits down, and Findley, appearing refined with a cork-tipped cigarette, studies his program."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The Kentucky-bound train rolls as Bert and Eddie finish breakfast coffee. Sarah joins them, enduring an insult. Bert pays while Eddie and Sarah watch. Later, they sip drinks; Bert shuffles cards, Eddie listens intently, and Sarah observes silently. Eddie lights Bert's cigarette with Sarah's lighter, though Bert's is on the table; Sarah ignites it. The lobby buzzes with gamblers, women, sportsmen, and tourists for the Derby, jazz playing. Eddie, excited, leads Sarah through the crowd, with Bert shaded by sunglasses following to the main desk, showing money. Eddie heads to the billiard rooms, cue case in hand, and joins Bert and Sarah before she heads to the elevators with Bert, jangling keys. The bellboy opens the suite; as Sarah watches Bert with the bellboy, she closes the door after his glare. Screams are heard as the race starts. Eddie cashes a winning ticket and joins Sarah at the bar, where Bert sits as Findley, pale and youthful, studies his program with a cigarette dangling."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The train destined for Kentucky steadily rolls down the track as Bert and Eddie finish their breakfast coffee in the cozy dining room. Meanwhile, Sarah, having been in the washroom, meticulously makes her way down the narrow aisle to join them at their table. She stands silently, absorbing an unexpected insult. Bert, with a deliberate motion, stands up and reaches into his pocket to retrieve his billfold, while Eddie and Sarah do nothing but stare at him in silence. Later on during their journey, they find themselves sitting at another table, leisurely sipping on their drinks. Bert is intently shuffling a deck of cards as he talks, with Eddie, resembling an eager schoolboy, listening intently. Sarah is seated apart, watching them both with quiet contemplation. Eddie’s eyes shift towards Sarah, who continues to stare mutely at Bert, and then he reaches across the table to light Bert's cigarette, using the lighter that Sarah had given him as a gift, even though Bert's own lighter sits idly on the table in front of him. Sarah notices the lighter, picks it up, and flicks it into flame, all the while Bert resumes his card shuffling. \n\nElsewhere, the hotel lobby is bustling with activity, filled with gamblers, their companions, sportsmen, and tourists, all gathered there for the grand Derby. The lively sound of a jazz combo competes with the energetic buzz of their voices. Among the throng, Eddie, visibly excited, leads Sarah through the crowd with Bert following closely behind. Bert's face is now shaded by dark glasses, adding an air of mystery, as he trails a bellhop to the main desk. He pushes through the gathered crowd to reach the desk, prominently displaying a neatly folded wad of money in his hand. Eddie laughs heartily as he moves toward the open door that leads to the billiard rooms, his face glowing with anticipation as he observes the steady flow of men moving in and out of the crowded space. The sound of clicking pool balls fills the air as he tucks his cue case securely under his arm. He then turns to Bert and Sarah, who have now joined him. As Sarah turns towards the elevators, with Bert trailing behind her, jingling his keys, the scene shifts. The bellboy unlocks the door, allowing Sarah to step inside as the doors to the other suite stand open. She catches sight of Bert coordinating with the bellboy and proceeds to close one door. After the bellboy departs, she moves to shut the other door. Bert approaches, holding it open for a moment, before turning away. An extended pause hangs in the air as he glares at her before retreating back into his room. Sarah closes the door completely and leans against it as screams resonate from outside, signaling that the horses have jerked out of the starting gate to begin their race. Meanwhile, Eddie cashes in a winning ticket and makes his way through the decorative racetrack bar to join Sarah at a table, where she has been quietly drinking. As she places the money into her purse, Bert sits down beside her. Observing the scene is Findley, who studies his program while holding a drink. He appears tall and refined, possessing a pale, debauched, yet curiously youthful face—a look that some men over forty sometimes acquire. A cork-tipped cigarette dangles nonchalantly from his fingers."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The train bound for the scenic landscapes of Kentucky steadily rolls down the tracks as Bert and Eddie leisurely finish their breakfast coffee in the cozy, inviting dining room. In the meantime, Sarah, having spent some time in the washroom, meticulously navigates her way along the narrow, bustling aisle to rejoin them at their familiar table. She stands there silently, absorbing with surprise an unexpected insult. With a deliberate and purposeful motion, Bert stands up and reaches into his pocket to retrieve his billfold, while Eddie and Sarah remain seated, doing nothing but fixing their eyes on him in stunned silence. As the journey progresses, the trio finds themselves comfortably seated at another table, leisurely sipping on their chosen drinks. Bert is intensely focused as he shuffles a deck of cards, talking animatedly, with Eddie, resembling an eager schoolboy, listening intently and hanging onto his every word. Sarah sits slightly apart, observing them both with quiet contemplation and reflection. Eddie's curious eyes shift discretely towards Sarah, who continues to stare mutely and intently at Bert. He reaches across the table to light Bert's cigarette, using the lighter that Sarah had thoughtfully gifted him, even though Bert's own lighter lies idle and unused on the table in front of him. With a keen sense of awareness, Sarah notices the lighter, picks it up with a smooth motion, and flicks it into flame, all the while, Bert nonchalantly resumes his card shuffling with focused intent.\n\nIn another bustling part of town, the hotel lobby is alive with activity and filled to the brim with an eclectic mix of gamblers, their colorful companions, enthralled sportsmen, and eager tourists, all gathered there with excitement for the grand Derby event. The lively, rhythmic sound of a jazz combo competes with the energetic buzz of animated voices. Amongst this vibrant throng, Eddie, visibly bubbling with excitement, leads Sarah with enthusiasm through the crowd, with Bert following closely behind. Bert's face is now partially obscured by dark, stylish glasses, adding an intriguing air of mystery as he trails a bellhop to the main hotel desk. He pushes through the gathered crowd to reach the desk, prominently displaying a neatly folded wad of cash in his hand, catching the attention of onlookers. Eddie laughs heartily, his face glowing with anticipation and excitement, as he makes his way toward the open door that leads to the billiard rooms, observing the steady flow of men moving in and out of the crowded space. The sound of clicking pool balls fills the atmosphere as he tucks his cue case securely and confidently under his arm. He subsequently turns to Bert and Sarah, who have now caught up with him. As Sarah turns towards the gleaming elevators, with Bert trailing not far behind her, jingling his keys with a familiar sound, the scene subtly shifts. The bellboy dutifully unlocks the door, allowing Sarah to step gracefully inside as the doors to the other suite stand open. She catches a glimpse of Bert coordinating with the bellboy and proceeds to close one of the doors. After the courteous bellboy departs, she moves decisively to shut the other door. Bert approaches, holding it open for a significant moment, before turning away with a glance. An extended, charged pause hangs in the air as he glares at her before retreating back into his room. Sarah closes the door completely and leans against it thoughtfully as screams resonate from outside, signaling that the powerful horses have jerked out of the starting gate to begin their thrilling race. Meanwhile, Eddie cashes in a winning ticket and confidently makes his way through the decorative racetrack bar to join Sarah at a table, where she has been sitting quietly, absorbed in her drink. As she carefully places the money into her purse, Bert settles down beside her. Observing the unfolding scene is Findley, who studies his program with interest while holding a drink. He appears tall and refined, possessing a pale, debauched, yet curiously youthful face—a look that some men over forty sometimes acquire. A cork-tipped cigarette dangles nonchalantly from his fingers as he surveys the lively scene."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the Kentucky-bound train smoothly rolls down the track, Bert and Eddie sit comfortably in the dining room, finishing up their breakfast coffee. Meanwhile, Sarah is in the washroom. After completing her business there, she makes her way down the narrow aisle of the train, carefully navigating the space, until she reaches the table where Bert and Eddie are seated. She stands silently by the table, taking in the atmosphere and then absorbing an insult directed at her. Bert then rises from his seat and reaches into his pocket, feeling around until he finds his billfold, while Eddie and Sarah remain seated, silently watching his actions. Later, the scene shifts, and they are all gathered around another table, casually sipping drinks. Bert holds a deck of cards in his hands, shuffling them with practiced ease as he engages in conversation. Eddie, resembling a keen schoolboy, listens with full attention, absorbing every word, while Sarah sits slightly apart from them, observing the two men. Eddie, after a moment, steals a glance at Sarah, noticing her fixed stare directed mutely at Bert. He then reaches across the table to light Bert's cigarette using a lighter that Sarah had previously given him, despite Bert's own lighter sitting idly on the table before him. Sarah notices the unattended lighter, picks it up, and with a quick flick, sparks it into a flame, her eyes still on Bert as he returns to shuffling his cards. The setting shifts to a bustling lobby crowded with gamblers, their companions, sportsmen, and tourists, all gathered with excitement for the Derby, while the vibrant sounds of a jazz combo float above the chatter. Eddie, visibly excited, takes the lead, guiding Sarah through the dense crowd with Bert following closely behind, his face partly obscured by dark glasses. As they navigate through, Bert follows a bellhop to the main desk, assertively pushing through the throng, prominently displaying a neatly folded wad of money in his hand, signaling his intent. Eddie, laughing jovially, heads toward the open door that leads to the billiard rooms, his face lit up with enthusiasm as he watches the continuous movement of men entering and leaving the crowded space, all to the rhythmic sound of clicking pool balls. He securely tucks his cue case under his arm, ensuring it's snug, and turns to face Bert and Sarah, who catch up to him. Then, Sarah turns toward the elevators, with Bert following behind, his keys jiggling in his hand as he walks. The bellboy unlocks the suite door, allowing Sarah to step inside, while the adjoining suite's doors remain open. As she catches a glimpse of Bert involved in a discussion with the bellboy about arrangements, she takes action to close one of the doors, causing the bellboy to exit. Sarah moves to close the other door, creating a more private space. Bert approaches the door, holding it open for a moment before turning away. A long, tense pause follows as he casts a glare at her, filled with unspoken words, before retreating back to his room. Finally, Sarah closes the door and leans heavily against it, her mind a flurry of thoughts, as outside, the shouts of excitement rise, marking the moment the horses jerk from the starting gate to commence their race. In the aftermath, Eddie successfully cashes in a winning ticket, his mood buoyant, striding through the ornate racetrack bar until he joins Sarah, who is seated at a table, having a drink. As she calmly places the money into her purse, Bert joins them, sitting down to share the moment. Nearby, Findley is absorbed in studying his program, a drink in hand. He strikes a refined figure, tall and composed, with a face that combines a pale, debauched air with an unusual youthful appearance, often seen in some men over forty, while a cork-tipped cigarette dangles nonchalantly from his fingers."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The Kentucky-bound train rolls down the track as Bert and Eddie finish their breakfast coffee, while Sarah leaves the washroom and absorbs an insult in silence upon joining them. Bert prepares to pay, prompting Eddie and Sarah to watch him. Later, they sit together sipping drinks while Bert shuffles cards and talks, capturing Eddie's schoolboy attention as Sarah observes them quietly from a distance. Eddie lights Bert's cigarette with a lighter that Sarah had given him, even though Bert’s own lighter rests on the table. Sarah picks up Bert’s lighter, ignites it, and watches Bert continue shuffling. The lobby buzzes with gamblers, tourists, and sports enthusiasts gathered for the Derby, accompanied by jazz music. Eddie, filled with excitement, leads Sarah through the crowd with Bert following, shaded by dark glasses and carrying a neatly folded wad of money. They make their way to the main desk behind a bellhop. Eddie laughs and heads toward the billiard rooms, energized by the sound of clicking pool balls and the excited crowd, and tucks his cue case under his arm. He reconnects with Bert and Sarah, and they head toward the elevators, with Sarah going first and Bert behind, jingling keys. Sarah enters the suite as Bert arranges things with the bellboy, then closes the door after the bellboy leaves. Bert follows, leading to a tense moment before he retreats into his room. Sarah leans against the door while the race begins outside with audible cheers. Eddie celebrates a win by cashing in a ticket and joins Sarah, who has been drinking at a table. As she pockets the money, Bert arrives, and nearby, Findley, appearing tall and refined, studies his program with a drink in hand, displaying a pale, debauched, yet youthful face, while a cork-tipped cigarette dangles from his fingers."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The early morning Kentucky-bound train, part of the well-known Bluegrass Express traversing lush landscapes, rolls down the track while Bert and Eddie finish their breakfast coffee in the dining room. Sarah is in the washroom, a cramped space typical of mid-20th-century train cars, and then makes her way down the aisle to join them at the table, where she stands silently, absorbing an insult that seemed to echo the tension often brewing among travelers on long journeys. Bert gets up and reaches into his pocket for his billfold, which bulges slightly with the winnings from yesterday’s poker game at the casino, as Eddie and Sarah just stare at him. Later, they are at a table sipping drinks, with Bert shuffling a deck of cards as he talks, showcasing the well-practiced skill of a seasoned card player, and Eddie, like a schoolboy caught up in admiration, listening intently, while Sarah sits apart, watching them both. Eddie glances at Sarah, who stares mutely at Bert, and then he reaches across to light Bert's cigarette with the lighter Sarah gave him, a vintage Zippo model from the 1950s, while Bert's own lighter is on the table before him. Sarah sees it, picks it up, and sparks it into flame just as the train gives a slight lurch, as Bert goes back to shuffling his deck of cards. The lobby is thronged with gamblers, their women, sportsmen, and tourists, all there for the Derby, that grand spectacle in Louisville known for its pageantry and tradition, with a jazz combo audible over the din of their voices. Eddie, looking excited, leads Sarah through the crowd with Bert behind them, his face now shaded by dark glasses that could barely hide a gambler's tells, as he follows a bellhop to the main desk, forcing his way through people to get there and displaying a neatly folded wad of money in his hand, likely a promise of generous tipping. Eddie laughs and moves toward the open door leading to the billiard rooms, his face glowing as he watches the flow of men moving in and out of the crowded room, drawn by the allure of high-stakes games, and hears the sound of clicking pool balls while tucking his cue case, the one he inherited from his father, under his arm. He then turns to Bert and Sarah, who join him, before Sarah turns toward the elevators with Bert behind her, jiggling his keys, perhaps a nervous habit developed over years of hustling. The bellboy unlocks the door, allowing Sarah to enter as the doors to the other suite, rumored to be the choice of celebrity guests, are open. As she catches sight of Bert arranging things with the bellboy, she closes one door, and the bellboy leaves as she moves to close the other. Bert comes to the door, holding it open with an air of defiance, and then turns away, leading to a long pause as he glares at her with the practiced intimidation of a man used to getting his way, before going back into his room. Sarah closes the door and leans against it as screams are heard while the horses, bred from world-renowned Kentucky thoroughbreds, jerk out of the starting gate to begin their runs. Eddie cashes in a winning ticket, the result of a keen eye for promising young colts, and moves through the ornate racetrack bar, a place with intricate woodwork and brass fittings, to join Sarah at a table, where she has been drinking. As she puts the money in her purse, Bert sits down, and we see Findley studying his program and holding a drink, appearing tall and refined, with a pale, debauched, yet oddly youthful face that some men over forty sometimes have, while a cork-tipped cigarette dangles from his fingers, a style favored by discerning smokers of the era."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The Kentuckybound train rolls down the track while Bert and Eddie finish their breakfast coffee in the dining room. Sarah is in the washroom and then makes her way down the aisle to join them at the table where she stands silently absorbing an insult. Bert gets up and reaches into his pocket for his billfold as Eddie and Sarah just stare at him. Later they are at a table sipping drinks with Bert shuffling a deck of cards as he talks and Eddie like a schoolboy listening intently while Sarah sits apart watching them both. Eddie glances at Sarah who stares mutely at Bert and then he reaches across to light Bert's cigarette with the lighter Sarah gave him while Bert's own lighter is on the table before him. Sarah sees it picks it up and sparks it into flame as Bert goes back to shuffling his deck of cards. The lobby is thronged with gamblers their women sportsmen and tourists all there for the Derby with a jazz combo audible over the din of their voices. Eddie looking excited leads Sarah through the crowd with Bert behind them his face now shaded by dark glasses as he follows a bellhop to the main desk forcing his way through people to get there and displaying a neatly folded wad of money in his hand. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. Eddie laughs and moves toward the open door leading to the billiard rooms his face glowing as he watches the flow of men moving in and out of the crowded room and hears the sound of clicking pool balls while tucking his cue case under his arm. He then turns to Bert and Sarah who join him before Sarah turns toward the elevators with Bert behind her jiggling his keys. The bellboy unlocks the door allowing Sarah to enter as the doors to the other suite are open. As she catches sight of Bert arranging things with the bellboy she closes one door and the bellboy leaves as she moves to close the other. Bert comes to the door holding it open and then turns away leading to a long pause as he glares at her before going back into his room. Sarah closes the door and leans against it as screams are heard while the horses jerk out of the starting gate to begin their runs. Eddie cashes in a winning ticket and moves through the ornate racetrack bar to join Sarah at a table where she has been drinking. As she puts the money in her purse Bert sits down and we see Findley studying his program and holding a drink appearing tall and refined with a pale debauched yet oddly youthful face that some men over forty sometimes have while a corktipped cigarette dangles from his fingers."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The Kentuckybound train rolls down the track while Bert and Eddie finish their breakfast coffee in the dining room. Sarah is in the washroom and then makes her way down the aisle to join them at the table where she stands silently absorbing an insult. Bert gets up and reaches into his pocket for his billfold as Eddie and Sarah just stare at him. Later they are at a table sipping drinks with Bert shuffling a deck of cards as he talks and Eddie like a schoolboy listening intently while Sarah sits apart watching them both. Eddie glances at Sarah who stares mutely at Bert and then he reaches across to light Bert's cigarette with the lighter Sarah gave him while Bert's own lighter is on the table before him. Sarah sees it picks it up and sparks it into flame as Bert goes back to shuffling his deck of cards. The lobby is thronged with gamblers their women sportsmen and tourists all there for the Derby with a jazz combo audible over the din of their voices. Eddie looking excited leads Sarah through the crowd with Bert behind them his face now shaded by dark glasses as he follows a bellhop to the main desk forcing his way through people to get there and displaying a neatly folded wad of money in his hand. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Eddie laughs and moves toward the open door leading to the billiard rooms his face glowing as he watches the flow of men moving in and out of the crowded room and hears the sound of clicking pool balls while tucking his cue case under his arm. He then turns to Bert and Sarah who join him before Sarah turns toward the elevators with Bert behind her jiggling his keys. The bellboy unlocks the door allowing Sarah to enter as the doors to the other suite are open. As she catches sight of Bert arranging things with the bellboy she closes one door and the bellboy leaves as she moves to close the other. Bert comes to the door holding it open and then turns away leading to a long pause as he glares at her before going back into his room. Sarah closes the door and leans against it as screams are heard while the horses jerk out of the starting gate to begin their runs. Eddie cashes in a winning ticket and moves through the ornate racetrack bar to join Sarah at a table where she has been drinking. As she puts the money in her purse Bert sits down and we see Findley studying his program and holding a drink appearing tall and refined with a pale debauched yet oddly youthful face that some men over forty sometimes have while a corktipped cigarette dangles from his fingers."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The Kentuckybound train rolls down the track while Bert and Eddie finish their breakfast coffee in the dining room. Sarah is in the washroom and then makes her way down the aisle to join them at the table where she stands silently absorbing an insult. Bert gets up and reaches into his pocket for his billfold as Eddie and Sarah just stare at him. Later they are at a table sipping drinks with Bert shuffling a deck of cards as he talks and Eddie like a schoolboy listening intently while Sarah sits apart watching them both. Bert comes to the door holding it open and then turns away leading to a long pause as he glares at her before going back into his room. Sarah closes the door and leans against it as screams are heard while the horses jerk out of the starting gate to begin their runs. Eddie cashes in a winning ticket and moves through the ornate racetrack bar to join Sarah at a table where she has been drinking. As she puts the money in her purse Bert sits down and we see Findley studying his program and holding a drink appearing tall and refined with a pale debauched yet oddly youthful face that some men over forty sometimes have while a corktipped cigarette dangles from his fingers."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The Kentuckybound train rolls down the track while Bert and Eddie finish their breakfast coffee in the dining room. Sarah is in the washroom and then makes her way down the aisle to join them at the table where she stands silently absorbing an insult. Eddie cashes in a winning ticket and moves through the ornate racetrack bar to join Sarah at a table where she has been drinking. As she puts the money in her purse Bert sits down and we see Findley studying his program and holding a drink appearing tall and refined with a pale debauched yet oddly youthful face that some men over forty sometimes have while a corktipped cigarette dangles from his fingers."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The Florida-bound bicycle glides along the sidewalk while Milo and Lucy finish their morning tea in the greenhouse. Helen is in the study and then makes her way down the corridor to join them at the bench, where she stands quietly, receiving a compliment. Milo gets up and reaches into his bag for his umbrella as Lucy and Helen just gaze at him. Later, they are on a bench sipping lemonade, with Milo assembling a jigsaw puzzle as he doodles and Lucy, like a teacher, observing intently, while Helen sits apart, inspecting them both. Lucy peeks at Helen, who gazes wordlessly at Milo, and then she reaches across to slice Milo's apple with the knife Helen handed her while Milo's own knife is on the table before him. Helen notices it, picks it up, and slices an orange as Milo goes back to assembling his jigsaw puzzle. The atrium is packed with artists, their muses, historians, and travelers, all there for the Exhibit, with a string quartet audible over the murmur of their conversations. Lucy, looking thrilled, guides Helen through the throng with Milo behind them, his face now hidden by a wide-brimmed hat, as he follows a concierge to the main kiosk, maneuvering his way through people to get there and displaying a neatly folded map in his hand. Lucy chuckles and moves toward the open gate leading to the reading lounges, her eyes sparkling as she observes the flow of women moving in and out of the bustling lounge, and hears the clatter of turning pages while cradling her sketchbook under her arm. She then turns to Milo and Helen, who join her, before Helen turns toward the staircases with Milo trailing her, jingling his coins. The attendant opens the panel, allowing Helen to step through as the entrances to the adjacent gallery are open. As she catches sight of Milo arranging items with the attendant, she closes one entryway, and the attendant departs as she proceeds to shut the other. Milo approaches the entry, holding it ajar, and then turns away, leading to a lingering silence as he scowls at her before retreating into his alcove. Helen closes the entry and leans against it as murmurs are heard while the sailboats dart out of the starting dock to begin their races. Lucy redeems a winning coupon and meanders through the ornate café foyer to join Helen at a booth, where she has been doodling. As she puts the coupons in her handbag, Milo sits down, and we see Grover examining his pamphlet and holding a scone, appearing tall and elegant, with a pale, indulgent, yet oddly vibrant visage that some women over thirty sometimes have, while a pencil sits between his fingers."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The Kentucky-bound train rolls onward as Bert and Eddie finish breakfast. Sarah joins them at the table, silently enduring an insult. Later, Bert shuffles cards while talking with Eddie, who lights Bert's cigarette using Sarah's gift lighter. Sarah notices this, ignites Bert's lighter, and observes them. The hotel lobby is bustling with Derby attendees, and Eddie, thrilled, leads Sarah through the crowd, with Bert following. Eddie, excited by the billiard room's activity, moves with his cue case, joined by Bert and Sarah. At the elevators, Sarah goes ahead, and Bert follows. In the suite, Bert deals with the bellboy, and Sarah closes the door. Bert glares at her before retreating to his room, leaving Sarah leaning against the door as race screams ensue. Eddie wins a bet and finds Sarah drinking at a racetrack bar. As Sarah stores the money, Bert arrives, and Findley, a refined but debauched-looking man, is seen studying his program with a cigarette in hand."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "As she puts the money in her purse Bert sits down and we see Findley studying his program and holding a drink appearing tall and refined with a pale debauched yet oddly youthful face that some men over forty sometimes have while a corktipped cigarette dangles from his fingers Eddie cashes in a winning ticket and moves through the ornate racetrack bar to join Sarah at a table where she has been drinking Sarah closes the door and leans against it as screams are heard while the horses jerk out of the starting gate to begin their runs Bert comes to the door holding it open and then turns away leading to a long pause as he glares at her before going back into his room As she catches sight of Bert arranging things with the bellboy she closes one door and the bellboy leaves as she moves to close the other The bellboy unlocks the door allowing Sarah to enter as the doors to the other suite are open He then turns to Bert and Sarah who join him before Sarah turns toward the elevators with Bert behind her jiggling his keys Eddie laughs and moves toward the open door leading to the billiard rooms his face glowing as he watches the flow of men moving in and out of the crowded room and hears the sound of clicking pool balls while tucking his cue case under his arm Eddie looking excited leads Sarah through the crowd with Bert behind them his face now shaded by dark glasses as he follows a bellhop to the main desk forcing his way through people to get there and displaying a neatly folded wad of money in his hand The lobby is thronged with gamblers their women sportsmen and tourists all there for the Derby with a jazz combo audible over the din of their voices Sarah sees it picks it up and sparks it into flame as Bert goes back to shuffling his deck of cards Eddie glances at Sarah who stares mutely at Bert and then he reaches across to light Bert's cigarette with the lighter Sarah gave him while Bert's own lighter is on the table before him Later they are at a table sipping drinks with Bert shuffling a deck of cards as he talks and Eddie like a schoolboy listening intently while Sarah sits apart watching them both Bert gets up and reaches into his pocket for his billfold as Eddie and Sarah just stare at him Sarah is in the washroom and then makes her way down the aisle to join them at the table where she stands silently absorbing an insult The Kentuckybound train rolls down the track while Bert and Eddie finish their breakfast coffee in the dining room"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Sarah is in the washroom and then makes her way down the aisle to join them at the table where she stands silently absorbing an insult The Kentuckybound train rolls down the track while Bert and Eddie finish their breakfast coffee in the dining room Later they are at a table sipping drinks with Bert shuffling a deck of cards as he talks and Eddie like a schoolboy listening intently while Sarah sits apart watching them both Bert gets up and reaches into his pocket for his billfold as Eddie and Sarah just stare at him Sarah sees it picks it up and sparks it into flame as Bert goes back to shuffling his deck of cards Eddie glances at Sarah who stares mutely at Bert and then he reaches across to light Bert's cigarette with the lighter Sarah gave him while Bert's own lighter is on the table before him Eddie looking excited leads Sarah through the crowd with Bert behind them his face now shaded by dark glasses as he follows a bellhop to the main desk forcing his way through people to get there and displaying a neatly folded wad of money in his hand The lobby is thronged with gamblers their women sportsmen and tourists all there for the Derby with a jazz combo audible over the din of their voices He then turns to Bert and Sarah who join him before Sarah turns toward the elevators with Bert behind her jiggling his keys Eddie laughs and moves toward the open door leading to the billiard rooms his face glowing as he watches the flow of men moving in and out of the crowded room and hears the sound of clicking pool balls while tucking his cue case under his arm As she catches sight of Bert arranging things with the bellboy she closes one door and the bellboy leaves as she moves to close the other The bellboy unlocks the door allowing Sarah to enter as the doors to the other suite are open Sarah closes the door and leans against it as screams are heard while the horses jerk out of the starting gate to begin their runs Bert comes to the door holding it open and then turns away leading to a long pause as he glares at her before going back into his room As she puts the money in her purse Bert sits down and we see Findley studying his program and holding a drink appearing tall and refined with a pale debauched yet oddly youthful face that some men over forty sometimes have while a corktipped cigarette dangles from his fingers Eddie cashes in a winning ticket and moves through the ornate racetrack bar to join Sarah at a table where she has been drinking"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Eddie laughs and moves toward the open door leading to the billiard rooms his face glowing as he watches the flow of men moving in and out of the crowded room and hears the sound of clicking pool balls while tucking his cue case under his arm He then turns to Bert and Sarah who join him before Sarah turns toward the elevators with Bert behind her jiggling his keys The bellboy unlocks the door allowing Sarah to enter as the doors to the other suite are open As she catches sight of Bert arranging things with the bellboy she closes one door and the bellboy leaves as she moves to close the other Bert comes to the door holding it open and then turns away leading to a long pause as he glares at her before going back into his room Sarah closes the door and leans against it as screams are heard while the horses jerk out of the starting gate to begin their runs Eddie cashes in a winning ticket and moves through the ornate racetrack bar to join Sarah at a table where she has been drinking As she puts the money in her purse Bert sits down and we see Findley studying his program and holding a drink appearing tall and refined with a pale debauched yet oddly youthful face that some men over forty sometimes have while a corktipped cigarette dangles from his fingers The Kentuckybound train rolls down the track while Bert and Eddie finish their breakfast coffee in the dining room Sarah is in the washroom and then makes her way down the aisle to join them at the table where she stands silently absorbing an insult Bert gets up and reaches into his pocket for his billfold as Eddie and Sarah just stare at him Later they are at a table sipping drinks with Bert shuffling a deck of cards as he talks and Eddie like a schoolboy listening intently while Sarah sits apart watching them both Eddie glances at Sarah who stares mutely at Bert and then he reaches across to light Bert's cigarette with the lighter Sarah gave him while Bert's own lighter is on the table before him Sarah sees it picks it up and sparks it into flame as Bert goes back to shuffling his deck of cards The lobby is thronged with gamblers their women sportsmen and tourists all there for the Derby with a jazz combo audible over the din of their voices Eddie looking excited leads Sarah through the crowd with Bert behind them his face now shaded by dark glasses as he follows a bellhop to the main desk forcing his way through people to get there and displaying a neatly folded wad of money in his hand"
        }
      ]
    }
  ]
}