{
  "ground_truth": "He shakes some powder into his hand and tastes it as Reggie watches expectantly. Behind the ultra-modern glass and concrete structure of the Ecole Militaire, several delegates identified by little plaques listing their respective nations, along with their aides, sit around a large table, all wearing earphones. The Italian delegate is speaking when Sylvie jumps up, rushes next door into her booth, and shuts the door behind her. The British delegate rises to speak, continuing through the next scene, and hands her a paper, the one Grandpierre gave Reggie, which has been torn in half and scotch-taped back together. She turns back to the conference, flips a switch, and starts speaking into her headset. From Reggie's and Adam's angle, all the delegates and their aides suddenly turn, surprised, and look at the camera, from the delegates' angle. Inside the booth, Reggie and Adam can be seen heading for the door in a hurry as the delegates look at one another, confused, by the locked gate. A quick succession of shots shows a children's merry-go-round, Rond Point de Champs-Elysées with fountains playing, children's swings, Restaurant Laurent, and a balloon salesman. Adam stands by the large fountain, staring off at something as Reggie joins him, and he starts off. Between the curb and the Jardin, several temporary wooden booths have been set up, collecting quite a crowd. Into this area comes Tex, followed at a safe distance by Adam. Suddenly Tex stops, staring wide-eyed at something, neatly displayed on a counter of one of the booths. As he wheels to look at another booth, in another arrangement, he turns crazily to look at another booth, then another, with various flash shots of stamps of all sizes, shapes, and colors, as he understands. He turns to rush off and bumps smack into Adam, startling Tex, and they go off in opposite directions. As she hurries along a row of stalls, weaving around small groups of men standing together, showing each other stamps, searching in another section of the market, but it isn't, looking everywhere, suddenly she sees something. Only a small boy's elbow and part of his arm show, the rest hidden by all the legs, and she recognizes him from these fragments. She rushes to him, the camera panning with her. Jean-Louis stands looking at some stamps as Sylvie grabs him, and Reggie runs up and joins them. Jean-Louis looks in one direction, then in the other, trying to remember, seeing four of them—a red, a yellow, a blue, and a green, still attached to the portion of the torn envelope. As Reggie comes hurrying up the stairs, she goes first to Adam's room and knocks as Bartholomew, his face lathered for a shave, is on the phone.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He agitates some powder into his palm and samples it as Reggie observes eagerly. Behind the cutting-edge glass and concrete edifice of the Ecole Militaire, several representatives identified by small plaques listing their respective countries, along with their assistants, sit around a large table, all wearing headphones. The Italian representative is speaking when Sylvie leaps up, dashes next door into her cubicle, and closes the door behind her. The British representative stands to speak, proceeding through the next scene, and hands her a document, the one Grandpierre gave Reggie, which has been torn in half and cellophane-taped back together. She turns back to the meeting, flips a switch, and starts speaking into her headset. From Reggie's and Adam's angle, all the representatives and their assistants suddenly turn, astonished, and look at the camera, from the representatives' perspective. Inside the cubicle, Reggie and Adam can be seen heading for the door in a rush as the representatives look at one another, puzzled, by the closed gate. A rapid sequence of shots displays a children's carousel, Rond Point de Champs-Elysées with fountains playing, children's swings, Restaurant Laurent, and a balloon vendor. Adam stands by the large fountain, gazing off at something as Reggie joins him, and he starts off. Between the curb and the Jardin, several temporary wooden stalls have been set up, gathering quite a crowd. Into this area comes Tex, followed at a secure distance by Adam. Suddenly Tex halts, staring wide-eyed at something, neatly exhibited on a counter of one of the stalls. As he wheels to glance at another stall, in another arrangement, he turns frantically to look at another stall, then another, with various flash shots of stamps of all sizes, shapes, and hues, as he comprehends. He turns to dash off and bumps directly into Adam, startling Tex, and they go off in opposite directions. As she hurries along a row of booths, weaving around small groups of men standing together, showing each other stamps, searching in another segment of the market, but it isn't, looking everywhere, suddenly she perceives something. Only a small boy's elbow and part of his arm show, the rest hidden by all the legs, and she identifies him from these fragments. She dashes to him, the camera panning with her. Jean-Louis stands examining some stamps as Sylvie seizes him, and Reggie runs up and joins them. Jean-Louis looks in one direction, then in the other, trying to recollect, seeing four of them—a crimson, a yellow, a blue, and a green, still connected to the portion of the torn envelope. As Reggie comes hastening up the stairs, she goes first to Adam's room and knocks as Bartholomew, his visage lathered for a shave, is on the phone."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Some powder is shaken into his hand by him, and it is tasted as Reggie watches expectantly. Behind the ultra-modern glass and concrete structure of the Ecole Militaire, several delegates, identified by little plaques listing their respective nations, along with their aides, are sitting around a large table, all wearing earphones. The Italian delegate was speaking when Sylvie jumped up, rushed next door into her booth, and shut the door behind her. The British delegate rises to speak, continues through the next scene, and hands her a paper, the one Grandpierre gave Reggie, which she has torn in half and scotch-taped back together. She turns back to the conference, flips a switch, and starts speaking into her headset. From Reggie's and Adam's angle, the camera is suddenly turned at by all the delegates and their aides, surprised, from the delegates' angle. Inside the booth, Reggie and Adam head for the door in a hurry as the delegates look at one another, confused by the locked gate. A quick succession of shots shows a children's merry-go-round, Rond Point de Champs-Elysées with fountains playing, children's swings, Restaurant Laurent, and a balloon salesman. The large fountain is stood by Adam, who stares off at something as he is joined by Reggie, and he is started off. Between the curb and the Jardin, several temporary wooden booths have been set up, collecting quite a crowd. Into this area, Tex comes, followed at a safe distance by Adam. Suddenly, something is stared at wide-eyed by Tex, neatly displayed on a counter of one of the booths. As he wheels to look at another booth, in another arrangement, he crazily turns to look at another booth, then another, with various flash shots of stamps of all sizes, shapes, and colors, as he understands. He turns to rush off and bumps smack into Adam, who startles Tex, and they go off in opposite directions. She hurries along a row of stalls, weaving around small groups of men standing together, showing each other stamps, searching in another section of the market, but it isn't, looking everywhere, then they are suddenly seen by her. Only a small boy's elbow and part of his arm are shown, the rest hidden by all the legs, and he is recognized by her from these fragments. She rushes to him, the camera panning with her. Jean-Louis stands looking at some stamps as he is grabbed by Sylvie, and Reggie runs up and joins them. Jean-Louis looks in one direction, then in the other, trying to remember, seeing four of them—a red, a yellow, a blue, and a green, still attached to the portion of the torn envelope. As Reggie comes hurrying up the stairs, Adam's room is gone to by her first and knocked on as Bartholomew, his face lathered for a shave, talks on the phone."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He shakes powder into his hand and tastes it as Reggie watches. Behind the modern Ecole Militaire, delegates identified by plaques sit around a large table, all wearing earphones. The Italian delegate speaks when Sylvie rushes to her booth and shuts the door. The British delegate rises, hands her a torn, taped paper from Reggie, and continues speaking. She flips a switch and speaks into her headset. From Reggie and Adam’s angle, the delegates suddenly turn and look at the camera. Inside the booth, Reggie and Adam hurry to the door as the delegates look confused by the locked gate. Quick shots show a merry-go-round, Rond Point de Champs-Elysées with fountains, swings, Restaurant Laurent, and a balloon salesman. Adam stands by a fountain, staring as Reggie joins him and they start off. Near the Jardin, temporary booths draw a crowd. Tex arrives, followed by Adam, stops, stunned by something on a booth counter. Tex turns to another booth, with flash shots of stamps, then bumps into Adam, and they go in opposite directions. Sylvie weaves through stalls and recognizes a small boy by his elbow. She rushes to him as Jean-Louis, looking at stamps, is joined by Reggie. Jean-Louis tries to remember, seeing four stamps—red, yellow, blue, and green. Reggie hurries to Adam's room, knocking as Bartholomew, mid-shave, is on the phone."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He shakes powder into his hand and tastes it as Reggie observes. Behind the ultra-modern Ecole Militaire, delegates identified by national plaques and their aides sit with earphones around a large table. As the Italian delegate speaks, Sylvie jumps up, rushes into her booth, and shuts the door. The British delegate continues, hands her a paper, torn and taped, from Grandpierre to Reggie. She returns to the conference and begins speaking into her headset. From Reggie's and Adam's view, the delegates suddenly turn, surprised, towards the camera. Reggie and Adam head for the door in a hurry, the delegates confused by the locked gate. Quick shots show a merry-go-round, Rond Point de Champs-Elysées, swings, Restaurant Laurent, and a balloon seller. Adam stands by a fountain, looking at something, as Reggie joins him, and they leave. Tex enters an area with wooden booths, with Adam following. Tex stops, wide-eyed at items on a counter, looks around at various stamps, and understands. He bumps into Adam, and they part ways. Sylvie rushes through stalls, around men showing stamps. She sees a small boy’s elbow and recognizes him. She rushes to Jean-Louis, looking at stamps, grabs him, and Reggie joins. Jean-Louis looks around, recalling four colors on a torn envelope. As Reggie hurries upstairs, she knocks on Adam's door as Bartholomew, shaving, is on the phone."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "With a sense of anticipation, he liberally shakes some of the powder into his open palm and proceeds to taste it while Reggie watches on with an expectant gaze. Situated behind the ultra-modern architectural marvel of glass and concrete that is the Ecole Militaire, a multitude of delegates, each identified by little plaques displaying their respective nations, sit at a large, imposing table alongside their aides, all wearing earphones to facilitate translation. The Italian delegate is in the midst of speaking when Sylvie suddenly jumps up in a flurry and rushes into the adjacent room, which is her booth, quickly shutting the door behind her with urgency. When the British delegate stands up to speak, his dialogue seamlessly transitions into the next scene. He hands her a paper, the very same one that Grandpierre gave to Reggie, which has since been torn in half and clumsily pieced back together with scotch tape. She turns her attention back to the ongoing conference, flipping a switch with precision, and begins speaking into her headset. Meanwhile, from Reggie's and Adam's perspective, all of the delegates along with their aides abruptly turn in surprise, their eyes fixated on the camera from the viewpoint of the delegates. Within the booth, Reggie and Adam can clearly be seen making a beeline for the door in a rush, while the delegates, flanked by a locked gate, exchange confused glances. In a rapid sequence of shots, viewers are treated to images of a children's merry-go-round, the Rond Point de Champs-Elysées with its elegant fountains in full flow, children's swings, Restaurant Laurent, and a cheerful balloon salesman. Adam stands pensively by the expansive fountain, his gaze distant, and as Reggie joins him, he turns to leave. Between the curb and the Jardin, several temporary wooden booths have been erected, attracting a bustling crowd. Into this busy area enters Tex, who is followed cautiously at a safe distance by Adam. Without warning, Tex halts abruptly, his eyes wide with surprise as he stares at something neatly arranged on a booth’s counter. As he turns to look at another booth, interested in a different display, he whirls around crazily to examine yet another booth, and another, as rapid flash shots reveal stamps of all conceivable sizes, shapes, and colors, each enticingly different. He comes to an understanding and turns to rush off, bumping headlong into Adam, which startles Tex. They scatter in opposite directions. As she moves quickly along the row of stalls, Sylvie carefully weaves around small groups of men who are gathered together, showing each other stamps and searching throughout another section of the vibrant market. Suddenly, she sees something that captures her attention. All that is visible is a small boy's elbow and part of his arm, the rest hidden amidst a sea of legs, yet she recognizes him from these mere fragments. The camera smoothly follows her as she rushes toward him. Jean-Louis stands absorbed, looking at some stamps as Sylvie grabs him, and Reggie soon runs up to join them. Jean-Louis glances first in one direction, then in the other, trying to recall something. He sees four colors—a red, a yellow, a blue, and a green—still attached to the piece of the torn envelope. As Reggie hurries up the stairs, she makes her way to Adam's room first, knocking on the door, while inside, Bartholomew, his face covered in shaving lather, is engaged in a conversation on the phone."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a sense of eager anticipation, he liberally shakes some of the powder into his open palm, allowing it to settle before proceeding to taste it, all while Reggie watches on with an expectant gaze that suggests curiosity and interest. Situated behind the ultra-modern architectural marvel of glass and concrete known as the Ecole Militaire, a multitude of delegates is gathered. Each delegate is identified by little plaques that prominently display their respective nations, and they sit at a large, imposing table alongside their aides, all of whom are wearing earphones to facilitate seamless translation of the proceedings. The Italian delegate is in the midst of delivering a speech when, suddenly, Sylvie jumps up in a flurry and rushes into the adjacent room, which serves as her booth, quickly shutting the door behind her with an air of urgency. As the British delegate rises to speak, his dialogue seamlessly transitions into the next scene, maintaining the flow of the conference. He hands her a paper, the very same document that Grandpierre had previously given to Reggie, which has since been torn in half and clumsily pieced back together with strips of scotch tape. She turns her attention back to the ongoing conference, flipping a switch with precise control, and begins speaking into her headset. Meanwhile, from the perspective of Reggie and Adam, all of the delegates along with their aides abruptly turn in surprise, their eyes becoming fixated on the camera from the viewpoint of the delegates. Within the booth, Reggie and Adam can clearly be seen making a beeline for the door in a rush, a sense of urgency palpable in their movements, while the delegates, flanked by a locked gate, exchange bewildered and confused glances among themselves. In a rapid sequence of shots, viewers are treated to a montage of images: a children's merry-go-round spinning joyfully, the Rond Point de Champs-Elysées with its elegant fountains in full, majestic flow, children's swings swaying gently, the inviting ambiance of Restaurant Laurent, and a cheerful balloon salesman. Adam stands pensively by the expansive fountain, his gaze distant and contemplative, and as Reggie joins him, he silently turns to leave. Between the curb and the Jardin, several temporary wooden booths have been erected, attracting a bustling crowd of people. Into this busy and vibrant area enters Tex, who is followed cautiously at a safe distance by Adam, who maintains a watchful eye. Without warning, Tex halts abruptly, his eyes going wide with surprise as he stares intently at something neatly arranged on a booth’s counter. As he turns to look at another booth, interested in a different display, he whirls around crazily to examine yet another booth, and another, as rapid flash shots reveal stamps of all conceivable sizes, shapes, and colors, each one enticingly different and unique. He comes to an understanding and turns to rush off, inadvertently bumping headlong into Adam, which startles Tex, and they scatter in opposite directions. As she moves quickly along the row of stalls, Sylvie carefully weaves around small groups of men who are gathered together, showing each other stamps and searching throughout another section of the vibrant market. Suddenly, she sees something that captures her undivided attention. All that is visible is a small boy's elbow and part of his arm, the rest of him obscured amidst a sea of legs, yet she recognizes him from these mere fragments, a testament to her sharp observation. The camera smoothly follows her as she rushes toward him with determination. Jean-Louis stands absorbed, looking intently at some stamps as Sylvie grabs him, and Reggie soon runs up to join them, completing the reunion. Jean-Louis glances first in one direction, then in the other, his mind trying to recall something important. He sees four distinct colors—a vibrant red, a bright yellow, a deep blue, and a fresh green—still attached to the piece of the torn envelope. As Reggie hurries up the stairs, she makes her way to Adam's room first, knocking on the door, while inside, Bartholomew, his face covered in shaving lather, is engaged in a lively conversation on the phone, multitasking with ease."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He begins by shaking some powder into his hand, then examines it closely before bringing his hand up to his mouth to taste it, all under the watchful eyes of Reggie who observes him with anticipation. Meanwhile, the scene shifts to the ultra-modern glass and concrete backdrop of the Ecole Militaire, where a large table is surrounded by several delegates, each identified by small plaques indicating their respective nations, and accompanied by their aides, all wearing earphones for translation. The Italian delegate is in the midst of speaking when Sylvie suddenly springs up from her seat. She quickly exits the room, rushing into her booth next door and promptly closes the door behind her to ensure privacy. Concurrently, the British delegate rises from his chair to address the assembly. As he speaks, he hands a paper to Sylvie, the same paper previously given to Reggie by Grandpierre, now torn in half and reassembled with scotch tape. Sylvie receives it, turns her attention back to the conference, flips a switch on her console, and begins speaking into her headset, fully engaged in her role. From the perspective of Reggie and Adam, they watch as the entire assembly of delegates and their aides, startled by the commotion, suddenly turn their gaze towards the camera, captured from the delegates' angle. Inside the booth, Reggie and Adam can be seen abruptly making their way to the door with a sense of urgency, while outside, the delegates exchange puzzled glances, bewildered by the activity at the locked gate. The scene shifts rapidly with a series of quick shots showcasing a children's merry-go-round, the picturesque Rond Point de Champs-Elysées with its fountains in motion, children's swings, the elegant Restaurant Laurent, and a balloon salesman adding a touch of whimsy. Adam is seen standing pensively beside the large fountain, his attention fixed on an unspecified point in the distance. Reggie soon joins him, and as she arrives, he begins to move forward. Along the space between the curb and the Jardin, several temporary wooden booths have been erected, attracting a sizeable crowd of onlookers and shoppers. Tex enters this bustling area, cautiously followed by Adam from a safe distance. Abruptly, Tex halts, transfixed by something intriguing displayed on a counter at one of the booths. He quickly turns to examine another booth, then abruptly swivels to inspect yet another, his gaze darting from one display to the next, capturing various flash shots of stamps in an array of sizes, shapes, and colors as he pieces together a realization. In his haste, Tex pivots to make a hurried exit but collides directly with Adam, startling both of them and causing them to scatter in opposite directions. As she navigates along a row of stalls, Sylvie deftly maneuvers around small groups of men engaged in discussions, showing one another stamps, her eyes scanning another section of the bustling market in search of something that remains elusive. Suddenly, she catches sight of something—a small boy's elbow and part of his arm are visible, partially obscured by the throng of adult legs surrounding him—and she instantly recognizes him from these distinct fragments. Without hesitation, she rushes towards him, with the camera tracking her swift movement. Jean-Louis stands there, engrossed in examining some stamps, as Sylvie reaches him and takes hold of him. At this moment, Reggie rushes up to join them. Jean-Louis looks back and forth, trying to recall details, and then he remembers, visualizing four colored stamps—a red, a yellow, a blue, and a green—still attached to the remnants of a torn envelope. As Reggie ascends the stairs with urgency, she first heads to Adam's room and knocks on the door. Inside, Bartholomew is engaged in a phone call, his face partially covered in lather in preparation for a shave."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He tastes some powder from his hand while Reggie watches expectantly. At the Ecole Militaire, delegates with their aides, identified by plaques of their respective nations, sit around a large table wearing earphones. As the Italian delegate speaks, Sylvie rushes to her booth and closes the door. The British delegate continues speaking, handing Sylvie a torn and taped paper from Grandpierre to Reggie. She turns back, flips a switch, and begins speaking into her headset. From Reggie and Adam's perspective, surprised delegates and aides look at the camera, while the delegates are seen looking puzzled at each other by the locked gate. Quick shots show a children's merry-go-round, Rond Point de Champs-Elysées with fountains, swings, Restaurant Laurent, and a balloon salesman. Adam stands by the fountain, and as Reggie joins, they move off. Between the curb and the Jardin, temporary wooden booths create a bustling crowd. Tex enters, followed by Adam, and suddenly fixates on something on a booth counter. He moves frantically between booths, realizing the significance of various stamps. He bumps into Adam, and they part ways. Sylvie weaves through stalls, searching amid groups of men exchanging stamps. Spotting a familiar small boy's elbow among the crowd, she rushes towards him as the camera follows. Jean-Louis is examining stamps when Sylvie and Reggie join him. Jean-Louis tries to recall seeing four colors on a torn envelope piece. As Reggie hurries upstairs, she first knocks on Adam's door while Bartholomew, mid-shave, talks on the phone."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He shakes some powder into his hand and tastes it, perhaps testing its authenticity or flavor, as Reggie watches expectantly. Behind the ultra-modern glass and concrete structure of the Ecole Militaire, a renowned French military academy situated near the Champ de Mars in Paris, several delegates identified by little plaques listing their respective nations, along with their aides, sit around a large table, all wearing earphones, which are likely connected to the conference's simultaneous translation system. The Italian delegate is speaking when Sylvie jumps up, rushes next door into her booth, which serves as a translation hub, and shuts the door behind her. The British delegate rises to speak, continuing through the next scene, and hands her a paper, the one Grandpierre gave Reggie, which has been torn in half and scotch-taped back together, suggesting it contains crucial, albeit damaged, information. She turns back to the conference, flips a switch, and starts speaking into her headset, initiating the translation. From Reggie's and Adam's angle, all the delegates and their aides suddenly turn, surprised, and look at the camera, from the delegates' angle, the expressions hinting at unexpected news. Inside the booth, Reggie and Adam can be seen heading for the door in a hurry as the delegates look at one another, confused, by the locked gate, a symbolic barrier to their understanding. A quick succession of shots shows a children's merry-go-round, Rond Point de Champs-Elysées, a famous circular plaza in Paris known for its elaborate fountains playing, children's swings, Restaurant Laurent, an upscale dining establishment, and a balloon salesman brightening the scene. Adam stands by the large fountain, a central feature in many Parisian parks, staring off at something as Reggie joins him, and he starts off, suggesting a new direction or realization. Between the curb and the Jardin, referring to Jardin des Champs-Élysées, several temporary wooden booths have been set up, collecting quite a crowd, part of a bustling Parisian market. Into this area comes Tex, followed at a safe distance by Adam, likely to avoid drawing attention. Suddenly Tex stops, staring wide-eyed at something, neatly displayed on a counter of one of the booths, suggesting a rare find. As he wheels to look at another booth, in another arrangement, he turns crazily to look at another booth, then another, with various flash shots of stamps of all sizes, shapes, and colors, as he understands the significance or value of what he sees. He turns to rush off and bumps smack into Adam, startling Tex, and they go off in opposite directions, indicating a hurried disarray. As she hurries along a row of stalls, weaving around small groups of men standing together, showing each other stamps, searching in another section of the market, but it isn't, looking everywhere, suddenly she sees something. Only a small boy's elbow and part of his arm show, the rest hidden by all the legs, and she recognizes him from these fragments, indicating a previous encounter. She rushes to him, the camera panning with her. Jean-Louis stands looking at some stamps, a sign of his interest in philately, as Sylvie grabs him, and Reggie runs up and joins them, forming a reunion. Jean-Louis looks in one direction, then in the other, trying to remember, seeing four of them—a red, a yellow, a blue, and a green, still attached to the portion of the torn envelope, possibly a clue or code. As Reggie comes hurrying up the stairs, she goes first to Adam's room and knocks as Bartholomew, his face lathered for a shave, is on the phone, possibly engaged in an important conversation."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Only a small boy's elbow and part of his arm show the rest hidden by all the legs and she recognizes him from these fragments Between the curb and the Jardin several temporary wooden booths have been set up collecting quite a crowd He shakes some powder into his hand and tastes it as Reggie watches expectantly She turns back to the conference flips a switch and starts speaking into her headset A quick succession of shots shows a children's merrygoround Rond Point de ChampsElysées with fountains playing children's swings Behind the ultramodern glass and concrete structure of the Ecole Militaire several delegates identified by little plaques listing their respective nations along with their aides sit around a large table all wearing earphones The British delegate rises to speak continuing through the next scene and hands her a paper the one Grandpierre gave Reggie which has been torn in half and scotchtaped back together Into this area comes Tex followed at a safe distance by Adam Behind the ultramodern glass and concrete structure of the Ecole Militaire several delegates identified by little plaques listing their respective nations along with their aides sit around a large table all wearing earphones The Italian delegate is speaking when Sylvie jumps up rushes next door into her booth and shuts the door behind her The British delegate rises to speak continuing through the next scene and hands her a paper the one Grandpierre gave Reggie which has been torn in half and scotchtaped back together She turns back to the conference flips a switch and starts speaking into her headset He turns to rush off and bumps smack into Adam startling Tex and they go off in opposite directions From Reggie's and Adam's angle all the delegates and their aides suddenly turn surprised and look at the camera from the delegates' angle Inside the booth Reggie and Adam can be seen heading for the door in a hurry as the delegates look at one another confused by the locked gate A quick succession of shots shows a children's merrygoround Rond Point de ChampsElysées with fountains playing children's swings Restaurant Laurent and a balloon salesman Adam stands by the large fountain staring off at something as Reggie joins him and he starts off Between the curb and the Jardin several temporary wooden booths have been set up collecting quite a crowd Into this area comes Tex followed at a safe distance by Adam Restaurant Laurent and a balloon salesman Suddenly Tex stops staring wideeyed at something neatly displayed on a counter of one of the booths As he wheels to look at another booth in another arrangement he turns crazily to look at another booth then another with various flash shots of stamps of all sizes shapes and colors as he understands He turns to rush off and bumps smack into Adam startling Tex and they go off in opposite directions As she hurries along a row of stalls weaving around small groups of men standing together showing each other stamps searching in another section of the market but it is not looking everywhere suddenly she sees something He shakes some powder into his hand and tastes it as Reggie watches expectantly JeanLouis looks in one direction then in the other trying to remember seeing four of them—a red a yellow a blue and a green still attached to the portion of the torn envelope Only a small boy's elbow and part of his arm show the rest hidden by all the legs and she recognizes him from these fragments She rushes to him the camera panning with her JeanLouis stands looking at some stamps as Sylvie grabs him and Reggie runs up and joins them JeanLouis looks in one direction then in the other trying to remember seeing four of them—a red a yellow a blue and a green still attached to the portion of the torn envelope As Reggie comes hurrying up the stairs she goes first to Adam's room and knocks as Bartholomew his face lathered for a shave is on the phone"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He shakes some powder into his hand and tastes it as Reggie watches expectantly. Behind the ultramodern glass and concrete structure of the Ecole Militaire several delegates identified by little plaques listing their respective nations along with their aides sit around a large table all wearing earphones. The Italian delegate is speaking when Sylvie jumps up rushes next door into her booth and shuts the door behind her. The British delegate rises to speak continuing through the next scene and hands her a paper the one Grandpierre gave Reggie which has been torn in half and scotchtaped back together. She turns back to the conference flips a switch and starts speaking into her headset. From Reggie's and Adam's angle all the delegates and their aides suddenly turn surprised and look at the camera from the delegates' angle. Inside the booth Reggie and Adam can be seen heading for the door in a hurry as the delegates look at one another confused by the locked gate. A quick succession of shots shows a children's merrygoround Rond Point de ChampsElysées with fountains playing children's swings. Restaurant Laurent and a balloon salesman. Adam stands by the large fountain staring off at something as Reggie joins him and he starts off. Between the curb and the Jardin several temporary wooden booths have been set up collecting quite a crowd. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Into this area comes Tex followed at a safe distance by Adam. Suddenly Tex stops staring wideeyed at something neatly displayed on a counter of one of the booths. As he wheels to look at another booth in another arrangement he turns crazily to look at another booth then another with various flash shots of stamps of all sizes shapes and colors as he understands. He turns to rush off and bumps smack into Adam startling Tex and they go off in opposite directions. As she hurries along a row of stalls weaving around small groups of men standing together showing each other stamps searching in another section of the market but it is not looking everywhere. suddenly she sees something. Only a small boy's elbow and part of his arm show the rest hidden by all the legs and she recognizes him from these fragments. She rushes to him the camera panning with her. JeanLouis stands looking at some stamps as Sylvie grabs him and Reggie runs up and joins them. JeanLouis looks in one direction then in the other trying to remember seeing four of them—a red a yellow a blue and a green still attached to the portion of the torn envelope. As Reggie comes hurrying up the stairs she goes first to Adam's room and knocks as Bartholomew his face lathered for a shave is on the phone."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He shakes some powder into his hand and tastes it as Reggie watches expectantly. Behind the ultramodern glass and concrete structure of the Ecole Militaire several delegates identified by little plaques listing their respective nations along with their aides sit around a large table all wearing earphones. The Italian delegate is speaking when Sylvie jumps up rushes next door into her booth and shuts the door behind her. The British delegate rises to speak continuing through the next scene and hands her a paper the one Grandpierre gave Reggie which has been torn in half and scotchtaped back together. She turns back to the conference flips a switch and starts speaking into her headset. From Reggie's and Adam's angle all the delegates and their aides suddenly turn surprised and look at the camera from the delegates' angle. Inside the booth Reggie and Adam can be seen heading for the door in a hurry as the delegates look at one another confused by the locked gate. A quick succession of shots shows a children's merrygoround Rond Point de ChampsElysées with fountains playing children's swings. Restaurant Laurent and a balloon salesman. Adam stands by the large fountain staring off at something as Reggie joins him and he starts off. Between the curb and the Jardin several temporary wooden booths have been set up collecting quite a crowd. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Into this area comes Tex followed at a safe distance by Adam. Suddenly Tex stops staring wideeyed at something neatly displayed on a counter of one of the booths. As he wheels to look at another booth in another arrangement he turns crazily to look at another booth then another with various flash shots of stamps of all sizes shapes and colors as he understands. He turns to rush off and bumps smack into Adam startling Tex and they go off in opposite directions. As she hurries along a row of stalls weaving around small groups of men standing together showing each other stamps searching in another section of the market but it is not looking everywhere. suddenly she sees something. Only a small boy's elbow and part of his arm show the rest hidden by all the legs and she recognizes him from these fragments. She rushes to him the camera panning with her. JeanLouis stands looking at some stamps as Sylvie grabs him and Reggie runs up and joins them. JeanLouis looks in one direction then in the other trying to remember seeing four of them—a red a yellow a blue and a green still attached to the portion of the torn envelope. As Reggie comes hurrying up the stairs she goes first to Adam's room and knocks as Bartholomew his face lathered for a shave is on the phone."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He shakes some powder into his hand and tastes it as Reggie watches expectantly. Behind the ultramodern glass and concrete structure of the Ecole Militaire several delegates identified by little plaques listing their respective nations along with their aides sit around a large table all wearing earphones. The Italian delegate is speaking when Sylvie jumps up rushes next door into her booth and shuts the door behind her. The British delegate rises to speak continuing through the next scene and hands her a paper the one Grandpierre gave Reggie which has been torn in half and scotchtaped back together. She turns back to the conference flips a switch and starts speaking into her headset. From Reggie's and Adam's angle all the delegates and their aides suddenly turn surprised and look at the camera from the delegates' angle. Only a small boy's elbow and part of his arm show the rest hidden by all the legs and she recognizes him from these fragments. She rushes to him the camera panning with her. JeanLouis stands looking at some stamps as Sylvie grabs him and Reggie runs up and joins them. JeanLouis looks in one direction then in the other trying to remember seeing four of them—a red a yellow a blue and a green still attached to the portion of the torn envelope. As Reggie comes hurrying up the stairs she goes first to Adam's room and knocks as Bartholomew his face lathered for a shave is on the phone."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He shakes some powder into his hand and tastes it as Reggie watches expectantly. Behind the ultramodern glass and concrete structure of the Ecole Militaire several delegates identified by little plaques listing their respective nations along with their aides sit around a large table all wearing earphones. The Italian delegate is speaking when Sylvie jumps up rushes next door into her booth and shuts the door behind her. JeanLouis looks in one direction then in the other trying to remember seeing four of them—a red a yellow a blue and a green still attached to the portion of the torn envelope. As Reggie comes hurrying up the stairs she goes first to Adam's room and knocks as Bartholomew his face lathered for a shave is on the phone."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "He shakes some powder into her hand and tastes it as the raccoon watches expectantly. Behind the ultra-modern glass and concrete structure of the Ecole Militaire, several rabbits identified by little plaques listing their respective nations, along with their aides, sit around a large table, all wearing earphones. The Portuguese delegate is speaking when the butterfly jumps up, rushes next door into her booth, and shuts the door behind her. The Canadian delegate rises to speak, continuing through the next scene, and hands her a paper, the one the giraffe gave the raccoon, which has been torn in half and scotch-taped back together. The butterfly turns back to the conference, flips a switch, and starts speaking into her headset. From the raccoon's and the aardvark's angle, all the rabbits and their aides suddenly turn, surprised, and look at the camera, from the rabbits' angle. Inside the booth, the raccoon and the aardvark can be seen heading for the door in a hurry as the rabbits look at one another, confused, by the locked gate. A quick succession of shots shows a children's merry-go-round, Rond Point de Champs-Elysées with fountains playing, children's swings, Restaurant Laurent, and a balloon salesman. The aardvark stands by the large fountain, staring off at something as the raccoon joins him, and he starts off. Between the curb and the Jardin, several temporary wooden booths have been set up, collecting quite a crowd. Into this area comes the kangaroo, followed at a safe distance by the aardvark. Suddenly the kangaroo stops, staring wide-eyed at something, neatly displayed on a counter of one of the booths. As she wheels to look at another booth, in another arrangement, she turns crazily to look at another booth, then another, with various flash shots of stamps of all sizes, shapes, and colors, as she understands. She turns to rush off and bumps smack into the aardvark, startling the kangaroo, and they go off in opposite directions. As the butterfly hurries along a row of stalls, weaving around small groups of men standing together, showing each other stamps, searching in another section of the market, but it isn't, looking everywhere, suddenly she sees something. Only a small boy's elbow and part of his arm show, the rest hidden by all the legs, and the butterfly recognizes him from these fragments. The butterfly rushes to him, the camera panning with her. The ostrich stands looking at some stamps as the butterfly grabs him, and the raccoon runs up and joins them. The ostrich looks in one direction, then in the other, trying to remember, seeing four of them—a red, a yellow, a blue, and a green, still attached to the portion of the torn envelope. As the raccoon comes hurrying up the stairs, she goes first to the aardvark's room and knocks as the walrus, his face lathered for a shave, is on the phone."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He shakes some glitter into his hand and tastes it as Reggie watches expectantly. Behind the ultra-modern brick and steel structure of the Louvre, several delegates identified by little signs listing their respective planets, along with their aides, sit around a giant sofa, all wearing headphones. The Italian delegate is speaking when Sylvie jumps up, rushes next door into her cubicle, and shuts the curtain behind her. The British delegate rises to speak, continuing through the next scene, and hands her a scroll, the one Grandpierre gave Reggie, which has been torn in half and superglued back together. She turns back to the gathering, flips a button, and starts speaking into her microphone. From Reggie's and Adam's angle, all the delegates and their aides suddenly turn, surprised, and look at the lens, from the delegates' angle. Inside the cubicle, Reggie and Adam can be seen heading for the window in a hurry as the delegates look at one another, confused, by the locked fence. A quick succession of shots shows a children's Ferris wheel, Place de la Concorde with sprinklers playing, children's slides, Café de Flore, and a kite salesman. Adam stands by the large pond, staring off at something as Reggie joins him, and he starts off. Between the sidewalk and the Zoo, several temporary metal kiosks have been set up, collecting quite a crowd. Into this area comes Tex, followed at a safe distance by Adam. Suddenly Tex stops, staring wide-eyed at something, neatly displayed on a table of one of the kiosks. As he wheels to look at another kiosk, in another arrangement, he turns crazily to look at another kiosk, then another, with various flash shots of coins of all sizes, shapes, and colors, as he understands. He turns to rush off and bumps smack into Adam, startling Tex, and they go off in opposite directions. As she hurries along a row of tents, weaving around small groups of women standing together, showing each other coins, searching in another section of the bazaar, but it isn't, looking everywhere, suddenly she sees something. Only a small girl's elbow and part of her arm show, the rest hidden by all the legs, and she recognizes her from these fragments. She rushes to her, the camera panning with her. Jean-Louis stands looking at some coins as Sylvie grabs him, and Reggie runs up and joins them. Jean-Louis looks in one direction, then in the other, trying to remember, seeing four of them—a red, a yellow, a blue, and a green, still attached to the portion of the torn postcard. As Reggie comes hurrying up the elevator, she goes first to Adam's office and knocks as Bartholomew, his face lathered for a shave, is on the walkie-talkie."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He sprinkles some powder into his hand and sniffs it as Reggie observes curiously. Behind the ultra-modern glass and concrete structure of the Ecole Militaire, several delegates identified by little plaques listing their respective nations, along with their aides, gather around a large table, all adjusting their earphones. The Italian delegate is gesturing when Sylvie leaps up, dashes next door into her booth, and pulls the door shut behind her. The British delegate stands to listen, continuing through the next scene, and passes her a paper, the one Grandpierre showed Reggie, which has been folded in half and stapled back together. She turns back to the conference, flicks a switch, and sings into her headset. From Reggie's and Adam's angle, all the delegates and their aides suddenly jump, surprised, and glance at the camera, from the delegates' angle. Inside the booth, Reggie and Adam can be seen racing for the door as the delegates look at one another, bewildered, by the locked gate. A quick succession of shots shows a children's merry-go-round, Rond Point de Champs-Elysées with fountains splashing, children's swings, Restaurant Laurent, and a balloon artist. Adam stands by the large fountain, gazing off at something as Reggie joins him, and he wanders off. Between the curb and the Jardin, several temporary wooden booths have been constructed, drawing quite a crowd. Into this area comes Tex, trailed at a safe distance by Adam. Suddenly Tex halts, gazing open-mouthed at something, neatly arranged on a counter of one of the booths. As he spins to glance at another booth, in another setup, he pivots erratically to peer at another booth, then another, with various quick shots of stamps of all sizes, shapes, and colors, as he understands. He spins to dash off and collides smack into Adam, startling Tex, and they head off in opposite directions. As she rushes along a row of stalls, weaving around small groups of men standing together, exchanging stamps, searching in another section of the market, but it isn't, scanning everywhere, suddenly she notices something. Only a small boy's elbow and part of his arm appear, the rest obscured by all the legs, and she identifies him from these fragments. She dashes to him, the camera tracking with her. Jean-Louis stands observing some stamps as Sylvie snatches him, and Reggie sprints up and joins them. Jean-Louis glances in one direction, then in the other, trying to recall, spotting four of them—a red, a yellow, a blue, and a green, still affixed to the portion of the torn envelope. As Reggie comes racing up the stairs, she goes first to Adam's room and raps as Bartholomew, his face lathered for a shave, is on the phone."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The spoon shakes some glitter into its paw and tastes it as the cactus watches expectantly. Behind the ultra-modern glass and concrete structure of the Chocolate Factory, several pianos identified by little plaques listing their respective galaxies, along with their lamps, sit around a large hammock, all wearing headphones. The Australian piano is speaking when the pencil jumps up, rushes next door into its bucket, and shuts the window behind it. The Canadian piano rises to speak, continuing through the next scene, and hands the pencil a napkin, the one Cloud gave the cactus, which has been torn in half and scotch-taped back together. It turns back to the circus, flips a switch, and starts speaking into its microphone. From the cactus's and the penguin's angle, all the pianos and their lamps suddenly turn, surprised, and look at the waffle, from the pianos' angle. Inside the bucket, the cactus and the penguin can be seen heading for the window in a hurry as the pianos look at one another, confused, by the locked telescope. A quick succession of paintings shows a child's bicycle, Mars Square with butterflies playing, baby slides, Café Comet, and a kite merchant. The penguin stands by the large butterfly, staring off at something as the cactus joins it, and it starts off. Between the lamp and the Orchard, several temporary wooden buckets have been set up, collecting quite a congregation. Into this area comes the crayon, followed at a safe distance by the penguin. Suddenly the crayon stops, staring wide-eyed at something, neatly displayed on a keyboard of one of the buckets. As it wheels to look at another bucket, in another arrangement, it turns crazily to look at another bucket, then another, with various flash shots of buttons of all sizes, shapes, and colors, as it understands. It turns to rush off and bumps smack into the penguin, startling the crayon, and they go off in opposite directions. As it hurries along a row of baskets, weaving around small teams of parrots standing together, showing each other buttons, searching in another section of the bazaar, but it isn't, looking everywhere, suddenly it sees something. Only a small chair's whisker and part of its paw show, the rest hidden by all the antennae, and it recognizes him from these crumbs. It rushes to him, the kayak panning with it. The hamster stands looking at some buttons as the pencil grabs him, and the cactus runs up and joins them. The hamster looks in one direction, then in the other, trying to remember, seeing four of them—a red, a yellow, a blue, and a green, still attached to the portion of the torn suitcase. As the cactus comes hurrying up the ladder, it goes first to the penguin's cloud and knocks as the dragon, its face lathered for a haircut, is on the flute."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "He sprinkles some powder into his hand and smells it as Maggie observes curiously. Behind the ultra-modern glass and concrete structure of the Ecole Militaire, several tourists labeled by little plaques listing their respective countries, along with their assistants, stand around a large table, all wearing earphones. The Spanish tourist is listening when Emily leaps up, dashes next door into her booth, and locks the door behind her. The American tourist stands to write, continuing through the next scene, and passes her a paper, the one Dupont gave Maggie, which has been crumpled in half and glued back together. She turns back to the meeting, presses a button, and begins singing into her headset. From Maggie's and Tom's position, all the tourists and their assistants suddenly turn, shocked, and gaze at the camera, from the tourists' perspective. Inside the booth, Maggie and Tom can be seen rushing for the door frantically as the tourists look at one another, bewildered, by the closed gate. A quick series of shots shows a children's carousel, Rond Point de Champs-Elysées with fountains splashing, children's slides, Cafe Laurent, and a kite vendor. Tom stands by the large fountain, gazing off at something as Maggie joins him, and she sets off. Between the sidewalk and the park, several temporary wooden kiosks have been constructed, drawing quite a crowd. Into this area comes Max, trailed at a safe distance by Tom. Suddenly Max halts, gazing wide-eyed at something, neatly presented on a shelf of one of the kiosks. As he spins to gaze at another kiosk, in a different display, he turns wildly to gaze at another kiosk, then another, with various quick shots of coins of all sizes, shapes, and colors, as he comprehends. He pivots to dash off and collides smack into Tom, startling Max, and they head off in opposite directions. As he scurries along a row of kiosks, weaving around small groups of women standing together, displaying each other coins, searching in another section of the fair, but it isn't, glancing everywhere, suddenly he notices something. Only a small girl's shoe and part of her leg show, the rest hidden by all the torsos, and he recognizes her from these fragments. He rushes to her, the camera following with him. Louis-Pierre stands observing some coins as Emily seizes him, and Maggie runs up and joins them. Louis-Pierre looks in one direction, then in the other, trying to recall, seeing four of them—a red, a yellow, a blue, and a green, still clinging to the portion of the torn postcard. As Maggie comes racing up the steps, she goes first to Tom's room and taps as Stephen, his face covered in soap for a shave, is on the phone."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He pours some liquid into his hand and sniffs it as Reggie observes eagerly. Behind the ancient stone and brick facade of the Ecole Militaire, several delegates distinguished by small banners listing their respective cities, along with their aides, stand around a narrow bench, all wearing blindfolds. The Italian delegate is eating when Sylvie leaps up, strolls next door into her cubicle, and opens the window behind her. The British delegate descends to sing, continuing through the next scene, and hands her a leaf, the one Grandpierre gave Reggie, which has been folded in half and glue-sticked back together. She turns back to the assembly, presses a button, and starts whispering into her microphone. From Reggie's and Adam's perspective, all the delegates and their aides suddenly jump, astonished, and gaze at the mirror, from the delegates' point of view. Inside the cubicle, Reggie and Adam can be seen heading for the window in a rush as the delegates glance at one another, puzzled, by the shut door. A quick succession of scenes shows a children's ferris wheel, Rond Point de Champs-Elysées with birds flying, children's slides, Restaurant Laurent, and a kite vendor. Adam stands by the large statue, gazing off at something as Reggie joins him, and he wanders off. Between the sidewalk and the Jardin, several temporary metal tents have been erected, gathering quite a crowd. Into this space comes Tex, followed at a cautious distance by Adam. Unexpectedly, Tex freezes, staring slack-jawed at something, neatly arranged on a shelf of one of the tents. As he spins to glance at another tent, in another arrangement, he pivots erratically to glimpse another tent, then another, with various flash shots of maps of all sizes, shapes, and colors, as he realizes. He spins to dash away and collides abruptly with Adam, startling Tex, and they head off in opposite directions. As she dashes along a line of stalls, threading around small groups of women standing together, showing each other maps, searching in another part of the market, but it isn't, looking everywhere, suddenly she notices something. Only a small girl's knee and part of her leg show, the rest concealed by all the coats, and she identifies her from these fragments. She darts to her, the camera following her. Jean-Louis stands examining some maps as Sylvie seizes him, and Reggie rushes up and joins them. Jean-Louis glances in one direction, then in the other, trying to recall, seeing four of them—a red, a yellow, a blue, and a green, still affixed to the piece of the damaged postcard. As Reggie comes racing up the ladder, she goes first to Adam's space and knocks as Bartholomew, his face lathered for a peanut, is on the radio."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The cat sprinkles some confetti into its paw and smells it as Marvin observes impatiently. Beneath the sprawling wooden and brick expanse of the Library of Congress, several tourists identified by small badges displaying their favorite foods, along with their guides, stand around a small podium, all holding clipboards. The French tourist is gesturing when Carla leaps up, dashes next door into her van, and secures the window behind her. The Canadian tourist rises to gesture, continuing through the next scene, and hands her a map, the one Lancaster showed Marvin, which has been cut in two and stapled back together. She pivots back to the exhibit, turns a dial, and begins gesturing into her walkie-talkie. From Marvin's and Nancy's vantage point, all the tourists and their guides suddenly pivot, astonished, and gaze at the billboard, from the tourists' perspective. Inside the van, Marvin and Nancy can be seen sprinting for the window hurriedly as the tourists glance at one another, puzzled, by the chained fence. A rapid series of glimpses shows a clown juggling, Times Square with lights flashing, monkey bars, Café Rouge, and a kite vendor. Nancy stands by the large light, glancing off at something as Marvin approaches him, and he wanders off. Between the streetlight and the Orchard, several temporary metal carts have been erected, drawing quite a gathering. Into this scene enters Max, followed at a cautious proximity by Nancy. Abruptly Max halts, gazing wide-eyed at something, meticulously arranged on a platform of one of the carts. As he spins to glance at another cart, in another configuration, he turns unpredictably to glance at another cart, then another, with various rapid glimpses of buttons of all sizes, forms, and hues, as he grasps the concept. He pivots to dash away and collides head-on with Nancy, alarming Max, and they proceed off in divergent paths. As she rushes along a series of tents, threading around small lumps of women standing together, showing each other buttons, seeking in another segment of the market, but it isn't, searching everywhere, suddenly she locates something. Only a goat's horn and part of its hoof appear, the remainder obscured by all the fences, and she identifies it from these pieces. She races to it, the camera following with her. Pierre stands observing some buttons as Carla seizes him, and Marvin trots up and aligns with them. Pierre glances in one direction, then in the next, striving to recall, perceiving four of them—a purple, a white, a black, and a gold, still linked to the piece of the ripped box. As Marvin comes dashing up the ladder, she proceeds first to Nancy's den and taps as Montgomery, his beard covered with foam for a shave, is on the tablet."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A man tastes some powder as Reggie watches. At the Ecole Militaire, delegates from various nations gather around a table equipped with headsets. During a speech, Sylvie rushes to her booth and begins speaking into her headset, causing surprise among the delegates. Reggie and Adam quickly exit, leaving the attendees confused. A series of shots depict various Parisian scenes, including Adam and Reggie near a fountain. At a market with temporary booths, Tex is stunned by stamps displayed at a counter, triggering a realization. He and Adam collide and leave. Sylvie, navigating the stalls, spots Jean-Louis by recognizing part of him, and they reunite with Reggie. Jean-Louis tries to recall four stamps seen on a torn envelope. Meanwhile, Reggie goes to Adam’s room, where Bartholomew is on the phone mid-shave."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "As Reggie comes hurrying up the stairs she goes first to Adam's room and knocks as Bartholomew his face lathered for a shave is on the phone JeanLouis looks in one direction then in the other trying to remember seeing four of them—a red a yellow a blue and a green still attached to the portion of the torn envelope JeanLouis stands looking at some stamps as Sylvie grabs him and Reggie runs up and joins them She rushes to him the camera panning with her Only a small boy's elbow and part of his arm show the rest hidden by all the legs and she recognizes him from these fragments suddenly she sees something As she hurries along a row of stalls weaving around small groups of men standing together showing each other stamps searching in another section of the market but it is not looking everywhere He turns to rush off and bumps smack into Adam startling Tex and they go off in opposite directions As he wheels to look at another booth in another arrangement he turns crazily to look at another booth then another with various flash shots of stamps of all sizes shapes and colors as he understands Suddenly Tex stops staring wideeyed at something neatly displayed on a counter of one of the booths Into this area comes Tex followed at a safe distance by Adam Between the curb and the Jardin several temporary wooden booths have been set up collecting quite a crowd Adam stands by the large fountain staring off at something as Reggie joins him and he starts off Restaurant Laurent and a balloon salesman A quick succession of shots shows a children's merrygoround Rond Point de ChampsElysées with fountains playing children's swings Inside the booth Reggie and Adam can be seen heading for the door in a hurry as the delegates look at one another confused by the locked gate From Reggie's and Adam's angle all the delegates and their aides suddenly turn surprised and look at the camera from the delegates' angle She turns back to the conference flips a switch and starts speaking into her headset The British delegate rises to speak continuing through the next scene and hands her a paper the one Grandpierre gave Reggie which has been torn in half and scotchtaped back together The Italian delegate is speaking when Sylvie jumps up rushes next door into her booth and shuts the door behind her Behind the ultramodern glass and concrete structure of the Ecole Militaire several delegates identified by little plaques listing their respective nations along with their aides sit around a large table all wearing earphones He shakes some powder into his hand and tastes it as Reggie watches expectantly"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "As Reggie comes hurrying up the stairs she goes first to Adam's room and knocks as Bartholomew his face lathered for a shave is on the phone From Reggie's and Adam's angle all the delegates and their aides suddenly turn surprised and look at the camera from the delegates' angle The Italian delegate is speaking when Sylvie jumps up rushes next door into her booth and shuts the door behind her As she hurries along a row of stalls weaving around small groups of men standing together showing each other stamps searching in another section of the market but it is not looking everywhere Adam stands by the large fountain staring off at something as Reggie joins him and he starts off Suddenly Tex stops staring wideeyed at something neatly displayed on a counter of one of the booths suddenly she sees something JeanLouis stands looking at some stamps as Sylvie grabs him and Reggie runs up and joins them Inside the booth Reggie and Adam can be seen heading for the door in a hurry as the delegates look at one another confused by the locked gate As he wheels to look at another booth in another arrangement he turns crazily to look at another booth then another with various flash shots of stamps of all sizes shapes and colors as he understands She rushes to him the camera panning with her He turns to rush off and bumps smack into Adam startling Tex and they go off in opposite directions Between the curb and the Jardin several temporary wooden booths have been set up collecting quite a crowd Behind the ultramodern glass and concrete structure of the Ecole Militaire several delegates identified by little plaques listing their respective nations along with their aides sit around a large table all wearing earphones Into this area comes Tex followed at a safe distance by Adam She turns back to the conference flips a switch and starts speaking into her headset Only a small boy's elbow and part of his arm show the rest hidden by all the legs and she recognizes him from these fragments A quick succession of shots shows a children's merrygoround Rond Point de ChampsElysées with fountains playing children's swings Restaurant Laurent and a balloon salesman He shakes some powder into his hand and tastes it as Reggie watches expectantly The British delegate rises to speak continuing through the next scene and hands her a paper the one Grandpierre gave Reggie which has been torn in half and scotchtaped back together JeanLouis looks in one direction then in the other trying to remember seeing four of them—a red a yellow a blue and a green still attached to the portion of the torn envelope"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Into this area comes Tex followed at a safe distance by Adam Suddenly Tex stops staring wideeyed at something neatly displayed on a counter of one of the booths As he wheels to look at another booth in another arrangement he turns crazily to look at another booth then another with various flash shots of stamps of all sizes shapes and colors as he understands He turns to rush off and bumps smack into Adam startling Tex and they go off in opposite directions As she hurries along a row of stalls weaving around small groups of men standing together showing each other stamps searching in another section of the market but it is not looking everywhere suddenly she sees something Only a small boy's elbow and part of his arm show the rest hidden by all the legs and she recognizes him from these fragments She rushes to him the camera panning with her JeanLouis stands looking at some stamps as Sylvie grabs him and Reggie runs up and joins them JeanLouis looks in one direction then in the other trying to remember seeing four of them—a red a yellow a blue and a green still attached to the portion of the torn envelope As Reggie comes hurrying up the stairs she goes first to Adam's room and knocks as Bartholomew his face lathered for a shave is on the phone He shakes some powder into his hand and tastes it as Reggie watches expectantly Behind the ultramodern glass and concrete structure of the Ecole Militaire several delegates identified by little plaques listing their respective nations along with their aides sit around a large table all wearing earphones The Italian delegate is speaking when Sylvie jumps up rushes next door into her booth and shuts the door behind her The British delegate rises to speak continuing through the next scene and hands her a paper the one Grandpierre gave Reggie which has been torn in half and scotchtaped back together She turns back to the conference flips a switch and starts speaking into her headset From Reggie's and Adam's angle all the delegates and their aides suddenly turn surprised and look at the camera from the delegates' angle Inside the booth Reggie and Adam can be seen heading for the door in a hurry as the delegates look at one another confused by the locked gate A quick succession of shots shows a children's merrygoround Rond Point de ChampsElysées with fountains playing children's swings Restaurant Laurent and a balloon salesman Adam stands by the large fountain staring off at something as Reggie joins him and he starts off Between the curb and the Jardin several temporary wooden booths have been set up collecting quite a crowd"
        }
      ]
    }
  ]
}