{
  "ground_truth": "He looks over at Charlie, asleep in the next bed, then rolls out of bed and goes to the window, where he sees a neon sign flashing across the street that reads AMES BILLIARDS. Eddie returns to his bed, leaves the keys to the Packard and some money on the night table next to Charlie, picks up his valise, his hanging bag, and his leather cue case, and goes toward the door. As Eddie enters, carrying his bags, a few early morning travelers -- some soldiers and a man in a Stetson hat -- pass him by. He has been up all night. It is a typical bus station washroom at that time of the morning, with the residue of a full day's traveling in evidence: crumpled paper towels, cigarette butts, and more. Part of the residue is a drunk who sits on the shoeshine seat, fast asleep. Eddie looks at him, shaking his head. A sign on the wall reads IS THIS YOUR LUCKY DAY? Eddie laughs to himself, puts his hanging bag and cue case on a chair, then turns to face his image in the mirror. A wizened old attendant sits nearby, whose every move seems to require a tremendous effort, and shuffles over to grab a towel as Eddie removes his jacket. Near the row of coin lockers in the waiting room is a small lunch counter and several tables. At one table, facing the lockers, is a young woman, Sarah: a book is open before her, and a cup of coffee, and an ashtray filled with cigarette butts. She looks up for an instant as Eddie appears, then her eyes return to the printed page. He locks his bags in a locker and now has on a clean shirt and is clean and freshly shaven. Moving toward the counter, Eddie notices Sarah and goes to the lunch counter, still looking at her. He sniffs some wrapped sandwiches, then wanders over to a table next to Sarah's and sits down. She ignores him and returns to her reading. Eddie keeps looking at her. Her hair is brown, cut short, practically straight. Her lips are pale and thin, and the bone structure of her face, although delicate, is much in evidence. There is a suggestion of tired wakefulness, of self-sufficiency about her, and a frank, open regard which has nothing in it to imply flirtation -- or the lack of it. Sarah goes back to reading. The waitress arrives to take Eddie's order, and Eddie holds up two fingers to the waitress, who departs. The coffee comes, and Eddie leans back against the wall and shuts his eyes. He slips off to sleep, and the waitress brings a check.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He glances over at Charlie, snoozing in the adjacent cot, then slides out of bed and proceeds to the pane, where he observes a neon display flickering across the avenue that states AMES BILLIARDS. Eddie returns to his cot, places the keys to the Packard and some cash on the nightstand next to Charlie, picks up his suitcase, his garment bag, and his leather cue case, and heads toward the portal. As Eddie enters, bearing his luggage, a few early dawn voyagers -- some servicemen and a gentleman in a Stetson hat -- pass him by. He has been awake all night. It is a typical bus terminal lavatory at that hour of the morning, with the debris of a full day's journeying in evidence: rumpled paper towels, cigarette stubs, and more. Part of the debris is an inebriate who sits on the shoeshine seat, sound asleep. Eddie looks at him, shaking his head. A sign on the partition reads IS THIS YOUR FORTUNATE DAY? Eddie chuckles to himself, puts his garment bag and cue case on a chair, then turns to confront his reflection in the mirror. A wizened aged attendant sits nearby, whose every motion seems to demand a colossal effort, and shuffles over to seize a towel as Eddie removes his coat. Near the row of coin-operated lockers in the waiting area is a small luncheon counter and several tables. At one table, facing the lockers, is a young woman, Sarah: a volume is open before her, and a cup of coffee, and an ashtray filled with cigarette stubs. She glances up for a moment as Eddie appears, then her gaze returns to the printed page. He locks his luggage in a locker and now wears a fresh shirt and is clean and newly shaven. Advancing toward the counter, Eddie notices Sarah and goes to the luncheon counter, still gazing at her. He sniffs some wrapped sandwiches, then meanders over to a table next to Sarah's and sits down. She disregards him and resumes her reading. Eddie keeps watching her. Her hair is brown, cropped short, practically straight. Her lips are pale and thin, and the bone structure of her face, although delicate, is much in evidence. There is a suggestion of tired wakefulness, of self-reliance about her, and a frank, open gaze which has nothing in it to imply coquetry -- or the absence of it. Sarah returns to reading. The waitress arrives to take Eddie's order, and Eddie raises two fingers to the waitress, who leaves. The coffee arrives, and Eddie leans back against the partition and closes his eyes. He drifts off to slumber, and the waitress brings a bill."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Charlie, asleep in the next bed, is looked over by him, then the bed is rolled out of by him, and the window is approached, where a neon sign flashing across the street that reads AMES BILLIARDS is seen by him. The bed is returned to by Eddie, and the keys to the Packard and some money are left on the night table next to Charlie by him, his valise, his hanging bag, and his leather cue case are picked up, and the door is approached. As the room is entered by Eddie, carrying his bags, a few early morning travelers -- some soldiers and a man in a Stetson hat -- pass by him. He stayed up all night. At that time of the morning, a typical bus station washroom is found by him, with the residue of a full day's traveling evident: crumpled paper towels, cigarette butts, and more. Part of the residue is observed to be a drunk who sits on the shoeshine seat, fast asleep. The man is looked at by Eddie, his head shaking. A sign on the wall is read by Eddie: IS THIS YOUR LUCKY DAY? He laughs to himself, his hanging bag and cue case are put on a chair, then his image is faced in the mirror. A wizened old attendant sits nearby, whose every move seems to require a tremendous effort, and a towel is shuffled over to grab as Eddie removes his jacket. Near the row of coin lockers in the waiting room, a small lunch counter and several tables are located. At one table, facing the lockers, sits a young woman, Sarah: a book is opened before her, accompanied by a cup of coffee, and an ashtray filled with cigarette butts. For an instant, Eddie is looked up by her as he appears, then the printed page is returned to by her eyes. His bags are locked by him in a locker, and a clean shirt is put on, resulting in a clean and freshly shaven appearance. Moving toward the counter, Sarah is noticed by Eddie, and the lunch counter is approached by him, eyes still on her. Some wrapped sandwiches are sniffed by him, then a table next to Sarah's is wandered over to and sat down at. He is ignored by her, and her reading is returned to by her. She is kept being looked at by Eddie. Her hair, brown and cut short, appears practically straight. Her lips appear pale and thin, and the bone structure of her face, although delicate, is much in evidence. A suggestion of tired wakefulness, of self-sufficiency, is conveyed by her, and a frank, open regard is presented, which has nothing in it to imply flirtation -- or the lack of it. Her reading is returned to by Sarah. Eddie's order is taken by the waitress who arrives, and two fingers are held up by Eddie to the waitress, who departs. The coffee is delivered, and the wall is leaned back against by Eddie, and his eyes are shut. Sleep overtakes him, and a check is brought by the waitress."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Eddie glances at Charlie, asleep in the next bed, then goes to the window and sees a neon sign flashing AMES BILLIARDS across the street. He returns to leave keys and money by Charlie, picks up his valise, hanging bag, and leather cue case, and heads to the door. Entering a bus station washroom, Eddie, who has been up all night, encounters a typical scene: crumpled towels, cigarette butts, and a sleeping drunk on the shoeshine seat. A sign reads IS THIS YOUR LUCKY DAY? Chuckling, Eddie places his bags on a chair and faces the mirror. A tired attendant fetches a towel as Eddie removes his jacket. Near coin lockers is a lunch counter and tables. At one table, a young woman, Sarah, reads with coffee and an ashtray. Eddie locks his bags, dons a clean shirt, and notices Sarah as he approaches the counter. He sits beside her, observing. Her short brown hair and delicate bone structure suggest self-sufficiency without flirtation. Ignoring him, she continues reading. Eddie orders coffee by holding up two fingers. As he leans back to sleep, the waitress delivers a check."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Eddie glances at sleeping Charlie, then gets up to see the neon sign \"AMES BILLIARDS\" outside the window. He places Packard keys and money by Charlie's bed, grabs his belongings, and heads out. At the bus station washroom, it's early morning, with remnants of travel littered around, including a drunk asleep on the shoeshine seat. Eddie chuckles at a sign, places his bags on a chair, and freshens up. In the waiting room, Sarah, a young woman, reads with coffee and cigarettes. Eddie locks his bags, dons a clean shirt, and notices Sarah while moving to the lunch counter. Sitting near her, he observes her pale, thin-lipped face, her tired yet self-sufficient demeanor. As Sarah returns to her book, Eddie holds up two fingers to order from the waitress, closes his eyes, and drifts to sleep as she brings the check."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He glances over at Charlie, who is sound asleep in the bed next to his, before carefully rolling out of his own bed and making his way over to the window. From there, he spots a bright neon sign flashing vibrantly across the street, displaying the words AMES BILLIARDS in eye-catching lettering. Eddie then returns to his bedside, placing the keys to the Packard along with some money on the night table beside Charlie. He picks up his valise, hanging bag, and his leather cue case, and heads towards the door with purpose. As Eddie enters, carrying his collection of bags, he is passed by a handful of early morning travelers – a few soldiers and a man wearing a distinctive Stetson hat. Eddie has been up throughout the entire night, unable to find rest. The bus station washroom he enters is entirely typical for that time of the morning, littered with the remnants of a full day’s worth of traveling: crumpled paper towels, discarded cigarette butts, and other debris abound. Among this residue is a drunkard, who occupies the shoeshine seat, fast asleep and oblivious to the world around him. Eddie observes him and shakes his head in quiet disapproval. A sign affixed to the wall asks in bold letters IS THIS YOUR LUCKY DAY? Eddie chuckles softly to himself, places his hanging bag and cue case down on a nearby chair, and then turns around to face his own reflection in the mirror. Nearby sits a wizened old attendant whose every movement appears to demand tremendous effort, shuffling slowly over to fetch a towel as Eddie removes his jacket. Adjacent to the row of coin lockers located within the waiting room is a modest lunch counter accompanied by several tables. Seated at one of these tables, facing toward the lockers, is a young woman named Sarah. A book lies open before her, alongside a solitary cup of coffee and an ashtray filled with numerous cigarette butts. As Eddie makes his entrance, she briefly lifts her gaze to acknowledge his presence before returning her attention to the printed words on the page. Eddie proceeds to secure his bags in one of the lockers and has since changed into a clean shirt, now looking fresh and freshly shaved. Moving towards the counter, he notices Sarah once more and approaches the lunch counter, continuing to keep his eyes on her. Curiously, he sniffs some wrapped sandwiches, then ambles over to a table positioned next to Sarah’s and takes a seat. She continues to ignore him, engrossed in her reading, while Eddie maintains his gaze on her. Her hair is brown, cut short, and nearly straight. Her lips are pale and thin, while the structure of her face is delicate yet pronounced. There exists a hint of tired wakefulness and self-sufficiency about her, alongside a candid, open demeanor with no implication of flirtation nor the absence of it. Sarah resumes her reading, seemingly unbothered. The waitress arrives to take Eddie’s order, and he holds up two fingers to indicate his choice. The waitress departs only to return shortly with his coffee. Eddie leans back against the wall, shutting his eyes in an attempt to rest. He drifts off to sleep as the waitress discreetly brings him the check."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He casts a brief glance over at Charlie, who is completely sound asleep in the bed positioned right next to his own, before he carefully rolls out of his bed and quietly makes his way over to the nearby window. From his vantage point there, he spots a bright neon sign that is flashing vibrantly across the street, boldly displaying the words AMES BILLIARDS in eye-catching, bold lettering. Eddie then returns to his bedside and places both the keys to the Packard and some money neatly on the night table beside Charlie. He carefully picks up his valise, the hanging bag, and his leather cue case, then purposefully heads toward the door. As Eddie moves through the space and enters the area, carrying his collection of various bags, he is passed by a handful of early morning travelers – a few soldiers and a man adorned with a distinctive Stetson hat. Eddie has been up throughout the entire night, unable to find any semblance of rest. The bus station washroom he enters is entirely typical for that specific time of the morning, littered with the remnants of a full day's worth of traveling: crumpled paper towels, discarded cigarette butts, and an array of other debris abound. Among all this residue is a drunkard, occupying the shoeshine seat, fast asleep and completely oblivious to the world around him. Eddie takes a moment to observe him and shakes his head in quiet disapproval. A sign affixed to the wall poses a question in bold letters: IS THIS YOUR LUCKY DAY? Eddie chuckles softly to himself, gently places his hanging bag and cue case down on a nearby chair, and then turns around to face his own reflection in the mirror. Nearby sits a wizened old attendant whose every single movement seems to demand tremendous effort, as he shuffles slowly over to fetch a towel while Eddie methodically removes his jacket. Adjacent to the row of coin lockers located within the waiting room, there's a modest lunch counter accompanied by several tables. Seated at one of these tables, facing toward the lockers, is a young woman named Sarah. An open book lies before her, alongside a solitary cup of coffee and an ashtray filled with numerous cigarette butts. As Eddie makes his entrance, she briefly lifts her gaze to acknowledge his presence before returning her attention to the printed words on the page. Eddie proceeds to secure his bags in one of the lockers and has since changed into a clean shirt, now looking fresh and freshly shaved. Moving towards the counter, he notices Sarah once more and approaches the lunch counter, continuing to keep his eyes on her. Curiously, he sniffs some wrapped sandwiches, then casually ambles over to a table positioned next to where Sarah is seated and takes a seat himself. She continues to ignore him, remaining engrossed in her reading, while Eddie maintains his steady gaze on her. Her hair is brown, cut short, and nearly straight. Her lips are pale and thin, while the structure of her face is delicate yet pronounced. There exists a hint of tired wakefulness and self-sufficiency about her, alongside a candid, open demeanor with no implication of flirtation nor the absence of it. Sarah resumes her reading, seemingly unbothered. The waitress eventually arrives to take Eddie's order, and he simply holds up two fingers to indicate his choice. The waitress departs, only to return shortly with his coffee. Eddie leans back against the wall comfortably, shutting his eyes in an attempt to find some rest. He eventually drifts off to sleep as the waitress discreetly brings him the check."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He glances over at Charlie, who is sound asleep in the next bed, and then carefully rolls himself out of his own bed. Making his way across the room, he heads towards the window, where he peers outside and notices a neon sign flashing vibrantly across the street with the words AMES BILLIARDS illuminated. With this vision still in his mind, he turns away from the window and walks back towards his bed. Once there, he deliberately places the keys to the Packard, along with some money, onto the night table beside Charlie, ensuring it is within easy reach. He then bends down to pick up his valise, grabs his hanging bag, and secures his leather cue case before resolutely moving towards the door. Entering the scene with his bags in tow, he encounters a few early morning travelers, including some weary soldiers and a man sporting a distinctive Stetson hat, as they pass him by in the opposite direction. It is evident that he has stayed awake throughout the entire night leading up to this moment. The bus station washroom he finds himself in epitomizes the dreariness of early morning travel, with crumpled paper towels and cigarette butts scattered across the floor, remnants of a full day of travelers passing through. Part of this disarray is the presence of a drunkard slumped over in the shoeshine seat, deep in a state of sleep. Observing this scene, he simply shakes his head in mild disapproval or amusement. A sign mounted on the wall catches his attention, posing the question IS THIS YOUR LUCKY DAY? This provokes a laugh from him, a chuckle he keeps to himself, before he places his hanging bag and cue case onto a nearby chair. Turning then to squarely face the mirror, he takes a moment to confront his own reflection. Nearby, an elderly washroom attendant, whose every movement seems to demand a great deal of effort, laboriously shuffles over to hand him a towel as he methodically removes his jacket. Shifting from this area towards the row of coin lockers located in the waiting room, he notes a small lunch counter accompanied by several tables positioned near these lockers. Occupying one of these tables, directly facing the lockers, is a young woman named Sarah, engrossed in the open book before her. Beside the book sits a cup of coffee and an ashtray overflowing with cigarette butts. As he appears in her vicinity, she momentarily glances up, offering only a fleeting acknowledgment before her focus returns to the printed page. With his bags now securely locked away in one of the lockers, he emerges freshly dressed in a clean shirt, his face cleanly shaved and exuding a refreshed demeanor. Approaching the counter, his attention is caught by Sarah, prompting him to walk towards the lunch counter while maintaining his gaze on her. He takes a moment to smell some wrapped sandwiches on display before meandering over to a table adjacent to Sarah's, where he settles into a seat. Despite his presence, she continues to ignore him, absorbed in her reading once more. Eddie takes the opportunity to study her further, noting her short-cut, straight brown hair, her pale and slender lips, and the delicate bone structure of her face, which is readily apparent. There is an impression of weary wakefulness that emanates from her, a strong sense of self-sufficiency, and an honest, straightforward regard that neither suggests flirtation nor dismisses it. Unperturbed, Sarah continues her reading. A waitress soon approaches Eddie to take his order, and he nonchalantly raises two fingers to communicate his request, prompting the waitress to attend to his needs. Shortly after, the coffee is brought to him, and he leans back against the wall, allowing himself a moment of relaxation. Shutting his eyes, he begins to drift into slumber, undisturbed even as the waitress silently places the check on his table."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Eddie, observing Charlie asleep in the next bed, quietly leaves some money and the Packard keys on the night table before gathering his belongings and heading out. As he reaches the bus station, carrying his bags, he passes early morning travelers, including soldiers and a man in a Stetson hat, reflecting on the long night he's had. The washroom, a scene of travel-worn debris, also hosts a drunk asleep on the shoeshine seat, prompting Eddie to shake his head in amusement at a sign asking if it's one's lucky day. Placing his bags on a chair, he catches sight of his reflection in the mirror, while an old attendant sluggishly fetches a towel. After freshening up, Eddie secures his bags in a locker and notices a young woman, Sarah, engrossed in a book at a nearby table. Intrigued, he approaches the lunch counter, checking some sandwiches, before sitting at a table beside her. Despite his glances, she remains immersed in reading, exuding an air of tired wakefulness and self-assuredness. With a subtle gesture, Eddie orders coffee from the waitress, who later returns with the check, as he leans back, closing his eyes and drifting off to sleep."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He looks over at Charlie, asleep in the next bed, as the early morning light filters through the curtains of the budget-friendly motel they chose for its proximity to their destination, then rolls out of bed and goes to the window, where he sees a neon sign flashing across the street that reads AMES BILLIARDS, a local pool hall known for its late-night clientele and competitive games. Eddie returns to his bed, leaves the keys to the Packard, a classic car model popular in the mid-20th century, and some money on the night table next to Charlie, picks up his valise, his hanging bag, and his leather cue case, a specialist's choice for carrying a pool cue in pristine condition, and goes toward the door. As Eddie enters the bus station washroom, carrying his bags, a few early morning travelers -- some soldiers returning home on leave and a man in a Stetson hat, perhaps a rancher from the Midwest -- pass him by. He has been up all night, likely contemplating the high-stakes game he's headed to. It is a typical bus station washroom at that time of the morning, with the residue of a full day's traveling in evidence: crumpled paper towels, cigarette butts, and more. Part of the residue is a drunk, an unfortunate common sight in such transient places, who sits on the shoeshine seat, fast asleep. Eddie looks at him, shaking his head. A sign on the wall reads IS THIS YOUR LUCKY DAY?, a slogan frequently used in the 1950s to draw in hopeful gamblers. Eddie laughs to himself, puts his hanging bag and cue case on a chair, then turns to face his image in the mirror. A wizened old attendant, who has worked these early morning shifts for years and whose every move seems to require a tremendous effort, shuffles over to grab a towel as Eddie removes his jacket. Near the row of coin lockers in the waiting room is a small lunch counter, a popular spot for quick meals among travelers, and several tables. At one table, facing the lockers, is a young woman, Sarah: a book is open before her, suggesting she's engrossed in a novel or perhaps studying, and a cup of coffee, and an ashtray filled with cigarette butts. She looks up for an instant as Eddie appears, then her eyes return to the printed page. He locks his bags in a locker, a standard practice to keep belongings safe in busy stations, and now has on a clean shirt and is clean and freshly shaven. Moving toward the counter, Eddie notices Sarah and goes to the lunch counter, still looking at her. He sniffs some wrapped sandwiches, likely pre-made and sold for the convenience of hurried travelers, then wanders over to a table next to Sarah's and sits down. She ignores him and returns to her reading. Eddie keeps looking at her. Her hair is brown, cut short, practically straight, a practical style for the era. Her lips are pale and thin, and the bone structure of her face, although delicate, is much in evidence. There is a suggestion of tired wakefulness, of self-sufficiency about her, and a frank, open regard which has nothing in it to imply flirtation -- or the lack of it. Sarah goes back to reading. The waitress, whose uniform is typical of the 1950s diner attire, arrives to take Eddie's order, and Eddie holds up two fingers to the waitress, who departs, understanding his request for two coffees. The coffee comes, and Eddie leans back against the wall and shuts his eyes. He slips off to sleep, and the waitress brings a check, placing it quietly on the table to not disturb the few patrons enjoying a brief respite before continuing their journeys."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The coffee comes and Eddie leans back against the wall and shuts his eyes He looks over at Charlie asleep in the next bed then rolls out of bed and goes to the window where he sees a neon sign flashing across the street that reads He looks over at Charlie asleep in the next bed then rolls out of bed and goes to the window where he sees a neon sign flashing across the street that reads AMES BILLIARDS Eddie returns to his bed leaves the keys to the Packard and some money on the night table next to Charlie picks up his valise his hanging bag and his leather cue case and goes toward the door As Eddie enters carrying his bags a few early morning travelers  some soldiers and a man in a Stetson hat  pass him by He has been up all night It is a typical bus station washroom at that time of the morning with the residue of a full day's traveling in evidence crumpled paper towels cigarette butts and more She ignores him and returns to her reading The waitress arrives to take Eddie's order and Eddie holds up two fingers to the waitress who departs As Eddie enters carrying his bags a few early morning travelers  some soldiers and a man in a Stetson hat  pass him by He locks his bags in a locker and now has on a clean shirt and is clean and freshly shaven Part of the residue is a drunk who sits on the shoeshine seat fast asleep She looks up for an instant as Eddie appears then her eyes return to the printed page Eddie looks at him shaking his head A sign on the wall reads Her lips are pale and thin and the bone structure of her face although delicate is much in evidence IS THIS YOUR LUCKY DAY Eddie looks at him shaking his head AMES BILLIARDS Eddie laughs to himself puts his hanging bag and cue case on a chair then turns to face his image in the mirror A wizened old attendant sits nearby whose every move seems to require a tremendous effort and shuffles over to grab a towel as Eddie removes his jacket He has been up all night Near the row of coin lockers in the waiting room is a small lunch counter and several tables At one table facing the lockers is a young woman At one table facing the lockers is a young woman Sarah a book is open before her and a cup of coffee and an ashtray filled with cigarette butts She looks up for an instant as Eddie appears then her eyes return to the printed page He locks his bags in a locker and now has on a clean shirt and is clean and freshly shaven Moving toward the counter Eddie notices Sarah and goes to the lunch counter still looking at her Eddie returns to his bed leaves the keys to the Packard and some money on the night table next to Charlie picks up his valise his hanging bag and his leather cue case and goes toward the door He sniffs some wrapped sandwiches then wanders over to a table next to Sarah's and sits down She ignores him and returns to her reading Eddie keeps looking at her A sign on the wall reads Sarah goes back to reading Her hair is brown cut short practically straight Her lips are pale and thin and the bone structure of her face although delicate is much in evidence There is a suggestion of tired wakefulness of selfsufficiency about her and a frank open regard which has nothing in it to imply flirtation  or the lack of it Sarah goes back to reading The waitress arrives to take Eddie's order and Eddie holds up two fingers to the waitress who departs The coffee comes and Eddie leans back against the wall and shuts his eyes He slips off to sleep and the waitress brings a check"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He looks over at Charlie asleep in the next bed then rolls out of bed and goes to the window where he sees a neon sign flashing across the street that reads. AMES BILLIARDS. Eddie returns to his bed leaves the keys to the Packard and some money on the night table next to Charlie picks up his valise his hanging bag and his leather cue case and goes toward the door. As Eddie enters carrying his bags a few early morning travelers  some soldiers and a man in a Stetson hat  pass him by. He has been up all night. It is a typical bus station washroom at that time of the morning with the residue of a full day's traveling in evidence crumpled paper towels cigarette butts and more. Part of the residue is a drunk who sits on the shoeshine seat fast asleep. Eddie looks at him shaking his head. A sign on the wall reads. IS THIS YOUR LUCKY DAY. Eddie laughs to himself puts his hanging bag and cue case on a chair then turns to face his image in the mirror. A wizened old attendant sits nearby whose every move seems to require a tremendous effort and shuffles over to grab a towel as Eddie removes his jacket. Near the row of coin lockers in the waiting room is a small lunch counter and several tables. At one table facing the lockers is a young woman. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Sarah. a book is open before her and a cup of coffee and an ashtray filled with cigarette butts. She looks up for an instant as Eddie appears then her eyes return to the printed page. He locks his bags in a locker and now has on a clean shirt and is clean and freshly shaven. Moving toward the counter Eddie notices Sarah and goes to the lunch counter still looking at her. He sniffs some wrapped sandwiches then wanders over to a table next to Sarah's and sits down. She ignores him and returns to her reading. Eddie keeps looking at her. Her hair is brown cut short practically straight. Her lips are pale and thin and the bone structure of her face although delicate is much in evidence. There is a suggestion of tired wakefulness of selfsufficiency about her and a frank open regard which has nothing in it to imply flirtation  or the lack of it. Sarah goes back to reading. The waitress arrives to take Eddie's order and Eddie holds up two fingers to the waitress who departs. The coffee comes and Eddie leans back against the wall and shuts his eyes. He slips off to sleep and the waitress brings a check."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He looks over at Charlie asleep in the next bed then rolls out of bed and goes to the window where he sees a neon sign flashing across the street that reads. AMES BILLIARDS. Eddie returns to his bed leaves the keys to the Packard and some money on the night table next to Charlie picks up his valise his hanging bag and his leather cue case and goes toward the door. As Eddie enters carrying his bags a few early morning travelers  some soldiers and a man in a Stetson hat  pass him by. He has been up all night. It is a typical bus station washroom at that time of the morning with the residue of a full day's traveling in evidence crumpled paper towels cigarette butts and more. Part of the residue is a drunk who sits on the shoeshine seat fast asleep. Eddie looks at him shaking his head. A sign on the wall reads. IS THIS YOUR LUCKY DAY. Eddie laughs to himself puts his hanging bag and cue case on a chair then turns to face his image in the mirror. A wizened old attendant sits nearby whose every move seems to require a tremendous effort and shuffles over to grab a towel as Eddie removes his jacket. Near the row of coin lockers in the waiting room is a small lunch counter and several tables. At one table facing the lockers is a young woman. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. Sarah. a book is open before her and a cup of coffee and an ashtray filled with cigarette butts. She looks up for an instant as Eddie appears then her eyes return to the printed page. He locks his bags in a locker and now has on a clean shirt and is clean and freshly shaven. Moving toward the counter Eddie notices Sarah and goes to the lunch counter still looking at her. He sniffs some wrapped sandwiches then wanders over to a table next to Sarah's and sits down. She ignores him and returns to her reading. Eddie keeps looking at her. Her hair is brown cut short practically straight. Her lips are pale and thin and the bone structure of her face although delicate is much in evidence. There is a suggestion of tired wakefulness of selfsufficiency about her and a frank open regard which has nothing in it to imply flirtation  or the lack of it. Sarah goes back to reading. The waitress arrives to take Eddie's order and Eddie holds up two fingers to the waitress who departs. The coffee comes and Eddie leans back against the wall and shuts his eyes. He slips off to sleep and the waitress brings a check."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He looks over at Charlie asleep in the next bed then rolls out of bed and goes to the window where he sees a neon sign flashing across the street that reads. AMES BILLIARDS. Eddie returns to his bed leaves the keys to the Packard and some money on the night table next to Charlie picks up his valise his hanging bag and his leather cue case and goes toward the door. As Eddie enters carrying his bags a few early morning travelers  some soldiers and a man in a Stetson hat  pass him by. He has been up all night. It is a typical bus station washroom at that time of the morning with the residue of a full day's traveling in evidence crumpled paper towels cigarette butts and more. Part of the residue is a drunk who sits on the shoeshine seat fast asleep. Eddie keeps looking at her. Her hair is brown cut short practically straight. Her lips are pale and thin and the bone structure of her face although delicate is much in evidence. There is a suggestion of tired wakefulness of selfsufficiency about her and a frank open regard which has nothing in it to imply flirtation  or the lack of it. Sarah goes back to reading. The waitress arrives to take Eddie's order and Eddie holds up two fingers to the waitress who departs. The coffee comes and Eddie leans back against the wall and shuts his eyes. He slips off to sleep and the waitress brings a check."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He looks over at Charlie asleep in the next bed then rolls out of bed and goes to the window where he sees a neon sign flashing across the street that reads. AMES BILLIARDS. Eddie returns to his bed leaves the keys to the Packard and some money on the night table next to Charlie picks up his valise his hanging bag and his leather cue case and goes toward the door. The waitress arrives to take Eddie's order and Eddie holds up two fingers to the waitress who departs. The coffee comes and Eddie leans back against the wall and shuts his eyes. He slips off to sleep and the waitress brings a check."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dog looks over at Charlie, asleep in the next bed, then rolls out of bed and goes to the window, where the dog sees a neon sign flashing across the street that reads AMES BILLIARDS. The parrot returns to its bed, leaves the keys to the Packard and some money on the night table next to Charlie, picks up its valise, its hanging bag, and its leather cue case, and goes toward the door. As the cat enters, carrying its bags, a few early morning travelers -- some soldiers and a man in a Stetson hat -- pass the cat by. The cat has been up all night. It is a typical bus station washroom at that time of the morning, with the residue of a full day's traveling in evidence: crumpled paper towels, cigarette butts, and more. Part of the residue is a squirrel who sits on the shoeshine seat, fast asleep. The cat looks at the squirrel, shaking its head. A sign on the wall reads IS THIS YOUR LUCKY DAY? The cat laughs to itself, puts its hanging bag and cue case on a chair, then turns to face its image in the mirror. A wizened old attendant sits nearby, whose every move seems to require a tremendous effort, and shuffles over to grab a towel as the cat removes its jacket. Near the row of coin lockers in the waiting room is a small lunch counter and several tables. At one table, facing the lockers, is a young giraffe, Sarah: a book is open before the giraffe, and a cup of coffee, and an ashtray filled with cigarette butts. The giraffe looks up for an instant as the cat appears, then its eyes return to the printed page. The cat locks its bags in a locker and now has on a clean shirt and is clean and freshly shaven. Moving toward the counter, the cat notices the giraffe and goes to the lunch counter, still looking at the giraffe. The cat sniffs some wrapped sandwiches, then wanders over to a table next to the giraffe's and sits down. The giraffe ignores the cat and returns to its reading. The cat keeps looking at the giraffe. The giraffe's hair is brown, cut short, practically straight. Its lips are pale and thin, and the bone structure of its face, although delicate, is much in evidence. There is a suggestion of tired wakefulness, of self-sufficiency about the giraffe, and a frank, open regard which has nothing in it to imply flirtation -- or the lack of it. The giraffe goes back to reading. The penguin arrives to take the cat's order, and the cat holds up two fingers to the penguin, who departs. The coffee comes, and the cat leans back against the wall and shuts its eyes. The cat slips off to sleep, and the penguin brings a check."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He looks over at Charlie, asleep in the next hammock, then rolls out of bed and goes to the balcony, where he sees a billboard flashing across the street that reads AMES BOUTIQUE. Eddie returns to his bed, leaves the keys to the Cadillac and some money on the bedside table next to Charlie, picks up his suitcase, his garment bag, and his leather violin case, and goes toward the door. As Eddie enters, carrying his bags, a few early morning commuters -- some firefighters and a man in a beanie hat -- pass him by. He has been up all night. It is a typical train station restroom at that time of the morning, with the residue of a full day's traveling in evidence: crumpled napkins, candy wrappers, and more. Part of the residue is a busker who sits on the bench, fast asleep. Eddie looks at him, shaking his head. A sign on the wall reads IS THIS YOUR FORTUNATE MOMENT? Eddie laughs to himself, puts his garment bag and violin case on a stool, then turns to face his image in the glass. A wizened old janitor sits nearby, whose every move seems to require a tremendous effort, and shuffles over to grab a cloth as Eddie removes his jacket. Near the row of coin banks in the waiting room is a small snack kiosk and several booths. At one booth, facing the banks, is a young woman, Sarah: a magazine is open before her, and a cup of tea, and a dish filled with candy wrappers. She looks up for an instant as Eddie appears, then her eyes return to the printed page. He locks his bags in a bank and now has on a clean sweater and is clean and freshly shaven. Moving toward the kiosk, Eddie notices Sarah and goes to the snack kiosk, still looking at her. He sniffs some wrapped pastries, then wanders over to a booth next to Sarah's and sits down. She ignores him and returns to her reading. Eddie keeps looking at her. Her hair is brown, cut short, practically straight. Her lips are pale and thin, and the bone structure of her face, although delicate, is much in evidence. There is a suggestion of tired wakefulness, of self-sufficiency about her, and a frank, open regard which has nothing in it to imply flirtation -- or the lack of it. Sarah goes back to reading. The cashier arrives to take Eddie's order, and Eddie holds up two fingers to the cashier, who departs. The tea comes, and Eddie leans back against the booth and shuts his eyes. He slips off to sleep, and the cashier brings a bill."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He glances over at Charlie, asleep in the next bed, then slips out of bed and strides to the window, where he observes a neon sign pulsing across the street that reads AMES BILLIARDS. Eddie shuffles back to his bed, places the keys to the Packard and some money on the night table next to Charlie, grabs his valise, his hanging bag, and his leather cue case, and heads toward the door. As Eddie steps in, carrying his bags, a few early morning travelers -- some soldiers and a man in a Stetson hat -- glance at him. He has been awake all night. It is a typical bus station washroom at that time of the morning, with the aftermath of a full day's traveling on display: crumpled paper towels, cigarette butts, and more. Part of the aftermath is a drunk who perches on the shoeshine seat, fast asleep. Eddie peers at him, nodding his head. A sign on the wall states IS THIS YOUR LUCKY DAY? Eddie smirks to himself, lays his hanging bag and cue case on a chair, then rotates to admire his image in the mirror. A wizened old attendant rests nearby, whose every gesture seems to require a tremendous effort, and inches over to snatch a towel as Eddie peels off his jacket. Near the row of coin lockers in the waiting room is a small lunch counter and several tables. At one table, facing the lockers, is a young woman, Sarah: a book is spread before her, and a cup of coffee, and an ashtray overflowing with cigarette butts. She glances up briefly as Eddie arrives, then her eyes drift back to the printed page. He stows his bags in a locker and now sports a clean shirt and is clean and freshly shaven. Venturing toward the counter, Eddie observes Sarah and drifts to the lunch counter, still gazing at her. He examines some wrapped sandwiches, then meanders over to a table adjoining Sarah's and settles down. She disregards him and resumes her reading. Eddie continues watching her. Her hair is brown, cropped short, practically straight. Her lips are pale and thin, and the bone structure of her face, although delicate, is pronounced. There is a hint of fatigued alertness, of self-sufficiency about her, and a frank, open gaze which has nothing in it to suggest flirtation -- or the absence of it. Sarah returns to reading. The waitress approaches to jot down Eddie's order, and Eddie signals with two fingers to the waitress, who retreats. The coffee arrives, and Eddie leans back against the wall and closes his eyes. He drifts off to sleep, and the waitress places a check."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The lamp gazes over at the bicycle, dozing in the next armchair, then rolls out of the armchair and goes to the curtain, where the lamp observes a neon fish glimmering across the avenue that reads LOUIE'S LAUNDRY. The elephant returns to the armchair, leaves the marbles to the tricycle and some tomatoes on the ottoman next to the bicycle, picks up the trumpet, the painting, and the velvet hat box, and moves toward the exit. As the elephant enters, carrying the instruments, a few early evening tourists -- some pandas and a penguin in a fedora -- pass it by. The elephant has been awake all evening. It is a standard train station restroom at that hour of the evening, with the remnants of an entire afternoon's trekking evident: crumpled comic strips, banana peels, and more. Part of the remnants is a mime who perches on the barber's chair, fast asleep. The elephant glances at it, shaking its trunk. A banner on the ceiling reads IS THIS YOUR FORTUNATE HOUR? The elephant chuckles to itself, places its painting and hat box on a cot, then pivots to confront its reflection in the window. A sprightly young janitor perches nearby, whose every gesture seems to demand minimal exertion, and shimmies over to snatch a ribbon as the elephant removes its scarf. Next to the bunch of ice chests in the lounge is a tiny juice bar and numerous benches. At one bench, facing the ice chests, is a young dragon, Lily: a tablet is open before it, and a mug of cocoa, and a saucer stacked with chocolate bars. It glances up for a moment as the elephant appears, then its eyes drift back to the written script. The elephant locks its instruments in an ice chest and now wears a wool vest and is clean and freshly powdered. Gliding toward the juice bar, the elephant observes Lily and proceeds to the juice bar, still eyeing her. It inhales some wrapped scones, then meanders over to a bench next to Lily's and plants itself. She disregards it and returns to her perusing. The elephant keeps observing her. Her scales are silver, cropped short, nearly wavy. Her nostrils are wide and flared, and the framework of her wings, though petite, is starkly visible. There is a hint of weary vigilance, of autonomy about her, and a candid, clear gaze which suggests nothing of teasing -- or the absence of it. Lily returns to perusing. The baker arrives to jot down the elephant's request, and the elephant holds up two antennas to the baker, who withdraws. The tea arrives, and the elephant leans back against the railing and closes its eyes. It drifts off to snooze, and the baker brings a ticket."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "She glances over at Frankie, snoring in the nearby armchair, then crawls off the couch and strides to the painting, where she notices a disco ball spinning across the hall that reads SUNSHINE DANCE STUDIO. Mabel returns to her chair, places the tickets to the Mustang and some candies on the side table beside Frankie, grabs her backpack, her duffel bag, and her velvet violin case, and drifts toward the corridor. As Mabel exits, lugging her luggage, a few late afternoon hikers -- some artists and a woman in a cowboy hat -- saunter past her. She has been resting all day. It is a typical airport lounge at that hour of the afternoon, with the evidence of a busy night's flights apparent: scattered plastic cups, gum wrappers, and more. Part of the evidence is a dozing pigeon perched on the luggage scale, barely awake. Mabel stares at it, shrugging her shoulders. A placard nearby reads IS THIS YOUR LAST STOP? Mabel chuckles softly, places her duffel bag and violin case on a bench, then turns to study her reflection in the glass. A sprightly young janitor lingers nearby, whose every gesture seems to exude boundless energy, and glides over to grab a mop as Mabel puts on her scarf. Adjacent to the line of vending machines in the departure area is a tiny snack bar and several chairs. At one chair, eyeing the machines, is a young man, David: a newspaper lies open in front of him, and a glass of tea, and a plate filled with cookie crumbs. He glances up for a moment as Mabel enters, then his gaze drifts back to the printed article. She stows her bags in a machine and now wears a warm jacket and appears energized and lively. Strolling toward the bar, Mabel observes David and heads to the snack bar, still watching him. She inspects some packaged biscuits, then meanders over to a chair beside David's and plops down. He overlooks her presence and resumes his perusal. Mabel quietly studies him. His hair is blonde, cropped short, slightly curly. His lips are narrow and firm, and the angles of his face, although gentle, are quite defined. There is an aura of quiet awareness, of independence about him, and a direct, straightforward demeanor that suggests neither warmth nor indifference. David turns back to his reading. The bartender arrives to note Mabel's selection, and Mabel raises a single finger to the bartender, who withdraws. The tea arrives, and Mabel reclines against the wall and closes her eyes. She drifts off to nap, and the bartender leaves a receipt."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He glances over at Charlie, nestled in the adjacent hammock, then bounces out of the hammock and strolls to the veranda, where he watches a windmill spinning in the yard that reads AMES GREENHOUSE. Eddie ambles back to his hammock, places the remote to the drone and some coins on the nightstand next to Charlie, grasps his ukulele, his kite, and his wicker basket, and heads toward the gate. As Eddie exits, lugging his items, a few late-night commuters -- some gardeners and a woman in a bonnet -- breeze past him. He has been awake all day. It is a typical train yard pantry at this hour of the evening, with the leftovers of a full week's journey in plain sight: tattered linen napkins, soda cans, and more. Part of the leftovers is a clown who lounges on the recliner, wide awake. Eddie glances at him, nodding to himself. A poster on the wall reads IS THIS YOUR HAPPY ENDING? Eddie chuckles quietly, places his kite and basket on a stool, then turns to gaze at his reflection in the window. A spry young chef stands nearby, whose every motion seems to involve minimal effort, and glides over to seize an apron as Eddie unrolls his sleeves. Beside the row of phone booths in the ticket hall is a tiny candy stand and several stools. At one stool, gazing at the booths, is a young man, Sarah: a magazine is spread open before him, and a glass of juice, and a saucer filled with candy wrappers. He glances up for a moment as Eddie enters, then his gaze returns to the glossy pages. He secures his items in a booth and now wears a cozy sweater and is relaxed and newly invigorated. Wandering toward the stand, Eddie notices Sarah and approaches the candy stand, still observing him. He sniffs some wrapped bonbons, then meanders over to a stool next to Sarah's and perches down. He overlooks him and resumes his perusal. Eddie keeps watching him. His hair is red, cut long, slightly wavy. His lips are bright and full, and the contours of his face, although sharp, are subtly prominent. There is a hint of weary alertness, of independence about him, and a sincere, straightforward gaze which contains nothing to suggest interest -- or its absence. Sarah returns to reading. The attendant arrives to take Eddie's request, and Eddie waves three fingers to the attendant, who leaves. The tea arrives, and Eddie sinks back against the window and rests his eyes. He nods off, and the attendant delivers a ticket."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "She glances over at Max, dozing on the sofa, then slides off the hammock and strolls to the bookshelf, where she spots a blinking lantern flickering across the hallway that says LILA'S CINEMA. Rebecca returns to the hammock, deposits the map to the Buick and some pebbles on the patio table next to Max, picks up her lantern, her oversize scarf, and her wicker picnic basket, and wanders toward the gate. As Rebecca arrives, lugging her baskets, a few early evening hikers -- some cowboys and a lady in a sunhat -- brush past her. She has been wandering since dusk. It is a typical train station lobby at that hour, with the remnants of a long day’s journeying visible: discarded menus, candy wrappers, and more. Part of the remnants is a clown who sprawls on the beanbag chair, peacefully snoring. Rebecca glances at him, smiling slightly. A poster on the door asks DID YOU WIN THE JACKPOT? Rebecca chuckles quietly, places her oversize scarf and picnic basket on a bench, then turns to inspect her reflection in the glass. An elderly chef sits nearby, whose slightest action seems to entail immense exertion, and shuffles over to grab a kettle as Rebecca shrugs off her shawl. Near the line of vending machines in the entrance is a tiny snack bar and various cushions. At one cushion, facing the machines, is a young man, Alex: a comic book lies open in front of him, alongside a soda can, and a cereal bowl filled with candy wrappers. He glances up momentarily as Rebecca emerges, then his gaze drops back to the colorful pages. She hides her baskets in a machine and now wears a crisp blouse and is neat and spruced up. Drifting toward the snack bar, Rebecca catches sight of Alex and heads to the snack bar, still observing him. She sniffs some sealed pastries, then meanders over to a cushion beside Alex's and plops down. He ignores her and resumes his reading. Rebecca continues to watch him. His hair is auburn, cut in a shaggy style, almost curly. His lips are faint and narrow, and the contours of his face, although fragile, are prominently displayed. There is an air of restless alertness, of independence about him, and a candid, direct gaze which bears nothing to suggest teasing -- or a lack thereof. Alex resumes reading. The server arrives to jot down Rebecca's choices, and Rebecca raises two fingers to the server, who leaves. The tea is served, and Rebecca leans against the railing and closes her eyes. She drifts into a nap, and the server brings a receipt."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Eddie wakes up, leaving keys and money for Charlie before heading out with his belongings. At a bus station, he observes the early morning mess, including a drunk asleep on a shoeshine seat. Amused by a sign reading \"IS THIS YOUR LUCKY DAY?\", he faces his reflection in a mirror before securing his things in a locker. Sarah, a young woman with a book and coffee, sits nearby but ignores him. Eddie, noticing her, orders coffee and dozes off at the lunch counter, exuding fatigue and curiosity."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He slips off to sleep and the waitress brings a check The coffee comes and Eddie leans back against the wall and shuts his eyes The waitress arrives to take Eddie's order and Eddie holds up two fingers to the waitress who departs Sarah goes back to reading There is a suggestion of tired wakefulness of selfsufficiency about her and a frank open regard which has nothing in it to imply flirtation  or the lack of it Her lips are pale and thin and the bone structure of her face although delicate is much in evidence Her hair is brown cut short practically straight Eddie keeps looking at her She ignores him and returns to her reading He sniffs some wrapped sandwiches then wanders over to a table next to Sarah's and sits down Moving toward the counter Eddie notices Sarah and goes to the lunch counter still looking at her He locks his bags in a locker and now has on a clean shirt and is clean and freshly shaven She looks up for an instant as Eddie appears then her eyes return to the printed page a book is open before her and a cup of coffee and an ashtray filled with cigarette butts Sarah At one table facing the lockers is a young woman Near the row of coin lockers in the waiting room is a small lunch counter and several tables A wizened old attendant sits nearby whose every move seems to require a tremendous effort and shuffles over to grab a towel as Eddie removes his jacket Eddie laughs to himself puts his hanging bag and cue case on a chair then turns to face his image in the mirror IS THIS YOUR LUCKY DAY A sign on the wall reads Eddie looks at him shaking his head Part of the residue is a drunk who sits on the shoeshine seat fast asleep It is a typical bus station washroom at that time of the morning with the residue of a full day's traveling in evidence crumpled paper towels cigarette butts and more He has been up all night As Eddie enters carrying his bags a few early morning travelers  some soldiers and a man in a Stetson hat  pass him by Eddie returns to his bed leaves the keys to the Packard and some money on the night table next to Charlie picks up his valise his hanging bag and his leather cue case and goes toward the door AMES BILLIARDS He looks over at Charlie asleep in the next bed then rolls out of bed and goes to the window where he sees a neon sign flashing across the street that reads"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Moving toward the counter Eddie notices Sarah and goes to the lunch counter still looking at her Sarah Eddie laughs to himself puts his hanging bag and cue case on a chair then turns to face his image in the mirror Her hair is brown cut short practically straight Eddie keeps looking at her Part of the residue is a drunk who sits on the shoeshine seat fast asleep It is a typical bus station washroom at that time of the morning with the residue of a full day's traveling in evidence crumpled paper towels cigarette butts and more Near the row of coin lockers in the waiting room is a small lunch counter and several tables A wizened old attendant sits nearby whose every move seems to require a tremendous effort and shuffles over to grab a towel as Eddie removes his jacket a book is open before her and a cup of coffee and an ashtray filled with cigarette butts IS THIS YOUR LUCKY DAY There is a suggestion of tired wakefulness of selfsufficiency about her and a frank open regard which has nothing in it to imply flirtation  or the lack of it He sniffs some wrapped sandwiches then wanders over to a table next to Sarah's and sits down He slips off to sleep and the waitress brings a check She looks up for an instant as Eddie appears then her eyes return to the printed page The waitress arrives to take Eddie's order and Eddie holds up two fingers to the waitress who departs AMES BILLIARDS At one table facing the lockers is a young woman Eddie returns to his bed leaves the keys to the Packard and some money on the night table next to Charlie picks up his valise his hanging bag and his leather cue case and goes toward the door He locks his bags in a locker and now has on a clean shirt and is clean and freshly shaven The coffee comes and Eddie leans back against the wall and shuts his eyes He has been up all night Sarah goes back to reading Eddie looks at him shaking his head A sign on the wall reads Her lips are pale and thin and the bone structure of her face although delicate is much in evidence He looks over at Charlie asleep in the next bed then rolls out of bed and goes to the window where he sees a neon sign flashing across the street that reads As Eddie enters carrying his bags a few early morning travelers  some soldiers and a man in a Stetson hat  pass him by She ignores him and returns to her reading"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "a book is open before her and a cup of coffee and an ashtray filled with cigarette butts She looks up for an instant as Eddie appears then her eyes return to the printed page He locks his bags in a locker and now has on a clean shirt and is clean and freshly shaven Moving toward the counter Eddie notices Sarah and goes to the lunch counter still looking at her He sniffs some wrapped sandwiches then wanders over to a table next to Sarah's and sits down She ignores him and returns to her reading Eddie keeps looking at her Her hair is brown cut short practically straight Her lips are pale and thin and the bone structure of her face although delicate is much in evidence There is a suggestion of tired wakefulness of selfsufficiency about her and a frank open regard which has nothing in it to imply flirtation  or the lack of it Sarah goes back to reading The waitress arrives to take Eddie's order and Eddie holds up two fingers to the waitress who departs The coffee comes and Eddie leans back against the wall and shuts his eyes He slips off to sleep and the waitress brings a check He looks over at Charlie asleep in the next bed then rolls out of bed and goes to the window where he sees a neon sign flashing across the street that reads AMES BILLIARDS Eddie returns to his bed leaves the keys to the Packard and some money on the night table next to Charlie picks up his valise his hanging bag and his leather cue case and goes toward the door As Eddie enters carrying his bags a few early morning travelers  some soldiers and a man in a Stetson hat  pass him by He has been up all night It is a typical bus station washroom at that time of the morning with the residue of a full day's traveling in evidence crumpled paper towels cigarette butts and more Part of the residue is a drunk who sits on the shoeshine seat fast asleep Eddie looks at him shaking his head A sign on the wall reads IS THIS YOUR LUCKY DAY Eddie laughs to himself puts his hanging bag and cue case on a chair then turns to face his image in the mirror A wizened old attendant sits nearby whose every move seems to require a tremendous effort and shuffles over to grab a towel as Eddie removes his jacket Near the row of coin lockers in the waiting room is a small lunch counter and several tables At one table facing the lockers is a young woman Sarah"
        }
      ]
    }
  ]
}