{
  "ground_truth": "He turns on his stool to watch the game. Eddie goes back to his bottle of beer. Some bills drop on a ragged, beat-up pool table. Two men, dressed in work clothes, stand around looking disgruntled. They go to the bar. Eddie sits at a table, smoking, waiting. The paper bag with the whisky is on the table. He mashes out his cigarette in the ashtray. Sarah, dressed in a dark suit, limps toward him. When he looks up, he sees Sarah standing nearby. She seems cold and suspicious as she limps toward the table. She pauses and looks at him. They stare at one another for a long moment. He gets up, puts his arm around her shoulder, and walks away with her. As they walk, she hesitantly puts an arm around his waist. A hand reaches up to open the wooden shutters. As they open, we see Eddie, in his underclothes, on the bed. Sarah, in a robe, walks up and joins him in bed as they both peer out the window. She hands him her cigarette. He starts to put on his wristwatch. He kisses her on the cheek. He kisses her again, this time on the lips. He reaches out and closes the shutters. Sarah emerges from a neighborhood grocery store loaded down with a Cheese Doodles carton full of food. A woman runs out of the store to give her a parcel she left behind. He pulls her schoolbooks out of the carton and takes her purse. She unloads liquor and canned goods from the carton, then goes to join Eddie by the window. Sarah takes a cigarette lighter out of her purse and hands it to Eddie. He takes it. She smiles, then she gets up and returns to the kitchenette. He comes up behind her and puts his arms around her. She cuts her hand opening a can. As he rummages through the closet for his bag he pulls out his leather cue case. They kiss. Someone knocks on the door. Sarah goes to open it. We stay on Eddie, who examines the lighter in his hand. He enters the room, awkwardly, toying with the rim of his hat. There is a long silence. Charlie sits. She starts to make the drinks. Eddie leans up against the wall, listening. Sarah watches them both, curious, confused. Suddenly Eddie becomes tense. Sarah turns to fix the drink. Eddie signals her to stay where she is. He moves forward, confronting Charlie. Eddie walks off. A tear rolls down Sarah's cheek as she hears this. She stands near the door, with her back to both of them. Charlie gets up and moves toward the door. Sarah, her cheek wet, says nothing.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He rotates on his seat to observe the match. Eddie returns to his bottle of ale. Some invoices fall on a tattered, battered billiards table. Two guys, attired in labor garments, stand around appearing displeased. They proceed to the tavern. Eddie rests at a table, puffing, anticipating. The newspaper sack with the whiskey is on the table. He crushes out his cigarette in the ashtray. Sarah, attired in a dark ensemble, hobbles toward him. When he glances up, he notices Sarah standing nearby. She seems aloof and distrustful as she hobbles toward the table. She halts and gazes at him. They gaze at one another for a lengthy moment. He rises, places his arm around her shoulder, and strides away with her. As they stroll, she tentatively places an arm around his midsection. A hand reaches up to unfold the lumber shutters. As they open, we see Eddie, in his undergarments, on the bed. Sarah, in a gown, walks up and joins him in bed as they both gaze out the pane. She hands him her cigarette. He begins to put on his wristwatch. He pecks her on the cheek. He kisses her again, this occasion on the mouth. He extends out and closes the shutters. Sarah emerges from a neighborhood market loaded down with a Cheese Doodles box full of provisions. A lady dashes out of the market to give her a packet she left behind. He removes her textbooks out of the box and takes her handbag. She unloads spirits and canned items from the box, then goes to join Eddie by the pane. Sarah takes a cigarette igniter out of her handbag and hands it to Eddie. He accepts it. She grins, then she rises and returns to the kitchenette. He comes up behind her and places his arms around her. She cuts her hand opening a canister. As he scours through the closet for his sack, he pulls out his leather cue case. They kiss. Someone raps on the portal. Sarah goes to open it. We stay on Eddie, who inspects the igniter in his hand. He enters the chamber, clumsily, fidgeting with the brim of his hat. There is a lengthy silence. Charlie sits. She starts to prepare the cocktails. Eddie leans up against the barrier, attending. Sarah observes them both, intrigued, perplexed. Abruptly Eddie becomes strained. Sarah turns to prepare the drink. Eddie signals her to remain where she is. He steps forward, confronting Charlie. Eddie strides off. A tear rolls down Sarah's cheek as she perceives this. She stands near the portal, with her back to both of them. Charlie rises and moves toward the portal. Sarah, her cheek moist, says nothing."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He turns on his stool to watch the game. The bottle of beer is returned to by Eddie. Some bills are dropped on a ragged, beat-up pool table. Two men, dressed in work clothes, stand around looking disgruntled. The bar is approached by them. A table is sat at by Eddie, smoking, waiting. The whisky is in the paper bag on the table. His cigarette is mashed out by him in the ashtray. Sarah, dressed in a dark suit, limps toward him. When he looks up, Sarah is seen standing nearby by him. She seems cold and suspicious as the table is approached by her. She pauses and looks at him. One another is stared at by them for a long moment. He gets up, his arm is put around her shoulder by him, and she is walked away with by him. As they walk, an arm is hesitantly put around his waist by her. A hand reaches up to open the wooden shutters. As the shutters are opened, Eddie, in his underclothes, is seen on the bed by us. Sarah, in a robe, walks up and joins him in bed as the window is peered out by them both. Her cigarette is handed to him by her. His wristwatch is started to be put on by him. Her cheek is kissed by him. Her lips are kissed by him again, this time. The shutters are reached out for and closed by him. Sarah emerges from a neighborhood grocery store loaded down with a Cheese Doodles carton full of food. A parcel left behind by her is run out of the store with by a woman to give to her. Her schoolbooks are pulled out of the carton by him and her purse is taken by him. Liquor and canned goods are unloaded from the carton by her, then she goes to join Eddie by the window. A cigarette lighter is taken out of her purse by Sarah and handed to Eddie. He takes it. She smiles, then the kitchenette is returned to by her. He comes up behind her and his arms are put around her by him. Her hand is cut by her opening a can. As he rummages through the closet for his bag, his leather cue case is pulled out by him. They kiss. Someone knocks on the door. The door is opened by Sarah. We stay on Eddie, who examines the lighter in his hand. He enters the room, awkwardly, toying with the rim of his hat. There is a long silence. Charlie sits. The drinks are started to be made by her. Eddie leans up against the wall, listening. Sarah watches them both, curious, confused. Suddenly Eddie becomes tense. The drink is turned to be fixed by Sarah. Eddie signals her to stay where she is. Charlie is confronted by him as he moves forward. Eddie walks off. A tear rolls down Sarah's cheek as this is heard by her. Near the door, she stands with her back to both of them. The door is moved toward by Charlie. Sarah, her cheek wet, remains silent."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He turns on his stool to watch the game as Eddie returns to his beer. Bills drop on a worn-out pool table where two men in work clothes look displeased and head to the bar. Eddie, smoking, waits with a whisky-filled paper bag on the table, mashing out his cigarette. Sarah, in a dark suit, limps over, appearing cold and suspicious. They lock eyes briefly before he puts his arm around her, and they walk away, her arm hesitantly around his waist. A hand opens the wooden shutters, revealing Eddie in bed. Sarah, in a robe, joins him, handing him her cigarette. He dons his wristwatch, kisses her cheek, then lips, and closes the shutters. Sarah leaves a grocery store with a carton of food; a woman returns a forgotten parcel. He takes her schoolbooks and purse, and she unloads liquor and canned goods, joining Eddie by the window. Sarah gives him a cigarette lighter, smiles, and heads to the kitchenette. He embraces her from behind as she cuts her hand opening a can. Rummaging the closet, he finds his leather cue case. A knock at the door brings Charlie, who enters awkwardly. Eddie listens against the wall as Sarah, curious and confused, watches. Eddie signals her to stay put and confronts Charlie. Tense, Eddie departs, leaving Sarah, tearful and silent, by the door as Charlie leaves."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He turns on his stool to watch the game while Eddie returns to his beer. Bills drop on a worn pool table as two men in work clothes, looking disgruntled, head to the bar. Eddie sits smoking at a table with a whisky-filled paper bag. He extinguishes his cigarette as Sarah, in a dark suit, limps toward him, appearing cold and suspicious. They lock eyes briefly before he puts his arm around her, and they walk away, her arm hesitantly around his waist. A hand opens the shutters, revealing Eddie in underclothes on the bed. Sarah, in a robe, joins him as they look out the window. She hands him her cigarette, and he starts to put on his wristwatch, kissing her on the cheek and lips before closing the shutters. Sarah emerges from a grocery store with a food-filled Cheese Doodles carton. A woman chases her with a forgotten parcel. He removes schoolbooks from the carton and takes her purse. She unloads liquor and canned goods, joining Eddie by the window. Sarah gives him a lighter, smiles, then heads to the kitchenette. He embraces her as she cuts her hand on a can. Searching the closet, he finds his leather cue case. They kiss. A knock on the door sends Sarah to open it. Eddie examines the lighter, awkwardly entering and playing with his hat. A long silence follows as Charlie sits, and Sarah makes drinks. Eddie leans against the wall, listening, while Sarah watches, confused. Eddie tenses and signals Sarah to stay put before confronting Charlie. Eddie walks off, and Sarah, tear-streaked, listens silently with her back to both men as Charlie moves toward the door."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He slowly pivots on his stool to catch a glimpse of the game unfolding on the screen. Meanwhile, Eddie, returning to his bottle of beer, takes a leisurely sip. Some bills carelessly tumble onto the worn and battered surface of a pool table that has seen better days. Two men, clad in their utilitarian work clothes, loiter nearby, appearing somewhat disgruntled and dissatisfied. They make their way over to the bar area. Eddie is seated at a table, cigarette smoke swirling around him as he bides his time, waiting. The brown paper bag containing the whisky sits on the table, an unspoken invitation. He methodically extinguishes his cigarette in the ashtray, pressing it out with deliberate care. \n\nSarah, attired in a somber dark suit, makes her way toward him with a noticeable limp. As he raises his eyes, he sees Sarah standing not far away, watching him intently. Her demeanor is icy and suspicious as she hobbles toward the table. She halts for a moment, casting her gaze upon him. Their eyes lock in a silent exchange, holding each other's stare for an extended, almost charged moment. \n\nHe rises from his seat, gently draping an arm around her shoulder, and they begin to walk away together. As they move in unison, she tentatively wraps an arm around his waist, matching his pace. A hand extends, reaching up to open the wooden shutters. As they creak open, we see Eddie, clad in his underclothes, reclining on the bed. Wearing a robe, Sarah approaches and joins him, settling beside him as they both peer out the window together. She passes her cigarette over to him, a quiet gesture of shared intimacy. \n\nHe begins to affix his wristwatch onto his arm. Leaning in, he places a soft kiss on her cheek, followed by another tender kiss on her lips. Slowly, he reaches out to draw the shutters closed, enclosing them in their own private world. \n\nSarah emerges from the bustling neighborhood grocery store, her arms burdened with a carton of Cheese Doodles stuffed with assorted food items. A woman hurriedly emerges from the store to hand her a parcel she inadvertently left behind. Eddie retrieves her schoolbooks from the carton and takes possession of her purse. She methodically unloads the carton, extracting the liquor bottles and canned goods, before moving to join Eddie by the window. Sarah retrieves a cigarette lighter from her purse and hands it to Eddie, a simple yet thoughtful gesture. Taking it, he acknowledges her with a smile. \n\nShe then rises and heads back to the small kitchenette. Eddie comes up behind her, wrapping his arms around her in a warm embrace. While opening a can, she accidentally cuts her hand. Meanwhile, he rummages through the closet, hunting for his bag, and pulls out his well-used leather cue case. They share a kiss, a moment of connection. A knock resounds at the door, prompting Sarah to go and open it. We remain focused on Eddie, who examines the lighter he holds, turning it over in his hand. \n\nHe enters the room with a slightly awkward demeanor, fidgeting with the brim of his hat. A long, heavy silence envelops the space. Charlie takes a seat. As Sarah begins to prepare the drinks, Eddie leans against the wall, his attention keenly attuned to the unfolding dynamics. Sarah observes them both, a mixture of curiosity and confusion etched on her face. Abruptly, a tension seizes Eddie. Sarah turns her attention back to fixing the drinks. Eddie subtly signals for her to remain where she is, as he strides forward to confront Charlie. Eddie then walks away, leaving the room. A solitary tear trickles down Sarah's cheek as she absorbs the weight of what she hears. She stands near the door, her back turned to them both, silent and still. Charlie rises and moves toward the door. With her cheeks still wet, Sarah remains speechless."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He slowly pivots on his stool, turning with deliberate and measured movements to catch a glimpse of the game that is currently unfolding on the screen before him. Meanwhile, Eddie, who has returned his attention to the bottle of beer sitting in front of him, takes a leisurely and unhurried sip. Some bills, seemingly carelessly handled, tumble onto the worn and battered surface of a pool table that has clearly seen better days and much use. Nearby, two men, clad in their utilitarian work clothes, loiter with an air of dissatisfaction, appearing somewhat disgruntled and dissatisfied with their surroundings. They eventually decide to make their way over to the bar area, shifting their focus. \n\nEddie is seated at a table, surrounded by a haze of cigarette smoke that swirls around him like a lingering cloud as he patiently bides his time, waiting for what comes next. The brown paper bag containing the whisky rests on the table, serving as an unspoken, silent invitation. He extinguishes his cigarette with a methodical precision, pressing it out with deliberate and careful movements in the ashtray.\n\nSarah, dressed in a somber and formal dark suit, makes her way toward him, her noticeable limp highlighting every step. As he raises his eyes, he sees Sarah standing not far away, her gaze fixed on him with an icy and suspicious demeanor. She hobbles toward the table with caution, halting momentarily to cast a penetrating gaze upon him. Their eyes lock, engaging in a silent exchange, holding each other's stare for an extended, almost charged moment, full of unspoken communication.\n\nHe rises from his seat, gently draping an arm around her shoulder, and together they begin to walk away in unison. As they move together, she tentatively wraps an arm around his waist, matching his pace with her own. A hand reaches up, extending to open the wooden shutters. As the shutters creak open, we see Eddie, clad in his underclothes, reclining on the bed in a relaxed manner. Wearing a robe, Sarah approaches and joins him, settling beside him as they both peer out the window together, sharing the view. She passes her cigarette to him, a quiet and intimate gesture of shared closeness.\n\nHe begins to affix his wristwatch onto his arm, securing it in place. Leaning in gently, he places a soft kiss on her cheek, followed by another tender kiss on her lips. Slowly, he reaches out to draw the shutters closed once more, enclosing them in their private world.\n\nSarah emerges from the bustling neighborhood grocery store, her arms burdened with a carton filled with Cheese Doodles and assorted food items. A woman hurriedly rushes out of the store to hand her a parcel she had inadvertently left behind. Eddie steps forward to retrieve her schoolbooks from the carton, taking possession of her purse with care. She methodically unloads the carton, carefully extracting the liquor bottles and canned goods, before moving to join Eddie by the window. Sarah retrieves a cigarette lighter from her purse and hands it to Eddie, a simple yet thoughtful gesture of consideration. Taking it, he acknowledges her with a grateful smile.\n\nShe then rises and heads back to the small kitchenette. Eddie follows her, coming up behind her and wrapping his arms around her in a warm embrace. While she is opening a can, she accidentally cuts her hand, causing a momentary pause. Meanwhile, he rummages through the closet, searching for his bag, and pulls out his well-used leather cue case. They share a kiss, a tender moment of connection. A knock resounds at the door, prompting Sarah to go and open it. We remain focused on Eddie, who examines the lighter he holds, turning it over thoughtfully in his hand.\n\nHe enters the room with a slightly awkward demeanor, fidgeting with the brim of his hat in a sign of nervousness. A long, heavy silence envelops the space, grounding the moment. Charlie takes a seat as Sarah begins to prepare the drinks. Eddie leans against the wall, his attention keenly attuned to the unfolding dynamics and interactions. Sarah observes them both, a mixture of curiosity, confusion, and perhaps concern etched on her face. Suddenly, tension seizes Eddie, and Sarah turns her attention back to fixing the drinks. Eddie subtly signals for her to remain where she is, as he strides forward with determination to confront Charlie. Eddie then walks away, leaving the room with purpose. A solitary tear trickles down Sarah's cheek as she absorbs the weight of what she hears. She stands near the door, her back turned to them both, silent and still. Charlie rises, moving toward the door. With her cheeks still wet, Sarah remains speechless, the silence lingering in the air."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As he turns on his stool, his attention shifts to the game unfolding on the screen, while Eddie, momentarily distracted, returns his focus to his half-finished bottle of beer. Nearby, a few crumpled bills fall onto a ragged, beat-up pool table, where two men, clad in their work clothes, stand around, looking visibly disgruntled and exchanging frustrated glances before deciding to leave the pool table and head over to the bar in search of a drink or some solace. Meanwhile, Eddie takes a seat at a nearby table, taking a long drag from his cigarette and allowing the smoke to curl into the air as he waits patiently. He glances at the table, where a paper bag containing whisky rests, and then, with deliberate care, stubs out his cigarette in the ashtray. In the dim light, Sarah, wearing a dark suit and favoring one leg, limps toward him, and as he lifts his gaze, he sees her standing nearby, exuding an air of coldness and suspicion mixed with her subtle movements as she approaches the table. She pauses momentarily, her eyes taking in his presence, and for a long, silent moment, they engage in a wordless exchange, their eyes locked in an unspoken connection. Slowly, he rises from the table, gently placing his arm around her shoulder, and together they begin to walk away; she hesitates before slipping her arm around his waist, drawing closer as they move in unison. Later, a hand reaches up and carefully unlatches the wooden shutters, gradually pushing them open to reveal Eddie, clad only in his underclothes, lounging on the bed. Sarah, dressed in a robe, approaches him and slides into bed, both gazing out the newly exposed window. She extends her hand, offering him her cigarette, which he accepts as he begins to fasten his wristwatch onto his wrist. In a moment of intimacy, he leans over to kiss her cheek, and then he kisses her once more, this time letting his lips linger on hers before he reaches out and gently closes the shutters, enveloping them in a cocoon of privacy. The scene shifts as Sarah steps out of a neighborhood grocery store, her arms burdened with a Cheese Doodles carton overflowing with various food items. As she makes her way down the sidewalk, a woman bursts out of the store, hastily handing her a parcel she inadvertently left behind. Upon reaching home, he begins to unpack the carton, extracting her schoolbooks while simultaneously retrieving her purse. Sarah methodically removes the liquor bottles and canned goods from within the carton and proceeds to join Eddie by the window. She digs into her purse, retrieving a cigarette lighter, which she hands over to him with a slight smile before rising from her seat and returning to the kitchenette. Moving with a quiet grace, he follows her, slipping his arms around her as she starts to open a can, only to accidentally cut her hand in the process. Meanwhile, he rummages through the closet, searching for his bag, and in doing so, pulls out his leather cue case, a familiar weight in his hands, as they pause to share a tender kiss. Their reverie is interrupted by a knock on the door, prompting Sarah to walk over and open it, while Eddie, left alone for a moment, remains engrossed in examining the lighter cradled in his palm. As a man enters the room, his movements awkward and his fingers nervously toying with the hat's rim, an uneasy silence stretches across the room. Eventually, Charlie takes a seat, his presence noted by Sarah, who begins to prepare drinks for the gathering. As Eddie leans casually against the wall, he listens intently, his eyes shifting between the room’s occupants, while Sarah watches them both, her expression a mixture of curiosity and confusion. Suddenly, tension mounts within Eddie, who signals Sarah to pause in her drink preparation and stay put as he steps forward, confronting Charlie with a newfound resolve. The air palpable with unsaid words, Eddie turns and walks off, leaving behind a trail of unresolved emotions. As Sarah processes the unfolding scene, a solitary tear traces a path down her cheek, betraying her composure, as she remains positioned near the door, her back a shield against both men. As Charlie rises to leave, he approaches the door, sharing in the unresolved silence, while Sarah, her cheek still wet, silently witnesses it all, her presence marked by unspoken understanding and quiet endurance."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Eddie, seated at a table with a bottle of beer, observes a couple of disgruntled men drop bills on a worn-out pool table before heading to the bar. As he waits with a cigarette and a paper-bagged whisky, Sarah, dressed in a dark suit, approaches with a limp. They share a long, silent stare, after which he rises, places an arm around her, and they walk together, her arm hesitantly wrapping around his waist.\n\nLater, Eddie, in his underclothes, is in bed with Sarah, who joins him in a robe as they look out the window, exchanging a cigarette and kisses before he shuts the shutters. Sarah then emerges from a grocery store with a carton of food, handing over a forgotten parcel to a woman before joining Eddie and unloading liquor and canned goods. She hands him a cigarette lighter with a smile before returning to the kitchenette, where he embraces her from behind. She injures her hand while opening a can and he retrieves his leather cue case from the closet, leading to a kiss.\n\nA knock at the door prompts Sarah to open it while Eddie examines the lighter. Charlie enters the room, creating an awkward silence as he fidgets with his hat. As Sarah makes drinks, Eddie leans against the wall, listening and observing the two. Tension rises as Eddie confronts Charlie, resulting in Eddie's departure, leaving Sarah tearful and silent by the door as Charlie follows."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He turns on his stool to watch the game, a local favorite where neighborhood teams often clash at the old downtown sports bar. Eddie goes back to his bottle of beer, an imported brand known for its dark, rich flavor. Some bills drop on a ragged, beat-up pool table, which has been in the bar for over two decades, its surface worn from countless games. Two men, dressed in work clothes from the nearby construction site, stand around looking disgruntled. They go to the bar, seeking solace in their drinks after a long day at work. Eddie sits at a table, smoking, waiting patiently for his late-night companion. The paper bag with the whisky, a brand favored by local patrons for its smoothness, is on the table. He mashes out his cigarette in the ashtray, engraved with the bar's logo. Sarah, dressed in a dark suit from her job at the local law firm, limps toward him, her injury from a recent minor accident still healing. When he looks up, he sees Sarah standing nearby. She seems cold and suspicious as she limps toward the table, her mind preoccupied with recent events. She pauses and looks at him, her eyes searching for answers. They stare at one another for a long moment, a silent conversation passing between them. He gets up, puts his arm around her shoulder, and walks away with her. As they walk, she hesitantly puts an arm around his waist, seeking reassurance. A hand reaches up to open the wooden shutters, which had been installed back when the building was first constructed. As they open, we see Eddie, in his underclothes, on the bed, the morning sun slanting into the room. Sarah, in a robe from a local boutique, walks up and joins him in bed as they both peer out the window, watching the bustling street below. She hands him her cigarette, a brand she prefers for its mildness. He starts to put on his wristwatch, an old heirloom from his grandfather. He kisses her on the cheek, a gentle morning greeting. He kisses her again, this time on the lips, conveying more than words can say. He reaches out and closes the shutters, preferring the dim light. \n\nSarah emerges from a neighborhood grocery store, a small family-run business, loaded down with a Cheese Doodles carton full of food, a frequent purchase for her. A woman, the friendly store owner, runs out of the store to give her a parcel she left behind, always attentive to her regular customers. He pulls her schoolbooks out of the carton, a reminder of her night classes at the local college, and takes her purse, offering to help. She unloads liquor and canned goods from the carton, then goes to join Eddie by the window, where they often watch the world go by. Sarah takes a cigarette lighter out of her purse and hands it to Eddie, a small gift she recently bought for him. He takes it, feeling its weight in his hand. She smiles, then she gets up and returns to the kitchenette, where she prepares their simple meals. He comes up behind her and puts his arms around her, providing comfort as she cooks. She cuts her hand opening a can, and winces slightly at the sting. As he rummages through the closet for his bag, ready for an upcoming trip, he pulls out his leather cue case, well-used for weekend tournaments. They kiss, a familiar dance of affection. Someone knocks on the door, interrupting their moment. Sarah goes to open it, cautious and curious. We stay on Eddie, who examines the lighter in his hand, its engravings catching his eye. He enters the room, awkwardly, toying with the rim of his hat, an old habit when he's nervous. There is a long silence, a tension hanging in the air. Charlie sits, a friend from Eddie’s past, bringing old memories with him. She starts to make the drinks, a hostess by nature. Eddie leans up against the wall, listening, his mind racing. Sarah watches them both, curious, confused, trying to piece together the unspoken words. Suddenly Eddie becomes tense, his posture shifting. Sarah turns to fix the drink, her mind elsewhere. Eddie signals her to stay where she is, protective and wary. He moves forward, confronting Charlie, ready to settle unfinished business. Eddie walks off, leaving a trail of unresolved tension. A tear rolls down Sarah's cheek as she hears this, the weight of the moment sinking in. She stands near the door, with her back to both of them, feeling the swirl of emotions. Charlie gets up and moves toward the door, sensing the finality. Sarah, her cheek wet, says nothing, her silence speaking volumes."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "As they walk she hesitantly puts an arm around his waist He turns on his stool to watch the game Eddie goes back to his bottle of beer Some bills drop on a ragged beatup pool table Two men dressed in work clothes stand around looking disgruntled He kisses her on the cheek They go to the bar Eddie sits at a table smoking waiting The paper bag with the whisky is on the table He mashes out his cigarette in the ashtray Sarah dressed in a dark suit limps toward him Sarah watches them both curious confused He gets up puts his arm around her shoulder and walks away with her She cuts her hand opening a can When he looks up he sees Sarah standing nearby Someone knocks on the door She seems cold and suspicious as she limps toward the table She starts to make the drinks She pauses and looks at him They stare at one another for a long moment He gets up puts his arm around her shoulder and walks away with her Charlie sits As they walk she hesitantly puts an arm around his waist A hand reaches up to open the wooden shutters Sarah takes a cigarette lighter out of her purse and hands it to Eddie He moves forward confronting Charlie As they open we see Eddie in his underclothes on the bed Sarah in a robe walks up and joins him in bed as they both peer out the window She hands him her cigarette He starts to put on his wristwatch He kisses her on the cheek He kisses her again this time on the lips Some bills drop on a ragged beatup pool table He reaches out and closes the shutters Sarah emerges from a neighborhood grocery store loaded down with a Cheese Doodles carton full of food He reaches out and closes the shutters A woman runs out of the store to give her a parcel she left behind He pulls her schoolbooks out of the carton and takes her purse She unloads liquor and canned goods from the carton then goes to join Eddie by the window He mashes out his cigarette in the ashtray Sarah takes a cigarette lighter out of her purse and hands it to Eddie He takes it She smiles We stay on Eddie who examines the lighter in his hand then she gets up and returns to the kitchenette He comes up behind her and puts his arms around her She cuts her hand opening a can They stare at one another for a long moment As he rummages through the closet for his bag he pulls out his leather cue case Sarah her cheek wet says nothing They kiss She stands near the door with her back to both of them Eddie goes back to his bottle of beer Someone knocks on the door Eddie signals her to stay where she is Sarah goes to open it Eddie sits at a table smoking waiting We stay on Eddie who examines the lighter in his hand He enters the room awkwardly toying with the rim of his hat then she gets up and returns to the kitchenette There is a long silence Charlie sits She starts to make the drinks Eddie leans up against the wall listening Sarah dressed in a dark suit limps toward him Sarah watches them both curious confused Suddenly Eddie becomes tense The paper bag with the whisky is on the table Sarah turns to fix the drink Eddie walks off They kiss Eddie signals her to stay where she is Sarah in a robe walks up and joins him in bed as they both peer out the window He moves forward confronting Charlie Eddie walks off A tear rolls down Sarah's cheek as she hears this A hand reaches up to open the wooden shutters She stands near the door with her back to both of them Charlie gets up and moves toward the door Sarah her cheek wet says nothing"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He turns on his stool to watch the game. Eddie goes back to his bottle of beer. Some bills drop on a ragged beatup pool table. Two men dressed in work clothes stand around looking disgruntled. They go to the bar. Eddie sits at a table smoking waiting. The paper bag with the whisky is on the table. He mashes out his cigarette in the ashtray. Sarah dressed in a dark suit limps toward him. When he looks up he sees Sarah standing nearby. She seems cold and suspicious as she limps toward the table. She pauses and looks at him. They stare at one another for a long moment. He gets up puts his arm around her shoulder and walks away with her. As they walk she hesitantly puts an arm around his waist. A hand reaches up to open the wooden shutters. As they open we see Eddie in his underclothes on the bed. Sarah in a robe walks up and joins him in bed as they both peer out the window. She hands him her cigarette. He starts to put on his wristwatch. He kisses her on the cheek. He kisses her again this time on the lips. He reaches out and closes the shutters. Sarah emerges from a neighborhood grocery store loaded down with a Cheese Doodles carton full of food. A woman runs out of the store to give her a parcel she left behind. He pulls her schoolbooks out of the carton and takes her purse. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. She unloads liquor and canned goods from the carton then goes to join Eddie by the window. Sarah takes a cigarette lighter out of her purse and hands it to Eddie. He takes it. She smiles. then she gets up and returns to the kitchenette. He comes up behind her and puts his arms around her. She cuts her hand opening a can. As he rummages through the closet for his bag he pulls out his leather cue case. They kiss. Someone knocks on the door. Sarah goes to open it. We stay on Eddie who examines the lighter in his hand. He enters the room awkwardly toying with the rim of his hat. There is a long silence. Charlie sits. She starts to make the drinks. Eddie leans up against the wall listening. Sarah watches them both curious confused. Suddenly Eddie becomes tense. Sarah turns to fix the drink. Eddie signals her to stay where she is. He moves forward confronting Charlie. Eddie walks off. A tear rolls down Sarah's cheek as she hears this. She stands near the door with her back to both of them. Charlie gets up and moves toward the door. Sarah her cheek wet says nothing."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He turns on his stool to watch the game. Eddie goes back to his bottle of beer. Some bills drop on a ragged beatup pool table. Two men dressed in work clothes stand around looking disgruntled. They go to the bar. Eddie sits at a table smoking waiting. The paper bag with the whisky is on the table. He mashes out his cigarette in the ashtray. Sarah dressed in a dark suit limps toward him. When he looks up he sees Sarah standing nearby. She seems cold and suspicious as she limps toward the table. She pauses and looks at him. They stare at one another for a long moment. He gets up puts his arm around her shoulder and walks away with her. As they walk she hesitantly puts an arm around his waist. A hand reaches up to open the wooden shutters. As they open we see Eddie in his underclothes on the bed. Sarah in a robe walks up and joins him in bed as they both peer out the window. She hands him her cigarette. He starts to put on his wristwatch. He kisses her on the cheek. He kisses her again this time on the lips. He reaches out and closes the shutters. Sarah emerges from a neighborhood grocery store loaded down with a Cheese Doodles carton full of food. A woman runs out of the store to give her a parcel she left behind. He pulls her schoolbooks out of the carton and takes her purse. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. She unloads liquor and canned goods from the carton then goes to join Eddie by the window. Sarah takes a cigarette lighter out of her purse and hands it to Eddie. He takes it. She smiles. then she gets up and returns to the kitchenette. He comes up behind her and puts his arms around her. She cuts her hand opening a can. As he rummages through the closet for his bag he pulls out his leather cue case. They kiss. Someone knocks on the door. Sarah goes to open it. We stay on Eddie who examines the lighter in his hand. He enters the room awkwardly toying with the rim of his hat. There is a long silence. Charlie sits. She starts to make the drinks. Eddie leans up against the wall listening. Sarah watches them both curious confused. Suddenly Eddie becomes tense. Sarah turns to fix the drink. Eddie signals her to stay where she is. He moves forward confronting Charlie. Eddie walks off. A tear rolls down Sarah's cheek as she hears this. She stands near the door with her back to both of them. Charlie gets up and moves toward the door. Sarah her cheek wet says nothing."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He turns on his stool to watch the game. Eddie goes back to his bottle of beer. Some bills drop on a ragged beatup pool table. Two men dressed in work clothes stand around looking disgruntled. They go to the bar. Eddie sits at a table smoking waiting. The paper bag with the whisky is on the table. He mashes out his cigarette in the ashtray. Sarah dressed in a dark suit limps toward him. When he looks up he sees Sarah standing nearby. She seems cold and suspicious as she limps toward the table. She pauses and looks at him. They stare at one another for a long moment. There is a long silence. Charlie sits. She starts to make the drinks. Eddie leans up against the wall listening. Sarah watches them both curious confused. Suddenly Eddie becomes tense. Sarah turns to fix the drink. Eddie signals her to stay where she is. He moves forward confronting Charlie. Eddie walks off. A tear rolls down Sarah's cheek as she hears this. She stands near the door with her back to both of them. Charlie gets up and moves toward the door. Sarah her cheek wet says nothing."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He turns on his stool to watch the game. Eddie goes back to his bottle of beer. Some bills drop on a ragged beatup pool table. Two men dressed in work clothes stand around looking disgruntled. They go to the bar. He moves forward confronting Charlie. Eddie walks off. A tear rolls down Sarah's cheek as she hears this. She stands near the door with her back to both of them. Charlie gets up and moves toward the door. Sarah her cheek wet says nothing."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dog turns on its stool to watch the game. A squirrel goes back to its bottle of beer. Some bills drop on a ragged, beat-up pool table. Two cats, dressed in work clothes, stand around looking disgruntled. They go to the bar. A squirrel sits at a table, smoking, waiting. The paper bag with the whisky is on the table. The dog mashes out its cigarette in the ashtray. A rabbit, dressed in a dark suit, limps toward the dog. When it looks up, it sees a rabbit standing nearby. The rabbit seems cold and suspicious as it limps toward the table. The rabbit pauses and looks at the dog. They stare at one another for a long moment. The dog gets up, puts its arm around the rabbit's shoulder, and walks away with the rabbit. As they walk, the rabbit hesitantly puts an arm around the dog's waist. A fish reaches up to open the wooden shutters. As they open, we see a squirrel, in its underclothes, on the bed. A rabbit, in a robe, walks up and joins the squirrel in bed as they both peer out the window. The rabbit hands the squirrel its cigarette. The squirrel starts to put on its wristwatch. The squirrel kisses the rabbit on the cheek. The squirrel kisses the rabbit again, this time on the lips. The squirrel reaches out and closes the shutters. A rabbit emerges from a neighborhood grocery store loaded down with a Cheese Doodles carton full of food. A bird runs out of the store to give the rabbit a parcel it left behind. The dog pulls its schoolbooks out of the carton and takes the rabbit's purse. The rabbit unloads liquor and canned goods from the carton, then goes to join a squirrel by the window. A rabbit takes a cigarette lighter out of its purse and hands it to the squirrel. The squirrel takes it. The rabbit smiles, then the rabbit gets up and returns to the kitchenette. The dog comes up behind the rabbit and puts its arms around the rabbit. The rabbit cuts its hand opening a can. As a squirrel rummages through the closet for its bag it pulls out its leather cue case. They kiss. A deer knocks on the door. The rabbit goes to open it. We stay on a squirrel, who examines the lighter in its hand. A cat enters the room, awkwardly, toying with the rim of its hat. There is a long silence. A horse sits. The rabbit starts to make the drinks. A squirrel leans up against the wall, listening. The rabbit watches them both, curious, confused. Suddenly a squirrel becomes tense. The rabbit turns to fix the drink. A squirrel signals the rabbit to stay where it is. The dog moves forward, confronting a horse. A squirrel walks off. A tear rolls down a rabbit's cheek as it hears this. The rabbit stands near the door, with its back to both of them. A horse gets up and moves toward the door. The rabbit, its cheek wet, says nothing."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He turns on his recliner to watch the documentary. Eddie goes back to his bottle of lemonade. Some coins drop on a ragged, beat-up chessboard. Two men, dressed in formal attire, stand around looking disgruntled. They go to the café. Eddie sits at a bench, chewing gum, waiting. The canvas bag with the rum is on the bench. He mashes out his cigarette in the saucer. Sarah, dressed in a light dress, hobbles toward him. When he looks up, he sees Sarah standing nearby. She seems cold and suspicious as she hobbles toward the bench. She pauses and looks at him. They stare at one another for a long moment. He gets up, puts his arm around her shoulder, and walks away with her. As they walk, she hesitantly puts an arm around his waist. A hand reaches up to open the glass blinds. As they open, we see Eddie, in his pajamas, on the floor. Sarah, in a nightgown, walks up and joins him on the floor as they both peer out the door. She hands him her chewing gum. He starts to put on his bracelet. He kisses her on the forehead. He kisses her again, this time on the neck. He reaches out and closes the blinds. Sarah emerges from a corner bookstore loaded down with a shoe box full of groceries. A woman runs out of the bookstore to give her a scarf she left behind. He pulls her magazines out of the shoe box and takes her backpack. She unloads juice and vegetables from the shoe box, then goes to join Eddie by the door. Sarah takes a pencil out of her backpack and hands it to Eddie. He takes it. She smiles, then she gets up and returns to the pantry. He comes up behind her and puts his arms around her. She cuts her hand opening an envelope. As he rummages through the cupboard for his suitcase he pulls out his leather guitar case. They kiss. Someone knocks on the window. Sarah goes to open it. We stay on Eddie, who examines the pencil in his hand. He enters the room, awkwardly, toying with the edge of his scarf. There is a long silence. Charlie sits. She starts to make the snacks. Eddie leans up against the bookshelf, listening. Sarah watches them both, curious, confused. Suddenly Eddie becomes tense. Sarah turns to fix the snack. Eddie signals her to stay where she is. He moves forward, confronting Charlie. Eddie walks off. A tear rolls down Sarah's cheek as she hears this. She stands near the window, with her back to both of them. Charlie gets up and moves toward the window. Sarah, her cheek wet, says nothing."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He rotates on his stool to observe the game. Eddie returns to his bottle of beer. Some bills flutter onto a ragged, beat-up pool table. Two men, dressed in work clothes, linger nearby looking disgruntled. They saunter toward the bar. Eddie reclines at a table, whistling, waiting. The paper bag with the whisky sits on the table. He flicks his cigarette into the ashtray. Sarah, dressed in a dark suit, struts toward him. When he gazes up, he notices Sarah standing nearby. She seems cold and suspicious as she strolls toward the table. She halts and glances at him. They glare at one another for a long moment. He rises, drapes his arm around her shoulder, and strolls away with her. As they walk, she tentatively slides an arm around his waist. A hand reaches up to close the wooden shutters. As they shut, we see Eddie, in his underclothes, on the bed. Sarah, in a robe, strides up and joins him in bed as they both gaze out the window. She gives him her cigarette. He proceeds to put on his wristwatch. He pecks her on the cheek. He pecks her again, this time on the lips. He stretches out and opens the shutters. Sarah emerges from a neighborhood grocery store burdened down with a Cheese Doodles carton full of food. A woman sprints out of the store to fetch her a parcel she left behind. He extracts her schoolbooks from the carton and takes her purse. She unpacks liquor and canned goods from the carton, then moves to join Eddie by the window. Sarah retrieves a cigarette lighter from her purse and gives it to Eddie. He accepts it. She grins, then she rises and returns to the kitchenette. He sneaks up behind her and rests his arms around her. She grazes her hand opening a can. As he rifles through the closet for his bag he extracts his leather cue case. They embrace. Someone raps on the door. Sarah strides to open it. We remain on Eddie, who inspects the lighter in his hand. He steps into the room, hesitantly, fiddling with the brim of his hat. There is a lengthy silence. Charlie reclines. She proceeds to prepare the drinks. Eddie slouches against the wall, listening. Sarah observes them both, curious, bewildered. Suddenly Eddie becomes rigid. Sarah turns to arrange the drink. Eddie gestures for her to stay where she is. He advances, confronting Charlie. Eddie wanders off. A tear slides down Sarah's cheek as she perceives this. She stands near the door, with her back to both of them. Charlie rises and drifts toward the door. Sarah, her cheek moist, remains silent."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The lamp spins on its couch to watch the movie. The mailbox returns to its jar of honey. Several leaves tumble onto a shiny, new dining table. Three owls, dressed in pajamas, hover around appearing annoyed. They advance to the bookshelf. The mailbox rests on a bookshelf, humming, waiting. The shoebox with the lemonade is on the bookshelf. The lamp extinguishes its candle in the vase. The giraffe, dressed in a yellow hoodie, skips toward it. When the lamp looks up, it sees the giraffe standing close by. The giraffe appears warm and friendly as it skips toward the bookshelf. The giraffe halts and gazes at it. They gaze at one another for a brief moment. The lamp rises, places its handle around the giraffe's neck, and strolls away with it. As they stroll, the giraffe reluctantly places a neck around the lamp's base. A shoe reaches up to close the woolen curtains. As they close, we see the mailbox, in its raincoat, on the sofa. The giraffe, in a t-shirt, dances up and joins it on the sofa as they both peer at the ceiling. The giraffe hands it the scissors. The mailbox begins to put on its sunglasses. The mailbox kisses the giraffe on the nose. The mailbox kisses the giraffe again, this time on the beak. The mailbox reaches out and opens the curtains. The giraffe emerges from an alleyway pet shop burdened with a Milk Duds crate full of toys. A penguin waddles out of the shop to give the giraffe a backpack it forgot. The mailbox extracts the notebooks from the crate and takes its scarf. The giraffe unpacks candy and stuffed animals from the crate, then goes to join the mailbox by the ceiling. The giraffe takes a bottle opener out of its scarf and hands it to the mailbox. The mailbox accepts it. The giraffe giggles, then it stands up and returns to the parlor. The mailbox approaches behind it and puts its handles around it. The giraffe sprains its hoof opening a jar. As the mailbox rummages through the drawer for its suitcase, it pulls out its velvet pencil case. They laugh. Someone taps on the window. The giraffe goes to open it. We stay on the mailbox, who inspects the opener in its handle. It slips into the hallway, awkwardly, adjusting the brim of its crown. There is a brief pause. The lion reclines. It begins to sing the melodies. The mailbox leans against the wall, observing. The giraffe observes them both, perplexed, intrigued. Abruptly the mailbox becomes uneasy. The giraffe turns to boil the kettle. The mailbox gestures for it to remain where it is. The mailbox advances, confronting the lion. The mailbox stomps off. A droplet rolls down the giraffe's beak as it overhears this. It stands near the hallway, with its back to both of them. The lion rises and advances toward the hallway. The giraffe, its beak moist, remains quiet."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The cat swivels on its cushion to observe the concert. Joey returns to his mug of tea. Some papers float onto a rickety, worn-out chessboard. Two women, clad in casual attire, hover around appearing uncertain. They wander to the counter. Joey lounges on a chair, eating, pondering. The brown bag with the juice sits on the chair. It stubs out its snack in the saucer. Alex, attired in a light jacket, skips toward it. When it glances up, it notices Alex hovering nearby. He appears distant and curious as he skips toward the chair. He hesitates and gazes at it. They gaze at each other for a brief instant. The cat rises, wraps its tail around his leg, and strolls away with him. As they amble, he tentatively wraps an arm around its neck. A paw reaches down to adjust the metal blinds. As they adjust, we observe Joey, in his pajamas, on the couch. Alex, in sleepwear, approaches and joins it on the couch as they both glance out the door. He passes it his donut. It begins to put on its sunglasses. It nuzzles him on the ear. It nuzzles him again, this time on the forehead. It stretches out and closes the blinds. Alex emerges from a corner bakery burdened with a Popcorn bag brimming with groceries. A man dashes out of the bakery to return a package he forgot. The cat extracts his sketchbooks out of the bag and grabs his wallet. He unpacks magazines and bottles from the bag, then goes to join Joey by the door. Alex extracts a magnifying glass out of his wallet and hands it to Joey. It accepts it. He grins, then he rises and returns to the dining area. It strolls behind him and wraps its paws around him. He pricks his paw slicing a loaf. As it rifles through the cupboard for his hat it extracts its wool scarf. They embrace. Someone raps on the door. Alex goes to answer it. We remain on Joey, who inspects the glass in its paw. It enters the space, clumsily, fiddling with the edge of its hood. There is a lengthy hush. Casey perches. He begins to brew the coffee. Joey leans against the counter, observing. Alex observes them both, intrigued, puzzled. Abruptly Joey becomes restless. Alex pivots to stir the coffee. Joey motions him to halt where he is. It advances, confronting Casey. Joey strides away. A droplet trickles down Alex's face as it perceives this. He stands adjacent to the door, with his side to both of them. Casey stands and ambles toward the door. Alex, his face wet, remains silent."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He swivels on his recliner to observe the concert. Eddie returns to his bowl of soup. Some coins tumble onto a pristine, antique checkers board. Two men, dressed in hiking outfits, hover around looking puzzled. They saunter to the jukebox. Eddie lounges at a booth, whistling, anticipating. The canvas sack with the gin sits on the counter. He taps out his pipe in the coffee cup. Sarah, dressed in a bright gown, hobbles toward him. When he glances up, he sees Sarah hovering nearby. She appears distant and wary as she hobbles toward the counter. She stops and gazes at him. They gaze at each other for a long second. He rises, drapes his arm around her waist, and strides away with her. As they stroll, she tentatively wraps an arm around his neck. A foot pushes up to shut the metal blinds. As they shut, we see Eddie, in his pajamas, sprawled on the couch. Sarah, in a dress, strides over and joins him on the couch as they both gaze through the door. She offers him her candy bar. He begins to adjust his necktie. He pecks her on the forehead. He pecks her again, this time on the chin. He stretches out and shuts the blinds. Sarah emerges from a neighborhood bookstore burdened with a board game filled with groceries. A man sprints from the shop to hand her a package she forgot. He lifts her sketchbooks out of the game box and grabs her backpack. She unpacks magazines and produce from the game box, then goes to accompany Eddie near the door. Sarah pulls a penknife from her backpack and hands it to Eddie. He accepts it. She grins, then she rises and heads back to the pantry. He sneaks up behind her and wraps his arms around her. She scrapes her elbow slicing a loaf. As he sifts through the drawer for his suitcase, he retrieves his silk hat case. They embrace. Someone taps on the window. Sarah heads to answer it. We linger on Eddie, who inspects the penknife in his grip. He steps into the hall, hesitantly, fiddling with the brim of his cap. There is an extended hush. Charlie reclines. She begins to prepare the snacks. Eddie leans against the counter, eavesdropping. Sarah observes them both, intrigued, bewildered. Abruptly Eddie becomes rigid. Sarah turns to pour the snacks. Eddie signals her to remain where she is. He advances, confronting Charlie. Eddie strolls off. A drop slips down Sarah's chin as she catches this. She stands near the window, with her back to both of them. Charlie rises and heads toward the window. Sarah, her chin damp, remains silent."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The cat spins on its chair to observe the concert. Oliver returns to his mug of cocoa. Some coins fall on a polished, pristine chessboard. Two squirrels, clad in explorer outfits, hover around looking bewildered. They wander to the café. Oliver perches at a bench, whistling, waiting. The velvet pouch with the rum lies on the bench. The cat flicks off its pencil in the shoebox. Madeline, dressed in a bright gown, hobbles toward the cat. When it glances up, it sees Madeline standing nearby. She appears warm and inquisitive as she hobbles toward the bench. She hesitates and glances at it. They gaze at one another for a brief interval. The cat stands up, drapes an arm around her neck, and strides away with her. As they stroll, she tentatively places an arm around its shoulder. A paw reaches up to lift the iron curtains. As they lift, we see Oliver, in his pajamas, on the sofa. Madeline, in a cloak, ambles up and settles beside him as they both gaze out the door. She offers him her fork. He begins to wear his bracelet. He pecks her on the forehead. He pecks her again, this time on the nose. He extends a paw and shuts the curtains. Madeline exits a neighborhood bookshop overloaded with a Popcorn crate brimming with treasures. A child skips out of the shop to hand her a letter she forgot. The cat extracts her maps from the crate and lifts her satchel. She unloads candles and novels from the crate, then moves to accompany Oliver by the door. Madeline extracts a penknife from her satchel and offers it to Oliver. He accepts it. She beams, then she stands up and retreats to the pantry. The cat approaches her from behind and encircles her with its arms. She nicks her finger peeling an apple. As he fossicks through the wardrobe for his suitcase, he extracts his silk scarf. They embrace. Somebody raps on the window. Madeline advances to open it. We linger on Oliver, who scrutinizes the penknife in his paw. He tiptoes into the attic, clumsily, fiddling with the brim of his helmet. There is an extended pause. Michael perches. She begins to mix the salads. Oliver props up against the bookshelf, eavesdropping. Madeline observes them both, intrigued, baffled. Abruptly, Oliver becomes rigid. Madeline pivots to mix the drink. Oliver signals her to halt where she stands. He advances, confronting Michael. Oliver strolls away. A raindrop slides down Madeline's chin as she listens. She stands near the window, with her back to both of them. Michael rises and glides toward the window. Madeline, her chin damp, remains silent."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Eddie sits at a table, smoking and waiting with a whisky bottle nearby while two disgruntled men in work clothes stand by the bar. Sarah, limping and dressed in a dark suit, approaches Eddie with a cold and suspicious demeanor. After a long stare, Eddie puts his arm around her, and they walk away together. Later, they share a close moment in bed, watching the outside through open shutters before closing them. Sarah emerges from a grocery store with supplies, and a woman returns her forgotten parcel. They unload groceries at home, and Sarah hands Eddie a cigarette lighter, smiling before going to the kitchenette. As she cuts her hand opening a can, Eddie rummages for his cue case. There's a knock at the door, and Sarah opens it while Eddie examines the lighter. Charlie enters awkwardly, and a tense silence follows. Eddie listens, tense, and signals Sarah to stay put before confronting Charlie. As Eddie walks off, a tear rolls down Sarah's cheek, and she stands near the door, silent, while Charlie exits."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Sarah her cheek wet says nothing Charlie gets up and moves toward the door She stands near the door with her back to both of them A tear rolls down Sarah's cheek as she hears this Eddie walks off He moves forward confronting Charlie Eddie signals her to stay where she is Sarah turns to fix the drink Suddenly Eddie becomes tense Sarah watches them both curious confused Eddie leans up against the wall listening She starts to make the drinks Charlie sits There is a long silence He enters the room awkwardly toying with the rim of his hat We stay on Eddie who examines the lighter in his hand Sarah goes to open it Someone knocks on the door They kiss As he rummages through the closet for his bag he pulls out his leather cue case She cuts her hand opening a can He comes up behind her and puts his arms around her then she gets up and returns to the kitchenette She smiles He takes it Sarah takes a cigarette lighter out of her purse and hands it to Eddie She unloads liquor and canned goods from the carton then goes to join Eddie by the window He pulls her schoolbooks out of the carton and takes her purse A woman runs out of the store to give her a parcel she left behind Sarah emerges from a neighborhood grocery store loaded down with a Cheese Doodles carton full of food He reaches out and closes the shutters He kisses her again this time on the lips He kisses her on the cheek He starts to put on his wristwatch She hands him her cigarette Sarah in a robe walks up and joins him in bed as they both peer out the window As they open we see Eddie in his underclothes on the bed A hand reaches up to open the wooden shutters As they walk she hesitantly puts an arm around his waist He gets up puts his arm around her shoulder and walks away with her They stare at one another for a long moment She pauses and looks at him She seems cold and suspicious as she limps toward the table When he looks up he sees Sarah standing nearby Sarah dressed in a dark suit limps toward him He mashes out his cigarette in the ashtray The paper bag with the whisky is on the table Eddie sits at a table smoking waiting They go to the bar Two men dressed in work clothes stand around looking disgruntled Some bills drop on a ragged beatup pool table Eddie goes back to his bottle of beer He turns on his stool to watch the game"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "When he looks up he sees Sarah standing nearby Sarah emerges from a neighborhood grocery store loaded down with a Cheese Doodles carton full of food He pulls her schoolbooks out of the carton and takes her purse Two men dressed in work clothes stand around looking disgruntled He kisses her again this time on the lips He enters the room awkwardly toying with the rim of his hat As they open we see Eddie in his underclothes on the bed There is a long silence He starts to put on his wristwatch She pauses and looks at him A tear rolls down Sarah's cheek as she hears this A woman runs out of the store to give her a parcel she left behind As he rummages through the closet for his bag he pulls out his leather cue case She smiles He comes up behind her and puts his arms around her Suddenly Eddie becomes tense They go to the bar He takes it She seems cold and suspicious as she limps toward the table She unloads liquor and canned goods from the carton then goes to join Eddie by the window Sarah goes to open it He turns on his stool to watch the game Sarah turns to fix the drink She hands him her cigarette Eddie leans up against the wall listening Charlie gets up and moves toward the door Someone knocks on the door Eddie walks off then she gets up and returns to the kitchenette He kisses her on the cheek He reaches out and closes the shutters They stare at one another for a long moment Sarah her cheek wet says nothing She cuts her hand opening a can Eddie signals her to stay where she is He gets up puts his arm around her shoulder and walks away with her She starts to make the drinks She stands near the door with her back to both of them Some bills drop on a ragged beatup pool table Sarah takes a cigarette lighter out of her purse and hands it to Eddie We stay on Eddie who examines the lighter in his hand Eddie sits at a table smoking waiting They kiss Sarah watches them both curious confused The paper bag with the whisky is on the table Sarah dressed in a dark suit limps toward him As they walk she hesitantly puts an arm around his waist A hand reaches up to open the wooden shutters Sarah in a robe walks up and joins him in bed as they both peer out the window He moves forward confronting Charlie Eddie goes back to his bottle of beer He mashes out his cigarette in the ashtray Charlie sits"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Sarah takes a cigarette lighter out of her purse and hands it to Eddie He takes it She smiles then she gets up and returns to the kitchenette He comes up behind her and puts his arms around her She cuts her hand opening a can As he rummages through the closet for his bag he pulls out his leather cue case They kiss Someone knocks on the door Sarah goes to open it We stay on Eddie who examines the lighter in his hand He enters the room awkwardly toying with the rim of his hat There is a long silence Charlie sits She starts to make the drinks Eddie leans up against the wall listening Sarah watches them both curious confused Suddenly Eddie becomes tense Sarah turns to fix the drink Eddie signals her to stay where she is He moves forward confronting Charlie Eddie walks off A tear rolls down Sarah's cheek as she hears this She stands near the door with her back to both of them Charlie gets up and moves toward the door Sarah her cheek wet says nothing He turns on his stool to watch the game Eddie goes back to his bottle of beer Some bills drop on a ragged beatup pool table Two men dressed in work clothes stand around looking disgruntled They go to the bar Eddie sits at a table smoking waiting The paper bag with the whisky is on the table He mashes out his cigarette in the ashtray Sarah dressed in a dark suit limps toward him When he looks up he sees Sarah standing nearby She seems cold and suspicious as she limps toward the table She pauses and looks at him They stare at one another for a long moment He gets up puts his arm around her shoulder and walks away with her As they walk she hesitantly puts an arm around his waist A hand reaches up to open the wooden shutters As they open we see Eddie in his underclothes on the bed Sarah in a robe walks up and joins him in bed as they both peer out the window She hands him her cigarette He starts to put on his wristwatch He kisses her on the cheek He kisses her again this time on the lips He reaches out and closes the shutters Sarah emerges from a neighborhood grocery store loaded down with a Cheese Doodles carton full of food A woman runs out of the store to give her a parcel she left behind He pulls her schoolbooks out of the carton and takes her purse She unloads liquor and canned goods from the carton then goes to join Eddie by the window"
        }
      ]
    }
  ]
}