{
  "ground_truth": "Charlie puts on his hat and leaves. Eddie empties his glass and slaps it on the shelf next to Sarah. She pours it out, saying nothing. Sarah hands Eddie his drink without looking him in the eye. She pours herself a very stiff drink as Eddie moves about restlessly. Sarah drinks her drink. Still drinking, she turns to him. They embrace and kiss one another without putting down their glasses. The room is a mess and Sarah is drunk. She sits on her knees on the floor, pecking at the keys of her typewriter with one finger. Her bottle and her glass are beside her. A bare-chested Eddie is in the kitchen behind her, tossing empty cans and bottles from the sink into a garbage bag. He carelessly wipes the sink, then throws down the dishrag and goes to the closet, pulling out his leather case. Reaching for the bottle, Sarah abruptly lurches forward over her typewriter, and knocks the bottle over. Eddie stares at Sarah as she sways limply on her knees, unmindful of her open robe. Eddie picks up the bottle and sets it before her. Taking her ashtray, Eddie rises, runs his hand through her hair for a moment, and then carries off the ashtray and empties it in the garbage bag. Sarah, still hopelessly drunk, is sprawled out on her bed, futilely attempting to dial a telephone. Eddie, in a clean shirt and pants, watches her. He sets the bottle down near the typewriter and notices the sheet of paper stuck in the typewriter's carriage. He bends down to read it. She falls back on the bed. Eddie pulls the paper out of the carriage and reads it. He thinks for a moment, then angrily crumples the paper in his hands and throws it at her. Eddie walks off. Eddie gives her a look, then lowers his eyes. Eddie turns and slaps her on the cheek. He reaches for his jacket. As Eddie pushes through the glass doors to the front room of Johnny's bar, he looks around at the unused pool tables, then goes to the bar. A man in a business suit comes out of the back room and joins him at the bar. The man looks to the bartender for his answer. Eddie takes his beer to the back room. The poker game is in progress. Four men are playing. One of them is Bert Gordon. His glass of milk is beside him on the table. He takes note of Eddie's presence with a quick dart of his eyes. Eddie takes a seat next to Bert. As the cards are dealt, Eddie steals a glance at the man he has come to see.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Certainly! Here's your text with each word replaced by a synonym whenever possible:\n\n---\n\nCharlie dons his cap and departs. Eddie drains his tumbler and slams it on the ledge beside Sarah. She empties it, uttering nothing. Sarah hands Eddie his beverage without glancing him in the eye. She pours herself a very strong drink as Eddie moves about uneasily. Sarah consumes her drink. Still drinking, she turns to him. They hug and kiss one another without setting down their glasses. The chamber is a mess and Sarah is intoxicated. She sits on her knees on the ground, pecking at the keys of her typewriter with one digit. Her bottle and her goblet are beside her. A bare-chested Eddie is in the kitchenette behind her, tossing empty cans and bottles from the basin into a trash bag. He carelessly wipes the basin, then throws down the dishrag and goes to the wardrobe, pulling out his leather case. Reaching for the bottle, Sarah suddenly lurches forward over her typewriter, and knocks the bottle over. Eddie gazes at Sarah as she sways limply on her knees, unmindful of her open robe. Eddie picks up the bottle and sets it before her. Taking her ashtray, Eddie rises, runs his hand through her hair for a moment, and then carries off the ashtray and empties it in the trash bag. Sarah, still hopelessly drunk, is sprawled out on her bed, futilely attempting to dial a telephone. Eddie, in a clean shirt and trousers, watches her. He sets the bottle down near the typewriter and notices the sheet of paper stuck in the typewriter's carriage. He bends down to read it. She falls back on the bed. Eddie pulls the paper out of the carriage and reads it. He thinks for a moment, then angrily crumples the paper in his hands and throws it at her. Eddie walks off. Eddie gives her a look, then lowers his eyes. Eddie turns and slaps her on the cheek. He reaches for his coat. As Eddie pushes through the glass doors to the front chamber of Johnny's bar, he looks around at the unused pool tables, then goes to the bar. A gentleman in a business suit comes out of the back room and joins him at the bar. The man looks to the bartender for his response. Eddie takes his ale to the back room. The poker game is in progress. Four men are playing. One of them is Bert Gordon. His glass of milk is beside him on the table. He takes note of Eddie's presence with a quick dart of his eyes. Eddie takes a seat next to Bert. As the cards are dealt, Eddie steals a glance at the man he has come to see.\n\n---"
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Charlie puts on his hat and leaves. The glass is emptied by Eddie and slapped on the shelf next to Sarah. Nothing is said by her as she pours it out. The drink is handed to Eddie by Sarah without her looking him in the eye. A very stiff drink is poured for herself by Sarah as Eddie moves about restlessly. Her drink is drunk by Sarah. Still drinking, she turns to him. They embrace and kiss one another without putting down their glasses. The room is a mess, and Sarah is drunk. She sits on her knees on the floor, pecking at the keys of her typewriter with one finger. Beside her are her bottle and her glass. In the kitchen behind her is a bare-chested Eddie, who tosses empty cans and bottles from the sink into a garbage bag. The sink is carelessly wiped by him, then the dishrag is thrown down, and he goes to the closet, pulling out his leather case. Reaching for the bottle, Sarah abruptly lurches forward over her typewriter and knocks the bottle over. Sarah is stared at by Eddie as she sways limply on her knees, unmindful of her open robe. The bottle is picked up by Eddie and set before her. Taking her ashtray, he rises, runs his hand through her hair for a moment, and then carries off the ashtray and empties it in the garbage bag. Sarah, still hopelessly drunk, sprawls out on her bed, futilely attempting to dial a telephone. Dressed in a clean shirt and pants, Eddie watches her. The bottle is set down near the typewriter by him, and the sheet of paper stuck in the typewriter's carriage is noticed. He bends down to read it. She falls back on the bed. The paper is pulled out of the carriage by Eddie and read. He thinks for a moment, then crumples the paper angrily in his hands and throws it at her. Eddie walks off. A look is given to her by Eddie, then he lowers his eyes. He turns and slaps her on the cheek. His jacket is reached for by him. As the glass doors to the front room of Johnny's bar are pushed through by Eddie, the unused pool tables are looked around at by him, then he goes to the bar. A man in a business suit comes out of the back room and joins him at the bar. The bartender is looked to by the man for his answer. Eddie takes his beer to the back room. The poker game is in progress. Four men play. Bert Gordon is one of them. His glass of milk sits beside him on the table. Eddie's presence is noted by him with a quick dart of his eyes. Eddie takes a seat next to Bert. As the cards are dealt, he steals a glance at the man he has come to see."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Charlie dons his hat and departs. Eddie empties his glass, placing it beside Sarah, who pours it out silently. She gives Eddie his drink without meeting his gaze and pours herself a stiff drink as Eddie restlessly moves around. Sarah drinks, then turns to him. They embrace and kiss without putting their glasses down. The room is in disarray, and Sarah is drunk, kneeling on the floor and typing with one finger. Her bottle and glass are beside her. Bare-chested Eddie is in the kitchen, throwing empty cans and bottles from the sink into a garbage bag. He hastily wipes the sink, tosses the dishrag, and retrieves his leather case from the closet. Sarah, reaching for her bottle, lurches over her typewriter, knocking it over. Eddie watches her swaying unsteadily on her knees, oblivious to her open robe. He picks up the bottle, sets it before her, and, after a moment's pause, runs his hand through her hair before leaving with the ashtray. Hopelessly drunk, Sarah sprawls on her bed, trying unsuccessfully to dial a phone. Eddie, now in a clean shirt and pants, observes her. He places the bottle near the typewriter and reads the paper stuck in its carriage. After a moment, he crumples the paper angrily and throws it at Sarah. He walks away, gives her one last look, then lowers his eyes and slaps her on the cheek before grabbing his jacket. Eddie enters Johnny's bar, looks at the empty pool tables, and heads to the bar. A businessman joins him, looking to the bartender for a response. Eddie takes his beer to the back room, where a poker game is underway. Four men, including Bert Gordon, are playing. Bert notes Eddie's presence and Eddie sits next to him. As cards are dealt, Eddie glances at the man he came to see."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Charlie departs. Eddie finishes his drink and slams the glass near Sarah, who silently refills it. She gives Eddie his drink without eye contact and pours herself a strong one. Sarah drinks as Eddie moves around. They kiss, glasses in hand. The room is messy, and Sarah is drunk, typing awkwardly beside her bottle. Bare-chested Eddie tosses cans and bottles into a garbage bag, wipes the sink, grabs his case, and sees Sarah knock the bottle over. He sets it back, strokes her hair, empties the ashtray, and watches Sarah struggle with the phone. Dressed, he reads a paper from her typewriter, crumples it angrily, and throws it at her. He slaps her cheek before taking his jacket. At Johnny's bar, Eddie surveys unused pool tables and heads to the bar. A businessman joins him, and Eddie takes his beer to a poker game. Bert Gordon notices Eddie as he joins the game and glances at his intended contact."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Charlie, after putting on his hat with a decisive motion, leaves the room. Meanwhile, Eddie finishes his drink with a final gulp and places the empty glass energetically on the shelf right beside Sarah. She proceeds to pour out the remaining contents without uttering a single word. Sarah, maintaining her focus elsewhere, hands Eddie his drink, deliberately avoiding eye contact with him. She then pours herself an exceptionally strong drink, all while Eddie moves around restlessly in the room. As Sarah consumes her drink, she turns towards him without pausing from her drinking. They engage in an embrace and kiss each other passionately, their glasses still firmly held in their hands.\n\nThe room is in complete disarray, and Sarah is evidently intoxicated. She finds herself on her knees on the floor, awkwardly pecking at the keys of her typewriter with an unsteady finger. Her bottle and glass lie conveniently beside her. Positioned behind her in the kitchen, Eddie, who is bare-chested, is haphazardly tossing empty cans and bottles from the crowded sink into a garbage bag. He wipes the sink carelessly, then tosses the dishrag aside with little concern and approaches the closet to retrieve his leather case. As Sarah reaches for the bottle, she suddenly lurches forward over her typewriter, accidentally knocking the bottle over. Eddie gazes intently at Sarah as she sways unsteadily on her knees, seemingly oblivious to her robe hanging open. Eddie picks up the bottle and places it gently before her. He takes her ashtray, and for a brief moment, he tenderly runs his fingers through her hair, then walks away to empty the ashtray into the garbage bag.\n\nSarah, still thoroughly inebriated, is sprawled out on her bed, struggling unsuccessfully to dial a telephone number. Eddie, now dressed in a clean shirt and pants, watches her with a mix of concern and frustration. He sets the bottle down near the typewriter, noticing the sheet of paper jammed awkwardly in the typewriter’s carriage. Bending down, he reads what is written. She falls back onto the bed, defeated. Eddie yanks the paper out of the carriage, quickly scans its contents, and in an angry burst, crumples the paper in his hands before throwing it at her. Eddie walks away, gives her one last look, and then lowers his eyes in resignation. Without hesitation, Eddie turns and lightly slaps her cheek. He then reaches for his jacket and heads out.\n\nEddie, as he pushes through the glass doors leading to the front room of Johnny's bar, takes in the sight of the unused pool tables, then makes his way to the bar. A man, dressed in a business suit, emerges from the back room and joins Eddie at the bar. The man glances toward the bartender, silently seeking confirmation or an answer. Eddie, clutching his beer, proceeds to the back room, where a poker game is already in progress. Four men are engrossed in their game, and among them is Bert Gordon, who has a glass of milk positioned beside him on the table. Bert acknowledges Eddie’s arrival with a quick, sharp dart of his eyes in Eddie’s direction. Eddie takes a seat next to Bert, and as the cards are methodically dealt, Eddie steals a brief glance at the man he specifically came to see, evaluating him quietly."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Charlie, after placing his hat on his head with a decisive and purposeful motion, leaves the room with a sense of finality. Meanwhile, Eddie, finishing his drink with a satisfying final gulp, places the now-empty glass energetically and with a certain flair on the shelf right beside where Sarah is standing. In response, she goes ahead and pours out what remains in the bottle without saying a single word, her silence filling the space between them. Sarah, keeping her focus purposefully elsewhere, hands Eddie his drink, all the while deliberately avoiding any eye contact with him. She then pours herself an exceptionally strong drink, adding to the tension in the atmosphere, as Eddie roams restlessly around the room. As Sarah consumes her drink with determination, she turns toward him without pausing in her drinking. They share an embrace and passionately kiss each other, their glasses still firmly and tightly held in their hands, a testament to the moment's intensity.\n\nThe room around them is in complete disarray, and it is evident that Sarah is intoxicated. She finds herself on her knees on the floor, awkwardly pecking at the keys of her typewriter with an unsteady and wavering finger. Her bottle and glass lie conveniently beside her within easy reach. Positioned behind her in the kitchen, Eddie, who is bare-chested, is haphazardly tossing empty cans and bottles from the cluttered sink into an overflowing garbage bag. He wipes the sink carelessly, then throws the dishrag aside with little concern, and approaches the closet to retrieve his trusty leather case. As Sarah reaches for the bottle, she suddenly lurches forward over her typewriter, inadvertently knocking the bottle over. Eddie gazes intently at Sarah as she sways unsteadily on her knees, seemingly oblivious to her robe hanging open in a carefree manner. Eddie picks up the bottle and places it gently back before her. He takes her ashtray, and for a brief, tender moment, he runs his fingers through her hair before walking away to empty the ashtray into the garbage bag.\n\nSarah, still thoroughly inebriated, is sprawled out on her bed, struggling with great difficulty to dial a telephone number. Eddie, now dressed in a clean shirt and pants, watches her with a mix of concern and growing frustration. He sets the bottle down carefully near the typewriter, noticing the sheet of paper jammed awkwardly in the typewriter’s carriage. Bending down, he reads what is written there. She falls back onto the bed, overwhelmed and defeated. Eddie yanks the paper out of the carriage, quickly scanning its contents, and in an angry burst, crumples the paper in his hands before throwing it at her in a fit of anger. Eddie walks away, giving her one last look filled with emotion, then lowers his eyes in resignation. Without hesitation, Eddie turns and lightly slaps her cheek, a move filled with complex emotions. He then reaches for his jacket, puts it on, and heads out without looking back.\n\nEddie, as he pushes through the glass doors that lead into the front room of Johnny's bar, takes in the sight of the unused pool tables scattered throughout the room. He then makes his way to the bar with a purposeful stride. A man dressed in a business suit emerges from the back room and joins Eddie at the bar, glancing toward the bartender as if silently seeking confirmation or an answer to an unspoken question. Eddie, clutching his beer firmly, proceeds into the back room, where a poker game is already in progress. Four men, entirely engrossed in their game, sit around the table, and among them is Bert Gordon, who has a glass of milk positioned beside him on the table. Bert acknowledges Eddie’s arrival with a quick, sharp dart of his eyes in Eddie’s direction. Eddie takes a seat next to Bert, and as the cards are methodically dealt with precision and care, Eddie steals a brief glance at the man he specifically came to see, silently and carefully evaluating him during the quiet moment."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Charlie carefully places his hat atop his head and strides purposefully out of the room, leaving behind a silent echo of his departure. Meanwhile, Eddie, standing at the bar, drains his glass of its contents, the last drops sliding down his throat, and then decisively slaps the empty glass onto the shelf beside Sarah. Without uttering a single word, Sarah takes the glass, tilts it, and pours its remnants away before preparing another drink, her eyes never meeting Eddie's. She silently hands Eddie his drink with a practiced motion, avoiding eye contact, while Eddie begins to move around the room in a restless manner. Sarah then deliberately measures and pours herself an exceptionally strong drink, the liquid splashing into her glass, and takes a sip, savoring the potent taste. As she continues to drink, her eyes gradually shift toward Eddie, and in an unspoken understanding, they move towards each other, embracing and kissing without bothering to set down their glasses, their actions painting a complex picture of their relationship. The room around them is disordered, a clear reflection of Sarah's inebriated state, and she eventually finds herself kneeling on the floor, clumsily pecking at the keys of her typewriter, striking each key with a solitary finger. Beside her are her bottle and glass, remnants of her earlier indulgence. Behind her in the kitchen, Eddie, bare-chested, is engaged in a routine task, tossing empty cans and bottles from the sink into a garbage bag with little care. He haphazardly wipes the sink, leaving behind a damp dishrag he casually tosses aside before heading towards the closet, pulling out his leather case in preparation for something unwritten. As Sarah reaches for the bottle in a moment of clumsy determination, she loses her balance and lurches forward, inadvertently knocking the bottle over with a dull thud. Eddie watches the scene unfold, his eyes fixed on Sarah as she sways unsteadily on her knees, her robe falling open, but she remains oblivious to her own state. With a quiet resolve, Eddie picks up the fallen bottle, setting it upright in front of her, his movements calm and deliberate. He takes Sarah's ashtray, momentarily runs his hand through her hair as if to offer comfort, then rises, carrying the ashtray to the garbage bag and empties it with a sense of finality. Meanwhile, Sarah, still heavily intoxicated, is now sprawled across her bed, her fingers fumbling impotently with the telephone's dial, her efforts futile. Eddie, dressed anew in a clean shirt and pants, observes her with an air of resignation. He sets the bottle down near the typewriter, his gaze catching on the sheet of paper jammed in its carriage. Leaning down to read it, he takes in the words written there, a flicker of thought crossing his face. Disappointed, Eddie pulls the paper free from the typewriter, eyes scanning the lines before anger conquers him, crumpling the paper in his hand and hurling it at Sarah in frustration. With a heavy heart and eyes averted, Eddie begins to walk away, stopping only to give Sarah a lingering look before lowering his gaze. In a sudden flash of anger, Eddie turns back and delivers a sharp slap to her cheek, the sound hanging in the air, then reaches for his jacket, signaling his departure. As Eddie pushes through the glass doors into the front room of Johnny's bar, his eyes sweep across the room, noting with a glance the unused pool tables before directing his attention to the bar itself. At that moment, a man wearing a business suit emerges from the back room and joins Eddie at the bar, glancing toward the bartender in anticipation of a response to an unspoken question. With his beer in hand, Eddie makes his way to the back room, where a poker game is well underway. Four men sit around a table, cards in hand, and among them is Bert Gordon, his glass of milk a peculiar sight against the backdrop of the game. Bert acknowledges Eddie's arrival with a swift, knowing glance, a subtle acknowledgement of their past encounters. Eddie slides into a seat beside Bert, his presence shifting the dynamic at the table, and as the dealer begins to distribute the cards, Eddie steals a secretive glance at the man he has come to encounter, setting the stage for whatever will unfold next."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Charlie leaves after putting on his hat. Eddie finishes his drink, places the glass on the shelf, and Sarah silently refills it before handing it back to him without eye contact. As Eddie moves about restlessly, Sarah prepares a strong drink for herself, and they both drink while exchanging a kiss, glasses still in hand. Amidst a messy room, an intoxicated Sarah sits on the floor typing with one finger, surrounded by her bottle and glass. In the kitchen, Eddie, shirtless, throws empty cans and bottles into a garbage bag, wipes the sink carelessly, and retrieves his leather case from the closet. Sarah lurches forward and accidentally knocks over her bottle. Eddie observes her swaying on her knees, retrieves the bottle, and sets it before her. He briefly touches her hair before emptying her ashtray into the garbage. Later, Sarah, still drunk, futilely attempts to dial a phone as Eddie, now dressed, watches and notices a sheet of paper in the typewriter. After reading it, he crumples the paper in frustration and throws it at her before walking away. In Johnny's bar, Eddie surveys the unused pool tables and heads to the bar. A man in a business suit joins him, prompting the bartender for a response. Eddie proceeds to the back room where a poker game is underway, with four men, including Bert Gordon, playing. Eddie sits next to Bert, and as the cards are dealt, he discreetly glances at the man he came to see."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Charlie, donning his favorite worn-out fedora that he bought from a vintage store, puts on his hat and leaves. Eddie empties his glass, which once held a stiff Scotch, and slaps it on the shelf next to Sarah, whose expression remains unreadable. She pours it out, saying nothing, as though accustomed to this routine. Sarah hands Eddie his fresh drink, an expertly mixed Manhattan, without looking him in the eye. She pours herself a very stiff drink as Eddie, unable to sit still, moves about restlessly. Sarah drinks her potent concoction. Still drinking, she turns to him. They embrace and kiss one another without putting down their glasses, a testament to their complex relationship. The room, filled with the smell of cigarette smoke and spilled alcohol, is a mess and Sarah is indisputably drunk. She sits on her knees on the floor, pecking at the keys of her old Underwood typewriter with one finger. Her bottle and her glass are beside her, companions in her solitude. A bare-chested Eddie is in the kitchen behind her, tossing empty cans and bottles from the sink into a garbage bag that already overflows with their discarded nights. He carelessly wipes the sink, then throws down the dishrag and goes to the closet, pulling out his leather case, which he uses for his poker games. Reaching for the bottle, Sarah abruptly lurches forward over her typewriter, her fingers accidentally striking random keys, and knocks the bottle over. Eddie stares at Sarah as she sways limply on her knees, unmindful of her open robe, which reveals more vulnerability than she would care to show. Eddie picks up the bottle and sets it before her with a resigned patience. Taking her ashtray, Eddie rises, runs his hand through her hair for a moment, recalling better times, and then carries off the ashtray and empties it in the garbage bag. Sarah, still hopelessly drunk, is sprawled out on her bed, futilely attempting to dial a telephone, likely to call someone who won't answer. Eddie, in a clean shirt and pants that he reserves for important outings, watches her with a mixture of frustration and concern. He sets the bottle down near the typewriter and notices the sheet of paper stuck in the typewriter's carriage, curious about what she has written. He bends down to read it. She falls back on the bed, defeated by her own helplessness. Eddie pulls the paper out of the carriage and reads it. He thinks for a moment, his mind a whirlwind of emotions, then angrily crumples the paper in his hands and throws it at her, unable to contain his disappointment. Eddie walks off, feeling the weight of his decisions. Eddie gives her a look, then lowers his eyes, acknowledging the fracture in their bond. Eddie turns and slaps her on the cheek, a harsh action born from desperation. He reaches for his jacket, preparing to leave behind the chaos. As Eddie pushes through the glass doors to the front room of Johnny's bar, a local haunt known for its lively atmosphere and late-night poker games, he looks around at the unused pool tables, then goes to the bar where familiar faces nod in recognition. A man in a business suit, likely a regular with ties to the poker scene, comes out of the back room and joins him at the bar, their shared understanding unspoken. The man looks to the bartender for his answer, a silent exchange that speaks volumes. Eddie takes his beer, a chilled lager, to the back room. The poker game is in progress, the players concentrating on their hands. Four men are playing, each looking for a moment to strike. One of them is Bert Gordon, a seasoned gambler known for his cunning, whose glass of milk stands in stark contrast to the strong drinks around him. He takes note of Eddie's presence with a quick dart of his eyes. Eddie takes a seat next to Bert, the tension palpable. As the cards are dealt, Eddie steals a glance at the man he has come to see, calculating his next move."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Charlie puts on his hat and leaves. Eddie empties his glass and slaps it on the shelf next to Sarah. She pours it out saying nothing. Sarah hands Eddie his drink without looking him in the eye. She pours herself a very stiff drink as Eddie moves about restlessly. Sarah drinks her drink. Still drinking she turns to him. They embrace and kiss one another without putting down their glasses. The room is a mess and Sarah is drunk. She sits on her knees on the floor pecking at the keys of her typewriter with one finger. Her bottle and her glass are beside her. A barechested Eddie is in the kitchen behind her tossing empty cans and bottles from the sink into a garbage bag. He carelessly wipes the sink then throws down the dishrag and goes to the closet pulling out his leather case. Reaching for the bottle Sarah abruptly lurches forward over her typewriter and knocks the bottle over. Eddie stares at Sarah as she sways limply on her knees. unmindful of her open robe. Eddie picks up the bottle and sets it before her. Taking her ashtray Eddie rises runs his hand through her hair for a moment and then carries off the ashtray and empties it in the garbage bag. Sarah still hopelessly drunk is sprawled out on her bed futilely attempting to dial a telephone. Eddie in a clean shirt and pants watches her. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. He sets the bottle down near the typewriter and notices the sheet of paper stuck in the typewriter's carriage. He bends down to read it. She falls back on the bed. Eddie pulls the paper out of the carriage and reads it. He thinks for a moment then angrily crumples the paper in his hands and throws it at her. Eddie walks off. Eddie gives her a look then lowers his eyes. Eddie turns and slaps her on the cheek. He reaches for his jacket. As Eddie pushes through the glass doors to the front room of Johnny's bar he looks around at the unused pool tables then goes to the bar. A man in a business suit comes out of the back room and joins him at the bar. The man looks to the bartender for his answer. Eddie takes his beer to the back room. The poker game is in progress. Four men are playing. One of them is Bert Gordon. His glass of milk is beside him on the table. He takes note of Eddie's presence with a quick dart of his eyes. Eddie takes a seat next to Bert. As the cards are dealt Eddie steals a glance at the man he has come to see."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Charlie puts on his hat and leaves. Eddie empties his glass and slaps it on the shelf next to Sarah. She pours it out saying nothing. Sarah hands Eddie his drink without looking him in the eye. She pours herself a very stiff drink as Eddie moves about restlessly. Sarah drinks her drink. Still drinking she turns to him. They embrace and kiss one another without putting down their glasses. The room is a mess and Sarah is drunk. She sits on her knees on the floor pecking at the keys of her typewriter with one finger. Her bottle and her glass are beside her. A barechested Eddie is in the kitchen behind her tossing empty cans and bottles from the sink into a garbage bag. He carelessly wipes the sink then throws down the dishrag and goes to the closet pulling out his leather case. Reaching for the bottle Sarah abruptly lurches forward over her typewriter and knocks the bottle over. Eddie stares at Sarah as she sways limply on her knees. unmindful of her open robe. Eddie picks up the bottle and sets it before her. Taking her ashtray Eddie rises runs his hand through her hair for a moment and then carries off the ashtray and empties it in the garbage bag. Sarah still hopelessly drunk is sprawled out on her bed futilely attempting to dial a telephone. Eddie in a clean shirt and pants watches her. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. He sets the bottle down near the typewriter and notices the sheet of paper stuck in the typewriter's carriage. He bends down to read it. She falls back on the bed. Eddie pulls the paper out of the carriage and reads it. He thinks for a moment then angrily crumples the paper in his hands and throws it at her. Eddie walks off. Eddie gives her a look then lowers his eyes. Eddie turns and slaps her on the cheek. He reaches for his jacket. As Eddie pushes through the glass doors to the front room of Johnny's bar he looks around at the unused pool tables then goes to the bar. A man in a business suit comes out of the back room and joins him at the bar. The man looks to the bartender for his answer. Eddie takes his beer to the back room. The poker game is in progress. Four men are playing. One of them is Bert Gordon. His glass of milk is beside him on the table. He takes note of Eddie's presence with a quick dart of his eyes. Eddie takes a seat next to Bert. As the cards are dealt Eddie steals a glance at the man he has come to see."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Charlie puts on his hat and leaves. Eddie empties his glass and slaps it on the shelf next to Sarah. She pours it out saying nothing. Sarah hands Eddie his drink without looking him in the eye. She pours herself a very stiff drink as Eddie moves about restlessly. Sarah drinks her drink. Still drinking she turns to him. They embrace and kiss one another without putting down their glasses. The room is a mess and Sarah is drunk. She sits on her knees on the floor pecking at the keys of her typewriter with one finger. A man in a business suit comes out of the back room and joins him at the bar. The man looks to the bartender for his answer. Eddie takes his beer to the back room. The poker game is in progress. Four men are playing. One of them is Bert Gordon. His glass of milk is beside him on the table. He takes note of Eddie's presence with a quick dart of his eyes. Eddie takes a seat next to Bert. As the cards are dealt Eddie steals a glance at the man he has come to see."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Charlie puts on his hat and leaves. Eddie empties his glass and slaps it on the shelf next to Sarah. She pours it out saying nothing. Sarah hands Eddie his drink without looking him in the eye. His glass of milk is beside him on the table. He takes note of Eddie's presence with a quick dart of his eyes. Eddie takes a seat next to Bert. As the cards are dealt Eddie steals a glance at the man he has come to see."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Molly dons her scarf and departs. Max empties his bowl and places it on the counter near Lucy. She scatters it out, whispering softly. Lucy passes Max his soda without meeting his gaze. She prepares herself a very weak tea as Max paces about anxiously. Lucy sips her tea. Still sipping, she turns toward him. They high-five and wave at each other without setting down their plates. The garden is a disaster and Lucy is exhausted. She kneels on the grass, tapping at the screen of her tablet with one thumb. Her mug and her plate are beside her. A bare-chested Max is in the gazebo behind her, tossing empty flower pots and trays from the bench into a recycling bin. He carelessly brushes the bench, then throws down the sponge and goes to the shed, pulling out his canvas satchel. Reaching for the mug, Lucy suddenly lurches forward over her tablet and knocks the mug over. Max watches Lucy as she leans unsteadily on her knees, oblivious to her open sweater. Max lifts the mug and places it before her. Taking her notebook, Max stands up, runs his hand through her hair for a moment, and then walks off with the notebook to dispose of it in the recycling bin. Lucy, still utterly exhausted, is sprawled out on her hammock, futilely attempting to scroll an app. Max, in a clean t-shirt and jeans, observes her. He places the mug near the tablet and notices the digital document stuck on the tablet's screen. He crouches down to read it. She reclines back on the hammock. Max extracts the document from the screen and reads it. He considers for a moment, then furiously crumples the document in his imagination and tosses it at her. Max strides off. Max gives her a glance, then averts his eyes. Max turns and pats her on the shoulder. He reaches for his backpack. As Max pushes through the revolving doors to the lounge of Sally's café, he glances around at the empty chess boards, then heads to the coffee counter. A woman in a party dress emerges from the lobby and joins him at the counter. The woman looks to the barista for her response. Max carries his tea to the lobby. The board game session is in progress. Four people are playing. One of them is Alice Green. Her cup of coffee is beside her on the table. She acknowledges Max’s arrival with a quick flick of her eyes. Max settles in next to Alice. As the tiles are shuffled, Max sneaks a peek at the person he has come to meet."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Charlie leaves, while Eddie finishes his drink and gets another from Sarah without making eye contact. Sarah, visibly drunk, types on her typewriter. Eddie tidies up, but Sarah accidentally spills her bottle. Eddie picks it up, touches her hair briefly, and empties the ashtray. Sarah attempts to use the phone but struggles. Eddie reads the paper in her typewriter, crumples it angrily, and throws it at her. He then slaps her, grabs his jacket, and leaves for Johnny's bar. At the bar, he joins a poker game with four men, including Bert Gordon, who acknowledges Eddie with a glance. Eddie takes a seat next to Bert as the game begins."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "As the cards are dealt Eddie steals a glance at the man he has come to see Eddie takes a seat next to Bert He takes note of Eddie's presence with a quick dart of his eyes His glass of milk is beside him on the table One of them is Bert Gordon Four men are playing The poker game is in progress Eddie takes his beer to the back room The man looks to the bartender for his answer A man in a business suit comes out of the back room and joins him at the bar As Eddie pushes through the glass doors to the front room of Johnny's bar he looks around at the unused pool tables then goes to the bar He reaches for his jacket Eddie turns and slaps her on the cheek Eddie gives her a look then lowers his eyes Eddie walks off He thinks for a moment then angrily crumples the paper in his hands and throws it at her Eddie pulls the paper out of the carriage and reads it She falls back on the bed He bends down to read it He sets the bottle down near the typewriter and notices the sheet of paper stuck in the typewriter's carriage Eddie in a clean shirt and pants watches her Sarah still hopelessly drunk is sprawled out on her bed futilely attempting to dial a telephone Taking her ashtray Eddie rises runs his hand through her hair for a moment and then carries off the ashtray and empties it in the garbage bag Eddie picks up the bottle and sets it before her unmindful of her open robe Eddie stares at Sarah as she sways limply on her knees Reaching for the bottle Sarah abruptly lurches forward over her typewriter and knocks the bottle over He carelessly wipes the sink then throws down the dishrag and goes to the closet pulling out his leather case A barechested Eddie is in the kitchen behind her tossing empty cans and bottles from the sink into a garbage bag Her bottle and her glass are beside her She sits on her knees on the floor pecking at the keys of her typewriter with one finger The room is a mess and Sarah is drunk They embrace and kiss one another without putting down their glasses Still drinking she turns to him Sarah drinks her drink She pours herself a very stiff drink as Eddie moves about restlessly Sarah hands Eddie his drink without looking him in the eye She pours it out saying nothing Eddie empties his glass and slaps it on the shelf next to Sarah Charlie puts on his hat and leaves"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Eddie empties his glass and slaps it on the shelf next to Sarah Charlie puts on his hat and leaves Sarah hands Eddie his drink without looking him in the eye She pours it out saying nothing Sarah drinks her drink She pours herself a very stiff drink as Eddie moves about restlessly They embrace and kiss one another without putting down their glasses Still drinking she turns to him She sits on her knees on the floor pecking at the keys of her typewriter with one finger The room is a mess and Sarah is drunk A barechested Eddie is in the kitchen behind her tossing empty cans and bottles from the sink into a garbage bag Her bottle and her glass are beside her Reaching for the bottle Sarah abruptly lurches forward over her typewriter and knocks the bottle over He carelessly wipes the sink then throws down the dishrag and goes to the closet pulling out his leather case unmindful of her open robe Eddie stares at Sarah as she sways limply on her knees Taking her ashtray Eddie rises runs his hand through her hair for a moment and then carries off the ashtray and empties it in the garbage bag Eddie picks up the bottle and sets it before her Eddie in a clean shirt and pants watches her Sarah still hopelessly drunk is sprawled out on her bed futilely attempting to dial a telephone He bends down to read it He sets the bottle down near the typewriter and notices the sheet of paper stuck in the typewriter's carriage Eddie pulls the paper out of the carriage and reads it She falls back on the bed Eddie walks off He thinks for a moment then angrily crumples the paper in his hands and throws it at her Eddie turns and slaps her on the cheek Eddie gives her a look then lowers his eyes As Eddie pushes through the glass doors to the front room of Johnny's bar he looks around at the unused pool tables then goes to the bar He reaches for his jacket The man looks to the bartender for his answer A man in a business suit comes out of the back room and joins him at the bar The poker game is in progress Eddie takes his beer to the back room One of them is Bert Gordon Four men are playing He takes note of Eddie's presence with a quick dart of his eyes His glass of milk is beside him on the table As the cards are dealt Eddie steals a glance at the man he has come to see Eddie takes a seat next to Bert"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He sets the bottle down near the typewriter and notices the sheet of paper stuck in the typewriter's carriage He bends down to read it She falls back on the bed Eddie pulls the paper out of the carriage and reads it He thinks for a moment then angrily crumples the paper in his hands and throws it at her Eddie walks off Eddie gives her a look then lowers his eyes Eddie turns and slaps her on the cheek He reaches for his jacket As Eddie pushes through the glass doors to the front room of Johnny's bar he looks around at the unused pool tables then goes to the bar A man in a business suit comes out of the back room and joins him at the bar The man looks to the bartender for his answer Eddie takes his beer to the back room The poker game is in progress Four men are playing One of them is Bert Gordon His glass of milk is beside him on the table He takes note of Eddie's presence with a quick dart of his eyes Eddie takes a seat next to Bert As the cards are dealt Eddie steals a glance at the man he has come to see Charlie puts on his hat and leaves Eddie empties his glass and slaps it on the shelf next to Sarah She pours it out saying nothing Sarah hands Eddie his drink without looking him in the eye She pours herself a very stiff drink as Eddie moves about restlessly Sarah drinks her drink Still drinking she turns to him They embrace and kiss one another without putting down their glasses The room is a mess and Sarah is drunk She sits on her knees on the floor pecking at the keys of her typewriter with one finger Her bottle and her glass are beside her A barechested Eddie is in the kitchen behind her tossing empty cans and bottles from the sink into a garbage bag He carelessly wipes the sink then throws down the dishrag and goes to the closet pulling out his leather case Reaching for the bottle Sarah abruptly lurches forward over her typewriter and knocks the bottle over Eddie stares at Sarah as she sways limply on her knees unmindful of her open robe Eddie picks up the bottle and sets it before her Taking her ashtray Eddie rises runs his hand through her hair for a moment and then carries off the ashtray and empties it in the garbage bag Sarah still hopelessly drunk is sprawled out on her bed futilely attempting to dial a telephone Eddie in a clean shirt and pants watches her"
        }
      ]
    }
  ]
}