{
  "ground_truth": "Don enters the chaotic living room, where the telephone on the desk is the only thing seemingly alive. Although he appears to be heading straight to the ringing phone, he is actually drawn to the bottle and the glass by the big chair. He moves slowly toward them, picks up the bottle, and holds it upside down over the glass. The room is in disorder, with books on the floor, a table on a chair under the ceiling fixture, the couch moved from the wall, and clothes and shoes spilled from the closet. Two empty bottles and a sticky glass are about, while a typewriter with a nearly blank sheet of paper sits on the desk. Don goes to the glass and holds two bottles upside down over it, yielding only one slow drop, followed by two more that barely stain the bottom of the glass. He puts down the bottles and empties the meager drops into his throat. Assessing his finances, Don quickly checks his pockets and finds exactly two cents in his palm. Looking around, he notices the typewriter and moves toward it, ripping the sheet of paper from the roller, slamming the lid shut, and picking it up. He drags it to the hallway, puts on his hat, carefully steps over two newspapers and bottles of milk, closes the door, and starts down the stairs, where a note from Helen remains pinned to the door. Exiting the house with the typewriter, he encounters a steel gate blocking the entrance and stands mystified. Nearby, a woman with a baby carriage stands, staring intrusively. Don, feeling pressured by her gaze, straightens up and heads toward another pawn shop, a distant goal given his condition. Each step is painful, and the thunderous noise of the elevated railway above is excruciating. He leans against a pillar, shaking, and waits for a trolley car to pass before continuing across the street to the second pawn shop, only to find it closed as well. Frustrated, he shakes a bar and peers through the iron gate into the dark shop. Seeing another pawn shop across the street, he sweats profusely as two men stand grinning nearby. Finally, discouraged, he picks up the typewriter and starts walking back.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Don enters the tumultuous parlor, where the telephone on the desk is the sole object seemingly animated. Although he seems to be heading directly to the ringing phone, he is actually pulled to the bottle and the tumbler by the large chair. He progresses slowly toward them, picks up the bottle, and holds it inverted over the glass. The room is in chaos, with books on the floor, a table atop a chair beneath the ceiling fixture, the couch shifted from the wall, and garments and footwear scattered from the closet. Two vacant bottles and a sticky tumbler are about, while a typewriter with a nearly blank sheet of paper rests on the desk. Don goes to the glass and holds two bottles inverted over it, yielding only one slow droplet, followed by two more that scarcely stain the bottom of the glass. He sets down the bottles and drains the scant droplets into his throat. Evaluating his finances, Don promptly checks his pockets and discovers precisely two cents in his palm. Glancing around, he observes the typewriter and moves toward it, tearing the sheet of paper from the roller, slamming the lid shut, and lifting it up. He drags it to the corridor, dons his hat, cautiously steps over two newspapers and bottles of milk, closes the door, and starts down the stairs, where a note from Helen remains pinned to the door. Exiting the dwelling with the typewriter, he encounters a steel gate obstructing the entrance and stands perplexed. Nearby, a woman with a baby carriage stands, staring intrusively. Don, feeling pressured by her gaze, straightens up and heads toward another pawn shop, a distant aim given his condition. Each step is painful, and the thunderous racket of the elevated railway above is excruciating. He leans against a pillar, trembling, and waits for a trolley car to pass before continuing across the street to the second pawn shop, only to find it closed as well. Frustrated, he shakes a bar and peers through the iron gate into the dark shop. Seeing another pawn shop across the street, he sweats profusely as two men stand smirking nearby. Finally, discouraged, he picks up the typewriter and starts walking back."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The chaotic living room is entered by Don, where the telephone on the desk seems to be the only thing alive. Although he is appeared to be heading straight to the ringing phone, the bottle and the glass by the big chair actually draw him. They are moved toward slowly by him, the bottle is picked up, and it is held upside down over the glass. Disorder fills the room, with books on the floor, a table on a chair under the ceiling fixture, the couch moved from the wall, and clothes and shoes that spill from the closet. Empty bottles and a sticky glass clutter the space, while a nearly blank sheet of paper sits in a typewriter on the desk. The glass is gone to by Don, and two bottles are held upside down over it by him, yielding only one slow drop, followed by two more that barely stain the bottom of the glass. The bottles are put down by him, and the meager drops are emptied into his throat. His finances are assessed by him, and his pockets are quickly checked, revealing exactly two cents in his palm. The typewriter is noticed by him, and he moves toward it, ripping the sheet of paper from the roller, slamming the lid shut, and picking it up. It is dragged to the hallway by him; his hat is put on, and he carefully steps over two newspapers and bottles of milk, closes the door, and starts down the stairs, where Helen has left a note pinned to the door. The house is exited by him with the typewriter, and the blocked entrance by a steel gate mystifies him as he stands. Nearby, a woman with a baby carriage stares intrusively. Feeling pressured by her gaze, he straightens up and heads toward another pawn shop, a distant goal given his condition. Pain accompanies each step, and the thunderous noise of the elevated railway overhead is excruciating to him. A pillar supports him as he leans, shaking and waiting for a trolley car to pass before continuing across the street to the second pawn shop, only to discover it closed. Frustration causes him to shake a bar and peer through the iron gate into the dark shop. Across the street, another pawn shop is seen by him, and he sweats profusely as two men stand grinning nearby. Finally, discouraged, the typewriter is picked up by him, and he starts walking back."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Don enters the chaotic living room, where the telephone is the only sign of life. Although heading toward the ringing phone, he's drawn to the bottle and glass by the chair. Moving slowly, he picks up the bottle and tips it over the glass. The room is disordered: books on the floor, a table on a chair under the ceiling fixture, the couch away from the wall, and clothes and shoes scattered. Two empty bottles and a sticky glass are present, while a typewriter with a nearly blank sheet sits on the desk. Don tips two bottles over the glass, yielding only three drops, which he drinks. Checking his finances, he finds two cents in his pocket. Noticing the typewriter, he tears out the paper, slams the lid, and picks it up. Dragging it to the hallway, he dons his hat, steps over newspapers and milk bottles, and starts down the stairs, where Helen's note remains pinned. Leaving with the typewriter, he encounters a steel gate, pausing in confusion. Nearby, a woman with a baby carriage stares. Pressured, he straightens up and heads for another pawn shop, a distant goal. Each step is painful, and the elevated railway's noise above is unbearable. He leans against a pillar, waits for a trolley to pass, and crosses to the second pawn shop, only to find it closed. Frustrated, he shakes a bar, peers into the dark shop, and sweats profusely as two men grin nearby. Discouraged, he picks up the typewriter and starts back."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Don enters the chaotic living room, drawn to the bottle and glass by the chair despite the ringing phone. He slowly picks up the bottle and pours meager drops into the glass. The room is disorderly with books on the floor, a table on a chair, a displaced couch, and scattered clothes. With a nearly blank typewriter sheet on the desk, he empties the drops into his throat, finds two cents in his pocket, and rips the paper from the roller. After closing the typewriter, he steps over newspapers and milk bottles, and exits, noticing a note from Helen. Outside, a steel gate blocks his way as a woman with a baby carriage stares. Feeling pressured, he moves toward another pawn shop, each step painful under the railway's noise. Finding it closed, he peers inside and then notices another pawn shop, sweating as two men grin nearby. Discouraged, he picks up the typewriter and heads back."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Don steps into the chaotic and disorderly living room, where the incessant ringing of the telephone placed prominently on the desk is the only sound that seems to imbue the space with any semblance of life. Despite giving the impression that he is being pulled directly toward the clamorous phone, in reality, he is irresistibly drawn to the enticing sight of the bottle and glass positioned invitingly next to the large, imposing chair. With deliberate slowness, he makes his way toward them, picking up the bottle and holding it precariously upside down over the waiting glass below. Meanwhile, the disarray of the room is palpable, with scattered books strewn haphazardly across the floor, a peculiar arrangement of a table precariously balanced atop a chair beneath the ceiling fixture, a couch strangely displaced from its usual spot against the wall, and various articles of clothing and abandoned shoes spilling out untidily from the closet. Among the chaos lie two empty bottles and a sticky glass, while a typewriter sits at the desk, harboring a nearly blank sheet of paper. Methodically, Don approaches the glass and, in a futile attempt, upends two bottles over it, yielding a single reluctant drop, followed by two more that only manage to barely dampen the bottom of the glass. Sighing, he places the bottles down and swallows the scanty drops, feeling them linger as they slide down his throat. Turning his attention to his financial predicament, Don conducts a quick search of his pockets, discovering a meager two cents resting in the palm of his hand. As he surveys the tumult around him, the typewriter catches his eye, prompting him to move decisively toward it, tearing the sheet of paper from its roller, slamming the lid shut with a degree of finality, and picking it up with a sense of urgency. He drags it determinedly toward the hallway, dons his hat, and carefully navigates his way over two newspapers and a couple of milk bottles, ensuring he closes the door behind him, before beginning his descent down the stairs, where he notices a note from Helen still pinned resolutely to the door. As he exits the building, carrying the typewriter with him, he encounters a steel gate obstructing the entrance and stands for a moment, mystified by the barrier. Nearby, a woman with a baby carriage captures his attention, her gaze piercing and unsettling as she stares intently at him. Feeling the pressure of her intrusive scrutiny, Don straightens himself with an air of determination and begins moving toward another pawn shop, a distant and challenging goal given his current state. Each step he takes is filled with pain, and the deafening noise from the elevated railway above looms over him, adding to his misery. He pauses, leaning heavily against a supportive pillar, his body shaking as he waits for the trolley car to pass before continuing his path across the street to the next pawn shop, only to discover it, too, is frustratingly closed. In a fit of exasperation, he shakes the iron bar and peers through the closed gate into the darkened interior of the shop. Spotting yet another pawn shop across the street, he begins to perspire profusely, acutely aware of two men standing nearby, grinning in an unsettling manner. Finally, feeling utterly discouraged, he picks up the typewriter once more and begins the arduous journey back the way he came."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Don cautiously steps into the chaotic and disorderly living room, where the incessant ringing of the telephone prominently placed on the desk is the only sound that seems to imbue this otherwise lifeless space with any semblance of vitality. Despite the impression that he is being drawn directly toward the clamorous phone, in reality, he is irresistibly captivated by the enticing sight of the bottle and glass positioned so invitingly next to the large, imposing chair. With a deliberate and almost exaggerated slowness, he makes his way toward them, picking up the bottle and holding it precariously upside down over the waiting glass below. Meanwhile, the disarray of the room is overwhelmingly palpable, with scattered books strewn haphazardly across the floor, a peculiar arrangement of a table precariously balanced atop a chair directly underneath the ceiling fixture, a couch strangely displaced from its usual spot against the wall, and various articles of clothing and abandoned shoes spilling out untidily from the slightly ajar closet. Among the chaos lie two empty bottles and a sticky glass, while a typewriter sits at the desk, harboring a nearly blank sheet of paper. Methodically, Don approaches the glass and, in a futile attempt, upends two bottles over it, yielding a single reluctant drop, followed by two more that only manage to just barely dampen the very bottom of the glass. Sighing with resignation, he places the bottles down and swallows the scanty drops, feeling them linger as they slowly slide down his throat. Turning his attention to his dire financial predicament, Don conducts a swift yet thorough search of his pockets, only to discover a meager two cents resting in the palm of his hand. As he surveys the tumult around him, the typewriter catches his eye, prompting him to move decisively toward it, tearing the sheet of paper from its roller, slamming the lid shut with a degree of finality, and picking it up with a sense of urgency and purpose. He drags it determinedly toward the hallway, dons his hat, and carefully navigates his way over two newspapers and a couple of milk bottles, ensuring he closes the door behind him, before beginning his somewhat arduous descent down the stairs, where he notices a note from Helen still pinned resolutely to the door. As he exits the building, carrying the typewriter with him, he encounters a steel gate obstructing the entrance and stands for a moment, mystified and bewildered by this unexpected barrier. Nearby, a woman with a baby carriage captures his attention, her gaze piercing and unsettling as she stares intently at him with an unnerving intensity. Feeling the pressure of her intrusive scrutiny, Don straightens himself with an air of determination and begins moving with purpose toward another pawn shop, a distant and challenging goal given his current state of discomfort and disarray. Each step he takes is filled with a sense of pain and discomfort, and the deafening noise emanating from the elevated railway above looms ominously over him, further adding to his misery. He pauses for a moment, leaning heavily against a supportive pillar, his body shaking as he waits for the trolley car to pass before continuing his path across the street to the next pawn shop, only to discover it, too, is frustratingly closed. In a fit of exasperation and frustration, he shakes the iron bar and peers through the closed gate into the darkened and unwelcoming interior of the shop. Spotting yet another pawn shop across the street, he begins to perspire profusely, acutely aware of two men standing nearby, grinning in an unsettling manner that only increases his unease. Finally, feeling utterly discouraged and defeated, he picks up the typewriter once more and begins the arduous journey back the way he came, reflecting on his misfortune."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Don steps into the chaotic living room, where the persistent ringing of the telephone on the desk stands out as the only semblance of activity amidst the otherwise stagnant scene. Despite the initial impression that he is heading directly toward the incessantly ringing phone, his attention subtly shifts as he becomes captivated by the glint of a bottle and glass positioned invitingly near the big chair. He deliberately makes his way toward them, each step calculated and deliberate, and eventually reaches out to grasp the bottle, carefully lifting it and tilting it upside down to pour its contents into the waiting glass. As he performs this action, he casts a glance around the disorderly room, taking in the disarray of books scattered haphazardly across the floor, a table awkwardly perched on a chair beneath the ceiling fixture, a couch that has been displaced from its usual spot against the wall, and clothes along with shoes that have been tossed out from the closet in a state of dishevelment. The presence of two empty bottles and a sticky glass adds to the sense of chaos, while a typewriter bearing a nearly blank sheet of paper rests idly on the desk. Don proceeds to the glass with determination, upending two bottles over it in hopes of extracting some liquid, and watches as a solitary drop emerges slowly, followed by two more that barely manage to stain the bottom of the glass. After setting the bottles down with a hint of resignation, he raises the glass to his lips, draining the scant drops into his throat. With a sense of urgency, he begins to assess his financial situation by patting down his pockets quickly and is dismayed to discover only two measly cents resting in his palm. His gaze sweeps around the room until it lands on the typewriter, prompting him to stride toward it and swiftly tear the sheet of paper from the roller before slamming the lid shut with finality. He then hoists the typewriter, drags it into the hallway, positions his hat on his head with care, and gingerly steps over two newspapers and bottles of milk scattered about before closing the door firmly behind him. As he starts down the stairs, his eyes catch a note from Helen pinned to the door, but he presses on, exiting the house with the typewriter in hand only to be confronted by a steel gate obstructing the entrance. He comes to a perplexed halt, trying to make sense of the barrier, while feeling the gaze of a woman standing nearby with a baby carriage, her eyes unrelentingly locked onto him in an intrusive manner. Feeling the weight of her stare, Don forces himself to straighten up and trudges toward another pawn shop, which looms as a distant goal amid his challenging condition. Each step he takes is fraught with pain, and the overpowering noise of the elevated railway overhead assaults his senses, exacerbating his discomfort. He leans momentarily against a pillar, his body trembling, and waits for a trolley car to pass, then musters the energy to continue across the street toward the second pawn shop, only to find it closed as well, fueling his frustration. He shakes a bar in futility and peers through the iron gate into the darkness of the shop, hoping for some sign of life. His attention is drawn to yet another pawn shop across the street, but as sweat pours down his face, he becomes acutely aware of two men standing nearby, grinning at his predicament. Feeling disheartened, Don resigns himself to picking up the typewriter once more and turns to make the long journey back."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Don enters the chaotic living room, seemingly heading for the ringing phone but instead drawn to the bottle and glass by the chair. He moves slowly, upends the bottle over the glass, and confirms the empty state of the room once marked by disorder: books scattered, a table perched on a chair, the couch displaced, and clothing strewn everywhere. He attempts to fill the glass from two bottles, managing only a few drops, which he quickly swallows. With just two cents in his pocket, he notices the typewriter and moves to it, tearing the paper from the roller, shutting the lid, and taking it with him. Don navigates past newspapers and milk bottles in the hallway, dons his hat, and exits, mindful of a note from Helen pinned to the door. Outside, a woman with a baby carriage watches him by the steel gate blocking his way. Feeling pressured, he proceeds toward another pawn shop, each step agonizing under the deafening elevated railway. After leaning against a pillar to steady himself, Don crosses the street to find the second pawn shop closed, shaking the gate in frustration. He spots another shop across the street but, disheartened by the oppressive heat and two grinning onlookers, picks up the typewriter and heads back."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Don enters the chaotic living room, where the telephone on the desk, an old rotary model often found in households in the mid-20th century, is the only thing seemingly alive. Although he appears to be heading straight to the ringing phone, he is actually drawn to the bottle and the glass by the big chair, a favorite spot in the room known for harboring the most comfortable seat. He moves slowly toward them, picks up the bottle, and holds it upside down over the glass. The room is in disorder, with books on the floor, a table on a chair under the ceiling fixture that once held a bright chandelier, the couch moved from the wall, and clothes and shoes spilled from the closet as if a recent whirlwind passed through. Two empty bottles and a sticky glass are about, while a typewriter with a nearly blank sheet of paper, suggesting an abandoned attempt at writing, sits on the desk. Don goes to the glass and holds two bottles upside down over it, yielding only one slow drop, followed by two more that barely stain the bottom of the glass. He puts down the bottles and empties the meager drops into his throat, craving more than the scant remnants. Assessing his finances, Don quickly checks his pockets and finds exactly two cents, a paltry sum for any immediate needs, in his palm. Looking around, he notices the typewriter and moves toward it, ripping the sheet of paper from the roller, slamming the lid shut, and picking it up. He drags it to the hallway, puts on his hat, a worn fedora from better days, carefully steps over two newspapers that report yesterday’s local news and bottles of milk, closes the door, and starts down the stairs, where a note from Helen, his concerned neighbor who often checks in on him, remains pinned to the door. Exiting the house with the typewriter, he encounters a steel gate blocking the entrance and stands mystified, as if the world has suddenly placed barriers in his path. Nearby, a woman with a baby carriage stands, staring intrusively, adding to his discomfort. Don, feeling pressured by her gaze, straightens up and heads toward another pawn shop, hoping to exchange the typewriter for enough money to buy a drink, a distant goal given his condition. Each step is painful, and the thunderous noise of the elevated railway above, a hallmark of the city’s public transit system, is excruciating. He leans against a pillar, shaking, and waits for a trolley car to pass, its clanging bell echoing in the street, before continuing across the street to the second pawn shop, only to find it closed as well, a mocking sign in the window. Frustrated, he shakes a bar and peers through the iron gate into the dark shop. Seeing another pawn shop across the street, he sweats profusely as two men stand grinning nearby, their laughter adding to his sense of defeat. Finally, discouraged, he picks up the typewriter and starts walking back, his steps heavy with disappointment."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Don enters the chaotic living room where the telephone on the desk is the only thing seemingly alive. Although he appears to be heading straight to the ringing phone he is actually drawn to the bottle and the glass by the big chair. He moves slowly toward them picks up the bottle and holds it upside down over the glass. The room is in disorder with books on the floor a table on a chair under the ceiling fixture the couch moved from the wall and clothes and shoes spilled from the closet. Two empty bottles and a sticky glass are about while a typewriter with a nearly blank sheet of paper sits on the desk. Don goes to the glass and holds two bottles upside down over it yielding only one slow drop followed by two more that barely stain the bottom of the glass. He puts down the bottles and empties the meager drops into his throat. Assessing his finances Don quickly checks his pockets and finds exactly two cents in his palm. Looking around he notices the typewriter and moves toward it ripping the sheet of paper from the roller slamming the lid shut and picking it up. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. He drags it to the hallway puts on his hat carefully steps over two newspapers and bottles of milk closes the door and starts down the stairs where a note from Helen remains pinned to the door. Exiting the house with the typewriter he encounters a steel gate blocking the entrance and stands mystified. Nearby a woman with a baby carriage stands staring intrusively. Don feeling pressured by her gaze straightens up and heads toward another pawn shop a distant goal given his condition. Each step is painful and the thunderous noise of the elevated railway above is excruciating. He leans against a pillar shaking and waits for a trolley car to pass before continuing across the street to the second pawn shop only to find it closed as well. Frustrated he shakes a bar and peers through the iron gate into the dark shop. Seeing another pawn shop across the street he sweats profusely as two men stand grinning nearby. Finally discouraged he picks up the typewriter and starts walking back."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Don enters the chaotic living room where the telephone on the desk is the only thing seemingly alive. Although he appears to be heading straight to the ringing phone he is actually drawn to the bottle and the glass by the big chair. He moves slowly toward them picks up the bottle and holds it upside down over the glass. The room is in disorder with books on the floor a table on a chair under the ceiling fixture the couch moved from the wall and clothes and shoes spilled from the closet. Two empty bottles and a sticky glass are about while a typewriter with a nearly blank sheet of paper sits on the desk. Don goes to the glass and holds two bottles upside down over it yielding only one slow drop followed by two more that barely stain the bottom of the glass. He puts down the bottles and empties the meager drops into his throat. Assessing his finances Don quickly checks his pockets and finds exactly two cents in his palm. Looking around he notices the typewriter and moves toward it ripping the sheet of paper from the roller slamming the lid shut and picking it up. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. He drags it to the hallway puts on his hat carefully steps over two newspapers and bottles of milk closes the door and starts down the stairs where a note from Helen remains pinned to the door. Exiting the house with the typewriter he encounters a steel gate blocking the entrance and stands mystified. Nearby a woman with a baby carriage stands staring intrusively. Don feeling pressured by her gaze straightens up and heads toward another pawn shop a distant goal given his condition. Each step is painful and the thunderous noise of the elevated railway above is excruciating. He leans against a pillar shaking and waits for a trolley car to pass before continuing across the street to the second pawn shop only to find it closed as well. Frustrated he shakes a bar and peers through the iron gate into the dark shop. Seeing another pawn shop across the street he sweats profusely as two men stand grinning nearby. Finally discouraged he picks up the typewriter and starts walking back."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Don enters the chaotic living room where the telephone on the desk is the only thing seemingly alive. Although he appears to be heading straight to the ringing phone he is actually drawn to the bottle and the glass by the big chair. He moves slowly toward them picks up the bottle and holds it upside down over the glass. The room is in disorder with books on the floor a table on a chair under the ceiling fixture the couch moved from the wall and clothes and shoes spilled from the closet. Two empty bottles and a sticky glass are about while a typewriter with a nearly blank sheet of paper sits on the desk. He leans against a pillar shaking and waits for a trolley car to pass before continuing across the street to the second pawn shop only to find it closed as well. Frustrated he shakes a bar and peers through the iron gate into the dark shop. Seeing another pawn shop across the street he sweats profusely as two men stand grinning nearby. Finally discouraged he picks up the typewriter and starts walking back."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Don enters the chaotic living room where the telephone on the desk is the only thing seemingly alive. Although he appears to be heading straight to the ringing phone he is actually drawn to the bottle and the glass by the big chair. Seeing another pawn shop across the street he sweats profusely as two men stand grinning nearby. Finally discouraged he picks up the typewriter and starts walking back."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Patricia stumbles into the serene kitchen, where the candlestick on the cabinet is the only object seemingly lifeless. Although she seems to be weaving directly toward the silent candlestick, she is actually captivated by the skateboard and the helmet by the small table. She glides quickly toward them, snatches the skateboard, and dangles it vertically over the helmet. The kitchen is in order, with plates on the counter, a vase on a stool beside the chandelier, the rug shifted to the doorway, and hats and scarves strewn from the trunk. Five colorful balloons and a smooth pebble lie about, while a sewing machine with a fully written book rests on the cabinet. Patricia skips to the helmet and dangles five skateboards horizontally over it, producing only three quick taps, followed by three extra that hardly tint the rim of the helmet. She drops the skateboards and inserts the swift taps into her ear. Evaluating her groceries, Patricia slowly scans her shopping bag and discovers precisely four apples in her hand. Glancing around, she examines the sewing machine and dances toward it, tearing the book from the spool, flipping the switch on, and lifting it up. She pushes it to the basement, puts on her scarf, boldly steps over five pamphlets and bottles of juice, leaves the gate ajar, and hops up the ladder, where a flyer from Greg remains taped to the window. Entering the cabin with the sewing machine, she confronts a velvet curtain blocking the hallway and stands puzzled. Nearby, a child with a kite waits, gaping mysteriously. Patricia, feeling energized by the child's absence, hunches down and skips toward another candy store, a reachable prize given her wealth. Every hop is delightful, and the soft murmur of the underground stream below is soothing. She slides against a bush, steadying, and waits for a bicycle to zoom past before skipping across the alley to the third candy store, only to find it open as expected. Elated, she taps a branch and gazes through the glass window into the lit store. Noticing another candy store head on, she shivers slightly as five dogs run barking nearby. Eventually, cheerful, she drops the sewing machine and starts hopping forward."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Don enters the chaotic living room, seemingly heading for the ringing phone but is actually drawn to the bottle and glass by the chair. The room is a mess, with scattered books, furniture askew, and empty bottles. Despite his efforts, he only manages to extract a few drops from the bottles, which he drinks. Finding just two cents in his pocket, Don notices the typewriter, removes the paper, shuts it, and exits with it, stepping over newspapers and milk bottles. Outside, a woman with a baby carriage stares, prompting Don to proceed to a pawn shop despite his state. The painful journey, under the loud elevated railway, leads him to find the second pawn shop closed. Frustrated, he peers into the darkened shop, only to spot another one across the street. Overcome with exhaustion, he heads back, carrying the typewriter, with two men grinning nearby."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Finally discouraged he picks up the typewriter and starts walking back Seeing another pawn shop across the street he sweats profusely as two men stand grinning nearby Frustrated he shakes a bar and peers through the iron gate into the dark shop He leans against a pillar shaking and waits for a trolley car to pass before continuing across the street to the second pawn shop only to find it closed as well Each step is painful and the thunderous noise of the elevated railway above is excruciating Don feeling pressured by her gaze straightens up and heads toward another pawn shop a distant goal given his condition Nearby a woman with a baby carriage stands staring intrusively Exiting the house with the typewriter he encounters a steel gate blocking the entrance and stands mystified He drags it to the hallway puts on his hat carefully steps over two newspapers and bottles of milk closes the door and starts down the stairs where a note from Helen remains pinned to the door Looking around he notices the typewriter and moves toward it ripping the sheet of paper from the roller slamming the lid shut and picking it up Assessing his finances Don quickly checks his pockets and finds exactly two cents in his palm He puts down the bottles and empties the meager drops into his throat Don goes to the glass and holds two bottles upside down over it yielding only one slow drop followed by two more that barely stain the bottom of the glass Two empty bottles and a sticky glass are about while a typewriter with a nearly blank sheet of paper sits on the desk The room is in disorder with books on the floor a table on a chair under the ceiling fixture the couch moved from the wall and clothes and shoes spilled from the closet He moves slowly toward them picks up the bottle and holds it upside down over the glass Although he appears to be heading straight to the ringing phone he is actually drawn to the bottle and the glass by the big chair Don enters the chaotic living room where the telephone on the desk is the only thing seemingly alive"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Although he appears to be heading straight to the ringing phone he is actually drawn to the bottle and the glass by the big chair Don enters the chaotic living room where the telephone on the desk is the only thing seemingly alive The room is in disorder with books on the floor a table on a chair under the ceiling fixture the couch moved from the wall and clothes and shoes spilled from the closet He moves slowly toward them picks up the bottle and holds it upside down over the glass Don goes to the glass and holds two bottles upside down over it yielding only one slow drop followed by two more that barely stain the bottom of the glass Two empty bottles and a sticky glass are about while a typewriter with a nearly blank sheet of paper sits on the desk Assessing his finances Don quickly checks his pockets and finds exactly two cents in his palm He puts down the bottles and empties the meager drops into his throat He drags it to the hallway puts on his hat carefully steps over two newspapers and bottles of milk closes the door and starts down the stairs where a note from Helen remains pinned to the door Looking around he notices the typewriter and moves toward it ripping the sheet of paper from the roller slamming the lid shut and picking it up Nearby a woman with a baby carriage stands staring intrusively Exiting the house with the typewriter he encounters a steel gate blocking the entrance and stands mystified Each step is painful and the thunderous noise of the elevated railway above is excruciating Don feeling pressured by her gaze straightens up and heads toward another pawn shop a distant goal given his condition Frustrated he shakes a bar and peers through the iron gate into the dark shop He leans against a pillar shaking and waits for a trolley car to pass before continuing across the street to the second pawn shop only to find it closed as well Finally discouraged he picks up the typewriter and starts walking back Seeing another pawn shop across the street he sweats profusely as two men stand grinning nearby"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He drags it to the hallway puts on his hat carefully steps over two newspapers and bottles of milk closes the door and starts down the stairs where a note from Helen remains pinned to the door Exiting the house with the typewriter he encounters a steel gate blocking the entrance and stands mystified Nearby a woman with a baby carriage stands staring intrusively Don feeling pressured by her gaze straightens up and heads toward another pawn shop a distant goal given his condition Each step is painful and the thunderous noise of the elevated railway above is excruciating He leans against a pillar shaking and waits for a trolley car to pass before continuing across the street to the second pawn shop only to find it closed as well Frustrated he shakes a bar and peers through the iron gate into the dark shop Seeing another pawn shop across the street he sweats profusely as two men stand grinning nearby Finally discouraged he picks up the typewriter and starts walking back Don enters the chaotic living room where the telephone on the desk is the only thing seemingly alive Although he appears to be heading straight to the ringing phone he is actually drawn to the bottle and the glass by the big chair He moves slowly toward them picks up the bottle and holds it upside down over the glass The room is in disorder with books on the floor a table on a chair under the ceiling fixture the couch moved from the wall and clothes and shoes spilled from the closet Two empty bottles and a sticky glass are about while a typewriter with a nearly blank sheet of paper sits on the desk Don goes to the glass and holds two bottles upside down over it yielding only one slow drop followed by two more that barely stain the bottom of the glass He puts down the bottles and empties the meager drops into his throat Assessing his finances Don quickly checks his pockets and finds exactly two cents in his palm Looking around he notices the typewriter and moves toward it ripping the sheet of paper from the roller slamming the lid shut and picking it up"
        }
      ]
    }
  ]
}