{
  "ground_truth": "The camera goes slowly up to a sidewalk clock with a diadem of three balls, which stands outside the hock shop. The time is twenty minutes of one, but the clock says five minutes of four. Nat is at the bar with two or three customers listening to race results on a little radio. Don drags himself in, drenched in sweat, his breath as short and agonized as that of a dying man. He goes to the end of the bar closest to the door, hoists the typewriter on it with a final awful effort, and leans his head on it. A drink is shoved at Don, but he is shaking so much that he can't pick up the glass. He bends down, sucks half of it, then lifts the glass and drains the rest. Don holds out the empty glass to Nat, his eyes imploring, then takes the typewriter and drags himself out of Nat's place. Don emerges and starts dragging himself up the street towards home. As he passes the antique shop, he suddenly stops, noticing the wooden Indian Gloria spoke about, pointing up. Don walks into the house and goes to the second floor of this same crummy Third Avenue house -- dark woodwork, paint peeling from the walls. Beside the door at the head of the stairs, there are about three bells for the several occupants of the apartment within. Don drags himself up the stairs, puts down the typewriter, and inspects the name tags by the bells. He rings the bell beside it, then rings again. From inside, the door is opened by Gloria, wearing a dressing gown and bedroom slippers, her hair in the ruined elaborate hairdress of yesterday, her eyes blazing with anger. She slips into the apartment, leaving the door about three inches ajar. After a couple of seconds, Gloria reappears with a wallet, while Don leans against the door jamb, breathing heavily. She takes five dollars out and gives it to him. Don takes it with a shaking hand, and she brushes his forehead with the back of her hand. He takes her hand and kisses it, and Gloria looks at him, then at her hand. He bends, picks up the typewriter, and starts downstairs, with Gloria looking after him. A man looks at Don but doesn't answer, instead staring at him, terrified, before drifting away eerily. From the opposite direction, a male nurse comes, getting a pad and pencil from his pocket. Don has risen, wearing flannel pajamas like all the rest of the patients. Bim stands quietly watching him with a great big grin on his face. However, Don manages to make the swinging glass door past the benches and a collection of wheelchairs along the walls.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The camera proceeds gradually up to a pavement clock with a coronet of three spheres, which stands outside the pawn shop. The time is twenty minutes of one, but the clock indicates five minutes of four. Nat is at the bar with two or three patrons listening to race outcomes on a small radio. Don hauls himself in, soaked in perspiration, his breath as short and tormented as that of a dying man. He moves to the end of the bar nearest to the exit, lifts the typewriter on it with a final dreadful effort, and rests his head on it. A drink is pushed at Don, but he is trembling so much that he can't pick up the glass. He bends down, sips half of it, then raises the glass and empties the remainder. Don extends the vacant glass to Nat, his eyes pleading, then takes the typewriter and hauls himself out of Nat's establishment. Don emerges and begins dragging himself up the street towards home. As he passes the vintage shop, he suddenly halts, noticing the wooden Indian Gloria mentioned, indicating upward. Don enters the house and goes to the second story of this same shabby Third Avenue house -- dark woodwork, paint flaking from the walls. Beside the door at the head of the stairs, there are about three bells for the several tenants of the apartment within. Don hauls himself up the stairs, puts down the typewriter, and examines the name tags by the bells. He rings the bell beside it, then rings again. From within, the door is opened by Gloria, wearing a robe and bedroom slippers, her hair in the ruined elaborate hairstyle of yesterday, her eyes blazing with fury. She slips into the apartment, leaving the door about three inches ajar. After a couple of seconds, Gloria reappears with a billfold, while Don leans against the door frame, breathing heavily. She takes five dollars out and hands it to him. Don takes it with a trembling hand, and she brushes his forehead with the back of her hand. He takes her hand and kisses it, and Gloria looks at him, then at her hand. He bends, picks up the typewriter, and starts downstairs, with Gloria watching after him. A man observes Don but doesn't respond, instead staring at him, terrified, before drifting away eerily. From the opposite direction, a male orderly comes, getting a pad and pencil from his pocket. Don has risen, wearing flannel pajamas like all the rest of the patients. Bim stands quietly observing him with a great big grin on his face. However, Don manages to make the revolving glass door past the benches and a collection of wheelchairs along the walls."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The camera is slowly moved up to a sidewalk clock with a diadem of three balls, which is positioned outside the hock shop. The time shows twenty minutes to one, but five minutes to four is displayed by the clock. Nat is accompanied by two or three customers at the bar, listening to race results on a little radio. Don drags himself in, drenched in sweat, his breath as short and agonized as that of a dying man. The end of the bar closest to the door is approached by him, and with a final awful effort, the typewriter is hoisted onto it, and his head is leaned on it. Someone shoves a drink at Don, but picking up the glass is impossible for him due to his shaking. He bends down, sucks half of it, then lifts the glass and drains the rest. The empty glass is held out to Nat by Don, his eyes imploring, then the typewriter is taken and he drags himself out of Nat's place. Don emerges and starts dragging himself up the street towards home. He suddenly stops as the wooden Indian Gloria spoke about is noticed by him, pointing up while passing the antique shop. The house is entered by Don, and he goes to the second floor of this same crummy Third Avenue house -- dark woodwork, paint peeling from the walls. Beside the door at the head of the stairs, about three bells are located for the several occupants of the apartment within. The stairs are dragged up by Don, the typewriter is put down, and the name tags by the bells are inspected by him. He rings the bell beside it, then rings again. Gloria, wearing a dressing gown and bedroom slippers, her hair in the ruined elaborate hairdress of yesterday, her eyes blazing with anger, opens the door from inside. She slips into the apartment, leaving the door about three inches ajar. After a couple of seconds, a wallet is brought by Gloria, while Don leans against the door jamb, breathing heavily. Five dollars are taken out by her and given to him. It is taken by Don with a shaking hand, and his forehead is brushed by her with the back of her hand. Her hand is taken by him and kissed, and Gloria looks at him, then at her hand. The typewriter is picked up by him, and he starts downstairs, with Gloria looking after him. A man looks at Don but doesn't answer, instead staring at him, terrified, before drifting away eerily. From the opposite direction, a male nurse comes, getting a pad and pencil from his pocket. Don has risen, wearing flannel pajamas like all the rest of the patients. A great big grin is on Bim's face as he stands quietly watching him. However, the swinging glass door past the benches and a collection of wheelchairs along the walls is managed to be made by Don."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The camera pans to a sidewalk clock with a trio of decorative balls outside the pawnshop, showing five minutes to four, though it's actually twenty minutes to one. Nat listens to race results on a small radio at the bar with a few patrons. Don enters, drenched in sweat and struggling to breathe, placing a typewriter on the bar and leaning on it. A drink is pushed at him, but he's shaking too much to hold it, so he sips directly from the glass before finishing it. Pleadingly, he hands the empty glass to Nat, takes the typewriter, and leaves. Don trudges home, pausing by an antique shop to notice a wooden Indian. At his dilapidated Third Avenue house, he climbs to the second floor, examines the name tags by the doorbells, and rings one. Gloria, in a dressing gown, answers, angrily glares, and retrieves a wallet to give him five dollars. Don accepts with trembling hands, kisses her hand, then departs with the typewriter. A frightened man observes Don but quietly drifts away. A male nurse approaches, retrieving a pad and pencil. Don, now wearing flannel pajamas like the other patients, passes swinging glass doors past benches and wheelchairs."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The camera pans to a sidewalk clock outside the hock shop, showing five minutes to four instead of the actual time, twenty minutes to one. Inside, Nat and a few customers listen to race results on the radio. Don stumbles in, drenched in sweat, struggling to breathe, collapses at the bar, and desperately drinks a glass of alcohol. Handing the empty glass back to Nat, Don leaves with his typewriter, heading home. He pauses at an antique shop, noticing a wooden Indian, then enters a run-down building and rings Gloria's bell. Gloria, angry and disheveled, opens the door after Don rings twice. She gives him five dollars, and he kisses her hand before leaving. Outside, a terrified man silently watches Don, while a male nurse approaches with a pad and pencil. Don wears flannel pajamas like other patients, and Bim grins at him as he moves past the wheelchairs towards the exit."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The camera moves at a slow, deliberate pace upward until it focuses on a sidewalk clock, which is adorned with a decorative diadem of three intricately carved balls. This clock stands just outside the bustling hock shop. The actual time is twenty minutes before one, but the clock's hands inaccurately display that it is five minutes before four. Meanwhile, Nat is situated comfortably at the bar alongside two or three customers, all of whom are intently listening to the outcomes of horse races being broadcast on a small radio. At this moment, Don drags himself inside, utterly drenched in perspiration, breathing as labored and painful as that of a man on the brink of death. He approaches the end of the bar nearest to the entrance, hoists his typewriter onto it with one final, excruciating effort, and then leans his weary head upon it. A drink is hastily pushed towards Don, but his hands tremble so violently that he is unable to grasp the glass. Instead, he bends down, sips half of it directly, and then lifts the glass to drain the remainder. With great desperation, Don extends the now-empty glass towards Nat, his eyes filled with pleading. He then takes up the typewriter again and drags himself out of Nat's establishment. \n\nOnce outside, Don begins the arduous task of dragging himself along the street, making his difficult way back towards home. As he trudges past the antique shop, he comes to an abrupt halt, noticing the wooden Indian that Gloria had mentioned, which is pointing upwards. Don enters the house and ascends to the second floor of this rundown Third Avenue dwelling, characterized by dark woodwork and paint peeling from the walls. Beside the door at the top of the stairs are about three bells intended for the various residents of the apartment within. Don laboriously climbs the stairs, setting down his typewriter, and examines the name tags beside the bells. He presses one of the bells and then presses it again. From the inside, the door is opened by Gloria, who is dressed in a dressing gown and bedroom slippers. Her hair is styled in a now-ruined elaborate coiffure from the previous day, and her eyes are ablaze with anger. She slips back into the apartment, leaving the door slightly ajar, about three inches wide. After a brief pause, Gloria reappears with a wallet in hand, while Don leans heavily against the door jamb, his breath coming in ragged gasps. She extracts five dollars from the wallet and hands it to him. Don accepts it with trembling fingers, and she tenderly brushes his forehead with the back of her hand. He takes her hand and kisses it affectionately, and Gloria gazes at him, then at her hand. He bends down, picks up the typewriter, and begins his descent down the stairs, with Gloria watching him as he leaves. A man observes Don but remains silent, instead staring at him in terror before drifting away in an eerie manner. From the opposite direction, a male nurse approaches, retrieving a pad and pencil from his pocket. Don has managed to stand, dressed in flannel pajamas, identical to those worn by the other patients. Bim stands quietly to the side, watching him with a broad, friendly grin on his face. Nonetheless, Don succeeds in making his way past the benches and an assortment of wheelchairs arranged along the walls, finally passing through the swinging glass door."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The camera gradually moves at a slow, deliberate pace in an upward direction until it focuses on a sidewalk clock. This clock is adorned with a decorative diadem consisting of three intricately carved balls, adding a touch of elegance to its appearance. This particular clock stands just outside the bustling hock shop, where activity is constantly in motion. Although the actual time is twenty minutes before one, the clock's hands inaccurately display the time as five minutes before four. Meanwhile, Nat is situated comfortably at the bar, accompanied by two or three other customers. They are all intently listening to the outcomes of horse races being broadcast on a small radio, which captures their full attention. At this moment, Don drags himself inside the establishment, utterly drenched in perspiration, and his breathing is as labored and painful as that of a man on the brink of death. He approaches the end of the bar that is nearest to the entrance, then hoists his typewriter onto it with one final, excruciating effort, and subsequently leans his weary head upon it in exhaustion. A drink is hastily pushed towards Don, but his hands tremble so violently that he is unable to grasp the glass. Instead, he bends down, sips half of it directly, and then manages to lift the glass to drain the remainder. With great desperation, Don extends the now-empty glass towards Nat, his eyes filled with a pleading expression. He then takes up the typewriter once again and drags himself out of Nat's establishment.\n\nOnce he is outside, Don embarks on the arduous task of dragging himself along the street, making his difficult way back towards the place he calls home. As he trudges past the antique shop, he comes to an abrupt halt, noticing the wooden Indian that Gloria had mentioned, which is pointing upwards. Don enters the house and ascends to the second floor of this rundown Third Avenue dwelling. The building is characterized by dark woodwork and paint that is peeling from the walls, giving it a worn-out appearance. Beside the door at the top of the stairs, there are about three bells intended for the various residents of the apartment within. Don laboriously climbs the stairs, setting down his typewriter, and examines the name tags beside the bells with a weary gaze. He presses one of the bells and then presses it again for good measure. From the inside, the door is opened by Gloria, who is dressed in a dressing gown and bedroom slippers. Her hair is styled in a now-ruined elaborate coiffure from the previous day, and her eyes are ablaze with anger. She slips back into the apartment, leaving the door slightly ajar, about three inches wide. After a brief pause, Gloria reappears with a wallet in hand, while Don leans heavily against the door jamb, his breath coming in ragged gasps. She extracts five dollars from the wallet and hands it to him. Don accepts it with trembling fingers, and she tenderly brushes his forehead with the back of her hand. He takes her hand and kisses it affectionately. Gloria gazes at him, then at her own hand. He bends down, picks up the typewriter, and begins his descent down the stairs, with Gloria watching him as he leaves. A man observes Don but remains silent, instead staring at him in terror before drifting away in an eerie manner. From the opposite direction, a male nurse approaches, retrieving a pad and pencil from his pocket. Don has managed to stand, dressed in flannel pajamas that are identical to those worn by the other patients. Bim stands quietly to the side, watching him with a broad, friendly grin on his face. Nonetheless, Don succeeds in making his way past the benches and an assortment of wheelchairs that are arranged along the walls, finally passing through the swinging glass door."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The camera begins its slow ascent towards a sidewalk clock adorned with a diadem of three balls, situated prominently outside the hock shop. As the scene unfolds, it is revealed that the actual time is twenty minutes to one, despite the clock inaccurately displaying five minutes to four. In this setting, Nat is present at the bar, accompanying two or three customers who are keenly listening to race results emanating from a small radio. Suddenly, Don enters, appearing utterly drained and soaked in sweat, each breath he takes resembling the labored breaths of a man on the verge of collapse. He trudges to the bar's end, nearest the door, and with a final, agonizing effort, hoists a typewriter onto the bar before bowing his head to rest on it. A drink is pushed towards him, but Don's hands tremble so violently that he is unable to lift the glass. Instead, he bends down, pulls the straw into his mouth, and hastily sucks down half of its contents before managing to lift the glass and drain what remains. With a desperate look in his eyes, Don extends the empty glass in Nat's direction, silently pleading. He then retrieves the typewriter and begins his arduous journey out of Nat's establishment and up the street towards home. As he passes an antique shop, he abruptly halts upon noticing the wooden Indian that Gloria had previously mentioned, its finger pointing upward. Don continues, entering the house and ascending to the second floor of this dilapidated Third Avenue building—a place characterized by dark woodwork and walls from which paint peels away. Upon reaching the top of the stairs, he deposits the typewriter and closely examines the name tags beside the bells that correspond to the apartment’s occupants. Selecting one, he rings it persistently. Shortly thereafter, Gloria opens the door, her appearance unkempt as she stands in a dressing gown and bedroom slippers, her hair still in the disheveled hairstyle from the day before, her eyes seething with anger. She slips back inside, leaving the door ajar by about three inches. After a brief delay, she returns with a wallet, while Don, leaning heavily against the door jamb, struggles to catch his breath. Gloria extracts five dollars from the wallet and hands it to him, his hand quivering as he accepts it. She tenderly brushes his forehead with the back of her hand. In response, Don takes her hand and places a kiss on it, prompting Gloria to look first at him, then at her hand. He bends down once more to retrieve the typewriter and begins his descent down the stairs, as Gloria stands watchfully behind him. Outside, a man catches sight of Don but offers no greeting, instead, he stares in terrified silence before eerily drifting away. Meanwhile, from the opposite direction, a male nurse approaches, preemptively retrieving a pad and pencil from his pocket. Don, now clad in flannel pajamas like the other patients, rises to his feet. Bim observes quietly with a wide grin spread across his face. Despite the surrounding scene, Don perseveres, pushing himself through the swinging glass door, past benches and a line of wheelchairs that hug the walls."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The camera pans up to a sidewalk clock outside a pawn shop, inaccurately displaying five minutes to four instead of the actual twenty minutes to one. Inside a bar, Nat and a few customers listen to race results on the radio. Don enters, drenched in sweat and struggling to breathe, and places a typewriter on the bar before leaning on it. Although offered a drink, his trembling prevents him from lifting the glass, so he drinks it by lowering his mouth to it. He then hands the empty glass to Nat in a pleading gesture, retrieves the typewriter, and exits. \n\nDon drags himself homeward and pauses by an antique shop, remembering the wooden Indian Gloria mentioned. He continues to his rundown Third Avenue building, where peeling paint and dark woodwork reflect its decline. After climbing to the second floor, he inspects the name tags and rings a bell. Gloria, disheveled and angry, opens the door slightly before fetching a wallet. She hands Don five dollars, which he shakily accepts, kissing her hand in gratitude. As he departs with the typewriter, Gloria watches him descend the stairs.\n\nOn the street, a man observes Don with fear, then drifts away. A male nurse approaches, pulling out a pad and pencil. Don, now wearing flannel pajamas like the other patients, manages to navigate past benches and wheelchairs, while Bim observes him with a broad grin."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The camera goes slowly up to a sidewalk clock with a diadem of three balls, which stands outside the hock shop, a type of pawnshop known for exchanging personal items for short-term loans. The time is twenty minutes of one, but the clock says five minutes of four, possibly hinting at its disrepair or neglect common in bustling city areas. Nat is at the bar, a small, dimly lit establishment frequented by locals, with two or three customers listening to race results on a little radio, a popular pastime for those hoping to win money quickly. Don drags himself in, drenched in sweat, his breath as short and agonized as that of a dying man, reminiscent of someone recovering from an intense physical or emotional ordeal. He goes to the end of the bar closest to the door, hoists the typewriter on it with a final awful effort, and leans his head on it. The typewriter, an essential tool for writers before modern computers, suggests his profession or struggles with work. A drink is shoved at Don, but he is shaking so much that he can't pick up the glass. He bends down, sucks half of it, then lifts the glass and drains the rest, indicating either desperation or severe withdrawal. Don holds out the empty glass to Nat, his eyes imploring, then takes the typewriter and drags himself out of Nat's place, a familiar haven in his life. Don emerges and starts dragging himself up the street towards home, each step more laborious than the last. As he passes the antique shop, he suddenly stops, noticing the wooden Indian Gloria spoke about, an old shop decoration often used to attract customers. Don walks into the house and goes to the second floor of this same crummy Third Avenue house -- dark woodwork, paint peeling from the walls, typical of aging urban residences housing many tenants. Beside the door at the head of the stairs, there are about three bells for the several occupants of the apartment within, reflecting the building’s partitioned living spaces. Don drags himself up the stairs, puts down the typewriter, and inspects the name tags by the bells, possibly searching for familiarity or support. He rings the bell beside it, then rings again. From inside, the door is opened by Gloria, wearing a dressing gown and bedroom slippers, her hair in the ruined elaborate hairdress of yesterday, evidence of her recent social engagements or busy lifestyle, her eyes blazing with anger. She slips into the apartment, leaving the door about three inches ajar, maintaining a degree of privacy. After a couple of seconds, Gloria reappears with a wallet, while Don leans against the door jamb, breathing heavily, as if every breath requires effort. She takes five dollars out and gives it to him, money that might mean sustenance or a temporary reprieve from his struggles. Don takes it with a shaking hand, and she brushes his forehead with the back of her hand, a small gesture of care amidst underlying tension. He takes her hand and kisses it, and Gloria looks at him, then at her hand, perhaps contemplating their complicated relationship. He bends, picks up the typewriter, and starts downstairs, with Gloria looking after him with a mixture of concern and resignation. A man looks at Don but doesn't answer, instead staring at him, terrified, before drifting away eerily, perhaps reflecting societal attitudes towards those visibly struggling. From the opposite direction, a male nurse comes, getting a pad and pencil from his pocket, likely to make a note or observation about Don's condition. Don has risen, wearing flannel pajamas like all the rest of the patients, indicating he's in a hospital or care facility. Bim stands quietly watching him with a great big grin on his face, possibly offering companionship or silent support. However, Don manages to make the swinging glass door past the benches and a collection of wheelchairs along the walls, symbolizing a gateway to freedom amidst challenges."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The camera goes slowly up to a sidewalk clock with a diadem of three balls which stands outside the hock shop. The time is twenty minutes of one but the clock says five minutes of four. Nat is at the bar with two or three customers listening to race results on a little radio. Don drags himself in drenched in sweat his breath as short and agonized as that of a dying man. He goes to the end of the bar closest to the door hoists the typewriter on it with a final awful effort and leans his head on it. A drink is shoved at Don but he is shaking so much that he cannot pick up the glass. He bends down sucks half of it then lifts the glass and drains the rest. Don holds out the empty glass to Nat his eyes imploring then takes the typewriter and drags himself out of Nat's place. Don emerges and starts dragging himself up the street towards home. As he passes the antique shop he suddenly stops noticing the wooden Indian Gloria spoke about pointing up. Don walks into the house and goes to the second floor of this same crummy Third Avenue house. dark woodwork paint peeling from the walls. Beside the door at the head of the stairs there are about three bells for the several occupants of the apartment within. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Don drags himself up the stairs puts down the typewriter and inspects the name tags by the bells. He rings the bell beside it then rings again. From inside the door is opened by Gloria wearing a dressing gown and bedroom slippers her hair in the ruined elaborate hairdress of yesterday her eyes blazing with anger. She slips into the apartment leaving the door about three inches ajar. After a couple of seconds Gloria reappears with a wallet while Don leans against the door jamb breathing heavily. She takes five dollars out and gives it to him. Don takes it with a shaking hand and she brushes his forehead with the back of her hand. He takes her hand and kisses it and Gloria looks at him then at her hand. He bends picks up the typewriter and starts downstairs with Gloria looking after him. A man looks at Don but does not answer instead staring at him terrified before drifting away eerily. From the opposite direction a male nurse comes getting a pad and pencil from his pocket. Don has risen wearing flannel pajamas like all the rest of the patients. Bim stands quietly watching him with a great big grin on his face. However Don manages to make the swinging glass door past the benches and a collection of wheelchairs along the walls."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The camera goes slowly up to a sidewalk clock with a diadem of three balls which stands outside the hock shop. The time is twenty minutes of one but the clock says five minutes of four. Nat is at the bar with two or three customers listening to race results on a little radio. Don drags himself in drenched in sweat his breath as short and agonized as that of a dying man. He goes to the end of the bar closest to the door hoists the typewriter on it with a final awful effort and leans his head on it. A drink is shoved at Don but he is shaking so much that he cannot pick up the glass. He bends down sucks half of it then lifts the glass and drains the rest. Don holds out the empty glass to Nat his eyes imploring then takes the typewriter and drags himself out of Nat's place. Don emerges and starts dragging himself up the street towards home. As he passes the antique shop he suddenly stops noticing the wooden Indian Gloria spoke about pointing up. Don walks into the house and goes to the second floor of this same crummy Third Avenue house. dark woodwork paint peeling from the walls. Beside the door at the head of the stairs there are about three bells for the several occupants of the apartment within. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. Don drags himself up the stairs puts down the typewriter and inspects the name tags by the bells. He rings the bell beside it then rings again. From inside the door is opened by Gloria wearing a dressing gown and bedroom slippers her hair in the ruined elaborate hairdress of yesterday her eyes blazing with anger. She slips into the apartment leaving the door about three inches ajar. After a couple of seconds Gloria reappears with a wallet while Don leans against the door jamb breathing heavily. She takes five dollars out and gives it to him. Don takes it with a shaking hand and she brushes his forehead with the back of her hand. He takes her hand and kisses it and Gloria looks at him then at her hand. He bends picks up the typewriter and starts downstairs with Gloria looking after him. A man looks at Don but does not answer instead staring at him terrified before drifting away eerily. From the opposite direction a male nurse comes getting a pad and pencil from his pocket. Don has risen wearing flannel pajamas like all the rest of the patients. Bim stands quietly watching him with a great big grin on his face. However Don manages to make the swinging glass door past the benches and a collection of wheelchairs along the walls."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The camera goes slowly up to a sidewalk clock with a diadem of three balls which stands outside the hock shop. The time is twenty minutes of one but the clock says five minutes of four. Nat is at the bar with two or three customers listening to race results on a little radio. Don drags himself in drenched in sweat his breath as short and agonized as that of a dying man. He goes to the end of the bar closest to the door hoists the typewriter on it with a final awful effort and leans his head on it. A drink is shoved at Don but he is shaking so much that he cannot pick up the glass. He bends down sucks half of it then lifts the glass and drains the rest. He takes her hand and kisses it and Gloria looks at him then at her hand. He bends picks up the typewriter and starts downstairs with Gloria looking after him. A man looks at Don but does not answer instead staring at him terrified before drifting away eerily. From the opposite direction a male nurse comes getting a pad and pencil from his pocket. Don has risen wearing flannel pajamas like all the rest of the patients. Bim stands quietly watching him with a great big grin on his face. However Don manages to make the swinging glass door past the benches and a collection of wheelchairs along the walls."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The camera goes slowly up to a sidewalk clock with a diadem of three balls which stands outside the hock shop. The time is twenty minutes of one but the clock says five minutes of four. Nat is at the bar with two or three customers listening to race results on a little radio. Don has risen wearing flannel pajamas like all the rest of the patients. Bim stands quietly watching him with a great big grin on his face. However Don manages to make the swinging glass door past the benches and a collection of wheelchairs along the walls."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The drone zooms slowly up to a garden gnome with a crown of three feathers, which stands outside the candy store. The hour is thirty minutes past dawn, but the gnome says ten past sunset. Sam is at the bus stop with a few parrots watching soap operas on a small tablet. Eli crawls in, covered in flour, his soul as weary and broken as that of a forgotten knight. He heads to the corner of the bus stop nearest to the window, lifts the violin onto it with a final dreadful attempt, and rests his foot on it. A cookie is tossed at Eli, but he is trembling so much that he can't grab the napkin. He crouches down, devours half of it, then raises the napkin and finishes the crumbs. Eli stretches out the crumpled napkin to Sam, his eyebrows pleading, then grabs the violin and crawls out of Sam's spot. Eli emerges and begins crawling along the alley towards the motel. As he passes the bakery, he abruptly pauses, spotting the copper astronaut Lila mentioned, gesturing downwards. Eli enters the motel and goes to the attic of this identical shabby Main Street motel -- faded tapestries, dirt flaking from the ceiling. Beside the closet at the top of the ladder, there are about five shoes for the numerous residents of the lounge inside. Eli crawls up the ladder, sets down the violin, and examines the initials on the shoes. He knocks the shoe beside it, then knocks again. From inside, the closet is opened by Lila, wearing a trench coat and hiking boots, her hair in the tangled elaborate bun of tomorrow, her eyebrows blazing with excitement. She slips into the lounge, leaving the closet about two inches ajar. After a few minutes, Lila reappears with a sketchbook, while Eli leans against the closet frame, panting softly. She takes ten stones out and hands them to him. Eli takes them with a steady hand, and she pats his elbow with the back of her foot. He takes her foot and tickles it, and Lila gazes at him, then at her foot. He crouches, picks up the violin, and begins climbing down, with Lila watching after him. A zebra glances at Eli but doesn't speak, instead gaping at him, startled, before drifting away cheerfully. From the opposing side, a chef arrives, pulling a spatula and notebook from his hat. Eli has risen, wearing wool slippers like all the rest of the dancers. Jay stands silently watching him with a huge tiny smirk on his nose. Nevertheless, Eli succeeds in making the spinning iron gate past the hammocks and a collection of pogo sticks along the fence."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The camera pans to a sidewalk clock outside a hock shop, displaying an incorrect time. Inside the bar, Nat and a few customers listen to race results. Don enters, drenched in sweat, struggling to breathe. He places a typewriter on the bar and shakily drinks. After finishing, he implores Nat for more, takes the typewriter, and leaves. As Don heads home, he notices a wooden Indian and continues to a rundown building. He rings a bell and Gloria, visibly upset, answers. Gloria gives Don five dollars, and he affectionately kisses her hand, then departs with the typewriter. A man stares at Don in fear, and a male nurse approaches with a pad and pencil. Don, now in flannel pajamas like other patients, passes through a door, observed by a grinning Bim."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "However Don manages to make the swinging glass door past the benches and a collection of wheelchairs along the walls Bim stands quietly watching him with a great big grin on his face Don has risen wearing flannel pajamas like all the rest of the patients From the opposite direction a male nurse comes getting a pad and pencil from his pocket A man looks at Don but does not answer instead staring at him terrified before drifting away eerily He bends picks up the typewriter and starts downstairs with Gloria looking after him He takes her hand and kisses it and Gloria looks at him then at her hand Don takes it with a shaking hand and she brushes his forehead with the back of her hand She takes five dollars out and gives it to him After a couple of seconds Gloria reappears with a wallet while Don leans against the door jamb breathing heavily She slips into the apartment leaving the door about three inches ajar From inside the door is opened by Gloria wearing a dressing gown and bedroom slippers her hair in the ruined elaborate hairdress of yesterday her eyes blazing with anger He rings the bell beside it then rings again Don drags himself up the stairs puts down the typewriter and inspects the name tags by the bells Beside the door at the head of the stairs there are about three bells for the several occupants of the apartment within dark woodwork paint peeling from the walls Don walks into the house and goes to the second floor of this same crummy Third Avenue house As he passes the antique shop he suddenly stops noticing the wooden Indian Gloria spoke about pointing up Don emerges and starts dragging himself up the street towards home Don holds out the empty glass to Nat his eyes imploring then takes the typewriter and drags himself out of Nat's place He bends down sucks half of it then lifts the glass and drains the rest A drink is shoved at Don but he is shaking so much that he cannot pick up the glass He goes to the end of the bar closest to the door hoists the typewriter on it with a final awful effort and leans his head on it Don drags himself in drenched in sweat his breath as short and agonized as that of a dying man Nat is at the bar with two or three customers listening to race results on a little radio The time is twenty minutes of one but the clock says five minutes of four The camera goes slowly up to a sidewalk clock with a diadem of three balls which stands outside the hock shop"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The time is twenty minutes of one but the clock says five minutes of four The camera goes slowly up to a sidewalk clock with a diadem of three balls which stands outside the hock shop Don drags himself in drenched in sweat his breath as short and agonized as that of a dying man Nat is at the bar with two or three customers listening to race results on a little radio A drink is shoved at Don but he is shaking so much that he cannot pick up the glass He goes to the end of the bar closest to the door hoists the typewriter on it with a final awful effort and leans his head on it Don holds out the empty glass to Nat his eyes imploring then takes the typewriter and drags himself out of Nat's place He bends down sucks half of it then lifts the glass and drains the rest As he passes the antique shop he suddenly stops noticing the wooden Indian Gloria spoke about pointing up Don emerges and starts dragging himself up the street towards home dark woodwork paint peeling from the walls Don walks into the house and goes to the second floor of this same crummy Third Avenue house Don drags himself up the stairs puts down the typewriter and inspects the name tags by the bells Beside the door at the head of the stairs there are about three bells for the several occupants of the apartment within From inside the door is opened by Gloria wearing a dressing gown and bedroom slippers her hair in the ruined elaborate hairdress of yesterday her eyes blazing with anger He rings the bell beside it then rings again After a couple of seconds Gloria reappears with a wallet while Don leans against the door jamb breathing heavily She slips into the apartment leaving the door about three inches ajar Don takes it with a shaking hand and she brushes his forehead with the back of her hand She takes five dollars out and gives it to him He bends picks up the typewriter and starts downstairs with Gloria looking after him He takes her hand and kisses it and Gloria looks at him then at her hand From the opposite direction a male nurse comes getting a pad and pencil from his pocket A man looks at Don but does not answer instead staring at him terrified before drifting away eerily Bim stands quietly watching him with a great big grin on his face Don has risen wearing flannel pajamas like all the rest of the patients However Don manages to make the swinging glass door past the benches and a collection of wheelchairs along the walls"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He rings the bell beside it then rings again From inside the door is opened by Gloria wearing a dressing gown and bedroom slippers her hair in the ruined elaborate hairdress of yesterday her eyes blazing with anger She slips into the apartment leaving the door about three inches ajar After a couple of seconds Gloria reappears with a wallet while Don leans against the door jamb breathing heavily She takes five dollars out and gives it to him Don takes it with a shaking hand and she brushes his forehead with the back of her hand He takes her hand and kisses it and Gloria looks at him then at her hand He bends picks up the typewriter and starts downstairs with Gloria looking after him A man looks at Don but does not answer instead staring at him terrified before drifting away eerily From the opposite direction a male nurse comes getting a pad and pencil from his pocket Don has risen wearing flannel pajamas like all the rest of the patients Bim stands quietly watching him with a great big grin on his face However Don manages to make the swinging glass door past the benches and a collection of wheelchairs along the walls The camera goes slowly up to a sidewalk clock with a diadem of three balls which stands outside the hock shop The time is twenty minutes of one but the clock says five minutes of four Nat is at the bar with two or three customers listening to race results on a little radio Don drags himself in drenched in sweat his breath as short and agonized as that of a dying man He goes to the end of the bar closest to the door hoists the typewriter on it with a final awful effort and leans his head on it A drink is shoved at Don but he is shaking so much that he cannot pick up the glass He bends down sucks half of it then lifts the glass and drains the rest Don holds out the empty glass to Nat his eyes imploring then takes the typewriter and drags himself out of Nat's place Don emerges and starts dragging himself up the street towards home As he passes the antique shop he suddenly stops noticing the wooden Indian Gloria spoke about pointing up Don walks into the house and goes to the second floor of this same crummy Third Avenue house dark woodwork paint peeling from the walls Beside the door at the head of the stairs there are about three bells for the several occupants of the apartment within Don drags himself up the stairs puts down the typewriter and inspects the name tags by the bells"
        }
      ]
    }
  ]
}