{
  "ground_truth": "He picks up a bottle. There is murder in his eyes. The proprietor is completely under the spell of that terrible glance. He hands over the bottle. Don takes it and walks out. Don enters, looks around the apartment, which is still in utter disorder. The electric lights, burning on heedlessly, offend him and he snaps off the light switch. Don, not noticing, walks to his big chair. On the small table next to it stand the three empty bottles. He takes the new bottle from his pocket and, sinking into the big chair, starts opening it. On the desk behind him, the telephone starts ringing. He sweeps them to the floor. Without winking an eyelash, he pours his glass half full, lifts it so that glass and hand obscure his face. In the dark sits Don, passed out. He opens his eyes, still in a half-stupor, stares straight before him. The bottle next to him is four-fifths empty. Out of the corner of one eye he sees something and slowly and with difficulty turns his head. In the wall above the couch, close to the door, there is a hole in the plaster, as if left by a large nail carelessly withdrawn so that some of the plaster went with it. Out of the hole peers a small mouse. At first Don draws back, repelled, but the mouse is such a friendly, harmless creature that after a moment his face relaxes and he half smiles at it. Just as he does so, from the direction of the window there whirs past him a strange winged thing. It is a bat, swooping in slow loops around the room. Don crouches into the back of his chair, staring in wild distaste. The top of the bat's hooked wing nicks his forehead as it speeds in swift but fluttering flight straight at the mouse. Don stiffens against the back of his chair. The bat has made another swoop and spread its wings over the mouse. Beneath those black wings some hideous pygmy struggle is going on. Apparently the bat has seized the mouse in its claws. Don gives a cry of horror. Now from behind the struggling wings comes a spurt of blood. Don cries out so hard his throat seems to burst apart, buries his horrified eyes in the back of his chair. She must have been listening from Don's first scream. Sophie, standing beside her, is barking wildly. From downstairs comes the barking of Mrs. Deveridge's dog. Beyond her, the door to her apartment is open. Don still cowers in his chair, his face hidden in his arms, his breathing heavy with terror. From outside comes the sound of footsteps racing upstairs toward his door, then the doorbell: short, short, long short.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He selects up a container. There is assassination in his gaze. The owner is entirely under the charm of that dreadful stare. He hands over the container. Don takes it and strides out. Don enters, glances around the dwelling, which is still in complete chaos. The electric lamps, blazing on carelessly, displease him and he flicks off the lamp switch. Don, not observing, proceeds to his large chair. On the small stand adjacent to it stand the trio of void containers. He takes the new container from his pocket and, collapsing into the large chair, begins opening it. On the desk behind him, the telephone commences ringing. He sweeps them to the ground. Without blinking an eyelash, he fills his glass halfway, raises it so that glass and hand conceal his face. In the obscurity sits Don, unconscious. He opens his eyes, still in a half-daze, stares directly ahead. The container next to him is four-fifths vacant. Out of the corner of one eye he notices something and gradually and with toil turns his head. In the barrier above the sofa, near to the entrance, there is a cavity in the plaster, as if left by a big spike heedlessly extracted so that some of the plaster departed with it. Out of the cavity peeks a small rodent. At first Don recoils, repelled, but the rodent is such a genial, innocuous creature that after a moment his face softens and he half grins at it. Just as he does so, from the bearing of the casement there whirs past him a peculiar winged creature. It is a flittermouse, diving in slow circuits around the chamber. Don crouches into the rear of his chair, staring in wild aversion. The top of the flittermouse's hooked appendage grazes his brow as it zips in rapid but trembling flight directly at the rodent. Don braces against the rear of his chair. The flittermouse has made another dive and spread its appendages over the rodent. Underneath those inky appendages some ghastly miniature skirmish is occurring. Evidently the flittermouse has snatched the rodent in its talons. Don emits an exclamation of horror. Now from behind the battling appendages comes a spurt of blood. Don exclaims so forcefully his throat seems to rupture apart, buries his horrified gaze in the rear of his chair. She must have been listening from Don's initial shriek. Sophie, standing beside her, is yelping frantically. From downstairs comes the yelping of Mrs. Deveridge's hound. Beyond her, the entrance to her dwelling is open. Don still huddles in his chair, his face concealed in his limbs, his respiration heavy with dread. From outside comes the noise of steps dashing upstairs toward his entrance, then the doorbell: short, short, long short."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He picks up a bottle. Murder is detected in his eyes. That terrible glance completely holds the proprietor under its spell. The bottle is handed over to him by the proprietor. The bottle is taken by Don, and he walks out. The apartment, still in utter disorder, is entered by Don, who looks around. The electric lights, left burning heedlessly, offend him, and the light switch is snapped off by him. Not noticing, he walks to his big chair. On the small table next to it, the three empty bottles stand. The new bottle is taken from his pocket by him, and, sinking into the big chair, he starts opening it. Behind him, the telephone starts ringing on the desk. He sweeps them to the floor. Without winking an eyelash, the glass is poured half full by him, and he lifts it so that glass and hand obscure his face. In the dark sits Don, passed out. His eyes open, still in a half-stupor, and he stares straight before him. The bottle next to him is seen to be four-fifths empty. Out of the corner of one eye, something is seen by him, and slowly and with difficulty, his head is turned. In the wall above the couch, close to the door, a hole in the plaster appears, as if a large nail had carelessly been withdrawn, so that some of the plaster went with it. A small mouse peers out of the hole. At first, he is repelled and draws back, but such a friendly, harmless creature is the mouse that after a moment, his face relaxes, and a half-smile is given to it by him. Just as he does so, a strange winged thing whirs past him from the direction of the window. A bat, swooping in slow loops around the room, is what it is. Into the back of his chair, Don crouches, staring in wild distaste. His forehead is nicked by the top of the bat's hooked wing as it speeds in swift but fluttering flight straight at the mouse. Don stiffens against the back of his chair. Another swoop is made by the bat, and its wings are spread over the mouse. Beneath those black wings, some hideous pygmy struggle goes on. The mouse is apparently seized by the bat in its claws. A cry of horror is given by Don. Now a spurt of blood comes from behind the struggling wings. Don cries out so hard that his throat seems to burst apart, and he buries his horrified eyes in the back of his chair. She must have been listening from Don's first scream. Sophie, standing beside her, barks wildly. The barking of Mrs. Deveridge's dog comes from downstairs. Her apartment door is open beyond her. Don, still cowering in his chair, hides his face in his arms, his breathing heavy with terror. From outside, the sound of footsteps racing upstairs toward his door is heard, followed by the doorbell: short, short, long short."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He picks up a bottle, murder in his eyes. The proprietor, entranced by that terrible glance, hands it over. Don takes it and leaves. Entering his disordered apartment, the glaring electric lights offend him, and he switches them off. Ignoring the mess, he walks to his chair, where three empty bottles sit on a table. He retrieves the new bottle from his pocket, sinks into the chair, and starts opening it. The phone rings on the desk behind him, and he sweeps the bottles to the floor. Without blinking, he pours his glass half full, obscuring his face with it. In the dark, Don passes out. He awakens in a half-stupor, staring ahead. The bottle beside him is mostly empty. He notices something and turns his head with difficulty. Above the couch, near the door, a hole in the plaster reveals a small mouse. Initially repelled, Don relaxes and half smiles at the harmless creature. Suddenly, a bat swoops around the room. Don recoils in distaste as the bat's wing nicks his forehead, then targets the mouse. Don stiffens as the bat spreads its wings over the mouse, a struggle ensues, and the bat seizes the mouse. Don cries in horror as blood spurts from the struggle. He buries his eyes in the chair, screaming. Sophie, listening from the start, barks wildly, joined by Mrs. Deveridge's dog downstairs. Don cowers, face hidden, breathing heavily in terror. Footsteps race upstairs, and the doorbell rings: short, short, long short."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He picks up a bottle, eyes murderous. The proprietor, entranced by his glare, hands it over. Don takes it and leaves. He enters his disorderly apartment. Offended by the burning lights, he snaps them off. Don, unaware, walks to his chair. On the table are three empty bottles. He pulls the new one from his pocket, sinks into the chair, and opens it. The phone rings on the desk behind. He sweeps the bottles off. Without blinking, he pours a half glass, lifting it to obscure his face. Don sits passed out in the dark. He opens his eyes groggily, stares ahead. The bottle is mostly empty. Spotting something, he turns his head. A hole in the plaster near the door shows a small mouse. Initially repelled, Don relaxes and half-smiles. Suddenly, a bat whirs by, looping around the room. Don recoils. Its wing nicks his forehead as it flies at the mouse. The bat swoops again, spreading wings over the mouse. Beneath, a grotesque struggle ensues. The bat grabs the mouse. Don screams. Blood spurts. He cries out, burying his face in terror. Sophie, beside him, barks. Mrs. Deveridge’s dog barks downstairs. Her apartment door is open. Don still cowers, breathing in fear. Footsteps rush up. The bell rings: short, short, long short. Kate turns. In a restaurant, the waitress bumps a colleague. Pregnant Leah takes the bottle. Bernadette, another waitress, gets it. Kate reluctantly answers the phone, eyes tearing. She runs down a hospital corridor, stops at reception. A nurse points across. Kate enters the room where Zoe lies, eyes shut, face grazed. She circles the bed, looking sadly at her niece. Dr. Barton appears in the doorway, pats her shoulder, and leaves. Kate stares out the window. She’s asleep beside Zoe’s bed."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He carefully picks up a bottle, his movements deliberate and precise. There is a murderous intent clearly visible in his eyes, a chilling look that seems to pierce through the air. The proprietor, completely captivated and overwhelmed by that terrible, intense glance, finds himself unable to resist. He obediently hands over the bottle, almost as if under a spell. Don takes possession of it and walks out with a determined stride. \n\nUpon entering his apartment, Don pauses to look around at the scene before him, which remains in a state of utter disarray. The electric lights, left burning carelessly and without purpose, offend his sensibilities, prompting him to snap off the light switch with a swift motion. Oblivious to the darkness, Don makes his way to his large, inviting chair. On the small table beside it stand three empty bottles, silent witnesses to past indulgences. He retrieves the new bottle from his pocket and, sinking into the comforting embrace of the big chair, begins the process of opening it. \n\nSuddenly, the telephone on the desk behind him starts ringing, its sound cutting through the silence. In a careless sweep, he knocks the bottles to the floor. Without so much as a blink, he pours his glass half full, lifting it in such a way that both the glass and his hand obscure his face from view. In the enveloping darkness, Don sits, having passed out. He eventually opens his eyes, still caught in a half-stupor, and stares blankly ahead. The bottle next to him is now four-fifths empty, a testament to his consumption. Out of the corner of one eye, he notices something and, with great effort, slowly turns his head. \n\nIn the wall above the couch, near the door, there is a noticeable hole in the plaster, as if a large nail had been carelessly withdrawn, taking some of the plaster with it. From this hole, a small mouse peers out, its tiny presence both unexpected and intriguing. Initially, Don recoils, repelled by the sight, but the mouse appears to be such a friendly, harmless creature that, after a moment, his expression softens, and he allows himself a half-smile at it. Just as he does so, a strange winged creature whirs past him from the direction of the window. It is a bat, executing slow, looping swoops around the room. \n\nDon shrinks back into the depths of his chair, staring with wild distaste at the bat. The top of the bat's hooked wing grazes his forehead as it flies in a swift yet fluttering motion, heading straight for the mouse. Don stiffens against the back of his chair, his body tense with apprehension. The bat makes another swoop, spreading its wings over the mouse. Beneath those dark, ominous wings, a hideous, pygmy struggle ensues. It appears that the bat has seized the mouse in its claws. Don lets out a cry of horror, his voice echoing in the room. From behind the struggling wings, a spurt of blood emerges. Don cries out with such intensity that it feels as though his throat might burst apart. He buries his horrified eyes in the back of his chair, seeking refuge from the gruesome sight. \n\nShe must have been listening from Don's first scream. Sophie, standing beside her, is barking wildly, her voice joining the chaos. From downstairs, the barking of Mrs. Deveridge's dog can be heard, adding to the cacophony. Beyond her, the door to her apartment stands open, a silent witness to the unfolding drama. Don remains cowering in his chair, his face hidden in his arms, his breathing heavy with terror. From outside, the sound of footsteps racing upstairs toward his door grows louder, culminating in the ringing of the doorbell: short, short, long short."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He gingerly and meticulously lifts a bottle, his actions deliberate and precise, each movement calculated with care. In his eyes, there is an unmistakable murderous intent that is both chilling and intense, a piercing gaze that cuts through the air with a sinister edge. The proprietor, unable to tear himself away from that terrible and overwhelming glare, finds himself completely captivated and unable to resist its power. Almost as if he is under some magical spell, he obediently hands over the bottle. Don takes possession of it and, with a determined and resolute stride, walks out of the shop.\n\nUpon making his way into his apartment, Don pauses momentarily to survey the scene before him, which remains in a state of utter disarray and chaos. The electric lights, left burning carelessly and without any sense of purpose, irritate and offend his sensibilities. With a swift and decisive motion, he snaps off the light switch. Oblivious to the impending darkness, Don confidently makes his way to his large, inviting chair. On the small table beside it stand three empty bottles, silent witnesses to previous indulgences and excesses. He retrieves the new bottle from his pocket and, sinking deeply into the comforting embrace of the big chair, begins the deliberate process of opening it. \n\nSuddenly, the telephone on the desk behind him starts ringing, its sharp and intrusive sound cutting through the previously undisturbed silence. In a careless and uncontrolled sweep, he knocks the bottles to the floor, where they land with a clatter. Without so much as a moment's hesitation, he pours his glass until it is half full, lifting it in a manner that both the glass and his hand obscure his face from view. In the enveloping darkness, Don sits, having passed out, his mind adrift. He eventually opens his eyes, still caught in a state of half-stupor, and stares blankly into the darkness before him. The bottle next to him is now four-fifths empty, a silent testament to his consumption. Out of the corner of one eye, he notices something and, with great effort and determination, slowly turns his gaze. \n\nIn the wall above the couch, near the door, there is a noticeable hole in the plaster, as if a large nail had been carelessly withdrawn, taking a chunk of the plaster with it. From this small, unassuming hole, a mouse peers out, its tiny presence both unexpected and strangely intriguing. Initially, Don recoils, repelled by the sight of the tiny creature, but the mouse appears to be such a friendly and harmless creature that, after a moment, his expression softens, and he allows himself a small, half-hearted smile at it. Just as he does so, a strange winged creature suddenly whirs past him, coming from the direction of the window. It is a bat, executing slow, looping swoops around the room. \n\nDon shrinks back into the depths of his chair, staring with wild distaste and apprehension at the bat. The top of the bat's hooked wing grazes his forehead as it flies in a swift yet fluttering motion, heading directly for the mouse. Don stiffens against the back of his chair, his entire body tense with fear and apprehension. The bat makes another swoop, spreading its dark, ominous wings over the mouse. Beneath those menacing wings, a hideous and pygmy struggle unfolds. It appears that the bat has seized the mouse in its sharp claws. Don lets out a cry of horror, his voice echoing throughout the room. From behind the struggling wings, a spurt of blood emerges. Don cries out with such intensity and desperation that it feels as though his throat might burst apart. Desperately, he buries his horrified eyes in the back of his chair, seeking refuge and solace from the gruesome sight before him. \n\nShe must have been listening from the moment of Don's first scream. Sophie, standing beside her, is barking wildly, her voice joining the rising cacophony. From downstairs, the frantic barking of Mrs. Deveridge's dog can be heard, adding to the chaotic noise. Beyond her, the door to her apartment stands open, a silent and unmoving witness to the unfolding drama. Don remains cowering in his chair, his face hidden in his arms, his breathing heavy and labored with terror. From outside, the sound of footsteps racing up the stairs toward his door grows louder and more urgent, culminating in the ringing of the doorbell: short, short, long short."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He reaches out and firmly grasps the bottle, his eyes filled with a murderous intensity that casts a chilling spell over the proprietor, who, unable to resist the power of that terrible glance, obediently hands over the bottle. With the bottle now in his possession, Don turns and strides out of the establishment. Upon entering his apartment, he pauses to take in the scene, noting the utter disorder that still prevails. The electric lights, left burning heedlessly, offend his sensibilities, prompting him to stride over and decisively snap off the light switch. Oblivious to the change in lighting, Don makes his way to his large, inviting chair. On the small table beside it, three empty bottles stand as silent witnesses to his previous indulgences. He retrieves the new bottle from his pocket, and as he sinks into the comforting embrace of the big chair, he begins the process of opening it. Suddenly, the telephone on the desk behind him starts ringing, its sound cutting through the silence. In a sweeping motion, he knocks the bottles to the floor, their clatter echoing in the room. Without a moment's hesitation, he pours the glass half full, lifting it to his lips in such a way that both the glass and his hand obscure his face. In the ensuing darkness, Don sits, having passed out, his eyes eventually fluttering open in a half-stupor as he stares blankly ahead. The bottle beside him is now four-fifths empty. Out of the corner of his eye, he catches sight of something, prompting him to slowly and with great effort turn his head. There, in the wall above the couch near the door, he notices a hole in the plaster, as if a large nail had been carelessly withdrawn, taking some of the plaster with it. From this hole, a small mouse peers out, its presence initially causing Don to recoil in repulsion. However, the mouse's friendly and harmless demeanor soon softens his expression, and he allows himself a half-smile. Just as he does, a strange winged creature whirs past him from the direction of the window. It is a bat, executing slow loops around the room. Don instinctively crouches back into his chair, his eyes wide with distaste. The bat's hooked wing grazes his forehead as it flies in a swift yet fluttering path directly toward the mouse. Don stiffens, pressing himself against the back of his chair. The bat makes another swoop, spreading its wings over the mouse, beneath which a hideous pygmy struggle ensues. It becomes apparent that the bat has seized the mouse in its claws, prompting Don to cry out in horror. From behind the bat's struggling wings, a spurt of blood emerges, causing Don to scream so forcefully that it feels as though his throat might burst apart. He buries his horrified eyes in the back of his chair. Sophie, who must have been listening from Don's first scream, stands beside him, barking wildly. From downstairs, the barking of Mrs. Deveridge's dog can be heard. Beyond her, the door to her apartment stands open. Don remains cowering in his chair, his face hidden in his arms, his breathing heavy with terror. From outside, the sound of footsteps racing upstairs toward his door reaches his ears, followed by the distinct pattern of the doorbell: short, short, long short."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Don picks up a bottle with a menacing look that intimidates the proprietor, who hands it over. Don leaves and enters his disordered apartment, irritated by the wasteful electric lights, which he promptly turns off. He moves to his chair, places the new bottle on the table with three empty ones, and begins to open it. As the phone rings, he knocks the bottles to the floor, pours a drink, and obscures his face with the glass. Later, he awakens in a stupor, noticing a mouse peering from a hole in the wall. Initially repelled, he relaxes and half-smiles at the creature. Suddenly, a bat swoops through the room, causing Don to recoil in horror as it attacks the mouse. The bat's wing grazes his forehead, and a struggle ensues, resulting in a spurt of blood. Don screams in terror, burying his face in the chair. Sophie, alerted by his cries, barks wildly, joined by Mrs. Deveridge's dog from downstairs. Don remains cowering, his breathing heavy, as footsteps approach and the doorbell rings in a distinct pattern."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He picks up a bottle, likely filled with whiskey judging by its shape and weight. There is murder in his eyes, a phrase suggesting intense anger or determination. The proprietor, likely a man accustomed to dealing with troubling patrons in this dimly lit downtown store specializing in discounted alcohol, is completely under the spell of that terrible glance. He hands over the bottle, probably hoping to avoid any confrontation. Don takes it and walks out into the dimly lit street. Don enters, looks around the apartment, which is still in utter disorder, a state it has been in since his last drinking spree. The electric lights, burning on heedlessly despite his usual frugality, offend him and he snaps off the light switch. Don, not noticing the mess or the gathered dust, walks to his big chair. On the small table next to it stand the three empty bottles, remnants of his previous nights of solitude. He takes the new bottle from his pocket and, sinking into the big chair, starts opening it with a practiced hand. On the desk behind him, the telephone, an old rotary model dating back to the 1940s, starts ringing. He sweeps them to the floor in frustration. Without winking an eyelash, he pours his glass half full, lifts it so that glass and hand obscure his face. In the dark sits Don, passed out, typical of his lonely nightly routine. He opens his eyes, still in a half-stupor, stares straight before him. The bottle next to him is four-fifths empty, evidence of his gradual descent into inebriation. Out of the corner of one eye he sees something and slowly and with difficulty turns his head. In the wall above the couch, close to the door, there is a hole in the plaster, as if left by a large nail carelessly withdrawn so that some of the plaster went with it, likely from an old picture frame that once hung there. Out of the hole peers a small mouse, a creature familiar with the room's neglected state. At first Don draws back, repelled, but the mouse is such a friendly, harmless creature that after a moment his face relaxes and he half smiles at it. Just as he does so, from the direction of the window there whirs past him a strange winged thing. It is a bat, drawn to the apartment by the scent of decay, swooping in slow loops around the room. Don crouches into the back of his chair, staring in wild distaste. The top of the bat's hooked wing nicks his forehead as it speeds in swift but fluttering flight straight at the mouse. Don stiffens against the back of his chair. The bat has made another swoop and spread its wings over the mouse, perhaps mistaking the tiny animal for prey. Beneath those black wings some hideous pygmy struggle is going on. Apparently, the bat has seized the mouse in its claws, a scene rarely witnessed by urban dwellers. Don gives a cry of horror. Now from behind the struggling wings comes a spurt of blood, a vivid reminder of nature's cruelty. Don cries out so hard his throat seems to burst apart, buries his horrified eyes in the back of his chair. She must have been listening from Don's first scream. Sophie, a neighbor's protective dog, standing beside her owner, is barking wildly. From downstairs comes the barking of Mrs. Deveridge's dog, echoing in the stairwell. Beyond her, the door to her apartment is open, the noise drawing the attention of other residents. Don still cowers in his chair, his face hidden in his arms, his breathing heavy with terror, overwhelmed by the gruesome scene. From outside comes the sound of footsteps racing upstairs toward his door, then the doorbell: short, short, long short, a signal familiar to Don as his friend’s hurried way of announcing his arrival in emergencies."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He picks up a bottle  He hands over the bottle  Don takes it and walks out  Don enters looks around the apartment which is still in utter disorder  The electric lights burning on heedlessly offend him and he snaps off the light switch  Don not noticing walks to his big chair  On the small table next to it stand the three empty bottles  He takes the new bottle from his pocket and sinking into the big chair starts opening it  On the desk behind him the telephone starts ringing  He sweeps them to the floor  Without winking an eyelash he pours his glass half full lifts it so that glass and hand obscure his face  In the dark sits Don passed out  He opens his eyes still in a halfstupor stares straight before him  The bottle next to him is fourfifths empty  Out of the corner of one eye he sees something and slowly and with difficulty turns his head  In the wall above the couch close to the door there is a hole in the plaster as if left by a large nail carelessly withdrawn so that some of the plaster went with it  Out of the hole peers a small mouse  At first Don draws back repelled but the mouse is such a friendly harmless creature that after a moment his face relaxes and he half smiles at it  Just as he does so from the direction of the window there whirs past him a strange winged thing  It is a bat swooping in slow loops around the room  There is murder in his eyes  The proprietor is completely under the spell of that terrible glance  He hands over the bottle  Don takes it and walks out  Don enters looks around the apartment which is still in utter disorder  The electric lights burning on heedlessly offend him and he snaps off the light switch  Don not noticing walks to his big chair  On the small table next to it stand the three empty bottles  He takes the new bottle from his pocket and sinking into the big chair starts opening it  On the desk behind him the telephone starts ringing  He sweeps them to the floor  Without winking an eyelash he pours his glass half full lifts it so that glass and hand obscure his face  In the dark sits Don passed out  He opens his eyes still in a halfstupor stares straight before him  The bottle next to him is fourfifths empty  Out of the corner of one eye he sees something and slowly and with difficulty turns his head  In the wall above the couch close to the door there is a hole in the plaster as if left by a large nail carelessly withdrawn so that some of the plaster went with it  Out of the hole peers a small mouse  At first Don draws back repelled but the mouse is such a friendly harmless creature that after a moment his face relaxes and he half smiles at it  Just as he does so from the direction of the window there whirs past him a strange winged thing  It is a bat swooping in slow loops around the room  Don crouches into the back of his chair staring in wild distaste  The top of the bat's hooked wing nicks his forehead as it speeds in swift but fluttering flight straight at the mouse  Don stiffens against the back of his chair  The bat has made another swoop and spread its wings over the mouse  Beneath those black wings some hideous pygmy struggle is going on  Apparently the bat has seized the mouse in its claws  Don gives a cry of horror  Now from behind the struggling wings comes a spurt of blood  Don cries out so hard his throat seems to burst apart buries his horrified eyes in the back of his chair  She must have been listening from Don's first scream  Sophie standing beside her is barking wildly  From downstairs comes the barking of Mrs Deveridge's dog  Beyond her the door to her apartment is open  Don still cowers in his chair his face hidden in his arms his breathing heavy with terror  From outside comes the sound of footsteps racing upstairs toward his door  then the doorbell short short long short"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He picks up a bottle. There is murder in his eyes. The proprietor is completely under the spell of that terrible glance. He hands over the bottle. Don takes it and walks out. Don enters looks around the apartment which is still in utter disorder. The electric lights burning on heedlessly offend him and he snaps off the light switch. Don not noticing walks to his big chair. On the small table next to it stand the three empty bottles. He takes the new bottle from his pocket and sinking into the big chair starts opening it. On the desk behind him the telephone starts ringing. He sweeps them to the floor. Without winking an eyelash he pours his glass half full lifts it so that glass and hand obscure his face. In the dark sits Don passed out. He opens his eyes still in a halfstupor stares straight before him. The bottle next to him is fourfifths empty. Out of the corner of one eye he sees something and slowly and with difficulty turns his head. In the wall above the couch close to the door there is a hole in the plaster as if left by a large nail carelessly withdrawn so that some of the plaster went with it. Out of the hole peers a small mouse. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. At first Don draws back repelled but the mouse is such a friendly harmless creature that after a moment his face relaxes and he half smiles at it. Just as he does so from the direction of the window there whirs past him a strange winged thing. It is a bat swooping in slow loops around the room. Don crouches into the back of his chair staring in wild distaste. The top of the bat's hooked wing nicks his forehead as it speeds in swift but fluttering flight straight at the mouse. Don stiffens against the back of his chair. The bat has made another swoop and spread its wings over the mouse. Beneath those black wings some hideous pygmy struggle is going on. Apparently the bat has seized the mouse in its claws. Don gives a cry of horror. Now from behind the struggling wings comes a spurt of blood. Don cries out so hard his throat seems to burst apart buries his horrified eyes in the back of his chair. She must have been listening from Don's first scream. Sophie standing beside her is barking wildly. From downstairs comes the barking of Mrs Deveridge's dog. Beyond her the door to her apartment is open. Don still cowers in his chair his face hidden in his arms his breathing heavy with terror. From outside comes the sound of footsteps racing upstairs toward his door. then the doorbell short short long short."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He picks up a bottle. There is murder in his eyes. The proprietor is completely under the spell of that terrible glance. He hands over the bottle. Don takes it and walks out. Don enters looks around the apartment which is still in utter disorder. The electric lights burning on heedlessly offend him and he snaps off the light switch. Don not noticing walks to his big chair. On the small table next to it stand the three empty bottles. He takes the new bottle from his pocket and sinking into the big chair starts opening it. On the desk behind him the telephone starts ringing. He sweeps them to the floor. Without winking an eyelash he pours his glass half full lifts it so that glass and hand obscure his face. In the dark sits Don passed out. He opens his eyes still in a halfstupor stares straight before him. The bottle next to him is fourfifths empty. Out of the corner of one eye he sees something and slowly and with difficulty turns his head. In the wall above the couch close to the door there is a hole in the plaster as if left by a large nail carelessly withdrawn so that some of the plaster went with it. Out of the hole peers a small mouse. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. At first Don draws back repelled but the mouse is such a friendly harmless creature that after a moment his face relaxes and he half smiles at it. Just as he does so from the direction of the window there whirs past him a strange winged thing. It is a bat swooping in slow loops around the room. Don crouches into the back of his chair staring in wild distaste. The top of the bat's hooked wing nicks his forehead as it speeds in swift but fluttering flight straight at the mouse. Don stiffens against the back of his chair. The bat has made another swoop and spread its wings over the mouse. Beneath those black wings some hideous pygmy struggle is going on. Apparently the bat has seized the mouse in its claws. Don gives a cry of horror. Now from behind the struggling wings comes a spurt of blood. Don cries out so hard his throat seems to burst apart buries his horrified eyes in the back of his chair. She must have been listening from Don's first scream. Sophie standing beside her is barking wildly. From downstairs comes the barking of Mrs Deveridge's dog. Beyond her the door to her apartment is open. Don still cowers in his chair his face hidden in his arms his breathing heavy with terror. From outside comes the sound of footsteps racing upstairs toward his door. then the doorbell short short long short."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He picks up a bottle. There is murder in his eyes. The proprietor is completely under the spell of that terrible glance. He hands over the bottle. Don takes it and walks out. Don enters looks around the apartment which is still in utter disorder. The electric lights burning on heedlessly offend him and he snaps off the light switch. Don not noticing walks to his big chair. On the small table next to it stand the three empty bottles. He takes the new bottle from his pocket and sinking into the big chair starts opening it. Now from behind the struggling wings comes a spurt of blood. Don cries out so hard his throat seems to burst apart buries his horrified eyes in the back of his chair. She must have been listening from Don's first scream. Sophie standing beside her is barking wildly. From downstairs comes the barking of Mrs Deveridge's dog. Beyond her the door to her apartment is open. Don still cowers in his chair his face hidden in his arms his breathing heavy with terror. From outside comes the sound of footsteps racing upstairs toward his door. then the doorbell short short long short."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He picks up a bottle. There is murder in his eyes. The proprietor is completely under the spell of that terrible glance. He hands over the bottle. Beyond her the door to her apartment is open. Don still cowers in his chair his face hidden in his arms his breathing heavy with terror. From outside comes the sound of footsteps racing upstairs toward his door. then the doorbell short short long short."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "She picks up a bottle. There is murder in her eyes. The gardener is completely under the spell of that terrible glance. The gardener hands over the bottle. Emily takes it and walks out. Emily enters, looks around the apartment, which is still in utter disorder. The electric lights, burning on heedlessly, offend her and she snaps off the light switch. Emily, not noticing, walks to her big chair. On the small table next to it stand the three empty bottles. She takes the new bottle from her pocket and, sinking into the big chair, starts opening it. On the desk behind her, the telephone starts ringing. She sweeps them to the floor. Without winking an eyelash, she pours her glass half full, lifts it so that glass and hand obscure her face. In the dark sits Emily, passed out. She opens her eyes, still in a half-stupor, stares straight before her. The bottle next to her is four-fifths empty. Out of the corner of one eye, she sees something and slowly and with difficulty turns her head. In the wall above the couch, close to the door, there is a hole in the plaster, as if left by a large nail carelessly withdrawn so that some of the plaster went with it. Out of the hole peers a small mouse. At first Emily draws back, repelled, but the mouse is such a friendly, harmless creature that after a moment her face relaxes and she half smiles at it. Just as she does so, from the direction of the window there whirs past her a strange winged thing. It is a bat, swooping in slow loops around the room. Emily crouches into the back of her chair, staring in wild distaste. The top of the bat's hooked wing nicks her forehead as it speeds in swift but fluttering flight straight at the mouse. Emily stiffens against the back of her chair. The bat has made another swoop and spread its wings over the mouse. Beneath those black wings some hideous pygmy struggle is going on. Apparently the bat has seized the mouse in its claws. Emily gives a cry of horror. Now from behind the struggling wings comes a spurt of blood. Emily cries out so hard her throat seems to burst apart, buries her horrified eyes in the back of her chair. They must have been listening from Emily's first scream. Oliver, standing beside them, is barking wildly. From downstairs comes the barking of Mr. Turner's dog. Beyond him, the door to his apartment is open. Emily still cowers in her chair, her face hidden in her arms, her breathing heavy with terror. From outside comes the sound of footsteps racing upstairs toward her door, then the doorbell: short, short, long short."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He picks up a notebook. There is madness in his eyes. The manager is completely under the spell of that terrible glance. He hands over the notebook. Don takes it and walks out. Don enters, looks around the garage, which is still in utter disarray. The fluorescent lights, burning on heedlessly, offend him and he flips off the fan switch. Don, not noticing, walks to his big couch. On the small shelf next to it stand the three empty notebooks. He takes the new notebook from his pocket and, sinking into the big couch, starts opening it. On the cabinet behind him, the radio starts playing. He knocks them to the floor. Without winking an eyelash, he writes his page half full, lifts it so that paper and hand obscure his face. In the dark sits Don, passed out. He opens his eyes, still in a half-stupor, stares straight before him. The notebook next to him is four-fifths empty. Out of the corner of one eye he sees something and slowly and with difficulty turns his head. In the wall above the chair, close to the window, there is a crack in the wallpaper, as if left by a large nail carelessly withdrawn so that some of the wallpaper went with it. Out of the crack peers a small toad. At first Don draws back, repelled, but the toad is such a friendly, harmless creature that after a moment his face relaxes and he half smiles at it. Just as he does so, from the direction of the door there flutters past him a strange feathered thing. It is an owl, swooping in slow loops around the room. Don crouches into the back of his couch, staring in wild distaste. The tip of the owl's hooked beak grazes his forehead as it speeds in swift but fluttering flight straight at the toad. Don stiffens against the back of his couch. The owl has made another swoop and spread its wings over the toad. Beneath those brown wings some hideous pygmy struggle is going on. Apparently the owl has seized the toad in its talons. Don gives a cry of horror. Now from behind the struggling wings comes a spurt of ink. Don cries out so hard his throat seems to burst apart, buries his horrified eyes in the back of his couch. She must have been listening from Don's first scream. Sophie, standing beside him, is barking wildly. From downstairs comes the barking of Mrs. Deveridge's cat. Beyond her, the door to her garage is open. Don still cowers in his couch, his face hidden in his arms, his breathing heavy with terror. From outside comes the sound of footsteps racing upstairs toward his door, then the buzzer: short, short, long short."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He admires a bottle. There is curiosity in his eyes. The proprietor is completely fascinated by that intense glance. He discusses the bottle. Don examines it and sits down. Don opens, surveys the apartment, which is still in utter tranquility. The electric lights, glowing warmly, intrigue him and he flips on the light switch. Don, not noticing, saunters to his big chair. On the small table next to it stand the three full bottles. He retrieves the new bottle from his pocket and, perching into the big chair, starts inspecting it. On the desk behind him, the telephone starts silent. He places them on his lap. Without blinking an eyelash, he fills his glass half empty, lowers it so that glass and hand expose his face. In the dark sits Don, alert. He closes his eyes, fully aware, gazes straight before him. The bottle next to him is one-fifth full. Out of the corner of one eye, he hears something and quickly and easily turns his head. In the wall above the couch, close to the door, there is a crack in the plaster, as if left by a large picture carefully hung so that some of the plaster was added to it. Out of the crack peeks a small mouse. At first, Don leans forward, intrigued, but the mouse is such a cautious, amusing creature that after a moment his face tenses and he half frowns at it. Just as he does so, from the direction of the window there flutters past him a peculiar winged thing. It is a moth, drifting in gentle loops around the room. Don leans into the front of his chair, gazing in wild fascination. The tip of the moth's feathery wing brushes his forehead as it drifts in slow but smooth flight straight at the mouse. Don relaxes against the back of his chair. The moth has made another drift and folded its wings over the mouse. Beneath those delicate wings some gentle pygmy dance is going on. Apparently, the moth has embraced the mouse in its wings. Don gives a sigh of astonishment. Now from behind the embracing wings comes a flash of color. Don exclaims so softly his voice seems to whisper away, shows his astonished eyes to the room. She must have been listening from Don's first murmur. Sophie, standing beside her, is wagging wildly. From downstairs comes the meowing of Mrs. Deveridge's cat. Beyond her, the door to her apartment is closed. Don still leans in his chair, his face revealed to the room, his breathing soft with wonder. From outside comes the sound of footsteps strolling upstairs toward his door, then the doorbell: long, long, short long."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The mailbox picks up an apple. There is curiosity in its wires. The accountant is completely under the spell of that delightful glance. It hands over the apple. The suitcase takes it and rolls out. The suitcase enters, looks around the greenhouse, which is still in utter disarray. The disco lights, flashing on heedlessly, irritate it and it switches off the light remote. The suitcase, not noticing, rolls to its big ottoman. On the tiny shelf next to it stand the three empty jars. It takes the new apple from its slot and, sinking into the big ottoman, starts peeling it. On the shelf behind it, the clock starts beeping. It sweeps them to the floor. Without blinking a sensor, it fills its cup half full, lifts it so that cup and wires obscure its face. In the dark sits the suitcase, powered down. It activates its sensors, still in a semi-function, stares straight before itself. The apple next to it is four-fifths eaten. Out of the corner of one sensor, it detects something and slowly and with difficulty turns its wheels. In the wall above the trunk, close to the door, there is a crack in the wallpaper, as if left by a large painting carelessly removed so that some of the paper tore with it. Out of the crack peers a small beetle. At first the suitcase rolls back, repulsed, but the beetle is such a friendly, harmless entity that after a moment its wires relax and it half smiles at it. Just as it does so, from the direction of the curtains there whirs past it a strange rotating thing. It is a drone, swooping in slow loops around the room. The suitcase rolls into the back of its ottoman, staring in wild distaste. The tip of the drone's propeller touches its handle as it flies in swift but fluttering flight straight at the beetle. The suitcase stiffens against the back of its ottoman. The drone has made another swoop and spread its rotors over the beetle. Beneath those spinning rotors some hideous miniature struggle is going on. Apparently the drone has seized the beetle in its gears. The suitcase gives a beep of alarm. Now from behind the struggling rotors comes a spurt of oil. The suitcase beeps so hard its speaker seems to crack apart, buries its alarmed sensors in the back of its ottoman. She must have been listening from the suitcase's first beep. The cushion, standing beside it, is whirring wildly. From downstairs comes the whirring of Mr. Thompson's fan. Beyond it, the door to its greenhouse is open. The suitcase still rests in its ottoman, its sensors hidden in its wires, its circuits filled with anxiety. From outside comes the sound of gears turning upstairs toward its door, then the doorbell: short, short, long short."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "She places down a box. There is sleepiness in her voice. The visitor is completely under the sway of that gentle sound. She hands over the box. Sam retrieves it and strolls away. Sam enters, glances around the kitchen, which is still in perfect order. The ceiling fans, spinning on tirelessly, annoy him and he pushes the off button. Sam, not observing, moves to his big couch. On the small shelf next to it rest the three empty journals. He removes the new box from his suitcase and, collapsing into the big couch, starts unpacking it. On the cabinet behind him, the clock starts chiming. He kicks them to the floor. Without batting an eye, he fills his flask half full, raises it so that flask and hand hide his face. In the dark sits Sam, asleep. He opens his eyes, still in a half-daze, gazes straight ahead. The box next to him is one-fifth full. Out of the corner of one eye, he hears something and slowly and with effort tilts his head. In the wall above the armchair, close to the window, there is a dent in the wood, as if made by a small mallet hastily misplaced so that some of the wood splintered with it. Out of the dent peeks a small bird. At first Sam leans in, intrigued, but the bird is such an elusive, timid creature that after a moment his face relaxes and he half smiles at it. Just as he does so, from the direction of the ceiling, there whistles past him a strange glowing orb. It is a drone, circling in slow spirals around the room. Sam presses into the back of his couch, glaring in mild interest. The edge of the drone's spinning blade brushes his shoulder as it flies in swift but faltering motion straight at the bird. Sam leans forward against the back of his couch. The drone has made another loop and cast its blades over the bird. Beneath those blue lights some curious dance is going on. Apparently, the drone has ensnared the bird in its rotors. Sam gives a shout of amazement. Now from beneath the spinning blades comes a burst of feathers. Sam shouts out so loud his ears seem to pop, hides his astonished eyes in the back of his couch. She must have been waiting from Sam's first yell. Claire, standing beside her, is chirping softly. From upstairs comes the singing of Mrs. Deveridge's cat. Beyond her, the window to her apartment is open. Sam still trembles in his couch, his face buried in his arms, his breathing calm with wonder. From inside comes the sound of murmurings drifting downstairs away from his window, then the phone rings: long, long, short long."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He lifts a vase. There is mischief in his eyes. The proprietor is completely under the enchantment of that mischievous glance. He hands over the vase. Don grabs it and marches out. Don steps in, glances around the kitchen, which is still in complete disarray. The neon lights, flashing on wildly, irritate him and he flicks off the light switch. Don, not noticing, strides to his large couch. On the small shelf next to it stand the three empty vases. He takes the new vase from his vest and, collapsing into the large couch, begins unwrapping it. On the bookshelf behind him, the radio starts buzzing. He nudges them to the ground. Without blinking, he fills his cup half full, lifts it so that cup and hand obscure his face. In the dark sits Don, dozed off. He opens his eyes, still in a daze, gazes straight ahead. The vase next to him is mostly empty. Out of the corner of one eye, he notices something and slowly and with effort turns his head. In the wall above the armchair, close to the door, there is a crack in the wallpaper, as if left by a large picture carelessly removed so that some of the wallpaper tore off with it. Out of the crack peers a small lizard. At first Don recoils, disgusted, but the lizard is such a gentle, harmless creature that after a moment his face softens and he half chuckles at it. Just as he does so, from the direction of the curtain there flutters past him a peculiar winged insect. It is a moth, looping in slow circles around the room. Don huddles into the back of his couch, gazing in wild distaste. The tip of the moth's fuzzy wing brushes his cheek as it glides in quick but erratic flight straight at the lizard. Don stiffens against the back of his couch. The moth has made another loop and spread its wings over the lizard. Beneath those dusty wings some comical pygmy encounter is occurring. Apparently, the moth has nudged the lizard with its legs. Don gasps in disbelief. Now from beneath the flapping wings comes a trickle of dust. Don shouts so hard his voice seems to fracture, hides his startled eyes in the back of his couch. She must have been eavesdropping from Don's first exclamation. Sophie, standing beside her, is yapping excitedly. From downstairs comes the barking of Mrs. Deveridge's pet. Beyond her, the door to her apartment stands ajar. Don still shrinks in his couch, his face buried in his arms, his breathing heavy with dread. From outside comes the sound of footsteps dashing up the stairs toward his door, then the doorbell: beep, beep, boop beep."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "She grabs a spoon. There is delight in her voice. The librarian is completely under the illusion of that joyful sound. She receives the spoon. Pat hands it over and dances in. Pat exits, glances around the garden, which is still in perfect harmony. The street lamps, glowing on tirelessly, please her and she flicks off the lamp post. Pat, not noticing, strolls to her small sofa. On the large shelf next to it lie the three empty vases. She retrieves the new spoon from her hat and, sinking into the small sofa, starts polishing it. On the counter behind her, the radio starts playing. She nudges them to the floor. Without blinking an eye, she pours her mug half full, raises it so that mug and fingers obscure her face. In the daylight sits Pat, meditating. She closes her mind, still in a half-trance, gazes straight ahead. The spoon next to her is mostly polished. Out of the corner of one ear she hears something and slowly and with effort turns her shoulder. In the fence above the hammock, close to the gate, there is a patch in the wood, as if left by a sign carelessly removed so that some of the wood came with it. Out of the patch peers a small rabbit. At first Pat leans forward, intrigued, but the rabbit is such a curious, energetic creature that after a moment her expression softens and she half beams at it. Just as she does so, from the direction of the chimney there flutters past her a strange crawling thing. It is a lizard, slithering in slow zigzags around the yard. Pat shrinks into the edge of her sofa, gazing in wild fascination. The tip of the lizard's pointed foot taps her wrist as it glides in swift but meandering motion straight at the rabbit. Pat presses against the edge of her sofa. The lizard has made another twist and coiled its tail over the rabbit. Beneath that green tail some bizarre miniature dance is taking place. Apparently the lizard has wrapped the rabbit in its tail. Pat shouts in amazement. Now from behind the entwined movements comes a flicker of dust. Pat calls out so loudly her voice seems to echo apart, hides her fascinated face in the edge of her sofa. He must have been listening from Pat's first shout. Jordan, standing beside him, is neighing calmly. From upstairs comes the neighing of Mr. Jensen's horse. Beyond him, the gate to his garden is open. Pat still curls up in her sofa, her face nestled in her hands, her breathing steady with curiosity. From inside comes the sound of voices gliding downstairs toward the gate, then the doorbell: long, long, short long."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Don, with a murderous look, takes a bottle from a spellbound proprietor and returns to his disordered apartment. Irritated by the lights, he switches them off, settles into his chair, and opens the new bottle while ignoring a ringing phone. In a half-stupor, he notices a friendly mouse peering from a wall hole. Suddenly, a bat swoops around the room, and Don watches in horror as it attacks the mouse. Blood spurts, and Don screams in terror, burying his face in his chair. The noise prompts Sophie and Mrs. Deveridge's dog to bark, and footsteps approach, followed by a distinctive doorbell ring."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "then the doorbell short short long short From outside comes the sound of footsteps racing upstairs toward his door  Don still cowers in his chair his face hidden in his arms his breathing heavy with terror  Beyond her the door to her apartment is open  From downstairs comes the barking of Mrs Deveridge's dog  Sophie standing beside her is barking wildly  She must have been listening from Don's first scream  Don cries out so hard his throat seems to burst apart buries his horrified eyes in the back of his chair  Now from behind the struggling wings comes a spurt of blood  Don gives a cry of horror  Apparently the bat has seized the mouse in its claws  Beneath those black wings some hideous pygmy struggle is going on  The bat has made another swoop and spread its wings over the mouse  Don stiffens against the back of his chair  The top of the bat's hooked wing nicks his forehead as it speeds in swift but fluttering flight straight at the mouse  Don crouches into the back of his chair staring in wild distaste  It is a bat swooping in slow loops around the room  Just as he does so from the direction of the window there whirs past him a strange winged thing  At first Don draws back repelled but the mouse is such a friendly harmless creature that after a moment his face relaxes and he half smiles at it  Out of the hole peers a small mouse  In the wall above the couch close to the door there is a hole in the plaster as if left by a large nail carelessly withdrawn so that some of the plaster went with it  Out of the corner of one eye he sees something and slowly and with difficulty turns his head  The bottle next to him is fourfifths empty  He opens his eyes still in a halfstupor stares straight before him  In the dark sits Don passed out  Without winking an eyelash he pours his glass half full lifts it so that glass and hand obscure his face  He sweeps them to the floor  On the desk behind him the telephone starts ringing  He takes the new bottle from his pocket and sinking into the big chair starts opening it  On the small table next to it stand the three empty bottles  Don not noticing walks to his big chair  The electric lights burning on heedlessly offend him and he snaps off the light switch  Don enters looks around the apartment which is still in utter disorder  Don takes it and walks out  He hands over the bottle  The proprietor is completely under the spell of that terrible glance  There is murder in his eyes  He picks up a bottle "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Don stiffens against the back of his chair  Out of the hole peers a small mouse  Don enters looks around the apartment which is still in utter disorder  Don crouches into the back of his chair staring in wild distaste  On the desk behind him the telephone starts ringing  Don not noticing walks to his big chair  She must have been listening from Don's first scream  The bat has made another swoop and spread its wings over the mouse  Don takes it and walks out  From downstairs comes the barking of Mrs Deveridge's dog  He picks up a bottle  The top of the bat's hooked wing nicks his forehead as it speeds in swift but fluttering flight straight at the mouse  The bottle next to him is fourfifths empty  Just as he does so from the direction of the window there whirs past him a strange winged thing  Out of the corner of one eye he sees something and slowly and with difficulty turns his head  Beneath those black wings some hideous pygmy struggle is going on  Beyond her the door to her apartment is open  Sophie standing beside her is barking wildly  Don cries out so hard his throat seems to burst apart buries his horrified eyes in the back of his chair  Now from behind the struggling wings comes a spurt of blood  Don gives a cry of horror  Don still cowers in his chair his face hidden in his arms his breathing heavy with terror  He opens his eyes still in a halfstupor stares straight before him  There is murder in his eyes  On the small table next to it stand the three empty bottles  At first Don draws back repelled but the mouse is such a friendly harmless creature that after a moment his face relaxes and he half smiles at it  then the doorbell short short long short He sweeps them to the floor  He hands over the bottle  Without winking an eyelash he pours his glass half full lifts it so that glass and hand obscure his face  The proprietor is completely under the spell of that terrible glance  The electric lights burning on heedlessly offend him and he snaps off the light switch  From outside comes the sound of footsteps racing upstairs toward his door  In the dark sits Don passed out  He takes the new bottle from his pocket and sinking into the big chair starts opening it  In the wall above the couch close to the door there is a hole in the plaster as if left by a large nail carelessly withdrawn so that some of the plaster went with it  It is a bat swooping in slow loops around the room  Apparently the bat has seized the mouse in its claws "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "At first Don draws back repelled but the mouse is such a friendly harmless creature that after a moment his face relaxes and he half smiles at it  Just as he does so from the direction of the window there whirs past him a strange winged thing  It is a bat swooping in slow loops around the room  Don crouches into the back of his chair staring in wild distaste  The top of the bat's hooked wing nicks his forehead as it speeds in swift but fluttering flight straight at the mouse  Don stiffens against the back of his chair  The bat has made another swoop and spread its wings over the mouse  Beneath those black wings some hideous pygmy struggle is going on  Apparently the bat has seized the mouse in its claws  Don gives a cry of horror  Now from behind the struggling wings comes a spurt of blood  Don cries out so hard his throat seems to burst apart buries his horrified eyes in the back of his chair  She must have been listening from Don's first scream  Sophie standing beside her is barking wildly  From downstairs comes the barking of Mrs Deveridge's dog  Beyond her the door to her apartment is open  Don still cowers in his chair his face hidden in his arms his breathing heavy with terror  From outside comes the sound of footsteps racing upstairs toward his door  then the doorbell short short long short He picks up a bottle  There is murder in his eyes  The proprietor is completely under the spell of that terrible glance  He hands over the bottle  Don takes it and walks out  Don enters looks around the apartment which is still in utter disorder  The electric lights burning on heedlessly offend him and he snaps off the light switch  Don not noticing walks to his big chair  On the small table next to it stand the three empty bottles  He takes the new bottle from his pocket and sinking into the big chair starts opening it  On the desk behind him the telephone starts ringing  He sweeps them to the floor  Without winking an eyelash he pours his glass half full lifts it so that glass and hand obscure his face  In the dark sits Don passed out  He opens his eyes still in a halfstupor stares straight before him  The bottle next to him is fourfifths empty  Out of the corner of one eye he sees something and slowly and with difficulty turns his head  In the wall above the couch close to the door there is a hole in the plaster as if left by a large nail carelessly withdrawn so that some of the plaster went with it  Out of the hole peers a small mouse "
        }
      ]
    }
  ]
}