{
  "ground_truth": "Helen and Wick watch Don, and Don's face relaxes into an innocent grin as his eyes meet Helen's, while hers are infinitely distressed. Wick has twisted the string off the bottle and, with the bottle in his hand, moves through the living room toward the kitchenette. Don looks after him and then follows him, a stubborn smile on his lips. Wick steps to the sink, opens the bottle, turns it upside down, and lets the whiskey run out. Helen trails after them, acutely embarrassed. Don and Helen reach the doorway from the living room and stand watching. Don feels as though he is watching the execution of a very good friend, but with Helen's eyes on him, he maintains his nonchalant expression. Once the bottle is emptied, Wick puts it in the sink, shrugs, and goes to the hall for his hat. Helen kisses him on the mouth, a woman hopelessly in love. She turns to go, but Don holds her back; then, to prevent him from seeing her moist eyes, she turns and hurries into the entrance hall. Wick turns toward Don, who has followed Helen to the entrance hall. Helen comes quickly out, takes a handkerchief from her bag, and hurries past Wick into the hall. Wick stands, hat in hand, holding the door open, then goes out, shutting the door behind him. Don rushes to the door, pressing his ear against it to hear what Wick and Helen are saying outside. The passage is narrow and simple, with a light bracket always burning every so often down the stair. A skylight, somewhat obscured by dirt and dust, lights the fourth floor back. They descend a few steps, and Wick quickly takes Helen's arm as they continue down the stairs. Don stands at the door, panic on his face, wondering if his brother has discovered the other two bottles. He puts the chain on the door to ensure his privacy, then dashes into the bathroom. Don rushes in, takes a nail file, kneels beside the grille of a register in the side wall, pries it open with the file, looks inside, puts his hand in, looks at the hole wide-eyed, pushes the grille back, and runs out. He then runs in, goes to the couch, pulls it away from the wall, throws himself on his belly on the couch, and reaches under the side of it towards the wall. His hand explores among the springs. He sits up with a face covered in sweat, takes out his handkerchief, and wipes his face. Just then, from the direction of the entrance door, there is the noise of a key being turned in the lock. The door opens as far as the chain will allow, stopping with a sharp bite of metal on wood.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Helen and Wick observe Don, and Don's visage eases into an naïve beam as his eyes engage Helen's, while hers are infinitely troubled. Wick has untwisted the cord from the flask and, with the flask in his grip, proceeds through the living area toward the kitchenette. Don glances after him and then accompanies him, a resolute grin on his lips. Wick steps to the basin, unseals the flask, inverts it, and lets the liquor pour out. Helen trails after them, intensely mortified. Don and Helen arrive at the threshold from the living area and stand observing. Don senses as though he is observing the execution of a very good companion, but with Helen's gaze on him, he sustains his casual demeanor. Once the flask is emptied, Wick places it in the basin, shrugs, and proceeds to the corridor for his cap. Helen kisses him on the lips, a woman desperately in love. She turns to leave, but Don restrains her; then, to prevent him from witnessing her wet eyes, she turns and hurries into the foyer. Wick turns toward Don, who has followed Helen to the foyer. Helen emerges swiftly, takes a cloth from her purse, and rushes past Wick into the corridor. Wick stands, cap in hand, holding the portal ajar, then departs, closing the portal behind him. Don dashes to the portal, pressing his ear against it to listen to what Wick and Helen are articulating outside. The passage is confined and austere, with a light fixture always burning at intervals down the stairway. A skylight, somewhat veiled by grime and dust, illuminates the fourth floor rear. They descend a few steps, and Wick briskly takes Helen's limb as they continue down the stairway. Don stands at the portal, alarm on his visage, pondering if his sibling has uncovered the additional two flasks. He attaches the chain on the portal to secure his solitude, then bolts into the washroom. Don dashes in, takes a nail file, kneels beside the grate of a vent in the side barrier, pries it open with the file, looks inside, puts his hand in, gazes at the cavity wide-eyed, pushes the grate back, and sprints out. He then dashes in, goes to the divan, pulls it away from the barrier, throws himself on his abdomen on the divan, and reaches beneath the side of it towards the barrier. His hand probes among the coils. He sits up with a visage covered in perspiration, takes out his cloth, and wipes his visage. Just then, from the direction of the foyer door, there is the noise of a key being turned in the latch. The door opens as far as the chain will permit, halting with a sharp clash of metal on wood."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Helen and Wick watch Don, and an innocent grin is relaxed into by Don's face as Helen's eyes are met by his, while she is infinitely distressed. The string has been twisted off the bottle by Wick and, with the bottle in his hand, he moves through the living room toward the kitchenette. Wick is looked after by Don and then followed by him, a stubborn smile on his lips. The sink is stepped to by Wick, the bottle is opened, turned upside down, and the whiskey is let run out. They are trailed after by Helen, acutely embarrassed. The doorway from the living room is reached by Don and Helen, and they stand watching. It feels to Don as though a very good friend’s execution is being watched by him, but with Helen's eyes on him, a nonchalant expression is maintained by him. Once the bottle is emptied, it is put in the sink by Wick, who shrugs and goes to the hall for his hat. Helen kisses him on the mouth, a woman hopelessly in love. She is turned to go, but she is held back by Don; then, to prevent her moist eyes from being seen by him, she turns and hurries into the entrance hall. Don is turned toward by Wick, who has followed Helen to the entrance hall. Helen quickly comes out, takes a handkerchief from her bag, and Wick is hurried past into the hall by her. Hat in hand, Wick stands holding the door open, then shuts the door behind him as he goes out. The door is rushed to by Don, and his ear is pressed against it to hear what Wick and Helen are saying outside. The passage is narrow and simple, with a light bracket always burning every so often down the stair. A skylight, somewhat obscured by dirt and dust, lights the fourth floor back. A few steps are descended by them, and Helen's arm is quickly taken by Wick as they continue down the stairs. At the door, Don stands with panic on his face, wondering if the other two bottles have been discovered by his brother. The chain is put on the door by him to ensure his privacy, then the bathroom is dashed into. He rushes in, takes a nail file, kneels beside the grille of a register in the side wall, pries it open with the file, looks inside, puts his hand in, looks at the hole wide-eyed, pushes the grille back, and runs out. Then he runs in, goes to the couch, pulls it away from the wall, throws himself on his belly on the couch, and reaches under the side of it towards the wall. His hand is explored among the springs. Up he sits with a face covered in sweat, takes out his handkerchief, and wipes his face. Just then, from the direction of the entrance door, there is the noise of a key turning in the lock. The door is opened as far as the chain will allow, stopping with a sharp bite of metal on wood."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Helen and Wick watch Don, whose face softens into an innocent grin when he meets Helen's distressed eyes. Wick untwists the bottle's string and moves toward the kitchenette. Don follows him with a stubborn smile. At the sink, Wick opens the bottle and empties the whiskey, leaving Helen acutely embarrassed. Don watches as if witnessing the execution of a close friend but remains nonchalant for Helen. Afterward, Wick places the empty bottle in the sink, shrugs, and heads to the hall for his hat. Helen kisses him, hopelessly in love, but Don holds her back momentarily. She hastily leaves to conceal her tears. Wick turns to Don, who has followed Helen. Helen quickly emerges, takes a handkerchief from her bag, and hurries past Wick into the hall. Wick, holding his hat, exits, shutting the door. Don, panicked, presses his ear to the door, straining to hear Wick and Helen outside. The passage is narrow, lit by a dim light and a skylight obscured by dust. Descending a few steps, Wick takes Helen's arm as they continue down. Don, worried his brother discovered the other bottles, chains the door and rushes to the bathroom. He grabs a nail file, pries open a register grille, searches inside, and then replaces it. He moves the couch away from the wall, reaches underneath, and his sweaty face shows panic. Suddenly, there's the sound of a key in the lock, and the door opens as far as the chain allows, stopping sharply."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Helen and Wick watch Don, who smiles innocently at Helen while she looks distressed. Wick, holding a bottle, moves to the kitchenette. Don follows him with a stubborn smile. At the sink, Wick empties the whiskey into the drain. Helen follows, embarrassed. Don watches as if witnessing a friend's execution, maintaining his nonchalant expression under Helen's gaze. Wick discards the bottle, retrieves his hat, and Helen kisses him, showing her love. As she turns to leave, Don holds her back, but she avoids showing her tears and hurries into the entrance hall. Wick and Don follow her to the entrance. Helen exits, taking a handkerchief, and Wick leaves, closing the door. Don listens at the door, worried Wick has found more bottles. Securing the door chain for privacy, Don rushes to the bathroom, pries open a register grille with a nail file, checks inside, and quickly closes it. He moves to the couch, reaches under it, and searches, sweating. He wipes his face just as the door is unlocked, stopped by the chain with a sharp noise."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Helen and Wick quietly observe Don, who gradually lets his face soften into an innocent grin as his eyes meet Helen’s distressed gaze. Meanwhile, Helen’s expression remains full of infinite distress. Wick, having twisted off the string from the bottle, confidently grasps it in his hand and walks through the living room towards the small kitchenette. Don, watching Wick leave, stubbornly maintains a smile on his lips and decides to follow him. Wick proceeds directly to the sink, unscrews the cap of the bottle, turns it completely upside down, and watches as the whiskey starts to flow out steadily. Helen follows behind them, feeling acutely embarrassed by the situation. As Don and Helen reach the threshold between the living room and the kitchenette, they both stand there watching. Don has the sensation of witnessing the execution of a very dear friend, yet with Helen’s eyes fixed upon him, he manages to keep his expression nonchalant. Once the bottle is entirely emptied of its contents, Wick places it in the sink, shrugs nonchalantly, and makes his way to the hall to fetch his hat. Helen, unable to hide her emotions, kisses him deeply on the mouth, as a woman hopelessly in love might do. She turns to leave, but Don grabs her gently, and to prevent him from seeing her tear-filled eyes, she quickly turns away and hurries into the entrance hall. Wick turns his attention toward Don, who has trailed behind Helen into the entrance hall. Helen quickly comes back out, retrieves a handkerchief from her purse, and hastily moves past Wick into the hallway. Wick stands there, holding his hat in one hand, propping the door open for her, and eventually steps out, shutting the door firmly behind him. Don urgently rushes over to the door, pressing his ear against it, straining to hear the conversation Wick and Helen might be having outside. The passage outside their door is narrow and unadorned, with a light bracket casting a dim illumination every few steps down the stairway. A skylight, partly shrouded with layers of grime and dust, faintly lights the back of the fourth floor. As they descend several steps, Wick quickly takes hold of Helen’s arm, and they continue down the stairs together. Inside, Don anxiously stands by the door, his face etched with panic, as he wonders whether his brother has stumbled upon the other two bottles he has hidden. Ensuring his privacy, he puts the chain on the door, then rushes into the bathroom. Inside, Don frantically grabs a nail file, kneels beside a register grille set in the side wall, pries it open with the file, peers inside wide-eyed, inserts his hand, and then hurriedly pushes the grille back into place before running out. He bolts back into the room, drags the couch away from the wall, throws himself belly-down on it, and reaches under towards the wall, his hand searching feverishly among the springs. Breathless, he sits up, his face drenched in sweat. He fumbles for a handkerchief and wipes his face anxiously. Suddenly, from the direction of the entrance door, he hears the sound of a key being turned in the lock. The door swings open, halted as far as the chain will permit, stopping with a sharp, metallic clink against the wood."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Helen and Wick find themselves quietly observing Don, who slowly allows his face to transform into an innocent, almost naïve grin as his eyes lock with Helen’s troubled gaze. In contrast, Helen’s expression remains unchanging, filled with profound and infinite distress. Wick, having carefully twisted off the string from the bottle, holds it with confidence in his hand and makes his way through the living room toward the small kitchenette. As Don watches Wick leave, he obstinately maintains a smile on his lips and makes the decision to follow him. Wick walks directly to the sink, unscrews the cap of the bottle with deliberate motions, turns it completely upside down, and observes as the whiskey begins to pour out in a steady flow. Helen, feeling deeply embarrassed by the unfolding situation, trails behind them. As Don and Helen reach the threshold between the living room and the kitchenette, they both stand silently, observing. Don experiences a sensation akin to witnessing the execution of a cherished friend, yet with Helen’s gaze fixed intently upon him, he manages to maintain a nonchalant expression. Once the bottle is thoroughly emptied of its contents, Wick places it in the sink without ceremony, shrugs with a casual air, and heads to the hall to retrieve his hat. Helen, unable to conceal her emotions, kisses him deeply and passionately on the mouth, as a woman hopelessly in love might do. She turns to leave, but Don gently grabs her, and to prevent him from seeing her eyes brimming with tears, she quickly turns away and hurries into the entrance hall. Wick refocuses his attention on Don, who has followed behind Helen into the entrance hall. Helen quickly returns, retrieves a handkerchief from her purse, and moves past Wick into the hallway with haste. Wick stands there, his hat held in one hand, propping the door open for her, and eventually steps out, closing the door firmly behind him. Don, driven by urgency, rushes over to the door, pressing his ear against it and straining to hear the conversation that Wick and Helen might be having just outside. The passageway outside their door is narrow and unadorned, with a light bracket casting a dim illumination every few steps down the stairway. A skylight, partly obscured by layers of grime and dust, faintly illuminates the back of the fourth floor. As they descend several steps, Wick quickly takes hold of Helen’s arm, and together they continue their descent down the stairs. Inside, Don stands by the door, anxiety etched deeply on his face as he wonders whether his brother has discovered the other two bottles he has hidden. Ensuring his privacy, he secures the chain on the door, then rushes into the bathroom. Inside, Don frantically grabs a nail file, kneels beside a register grille set in the side wall, pries it open with the file, peers inside with wide eyes, inserts his hand, and then hurriedly pushes the grille back into place before running out. He bolts back into the room, drags the couch away from the wall, throws himself belly-down on it, and reaches under towards the wall, his hand searching feverishly among the springs. Breathless, he sits up, his face drenched in sweat, and fumbles for a handkerchief to wipe his face anxiously. Suddenly, from the direction of the entrance door, he hears the distinct sound of a key being turned in the lock. The door swings open, halting as far as the chain allows, stopping with a sharp, metallic clink against the wooden frame."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Helen and Wick stand observing Don, who quickly transforms his expression into an innocent grin when his eyes lock with Helen's distressed gaze. Meanwhile, Wick deftly twists the string off the bottle, grips it firmly in his hand, and strides purposefully from the living room into the kitchenette. Don's gaze follows Wick's movements, and with a stubborn smile adorning his lips, he decides to trail behind him. Wick approaches the sink, opens the bottle with a deliberate motion, and inverts it, allowing the whiskey to flow freely until the bottle is drained completely. Helen, feeling a wave of acute embarrassment, follows them, arriving at the living room doorway beside Don, both now standing quietly and watching the scene. Don experiences the sensation of watching a close friend meet an untimely end but manages to maintain a nonchalant expression, aware of Helen's scrutinizing eyes. When the bottle is emptied, Wick casually deposits it in the sink, gives a slight shrug, and moves towards the hallway to retrieve his hat. Helen approaches Wick, kisses him on the mouth with the air of a woman desperately in love, and turns to depart, but Don halts her briefly. To conceal her tear-filled eyes, she quickly turns and rushes into the entrance hall. Wick pivots to face Don, who has instinctively followed Helen to the entrance hall. Helen emerges swiftly, retrieves a handkerchief from her bag, and briskly walks past Wick into the hall. Wick, standing with his hat in hand, holds the door ajar, then exits, ensuring the door is securely shut behind him. Don reacts immediately, rushing to the door and pressing his ear against it, straining to catch snippets of Wick and Helen's conversation outside. The passageway is narrow and unadorned, illuminated intermittently by a light bracket, with a skylight faintly lighting the fourth floor through a veil of dirt and dust. As Wick and Helen descend a few steps, Wick takes her arm gently, guiding her down the stairs. Don, standing by the door with panic etched across his face, frets over whether his brother has discovered the other two bottles. To safeguard his privacy, he chains the door and then dashes into the bathroom. Once inside, Don swiftly grabs a nail file, kneels beside the register's grille on the side wall, pries it open, cautiously peers inside, inserts his hand wide-eyed, then replaces the grille before sprinting back out. He rushes to the living room, drags the couch away from the wall, throws himself facedown on it, and reaches underneath, groping among the springs in search of hidden items. Exhausted, he sits up, sweat glistening on his face, and uses his handkerchief to dab it away. Just then, a sudden sound of a key turning in the lock at the entrance door reaches his ears, followed by the door opening as far as the chain will allow, halting abruptly with a sharp metallic clank against the wood."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Helen and Wick observe Don, whose expression shifts to an innocent grin as he meets Helen's distressed gaze. Wick, having removed the string from the bottle, moves through the living room into the kitchenette with Don following. At the sink, Wick empties the whiskey bottle while Don and an embarrassed Helen watch from the doorway. Despite feeling like he's witnessing the loss of a dear friend, Don maintains his nonchalant demeanor under Helen's scrutiny. After the bottle is emptied, Wick discards it, shrugs, and heads to the hall for his hat. Helen, deeply in love, kisses him before turning to leave. Don holds her back momentarily, prompting her to hurry into the entrance hall to conceal her tearful eyes. Wick turns to Don, who has followed Helen, watching as she quickly retrieves a handkerchief and hurries out past Wick, who exits, closing the door behind him. Don listens intently at the door for their conversation, feeling panicked about his hidden whiskey. Ensuring privacy, he secures the door chain and rushes to the bathroom. There, he uses a nail file to open a register grille, but upon inspecting the cavity, he finds it empty and hurriedly replaces the grille. Moving to the couch, he pulls it from the wall and frantically reaches under it, searching among the springs. Overcome by anxiety, he wipes his sweaty face as the sound of a key turning in the lock interrupts him, the door opening only as far as the chain permits."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Helen and Wick watch Don, and Don's face relaxes into an innocent grin as his eyes meet Helen's, while hers are infinitely distressed. Wick has twisted the string off the whiskey bottle, a common practice to ensure a fast pour, and, with the bottle in his hand, moves through the living room toward the kitchenette, a small cooking area often found in compact apartments. Don looks after him and then follows him, a stubborn smile on his lips that barely conceals his underlying tension. Wick steps to the sink, opens the bottle, turns it upside down, and lets the whiskey, an expensive single malt known for its smoky flavor, run out. Helen trails after them, acutely embarrassed by this sudden waste. Don and Helen reach the doorway from the living room and stand watching. Don feels as though he is watching the execution of a very good friend, but with Helen's eyes on him, he maintains his nonchalant expression. Once the bottle is emptied, Wick places it in the sink, shrugs indifferently, and goes to the hall for his hat, an old Fedora which he wears daily. Helen kisses him on the mouth, a woman hopelessly in love despite the tension in the air. She turns to go, but Don holds her back; then, to prevent him from seeing her moist eyes, she turns and hurries into the entrance hall. Wick turns toward Don, who has followed Helen to the entrance hall, aware of the complex dynamics between the three of them. Helen comes quickly out, takes a handkerchief from her bag, a small embroidered item she always carries, and hurries past Wick into the hall. Wick stands, hat in hand, holding the door open, then goes out, shutting the door behind him with finality. Don rushes to the door, pressing his ear against it to hear what Wick and Helen are saying outside. The passage is narrow and simple, with a light bracket always burning every so often down the stair, providing a dim and consistent glow. A skylight, somewhat obscured by dirt and dust left from years of neglect, lights the fourth floor back, casting faint shadows. They descend a few steps, and Wick quickly takes Helen's arm as they continue down the stairs, a gesture of protection and urgency. Don stands at the door, panic on his face, wondering if his brother has discovered the other two bottles hidden for emergencies. He puts the chain on the door to ensure his privacy, then dashes into the bathroom, a small, cluttered space. Don rushes in, takes a nail file, kneels beside the grille of a register in the side wall, pries it open with the file, looks inside, puts his hand in, looks at the hole wide-eyed at its emptiness, pushes the grille back, and runs out. He then runs in, goes to the couch, pulls it away from the wall, throws himself on his belly on the couch, and reaches under the side of it towards the wall. His hand explores among the springs, the traditional spot for secret hiding places. He sits up with a face covered in sweat, takes out his handkerchief, and wipes his face, drying the evidence of his mounting anxiety. Just then, from the direction of the entrance door, there is the noise of a key being turned in the lock. The door opens as far as the chain will allow, stopping with a sharp bite of metal on wood, a sound that echoes ominously in the still room."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He sits up with a face covered in sweat takes out his handkerchief and wipes his face Helen and Wick watch Don and Don's face relaxes into an innocent grin as his eyes meet Helen's while hers are infinitely distressed He then runs in goes to the couch pulls it away from the wall throws himself on his belly on the couch and reaches under the side of it towards the wall Wick has twisted the string off the bottle and with the bottle in his hand moves through the living room toward the kitchenette Don rushes in takes a nail file kneels beside the grille of a register in the side wall pries it open with the file looks inside puts his hand in looks at the hole wideeyed pushes the grille back and runs out Don looks after him and then follows him a stubborn smile on his lips Wick steps to the sink opens the bottle turns it upside down and let us the whiskey run out Helen trails after them acutely embarrassed Wick steps to the sink opens the bottle turns it upside down and let us the whiskey run out Helen and Wick watch Don and Don's face relaxes into an innocent grin as his eyes meet Helen's while hers are infinitely distressed Don rushes to the door pressing his ear against it to hear what Wick and Helen are saying outside Don and Helen reach the doorway from the living room and stand watching Don feels as though he is watching the execution of a very good friend but with Helen's eyes on him he maintains his nonchalant expression Once the bottle is emptied Wick puts it in the sink shrugs and goes to the hall for his hat Helen trails after them acutely embarrassed Helen kisses him on the mouth a woman hopelessly in love They descend a few steps and Wick quickly takes Helen's arm as they continue down the stairs She turns to go but Don holds her back then to prevent him from seeing her moist eyes she turns and hurries into the entrance hall Wick stands hat in hand holding the door open then goes out shutting the door behind him Wick turns toward Don who has followed Helen to the entrance hall Helen comes quickly out takes a handkerchief from her bag and hurries past Wick into the hall Helen kisses him on the mouth a woman hopelessly in love Wick stands hat in hand holding the door open then goes out shutting the door behind him Don rushes to the door pressing his ear against it to hear what Wick and Helen are saying outside Once the bottle is emptied Wick puts it in the sink shrugs and goes to the hall for his hat The passage is narrow and simple with a light bracket always burning every so often down the stair A skylight somewhat obscured by dirt and dust lights the fourth floor back They descend a few steps and Wick quickly takes Helen's arm as they continue down the stairs Don stands at the door panic on his face wondering if his brother has discovered the other two bottles Just then from the direction of the entrance door there is the noise of a key being turned in the lock Don looks after him and then follows him a stubborn smile on his lips He puts the chain on the door to ensure his privacy then dashes into the bathroom Don rushes in takes a nail file kneels beside the grille of a register in the side wall pries it open with the file looks inside puts his hand in looks at the hole wideeyed pushes the grille back and runs out He then runs in goes to the couch pulls it away from the wall throws himself on his belly on the couch and reaches under the side of it towards the wall His hand explores among the springs He sits up with a face covered in sweat takes out his handkerchief and wipes his face Just then from the direction of the entrance door there is the noise of a key being turned in the lock The door opens as far as the chain will allow stopping with a sharp bite of metal on wood"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Helen and Wick watch Don and Don's face relaxes into an innocent grin as his eyes meet Helen's while hers are infinitely distressed. Wick has twisted the string off the bottle and with the bottle in his hand moves through the living room toward the kitchenette. Don looks after him and then follows him a stubborn smile on his lips. Wick steps to the sink opens the bottle turns it upside down and let us the whiskey run out. Helen trails after them acutely embarrassed. Don and Helen reach the doorway from the living room and stand watching. Don feels as though he is watching the execution of a very good friend but with Helen's eyes on him he maintains his nonchalant expression. Once the bottle is emptied Wick puts it in the sink shrugs and goes to the hall for his hat. Helen kisses him on the mouth a woman hopelessly in love. She turns to go but Don holds her back. then to prevent him from seeing her moist eyes she turns and hurries into the entrance hall. Wick turns toward Don who has followed Helen to the entrance hall. Helen comes quickly out takes a handkerchief from her bag and hurries past Wick into the hall. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Wick stands hat in hand holding the door open then goes out shutting the door behind him. Don rushes to the door pressing his ear against it to hear what Wick and Helen are saying outside. The passage is narrow and simple with a light bracket always burning every so often down the stair. A skylight somewhat obscured by dirt and dust lights the fourth floor back. They descend a few steps and Wick quickly takes Helen's arm as they continue down the stairs. Don stands at the door panic on his face wondering if his brother has discovered the other two bottles. He puts the chain on the door to ensure his privacy then dashes into the bathroom. Don rushes in takes a nail file kneels beside the grille of a register in the side wall pries it open with the file looks inside puts his hand in looks at the hole wideeyed pushes the grille back and runs out. He then runs in goes to the couch pulls it away from the wall throws himself on his belly on the couch and reaches under the side of it towards the wall. His hand explores among the springs. He sits up with a face covered in sweat takes out his handkerchief and wipes his face. Just then from the direction of the entrance door there is the noise of a key being turned in the lock. The door opens as far as the chain will allow stopping with a sharp bite of metal on wood."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Helen and Wick watch Don and Don's face relaxes into an innocent grin as his eyes meet Helen's while hers are infinitely distressed. Wick has twisted the string off the bottle and with the bottle in his hand moves through the living room toward the kitchenette. Don looks after him and then follows him a stubborn smile on his lips. Wick steps to the sink opens the bottle turns it upside down and let us the whiskey run out. Helen trails after them acutely embarrassed. Don and Helen reach the doorway from the living room and stand watching. Don feels as though he is watching the execution of a very good friend but with Helen's eyes on him he maintains his nonchalant expression. Once the bottle is emptied Wick puts it in the sink shrugs and goes to the hall for his hat. Helen kisses him on the mouth a woman hopelessly in love. She turns to go but Don holds her back. then to prevent him from seeing her moist eyes she turns and hurries into the entrance hall. Wick turns toward Don who has followed Helen to the entrance hall. Helen comes quickly out takes a handkerchief from her bag and hurries past Wick into the hall. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Wick stands hat in hand holding the door open then goes out shutting the door behind him. Don rushes to the door pressing his ear against it to hear what Wick and Helen are saying outside. The passage is narrow and simple with a light bracket always burning every so often down the stair. A skylight somewhat obscured by dirt and dust lights the fourth floor back. They descend a few steps and Wick quickly takes Helen's arm as they continue down the stairs. Don stands at the door panic on his face wondering if his brother has discovered the other two bottles. He puts the chain on the door to ensure his privacy then dashes into the bathroom. Don rushes in takes a nail file kneels beside the grille of a register in the side wall pries it open with the file looks inside puts his hand in looks at the hole wideeyed pushes the grille back and runs out. He then runs in goes to the couch pulls it away from the wall throws himself on his belly on the couch and reaches under the side of it towards the wall. His hand explores among the springs. He sits up with a face covered in sweat takes out his handkerchief and wipes his face. Just then from the direction of the entrance door there is the noise of a key being turned in the lock. The door opens as far as the chain will allow stopping with a sharp bite of metal on wood."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Helen and Wick watch Don and Don's face relaxes into an innocent grin as his eyes meet Helen's while hers are infinitely distressed. Wick has twisted the string off the bottle and with the bottle in his hand moves through the living room toward the kitchenette. Don looks after him and then follows him a stubborn smile on his lips. Wick steps to the sink opens the bottle turns it upside down and let us the whiskey run out. Helen trails after them acutely embarrassed. Don and Helen reach the doorway from the living room and stand watching. Don feels as though he is watching the execution of a very good friend but with Helen's eyes on him he maintains his nonchalant expression. Don rushes in takes a nail file kneels beside the grille of a register in the side wall pries it open with the file looks inside puts his hand in looks at the hole wideeyed pushes the grille back and runs out. He then runs in goes to the couch pulls it away from the wall throws himself on his belly on the couch and reaches under the side of it towards the wall. His hand explores among the springs. He sits up with a face covered in sweat takes out his handkerchief and wipes his face. Just then from the direction of the entrance door there is the noise of a key being turned in the lock. The door opens as far as the chain will allow stopping with a sharp bite of metal on wood."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Helen and Wick watch Don and Don's face relaxes into an innocent grin as his eyes meet Helen's while hers are infinitely distressed. Wick has twisted the string off the bottle and with the bottle in his hand moves through the living room toward the kitchenette. Don looks after him and then follows him a stubborn smile on his lips. He sits up with a face covered in sweat takes out his handkerchief and wipes his face. Just then from the direction of the entrance door there is the noise of a key being turned in the lock. The door opens as far as the chain will allow stopping with a sharp bite of metal on wood."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Milo and Juno watch Sam, and Sam's face relaxes into an innocent grin as his eyes meet Milo's, while hers are infinitely distressed. Juno has twisted the string off the bottle and, with the bottle in his hand, moves through the living room toward the kitchenette. Sam looks after him and then follows him, a stubborn smile on his lips. Juno steps to the sink, opens the bottle, turns it upside down, and lets the whiskey run out. Milo trails after them, acutely embarrassed. Sam and Milo reach the doorway from the living room and stand watching. Sam feels as though he is watching the execution of a very good friend, but with Milo's eyes on him, he maintains his nonchalant expression. Once the bottle is emptied, Juno puts it in the sink, shrugs, and goes to the hall for his hat. Milo kisses him on the mouth, a woman hopelessly in love. She turns to go, but Sam holds her back; then, to prevent him from seeing her moist eyes, she turns and hurries into the entrance hall. Juno turns toward Sam, who has followed Milo to the entrance hall. Milo comes quickly out, takes a handkerchief from her bag, and hurries past Juno into the hall. Juno stands, hat in hand, holding the door open, then goes out, shutting the door behind him. Sam rushes to the door, pressing his ear against it to hear what Juno and Milo are saying outside. The passage is narrow and simple, with a light bracket always burning every so often down the stair. A skylight, somewhat obscured by dirt and dust, lights the fourth floor back. They descend a few steps, and Juno quickly takes Milo's arm as they continue down the stairs. Sam stands at the door, panic on his face, wondering if his brother has discovered the other two bottles. He puts the chain on the door to ensure his privacy, then dashes into the bathroom. Sam rushes in, takes a nail file, kneels beside the grille of a register in the side wall, pries it open with the file, looks inside, puts his hand in, looks at the hole wide-eyed, pushes the grille back, and runs out. He then runs in, goes to the couch, pulls it away from the wall, throws himself on his belly on the couch, and reaches under the side of it towards the wall. His hand explores among the springs. He sits up with a face covered in sweat, takes out his handkerchief, and wipes his face. Just then, from the direction of the entrance door, there is the noise of a key being turned in the lock. The door opens as far as the chain will allow, stopping with a sharp bite of metal on wood."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Helen and Wick watch Don, and Don's face relaxes into an innocent grin as his eyes meet Helen's, while hers are infinitely distressed. Wick has twisted the cap off the jar and, with the jar in his hand, moves through the conservatory toward the pantry. Don looks after him and then follows him, a stubborn smile on his lips. Wick steps to the tub, opens the jar, turns it upside down, and lets the tea run out. Helen trails after them, acutely embarrassed. Don and Helen reach the doorway from the conservatory and stand watching. Don feels as though he is watching the retirement of a very good friend, but with Helen's eyes on him, he maintains his nonchalant expression. Once the jar is emptied, Wick puts it in the tub, shrugs, and goes to the foyer for his coat. Helen kisses him on the cheek, a woman hopelessly in love. She turns to go, but Don holds her back; then, to prevent him from seeing her misty eyes, she turns and hurries into the vestibule. Wick turns toward Don, who has followed Helen to the vestibule. Helen comes quickly out, takes a napkin from her pouch, and hurries past Wick into the foyer. Wick stands, coat in hand, holding the door open, then goes out, shutting the door behind him. Don rushes to the door, pressing his ear against it to hear what Wick and Helen are saying outside. The corridor is narrow and simple, with a candle holder always burning every so often down the stair. A porthole, somewhat obscured by dirt and dust, lights the fourth floor back. They descend a few steps, and Wick quickly takes Helen's arm as they continue down the stairs. Don stands at the door, panic on his face, wondering if his brother has discovered the other two jars. He puts the latch on the door to ensure his privacy, then dashes into the washroom. Don rushes in, takes a screwdriver, kneels beside the mesh of a vent in the side wall, pries it open with the screwdriver, looks inside, puts his hand in, looks at the hole wide-eyed, pushes the mesh back, and runs out. He then runs in, goes to the ottoman, pulls it away from the wall, throws himself on his belly on the ottoman, and reaches under the side of it towards the wall. His hand explores among the coils. He sits up with a face covered in sweat, takes out his napkin, and wipes his face. Just then, from the direction of the entrance door, there is the noise of a key being turned in the lock. The door opens as far as the latch will allow, stopping with a sharp bite of metal on wood."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Helen and Wick observe Don, and Don's face transforms into an innocent grin as his eyes align with Helen's, while hers are infinitely distressed. Wick has torn the string off the bottle and, with the bottle in his hand, ambles through the living room toward the kitchenette. Don gazes after him and then trails him, a stubborn smile on his lips. Wick steps to the sink, unseals the bottle, flips it upside down, and lets the whiskey spill out. Helen saunters after them, acutely embarrassed. Don and Helen stop at the doorway from the living room and stand observing. Don feels as though he is witnessing the dismissal of a very good friend, but with Helen's eyes on him, he maintains his nonchalant expression. Once the bottle is emptied, Wick tosses it in the sink, shrugs, and drifts to the hall for his hat. Helen embraces him on the mouth, a woman hopelessly in love. She pivots to leave, but Don catches her; then, to shield him from seeing her moist eyes, she spins and bolts into the entrance hall. Wick turns toward Don, who has trailed Helen to the entrance hall. Helen emerges briskly, retrieves a handkerchief from her bag, and rushes past Wick into the hall. Wick stands, hat in hand, propping the door open, then exits, sealing the door behind him. Don dashes to the door, pressing his ear against it to listen to what Wick and Helen are whispering outside. The passage is narrow and simple, with a light bracket perpetually glowing every so often down the stair. A skylight, somewhat obscured by grime and dust, brightens the fourth floor back. They descend a few steps, and Wick swiftly takes Helen's arm as they progress down the stairs. Don stands at the door, anxiety on his face, pondering if his brother has uncovered the other two bottles. He secures the chain on the door to ensure his privacy, then scurries into the bathroom. Don charges in, takes a nail file, kneels beside the grille of a register in the side wall, pries it open with the file, examines inside, inserts his hand, gazes at the hole wide-eyed, slides the grille back, and sprints out. He then rushes in, approaches the couch, heaves it away from the wall, hurls himself on his belly on the couch, and reaches under the side of it toward the wall. His hand rummages among the springs. He sits up with a face bathed in sweat, retrieves his handkerchief, and wipes his face. Just then, from the direction of the entrance door, there is the sound of a key being rotated in the lock. The door opens as far as the chain will allow, halting with a sharp contact of metal on wood."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Margaret and Finn observe Joe, and Joe's shoulder relaxes into an innocent grin as his elbows meet Margaret’s, while hers are infinitely distressed. Finn has twisted the rope off the jar and, with the jar in his toe, moves through the bedroom toward the pantry. Joe looks after him and then follows him, a stubborn smile on his knees. Finn steps to the bathtub, opens the jar, turns it upside down, and lets the cider run out. Margaret trails after them, acutely embarrassed. Joe and Margaret reach the gateway from the bedroom and stand watching. Joe feels as though he is watching the execution of a very good ally, but with Margaret's elbows on him, he maintains his nonchalant expression. Once the jar is emptied, Finn puts it in the bathtub, shrugs, and goes to the porch for his scarf. Margaret hugs him on the nose, a woman hopelessly in admiration. She turns to go, but Joe holds her back; then, to prevent him from seeing her moist elbows, she turns and hurries into the entrance garden. Finn turns toward Joe, who has followed Margaret to the entrance garden. Margaret comes quickly out, takes a notebook from her pocket, and hurries past Finn into the porch. Finn stands, scarf in toe, holding the gate open, then goes out, shutting the gate behind him. Joe rushes to the gate, pressing his eyebrow against it to hear what Finn and Margaret are saying outside. The tunnel is narrow and simple, with a candle holder always burning every so often down the stair. A ventilator, somewhat obscured by dirt and dust, lights the fifth floor back. They descend a few steps, and Finn quickly takes Margaret’s hand as they continue down the stairs. Joe stands at the gate, panic on his shoulder, wondering if his cousin has discovered the other two jars. He puts the padlock on the gate to ensure his privacy, then dashes into the kitchen. Joe rushes in, takes a screwdriver, kneels beside the frame of a vent in the side wall, pries it open with the screwdriver, looks inside, puts his toe in, looks at the hole wide-eyed, pushes the frame back, and runs out. He then runs in, goes to the shelf, pulls it away from the wall, throws himself on his belly on the shelf, and reaches under the side of it towards the wall. His toe explores among the coils. He sits up with a shoulder covered in sweat, takes out his notebook, and wipes his shoulder. Just then, from the direction of the entrance gate, there is the noise of a ring being turned in the lock. The gate opens as far as the padlock will allow, stopping with a sharp bite of metal on concrete."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Sylvia and Max observe Tim, and Tim's face contorts into a mischievous smirk as his eyes meet Sylvia's, while hers are endlessly puzzled. Max has yanked the ribbon off the package and, with the package in his hand, dances through the living room toward the dining area. Tim peers after him and then drifts behind him, a cheeky grin on his lips. Max strolls to the table, unwraps the package, flips it upside down, and lets the marbles spill out. Sylvia glides after them, visibly uncomfortable. Tim and Sylvia reach the doorway from the living room and stand observing. Tim feels as though he is observing the departure of a very close friend, but with Sylvia's eyes on him, he projects a carefree demeanor. Once the package is emptied, Max places it on the table, sighs, and goes to the hallway for his coat. Sylvia hugs him on the shoulder, a woman hopelessly enamored. She turns to leave, but Tim draws her back; then, to keep him from seeing her teary eyes, she turns and rushes into the foyer. Max turns toward Tim, who has trailed Sylvia to the foyer. Sylvia comes briskly out, grabs a tissue from her bag, and rushes past Max into the hallway. Max stands, coat in hand, holding the door slightly ajar, then steps out, securing the door behind him. Tim races to the door, placing his ear against it to catch what Max and Sylvia are discussing outside. The corridor is tight and plain, with a lamp bracket eternally glowing every so often along the staircase. A roof window, somewhat obscured by grime and dust, illuminates the fourth floor back. They step down a few stairs, and Max swiftly takes Sylvia's hand as they continue down the staircase. Tim stands at the door, anxiety on his face, concerned if his cousin has found the other two packages. He fastens the chain on the door to ensure his solitude, then bolts into the kitchen. Tim dashes in, grabs a spoon, kneels beside the vent of a radiator in the side wall, pries it open with the spoon, peers inside, inserts his hand, looks at the gap wide-eyed, replaces the vent cover, and sprints out. He then races in, goes to the chair, drags it away from the wall, flings himself belly-down on the chair, and stretches under the side of it towards the wall. His hand searches among the cushions. He sits up with a face glistening with sweat, pulls out his tissue, and dabs his face. Just then, from the direction of the entrance door, there is the sound of a key turning in the lock. The door opens as far as the chain will permit, halting with a sharp clang of metal on wood."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Helen and Wick observe Don, and Don's face morphs into a mischievous smirk as his eyes connect with Helen’s, while hers are indescribably bewildered. Wick has ripped the ribbon from the jar and, with the jar in his hand, glides through the den toward the pantry. Don glances after him and then drifts in his wake, a defiant grin on his lips. Wick sidles up to the stove, uncaps the jar, flips it sideways, and lets the syrup spill out. Helen trails after them, profoundly mortified. Don and Helen pause at the threshold from the den and stand observing. Don feels as though he is observing the departure of a very close companion, but with Helen's gaze on him, he maintains his blasé demeanor. Once the jar is emptied, Wick places it in the stove, shrugs, and wanders to the corridor for his cap. Helen pecks him on the cheek, a woman helplessly infatuated. She pivots to leave, but Don holds her in place; then, to prevent him from seeing her misty eyes, she spins and dashes into the entryway. Wick turns toward Don, who has shadowed Helen to the entryway. Helen swiftly emerges, retrieves a tissue from her purse, and scuttles past Wick into the corridor. Wick stands, cap in hand, bracing the door open, then steps out, closing the door behind him. Don darts to the door, pressing his ear against it to catch what Wick and Helen are muttering outside. The alley is snug and plain, with a bulb flickering every so often down the stairwell. A ceiling window, somewhat fogged by grime, illuminates the rear of the fourth floor. They descend a few steps, and Wick swiftly grasps Helen's elbow as they proceed down the stairs. Don stands at the door, alarm on his face, pondering if his brother has uncovered the other two jars. He latches the chain on the door to secure his solitude, then sprints into the washroom. Don rushes in, grabs a paperclip, kneels beside the vent of a duct in the side wall, pries it open with the clip, peers inside, puts his hand in, gazes at the cavity wide-eyed, presses the vent back, and dashes out. He then bolts in, moves to the armchair, slides it away from the wall, sprawls on his stomach on the armchair, and stretches beneath the side of it towards the wall. His hand probes among the coils. He sits up with a face drenched in perspiration, takes out his tissue, and dabs his face. Just then, from the direction of the entry door, there is the sound of a latch being drawn in the lock. The door opens as far as the chain will permit, halting with a sharp clash of metal on wood."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Sylvia and Clive observe Max, and Max's expression morphs into a mischievous smirk as his gaze connects with Sylvia's, while hers are entirely amused. Clive has unwrapped the wrapper off the jar and, with the jar in his hand, strolls through the dining area toward the pantry. Max gazes after him and then trails him, an insolent chuckle on his lips. Clive shifts to the counter, cracks open the jar, flips it upside down, and lets the soda spill out. Sylvia shuffles after them, exceedingly amused. Max and Sylvia reach the doorway from the dining area and stand observing. Max feels as though he is witnessing the demise of a cherished pet, but with Sylvia's eyes on him, he sustains his carefree demeanor. Once the jar is emptied, Clive places it in the counter, shrugs, and heads to the porch for his scarf. Sylvia pecks him on the cheek, a lady irreversibly fascinated. She turns to leave, but Max restrains her; then, to stop him from noticing her radiant smile, she pivots and dashes into the porchway. Clive pivots toward Max, who has accompanied Sylvia to the porchway. Sylvia emerges quickly, grabs a tissue from her pocket, and hustles past Clive into the porch. Clive stands, scarf in hand, holding the gate ajar, then exits, closing the gate behind him. Max hurries to the gate, pressing his cheek against it to catch what Clive and Sylvia are discussing outside. The walkway is tight and elegant, with a sconce perpetually flickering every few steps along the corridor. A windowpane, somewhat obscured by grime and soot, illuminates the attic back. They descend a few steps, and Clive swiftly seizes Sylvia's elbow as they progress down the corridor. Max stands at the gate, anxiety on his expression, pondering if his cousin has uncovered the other two jars. He affixes the latch on the gate to secure his solitude, then bolts into the kitchen. Max dashes in, grabs a spoon, kneels beside the vent of a register in the base wall, pries it ajar with the spoon, peeks inside, places his hand in, gazes at the void wide-eyed, pushes the vent back, and sprints out. He then races in, heads to the armchair, shifts it away from the wall, lunges onto his belly on the armchair, and reaches under the side of it toward the wall. His fingers probe among the wires. He sits up with a face damp from anxiety, pulls out his tissue, and pats his forehead. Just then, from the direction of the porch gate, there is the sound of a latch being turned in the bolt. The gate opens as far as the latch will permit, halting with a sharp clatter of metal on wood."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Helen and Wick watch Don, whose expression shifts to a grin when he meets Helen's distressed eyes. Wick, holding a bottle, moves to the kitchenette, pours out its contents, and places it in the sink. Helen follows, embarrassed, while Don maintains a nonchalant look despite feeling upset. Wick retrieves his hat, and Helen, hopelessly in love, kisses him before rushing inside to hide her tears. Don follows Helen, listening anxiously at the door as Wick leaves. In a panic, Don wonders if his brother discovered the other hidden bottles. He secures the door chain for privacy and feverishly checks a register and under the couch for his stash, sweating profusely. Suddenly, he hears a key in the lock, and the door opens as far as the chain allows, stopping with a metallic sound."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The door opens as far as the chain will allow stopping with a sharp bite of metal on wood Just then from the direction of the entrance door there is the noise of a key being turned in the lock He sits up with a face covered in sweat takes out his handkerchief and wipes his face His hand explores among the springs He then runs in goes to the couch pulls it away from the wall throws himself on his belly on the couch and reaches under the side of it towards the wall Don rushes in takes a nail file kneels beside the grille of a register in the side wall pries it open with the file looks inside puts his hand in looks at the hole wideeyed pushes the grille back and runs out He puts the chain on the door to ensure his privacy then dashes into the bathroom Don stands at the door panic on his face wondering if his brother has discovered the other two bottles They descend a few steps and Wick quickly takes Helen's arm as they continue down the stairs A skylight somewhat obscured by dirt and dust lights the fourth floor back The passage is narrow and simple with a light bracket always burning every so often down the stair Don rushes to the door pressing his ear against it to hear what Wick and Helen are saying outside Wick stands hat in hand holding the door open then goes out shutting the door behind him Helen comes quickly out takes a handkerchief from her bag and hurries past Wick into the hall Wick turns toward Don who has followed Helen to the entrance hall then to prevent him from seeing her moist eyes she turns and hurries into the entrance hall She turns to go but Don holds her back Helen kisses him on the mouth a woman hopelessly in love Once the bottle is emptied Wick puts it in the sink shrugs and goes to the hall for his hat Don feels as though he is watching the execution of a very good friend but with Helen's eyes on him he maintains his nonchalant expression Don and Helen reach the doorway from the living room and stand watching Helen trails after them acutely embarrassed Wick steps to the sink opens the bottle turns it upside down and let us the whiskey run out Don looks after him and then follows him a stubborn smile on his lips Wick has twisted the string off the bottle and with the bottle in his hand moves through the living room toward the kitchenette Helen and Wick watch Don and Don's face relaxes into an innocent grin as his eyes meet Helen's while hers are infinitely distressed"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "A skylight somewhat obscured by dirt and dust lights the fourth floor back Helen comes quickly out takes a handkerchief from her bag and hurries past Wick into the hall She turns to go but Don holds her back The door opens as far as the chain will allow stopping with a sharp bite of metal on wood He puts the chain on the door to ensure his privacy then dashes into the bathroom Don feels as though he is watching the execution of a very good friend but with Helen's eyes on him he maintains his nonchalant expression Don and Helen reach the doorway from the living room and stand watching then to prevent him from seeing her moist eyes she turns and hurries into the entrance hall The passage is narrow and simple with a light bracket always burning every so often down the stair His hand explores among the springs Wick turns toward Don who has followed Helen to the entrance hall Don stands at the door panic on his face wondering if his brother has discovered the other two bottles Wick has twisted the string off the bottle and with the bottle in his hand moves through the living room toward the kitchenette Don rushes to the door pressing his ear against it to hear what Wick and Helen are saying outside He sits up with a face covered in sweat takes out his handkerchief and wipes his face Wick stands hat in hand holding the door open then goes out shutting the door behind him Don looks after him and then follows him a stubborn smile on his lips They descend a few steps and Wick quickly takes Helen's arm as they continue down the stairs Just then from the direction of the entrance door there is the noise of a key being turned in the lock Helen trails after them acutely embarrassed He then runs in goes to the couch pulls it away from the wall throws himself on his belly on the couch and reaches under the side of it towards the wall Once the bottle is emptied Wick puts it in the sink shrugs and goes to the hall for his hat Helen kisses him on the mouth a woman hopelessly in love Helen and Wick watch Don and Don's face relaxes into an innocent grin as his eyes meet Helen's while hers are infinitely distressed Wick steps to the sink opens the bottle turns it upside down and let us the whiskey run out Don rushes in takes a nail file kneels beside the grille of a register in the side wall pries it open with the file looks inside puts his hand in looks at the hole wideeyed pushes the grille back and runs out"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Wick stands hat in hand holding the door open then goes out shutting the door behind him Don rushes to the door pressing his ear against it to hear what Wick and Helen are saying outside The passage is narrow and simple with a light bracket always burning every so often down the stair A skylight somewhat obscured by dirt and dust lights the fourth floor back They descend a few steps and Wick quickly takes Helen's arm as they continue down the stairs Don stands at the door panic on his face wondering if his brother has discovered the other two bottles He puts the chain on the door to ensure his privacy then dashes into the bathroom Don rushes in takes a nail file kneels beside the grille of a register in the side wall pries it open with the file looks inside puts his hand in looks at the hole wideeyed pushes the grille back and runs out He then runs in goes to the couch pulls it away from the wall throws himself on his belly on the couch and reaches under the side of it towards the wall His hand explores among the springs He sits up with a face covered in sweat takes out his handkerchief and wipes his face Just then from the direction of the entrance door there is the noise of a key being turned in the lock The door opens as far as the chain will allow stopping with a sharp bite of metal on wood Helen and Wick watch Don and Don's face relaxes into an innocent grin as his eyes meet Helen's while hers are infinitely distressed Wick has twisted the string off the bottle and with the bottle in his hand moves through the living room toward the kitchenette Don looks after him and then follows him a stubborn smile on his lips Wick steps to the sink opens the bottle turns it upside down and let us the whiskey run out Helen trails after them acutely embarrassed Don and Helen reach the doorway from the living room and stand watching Don feels as though he is watching the execution of a very good friend but with Helen's eyes on him he maintains his nonchalant expression Once the bottle is emptied Wick puts it in the sink shrugs and goes to the hall for his hat Helen kisses him on the mouth a woman hopelessly in love She turns to go but Don holds her back then to prevent him from seeing her moist eyes she turns and hurries into the entrance hall Wick turns toward Don who has followed Helen to the entrance hall Helen comes quickly out takes a handkerchief from her bag and hurries past Wick into the hall"
        }
      ]
    }
  ]
}