{
  "ground_truth": "As he says that, a R.O.U.S comes flying at him from off-screen. The thing's teeth sink deep into his arm. Westley drives a fist into the beast's face, rolling it off. He reaches for his sword just a few feet away, but the R.O.U.S is back atop him. It's a fierce battle, and just when we think Westley can't possibly win, he flips the ugly rodent clear. Westley scrambles for his sword. The R.O.U.S. stampedes on, changing its target, heading right for Buttercup, and she's scared to death. And from somewhere they summon strength, pick up their pace, and as they reach the edge of the Fire Swamp, something we hadn't expected: Humperdinck on his horse, Rugen beside him. Three warriors, armed and ready, are mounted in formation behind. They stop. Buttercup looks beyond exhaustion. Westley looks worse. Behind Humperdinck are the waters of the bay. Westley and Buttercup are staring out at the others. Buttercup, looking from one to the other; then something else catches her eye, and we see an armed warrior, in shadow, with a loaded crossbow aimed at Westley's heart. Buttercup looks the other way. Another warrior has a crossbow aimed at Westley. Buttercup frantically stares around, and now a third warrior, crossbow stretched and ready to shoot, is hidden in a tree blocking any escape Westley might try. Humperdinck whirls to face her. Westley also whirls to face her. Buttercup talks to them both. Buttercup and Westley stare deep into each other's eyes. Westley is dazed. Buttercup tries to speak again, can't, and is swooped off her feet onto Humperdinck's horse, and off they go. Westley stares after her. Rugen watches as his warriors bring Westley to him. The Count has a heavy sword and holds it in his hand. Westley looks at him. Count Rugen clubs Westley hard across the skull. Westley starts to fall—the screen goes black. Dank and chill, underground and windowless, lit by flickering torches. Frightening. Westley lies in the center of the cage, chained and helpless. Dead pale, he silently enters the pit, carrying a tray of food and medication. He puts it down and begins tending Westley's wounds. Westley winces. From the Albino: a nod. From the Albino: a shake of the head. He studies Westley, whose face is almost sad. Buttercup's face is also sad. Pallid, perhaps ill, she wanders down a corridor in Florin Castle. As she moves unseeing past an intersecting corridor, Prince Humperdinck and Count Rugen watch her as they move on. The camera holds on it while we hear the Grandfather's voice reading. And if we thought it was packed before, we didn't know how many more could fit in this courtyard. Humperdinck, Rugen, and the Queen stand high on the balcony.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "As he states that, a R.O.U.S. comes soaring at him from off-screen. The creature's fangs embed deep into his limb. Westley rams a knuckle into the beast's visage, shifting it off. He reaches for his blade just a few feet away, but the R.O.U.S. is again atop him. It's a brutal clash, and just when we think Westley can't possibly triumph, he tosses the hideous vermin clear. Westley scrambles for his sword. The R.O.U.S. charges onward, altering its target, heading directly for Buttercup, and she's terrified to death. And from somewhere they summon vigor, pick up their stride, and as they reach the verge of the Fire Swamp, something we hadn't anticipated: Humperdinck on his steed, Rugen beside him. Three fighters, armed and prepared, are mounted in formation behind. They halt. Buttercup looks beyond fatigue. Westley looks worse. Behind Humperdinck are the waters of the bay. Westley and Buttercup are gazing out at the others. Buttercup, looking from one to the other; then something else attracts her gaze, and we see an armed warrior, in shadow, with a loaded crossbow targeted at Westley's heart. Buttercup looks the other way. Another warrior has a crossbow targeted at Westley. Buttercup frantically scans around, and now a third warrior, crossbow drawn and ready to fire, is concealed in a tree obstructing any escape Westley might attempt. Humperdinck pivots to confront her. Westley also pivots to confront her. Buttercup speaks to them both. Buttercup and Westley gaze deep into each other's eyes. Westley is stunned. Buttercup attempts to speak again, can't, and is whisked off her feet onto Humperdinck's horse, and off they go. Westley gazes after her. Rugen observes as his fighters bring Westley to him. The Count has a heavy blade and holds it in his hand. Westley gazes at him. Count Rugen strikes Westley hard across the skull. Westley begins to fall—the screen goes black. Damp and cold, subterranean and windowless, lit by flickering torches. Intimidating. Westley lies in the center of the cell, chained and powerless. Deathly pale, he silently enters the pit, bearing a tray of sustenance and medication. He sets it down and begins tending Westley's injuries. Westley flinches. From the Albino: a nod. From the Albino: a shake of the head. He examines Westley, whose face is almost mournful. Buttercup's face is also mournful. Wan, perhaps unwell, she meanders down a passage in Florin Castle. As she moves unseeing past an intersecting passage, Prince Humperdinck and Count Rugen observe her as they move on. The camera holds on it while we hear the Grandfather's voice narrating. And if we thought it was crowded before, we didn't know how many more could fit in this courtyard. Humperdinck, Rugen, and the Queen stand elevated on the balcony."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "As he says that, he is attacked by a R.O.U.S that comes flying at him from off-screen. Deep into his arm, the thing's teeth are sunk. A fist is driven by Westley into the beast's face, and it is rolled off. His sword, just a few feet away, is reached for by him, but he is topped again by the R.O.U.S. It's a fierce battle, and just when we think Westley can't possibly win, the ugly rodent is flipped clear by him. His sword is scrambled for by Westley. The R.O.U.S stampedes on, changing its target, and it heads right for Buttercup, scaring her to death. And strength is summoned by them from somewhere, their pace is picked up, and as the edge of the Fire Swamp is reached by them, something we hadn't expected appears: Humperdinck on his horse, with Rugen beside him. Behind, three warriors, armed and ready, mount in formation. They are stopped. Beyond exhaustion, Buttercup is looked by. Worse is looked by Westley. Behind them lie the waters of the bay. Out at the others, Westley and Buttercup are staring. From one to the other, Buttercup looks; then something else catches her eye, and an armed warrior is seen by us, in shadow, with a loaded crossbow aimed at Westley's heart. The other way is looked by Buttercup. A crossbow is aimed at Westley by another warrior. Around, Buttercup frantically stares, and now a third warrior, crossbow stretched and ready to shoot, hides in a tree blocking any escape Westley might try. She is faced by Humperdinck, who whirls. To face her, Westley also whirls. They are talked to by Buttercup. Into each other's eyes, Buttercup and Westley stare deeply. Dazed, Westley is. Buttercup tries to speak again, can't, and her feet are swooped off onto Humperdinck's horse, and they go off. After her, Westley stares. As his warriors bring Westley to him, Rugen watches. In his hand, the Count holds a heavy sword. Him, Westley looks at. Westley is clubbed hard across the skull by Count Rugen. Fall, Westley starts to— the screen goes black. Dank and chill, underground and windowless, it is lit by flickering torches. Frightening. Westley lies in the center of the cage, chained and helpless. Pale and dead, he silently enters the pit, carrying a tray of food and medication. It is put down by him, and Westley's wounds are tended to. Westley winces. A nod is given by the Albino. A shake of the head is given by the Albino. Westley, whose face is almost sad, is studied by him. Also sad is Buttercup's face. Perhaps ill, she is pallid, and down a corridor in Florin Castle, she wanders. As she unseeingly moves past an intersecting corridor, she is watched by Prince Humperdinck and Count Rugen as they move on. It is held by the camera while the Grandfather's voice is heard reading. And if we thought it was packed before, how many more could fit in this courtyard, we didn't know. Humperdinck, Rugen, and the Queen are stood high on the balcony."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "As he speaks, a R.O.U.S lunges at him from off-screen, biting his arm. Westley punches its face, rolling it off. He reaches for his sword nearby, but the R.O.U.S attacks again. In a fierce battle, Westley flips the rodent away and scrambles for his sword. The R.O.U.S charges toward Buttercup, scaring her. They find strength and race to the Fire Swamp's edge, unexpectedly encountering Humperdinck on horseback with Rugen and three armed warriors. They halt. Buttercup looks exhausted; Westley worse. Behind Humperdinck is the bay. Staring at them, Buttercup notices a shadowed warrior with a crossbow aimed at Westley's heart. She sees another warrior with a crossbow aimed at him, and a third, hidden in a tree, blocking any escape. Humperdinck and Westley turn to her. Buttercup tries to speak, fails, and is swept onto Humperdinck's horse. Westley watches her leave. Rugen observes as warriors capture Westley. The Count, sword in hand, hits Westley hard on the skull. He falls—everything goes black. Underground, lit by torches, Westley lies chained in a cage. Pale, a man enters, brings food and medication, and tends Westley's wounds. Westley winces. The Albino gives a nod and a shake of the head, studying Westley's sad face. Buttercup, also sad, wanders a Florin Castle corridor, passing Humperdinck and Rugen. The camera holds as the Grandfather's voice narrates. And if we thought it was crowded before, we realize the courtyard held even more. Humperdinck, Rugen, and the Queen stand on the high balcony."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A R.O.U.S attacks Westley, biting his arm. Westley punches it off, reaches for his sword, but the creature returns. He flips it away and grabs his sword. It charges at Buttercup, who's terrified. Reaching the Fire Swamp edge, they find Humperdinck, Rugen, and three armed warriors blocking them. Buttercup sees three crossbows aimed at Westley. Humperdinck and Westley turn to her. She tries to speak but is swept onto Humperdinck's horse. Westley watches her leave as Rugen's men capture him. Rugen strikes Westley, and he collapses. Underground, Westley is chained and tended by an Albino. Westley and Buttercup look sad. She wanders Florin Castle while Humperdinck and Rugen observe. The courtyard is packed as Humperdinck, Rugen, and the Queen stand on a balcony."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As he utters those words, a Rodent of Unusual Size, commonly referred to as a R.O.U.S, suddenly and violently launches itself at him from off-screen. The creature's sharp teeth sink deeply into his arm with a menacing bite. In response, Westley delivers a powerful punch to the creature's face, forcing it to roll off him. He quickly reaches out toward his sword, which is only a short distance of a few feet away. Before he can grasp it, the R.O.U.S regains its balance and is back on top of him. The struggle is intense and fierce, and just when it seems that Westley might not be able to prevail, he skillfully flips the hideous rodent away. Westley urgently scrambles to retrieve his sword. Meanwhile, the R.O.U.S charges forward, altering its course with a new target in sight, making its way toward Buttercup. She is utterly terrified. Summoning a surge of strength from within, they hasten their pace, and as they arrive at the edge of the ominous Fire Swamp, they are met with an unexpected sight: Humperdinck astride his horse, with Rugen at his side. Three more warriors, armed to the teeth and ready for battle, are mounted in formation behind them. They come to a halt. Buttercup appears to be beyond exhaustion, while Westley looks even worse. Behind Humperdinck, the waters of the bay stretch out. Westley and Buttercup find themselves gazing at the others. Buttercup's eyes shift from one person to the next, and then her attention is suddenly captured by something else: an armed warrior, shrouded in shadow, with a loaded crossbow aimed directly at Westley's heart. She turns her gaze the other way, only to see another warrior with a crossbow targeting Westley. Buttercup frantically glances around, and now a third warrior, hiding in a tree with a crossbow ready to fire, blocks any potential escape route Westley might contemplate. Humperdinck spins around to face her. Westley also turns to look at her. Buttercup speaks to them both. Westley and Buttercup lock eyes, staring deeply into each other's souls. Westley appears dazed and confused. Buttercup attempts to speak once more, but the words escape her, and suddenly she is swept off her feet and onto Humperdinck's horse, and away they go. Westley watches her departure with longing. Rugen observes as his warriors bring Westley before him. The Count holds a heavy sword firmly in his hand. Westley gazes at him intently. Count Rugen delivers a harsh blow across Westley's skull. As Westley begins to fall, the screen fades to black. It's cold and damp, deep underground, with no windows in sight, and lit only by flickering torches that create a frightening atmosphere. Westley lies in the center of the cage, helplessly chained. Pale and ghostly, a figure silently enters the pit, carrying a tray of food and medication. He sets it down and begins to tend to Westley's wounds. Westley winces in pain. The Albino gives a nod, then shakes his head. He studies Westley, whose face is almost melancholic. Buttercup's expression is sorrowful as well. Looking pallid, maybe even ill, she wanders aimlessly down a corridor within Florin Castle. As she moves, oblivious, past an intersecting corridor, Prince Humperdinck and Count Rugen observe her as they proceed onward. The camera lingers on this scene while we hear the Grandfather's voice narrating. Even when we thought it couldn't be more crowded, the courtyard proves to hold even more than we imagined. Humperdinck, Rugen, and the Queen stand prominently high on the balcony, overseeing all."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As those words escape his lips, a creature known as a Rodent of Unusual Size, or more commonly referred to as a R.O.U.S, emerges with unexpected speed and ferocity, launching itself at him from off-screen. The vicious creature's razor-sharp teeth sink deeply, with a menacing bite into his arm. In a swift response, Westley delivers a forceful and powerful punch directly to the creature's face, causing it to roll off him. Quickly, he extends his arm toward his sword, which lies temptingly close, just a few feet away. Yet, before his fingers can grasp it, the R.O.U.S regains its footing and pounces back on top of him. The ensuing struggle is intense and fiercely relentless, and just when it appears that Westley might be on the verge of being overcome, he deftly maneuvers to flip the grotesque rodent away from him. With urgency fueling his movements, Westley scrambles to retrieve his sword. Meanwhile, the R.O.U.S shifts its focus and charges forward, now setting its sights on a new target as it moves threateningly toward Buttercup, who is utterly paralyzed by terror. Summoning every ounce of remaining strength, they quicken their pace, and as they reach the ominous edge of the Fire Swamp, they find themselves confronted with a surprising and unexpected sight: Humperdinck astride his horse, with the ever-present Rugen by his side. Behind them, three additional warriors, each heavily armed and seemingly ready for battle, sit mounted in a formidable formation. They come to a sudden halt. Buttercup appears to be utterly drained of energy, while Westley looks even worse, as if on the brink of collapse. Beyond Humperdinck, the waters of the bay stretch out into the distance. Westley and Buttercup find themselves staring at the others. Buttercup's eyes flicker from one face to another, but then her attention is suddenly seized by something alarming: a warrior, cloaked in shadow, with a loaded crossbow aimed directly at Westley's heart. Desperately, she turns her gaze in another direction, only to find yet another warrior targeting Westley with a crossbow. Frantically, Buttercup glances around, and now a third warrior, hidden within the branches of a tree, has a crossbow poised and ready, blocking any conceivable escape route Westley might contemplate. Humperdinck spins around, facing her directly. Westley also turns to look at her. Buttercup attempts to address them both, but the words falter and escape her lips. Suddenly, she is abruptly swept off her feet and placed onto Humperdinck's horse, and with swift motion, they are off. Westley watches her departure with longing in his eyes. Rugen observes closely as his warriors bring Westley before him. The Count grips a heavy sword with firm resolve. Westley meets his gaze with intensity. Count Rugen lands a severe blow across Westley's skull, and as Westley begins to fall, the screen fades into darkness. The scene transitions to a cold and damp underground location, devoid of windows, where only flickering torches cast a dim, frightening glow. Westley lies at the center of the cage, helplessly chained in place. A ghostly pale figure enters the pit silently, carrying a tray laden with food and medication. He sets it down gently and begins tending to Westley's wounds. Westley winces, a grimace of pain crossing his face. The Albino offers a nod, then shakes his head, studying Westley closely, whose expression is almost melancholic. Buttercup's expression mirrors this sorrow, appearing desolate and forlorn. Looking pallid, perhaps even ill, she wanders aimlessly down a corridor within the imposing Florin Castle. Her movements are almost trance-like as she passes obliviously by an intersecting corridor, where Prince Humperdinck and Count Rugen watch her intently as they proceed onward. The camera lingers thoughtfully on this scene while the familiar voice of the Grandfather resumes narrating. Even as we assumed the space could not be more crowded, the courtyard reveals its capacity to hold far more than we ever imagined. Humperdinck, Rugen, and the Queen stand prominently high above on the balcony, overseeing the scene below with regal bearing."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As he utters those words, a Rodent of Unusual Size (R.O.U.S) suddenly leaps at him from off-screen, its body hurtling through the air with surprising speed and precision. The creature's sharp and menacing teeth sink deeply into his arm, causing an immediate jolt of pain. Reacting swiftly, Westley summons all his strength to drive his fist directly into the face of the beast, the impact forcing the creature to roll off him. Quickly assessing his situation, Westley reaches out for his sword, which lies tantalizingly close—only a few feet away—yet before he can grasp it, the persistent R.O.U.S is already back atop him, snarling and ready to attack again. A fierce battle ensues, with Westley and the rodent locked in a desperate struggle for survival. Just when it seems that Westley is on the brink of defeat, he manages to muster the energy to flip the ugly creature clear of his body. With determination, Westley scrambles to reclaim his sword, while the R.O.U.S shifts its focus, charging forward with feral ferocity towards Buttercup, who stands paralyzed by fear. As the couple gathers their strength from seemingly nowhere, they sprint towards the edge of the infamous Fire Swamp. The surprising sight awaiting them is that of Humperdinck on his horse, flanked by Count Rugen. The intimidating presence of three armed warriors, arranged in a battle-ready formation behind them, creates a formidable obstacle. This unexpected encounter brings them to a sudden halt. Buttercup's expression reflects utter exhaustion, yet Westley appears even more worn. Beyond Humperdinck, the expansive waters of the bay stretch out, a constant reminder of the peril that surrounds them. As Westley and Buttercup gaze out at their adversaries, Buttercup looks back and forth between them before her attention is abruptly captured by something else. In a startling reveal, an armed warrior cast in shadow emerges, a loaded crossbow aimed with lethal intent at Westley's heart. Panicked, Buttercup shifts her gaze in the opposite direction only to find another warrior poised with a similarly threatening crossbow also aimed at Westley. Desperation grows in her eyes as she searches frantically, her gaze finally uncovering a third warrior, his crossbow readied and lurking in a tree, effectively blocking any potential escape route for Westley. In response to the escalating tension, Humperdinck suddenly whirls around to face Buttercup. Almost simultaneously, Westley mirrors this action, turning to meet her gaze. Locked in a moment of intense connection, Buttercup speaks to both men, her words imbued with urgency. She and Westley share a profound, lingering eye contact, a silent communication passing between them. Westley, visibly dazed by the unfolding events, watches helplessly as Buttercup attempts to speak again, words failing her, before she is abruptly swept off her feet and onto Humperdinck's horse, and they ride off. Westley's eyes follow her, filled with a mix of longing and desperation. Meanwhile, Count Rugen observes as his warriors move in to seize Westley, bringing him forward. The Count grips a heavy sword, its weight resting ominously in his hand as he regards Westley with a steely gaze. Without warning, Count Rugen delivers a brutal blow with the sword, striking Westley hard across the skull, the force of which sends Westley into a downward spiral as the screen plunges into darkness. The scene transitions to a dank, chilly, and oppressive underground chamber, devoid of windows and illuminated only by flickering torches that cast eerie shadows. The atmosphere is palpably frightening. In this grim setting, Westley is discovered lying motionless at the center of a cage, shackled and utterly helpless, his skin pallid from confinement. Almost silently, an albino figure enters the pit, carrying a tray laden with food and medication. The albino sets down the tray and begins the meticulous process of tending to Westley's various wounds. As the albino works, Westley winces from the pain inflicted during treatment. A nod from the albino conveys acknowledgment, and a shake of the head communicates disapproval, as he scrutinizes Westley’s face, which betrays a look of profound sadness. In a parallel scene, Buttercup's visage mirrors this sadness. Her pallor suggests illness as she moves aimlessly through a corridor within the grand Florin Castle. As Buttercup proceeds, seemingly oblivious, she passes by an intersecting corridor where Prince Humperdinck and Count Rugen stand, observing her closely before moving on themselves. The camera lingers on this moment, holding the frame, while in the background, the familiar voice of the Grandfather resumes narrating, reminding viewers of the increasingly crowded courtyard scene, with an implied anticipation of the events to follow. Humperdinck, Rugen, and the Queen are depicted standing loftily on a balcony, overlooking the gathering below."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As a R.O.U.S attacks Westley, biting his arm, he fights back fiercely, driving his fist into the creature’s face and momentarily freeing himself. He reaches for his sword but is again besieged by the beast. In a climactic move, Westley flips the creature away and scrambles for his weapon as it charges toward Buttercup, who is terrified. As they reach the Fire Swamp's edge, Humperdinck, Rugen, and their mounted warriors appear, blocking their escape. Buttercup and Westley glance at Humperdinck, who stands before the bay waters, realizing they are surrounded by armed warriors with crossbows aimed at Westley. In desperation, Buttercup and Westley share a silent, intense gaze. Suddenly, Buttercup is swept onto Humperdinck's horse and they ride off, leaving Westley staring after her as the Count’s men seize him. Count Rugen strikes Westley on the head, and everything fades to black.\n\nWestley awakens in a dim, foreboding underground chamber, chained and vulnerable. An Albino, carrying food and medication, tends to Westley’s wounds in silence, while Westley winces in pain, their unspoken exchange filled with sadness. Meanwhile, Buttercup, appearing pale and possibly ill, wanders through Florin Castle as Prince Humperdinck and Count Rugen observe her from a distance. The scene transitions to the castle courtyard, now even more crowded, as Humperdinck, Rugen, and the Queen look down from a balcony."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "As he says that, a R.O.U.S, a Rodent of Unusual Size known from \"The Princess Bride\" for its aggressive nature and oversized stature, comes flying at him from off-screen. The thing's teeth sink deep into his arm. Westley, a brave hero deeply in love with Buttercup, drives a fist into the beast's face, rolling it off. He reaches for his sword just a few feet away, but the R.O.U.S is back atop him. It's a fierce battle, and just when we think Westley can't possibly win, he flips the ugly rodent clear. Westley scrambles for his sword. The R.O.U.S stampedes on, changing its target, and heads right for Buttercup, the beautiful young woman whose love story is central to the tale, and she's scared to death. And from somewhere they summon strength, pick up their pace, and as they reach the edge of the Fire Swamp, a perilous place filled with dangerous terrain and creatures, something we hadn't expected: Humperdinck, the scheming prince with dubious intentions, on his horse, Rugen beside him. Three warriors, armed and ready, are mounted in formation behind. They stop. Buttercup looks beyond exhaustion, having endured many challenges. Westley looks worse. Behind Humperdinck are the waters of the bay that borders the kingdom, a strategic point often used for travel. Westley and Buttercup are staring out at the others. Buttercup, looking from one to the other; then something else catches her eye, and we see an armed warrior, in shadow, with a loaded crossbow aimed at Westley's heart. Buttercup looks the other way. Another warrior has a crossbow aimed at Westley. Buttercup frantically stares around, and now a third warrior, crossbow stretched and ready to shoot, is hidden in a tree blocking any escape Westley might try. Humperdinck, whose ambitions go beyond mere marriage, whirls to face her. Westley also whirls to face her. Buttercup talks to them both. Buttercup and Westley stare deep into each other's eyes. Westley is dazed. Buttercup tries to speak again, can't, and is swooped off her feet onto Humperdinck's horse, and off they go. Westley stares after her. Rugen, notorious for his cruelty, watches as his warriors bring Westley to him. The Count, infamous for his six-fingered hand, has a heavy sword and holds it in his hand. Westley looks at him. Count Rugen clubs Westley hard across the skull. Westley starts to fall—the screen goes black. Dank and chill, underground and windowless, lit by flickering torches in the Pit of Despair—an infamous dungeon used for torturous experiments by Rugen. Frightening. Westley lies in the center of the cage, chained and helpless. Dead pale, he silently enters the pit, carrying a tray of food and medication. He puts it down and begins tending Westley's wounds. Westley winces. From the Albino, Rugen's mysterious assistant, comes a nod. From the Albino: a shake of the head. He studies Westley, whose face is almost sad. Buttercup's face is also sad. Pallid, perhaps ill, she wanders down a corridor in Florin Castle, the seat of Humperdinck's power. As she moves unseeing past an intersecting corridor, Prince Humperdinck and Count Rugen watch her as they move on. The camera holds on it while we hear the Grandfather's voice, who throughout the story provides narration and context to his sick grandson, reading. And if we thought it was packed before, we didn't know how many more could fit in this courtyard. Humperdinck, Rugen, and the Queen, whose marriage to the prince is a matter of state intrigue, stand high on the balcony."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "As he says that a ROUS comes flying at him from offscreen. The thing's teeth sink deep into his arm. Westley drives a fist into the beast's face rolling it off. He reaches for his sword just a few feet away but the ROUS is back atop him. It is a fierce battle and just when we think Westley cannot possibly win he flips the ugly rodent clear. Westley scrambles for his sword. The ROUS stampedes on changing its target heading right for Buttercup and she is scared to death. And from somewhere they summon strength pick up their pace and as they reach the edge of the Fire Swamp something we had not expected. Humperdinck on his horse. Rugen beside him. Three warriors armed and ready are mounted in formation behind. They stop. Buttercup looks beyond exhaustion. Westley looks worse. Behind Humperdinck are the waters of the bay. Westley and Buttercup are staring out at the others. Buttercup looking from one to the other. then something else catches her eye and we see an armed warrior in shadow with a loaded crossbow aimed at Westley's heart. Buttercup looks the other way. Another warrior has a crossbow aimed at Westley. Buttercup frantically stares around and now a third warrior crossbow stretched and ready to shoot is hidden in a tree blocking any escape Westley might try. Humperdinck whirls to face her. Westley also whirls to face her. Buttercup talks to them both. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Buttercup and Westley stare deep into each other's eyes. Westley is dazed. Buttercup tries to speak again cannot and is swooped off her feet onto Humperdinck's horse and off they go. Westley stares after her. Rugen watches as his warriors bring Westley to him. The Count has a heavy sword and holds it in his hand. Westley looks at him. Count Rugen clubs Westley hard across the skull. Westley starts to fall—the screen goes black. Dank and chill underground and windowless lit by flickering torches. Frightening. Westley lies in the center of the cage chained and helpless. Dead pale he silently enters the pit carrying a tray of food and medication. He puts it down and begins tending Westley's wounds. Westley winces. From the Albino a nod. From the Albino a shake of the head. He studies Westley whose face is almost sad. Buttercup's face is also sad. Pallid perhaps ill she wanders down a corridor in Florin Castle. As she moves unseeing past an intersecting corridor Prince Humperdinck and Count Rugen watch her as they move on. The camera holds on it while we hear the Grandfather's voice reading. And if we thought it was packed before we did not know how many more could fit in this courtyard. Humperdinck Rugen and the Queen stand high on the balcony."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "As he says that a ROUS comes flying at him from offscreen. The thing's teeth sink deep into his arm. Westley drives a fist into the beast's face rolling it off. He reaches for his sword just a few feet away but the ROUS is back atop him. It is a fierce battle and just when we think Westley cannot possibly win he flips the ugly rodent clear. Westley scrambles for his sword. The ROUS stampedes on changing its target heading right for Buttercup and she is scared to death. And from somewhere they summon strength pick up their pace and as they reach the edge of the Fire Swamp something we had not expected. Humperdinck on his horse. Rugen beside him. Three warriors armed and ready are mounted in formation behind. They stop. Buttercup looks beyond exhaustion. Westley looks worse. Behind Humperdinck are the waters of the bay. Westley and Buttercup are staring out at the others. Buttercup looking from one to the other. then something else catches her eye and we see an armed warrior in shadow with a loaded crossbow aimed at Westley's heart. Buttercup looks the other way. Another warrior has a crossbow aimed at Westley. Buttercup frantically stares around and now a third warrior crossbow stretched and ready to shoot is hidden in a tree blocking any escape Westley might try. Humperdinck whirls to face her. Westley also whirls to face her. Buttercup talks to them both. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Buttercup and Westley stare deep into each other's eyes. Westley is dazed. Buttercup tries to speak again cannot and is swooped off her feet onto Humperdinck's horse and off they go. Westley stares after her. Rugen watches as his warriors bring Westley to him. The Count has a heavy sword and holds it in his hand. Westley looks at him. Count Rugen clubs Westley hard across the skull. Westley starts to fall—the screen goes black. Dank and chill underground and windowless lit by flickering torches. Frightening. Westley lies in the center of the cage chained and helpless. Dead pale he silently enters the pit carrying a tray of food and medication. He puts it down and begins tending Westley's wounds. Westley winces. From the Albino a nod. From the Albino a shake of the head. He studies Westley whose face is almost sad. Buttercup's face is also sad. Pallid perhaps ill she wanders down a corridor in Florin Castle. As she moves unseeing past an intersecting corridor Prince Humperdinck and Count Rugen watch her as they move on. The camera holds on it while we hear the Grandfather's voice reading. And if we thought it was packed before we did not know how many more could fit in this courtyard. Humperdinck Rugen and the Queen stand high on the balcony."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "As he says that a ROUS comes flying at him from offscreen. The thing's teeth sink deep into his arm. Westley drives a fist into the beast's face rolling it off. He reaches for his sword just a few feet away but the ROUS is back atop him. It is a fierce battle and just when we think Westley cannot possibly win he flips the ugly rodent clear. Westley scrambles for his sword. The ROUS stampedes on changing its target heading right for Buttercup and she is scared to death. And from somewhere they summon strength pick up their pace and as they reach the edge of the Fire Swamp something we had not expected. Humperdinck on his horse. Rugen beside him. Three warriors armed and ready are mounted in formation behind. They stop. Dead pale he silently enters the pit carrying a tray of food and medication. He puts it down and begins tending Westley's wounds. Westley winces. From the Albino a nod. From the Albino a shake of the head. He studies Westley whose face is almost sad. Buttercup's face is also sad. Pallid perhaps ill she wanders down a corridor in Florin Castle. As she moves unseeing past an intersecting corridor Prince Humperdinck and Count Rugen watch her as they move on. The camera holds on it while we hear the Grandfather's voice reading. And if we thought it was packed before we did not know how many more could fit in this courtyard. Humperdinck Rugen and the Queen stand high on the balcony."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "As he says that a ROUS comes flying at him from offscreen. The thing's teeth sink deep into his arm. Westley drives a fist into the beast's face rolling it off. He reaches for his sword just a few feet away but the ROUS is back atop him. It is a fierce battle and just when we think Westley cannot possibly win he flips the ugly rodent clear. Pallid perhaps ill she wanders down a corridor in Florin Castle. As she moves unseeing past an intersecting corridor Prince Humperdinck and Count Rugen watch her as they move on. The camera holds on it while we hear the Grandfather's voice reading. And if we thought it was packed before we did not know how many more could fit in this courtyard. Humperdinck Rugen and the Queen stand high on the balcony."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "As she mentions it, a winged turtle glides toward her from off-stage. The creature's claws grip firmly onto her shoulder. Miriam swings a purse into the bird's beak, tossing it aside. She scrambles for her baguette just a few inches away, but the turtle is once again on top of her. It's a brutal contest, and just when we think Miriam can't possibly triumph, she twirls the horrid fowl aside. Miriam crawls toward her baguette. The turtle gallops onward, altering its focus, bounding straight for Cornflower, and she's terrified. And from nowhere they gather energy, pick up their speed, and as they approach the brink of the Lava Forest, something we hadn't anticipated: Dingleberry on his donkey, Noodle nearby. Three chefs, equipped and eager, are positioned in formation behind. They halt. Cornflower looks beyond fatigue. Miriam appears worse. Behind Dingleberry are the rivers of the lake. Miriam and Cornflower are gazing out at the others. Cornflower, peering from one to the other; then something else grabs her attention, and we observe an armored chef, in silhouette, with a loaded catapult aimed at Miriam's chest. Cornflower glances the opposite direction. Another chef has a catapult aimed at Miriam. Cornflower frantically surveys the area, and now a third chef, catapult taut and prepared to launch, is concealed in a bush blocking any retreat Miriam might attempt. Dingleberry spins to confront her. Miriam also spins to confront her. Cornflower converses with them both. Cornflower and Miriam gaze deeply into each other's eyes. Miriam is bewildered. Cornflower attempts to speak once more, can't, and is whisked off her perch onto Dingleberry's donkey, and away they trot. Miriam looks after her. Noodle observes as his chefs bring Miriam to him. The Baker has a massive rolling pin and wields it in his hand. Miriam glances at him. Baker Noodle smashes Miriam hard across the temple. Miriam begins to collapse—the screen fades to white. Damp and cold, subterranean and shutterless, illuminated by flickering lanterns. Menacing. Miriam rests in the middle of the kennel, fettered and powerless. Ghostly pale, he silently enters the den, carrying a basket of pastries and ointment. He sets it down and starts treating Miriam's bruises. Miriam grimaces. From the Milksop: a nod. From the Milksop: a shake of the head. He examines Miriam, whose expression is almost melancholy. Cornflower's expression is also melancholy. Ghostly, perhaps unwell, she meanders down a hallway in Clover Palace. As she moves obliviously past a converging hallway, Lord Dingleberry and Baker Noodle observe her as they proceed onward. The camera lingers on it while we hear the Narrator's voice narrating. And if we thought it was crowded before, we didn't know how many more could squeeze into this piazza. Dingleberry, Noodle, and the Duchess stand high on the terrace."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A R.O.U.S. attacks Westley, biting his arm, but he fights it off and reaches for his sword. As the beast targets Buttercup, they struggle through the Fire Swamp, only to encounter Humperdinck and his men. Exhausted, they face multiple armed warriors with crossbows aimed at Westley. Buttercup and Westley exchange deep glances before she is taken by Humperdinck. Rugen captures Westley, knocking him out. Westley awakens in a dungeon, chained and wounded, tended to by an Albino. Meanwhile, a sad Buttercup walks through Florin Castle as Humperdinck and Rugen watch her, while the scene transitions to a royal courtyard filled with people."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Humperdinck Rugen and the Queen stand high on the balcony And if we thought it was packed before we did not know how many more could fit in this courtyard The camera holds on it while we hear the Grandfather's voice reading As she moves unseeing past an intersecting corridor Prince Humperdinck and Count Rugen watch her as they move on Pallid perhaps ill she wanders down a corridor in Florin Castle Buttercup's face is also sad He studies Westley whose face is almost sad From the Albino a shake of the head From the Albino a nod Westley winces He puts it down and begins tending Westley's wounds Dead pale he silently enters the pit carrying a tray of food and medication Westley lies in the center of the cage chained and helpless Frightening Dank and chill underground and windowless lit by flickering torches Westley starts to fall—the screen goes black Count Rugen clubs Westley hard across the skull Westley looks at him The Count has a heavy sword and holds it in his hand Rugen watches as his warriors bring Westley to him Westley stares after her Buttercup tries to speak again cannot and is swooped off her feet onto Humperdinck's horse and off they go Westley is dazed Buttercup and Westley stare deep into each other's eyes Buttercup talks to them both Westley also whirls to face her Humperdinck whirls to face her Buttercup frantically stares around and now a third warrior crossbow stretched and ready to shoot is hidden in a tree blocking any escape Westley might try Another warrior has a crossbow aimed at Westley Buttercup looks the other way then something else catches her eye and we see an armed warrior in shadow with a loaded crossbow aimed at Westley's heart Buttercup looking from one to the other Westley and Buttercup are staring out at the others Behind Humperdinck are the waters of the bay Westley looks worse Buttercup looks beyond exhaustion They stop Three warriors armed and ready are mounted in formation behind Rugen beside him Humperdinck on his horse And from somewhere they summon strength pick up their pace and as they reach the edge of the Fire Swamp something we had not expected The ROUS stampedes on changing its target heading right for Buttercup and she is scared to death Westley scrambles for his sword It is a fierce battle and just when we think Westley cannot possibly win he flips the ugly rodent clear He reaches for his sword just a few feet away but the ROUS is back atop him Westley drives a fist into the beast's face rolling it off The thing's teeth sink deep into his arm As he says that a ROUS comes flying at him from offscreen"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The thing's teeth sink deep into his arm As he says that a ROYOUS comes flying at him from offscreen He reaches for his sword just a few feet away but the ROYOUS is back atop him Westley drives a fist into the beast's face rolling it off the ugly rodent clear It is a fierce battle and just when we think Westley cannot possibly win he flips The ROYOUS stampedes on changing its target heading right for Buttercup and she is scared to death Westley scrambles for his sword Humperdinck on his horse And from somewhere they summon strength pick up their pace and as they reach the edge of the Fire Swamp something we had not expected Three warriors armed and ready are mounted in formation behind Rugen beside him Buttercup looks beyond exhaustion They stop Behind Humperdinck are the waters of the bay Westley looks worse Buttercup looking from one to the other Westley and Buttercup are staring out at the others Buttercup looks the other way then something else catches her eye and we see an armed warrior in shadow with a loaded crossbow aimed at Westley's heart Buttercup frantically stares around and now a third warrior crossbow stretched and ready to shoot is hidden in a tree blocking any escape Westley might try Another warrior has a crossbow aimed at Westley Westley also whirls to face her Humperdinck whirls to face her both Buttercup talks to them Westley is dazed Buttercup and Westley stare deep into each other's eyes Westley stares after her Buttercup tries to speak again cannot and is swooped off her feet onto Humperdinck's horse and off they go The Count has a heavy sword and holds it in his hand Rugen watches as his warriors bring Westley to him Count Rugen clubs Westley hard across the skull Westley looks at him Dank and chill underground and windowless lit by flickering torches Westley starts to fall—the screen goes black Westley lies in the center of the cage chained and helpless Frightening He puts it down and begins tending Westley's wounds Dead pale he silently enters the pit carrying a tray of food and medication From the Albino a nod Westley winces He studies Westley whose face is almost sad From the Albino a shake of the head Pallid perhaps ill she wanders down a corridor in Florin Castle Buttercup's face is also sad The camera holds on it while we hear the Grandfather's voice reading As she moves unseeing past an intersecting corridor Prince Humperdinck and Count Rugen watch her as they move on Humperdinck Rugen and the Queen stand high on the balcony And if we thought it was packed before we did not know how many more could fit in this courtyard"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Buttercup and Westley stare deep into each other's eyes Westley is dazed Buttercup tries to speak again cannot and is swooped off her feet onto Humperdinck's horse and off they go Westley stares after her Rugen watches as his warriors bring Westley to him The Count has a heavy sword and holds it in his hand Westley looks at him Count Rugen clubs Westley hard across the skull Westley starts to fall—the screen goes black Dank and chill underground and windowless lit by flickering torches Frightening Westley lies in the center of the cage chained and helpless Dead pale he silently enters the pit carrying a tray of food and medication He puts it down and begins tending Westley's wounds Westley winces From the Albino a nod From the Albino a shake of the head He studies Westley whose face is almost sad Buttercup's face is also sad Pallid perhaps ill she wanders down a corridor in Florin Castle As she moves unseeing past an intersecting corridor Prince Humperdinck and Count Rugen watch her as they move on The camera holds on it while we hear the Grandfather's voice reading And if we thought it was packed before we did not know how many more could fit in this courtyard Humperdinck Rugen and the Queen stand high on the balcony As he says that a ROUS comes flying at him from offscreen The thing's teeth sink deep into his arm Westley drives a fist into the beast's face rolling it off He reaches for his sword just a few feet away but the ROUS is back atop him It is a fierce battle and just when we think Westley cannot possibly win he flips the ugly rodent clear Westley scrambles for his sword The ROUS stampedes on changing its target heading right for Buttercup and she is scared to death And from somewhere they summon strength pick up their pace and as they reach the edge of the Fire Swamp something we had not expected Humperdinck on his horse Rugen beside him Three warriors armed and ready are mounted in formation behind They stop Buttercup looks beyond exhaustion Westley looks worse Behind Humperdinck are the waters of the bay Westley and Buttercup are staring out at the others Buttercup looking from one to the other then something else catches her eye and we see an armed warrior in shadow with a loaded crossbow aimed at Westley's heart Buttercup looks the other way Another warrior has a crossbow aimed at Westley Buttercup frantically stares around and now a third warrior crossbow stretched and ready to shoot is hidden in a tree blocking any escape Westley might try Humperdinck whirls to face her Westley also whirls to face her Buttercup talks to them both"
        }
      ]
    }
  ]
}