{
  "ground_truth": "As the scene freezes with Humperdinck caught in mid-sentence, the Kid is half sitting now, not strong yet, but clearly stronger than when we first saw him, and on these words, as we saw before, Buttercup emerges. The crowd suddenly goes to its knees, wave after wave of silent kneeling people, all of them down. Buttercup is touched as before but then seems stunned as she advances on Buttercup now, who is more and more panicked. Buttercup comes out of her nightmare, alone in her castle bedroom, and as she frantically grabs a robe, she starts to run. She bursts into the Prince's chambers where Count Rugen stands nearby, just stunned. Finally, softly, he begins to talk, and she nods. The trees are unusual in one respect: all of them are extraordinarily heavily knotted. Humperdinck and Rugen walk into the grove of trees, deeper into the grove now as Rugen searches around. Rugen smiles and hurries down the stairs as the tree slides back perfectly into place. Count Rugen drags Westley up alongside the thing—levers and wheels and wires, you name it, it's there. Westley has suction cups on his head now, on his temple, on his heart, his hands and feet. He says nothing, keeps control of himself, and then opens the flood gate, water pours down the chute, turning the wheel, which in turn really gets The Machine going. Westley is lying on the table, and he's only flesh and the chains are metal and thick, but such is his desperation it almost seems he might break them. It keeps on coming as we finally see he switches off The Machine, picks up a large notebook and pen, and sits in a chair. Westley is in anguish so deep it is dizzying, and helpless, he cries. Count Rugen watches the tears, then starts to write in his quarters, swamped, with piles of papers strewn all over. Now Yellin, a pale, shifty, quick-eyed man, appears in the doorway, entering. The Prince and Yellin turn to her in the doorway as she glides out. A lot of hollering is going on as the thieves are being rounded up by the Brute Squad, a large group of large men, with Yellin standing on a wagon in the midst of all the scuffling, and his wagon starts, and as it does, Inigo, drunk as a skunk, sprawls in front of a hovel, a bottle of brandy in one hand, the six-fingered sword in the other. He looks dreadful, unshaven, puffy-eyed, gaunt. Inigo feels a hand on his back and compares it to his own smaller hand, and as the Assistant Brute is just about to club Inigo's brains out, Fezzik lets fly with a stupendous punch.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "As the tableau pauses with Humperdinck captured in mid-utterance, the Kid is half reclining now, not robust yet, but clearly mightier than when we initially viewed him, and on those expressions, as we observed previously, Buttercup appears. The throng suddenly descends to its knees, wave after wave of silent bowing individuals, all of them down. Buttercup is touched as before but then seems astonished as she progresses on Buttercup now, who is more and more terrified. Buttercup emerges from her terror, solitary in her castle chamber, and as she feverishly takes a robe, she begins to sprint. She bursts into the Prince's rooms where Count Rugen stands nearby, merely astonished. Finally, softly, he commences to speak, and she nods. The trees are unusual in one respect: all of them are remarkably heavily knotted. Humperdinck and Rugen wander into the grove of trees, deeper into the grove now as Rugen searches around. Rugen grins and hurries down the staircase as the tree slides back perfectly into position. Count Rugen hauls Westley up alongside the apparatus—levers and gears and wires, you name it, it's present. Westley has suction cups on his cranium now, on his temple, on his heart, his hands and feet. He says nothing, maintains control of himself, and then opens the floodgate, water gushes down the chute, turning the wheel, which in turn really activates The Machine. Westley is reclining on the table, and he's only flesh and the shackles are metal and thick, but such is his despair it almost seems he might break them. It continues to come as we finally see he switches off The Machine, picks up a large journal and pen, and settles in a chair. Westley is in torment so profound it is vertiginous, and powerless, he weeps. Count Rugen observes the tears, then starts to write in his quarters, inundated, with piles of documents scattered all over. Now Yellin, a pale, shifty, quick-eyed man, appears in the doorway, entering. The Prince and Yellin turn to her in the doorway as she glides out. A lot of shouting is going on as the thieves are being gathered up by the Brute Squad, a large assembly of large men, with Yellin standing on a cart in the midst of all the scuffling, and his cart starts, and as it does, Inigo, intoxicated as a skunk, sprawls in front of a hovel, a bottle of brandy in one hand, the six-fingered blade in the other. He looks dreadful, unshaven, puffy-eyed, gaunt. Inigo feels a hand on his back and compares it to his own smaller hand, and as the Assistant Brute is just about to club Inigo's brains out, Fezzik lets fly with a stupendous punch."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "As the scene is frozen with Humperdinck caught in mid-sentence, the Kid is now half sitting, not strong yet, but clearly stronger than when we first saw him, and on these words, as we saw before, Buttercup emerges. The crowd suddenly goes to its knees, wave after wave of silent kneeling people, and all of them are down. Buttercup is touched as before, but then seems stunned as she is advanced upon by Buttercup now, who becomes more and more panicked. Buttercup comes out of her nightmare, alone in her castle bedroom, and a robe is frantically grabbed by her as she starts to run. The Prince's chambers are burst into by her, where Count Rugen stands nearby, just stunned. Finally, softly, talking is begun by him, and she nods. An unusual aspect is possessed by the trees: all of them are extraordinarily heavily knotted. The grove of trees is entered by Humperdinck and Rugen, as deeper into the grove Rugen searches around. Rugen smiles and hurries down the stairs as the tree is perfectly slid back into place. Count Rugen drags Westley up alongside the thing—levers and wheels and wires, you name it, it's there. Suction cups are now on Westley’s head, on his temple, on his heart, his hands, and feet. Nothing is said by him, control of himself is kept, and then he opens the flood gate; water pours down the chute, turning the wheel, which, in turn, really gets The Machine going. Westley is lying on the table, and he's only flesh and the chains are metal and thick, but such is his desperation it almost seems he might break them. It keeps on coming as we finally see The Machine is switched off by him, a large notebook and pen are picked up, and he sits in a chair. Westley is in anguish so deep it is dizzying, and helpless, crying is done by him. The tears are watched by Count Rugen, then writing is started by him in his quarters, swamped, with piles of papers strewn all over. Now Yellin, a pale, shifty, quick-eyed man, appears in the doorway, entering. The Prince and Yellin turn to her in the doorway as she glides out. A lot of hollering goes on as the Brute Squad, a large group of large men, round up the thieves, with Yellin standing on a wagon in the midst of all the scuffling, and his wagon starts, and as it does, Inigo, drunk as a skunk, sprawls in front of a hovel, a bottle of brandy in one hand, the six-fingered sword in the other. He looks dreadful, unshaven, puffy-eyed, gaunt. Inigo feels a hand on his back and compares it to his own smaller hand, and as the Assistant Brute is just about to club Inigo's brains out, a stupendous punch is let fly by Fezzik."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "As the scene freezes with Humperdinck mid-sentence, the Kid is now half sitting, stronger than before. On cue, Buttercup appears, and the crowd silently kneels. Buttercup, touched yet stunned, advances toward the now-panicked Buttercup. Waking from her nightmare alone in her castle bedroom, she grabs a robe and runs to the Prince's chambers, where Count Rugen stands, stunned. He talks softly and she nods. The trees, unusually heavily knotted, surround Humperdinck and Rugen as they walk deeper into the grove. Rugen hurries down the stairs as a tree slides back into place. Count Rugen drags Westley to a contraption with levers, wheels, and wires, attaching suction cups to his head, temple, heart, hands, and feet. Westley, silent and composed, opens the flood gate, releasing water that powers The Machine. Chained to a table, his desperation nearly breaks the metal. Rugen switches off The Machine, observes Westley's tears, and starts writing amid piles of papers. Yellin, a pale, quick-eyed man, enters, and the Prince and Yellin turn as she exits. Hollering ensues as thieves are rounded up by the Brute Squad, with Yellin on a wagon during the scuffle. Inigo, drunk, lies outside a hovel with brandy in one hand and the six-fingered sword in the other, looking dreadful. Feeling a hand on his back, Inigo compares it to his own smaller hand. As the Assistant Brute nearly clubs Inigo, Fezzik delivers a powerful punch."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "As the scene freezes with Humperdinck mid-sentence, the Kid is stronger than before, and Buttercup emerges. The crowd kneels silently. Buttercup, touched but stunned, advances on herself, panicking, and wakes from her nightmare in her castle bedroom. She grabs a robe, runs to the Prince's chambers, where Count Rugen stands stunned, begins to talk, and she nods. The trees are unusually knotted. Humperdinck and Rugen venture into the grove, deeper as Rugen searches. Rugen smiles, hurries downstairs as the tree slides back. Count Rugen drags Westley alongside the Machine, his head, heart, hands, feet with suction cups. Westley controls himself, opens the flood gate, water turns the wheel, activating the Machine. He's desperate, almost breaking his chains. The Machine stops, Rugen picks up a notebook and pen, as Westley lies in dizzying anguish, crying. Count Rugen watches, writes in his cluttered quarters. Yellin, pale and quick-eyed, enters the doorway. The Prince and Yellin notice as she glides out. The Brute Squad rounds up thieves, with Yellin on a wagon amidst scuffling. The wagon moves, and Inigo, drunk, sprawls with brandy and sword, looking dreadful. A hand on his back, Inigo compares it to his smaller hand. As the Assistant Brute is about to harm Inigo, Fezzik delivers a punch."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As the cinematic moment is frozen in time, with Humperdinck halted mid-sentence, we observe that the Kid is now half-sitting. He is not fully strong yet, not entirely robust, but he is undeniably more vigorous and resilient than when he was first introduced to us. Accompanying these words, as we witnessed earlier, Buttercup makes her appearance. The entire crowd, without exception, suddenly cascades to its knees. Wave after wave of silent kneeling brings all the gathered people down to the ground. Buttercup is initially moved, as before, by this scene, but she then appears utterly stunned as she moves forward toward Buttercup, who becomes increasingly panic-stricken with each step. Abruptly, Buttercup awakens from her nightmare, finding herself alone in the solitude of her castle bedroom. In a state of panic, she hurriedly grabs a robe and begins to run. She dashes into the Prince's chambers, where Count Rugen stands nearby, utterly taken aback by the sudden intrusion. After this moment of surprise, he begins to speak softly, and she acknowledges his words with a nod. The grove of trees they enter is peculiar in one distinctive respect: every single tree is heavily knotted, more so than any ordinary tree. Humperdinck and Rugen venture deeper into this grove, as Rugen searches intently around the area. A moment later, he smiles and quickly descends the stairs as the tree slides back seamlessly into its original place. Count Rugen drags Westley to a large, ominous apparatus composed of levers, wheels, and various intricate wires—practically every conceivable mechanical component is present. Westley now has suction cups affixed to his head, his temples, his heart, and even his hands and feet. He remains silent, exerting a formidable control over himself, and then proceeds to open the flood gate. Water cascades down the chute, causing the wheel to turn and truly activating The Machine. Westley is lying there, restrained to the table, his body made of mere flesh while the chains confining him are made of dense metal, formidable and thick. Yet, despite this, his desperation is so intense it almost seems that he might shatter those chains. The process continues as we finally observe Count Rugen switching off The Machine. He then picks up a large notebook and pen, seating himself in a chair. Westley is plunged into a depth of anguish so profound it is dizzying; he remains helpless and succumbs to tears. Count Rugen watches as the tears fall, and then he begins to write in his quarters, which are cluttered and overwhelmed with piles of strewn papers everywhere. Meanwhile, Yellin, who is a pale, shifty man with quick eyes, appears, entering at the doorway. The Prince and Yellin both turn toward her as she gracefully exits through the doorway. There is a significant amount of shouting as the thieves are being rounded up by the Brute Squad. This formidable group consists of numerous large men, and Yellin stands prominently on a wagon amidst the chaos and scuffling. As the wagon sets into motion, Inigo, drunk beyond measure, lies sprawled in front of a hovel with a bottle of brandy in one hand and the six-fingered sword in the other. He appears in a dreadful state—unshaven, with puffy eyes, and gaunt. Inigo suddenly feels a hand placed upon his back and compares its size to his own smaller hand. Just as the Assistant Brute is about to strike Inigo, intending to incapacitate him, Fezzik intervenes, delivering a stupendous punch."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As the cinematic moment becomes suspended in time, with Humperdinck halted mid-sentence, we observe with keen interest that the Kid is now positioned in a half-sitting posture. Though he is not yet entirely strong or robust, he has undeniably gained more vigor and resilience compared to when he was first introduced to us. Accompanying these words, as we witnessed earlier, Buttercup makes her graceful appearance. The entire crowd, without a single exception, suddenly cascades to its knees in unison. Wave after wave of silent kneeling brings all the gathered people down to the ground in a remarkable display. Buttercup is initially moved, as she had been before, by this magnificent scene, but she then appears utterly stunned as she moves forward toward her doppelgänger, who becomes increasingly panic-stricken with each step taken. Abruptly, Buttercup awakens from her terrifying nightmare, finding herself alone in the solitude of her grand castle bedroom. In a heightened state of panic, she hurriedly grabs a robe and begins to run frantically. She dashes headlong into the Prince's chambers, where Count Rugen is standing nearby, utterly taken aback by the sudden and unexpected intrusion. After this moment of abrupt surprise, he begins to speak softly, and she acknowledges his words with a gentle nod. \n\nThe grove of trees they enter is peculiar in one distinctive respect: every single tree is heavily and intricately knotted, more so than one would expect from any ordinary tree. Humperdinck and Rugen venture ever deeper into this unusual grove, as Rugen searches intently around the area with a keen eye. A moment later, he smiles with satisfaction and quickly descends the stairs as the tree slides back seamlessly into its original place, concealing the entrance. Count Rugen drags Westley to a large and ominous apparatus composed of levers, wheels, and various intricate wires—practically every conceivable mechanical component is present. Westley now has suction cups firmly affixed to his head, his temples, his heart, and even his hands and feet. He remains silent, exerting formidable control over himself, and then proceeds to open the flood gate. Water cascades down the chute, causing the wheel to turn and truly activating The Machine. Westley is lying there, restrained to the unyielding table, his body made of mere flesh while the chains confining him are constructed of dense metal, formidable and thick. Yet, despite this imposing restraint, his desperation is so intense it almost seems that he might somehow shatter those chains. \n\nThe process continues relentlessly as we finally observe Count Rugen switching off The Machine with a sense of finality. He then picks up a large notebook and pen, seating himself in a chair with a purposeful demeanor. Westley is plunged into a depth of anguish so profound it is dizzying; he remains helpless and ultimately succumbs to tears. Count Rugen watches with clinical detachment as the tears fall, and then he begins to write with deliberation in his quarters, which are cluttered and overwhelmed with piles of strewn papers everywhere. Meanwhile, Yellin, who is a pale, shifty man with quick and furtive eyes, appears, entering at the doorway. The Prince and Yellin both turn toward her as she gracefully exits through the doorway. There is a significant amount of shouting as the thieves are being vigorously rounded up by the Brute Squad. This formidable group consists of numerous large and imposing men, and Yellin stands prominently on a wagon amidst the chaos and scuffling. As the wagon sets into motion, Inigo, who is drunk beyond measure, lies sprawled in front of a shabby hovel with a bottle of brandy in one hand and the six-fingered sword in the other. He appears in a truly dreadful state—unshaven, with puffy eyes, and noticeably gaunt. Inigo suddenly feels a hand placed upon his back and compares its imposing size to his own smaller hand. Just as the Assistant Brute is about to strike Inigo, intending to incapacitate him entirely, Fezzik intervenes, delivering a stupendous punch."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the scene comes to an abrupt freeze with Humperdinck caught in mid-sentence, the Kid appears half-sitting—though not fully strong yet, he is noticeably stronger than when we first encountered him. At that moment, as previously observed, Buttercup emerges into the scene. The crowd, as if guided by an invisible force, suddenly and silently descends to its knees, creating wave after wave of kneeling people, all uniformly lowered in reverence. Buttercup, initially touched by the scene, becomes visibly stunned as she advances, only to find herself growing more and more panicked. Abruptly, Buttercup snaps out of her nightmare, finding herself alone in her castle bedroom. In a frantic response to her sudden awakening, she hurriedly grabs a robe and begins to sprint. Bursting into the Prince's chambers, she discovers Count Rugen standing nearby, utterly stunned at her unexpected entrance. Finally, with a soft demeanor, the Prince begins to speak to her, and she responds with a nod. Meanwhile, the surrounding trees stand out due to their unusual characteristic of being extraordinarily heavily knotted. Within this grove, Humperdinck and Rugen traverse deeper, with Rugen meticulously searching around. A confident smile spreads across Rugen’s face as he hastens down a set of stairs, allowing a tree to slide seamlessly back into position. Count Rugen then proceeds to drag Westley up beside a complex contraption filled with levers, wheels, and wires—a machine of intricate design and purpose. At this point, Westley finds himself adorned with suction cups placed strategically on his head, temples, heart, hands, and feet. Despite the dire situation, he maintains his composure, saying nothing, and then proceeds to open the floodgate, causing water to cascade down the chute. This action energizes the wheel, setting The Machine into vigorous motion. Westley lies on the table, his flesh vulnerable and constrained by thick metal chains, yet his desperation is so potent it seems almost conceivable that he might somehow break free. The relentless activity culminates as Count Rugen finally switches off The Machine. He then picks up a large notebook and a pen, settling into a chair to document his observations. Meanwhile, Westley experiences an anguish so profound it becomes dizzying, rendering him helpless and causing him to weep. Count Rugen observes these tears with keen interest before he starts to write amidst his quarters, which are overwhelmed with piles of disorganized papers scattered across the space. At this juncture, Yellin, a man of pale complexion, shifty demeanor, and quick eyes, makes his appearance at the doorway, stepping inside. The Prince and Yellin turn towards her as she smoothly exits through the doorway. Concurrently, a cacophony of hollering fills the air as thieves are forcefully gathered by the Brute Squad—a formidable group of men, large in both stature and number. Yellin stands directing activity atop a wagon amidst the chaos, and as the wagon begins to move, Inigo, heavily intoxicated and sprawled in front of a hovel, clutches a bottle of brandy in one hand and the six-fingered sword in the other. His appearance is disheveled and wretched: unshaven, with puffy eyes and a gaunt frame. Inigo, feeling a hand on his back, instinctively compares it to his own smaller hand. Just as the Assistant Brute is poised to deliver a brain-shattering blow to Inigo, Fezzik intervenes with an exceptionally powerful punch, altering the course of events."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As the scene freezes with Humperdinck mid-sentence, the Kid is seen partially sitting, noticeably stronger than before. Meanwhile, Buttercup emerges, causing the crowd to kneel silently in waves, leaving her touched yet increasingly panicked. Awakening from her nightmare alone in her bedroom, Buttercup hurriedly dons a robe and rushes to the Prince's chambers, where she finds Count Rugen. Both shocked and silent, he starts speaking softly, while she listens and nods. \n\nHumperdinck and Rugen enter a grove of unusually heavily knotted trees. As they delve deeper, Rugen discovers a secret staircase, smiles, and descends swiftly, the tree sliding back into position. In the underground chamber, he secures Westley to a contraption filled with levers, wheels, and wires, attaching suction cups to various parts of Westley's body. Maintaining composure, Westley watches as Rugen releases water, activating The Machine. Chained and desperate on the table, Westley struggles with all his might. Rugen eventually stops The Machine, observes Westley's anguished tears, and begins writing in his overflowing quarters.\n\nElsewhere, Yellin, a quick-eyed man, enters a room where the Prince and others await. He exits as a commotion arises outside, with the Brute Squad rounding up thieves. Amid the chaos, Yellin stands on a moving wagon, while Inigo lies drunkenly sprawled nearby, brandy in hand and clutching his six-fingered sword. He looks unkempt and weary until Fezzik, noticing an Assistant Brute about to strike Inigo, intervenes with a powerful punch."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "As the scene freezes with Humperdinck, the ambitious prince of Florin known for his cunning, caught in mid-sentence, the Kid is half sitting now, not strong yet, but clearly stronger than when we first saw him, and on these words, as we saw before, Buttercup emerges. Buttercup, who is renowned in the land for her unparalleled beauty, steps forward, causing the crowd to suddenly go to its knees, wave after wave of silent kneeling people, all of them down. Buttercup, touched as before by their reverence, then seems stunned as she advances on Buttercup now, who is more and more panicked. Buttercup comes out of her nightmare, alone in her castle bedroom, a lavish room adorned with tapestries and fine furnishings, and as she frantically grabs a robe, she starts to run. She bursts into the Prince's chambers where Count Rugen, the sadistic inventor of The Machine, stands nearby, just stunned. Finally, softly, he begins to talk, revealing his usual calm demeanor, and she nods. The trees are unusual in one respect: all of them are extraordinarily heavily knotted, a result of the unique soil conditions in the kingdom's enchanted forest. Humperdinck and Rugen walk into the grove of trees, deeper into the grove now as Rugen searches around for the secret passage. Rugen smiles, knowing the hidden mechanism, and hurries down the stairs as the tree slides back perfectly into place, concealing their tracks. Count Rugen drags Westley, the daring farm boy turned hero, up alongside the thing—levers and wheels and wires, you name it, it's there as part of his torture device. Westley has suction cups on his head now, on his temple, on his heart, his hands and feet, part of the apparatus designed to inflict and measure pain. He says nothing, keeps control of himself, and then opens the flood gate, water pours down the chute, turning the wheel, which in turn really gets The Machine, infamous for its cruelty, going. Westley is lying on the table, and he's only flesh and the chains are metal and thick, but such is his desperation it almost seems he might break them. It keeps on coming as we finally see he switches off The Machine, picks up a large notebook and pen, the tools for documenting his cruel experiments, and sits in a chair. Westley is in anguish so deep it is dizzying, and helpless, he cries. Count Rugen watches the tears, fascinated by the suffering, then starts to write in his quarters, swamped, with piles of papers strewn all over, evidence of his dark research. Now Yellin, a pale, shifty, quick-eyed man, who serves as the chief of security in Florin, appears in the doorway, entering. The Prince and Yellin turn to her in the doorway as she glides out. A lot of hollering is going on as the thieves are being rounded up by the Brute Squad, a large group of large men notorious for their brute force, with Yellin standing on a wagon in the midst of all the scuffling, overseeing the operation, and his wagon starts, and as it does, Inigo, drunk as a skunk, sprawls in front of a hovel, a bottle of brandy in one hand, the six-fingered sword, a legacy weapon from his father, in the other. He looks dreadful, unshaven, puffy-eyed, gaunt. Inigo feels a hand on his back and compares it to his own smaller hand, and as the Assistant Brute is just about to club Inigo's brains out, Fezzik, the gigantic and gentle giant with unmatched strength, lets fly with a stupendous punch."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "As the scene freezes with Humperdinck caught in midsentence the Kid is half sitting now not strong yet but clearly stronger than when we first saw him and on these words as we saw before Buttercup emerges. The crowd suddenly goes to its knees wave after wave of silent kneeling people all of them down. Buttercup is touched as before but then seems stunned as she advances on Buttercup now who is more and more panicked. Buttercup comes out of her nightmare alone in her castle bedroom and as she frantically grabs a robe she starts to run. She bursts into the Prince's chambers where Count Rugen stands nearby just stunned. Finally softly he begins to talk and she nods. The trees are unusual in one respect. all of them are extraordinarily heavily knotted. Humperdinck and Rugen walk into the grove of trees. deeper into the grove now as Rugen searches around Rugen smiles and hurries down the stairs. as the tree slides back perfectly into place. Count Rugen drags Westley up alongside the thing—levers and wheels and wires you name it. it is there. Westley has suction cups on his head now on his temple on his heart his hands and feet. He says nothing keeps control of himself and then opens the flood gate. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. water pours down the chute turning the wheel which in turn really gets The Machine going. Westley is lying on the table and he is only flesh and the chains are metal and thick but such is his desperation it almost seems he might break them. It keeps on coming as we finally see he switches off. The Machine picks up a large notebook and pen and sits in a chair. Westley is in anguish so deep it is dizzying and helpless. he cries. Count Rugen watches the tears then starts to write in his quarters swamped with piles of papers strewn all over. Now Yellin a pale shifty quickeyed man appears in the doorway entering. The Prince and Yellin turn to her in the doorway as she glides out. A lot of hollering is going on as the thieves are being rounded up by the Brute Squad. a large group of large men with Yellin standing on a wagon in the midst of all the scuffling and his wagon starts and as it does Inigo drunk as a skunk sprawls in front of a hovel. a bottle of brandy in one hand the sixfingered sword in the other. He looks dreadful unshaven puffyeyed gaunt. Inigo feels a hand on his back and compares it to his own smaller hand and as the Assistant Brute is just about to club Inigo's brains out. Fezzik. let us fly with a stupendous punch."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "As the scene freezes with Humperdinck caught in midsentence the Kid is half sitting now not strong yet but clearly stronger than when we first saw him and on these words as we saw before Buttercup emerges. The crowd suddenly goes to its knees wave after wave of silent kneeling people all of them down. Buttercup is touched as before but then seems stunned as she advances on Buttercup now who is more and more panicked. Buttercup comes out of her nightmare alone in her castle bedroom and as she frantically grabs a robe she starts to run. She bursts into the Prince's chambers where Count Rugen stands nearby just stunned. Finally softly he begins to talk and she nods. The trees are unusual in one respect. all of them are extraordinarily heavily knotted. Humperdinck and Rugen walk into the grove of trees. deeper into the grove now as Rugen searches around Rugen smiles and hurries down the stairs. as the tree slides back perfectly into place. Count Rugen drags Westley up alongside the thing—levers and wheels and wires you name it. it is there. Westley has suction cups on his head now on his temple on his heart his hands and feet. He says nothing keeps control of himself and then opens the flood gate. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. water pours down the chute turning the wheel which in turn really gets The Machine going. Westley is lying on the table and he is only flesh and the chains are metal and thick but such is his desperation it almost seems he might break them. It keeps on coming as we finally see he switches off. The Machine picks up a large notebook and pen and sits in a chair. Westley is in anguish so deep it is dizzying and helpless. he cries. Count Rugen watches the tears then starts to write in his quarters swamped with piles of papers strewn all over. Now Yellin a pale shifty quickeyed man appears in the doorway entering. The Prince and Yellin turn to her in the doorway as she glides out. A lot of hollering is going on as the thieves are being rounded up by the Brute Squad. a large group of large men with Yellin standing on a wagon in the midst of all the scuffling and his wagon starts and as it does Inigo drunk as a skunk sprawls in front of a hovel. a bottle of brandy in one hand the sixfingered sword in the other. He looks dreadful unshaven puffyeyed gaunt. Inigo feels a hand on his back and compares it to his own smaller hand and as the Assistant Brute is just about to club Inigo's brains out. Fezzik. let us fly with a stupendous punch."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "As the scene freezes with Humperdinck caught in midsentence the Kid is half sitting now not strong yet but clearly stronger than when we first saw him and on these words as we saw before Buttercup emerges. The crowd suddenly goes to its knees wave after wave of silent kneeling people all of them down. Buttercup is touched as before but then seems stunned as she advances on Buttercup now who is more and more panicked. Buttercup comes out of her nightmare alone in her castle bedroom and as she frantically grabs a robe she starts to run. She bursts into the Prince's chambers where Count Rugen stands nearby just stunned. Finally softly he begins to talk and she nods. The trees are unusual in one respect. all of them are extraordinarily heavily knotted. The Prince and Yellin turn to her in the doorway as she glides out. A lot of hollering is going on as the thieves are being rounded up by the Brute Squad. a large group of large men with Yellin standing on a wagon in the midst of all the scuffling and his wagon starts and as it does Inigo drunk as a skunk sprawls in front of a hovel. a bottle of brandy in one hand the sixfingered sword in the other. He looks dreadful unshaven puffyeyed gaunt. Inigo feels a hand on his back and compares it to his own smaller hand and as the Assistant Brute is just about to club Inigo's brains out. Fezzik. let us fly with a stupendous punch."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "As the scene freezes with Humperdinck caught in midsentence the Kid is half sitting now not strong yet but clearly stronger than when we first saw him and on these words as we saw before Buttercup emerges. The crowd suddenly goes to its knees wave after wave of silent kneeling people all of them down. Buttercup is touched as before but then seems stunned as she advances on Buttercup now who is more and more panicked. He looks dreadful unshaven puffyeyed gaunt. Inigo feels a hand on his back and compares it to his own smaller hand and as the Assistant Brute is just about to club Inigo's brains out. Fezzik. let us fly with a stupendous punch."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "As the panorama solidifies with Fiddlesticks halted in mid-riddle, the Child is half-leaning now, not fragile yet, but clearly burlier than when we first noticed it, and on these utterances, as we glimpsed prior, Daisy surfaces. The assembly abruptly collapses to their elbows, ripple after ripple of silent crouching individuals, all of them flattened. Daisy is brushed as before but then appears bewildered as she tiptoes towards Daisy now, who is increasingly agitated. Daisy snaps out of her illusion, solitary in her fortress chamber, and as she hastily snatches a cloak, she begins to stroll. She crashes into the King's quarters where Duke Peabody stands nearby, just perplexed. Gradually, softly, he starts to mumble, and she gestures. The shrubs are distinctive in one attribute: all of them are exceptionally densely twisted. Fiddlesticks and Peabody march into the glen of bushes, further into the grove now as Peabody investigates around. Peabody grins and scurries down the ladder as the bush slides back flawlessly into location. Duke Peabody pulls Marvin up alongside the contraption—levers and gears and strings, you name it, it's present. Marvin has suction pads on his forehead now, on his cheeks, on his chest, his toes and fingers. He whispers zilch, maintains mastery of himself, and then unleashes the sluice gate, liquid cascades down the ramp, spinning the cog, which in turn truly gets The Device whirring. Marvin is reclining on the platform, and he's only skin and the restraints are steel and hefty, but such is his yearning it almost seems he might shatter them. It persists in descending as we ultimately perceive he deactivates The Device, seizes a vast journal and quill, and reclines in a lounger. Marvin is in torment so profound it is bewildering, and powerless, he weeps. Duke Peabody observes the sobs, then commences to scribble in his study, inundated, with heaps of scrolls littered all over. Now Gaston, a wan, sly, quick-glimpsed fellow, manifests in the entryway, entering. The King and Gaston pivot to her in the portal as she drifts away. A lot of bellowing is occurring as the marauders are being collected by the Giant Group, a substantial assembly of towering folk, with Gaston perched on a chariot in the midst of all the scuffling, and his chariot begins, and as it does, Antonio, inebriated as a fox, lounges in front of a shack, a flask of rum in one hand, the seven-fingered sword in the other. He appears ghastly, unshorn, swollen-eyed, emaciated. Antonio senses a palm on his shoulders and contrasts it with his own tinier palm, and as the Deputy Giant is just about to batter Antonio's skull in, Rocky lets loose with a tremendous kick."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In a paused scene, Humperdinck is silenced while the Kid appears stronger than before. Buttercup, overwhelmed by a kneeling crowd, wakes from a nightmare in her castle bedroom, grabs a robe, and rushes to the Prince's chambers, where she finds a stunned Count Rugen. In a grove of heavily knotted trees, Humperdinck and Rugen uncover a mechanism. Rugen descends stairs, revealing a complex machine to which Westley is bound with suction cups on his body. As Rugen activates the machine, Westley struggles against his restraints in desperation, eventually crying in anguish. Rugen observes and begins writing notes, surrounded by a mess of papers. Meanwhile, Yellin, a shifty man, enters to find the Prince and Yellin engaged. Outside, the Brute Squad rounds up thieves, with Yellin overseeing from a wagon. Amidst the chaos, a drunk and disheveled Inigo sprawls with brandy and his six-fingered sword. As an Assistant Brute is about to strike Inigo, Fezzik intervenes with a powerful punch, saving him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "let us fly with a stupendous punch Fezzik Inigo feels a hand on his back and compares it to his own smaller hand and as the Assistant Brute is just about to club Inigo's brains out He looks dreadful unshaven puffyeyed gaunt a bottle of brandy in one hand the sixfingered sword in the other a large group of large men with Yellin standing on a wagon in the midst of all the scuffling and his wagon starts and as it does Inigo drunk as a skunk sprawls in front of a hovel A lot of hollering is going on as the thieves are being rounded up by the Brute Squad The Prince and Yellin turn to her in the doorway as she glides out Now Yellin a pale shifty quickeyed man appears in the doorway entering Count Rugen watches the tears then starts to write in his quarters swamped with piles of papers strewn all over he cries Westley is in anguish so deep it is dizzying and helpless The Machine picks up a large notebook and pen and sits in a chair It keeps on coming as we finally see he switches off Westley is lying on the table and he is only flesh and the chains are metal and thick but such is his desperation it almost seems he might break them water pours down the chute turning the wheel which in turn really gets The Machine going He says nothing keeps control of himself and then opens the flood gate Westley has suction cups on his head now on his temple on his heart his hands and feet it is there Count Rugen drags Westley up alongside the thing—levers and wheels and wires you name it as the tree slides back perfectly into place deeper into the grove now as Rugen searches around Rugen smiles and hurries down the stairs Humperdinck and Rugen walk into the grove of trees all of them are extraordinarily heavily knotted The trees are unusual in one respect Finally softly he begins to talk and she nods She bursts into the Prince's chambers where Count Rugen stands nearby just stunned Buttercup comes out of her nightmare alone in her castle bedroom and as she frantically grabs a robe she starts to run Buttercup is touched as before but then seems stunned as she advances on Buttercup now who is more and more panicked The crowd suddenly goes to its knees wave after wave of silent kneeling people all of them down As the scene freezes with Humperdinck caught in midsentence the Kid is half sitting now not strong yet but clearly stronger than when we first saw him and on these words as we saw before Buttercup emerges"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The crowd suddenly goes to its knees wave after wave of silent kneeling people all of them down As the scene freezes with Humperdinck caught in midsentence the Kid is half sitting now not strong yet but clearly stronger than when we first saw him and on these words as we saw before Buttercup emerges Buttercup comes out of her nightmare alone in her castle bedroom and as she frantically grabs a robe she starts to run Buttercup is touched as before but then seems stunned as she advances on Buttercup now who is more and more panicked Finally softly he begins to talk and she nods She bursts into the Prince's chambers where Count Rugen stands nearby just stunned all of them are extraordinarily heavily knotted The trees are unusual in one respect deeper into the grove now as Rugen searches around Rugen smiles and hurries down the stairs Humperdinck and Rugen walk into the grove of trees Count Rugen drags Westley up alongside the thing—levers and wheels and wires you name it as the tree slides back perfectly into place Westley has suction cups on his head now on his temple on his heart his hands and feet it is there water pours down the chute turning the wheel which in turn really gets The Machine going He says nothing keeps control of himself and then opens the flood gate It keeps on coming as we finally see he switches off Westley is lying on the table and he is only flesh and the chains are metal and thick but such is his desperation it almost seems he might break them Westley is in anguish so deep it is dizzying and helpless The Machine picks up a large notebook and pen and sits in a chair Count Rugen watches the tears then starts to write in his quarters swamped with piles of papers strewn all over he cries The Prince and Yellin turn to her in the doorway as she glides out Now Yellin a pale shifty quickeyed man appears in the doorway entering a large group of large men with Yellin standing on a wagon in the midst of all the scuffling and his wagon starts and as it does Inigo drunk as a skunk sprawls in front of a hovel A lot of hollering is going on as the thieves are being rounded up by the Brute Squad He looks dreadful unshaven puffyeyed gaunt a bottle of brandy in one hand the sixfingered sword in the other Fezzik Inigo feels a hand on his back and compares it to his own smaller hand and as the Assistant Brute is just about to club Inigo's brains out let us fly with a stupendous punch"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Westley is lying on the table and he is only flesh and the chains are metal and thick but such is his desperation it almost seems he might break them It keeps on coming as we finally see he switches off The Machine picks up a large notebook and pen and sits in a chair Westley is in anguish so deep it is dizzying and helpless he cries Count Rugen watches the tears then starts to write in his quarters swamped with piles of papers strewn all over Now Yellin a pale shifty quickeyed man appears in the doorway entering The Prince and Yellin turn to her in the doorway as she glides out A lot of hollering is going on as the thieves are being rounded up by the Brute Squad a large group of large men with Yellin standing on a wagon in the midst of all the scuffling and his wagon starts and as it does Inigo drunk as a skunk sprawls in front of a hovel a bottle of brandy in one hand the sixfingered sword in the other He looks dreadful unshaven puffyeyed gaunt Inigo feels a hand on his back and compares it to his own smaller hand and as the Assistant Brute is just about to club Inigo's brains out Fezzik let us fly with a stupendous punch As the scene freezes with Humperdinck caught in midsentence the Kid is half sitting now not strong yet but clearly stronger than when we first saw him and on these words as we saw before Buttercup emerges The crowd suddenly goes to its knees wave after wave of silent kneeling people all of them down Buttercup is touched as before but then seems stunned as she advances on Buttercup now who is more and more panicked Buttercup comes out of her nightmare alone in her castle bedroom and as she frantically grabs a robe she starts to run She bursts into the Prince's chambers where Count Rugen stands nearby just stunned Finally softly he begins to talk and she nods The trees are unusual in one respect all of them are extraordinarily heavily knotted Humperdinck and Rugen walk into the grove of trees deeper into the grove now as Rugen searches around Rugen smiles and hurries down the stairs as the tree slides back perfectly into place Count Rugen drags Westley up alongside the thing—levers and wheels and wires you name it it is there Westley has suction cups on his head now on his temple on his heart his hands and feet He says nothing keeps control of himself and then opens the flood gate water pours down the chute turning the wheel which in turn really gets The Machine going"
        }
      ]
    }
  ]
}