{
  "ground_truth": "Inigo struggles bravely under their combined weight, while the Brutes witness as the Giant bursts into flames. In the chapel, the Impressive Clergyman continues speaking as Fezzik removes the holocaust cloak and rushes forward to grab the quickly closing portcullis, swinging it upward with great effort. Yellin watches in fear. Buttercup smiles and shakes her head, knowing she is correct, while Yellin is pressed against the main gate as Westley, Inigo, and Fezzik close in. Westley whips a sword out and hands it to Fezzik. Buttercup stands there, dazed. Count Rugen and his four warriors race through the castle, stopping incredulously at a complex intersection of corridors, while Westley, Inigo, and Fezzik approach. Fezzik drags Westley, who is dragging Yellin's sword due to his weakness. As the confrontation starts, Rugen’s warriors attack, and Inigo goes wild, swiftly defeating them all before they even have a chance to fight back. Holding his sword, Rugen stands for a moment, then unexpectedly turns and runs away, with Inigo surprised but then pursuing him. Rugen runs through a half-open heavy wooden door, locking it just as Inigo throws himself against it in frustration. Fezzik, with Westley, who still cannot walk unaided, props Westley up against a large suit of armor and heads toward the intersection where Inigo's voice was heard. Fezzik gestures for Inigo to stop pounding on the heavy door and with one mighty swipe, he breaks it down. Inigo flies through as Fezzik returns to Westley. Meanwhile, the Queen is several paces ahead, and Buttercup gently stops the King to place a kiss on his forehead, surprising and pleasing him. As Inigo runs through the corridors, glancing back, he sees Inigo closely pursuing him like a streak. Fezzik, at the intersection with the large suit of armor, is puzzled by the absence of Westley, while Count Rugen continues to flee, dashing down a staircase and picking up his pace.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Inigo grapples courageously beneath their shared burden, while the Brutes observe as the Giant erupts into flames. In the chapel, the Impressive Clergyman persists in speaking as Fezzik removes the holocaust cloak and dashes forward to seize the swiftly closing portcullis, swinging it upward with great exertion. Yellin watches in terror. Buttercup grins and shakes her head, recognizing she is correct, while Yellin is pressed against the main gate as Westley, Inigo, and Fezzik advance. Westley unsheathes a sword and hands it to Fezzik. Buttercup stands there, bewildered. Count Rugen and his four combatants race through the castle, pausing incredulously at a complex junction of corridors, while Westley, Inigo, and Fezzik advance. Fezzik hauls Westley, who is trailing Yellin's sword due to his frailty. As the clash begins, Rugen’s combatants assault, and Inigo goes berserk, swiftly vanquishing them all before they even have a chance to retaliate. Holding his sword, Rugen stands momentarily, then unexpectedly turns and flees, with Inigo astonished but then tailing him. Rugen bolts through a half-open hefty wooden door, locking it just as Inigo throws himself against it in frustration. Fezzik, with Westley, who still cannot walk unaided, props Westley up against a large suit of armor and heads toward the junction where Inigo's voice was heard. Fezzik gestures for Inigo to cease pounding on the hefty door and with one mighty swipe, he breaks it down. Inigo flies through as Fezzik returns to Westley. Meanwhile, the Queen is several strides ahead, and Buttercup gently halts the King to place a kiss on his forehead, surprising and delighting him. As Inigo runs through the corridors, glancing back, he sees Inigo closely tailing him like a streak. Fezzik, at the junction with the large suit of armor, is perplexed by the absence of Westley, while Count Rugen continues to escape, dashing down a staircase and quickening his pace."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Under their combined weight, brave struggles are made by Inigo, while the Giant is burst into flames by the Brutes. In the chapel, speaking is continued by the Impressive Clergyman as the holocaust cloak is removed by Fezzik, who then rushes forward to grab the quickly closing portcullis, swinging it upward with great effort. Fear watches Yellin. Her head is smiled and shaken knowingly by Buttercup, while the main gate is pressed against Yellin by Westley, Inigo, and Fezzik as they close in. A sword is whipped out by Westley and handed to Fezzik. There stands Buttercup, dazed. Through the castle, Count Rugen and his four warriors are raced, incredulously stopping at a complex intersection of corridors as Westley, Inigo, and Fezzik approach. Westley is dragged by Fezzik, who drags Yellin's sword due to his weakness. As the confrontation starts, an attack is made by Rugen’s warriors, and Inigo, going wild, swiftly defeats them all before they have a chance to fight back. A moment is stood by Rugen, holding his sword, and then he unexpectedly turns and runs away, surprising Inigo who then pursues him. Through a half-open heavy wooden door runs Rugen, locking it just as frustration causes Inigo to throw himself against it. With Westley, who cannot walk unaided, Fezzik props him up against a large suit of armor and heads toward the intersection where Inigo's voice is heard. Gestures are made by Fezzik for Inigo to stop pounding on the heavy door, and one mighty swipe breaks it down. Through it flies Inigo as Westley is returned to by Fezzik. Meanwhile, several paces ahead is the Queen, and a gentle stop of the King is made by Buttercup to place a kiss on his forehead, surprising and pleasing him. Through the corridors runs Inigo, and glancing back, Inigo is seen closely pursuing him like a streak. At the intersection with the large suit of armor, Fezzik is puzzled by Westley's absence, while Count Rugen continues fleeing, dashing down a staircase and picking up his pace."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Inigo bravely bears their combined weight as the Brutes see the Giant ignite. In the chapel, the Impressive Clergyman speaks as Fezzik drops the holocaust cloak and lifts the closing portcullis with effort. Yellin watches fearfully. Buttercup smiles, confident, while Yellin is pinned against the gate by Westley, Inigo, and Fezzik. Westley hands Fezzik a sword. Buttercup stands dazed. Count Rugen and his four warriors speed through the castle, pausing at an intricate corridor intersection as Westley, Inigo, and Fezzik approach. Fezzik drags a weak Westley, who drags Yellin's sword. When Rugen’s warriors attack, Inigo swiftly defeats them. Rugen hesitates, then suddenly flees, with Inigo pursuing him. Rugen locks a heavy door behind him, frustrating Inigo. Fezzik supports Westley against a suit of armor and goes to Inigo, breaking down the door with one swipe. Inigo rushes through as Fezzik returns to Westley. Meanwhile, the Queen is ahead, and Buttercup kisses the King’s forehead, surprising him. Inigo, pursuing closely, sees Rugen flee, while Fezzik puzzles over Westley's absence at the armor intersection. Rugen continues down a staircase, quickening his pace."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Inigo struggles under their weight as the Giant ignites. In the chapel, the Clergyman speaks while Fezzik removes the cloak, lifting the portcullis. Yellin watches fearfully. Buttercup smiles knowingly as Westley, Inigo, and Fezzik advance. Westley hands Fezzik a sword. Buttercup stands dazed. Count Rugen and four warriors race through the castle, pausing at confusing corridors. Fezzik drags weak Westley, dragging Yellin's sword. Inigo swiftly defeats Rugen's warriors. Rugen flees, locking a wooden door as Inigo throws himself against it. Fezzik props Westley by armor, then breaks the door for Inigo, who rushes through. Meanwhile, Buttercup kisses the King gently. Rugen flees downstairs, increasing speed."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Inigo valiantly struggles under the immense, combined weight of the adversaries, while the Brutes stand back and witness in shock and awe as the Giant spontaneously bursts into enormous, ferocious flames. Meanwhile, inside the sacred confines of the chapel, the Impressive Clergyman continues his speech uninterrupted as Fezzik deftly removes the imposing holocaust cloak. With a sense of urgency, he rushes forward, seizing the rapidly closing portcullis and, with significant exertion, swings it upward. Yellin, filled with fear and apprehension, watches the scene unfold. Buttercup, with a confident smile and a shake of her head, acknowledges her correctness in judgment. Yellin finds himself pressed against the main gate as Westley, Inigo, and Fezzik advance toward him. With a swift motion, Westley unsheathes a sword and graciously hands it over to Fezzik. Buttercup remains standing there, momentarily dazed and overwhelmed by the unfolding events. \n\nDeep within the castle, Count Rugen and his retinue of four warriors race with urgency through the winding corridors, halting in disbelief at a complex intersection. Meanwhile, Westley, Inigo, and Fezzik continue their approach. Fezzik drags the weakened Westley, who struggles to carry Yellin's heavy sword due to his frailty. As the imminent confrontation begins, Rugen’s warriors launch their attack, but Inigo responds with wild, swift ferocity, effortlessly defeating them all before they can even mount a defense. Count Rugen, gripping his sword, hesitates momentarily before making an abrupt decision to turn and flee, catching Inigo by surprise. Inigo, momentarily taken aback, quickly gathers himself and begins his determined pursuit. Rugen sprints through a half-open, solid wooden door, managing to lock it just as Inigo slams against it in frustration and anger. \n\nFezzik, having left Westley who still cannot walk without assistance, props him against an imposing, large suit of armor and makes his way toward where Inigo's voice echoes through the halls. He gestures emphatically for Inigo to cease pounding on the heavy, unyielding door. With one mighty, powerful swipe, Fezzik breaks the door down. As the barrier collapses, Inigo rushes through the opening, while Fezzik returns his attention to Westley. Meanwhile, the Queen strides several paces ahead, and Buttercup, with tenderness, stops the King to plant a gentle kiss on his forehead, taking him by surprise and filling him with joy. As Inigo races through the serpentine corridors, he glances back, witnessing Inigo's relentless pursuit like a swift streak. At the intersection with the looming suit of armor, Fezzik stands perplexed by Westley's sudden absence, while Count Rugen continues his desperate flight, accelerating down a staircase in a bid to escape."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Inigo, with valiant determination, struggles under the immense and overwhelming combined weight of his relentless adversaries, while the group of Brutes, now rendered spectators, stand back in shock and awe. They watch as the Giant, as if by some inexplicable force, suddenly bursts into enormous, ferocious flames that engulf him entirely. Meanwhile, within the sacred and serene confines of the chapel, the Impressive Clergyman continues his oration, undisturbed and uninterrupted by the chaos outside, as Fezzik deftly slips off the imposing and dramatic holocaust cloak. With a great sense of urgency propelling his actions, he rushes forward with determination, grasping the rapidly descending portcullis and, with significant exertion, swings it upward to hold it open. Yellin, filled with fear and a growing sense of apprehension, can only watch as the scene unfolds before him. Buttercup, with a confident smile dancing on her lips and a knowing shake of her head, affirms her correctness in judgment. Yellin finds himself pressed helplessly against the main gate as Westley, alongside Inigo and Fezzik, steadily advances toward him. With a swift and graceful motion, Westley unsheathes a sword from its scabbard and graciously hands it over to Fezzik. Buttercup, meanwhile, remains standing there, momentarily dazed and overwhelmed by the intensity of the unfolding events around her.\n\nDeep within the winding and labyrinthine corridors of the castle, Count Rugen and his anxious retinue of four warriors race with urgent haste, their footsteps echoing through the stone halls, only to halt abruptly in disbelief when they reach a complex intersection. Meanwhile, Westley, Inigo, and Fezzik continue their determined and unyielding approach. Fezzik drags the weakened Westley, who struggles to maintain his grip on Yellin's heavy sword due to his frailty and exhaustion. As the imminent confrontation begins to take shape, Rugen’s warriors launch their attack with ferocity, but Inigo responds with wild, swift ferocity of his own, effortlessly defeating them all before they even have a chance to mount an effective defense. Count Rugen, gripping his sword tightly, hesitates for a brief moment before making the abrupt decision to turn and flee, catching Inigo by surprise with this sudden retreat. Inigo, momentarily taken aback by Rugen's actions, quickly gathers himself and begins his determined pursuit, not willing to let his quarry escape. Rugen sprints through a half-open, solid wooden door, managing to lock it just as Inigo slams against it with frustration and anger boiling over.\n\nFezzik, having left Westley propped against an imposing and large suit of armor, as Westley still cannot walk without assistance, makes his way with urgency toward where Inigo's voice reverberates and echoes through the halls. He gestures emphatically, urging Inigo to cease his relentless pounding on the heavy, unyielding door. With one mighty, powerful swipe of his arm, Fezzik breaks the door down, causing the barrier to collapse. Inigo, seizing the opportunity, rushes through the newly created opening, while Fezzik turns his attention back to Westley. Meanwhile, the Queen strides several paces ahead with regal dignity, and Buttercup, displaying tenderness and warmth, stops the King in his tracks to plant a gentle kiss on his forehead, taking him by surprise and filling him with joy. As Inigo races through the serpentine corridors with tireless energy, he glances back momentarily, witnessing his own relentless pursuit like a swift streak through the castle. At the intersection with the looming suit of armor, Fezzik stands perplexed, bewildered by Westley's sudden absence from where he had left him, while Count Rugen continues his desperate flight, accelerating his pace down a winding staircase in a frantic bid to escape."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Inigo struggles with determination, trying to maintain his balance and strength under the considerable shared weight of his companions, while the Brutes look on with amazement as the Giant, engulfed in flames, becomes a living inferno before their eyes. Meanwhile, within the confines of the chapel, the Impressive Clergyman drones on with his speech, uninterrupted by the commotion outside. Seizing the moment, Fezzik swiftly sheds the holocaust cloak and surges forward, his muscles straining as he stretches to catch the rapidly descending portcullis, mustering all his strength to lift it with a mighty swing. Yellin, caught in a grip of fear, watches this unfold. Buttercup, standing nearby, breaks into a knowing smile and shakes her head slightly, assured in her beliefs, while Yellin finds himself pressed against the solid expanse of the main gate, as Westley, Inigo, and Fezzik inexorably advance towards him. With a fluid motion, Westley draws his sword from its sheath and confidently hands it over to Fezzik. Buttercup remains rooted to her spot, momentarily overwhelmed by the unfolding events. At the same time, Count Rugen and his four warriors charge through the castle's labyrinthine passages, grinding to a halt at a particularly perplexing intersection of corridors, just as Westley, Inigo, and Fezzik draw nearer. Fezzik diligently supports Westley, who, weakened, drags Yellin's sword almost as if it's an anchor being pulled through the sea. As the confrontation intensifies, Rugen's warriors spring into action, launching their attack, but Inigo, filled with a fervor and agility that seems almost inhuman, meets them head-on, dispatching each foe with rapid precision before they can mount any defense. Rugen, clutching his sword tightly, pauses momentarily, then unexpectedly pivots and flees, leaving Inigo momentarily taken aback but soon snapping into action, darting after him. Rugen sprints through a partially open, heavy wooden door, slamming it shut and securing it just as Inigo hurls himself against its unyielding surface, venting his frustration with a growl. Fezzik, still aiding Westley, carefully props him against a nearby large suit of armor, ensuring his friend is secure before heading off in the direction of the intersection where Inigo's voice had echoed. With a commanding gesture and a wordless signal, Fezzik urges Inigo to cease his futile pounding on the door, and with one decisive, powerful swipe of his colossal hand, he shatters the door, allowing Inigo to burst through the opening as Fezzik returns to stand by Westley. Meanwhile, the Queen remains a few strides ahead, seemingly oblivious to the chaos, while Buttercup steps gently to the King, halting him with a soft touch before affectionately placing a tender kiss on his forehead, leaving him both surprised and delighted by the unexpected gesture. As Inigo races through the winding corridors, his head swivels backwards momentarily, catching sight of Rugen fleeing, pursued closely by Inigo who closes the gap like a streak of lightning. At the intersection where the imposing suit of armor stands sentinel, Fezzik glances around in confusion, noting Westley's absence and puzzling over his whereabouts, while Count Rugen presses on in his flight, dashing down a staircase with urgency, his pace increasing with every step as he seeks to escape the relentless pursuit."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Inigo perseveres under their combined weight as the Giant ignites, watched by the Brutes. In the chapel, as the Impressive Clergyman speaks, Fezzik removes the holocaust cloak, rushes to the portcullis, and hoists it with effort. Yellin observes fearfully as Buttercup smiles knowingly. With the group advancing, Westley hands a sword to Fezzik. Buttercup stands dazed as Count Rugen and his warriors navigate the castle’s winding corridors, pausing at an intersection as Westley, Inigo, and Fezzik approach. Fezzik drags a weakened Westley, the sword trailing behind. In the ensuing confrontation, Inigo swiftly defeats Rugen’s warriors. Rugen momentarily holds his ground before fleeing, with Inigo chasing him. Rugen locks a heavy door just as Inigo slams into it. Fezzik supports Westley against armor and, hearing Inigo, gestures him to stop pounding the door before breaking it down, allowing Inigo to continue his pursuit. Fezzik returns to Westley, while Buttercup surprises the King with a gentle kiss on the forehead. As Inigo speeds through the corridors, Fezzik is puzzled by Westley's absence at the intersection, while Rugen escapes down a staircase, hastening his retreat."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Inigo, a skilled swordsman on a quest for vengeance, struggles bravely under their combined weight, while the Brutes, a group of mercenaries hired for protection, witness as the Giant, once known in the village as a gentle soul, bursts into flames. In the chapel, the Impressive Clergyman, famous for his unusual speech patterns during wedding ceremonies, continues speaking as Fezzik, a man renowned for his immense strength, removes the holocaust cloak, a magical garment that renders the wearer temporarily invulnerable to fire, and rushes forward to grab the quickly closing portcullis, swinging it upward with great effort. Yellin, the castle's chief guard known for his cowardice, watches in fear. Buttercup smiles and shakes her head, knowing she is correct in her faith in her friends, while Yellin is pressed against the main gate as Westley, the heroic farm boy she loves, Inigo, and Fezzik close in. Westley, despite his weakened state from the torture he endured, whips a sword out and hands it to Fezzik. Buttercup stands there, dazed by the unfolding chaos. Count Rugen, the sadistic six-fingered man on Inigo's vendetta list, and his four warriors race through the castle, stopping incredulously at a complex intersection of corridors within the labyrinthine structure, while Westley, Inigo, and Fezzik approach. Fezzik drags Westley, who is dragging Yellin's sword due to his weakness. As the confrontation starts, Rugen’s warriors attack, and Inigo goes wild, swiftly defeating them all before they even have a chance to fight back, driven by his long-held desire for revenge. Holding his sword, Rugen stands for a moment, then unexpectedly turns and runs away, with Inigo surprised but then pursuing him, determined to avenge his father. Rugen runs through a half-open heavy wooden door, locking it just as Inigo throws himself against it in frustration. Fezzik, with Westley, who still cannot walk unaided, props Westley up against a large suit of armor that stands as a relic of past battles and heads toward the intersection where Inigo's voice was heard. Fezzik gestures for Inigo to stop pounding on the heavy door and with one mighty swipe, he breaks it down. Inigo flies through as Fezzik returns to Westley. Meanwhile, the Queen, a figure of regal authority but lacking true power in the turmoil, is several paces ahead, and Buttercup gently stops the King, a kind-hearted but ineffective ruler, to place a kiss on his forehead, surprising and pleasing him. As Inigo runs through the corridors, glancing back, he sees Rugen closely pursuing him like a streak, determined not to let his enemy escape. Fezzik, at the intersection with the large suit of armor, is puzzled by the absence of Westley, while Count Rugen continues to flee, dashing down a staircase and picking up his pace, desperate to avoid a reckoning with Inigo."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Fezzik at the intersection with the large suit of armor is puzzled by the absence of Westley while Count Rugen continues to flee dashing down a staircase and picking up his pace Inigo struggles bravely under their combined weight while the Brutes witness as the Giant bursts into flames Yellin watches in fear Count Rugen and his four warriors race through the castle stopping incredulously at a complex intersection of corridors In the chapel the Impressive Clergyman continues speaking as Fezzik removes the holocaust cloak and rushes forward to grab the quickly closing portcullis swinging it upward with great effort Buttercup smiles and shakes her head knowing she is correct while Yellin is pressed against the main gate as Westley Rugen runs through a halfopen heavy wooden door locking it just as Inigo throws himself against it in frustration In the chapel the Impressive Clergyman continues speaking as Fezzik removes the holocaust cloak and rushes forward to grab the quickly closing portcullis swinging it upward with great effort Yellin watches in fear Buttercup smiles and shakes her head knowing she is correct while Yellin is pressed against the main gate as Westley Inigo and Fezzik close in Westley whips a sword out and hands it to Fezzik Buttercup stands there dazed Count Rugen and his four warriors race through the castle stopping incredulously at a complex intersection of corridors while Westley Inigo and Fezzik approach Fezzik drags Westley who is dragging Yellin's sword due to his weakness As the confrontation starts Rugen’s warriors attack and Inigo goes wild swiftly defeating them all before they even have a chance to fight back Holding his sword Rugen stands for a moment then unexpectedly turns and runs away with Inigo surprised but then pursuing him Holding his sword Rugen stands for a moment then unexpectedly turns and runs away with Inigo surprised but then pursuing him Rugen runs through a halfopen heavy wooden door locking it just as Inigo throws himself against it in frustration Meanwhile the Queen is several paces ahead and Buttercup gently stops the King to place a kiss on his forehead surprising and pleasing him while Westley Inigo and Fezzik approach Fezzik drags Westley who is dragging Yellin's sword due to his weakness Fezzik with Westley who still cannot walk unaided props Westley up against a large suit of armor and heads toward the intersection where Inigo's voice was heard Fezzik gestures for Inigo to stop pounding on the heavy door and with one mighty swipe he breaks it down Inigo flies through as Fezzik returns to Westley Meanwhile the Queen is several paces ahead and Buttercup gently stops the King to place a kiss on his forehead surprising and pleasing him Inigo struggles bravely under their combined weight while the Brutes witness as the Giant bursts into flames As Inigo runs through the corridors glancing back he sees Inigo closely pursuing him like a streak Fezzik at the intersection with the large suit of armor is puzzled by the absence of Westley while Count Rugen continues to flee dashing down a staircase and picking up his pace"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Inigo struggles bravely under their combined weight while the Brutes witness as the Giant bursts into flames. In the chapel the Impressive Clergyman continues speaking as Fezzik removes the holocaust cloak and rushes forward to grab the quickly closing portcullis swinging it upward with great effort. Yellin watches in fear. Buttercup smiles and shakes her head knowing she is correct while Yellin is pressed against the main gate as Westley. Inigo and Fezzik close in. Westley whips a sword out and hands it to Fezzik. Buttercup stands there dazed. Count Rugen and his four warriors race through the castle stopping incredulously at a complex intersection of corridors. while Westley Inigo and Fezzik approach Fezzik drags Westley who is dragging Yellin's sword due to his weakness. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. As the confrontation starts Rugen’s warriors attack and Inigo goes wild swiftly defeating them all before they even have a chance to fight back. Holding his sword Rugen stands for a moment then unexpectedly turns and runs away with Inigo surprised but then pursuing him. Rugen runs through a halfopen heavy wooden door locking it just as Inigo throws himself against it in frustration. Fezzik with Westley who still cannot walk unaided props. Westley up against a large suit of armor and heads toward the intersection where Inigo's voice was heard. Fezzik gestures for Inigo to stop pounding on the heavy door and with one mighty swipe he breaks it down. Inigo flies through as Fezzik returns to Westley. Meanwhile the Queen is several paces ahead and Buttercup gently stops the King to place a kiss on his forehead surprising and pleasing him. As Inigo runs through the corridors glancing back he sees Inigo closely pursuing him like a streak. Fezzik at the intersection with the large suit of armor is puzzled by the absence of Westley while Count Rugen continues to flee dashing down a staircase and picking up his pace."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Inigo struggles bravely under their combined weight while the Brutes witness as the Giant bursts into flames. In the chapel the Impressive Clergyman continues speaking as Fezzik removes the holocaust cloak and rushes forward to grab the quickly closing portcullis swinging it upward with great effort. Yellin watches in fear. Buttercup smiles and shakes her head knowing she is correct while Yellin is pressed against the main gate as Westley. Inigo and Fezzik close in. Westley whips a sword out and hands it to Fezzik. Buttercup stands there dazed. Count Rugen and his four warriors race through the castle stopping incredulously at a complex intersection of corridors. while Westley Inigo and Fezzik approach Fezzik drags Westley who is dragging Yellin's sword due to his weakness. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. As the confrontation starts Rugen’s warriors attack and Inigo goes wild swiftly defeating them all before they even have a chance to fight back. Holding his sword Rugen stands for a moment then unexpectedly turns and runs away with Inigo surprised but then pursuing him. Rugen runs through a halfopen heavy wooden door locking it just as Inigo throws himself against it in frustration. Fezzik with Westley who still cannot walk unaided props. Westley up against a large suit of armor and heads toward the intersection where Inigo's voice was heard. Fezzik gestures for Inigo to stop pounding on the heavy door and with one mighty swipe he breaks it down. Inigo flies through as Fezzik returns to Westley. Meanwhile the Queen is several paces ahead and Buttercup gently stops the King to place a kiss on his forehead surprising and pleasing him. As Inigo runs through the corridors glancing back he sees Inigo closely pursuing him like a streak. Fezzik at the intersection with the large suit of armor is puzzled by the absence of Westley while Count Rugen continues to flee dashing down a staircase and picking up his pace."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Inigo struggles bravely under their combined weight while the Brutes witness as the Giant bursts into flames. In the chapel the Impressive Clergyman continues speaking as Fezzik removes the holocaust cloak and rushes forward to grab the quickly closing portcullis swinging it upward with great effort. Yellin watches in fear. Buttercup smiles and shakes her head knowing she is correct while Yellin is pressed against the main gate as Westley. Inigo and Fezzik close in. Fezzik gestures for Inigo to stop pounding on the heavy door and with one mighty swipe he breaks it down. Inigo flies through as Fezzik returns to Westley. Meanwhile the Queen is several paces ahead and Buttercup gently stops the King to place a kiss on his forehead surprising and pleasing him. As Inigo runs through the corridors glancing back he sees Inigo closely pursuing him like a streak. Fezzik at the intersection with the large suit of armor is puzzled by the absence of Westley while Count Rugen continues to flee dashing down a staircase and picking up his pace."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Inigo struggles bravely under their combined weight while the Brutes witness as the Giant bursts into flames. In the chapel the Impressive Clergyman continues speaking as Fezzik removes the holocaust cloak and rushes forward to grab the quickly closing portcullis swinging it upward with great effort. As Inigo runs through the corridors glancing back he sees Inigo closely pursuing him like a streak. Fezzik at the intersection with the large suit of armor is puzzled by the absence of Westley while Count Rugen continues to flee dashing down a staircase and picking up his pace."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Inigo struggles bravely under their combined weight, while the kittens witness as the mailbox bursts into flames. In the chapel, the Friendly Dragon continues speaking as a dancer removes the holocaust cloak and rushes forward to grab the quickly closing portcullis, swinging it upward with great effort. A tree watches in fear. A rabbit smiles and shakes her head, knowing she is correct, while the tree is pressed against the main gate as a penguin, Inigo, and a dancer close in. A penguin whips a sword out and hands it to a dancer. A rabbit stands there, dazed. Count Dracula and his four bears race through the castle, stopping incredulously at a complex intersection of corridors, while a penguin, Inigo, and a dancer approach. A dancer drags a penguin, who is dragging the tree's sword due to his weakness. As the confrontation starts, Dracula’s bears attack, and Inigo goes wild, swiftly defeating them all before they even have a chance to fight back. Holding his sword, Dracula stands for a moment, then unexpectedly turns and runs away, with Inigo surprised but then pursuing him. Dracula runs through a half-open heavy wooden door, locking it just as Inigo throws himself against it in frustration. A dancer, with a penguin, who still cannot walk unaided, props a penguin up against a large suit of armor and heads toward the intersection where Inigo's voice was heard. A dancer gestures for Inigo to stop pounding on the heavy door and with one mighty swipe, he breaks it down. Inigo flies through as a dancer returns to a penguin. Meanwhile, the butterfly is several paces ahead, and a rabbit gently stops the squirrel to place a kiss on his forehead, surprising and pleasing him. As Inigo runs through the corridors, glancing back, he sees Inigo closely pursuing him like a streak. A dancer, at the intersection with the large suit of armor, is puzzled by the absence of a penguin, while Count Dracula continues to flee, dashing down a staircase and picking up his pace."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Inigo struggles bravely under their combined weight, while the Brutes witness as the Giant bursts into confetti. In the gallery, the Impressive Conductor continues speaking as Fezzik removes the raincoat and rushes forward to grab the quickly closing elevator door, swinging it upward with great effort. Yellin watches in fear. Buttercup smiles and shakes her head, knowing she is correct, while Yellin is pressed against the central archway as Westley, Inigo, and Fezzik close in. Westley whips a spear out and hands it to Fezzik. Buttercup stands there, dazed. Count Rugen and his four warriors race through the mansion, stopping incredulously at a complex intersection of staircases, while Westley, Inigo, and Fezzik approach. Fezzik drags Westley, who is dragging Yellin's umbrella due to his weakness. As the confrontation starts, Rugen’s warriors attack, and Inigo goes wild, swiftly defeating them all before they even have a chance to fight back. Holding his mace, Rugen stands for a moment, then unexpectedly turns and runs away, with Inigo surprised but then pursuing him. Rugen runs through a half-open heavy glass door, locking it just as Inigo throws himself against it in frustration. Fezzik, with Westley, who still cannot walk unaided, props Westley up against a large tapestry and heads toward the intersection where Inigo's voice was heard. Fezzik gestures for Inigo to stop pounding on the glass door and with one mighty swipe, he breaks it down. Inigo flies through as Fezzik returns to Westley. Meanwhile, the Queen is several paces ahead, and Buttercup gently stops the King to place a note on his forehead, surprising and pleasing him. As Inigo runs through the staircases, glancing back, he sees Inigo closely pursuing him like a streak. Fezzik, at the intersection with the large tapestry, is puzzled by the absence of Westley, while Count Rugen continues to flee, dashing down a slope and picking up his pace."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Inigo dances gracefully under their combined weight, while the Brutes observe as the Giant evaporates into mist. In the chapel, the Impressive Clergyman silently meditates as Fezzik dons the holocaust cloak and leaps forward to tickle the quickly closing portcullis, nudging it upward with great effort. Yellin trembles in fear. Buttercup giggles and tilts her head, knowing she is correct, while Yellin is glued to the main gate as Westley, Inigo, and Fezzik glide in. Westley plucks a flute out and hands it to Fezzik. Buttercup stands there, enchanted. Count Rugen and his four warriors weave through the castle, hesitating incredulously at a complex intersection of corridors, while Westley, Inigo, and Fezzik saunter. Fezzik carries Westley, who is dragging Yellin's sword due to his weakness. As the confrontation begins, Rugen’s warriors retreat, and Inigo calms down, peacefully disarming them all before they even have a chance to argue back. Holding his sword, Rugen pauses for a moment, then unexpectedly recites and skips away, with Inigo astonished but then waltzing after him. Rugen slides through a half-open heavy wooden door, securing it just as Inigo leans against it in frustration. Fezzik, with Westley, who still cannot dance unaided, drapes Westley over a large suit of armor and strolls toward the intersection where Inigo's voice was heard. Fezzik encourages Inigo to stop tapping on the heavy door and with one mighty hug, he crumbles it down. Inigo twirls through as Fezzik returns to Westley. Meanwhile, the Queen is several paces ahead, and Buttercup gently halts the King to place a blossom in his hair, surprising and delighting him. As Inigo skips through the corridors, glancing back, he sees Inigo closely twirling after him like a wisp. Fezzik, at the intersection with the large suit of armor, is befuddled by the absence of Westley, while Count Rugen continues to prance, skipping down a staircase and lightening his pace."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Darth Vader struggles bravely under their combined weight, while the Frogs witness as the Candle bursts into flames. In the greenhouse, the Impressive Accountant continues speaking as the Elephant removes the invisibility cloak and rushes forward to grab the quickly closing drawbridge, swinging it upward with great effort. The Librarian watches in fear. The Cupcake smiles and shakes its head, knowing it is correct, while the Librarian is pressed against the main gate as the Hamster, Darth Vader, and the Elephant close in. The Hamster whips a wand out and hands it to the Elephant. The Cupcake stands there, dazed. The Wizard and his four automobiles race through the swamp, stopping incredulously at a complex intersection of bridges, while the Hamster, Darth Vader, and the Elephant approach. The Elephant drags the Hamster, who is dragging the Librarian's wand due to its weakness. As the confrontation starts, the Wizard’s automobiles attack, and Darth Vader goes wild, swiftly defeating them all before they even have a chance to fight back. Holding its wand, the Wizard stands for a moment, then unexpectedly turns and runs away, with Darth Vader surprised but then pursuing it. The Wizard runs through a half-open heavy metal gate, locking it just as Darth Vader throws itself against it in frustration. The Elephant, with the Hamster, who still cannot walk unaided, props the Hamster up against a large bouquet of flowers and heads toward the intersection where Darth Vader's voice was heard. The Elephant gestures for Darth Vader to stop pounding on the heavy gate and with one mighty swipe, it breaks it down. Darth Vader flies through as the Elephant returns to the Hamster. Meanwhile, the Pianist is several paces ahead, and the Cupcake gently stops the Flutist to place a kiss on its forehead, surprising and pleasing it. As Darth Vader runs through the bridges, glancing back, it sees Darth Vader closely pursuing it like a flash. The Elephant, at the intersection with the large bouquet of flowers, is puzzled by the absence of the Hamster, while the Wizard continues to flee, dashing down a ramp and picking up its pace."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Inigo struggles awkwardly under their combined weight, while the Brutes observe as the Giant melts into sand. In the chapel, the Humble Baker continues cleaning as Fezzik drops the holocaust cloak and hops forward to tickle the slowly closing portcullis, twirling it upward with great effort. Yellin watches in confusion. Buttercup frowns and nods her head, believing she is incorrect, while Yellin is pinned against the main gate as Westley, Inigo, and Fezzik drift in. Westley flicks a wand out and hands it to Fezzik. Buttercup stands there, amused. Count Rugen and his four elephants waddle through the castle, pausing incredulously at a complex web of corridors, while Westley, Inigo, and Fezzik float. Fezzik carries Westley, who is dragging Yellin's broom due to his weakness. As the dance begins, Rugen’s elephants stampede, and Inigo goes wild, swiftly charming them all before they even have a chance to dance back. Holding his sandal, Rugen stands for a moment, then unexpectedly turns and waddles away, with Inigo bemused but then prancing after him. Rugen waddles through a half-open heavy velvet curtain, locking it just as Inigo throws himself against it in irritation. Fezzik, with Westley, who still cannot skate unaided, props Westley up against a large houseplant and strolls toward the web where Inigo's melody was heard. Fezzik gestures for Inigo to stop tapping on the heavy curtain and with one mighty flick, he zips it open. Inigo floats through as Fezzik returns to Westley. Meanwhile, the Queen is several leaps ahead, and Buttercup gently halts the King to place a napkin on his forehead, surprising and amusing him. As Inigo waltzes through the corridors, glancing back, he sees Inigo closely prancing after him like a breeze. Fezzik, at the web with the large houseplant, is puzzled by the absence of Westley, while Count Rugen continues to scurry, rolling down a ramp and picking up his rhythm."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Inigo struggles awkwardly under their combined weight, while the Brutes observe as the Giant explodes into confetti. In the observatory, the Impressive Clergyman doodles while Fezzik discards the thunderbolt raincoat and tiptoes forward to tickle the slowly closing drawbridge, pivoting it sideways with minimal effort. Yellin gawks in confusion. Buttercup chuckles and scratches her ear, aware she is incorrect, while Yellin is squeezed against the main hedge as Westley, Inigo, and Fezzik roll in. Westley flicks a trumpet out and hands it to Fezzik. Buttercup stands there, mesmerized. Count Rugen and his four gymnasts prance through the fortress, halting skeptically at a tangled maze of tunnels, while Westley, Inigo, and Fezzik advance. Fezzik lugs Westley, who is dragging Yellin's umbrella due to his fatigue. As the spectacle begins, Rugen’s gymnasts perform, and Inigo goes ballistic, skillfully dazzling them all before they even have a chance to react. Holding his umbrella, Rugen pauses for a moment, then whimsically pirouettes and skips away, with Inigo bewildered but then following him. Rugen glides through a partly-open massive golden gate, sealing it just as Inigo flings himself against it in annoyance. Fezzik, with Westley, who still cannot hop unaided, props Westley up against a large sculpture and ambles toward the tunnel where Inigo's laughter was heard. Fezzik signals for Inigo to stop tapping on the massive gate and with one graceful twirl, he knocks it over. Inigo flutters through as Fezzik returns to Westley. Meanwhile, the Queen is several leaps ahead, and Buttercup gently escorts the King to plant a daisy on his sleeve, bizarrely amusing him. As Inigo races through the tunnels, glancing back, he sees Rugen closely fleeing like a blur. Fezzik, at the tunnel with the large sculpture, is baffled by the disappearance of Westley, while Count Rugen continues to dash, leaping down a slide and increasing his speed."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Pedro maneuvers awkwardly beneath their collective burden, while the Dinosaurs observe as the Elephant explodes into ice. In the sanctuary, the Distinguished Magician keeps chanting as Fergus discards the raincoat and dashes onward to seize the slowly descending drawbridge, swinging it downward with heavy exertion. Marvin observes in terror. Daisy grins and nods her head, believing she is mistaken, while Marvin is squeezed against the small door as Wallace, Pedro, and Fergus close in. Wallace flicks a pen out and passes it to Fergus. Daisy stands nearby, bewildered. Duke Rugen and his three acrobats jog through the mansion, halting skeptically at a simple junction of hallways, while Wallace, Pedro, and Fergus advance. Fergus pushes Wallace, who is dragging Marvin's pen due to his feebleness. As the encounter unfolds, Rugen’s acrobats retreat, and Pedro goes sluggish, swiftly baffling them all before they even have a moment to advance. Wielding his pen, Rugen hesitates for a second, then surprisingly turns and ambles away, with Pedro shocked but then tailing him. Rugen ambles through a half-open narrow glass gate, securing it just as Pedro hurls himself against it in dismay. Fergus, along with Wallace, who still cannot sit unaided, props Wallace up against a compact barrel of rice and moves toward the junction where Pedro's whistle was noticed. Fergus waves for Pedro to quit pounding on the narrow gate and with one soft pat, he opens it up. Pedro glides through as Fergus returns to Wallace. Meanwhile, the Duke is many strides ahead, and Daisy gently halts the Duke to put a hug on his shoulder, bewildering and delighting him. As Pedro trots through the hallways, peering forward, he spots Pedro distantly tailing him like a shadow. Fergus, at the junction with the compact barrel of rice, is perplexed by the presence of Wallace, while Duke Rugen persists to saunter, moving up a ladder and reducing his pace."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Inigo struggles bravely under their combined weight, while the Brutes watch as the Giant bursts into flames. In the chapel, the Clergyman continues speaking as Fezzik removes the cloak and rushes to lift the closing portcullis. Yellin, afraid, watches as Westley, Inigo, and Fezzik approach. Westley draws a sword and hands it to Fezzik, while Buttercup stands dazed. Count Rugen and his warriors race through the castle, halting at a complex corridor intersection, as Westley and his group approach. Fezzik drags Westley, who struggles with Yellin's sword. Rugen’s men attack, and Inigo defeats them swiftly. Rugen momentarily stands, then unexpectedly flees, with Inigo chasing him. Rugen locks a heavy door just as Inigo reaches it. Fezzik, with Westley, who still needs support to walk, returns to the confrontation, breaking the door down with one swipe. Inigo bursts through as Fezzik returns to Westley. Meanwhile, the Queen is ahead, and Buttercup surprises the King with a kiss. Inigo continues pursuing Rugen, who flees down a staircase."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Fezzik at the intersection with the large suit of armor is puzzled by the absence of Westley while Count Rugen continues to flee dashing down a staircase and picking up his pace As Inigo runs through the corridors glancing back he sees Inigo closely pursuing him like a streak Meanwhile the Queen is several paces ahead and Buttercup gently stops the King to place a kiss on his forehead surprising and pleasing him Inigo flies through as Fezzik returns to Westley Fezzik gestures for Inigo to stop pounding on the heavy door and with one mighty swipe he breaks it down Westley up against a large suit of armor and heads toward the intersection where Inigo's voice was heard Fezzik with Westley who still cannot walk unaided props Rugen runs through a halfopen heavy wooden door locking it just as Inigo throws himself against it in frustration Holding his sword Rugen stands for a moment then unexpectedly turns and runs away with Inigo surprised but then pursuing him As the confrontation starts Rugen’s warriors attack and Inigo goes wild swiftly defeating them all before they even have a chance to fight back while Westley Inigo and Fezzik approach Fezzik drags Westley who is dragging Yellin's sword due to his weakness Count Rugen and his four warriors race through the castle stopping incredulously at a complex intersection of corridors Buttercup stands there dazed Westley whips a sword out and hands it to Fezzik Inigo and Fezzik close in Buttercup smiles and shakes her head knowing she is correct while Yellin is pressed against the main gate as Westley Yellin watches in fear In the chapel the Impressive Clergyman continues speaking as Fezzik removes the holocaust cloak and rushes forward to grab the quickly closing portcullis swinging it upward with great effort Inigo struggles bravely under their combined weight while the Brutes witness as the Giant bursts into flames"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Fezzik gestures for Inigo to stop pounding on the heavy door and with one mighty swipe he breaks it down Westley up against a large suit of armor and heads toward the intersection where Inigo's voice was heard Inigo and Fezzik close in As the confrontation starts Rugen’s warriors attack and Inigo goes wild swiftly defeating them all before they even have a chance to fight back Westley whips a sword out and hands it to Fezzik Inigo flies through as Fezzik returns to Westley As Inigo runs through the corridors glancing back he sees Inigo closely pursuing him like a streak Buttercup stands there dazed Fezzik with Westley who still cannot walk unaided props Meanwhile the Queen is several paces ahead and Buttercup gently stops the King to place a kiss on his forehead surprising and pleasing him Holding his sword Rugen stands for a moment then unexpectedly turns and runs away with Inigo surprised but then pursuing him In the chapel the Impressive Clergyman continues speaking as Fezzik removes the holocaust cloak and rushes forward to grab the quickly closing portcullis swinging it upward with great effort Rugen runs through a halfopen heavy wooden door locking it just as Inigo throws himself against it in frustration Yellin watches in fear Fezzik at the intersection with the large suit of armor is puzzled by the absence of Westley while Count Rugen continues to flee dashing down a staircase and picking up his pace Count Rugen and his four warriors race through the castle stopping incredulously at a complex intersection of corridors while Westley Inigo and Fezzik approach Fezzik drags Westley who is dragging Yellin's sword due to his weakness Inigo struggles bravely under their combined weight while the Brutes witness as the Giant bursts into flames Buttercup smiles and shakes her head knowing she is correct while Yellin is pressed against the main gate as Westley"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Holding his sword Rugen stands for a moment then unexpectedly turns and runs away with Inigo surprised but then pursuing him Rugen runs through a halfopen heavy wooden door locking it just as Inigo throws himself against it in frustration Fezzik with Westley who still cannot walk unaided props Westley up against a large suit of armor and heads toward the intersection where Inigo's voice was heard Fezzik gestures for Inigo to stop pounding on the heavy door and with one mighty swipe he breaks it down Inigo flies through as Fezzik returns to Westley Meanwhile the Queen is several paces ahead and Buttercup gently stops the King to place a kiss on his forehead surprising and pleasing him As Inigo runs through the corridors glancing back he sees Inigo closely pursuing him like a streak Fezzik at the intersection with the large suit of armor is puzzled by the absence of Westley while Count Rugen continues to flee dashing down a staircase and picking up his pace Inigo struggles bravely under their combined weight while the Brutes witness as the Giant bursts into flames In the chapel the Impressive Clergyman continues speaking as Fezzik removes the holocaust cloak and rushes forward to grab the quickly closing portcullis swinging it upward with great effort Yellin watches in fear Buttercup smiles and shakes her head knowing she is correct while Yellin is pressed against the main gate as Westley Inigo and Fezzik close in Westley whips a sword out and hands it to Fezzik Buttercup stands there dazed Count Rugen and his four warriors race through the castle stopping incredulously at a complex intersection of corridors while Westley Inigo and Fezzik approach Fezzik drags Westley who is dragging Yellin's sword due to his weakness As the confrontation starts Rugen’s warriors attack and Inigo goes wild swiftly defeating them all before they even have a chance to fight back"
        }
      ]
    }
  ]
}