{
  "ground_truth": "Vizzini munches on an apple while holding a knife pointed at Buttercup's throat, and she is blindfolded. A picnic spread is laid out with a tablecloth, two goblets, a small leather wine container, some cheese, and a couple of apples on a lovely spot high on the edge of a mountain path with a view to the sea. The Man In Black comes running around the path, sees Vizzini, and slows. The two men study each other, and the Man In Black nods and comes nearer while Vizzini pushes his knife harder against Buttercup's throat. Buttercup gasps against the pain as the Man In Black stops fast and nods again. Vizzini fills the goblets with wine as the Man In Black pulls a small packet from his clothing and hands it to Vizzini. As Vizzini's pleasure grows, the Man In Black's decreases, and Vizzini suddenly points behind the Man In Black, who turns to look. Vizzini switches the goblets while the Man In Black's head is turned, and Vizzini starts to laugh as they both pick up their goblets. Vizzini hesitates, then drinks after the Man In Black, and he sits silently, watching the Man In Black, until he falls over dead. The Man In Black steps past Vizzini's corpse, removes Buttercup's blindfold and bindings, and she notices Vizzini lying dead. The Man In Black pulls her to her feet and leads her off the mountain path into untraveled terrain, where Fezzik fought the Man In Black. The camera pulls back to reveal the Prince kneeling and inspecting the sand, with the others waiting behind him. He leaps onto his horse, and they charge off. The Man In Black drags Buttercup, who sometimes stumbles until she is close to exhaustion, and then he lets go of her and cocks back a fist. Buttercup flinches but does not retreat. The picnic is spread as before, and the camera pulls back to reveal the Prince kneeling by Vizzini's body as the others ride up.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Vizzini chews on an apple while holding a dagger aimed at Buttercup's neck, and she is blindfolded. A picnic layout is arranged with a tablecloth, two chalices, a small leather wine container, some cheese, and a pair of apples on a lovely spot high on the edge of a mountain trail with a view to the sea. The Man In Black comes running along the trail, notices Vizzini, and decelerates. The two men observe each other, and the Man In Black nods and approaches nearer while Vizzini presses his dagger harder against Buttercup's neck. Buttercup gasps against the pain as the Man In Black halts quickly and nods again. Vizzini fills the chalices with wine as the Man In Black pulls a small packet from his garment and hands it to Vizzini. As Vizzini's pleasure grows, the Man In Black's diminishes, and Vizzini suddenly gestures behind the Man In Black, who turns to look. Vizzini switches the chalices while the Man In Black's head is turned, and Vizzini starts to chuckle as they both pick up their chalices. Vizzini hesitates, then drinks after the Man In Black, and he sits silently, watching the Man In Black, until he collapses dead. The Man In Black steps past Vizzini's body, removes Buttercup's blindfold and bindings, and she notices Vizzini lying dead. The Man In Black pulls her to her feet and guides her off the mountain trail into untraveled terrain, where Fezzik battled the Man In Black. The camera pulls back to reveal the Prince kneeling and inspecting the sand, with the others waiting behind him. He leaps onto his steed, and they charge off. The Man In Black drags Buttercup, who occasionally stumbles until she is near to exhaustion, and then he lets go of her and draws back a fist. Buttercup flinches but does not retreat. The picnic is arranged as before, and the camera pulls back to reveal the Prince kneeling by Vizzini's body as the others ride up."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Vizzini is munching on an apple while a knife is held pointed at Buttercup's throat, and she blinds herself. A tablecloth, two goblets, a small leather wine container, some cheese, and a couple of apples are spread out on a lovely spot high on the edge of a mountain path with a view to the sea. The Man In Black runs around the path, sees Vizzini, and slows. The two men are studied by each other, and the Man In Black nods and comes nearer while the knife is pushed harder by Vizzini against Buttercup's throat. Buttercup gasps against the pain as the Man In Black stops fast and nods again. The goblets are filled with wine by Vizzini as a small packet is pulled by the Man In Black from his clothing and is handed to Vizzini. As the Man In Black's pleasure decreases, Vizzini's pleasure is growing, and suddenly, something is pointed at by Vizzini behind the Man In Black, who turns to look. The goblets are switched by Vizzini while the Man In Black turns his head, and Vizzini starts to laugh as their goblets are picked up. There is hesitation by Vizzini, who then drinks after the Man In Black, and Vizzini sits silently, while watching the Man In Black, until he is fallen over dead. Vizzini's corpse is stepped past by the Man In Black, Buttercup's blindfold and bindings are removed by him, and Vizzini is noticed by her lying dead. Buttercup is pulled to her feet by the Man In Black and is led off the mountain path into untraveled terrain, where the Man In Black fought Fezzik. The camera pulls back to reveal the Prince kneeling and inspecting the sand, with the others waiting behind him. He leaps onto his horse, and they charge off. Buttercup is dragged by the Man In Black, who sometimes stumbles until she is close to exhaustion, and then her hand is let go of, and he cocks back a fist. A flinch is made by Buttercup but does not retreat. The picnic is spread as before, and the camera pulls back to reveal the Prince kneeling by Vizzini's body as the others ride up."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Vizzini eats an apple, holding a knife at Buttercup's throat while she's blindfolded. A picnic is spread with goblets, a wine container, cheese, and apples on a scenic mountain path with a sea view. The Man In Black runs up, sees Vizzini, and approaches cautiously as Vizzini presses the knife harder on Buttercup. After exchanging nods, Vizzini pours wine, and the Man In Black hands him a packet. Vizzini slyly switches the goblets while the Man In Black looks away, and they both drink. Vizzini laughs but then falls dead as the Man In Black watches. He frees Buttercup, who sees Vizzini's corpse, and leads her off the path. The scene shifts to the Prince inspecting the sand then charging off on horseback. Meanwhile, the Man In Black drags Buttercup until she's nearly exhausted and momentarily raises his fist. Buttercup flinches but stands firm. The camera reveals the Prince by Vizzini's body as his group arrives."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Vizzini eats an apple with a knife at Buttercup's blindfolded throat at a picnic on a mountain edge with a sea view. The Man In Black approaches carefully, and Vizzini applies pressure to Buttercup's throat. Vizzini fills goblets, receives a packet from the Man In Black, and switches goblets after pointing to distract him. Both drink, but Vizzini dies. The Man In Black frees Buttercup, leading her off the path into difficult terrain where Fezzik fought him. The Prince inspects Vizzini's body, then rides off with others following. The Man In Black drags Buttercup until she almost collapses, then threatens her. The camera shows the Prince by Vizzini's corpse as the others arrive."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Vizzini nonchalantly munches on an apple, all the while clutching a sharp knife that is menacingly pointed right at Buttercup's vulnerable throat, and she is, regrettably, blindfolded. A delightful picnic spread is thoughtfully arranged, complete with a neatly laid-out tablecloth, two elegant goblets, a small, rustic leather wine container, some delectable cheese, and a couple of crisp apples. This picturesque scene is situated on a charming, elevated spot high on the edge of a winding mountain path, offering a breathtaking view that extends all the way to the expansive sea. As the Man In Black comes jogging around the winding path, he catches sight of Vizzini, prompting him to gradually slow his pace. The two men engage in a silent exchange, studying each other intently, before the Man In Black nods subtly and cautiously approaches closer. Meanwhile, Vizzini, feeling the urgency, presses the knife even harder against Buttercup's throat, causing her to gasp audibly from the sharp pain. The Man In Black comes to an abrupt halt, nodding once more, acknowledging the situation. Vizzini, without hesitation, fills the goblets with wine while the Man In Black reaches into his clothing, retrieving a small packet to hand over to Vizzini. As Vizzini's sense of satisfaction and excitement visibly increases, the Man In Black's expression becomes more subdued. Suddenly, Vizzini points dramatically behind the Man In Black, prompting him to turn and look. Seizing this opportunity, Vizzini swiftly switches the goblets while the Man In Black's attention is diverted, and then bursts into laughter as they both lift their goblets. Vizzini, after a brief hesitation, consumes his drink following the Man In Black, then quietly sits, observing the Man In Black with anticipation. Moments later, Vizzini collapses, lifeless. The Man In Black, unfazed, steps forward past Vizzini's motionless body, removes Buttercup's blindfold and restraints, at which point she notices Vizzini lying dead. The Man In Black then pulls her up to her feet and guides her away from the mountain path, leading her into uncharted terrain where Fezzik once engaged him in battle. The camera pulls back, revealing the Prince in a kneeling position, meticulously inspecting the sand, with his companions awaiting his next move. He swiftly mounts his horse, and they charge off at a rapid pace. The Man In Black, still dragging Buttercup along, sometimes causing her to stumble until she is near exhaustion, finally releases her and raises a threatening fist. Buttercup reacts by flinching, yet she stands her ground, refusing to retreat. The picnic setup remains just as it was before, and the camera pulls back once again to show the Prince kneeling beside Vizzini's lifeless body as the others arrive on the scene."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Vizzini casually munches on an apple with a nonchalant air, all the while tightly grasping a sharp-edged knife that is pointed in a menacing manner directly at Buttercup's vulnerable throat; unfortunately for her, she is blindfolded. The setting is a delightful picnic scene, meticulously arranged with care. A neatly laid-out tablecloth provides the backdrop, accompanied by two elegant goblets positioned with precision, a small, rustic leather container of wine, some delectable cheese, and a couple of fresh, crisp apples. This picturesque tableau is set on a charming, elevated spot that rests high on the edge of a winding and treacherous mountain path, which offers a breathtaking view that stretches all the way to meet the endless expanse of the sea.\n\nAs the Man In Black rounds the bend, jogging along the winding path with purpose, he catches sight of Vizzini, who captures his attention. This prompts the Man In Black to gradually slow his pace, adopting a more cautious approach. The two men engage in an intense, silent exchange, both studying each other with keen interest, until finally, the Man In Black nods subtly and cautiously moves closer. At the same time, feeling the urgency of the moment, Vizzini presses the knife even harder against Buttercup's throat, intensifying the threat and causing her to gasp audibly in response to the sharp pain.\n\nThe Man In Black comes to an abrupt halt, acknowledging the precarious situation with another nod. Without missing a beat, Vizzini fills the goblets with wine from the leather container, while the Man In Black, with deliberate movements, reaches inside his clothing to retrieve a small packet, which he then hands over to Vizzini. As Vizzini's sense of satisfaction and excitement visibly increases with this exchange, the expression on the Man In Black's face becomes more subdued and contemplative. Suddenly, Vizzini points dramatically behind the Man In Black, prompting him to turn and look in the indicated direction. Taking advantage of this brief distraction, Vizzini swiftly switches the goblets with a deft maneuver, and as the Man In Black's attention returns, Vizzini bursts into confident laughter as they both lift their goblets. After a brief moment of hesitation, Vizzini drinks following the Man In Black's lead, and then he quietly sits back, observing the Man In Black with great anticipation.\n\nMoments later, Vizzini collapses, lifeless and motionless. The Man In Black, unfazed by the turn of events, steps forward calmly past Vizzini's now still body. He removes Buttercup's blindfold and loosens her restraints, and it is at this moment that she notices Vizzini lying dead. Gently but firmly, the Man In Black pulls her up to her feet and proceeds to guide her away from the mountain path, leading her cautiously into the vast, uncharted terrain where Fezzik once engaged him in battle. The camera pulls back to reveal the Prince, positioned with one knee on the ground, meticulously inspecting the sand. His companions stand by, waiting patiently for his next decisive move. The Prince swiftly mounts his horse with urgency, and they all charge off at a rapid pace.\n\nThe Man In Black, still dragging Buttercup along the rugged terrain, occasionally causes her to stumble until she is near exhaustion. He finally releases her and raises a fist in a threatening gesture. Buttercup, although she flinches in reaction, stands her ground with determination, refusing to retreat. The picnic setup remains untouched, just as it was before, and the camera pulls back once again to show the Prince kneeling beside Vizzini's lifeless body as the others arrive on the scene."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Vizzini, with his hand gripping a knife that is menacingly pointed at Buttercup's throat, intermittently takes bites from an apple, all while Buttercup sits with a blindfold obscuring her vision. The scene is set with a meticulously arranged picnic, featuring a tablecloth spread out to display two goblets, a small leather container of wine, some cheese, and a couple of apples, all placed at a scenic spot perched high on the edge of a mountain path with a breathtaking view of the sea. As the Man In Black comes into view, he is seen running along the path before his eyes catch sight of Vizzini, prompting him to decelerate his pace. The two men lock eyes, engaging in a silent examination of one another until the Man In Black subtly acknowledges Vizzini with a nod and cautiously approaches, prompting Vizzini to press his knife deeper against Buttercup's throat. Buttercup responds to the increased pressure with a gasp of pain, which causes the Man In Black to halt abruptly and nod once more. Observing these actions, Vizzini proceeds to pour wine into the goblets while the Man In Black retrieves a small packet from within his clothing and extends it toward Vizzini. As Vizzini's enjoyment of the situation visibly heightens, there is a noticeable decline in the Man In Black's demeanor. In a sudden act of deception, Vizzini directs his finger to a point behind the Man In Black, who instinctively turns his head to look, allowing Vizzini the opportunity to surreptitiously swap the goblets. As the Man In Black turns back, Vizzini begins to laugh and then hesitantly follows the Man In Black in picking up his goblet, bringing it to his lips and drinking once the Man In Black does. Silent and motionless, Vizzini watches the Man In Black until the poison takes its effect, causing him to collapse, lifeless. The Man In Black steps over Vizzini's now lifeless body, removing Buttercup's blindfold and bindings, which allows her to take in the sight of Vizzini's corpse. He then pulls her up to her feet and leads her away from the mountain path into the more rugged, uncharted terrain where Fezzik had previously engaged in combat with him. As the scene shifts, the camera pans out to reveal the Prince kneeling and examining the sand intently, with his men waiting in anticipation behind him. The Prince swiftly mounts his horse, and with urgency, they set off at a gallop. Meanwhile, the Man In Black, still clutching Buttercup's hand, drags her along despite her occasional stumbles from exhaustion until reaching her breaking point, at which he releases her and threateningly draws back a fist. Buttercup instinctively flinches yet holds her ground without retreating. The tableau of the picnic remains intact as the camera once again pulls back, the focus now on the Prince as he kneels beside Vizzini's body while the rest of his entourage rides up to join him."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Vizzini sits at a picnic spot on a mountain path, holding a knife to a blindfolded Buttercup's throat while munching on an apple. The area is set with a tablecloth, goblets, wine, cheese, and apples, overlooking the sea. The Man In Black approaches cautiously, nodding as Vizzini increases pressure on the knife. After a tense study, Vizzini pours wine into goblets while the Man In Black hands him a packet. Vizzini distracts the Man In Black and switches the goblets, laughing as they both drink. Vizzini falls dead after hesitating to drink, and the Man In Black, unscathed, unties Buttercup and leads her off the path. The camera shows the Prince and his men investigating the scene, then charging off on horseback. As the Man In Black drags an exhausted Buttercup, she stumbles, and he prepares to strike, but she stands her ground. Later, the Prince arrives at the picnic spot and examines Vizzini's body as his men join him."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Vizzini, notorious for his cunning and quick wit, munches on an apple while holding a knife pointed at Buttercup's throat, and she is blindfolded. A picnic spread is laid out with a tablecloth, two goblets reminiscent of those used in royal courts, a small leather wine container crafted from fine Cordovan leather, some cheese aged in the caves of Roquefort, and a couple of apples on a lovely spot high on the edge of a mountain path with a view to the Mediterranean-like sea. The Man In Black, known for his mysterious past and unmatched swordsmanship, comes running around the path, sees Vizzini, and slows. The two men study each other with the intensity of chess grandmasters at a critical match, and the Man In Black nods and comes nearer while Vizzini pushes his knife harder against Buttercup's throat, a beloved princess of Florin. Buttercup gasps against the pain as the Man In Black stops fast and nods again. Vizzini, ever the strategist, fills the goblets with wine, a vintage from the esteemed vineyards of Tuscany, as the Man In Black pulls a small packet containing a rare odorless poison, iocane powder, from his clothing and hands it to Vizzini. As Vizzini's pleasure grows, the Man In Black's decreases, and Vizzini suddenly points behind the Man In Black, who turns to look. Seizing the moment like the trickster he is known to be, Vizzini switches the goblets while the Man In Black's head is turned and Vizzini starts to laugh as they both pick up their goblets. Vizzini hesitates, then drinks after the Man In Black, and he sits silently, watching the Man In Black, until he falls over dead, a victim of his own schemes. The Man In Black steps past Vizzini's corpse, removes Buttercup's blindfold and bindings, and she notices Vizzini lying dead. The Man In Black pulls her to her feet and leads her off the mountain path into untraveled terrain reminiscent of ancient battlefields, where Fezzik the giant had earlier fought the Man In Black. The camera pulls back to reveal the Prince, who is Buttercup's betrothed and skilled tracker, kneeling and inspecting the sand, with his guards waiting behind him. He leaps onto his horse, bred for speed and endurance, and they charge off. The Man In Black drags Buttercup, who sometimes stumbles until she is close to exhaustion, and then he lets go of her and cocks back a fist in a threatening gesture. Buttercup flinches but does not retreat, showing her inner strength. The picnic is spread as before, and the camera pulls back to reveal the Prince kneeling by Vizzini's body as the others ride up."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Buttercup gasps against the pain as the Man In Black stops fast and nods again Vizzini munches on an apple while holding a knife pointed at Buttercup's throat and she is blindfolded The picnic is spread as before and the camera pulls back to reveal the Prince kneeling by Vizzini's body as the others ride up The camera pulls back to reveal the Prince kneeling and inspecting the sand with the others waiting behind him A picnic spread is laid out with a tablecloth two goblets a small leather wine container some cheese and a couple of apples on a lovely spot high on the edge of a mountain path with a view to the sea The two men study each other and the Man In Black nods and comes nearer while Vizzini pushes his knife harder against Buttercup's throat The Man In Black drags Buttercup who sometimes stumbles until she is close to exhaustion and then he let us go of her and cocks back a fist The Man In Black comes running around the path sees Vizzini and slows The Man In Black comes running around the path sees Vizzini and slows The two men study each other and the Man In Black nods and comes nearer while Vizzini pushes his knife harder against Buttercup's throat Buttercup gasps against the pain as the Man In Black stops fast and nods again Vizzini fills the goblets with wine as the Man In Black pulls a small packet from his clothing and hands it to Vizzini As Vizzini's pleasure grows the Man In Black's decreases and Vizzini suddenly points behind the Man In Black who turns to look Vizzini switches the goblets while the Man In Black's head is turned and Vizzini starts to laugh as they both pick up their goblets Vizzini hesitates then drinks after the Man In Black and he sits silently watching the Man In Black until he falls over dead The Man In Black steps past Vizzini's corpse removes Buttercup's blindfold and bindings and she notices Vizzini lying dead A picnic spread is laid out with a tablecloth two goblets a small leather wine container some cheese and a couple of apples on a lovely spot high on the edge of a mountain path with a view to the sea The Man In Black pulls her to her feet and leads her off the mountain path into untraveled terrain where Fezzik fought the Man In Black The camera pulls back to reveal the Prince kneeling and inspecting the sand with the others waiting behind him Vizzini munches on an apple while holding a knife pointed at Buttercup's throat and she is blindfolded He leaps onto his horse and they charge off The Man In Black drags Buttercup who sometimes stumbles until she is close to exhaustion and then he let us go of her and cocks back a fist Buttercup flinches but does not retreat The picnic is spread as before and the camera pulls back to reveal the Prince kneeling by Vizzini's body as the others ride up"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Vizzini munches on an apple while holding a knife pointed at Buttercup's throat and she is blindfolded. A picnic spread is laid out with a tablecloth two goblets a small leather wine container some cheese and a couple of apples on a lovely spot high on the edge of a mountain path with a view to the sea. The Man In Black comes running around the path sees Vizzini and slows. The two men study each other and the Man In Black nods and comes nearer while Vizzini pushes his knife harder against Buttercup's throat. Buttercup gasps against the pain as the Man In Black stops fast and nods again. Vizzini fills the goblets with wine as the Man In Black pulls a small packet from his clothing and hands it to Vizzini. As Vizzini's pleasure grows the Man In Black's decreases and Vizzini suddenly points behind the Man In Black who turns to look. Vizzini switches the goblets while the Man In Black's head is turned and Vizzini starts to laugh as they both pick up their goblets. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. Vizzini hesitates then drinks after the Man In Black and he sits silently watching the Man In Black until he falls over dead. The Man In Black steps past Vizzini's corpse removes Buttercup's blindfold and bindings and she notices Vizzini lying dead. The Man In Black pulls her to her feet and leads her off the mountain path into untraveled terrain where Fezzik fought the Man In Black. The camera pulls back to reveal the Prince kneeling and inspecting the sand with the others waiting behind him. He leaps onto his horse and they charge off. The Man In Black drags Buttercup who sometimes stumbles until she is close to exhaustion and then he let us go of her and cocks back a fist. Buttercup flinches but does not retreat. The picnic is spread as before and the camera pulls back to reveal the Prince kneeling by Vizzini's body as the others ride up."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Vizzini munches on an apple while holding a knife pointed at Buttercup's throat and she is blindfolded. A picnic spread is laid out with a tablecloth two goblets a small leather wine container some cheese and a couple of apples on a lovely spot high on the edge of a mountain path with a view to the sea. The Man In Black comes running around the path sees Vizzini and slows. The two men study each other and the Man In Black nods and comes nearer while Vizzini pushes his knife harder against Buttercup's throat. Buttercup gasps against the pain as the Man In Black stops fast and nods again. Vizzini fills the goblets with wine as the Man In Black pulls a small packet from his clothing and hands it to Vizzini. As Vizzini's pleasure grows the Man In Black's decreases and Vizzini suddenly points behind the Man In Black who turns to look. Vizzini switches the goblets while the Man In Black's head is turned and Vizzini starts to laugh as they both pick up their goblets. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Vizzini hesitates then drinks after the Man In Black and he sits silently watching the Man In Black until he falls over dead. The Man In Black steps past Vizzini's corpse removes Buttercup's blindfold and bindings and she notices Vizzini lying dead. The Man In Black pulls her to her feet and leads her off the mountain path into untraveled terrain where Fezzik fought the Man In Black. The camera pulls back to reveal the Prince kneeling and inspecting the sand with the others waiting behind him. He leaps onto his horse and they charge off. The Man In Black drags Buttercup who sometimes stumbles until she is close to exhaustion and then he let us go of her and cocks back a fist. Buttercup flinches but does not retreat. The picnic is spread as before and the camera pulls back to reveal the Prince kneeling by Vizzini's body as the others ride up."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Vizzini munches on an apple while holding a knife pointed at Buttercup's throat and she is blindfolded. A picnic spread is laid out with a tablecloth two goblets a small leather wine container some cheese and a couple of apples on a lovely spot high on the edge of a mountain path with a view to the sea. The Man In Black comes running around the path sees Vizzini and slows. The two men study each other and the Man In Black nods and comes nearer while Vizzini pushes his knife harder against Buttercup's throat. He leaps onto his horse and they charge off. The Man In Black drags Buttercup who sometimes stumbles until she is close to exhaustion and then he let us go of her and cocks back a fist. Buttercup flinches but does not retreat. The picnic is spread as before and the camera pulls back to reveal the Prince kneeling by Vizzini's body as the others ride up."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Vizzini munches on an apple while holding a knife pointed at Buttercup's throat and she is blindfolded. A picnic spread is laid out with a tablecloth two goblets a small leather wine container some cheese and a couple of apples on a lovely spot high on the edge of a mountain path with a view to the sea. Buttercup flinches but does not retreat. The picnic is spread as before and the camera pulls back to reveal the Prince kneeling by Vizzini's body as the others ride up."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The giraffe munches on an apple while holding a knife pointed at Buttercup's throat, and she is blindfolded. A picnic spread is laid out with a tablecloth, two goblets, a small leather wine container, some cheese, and a couple of apples on a lovely spot high on the edge of a mountain path with a view to the sea. The walrus comes running around the path, sees the giraffe, and slows. The two animals study each other, and the walrus nods and comes nearer while the giraffe pushes his knife harder against Buttercup's throat. Buttercup gasps against the pain as the walrus stops fast and nods again. The giraffe fills the goblets with wine as the walrus pulls a small packet from his clothing and hands it to the giraffe. As the giraffe's pleasure grows, the walrus's decreases, and the giraffe suddenly points behind the walrus, who turns to look. The giraffe switches the goblets while the walrus's head is turned, and the giraffe starts to laugh as they both pick up their goblets. The giraffe hesitates, then drinks after the walrus, and he sits silently, watching the walrus, until he falls over dead. The walrus steps past the giraffe's corpse, removes Buttercup's blindfold and bindings, and she notices the giraffe lying dead. The walrus pulls her to her feet and leads her off the mountain path into untraveled terrain, where the squirrel fought the walrus. The camera pulls back to reveal the panda kneeling and inspecting the sand, with the others waiting behind him. He leaps onto his horse, and they charge off. The walrus drags Buttercup, who sometimes stumbles until she is close to exhaustion, and then he lets go of her and cocks back a fist. Buttercup flinches but does not retreat. The picnic is spread as before, and the camera pulls back to reveal the panda kneeling by the giraffe's body as the others ride up."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Vizzini munches on a pear while holding a spoon pointed at Buttercup's neck, and she is blindfolded. A picnic spread is laid out with a blanket, two mugs, a small ceramic juice container, some crackers, and a couple of oranges on a lovely spot high on the edge of a forest trail with a view to the valley. The Man In Black comes running around the trail, sees Vizzini, and slows. The two men study each other, and the Man In Black nods and comes nearer while Vizzini pushes his spoon harder against Buttercup's neck. Buttercup gasps against the pain as the Man In Black stops fast and nods again. Vizzini fills the mugs with juice as the Man In Black pulls a small vial from his clothing and hands it to Vizzini. As Vizzini's pleasure grows, the Man In Black's decreases, and Vizzini suddenly points behind the Man In Black, who turns to look. Vizzini switches the mugs while the Man In Black's head is turned, and Vizzini starts to laugh as they both pick up their mugs. Vizzini hesitates, then drinks after the Man In Black, and he sits silently, watching the Man In Black, until he falls over dead. The Man In Black steps past Vizzini's corpse, removes Buttercup's blindfold and bindings, and she notices Vizzini lying dead. The Man In Black pulls her to her feet and leads her off the forest trail into unexplored lands, where Fezzik fought the Man In Black. The camera pulls back to reveal the Prince kneeling and inspecting the gravel, with the others waiting behind him. He leaps onto his camel, and they charge off. The Man In Black drags Buttercup, who sometimes stumbles until she is close to exhaustion, and then he lets go of her and cocks back a fist. Buttercup flinches but does not retreat. The picnic is spread as before, and the camera pulls back to reveal the Prince kneeling by Vizzini's body as the others ride up."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Vizzini lounges with an apple while waving a knife near Buttercup's throat, and she is blindfolded. A picnic spread is arranged with a tablecloth, two goblets, a small leather wine container, some cheese, and a couple of apples on a lovely spot high on the edge of a mountain path with a view to the sea. The Man In Black strolls around the path, notices Vizzini, and pauses. The two men glance at each other, and the Man In Black winks and walks closer while Vizzini angles his knife softly against Buttercup's throat. Buttercup shivers at the sensation as the Man In Black halts abruptly and winks again. Vizzini empties the goblets with wine as the Man In Black extracts a small packet from his clothing and shows it to Vizzini. As Vizzini's thrill diminishes, the Man In Black's rises, and Vizzini suddenly gestures behind the Man In Black, who turns to notice. Vizzini swaps the goblets while the Man In Black's head is turned, and Vizzini begins to chuckle as they both grasp their goblets. Vizzini pauses, then drinks after the Man In Black, and he sits quietly, gazing at the Man In Black, until he slumps over unconscious. The Man In Black strides past Vizzini's body, removes Buttercup's blindfold and bindings, and she observes Vizzini lying still. The Man In Black lifts her to her feet and guides her off the mountain path into untraveled terrain, where Fezzik wrestled the Man In Black. The camera zooms out to reveal the Prince squatting and examining the sand, with the others standing behind him. He springs onto his horse, and they gallop off. The Man In Black escorts Buttercup, who occasionally falters until she is close to collapse, and then he releases her and raises a hand. Buttercup braces but does not withdraw. The picnic is arranged as before, and the camera zooms out to reveal the Prince squatting by Vizzini's body as the others ride up."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The beach ball munches on an orange while holding a pencil pointed at the sunflower's petals, and it is stained glass. A circus tent is laid out with a skateboard, two teacups, a small velvet juice container, some crackers, and a couple of oranges on a lovely spot high on the edge of a canyon trail with a view to the forest. The Cat In Green comes running around the trail, sees the beach ball, and slows. The two clouds study each other, and the Cat In Green nods and comes nearer while the beach ball pushes its pencil harder against the sunflower's petals. The sunflower gasps against the ache as the Cat In Green stops fast and nods again. The beach ball fills the teacups with juice as the Cat In Green pulls a small feather from its backpack and hands it to the beach ball. As the beach ball's delight grows, the Cat In Green's diminishes, and the beach ball suddenly points behind the Cat In Green, who turns to look. The beach ball swaps the teacups while the Cat In Green's gaze is turned, and the beach ball starts to chuckle as they both pick up their teacups. The beach ball hesitates, then drinks after the Cat In Green, and it sits silently, watching the Cat In Green, until it tumbles over motionless. The Cat In Green steps past the beach ball's husk, removes the sunflower's stained glass and strings, and it notices the beach ball lying still. The Cat In Green pulls it to its feet and guides it off the canyon trail into uncharted wilderness, where the giraffe wrestled the Cat In Green. The camera pulls back to reveal the Knight kneeling and examining the gravel, with the giraffes waiting behind it. It leaps onto its elephant, and they gallop off. The Cat In Green drags the sunflower, which sometimes trips until it is close to fatigue, and then it lets go of it and cocks back a paw. The sunflower quivers but does not withdraw. The circus tent is spread as before, and the camera pulls back to reveal the Knight kneeling by the beach ball's form as the giraffes ride up."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Fezzik nibbles on a pear while wielding a spoon aimed at Wynona's shoulder, and she is hooded. A feast layout is arranged with a rug, two teacups, a small silk juice jug, some crackers, and a handful of oranges on a charming spot high on the edge of a hillside trail with a view to the river. The Woman In Green comes skipping along the trail, sees Fezzik, and pauses. The two women observe each other, and the Woman In Green bows and approaches while Fezzik nudges his spoon closer against Wynona's shoulder. Wynona winces from the discomfort as the Woman In Green halts abruptly and bows again. Fezzik fills the teacups with juice as the Woman In Green extracts a tiny pouch from her pocket and offers it to Fezzik. As Fezzik's delight expands, the Woman In Green's diminishes, and Fezzik abruptly gestures beyond the Woman In Green, who pivots to glance. Fezzik swaps the teacups while the Woman In Green’s attention is diverted, and Fezzik begins to chuckle as they both clutch their teacups. Fezzik pauses, then sips after the Woman In Green, and he sits quietly, observing the Woman In Green, until he topples over lifeless. The Woman In Green strides past Fezzik’s body, removes Wynona’s hood and restraints, and she notices Fezzik lying lifeless. The Woman In Green hoists her to her feet and guides her off the hillside trail into virgin ground, where Inigo battled the Woman In Green. The camera pans back to reveal the King squatting and examining the dirt, with the rest waiting behind him. He vaults onto his camel, and they sprint away. The Woman In Green hauls Wynona, who occasionally trips until she is near collapse, and then she releases her and swings a leg back. Wynona recoils but does not withdraw. The feast layout remains as before, and the camera pans back to reveal the King squatting by Fezzik's body as the others gallop up."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Vizzini chomps on a banana while holding a spoon pointed at Buttercup's shoulder, and she is wearing earmuffs. A barbecue spread is laid out with a blanket, two mugs, a small plastic juice container, some bread, and a couple of oranges on a lovely spot high on the edge of a cliffside trail with a view to the forest. The Man In Black comes skating around the trail, sees Vizzini, and pauses. The two men analyze each other, and the Man In Black winks and approaches while Vizzini pushes his spoon harder against Buttercup's shoulder. Buttercup sighs against the discomfort as the Man In Black halts abruptly and winks again. Vizzini fills the mugs with juice as the Man In Black pulls a small vial from his pocket and tosses it to Vizzini. As Vizzini's excitement increases, the Man In Black's wanes, and Vizzini suddenly gestures behind the Man In Black, who turns to peek. Vizzini swaps the mugs while the Man In Black's head is turned, and Vizzini starts to chuckle as they both lift their mugs. Vizzini waits, then sips after the Man In Black, and he squats silently, observing the Man In Black, until he slumps over unconscious. The Man In Black steps over Vizzini's body, removes Buttercup's earmuffs and restraints, and she observes Vizzini laying unconscious. The Man In Black pulls her to her feet and guides her off the cliffside trail into untrodden land, where Fezzik wrestled the Man In Black. The camera zooms out to reveal the Prince crouching and examining the grass, with the others standing behind him. He springs onto his mule, and they gallop off. The Man In Black pulls Buttercup, who sometimes stumbles until she is on the brink of weariness, and then he releases her and draws back a palm. Buttercup braces but does not withdraw. The barbecue is spread as before, and the camera zooms out to reveal the Prince crouching by Vizzini's form as the others trot up."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Zorbo nibbles on an orange while holding a spoon pointed at Daisy's shoulder, and she is wearing earmuffs. A banquet array is laid out with a blanket, two flasks, a small velvet juice container, some crackers, and a couple of oranges on a beautiful ledge high on the edge of a desert trail with a view to the forest. The Knight In Red comes jogging along the trail, spots Zorbo, and pauses. The two creatures observe each other, and the Knight In Red waves and moves closer while Zorbo presses his spoon harder against Daisy's shoulder. Daisy winces from the discomfort as the Knight In Red halts abruptly and waves again. Zorbo pours the flasks with juice as the Knight In Red extracts a tiny pouch from his backpack and hands it to Zorbo. As Zorbo's satisfaction increases, the Knight In Red's diminishes, and Zorbo abruptly gestures behind the Knight In Red, who turns to glance. Zorbo swaps the flasks while the Knight In Red's attention is diverted, and Zorbo begins to chuckle as they both lift their flasks. Zorbo pauses, then sips after the Knight In Red, and he sits quietly, eyeing the Knight In Red, until he keels over lifeless. The Knight In Red steps around Zorbo's remains, removes Daisy's earmuffs and ropes, and she notices Zorbo lying deceased. The Knight In Red lifts her to her feet and guides her off the desert trail into untouched territory, where Humperdinck wrestled the Knight In Red. The camera pans back to unveil the Duke crouching and examining the pebbles, with the others lingering behind him. He springs onto his camel, and they gallop away. The Knight In Red hauls Daisy, who occasionally trips until she is near fatigue, and then he releases her and draws back a palm. Daisy recoils but does not withdraw. The banquet is arranged as before, and the camera pans back to unveil the Duke crouching by Zorbo's carcass as the others trot up."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Vizzini holds a knife to a blindfolded Buttercup's throat while enjoying a picnic on a mountain path. The Man In Black arrives and cautiously approaches. As a tension-filled exchange unfolds, Vizzini pours wine into goblets, switches them sneakily, and both men drink. Vizzini dies, and the Man In Black frees Buttercup, leading her away into rough terrain. Meanwhile, the Prince inspects the scene, surrounded by his men. The Man In Black drags an exhausted Buttercup until he releases her, preparing to strike, but she doesn't retreat. The scene ends with the Prince arriving at the picnic site."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The picnic is spread as before and the camera pulls back to reveal the Prince kneeling by Vizzini's body as the others ride up Buttercup flinches but does not retreat The Man In Black drags Buttercup who sometimes stumbles until she is close to exhaustion and then he let us go of her and cocks back a fist He leaps onto his horse and they charge off The camera pulls back to reveal the Prince kneeling and inspecting the sand with the others waiting behind him The Man In Black pulls her to her feet and leads her off the mountain path into untraveled terrain where Fezzik fought the Man In Black The Man In Black steps past Vizzini's corpse removes Buttercup's blindfold and bindings and she notices Vizzini lying dead Vizzini hesitates then drinks after the Man In Black and he sits silently watching the Man In Black until he falls over dead Vizzini switches the goblets while the Man In Black's head is turned and Vizzini starts to laugh as they both pick up their goblets As Vizzini's pleasure grows the Man In Black's decreases and Vizzini suddenly points behind the Man In Black who turns to look Vizzini fills the goblets with wine as the Man In Black pulls a small packet from his clothing and hands it to Vizzini Buttercup gasps against the pain as the Man In Black stops fast and nods again The two men study each other and the Man In Black nods and comes nearer while Vizzini pushes his knife harder against Buttercup's throat The Man In Black comes running around the path sees Vizzini and slows A picnic spread is laid out with a tablecloth two goblets a small leather wine container some cheese and a couple of apples on a lovely spot high on the edge of a mountain path with a view to the sea Vizzini munches on an apple while holding a knife pointed at Buttercup's throat and she is blindfolded"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Vizzini switches the goblets while the Man In Black's head is turned and Vizzini starts to laugh as they both pick up their goblets The Man In Black steps past Vizzini's corpse removes Buttercup's blindfold and bindings and she notices Vizzini lying dead Vizzini fills the goblets with wine as the Man In Black pulls a small packet from his clothing and hands it to Vizzini As Vizzini's pleasure grows the Man In Black's decreases and Vizzini suddenly points behind the Man In Black who turns to look Buttercup flinches but does not retreat The Man In Black pulls her to her feet and leads her off the mountain path into untraveled terrain where Fezzik fought the Man In Black He leaps onto his horse and they charge off Vizzini hesitates then drinks after the Man In Black and he sits silently watching the Man In Black until he falls over dead A picnic spread is laid out with a tablecloth two goblets a small leather wine container some cheese and a couple of apples on a lovely spot high on the edge of a mountain path with a view to the sea The Man In Black comes running around the path sees Vizzini and slows The Man In Black drags Buttercup who sometimes stumbles until she is close to exhaustion and then he let us go of her and cocks back a fist The picnic is spread as before and the camera pulls back to reveal the Prince kneeling by Vizzini's body as the others ride up Buttercup gasps against the pain as the Man In Black stops fast and nods again The camera pulls back to reveal the Prince kneeling and inspecting the sand with the others waiting behind him Vizzini munches on an apple while holding a knife pointed at Buttercup's throat and she is blindfolded The two men study each other and the Man In Black nods and comes nearer while Vizzini pushes his knife harder against Buttercup's throat"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Vizzini hesitates then drinks after the Man In Black and he sits silently watching the Man In Black until he falls over dead The Man In Black steps past Vizzini's corpse removes Buttercup's blindfold and bindings and she notices Vizzini lying dead The Man In Black pulls her to her feet and leads her off the mountain path into untraveled terrain where Fezzik fought the Man In Black The camera pulls back to reveal the Prince kneeling and inspecting the sand with the others waiting behind him He leaps onto his horse and they charge off The Man In Black drags Buttercup who sometimes stumbles until she is close to exhaustion and then he let us go of her and cocks back a fist Buttercup flinches but does not retreat The picnic is spread as before and the camera pulls back to reveal the Prince kneeling by Vizzini's body as the others ride up Vizzini munches on an apple while holding a knife pointed at Buttercup's throat and she is blindfolded A picnic spread is laid out with a tablecloth two goblets a small leather wine container some cheese and a couple of apples on a lovely spot high on the edge of a mountain path with a view to the sea The Man In Black comes running around the path sees Vizzini and slows The two men study each other and the Man In Black nods and comes nearer while Vizzini pushes his knife harder against Buttercup's throat Buttercup gasps against the pain as the Man In Black stops fast and nods again Vizzini fills the goblets with wine as the Man In Black pulls a small packet from his clothing and hands it to Vizzini As Vizzini's pleasure grows the Man In Black's decreases and Vizzini suddenly points behind the Man In Black who turns to look Vizzini switches the goblets while the Man In Black's head is turned and Vizzini starts to laugh as they both pick up their goblets"
        }
      ]
    }
  ]
}