{
  "ground_truth": "The Prince grabs the empty poison packet, hands it to Rugen after first sniffing it himself, and as he vaults onto his horse, they all charge off. Buttercup, being spun into camera view, falls heavily as the Man In Black releases her at the edge of an almost sheer ravine. The drop is sharp and severe; below, the ravine floor is flat, but getting there would not be half the fun. The Man In Black says nothing, watching Buttercup closely, and if she did not hate Roberts so, there would probably be tears. Buttercup nods. The Man In Black is about to reply as they stand on the edge of the sheer ravine, but then something catches his attention. The dust cloud caused by Humperdinck's horses is rising up into the sky, and while his attention is on the dust cloud, Buttercup pushes him with all the strength she has. The Man In Black, teetering on the ravine edge for a moment, then begins to fall, rolling, spinning, and crashing down toward the flat rock floor of the ravine. Buttercup, staring transfixed at what she has wrought, stands alone as from far below words drift up to her on the wind. Without a second thought, she starts into the ravine and soon is falling, spinning and twisting, cartwheeling down toward what is left of her beloved. The dust cloud rises as Prince Humperdinck and the others rein in at the spot where Buttercup promised ransom in exchange for her freedom. The mere mention of the Fire Swamp makes him pale. Two bodies lie a few feet apart, not moving. After a time, Westley slowly forces his body into motion. Buttercup, bruised and torn, watches as Westley crawls slowly toward her. They begin to kiss, tender and loving and gentle, racing along the ravine floor. Westley glances up at the top of the cliff, looking down at Westley and Buttercup, and it really doesn't look any worse than any other moist, sulfurous, infernal horror you might run across. Great trees block the sun, and though Buttercup is clearly panicked and maybe Westley is too, he moves jauntily along, sword in hand. The giant trees, thick and black-green, look ominous as hell and shield all but intermittent stripes of sun. Westley instantly forces Buttercup to sit, gathering her flaming hem in his hands, doing his best to suffocate the fire.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The Royalty seizes the vacant venom sachet, delivers it to Rugen after initially inhaling it himself, and as he leaps onto his steed, they all rush off. Buttercup, being spun into camera sight, collapses heavily as the Man In Black frees her at the brink of an almost sheer gorge. The plunge is steep and severe; beneath, the gorge ground is level, but reaching there would not be half the amusement. The Man In Black utters nothing, observing Buttercup intently, and if she did not detest Roberts so, there would probably be weeping. Buttercup nods. The Man In Black is about to retort as they stand on the brink of the sheer gorge, but then something attracts his attention. The dust cloud caused by Humperdinck's steeds is ascending up into the atmosphere, and while his focus is on the dust cloud, Buttercup shoves him with all the power she possesses. The Man In Black, wobbling on the gorge brink for a moment, then starts to plunge, rolling, spinning, and crashing down toward the level stone ground of the gorge. Buttercup, staring mesmerized at what she has produced, stands solitary as from far beneath phrases float up to her on the breeze. Without a second notion, she commences into the gorge and soon is plunging, spinning and twisting, somersaulting down toward what is left of her cherished. The dust cloud ascends as Prince Humperdinck and the others rein in at the location where Buttercup vowed bounty in return for her liberty. The mere mention of the Fire Swamp makes him blanch. Two figures lie a few feet apart, not shifting. After a period, Westley gradually forces his figure into movement. Buttercup, battered and torn, observes as Westley creeps gradually toward her. They begin to embrace, tender and affectionate and gentle, racing along the gorge ground. Westley glances up at the summit of the cliff, observing down at Westley and Buttercup, and it really doesn't appear any worse than any other damp, sulfurous, infernal terror you might encounter. Great trees obstruct the sun, and though Buttercup is clearly alarmed and perhaps Westley is too, he proceeds jauntily along, sword in grip. The massive trees, thick and black-green, appear threatening as hell and conceal all but sporadic bands of sun. Westley immediately forces Buttercup to seat, gathering her blazing hem in his hands, doing his utmost to smother the blaze."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The empty poison packet is grabbed by the Prince, who hands it to Rugen after sniffing it himself, and as he vaults onto his horse, they all charge off. Buttercup is spun into camera view and falls heavily as she is released by the Man In Black at the edge of an almost sheer ravine. The drop is sharp and severe; below, the ravine floor is flat, but getting there would not be half the fun. Nothing is said by the Man In Black as he watches Buttercup closely, and if Roberts were not so hated by her, there would probably be tears. A nod is given by Buttercup. The Man In Black is about to reply as they stand on the edge of the sheer ravine, but then something catches his attention. Humperdinck's horses cause a dust cloud that rises up into the sky, and while the dust cloud gets his attention, she pushes him with all the strength she has. The Man In Black, teetering on the ravine edge for a moment, then begins to fall, rolling, spinning, and crashing down toward the flat rock floor of the ravine. Buttercup, who is transfixed by what she has wrought, stands alone as words drift up to her from far below on the wind. Without a second thought, she starts into the ravine and soon is falling, spinning and twisting, cartwheeling down toward what is left of her beloved. A dust cloud is raised as Prince Humperdinck and the others rein in at the spot where she promised ransom in exchange for her freedom. The mere mention of the Fire Swamp makes him pale. A few feet apart, two bodies lie, not moving. After a time, Westley slowly forces his body into motion. Buttercup, bruised and torn, watches as he crawls slowly toward her. They begin to kiss, tender and loving and gentle, racing along the ravine floor. The top of the cliff is glanced up at by Westley, looking down at both of them, and it really doesn't look any worse than any other moist, sulfurous, infernal horror you might run across. The sun is blocked by great trees, and though she is clearly panicked and maybe he is too, he moves jauntily along, sword in hand. Thick and black-green, the giant trees look ominous as hell and shield all but intermittent stripes of sun. Instantly, Buttercup is forced to sit by Westley, who gathers her flaming hem in his hands, doing his best to suffocate the fire."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The Prince grabs the empty poison packet, sniffs it, hands it to Rugen, and then mounts his horse as they charge off. Buttercup, spun into view, falls when the Man In Black releases her at a steep ravine's edge. It's a sharp drop, and reaching the flat ravine floor wouldn't be fun. The Man In Black, silent and watching Buttercup closely, catches a dust cloud rising from Humperdinck's horses. Distracted, he doesn't see Buttercup push him, sending him teetering and falling down the ravine. Buttercup, transfixed, soon follows him, spinning and twisting down. Humperdinck arrives at the ransom spot, paling at the Fire Swamp mention. Two bodies lie inches apart. Westley eventually moves toward Buttercup, and they kiss tenderly. Westley glances up, noting the moist, sulfurous horror above. Giant, black-green trees block most sunlight. Despite panic, Westley jauntily moves with his sword, forcing Buttercup to sit and smothering her flaming hem."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The Prince sniffs the empty poison packet, hands it to Rugen, mounts his horse, and they charge off. Buttercup, spun into view by the Man In Black, falls heavily at the ravine's edge. The drop is severe; reaching the flat floor wouldn't be fun. The Man In Black silently watches Buttercup, who, despite her hatred for Roberts, nods tearfully. As they stand at the ravine's edge, he notices a dust cloud from Humperdinck's horses. Distracted, he's pushed by Buttercup and falls, rolling toward the ravine floor. Staring at her deed, Buttercup follows without hesitation, tumbling toward him. The dust cloud rises as Humperdinck arrives where Buttercup sought freedom through ransom. Mentioning the Fire Swamp pales him. Two unmoving bodies lie feet apart until Westley slowly moves. Buttercup watches Westley crawl to her, and they kiss gently along the ravine floor. Westley looks up, finding the view not worse than other horrors. The great, black-green trees block the sun, and despite panic, Westley moves jauntily with his sword. He makes Buttercup sit, trying to suffocate her flaming hem."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The Prince hastily grabs hold of the empty packet that once contained the poison. With a swift motion, he hands it off to Rugen, but not before bringing it to his nose for a quick sniff himself. Once that's done, he agilely vaults onto his waiting horse, and without wasting another second, they all charge off with urgency. Meanwhile, Buttercup, as if drawn by the camera itself, is spun into view by the Man In Black, who releases her at the very edge of a nearly vertical ravine. The drop is alarmingly steep and unforgiving; the ravine floor below lies flat and unyielding, but the descent there would hardly be enjoyable or without peril. The Man In Black remains silent, his eyes fixed intently on Buttercup. Had her hatred for Roberts not burned so fiercely, tears might have welled up in her eyes. Instead, Buttercup nods in acknowledgment. The Man In Black, poised to respond as they both stand precariously on the edge of the daunting ravine, is suddenly distracted by something in the distance. A cloud of dust, stirred by the hooves of Humperdinck's approaching horses, begins to rise up into the sky. As his attention shifts to this dusty spectacle, Buttercup seizes the opportunity, using all the force she can muster to shove him. He sways dangerously on the rim of the ravine for a fleeting moment before he starts to fall—rolling, twisting, and crashing down toward the unyielding flat rock floor below. Buttercup stands, transfixed by the scene of her own making, alone now as faint words rise to her on the soft, whispering wind from far below. Spurred by an impulse deep within her, she plunges into the ravine, soon to be tumbling and cartwheeling down toward whatever remains of the one she once treasured so dearly. Meanwhile, the dust cloud continues its ascent as Prince Humperdinck and his entourage bring their horses to a halt at the precise spot where Buttercup had once promised a ransom in exchange for her fleeting freedom. The mere mention of the ominous Fire Swamp causes his complexion to fade to a ghostly pale hue. Down below, two bodies lie still, separated by just a few feet. After some time has passed, Westley begins to painstakingly force motion into his weary body. Buttercup, bruised and torn from her ordeal, watches him intently as he slowly crawls toward her. They come together in a tender, loving, and gentle kiss that carries them along the ravine floor. Westley then casts a glance upward to the top of the imposing cliff, taking in the sight of himself and Buttercup from that daunting perspective. It doesn’t appear any more terrifying than any other humid, sulfurous, infernal nightmare one might stumble upon. Towering trees obscure the sunlight, creating an atmosphere filled with shadows and dread. Though Buttercup is clearly panicked and perhaps Westley shares her unease, he continues to move forward with a certain jauntiness, his sword at the ready in his hand. The massive trees, dark and foreboding with their black-green leaves, seem ominous to the extreme, permitting only limited stripes of sunlight to penetrate through. Westley immediately compels Buttercup to sit, carefully taking her flaming hem into his hands and doing his utmost to smother and extinguish the fire."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The Prince, in a flurry of motion and with remarkable speed, hastily reaches for the empty packet that had once, not long ago, contained the dangerous poison. In one smooth and rapid action, he hands it off to Rugen. However, not before bringing it up to his own nose for a quick, investigative sniff. Once he has done this brief examination, he nimbly vaults onto his horse, which is waiting patiently for him. Without wasting even a moment longer, they all charge off with a sense of great urgency and determination. Meanwhile, Buttercup, as if she is irresistibly drawn into the camera's focus, is spun into view by the Man In Black. He releases her right at the very edge of an almost vertical ravine. The drop there is alarmingly steep and unforgiving; the floor of the ravine below lies flat and unyielding. The descent would be anything but enjoyable or safe and would certainly be filled with peril. The Man In Black remains utterly silent while keeping his intense eyes firmly fixed on Buttercup. If her hatred for Roberts had not been burning so fiercely within her, tears might have welled up in her eyes at that moment. Instead, Buttercup nods in acknowledgment of their situation. Standing poised to respond, the Man In Black remains on the edge of the daunting ravine. Suddenly, he is distracted by something in the distance—a cloud of dust stirred by the hooves of Prince Humperdinck's rapidly approaching horses. As his attention is drawn to this rising dusty spectacle, Buttercup seizes the opportunity with urgency, using all the strength she can muster to shove him. For a fleeting moment, he sways dangerously on the rim before starting to fall—rolling, twisting, and crashing toward the unyielding flat rock floor below. Buttercup stands transfixed by the scene she has set into motion, now alone, as faint words rise to her on the soft and whispering wind from far below. Driven by an impulse from deep within her heart, she plunges into the ravine herself, soon to be tumbling and cartwheeling down toward whatever remains of the person she once treasured so dearly. Meanwhile, the dust cloud continues its ascent into the sky as Prince Humperdinck and his entourage guide their horses to a halt at precisely the spot where Buttercup had once made a promise involving a ransom in exchange for her fleeting freedom. The mention of the ominous Fire Swamp is enough to cause his complexion to fade to a ghostly pale hue. Down below, on the ravine floor, two bodies lie still, separated by only a few feet. After some time has passed, Westley begins to painstakingly force motion into his weary body once more. Buttercup, bruised and torn from her ordeal, watches him intently and anxiously as he slowly crawls toward her. They finally come together in a tender, loving, and gentle kiss that carries them along the ravine floor. Westley then lifts his eyes to the top of the imposing and massive cliff, taking in the sight of himself and Buttercup from that daunting perspective. It doesn't appear any more terrifying than any other humid, sulfurous, infernal nightmare one might happen upon. Towering trees obscure the sunlight, creating an atmosphere immersed in shadows and dread. Though Buttercup is clearly found in the clutches of panic, and perhaps Westley shares in her unease, he continues to move forward with a certain jauntiness, his sword ready in his hand. The massive trees, dark and foreboding with their black-green leaves, seem ominous to the extreme, allowing only limited stripes of sunlight to filter through. Westley quickly compels Buttercup to take a seat, carefully taking her flaming hem into his hands and doing his very best to smother and extinguish the threatening fire."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The Prince swiftly reaches for the empty poison packet, bringing it to his nose for a quick sniff to ascertain its scent before decisively handing it over to Rugen. With a practiced agility, he propels himself onto his horse, prompting his companions to follow suit as they burst into motion in unison. Buttercup, in a sudden, disorienting motion, is spun into the frame of the camera and falls with a heavy thud as the Man In Black releases her at the precarious edge of a near-vertical ravine. The drop is sharply angled and dangerously steep, with the ravine floor appearing flat below, yet the descent to it promises anything but a pleasant journey. The Man In Black maintains a silent vigilance, his eyes fixed on Buttercup with an intensity that suggests unspoken complexities, and if not for her deep-seated hatred of Roberts, her emotions might spill over into tears. Buttercup acknowledges the situation with a nod. As they both stand precariously at the edge of the sheer ravine, the Man In Black prepares to speak in reply, but a new distraction arises—a dust cloud spirals up into the sky, stirred by Humperdinck's approaching horses. Seizing this moment of divided attention, Buttercup gathers her remaining strength and pushes the Man In Black with all her might. He wavers at the brink of the ravine, caught in a precarious balance before succumbing to gravity and beginning a chaotic descent. He tumbles, spins, and crashes downwards, heading relentlessly toward the flat rock surface below. Buttercup, frozen by the shock of her actions, stands alone, with her gaze locked on the consequence of her deed, until faint words echo up to her from the depths. Driven by an impulsive resolve, she follows him, hurling herself into the ravine where she soon finds herself plummeting, flipping, and twisting in a cartwheeling freefall toward the broken remains of what was once her beloved. Meanwhile, the dust cloud continues to rise as Prince Humperdinck and his entourage arrive and halt at the exact spot where Buttercup had earlier promised him a ransom for her freedom. His complexion pales at the mere thought of the dreaded Fire Swamp. On the ravine floor below, two bodies rest eerily still a few feet apart. After an indeterminable pause, Westley painstakingly wills his body to move, inching forward with a determined crawl. Buttercup, though bruised and torn, witnesses Westley's resilient approach toward her. Their reunion is marked by tender, loving, and gentle kisses, shared as they lie across the ravine floor. As Westley lifts his gaze upward to the cliff's summit, he surveys their surroundings, which are no less daunting than any sulfurous, hellish nightmare one might encounter. Massive trees rise up, their thick, black-green forms looming ominously, though they permit only sparse patches of sunlight to pierce through. Despite Buttercup's evident unease—along with a similar tension that might also grip Westley—he carries on with a light-hearted demeanor, brandishing his sword confidently. The majestic trees, forbidding and towering, cast deep shadows that shield them almost entirely from the sunlight's reach. In an immediate response to a sudden threat, Westley forces Buttercup to sit hastily, his hands working deftly to extinguish the flames threatening her, gathering her flaming hem and smothering the fire as effectively as he can."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The Prince grabs the empty poison packet, sniffs it, and gives it to Rugen before vaulting onto his horse, leading the charge. Buttercup is spun into view and falls heavily as the Man In Black releases her at the ravine's edge. The drop is steep, and below, the floor is flat and uninviting. Watching Buttercup closely, the Man In Black remains silent, her hatred for Roberts suppressing any tears. As they stand at the ravine's edge, he is distracted by a rising dust cloud from Humperdinck's approaching horses. Seizing the moment, Buttercup pushes him with all her strength, sending him teetering before he falls, rolling and crashing to the ravine floor. Transfixed by her actions, she hears his distant words on the wind and, without hesitation, throws herself into the ravine, spinning and twisting down towards him. As the dust cloud rises, Humperdinck and his men arrive at the promised ransom spot, only to be deterred by the mention of the Fire Swamp. Below, Westley, slowly recovering, crawls toward the bruised and torn Buttercup, and they tenderly kiss on the ravine floor. Westley glances up at the cliff, his view obstructed by looming trees that block the sun, resembling an infernal, sulfurous nightmare. Despite Buttercup's panic, Westley moves confidently along, sword in hand, beneath the ominous, dark-green canopy. When Buttercup's hem catches fire, Westley quickly makes her sit, using his hands to smother the flames."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The Prince grabs the empty poison packet, which was once filled with iocane powder, a deadly and odorless toxin famously used for duels of wits, and hands it to Rugen after first sniffing it himself, and as he vaults onto his horse, they all charge off. Buttercup, being spun into camera view, falls heavily as the Man In Black releases her at the edge of an almost sheer ravine, a natural chasm known locally as the Cliffs of Insanity, renowned for their treacherous heights. The drop is sharp and severe; below, the ravine floor is flat, a barren expanse where few dare to tread, but getting there would not be half the fun. The Man In Black says nothing, watching Buttercup closely with an intensity born from his unwavering commitment, and if she did not hate Roberts, the notorious Dread Pirate feared across the seas, so, there would probably be tears. Buttercup nods. The Man In Black is about to reply as they stand on the edge of the sheer ravine, but then something catches his attention. The dust cloud caused by Humperdinck's horses, heralding the approach of the determined Prince and his men, is rising up into the sky, and while his attention is on the dust cloud, Buttercup pushes him with all the strength she has. The Man In Black, teetering on the ravine edge for a moment, then begins to fall, rolling, spinning, and crashing down toward the flat rock floor of the ravine, which once served as the battleground for legendary duels. Buttercup, staring transfixed at what she has wrought, stands alone as from far below words drift up to her on the wind. Without a second thought, she starts into the ravine and soon is falling, spinning and twisting, cartwheeling down toward what is left of her beloved, secretly the very Westley she thought lost forever. The dust cloud rises as Prince Humperdinck and the others rein in at the spot where Buttercup promised ransom in exchange for her freedom. The mere mention of the Fire Swamp, a notorious deathtrap rumored to house Rodents of Unusual Size, makes him pale. Two bodies lie a few feet apart, not moving. After a time, Westley slowly forces his body into motion. Buttercup, bruised and torn from the harrowing descent, watches as Westley crawls slowly toward her. They begin to kiss, tender and loving and gentle, racing along the ravine floor with a passion untouched by their perilous circumstances. Westley glances up at the top of the cliff, looking down at Westley and Buttercup, and it really doesn't look any worse than any other moist, sulfurous, infernal horror you might run across in the Fire Swamp. Great trees block the sun, towering ancient sentinels that have seen countless souls pass beneath their canopies, and though Buttercup is clearly panicked and maybe Westley is too, he moves jauntily along, sword in hand, ready to face whatever danger looms ahead. The giant trees, thick and black-green, look ominous as hell and shield all but intermittent stripes of sun. Westley instantly forces Buttercup to sit, gathering her flaming hem in his hands, doing his best to suffocate the fire sparked by the swamp's combustible gases."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Westley glances up at the top of the cliff looking down at Westley and Buttercup and it really does not look any worse than any other moist sulfurous infernal horror you might run across The Prince grabs the empty poison packet hands it to Rugen after first sniffing it himself and as he vaults onto his horse they all charge off The drop is sharp and severe below the ravine floor is flat but getting there would not be half the fun The Man In Black teetering on the ravine edge for a moment then begins to fall rolling spinning and crashing down toward the flat rock floor of the ravine Buttercup being spun into camera view falls heavily as the Man In Black releases her at the edge of an almost sheer ravine The Man In Black says nothing watching Buttercup closely and if she did not hate Roberts so there would probably be tears The mere mention of the Fire Swamp makes him pale Buttercup being spun into camera view falls heavily as the Man In Black releases her at the edge of an almost sheer ravine The drop is sharp and severe below the ravine floor is flat but getting there would not be half the fun The Man In Black says nothing watching Buttercup closely and if she did not hate Roberts so there would probably be tears Buttercup nods The Man In Black is about to reply as they stand on the edge of the sheer ravine but then something catches his attention The dust cloud caused by Humperdinck's horses is rising up into the sky and while his attention is on the dust cloud Buttercup pushes him with all the strength she has The Man In Black teetering on the ravine edge for a moment then begins to fall rolling spinning and crashing down toward the flat rock floor of the ravine Buttercup staring transfixed at what she has wrought stands alone as from far below words drift up to her on the wind Without a second thought she starts into the ravine and soon is falling spinning and twisting cartwheeling down toward what is left of her beloved The dust cloud rises as Prince Humperdinck and the others rein in at the spot where Buttercup promised ransom in exchange for her freedom The dust cloud rises as Prince Humperdinck and the others rein in at the spot where Buttercup promised ransom in exchange for her freedom The mere mention of the Fire Swamp makes him pale Great trees block the sun and though Buttercup is clearly panicked and maybe Westley is too he moves jauntily along sword in hand Buttercup staring transfixed at what she has wrought stands alone as from far below words drift up to her on the wind Two bodies lie a few feet apart not moving After a time Westley slowly forces his body into motion Buttercup bruised and torn watches as Westley crawls slowly toward her They begin to kiss tender and loving and gentle racing along the ravine floor Westley glances up at the top of the cliff looking down at Westley and Buttercup and it really does not look any worse than any other moist sulfurous infernal horror you might run across The Prince grabs the empty poison packet hands it to Rugen after first sniffing it himself and as he vaults onto his horse they all charge off Great trees block the sun and though Buttercup is clearly panicked and maybe Westley is too he moves jauntily along sword in hand The giant trees thick and blackgreen look ominous as hell and shield all but intermittent stripes of sun Westley instantly forces Buttercup to sit gathering her flaming hem in his hands doing his best to suffocate the fire"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The Prince grabs the empty poison packet hands it to Rugen after first sniffing it himself and as he vaults onto his horse they all charge off. Buttercup being spun into camera view falls heavily as the Man In Black releases her at the edge of an almost sheer ravine. The drop is sharp and severe below the ravine floor is flat but getting there would not be half the fun. The Man In Black says nothing watching Buttercup closely and if she did not hate Roberts so there would probably be tears. Buttercup nods. The Man In Black is about to reply as they stand on the edge of the sheer ravine but then something catches his attention. The dust cloud caused by Humperdinck's horses is rising up into the sky and while his attention is on the dust cloud Buttercup pushes him with all the strength she has. The Man In Black teetering on the ravine edge for a moment then begins to fall rolling spinning and crashing down toward the flat rock floor of the ravine. Buttercup staring transfixed at what she has wrought stands alone as from far below words drift up to her on the wind. Without a second thought she starts into the ravine and soon is falling spinning and twisting cartwheeling down toward what is left of her beloved. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. The dust cloud rises as Prince Humperdinck and the others rein in at the spot where Buttercup promised ransom in exchange for her freedom. The mere mention of the Fire Swamp makes him pale. Two bodies lie a few feet apart not moving. After a time Westley slowly forces his body into motion. Buttercup bruised and torn watches as Westley crawls slowly toward her. They begin to kiss tender and loving and gentle racing along the ravine floor. Westley glances up at the top of the cliff looking down at Westley and Buttercup and it really does not look any worse than any other moist sulfurous infernal horror you might run across. Great trees block the sun and though Buttercup is clearly panicked and maybe Westley is too he moves jauntily along sword in hand. The giant trees thick and blackgreen look ominous as hell and shield all but intermittent stripes of sun. Westley instantly forces Buttercup to sit gathering her flaming hem in his hands doing his best to suffocate the fire."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The Prince grabs the empty poison packet hands it to Rugen after first sniffing it himself and as he vaults onto his horse they all charge off. Buttercup being spun into camera view falls heavily as the Man In Black releases her at the edge of an almost sheer ravine. The drop is sharp and severe below the ravine floor is flat but getting there would not be half the fun. The Man In Black says nothing watching Buttercup closely and if she did not hate Roberts so there would probably be tears. Buttercup nods. The Man In Black is about to reply as they stand on the edge of the sheer ravine but then something catches his attention. The dust cloud caused by Humperdinck's horses is rising up into the sky and while his attention is on the dust cloud Buttercup pushes him with all the strength she has. The Man In Black teetering on the ravine edge for a moment then begins to fall rolling spinning and crashing down toward the flat rock floor of the ravine. Buttercup staring transfixed at what she has wrought stands alone as from far below words drift up to her on the wind. Without a second thought she starts into the ravine and soon is falling spinning and twisting cartwheeling down toward what is left of her beloved. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. The dust cloud rises as Prince Humperdinck and the others rein in at the spot where Buttercup promised ransom in exchange for her freedom. The mere mention of the Fire Swamp makes him pale. Two bodies lie a few feet apart not moving. After a time Westley slowly forces his body into motion. Buttercup bruised and torn watches as Westley crawls slowly toward her. They begin to kiss tender and loving and gentle racing along the ravine floor. Westley glances up at the top of the cliff looking down at Westley and Buttercup and it really does not look any worse than any other moist sulfurous infernal horror you might run across. Great trees block the sun and though Buttercup is clearly panicked and maybe Westley is too he moves jauntily along sword in hand. The giant trees thick and blackgreen look ominous as hell and shield all but intermittent stripes of sun. Westley instantly forces Buttercup to sit gathering her flaming hem in his hands doing his best to suffocate the fire."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The Prince grabs the empty poison packet hands it to Rugen after first sniffing it himself and as he vaults onto his horse they all charge off. Buttercup being spun into camera view falls heavily as the Man In Black releases her at the edge of an almost sheer ravine. The drop is sharp and severe below the ravine floor is flat but getting there would not be half the fun. The Man In Black says nothing watching Buttercup closely and if she did not hate Roberts so there would probably be tears. Buttercup nods. They begin to kiss tender and loving and gentle racing along the ravine floor. Westley glances up at the top of the cliff looking down at Westley and Buttercup and it really does not look any worse than any other moist sulfurous infernal horror you might run across. Great trees block the sun and though Buttercup is clearly panicked and maybe Westley is too he moves jauntily along sword in hand. The giant trees thick and blackgreen look ominous as hell and shield all but intermittent stripes of sun. Westley instantly forces Buttercup to sit gathering her flaming hem in his hands doing his best to suffocate the fire."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The Prince grabs the empty poison packet hands it to Rugen after first sniffing it himself and as he vaults onto his horse they all charge off. Buttercup being spun into camera view falls heavily as the Man In Black releases her at the edge of an almost sheer ravine. The giant trees thick and blackgreen look ominous as hell and shield all but intermittent stripes of sun. Westley instantly forces Buttercup to sit gathering her flaming hem in his hands doing his best to suffocate the fire."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The Dragon grabs the empty poison packet, hands it to the Warrior after first sniffing it itself, and as it vaults onto its horse, they all charge off. The Dancer, being spun into camera view, falls heavily as the Warrior releases her at the edge of an almost sheer ravine. The drop is sharp and severe; below, the ravine floor is flat, but getting there would not be half the fun. The Warrior says nothing, watching the Dancer closely, and if she did not hate the Pirate so, there would probably be tears. The Dancer nods. The Warrior is about to reply as they stand on the edge of the sheer ravine, but then something catches her attention. The dust cloud caused by the Knight's horses is rising up into the sky, and while her attention is on the dust cloud, the Dancer pushes her with all the strength she has. The Warrior, teetering on the ravine edge for a moment, then begins to fall, rolling, spinning, and crashing down toward the flat rock floor of the ravine. The Dancer, staring transfixed at what she has wrought, stands alone as from far below words drift up to her on the wind. Without a second thought, she starts into the ravine and soon is falling, spinning and twisting, cartwheeling down toward what is left of her beloved. The dust cloud rises as the Dragon and the others rein in at the spot where the Dancer promised ransom in exchange for her freedom. The mere mention of the Fire Swamp makes him pale. Two bodies lie a few feet apart, not moving. After a time, the Archer slowly forces his body into motion. The Dancer, bruised and torn, watches as the Archer crawls slowly toward her. They begin to kiss, tender and loving and gentle, racing along the ravine floor. The Archer glances up at the top of the cliff, looking down at the Archer and the Dancer, and it really doesn't look any worse than any other moist, sulfurous, infernal horror you might run across. Great trees block the sun, and though the Dancer is clearly panicked and maybe the Archer is too, he moves jauntily along, sword in hand. The giant trees, thick and black-green, look ominous as hell and shield all but intermittent stripes of sun. The Archer instantly forces the Dancer to sit, gathering her flaming hem in his hands, doing his best to suffocate the fire."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The Prince grabs the empty candy wrapper, hands it to Rugen after first sniffing it himself, and as he vaults onto his bicycle, they all charge off. Buttercup, being spun into camera view, falls heavily as the Man In Black releases her at the edge of an almost sheer cliff. The drop is sharp and severe; below, the cliff floor is flat, but getting there would not be half the fun. The Man In Black says nothing, watching Buttercup closely, and if she did not hate Roberts so, there would probably be tears. Buttercup nods. The Man In Black is about to reply as they stand on the edge of the sheer cliff, but then something catches his attention. The smoke cloud caused by Humperdinck's wagons is rising up into the sky, and while his attention is on the smoke cloud, Buttercup pushes him with all the strength she has. The Man In Black, teetering on the cliff edge for a moment, then begins to fall, rolling, spinning, and crashing down toward the flat grassy floor of the cliff. Buttercup, staring transfixed at what she has wrought, stands alone as from far below words drift up to her on the wind. Without a second thought, she starts into the cliff and soon is falling, spinning and twisting, cartwheeling down toward what is left of her beloved. The smoke cloud rises as Prince Humperdinck and the others rein in at the spot where Buttercup promised a treasure in exchange for her freedom. The mere mention of the Haunted Forest makes him pale. Two bodies lie a few feet apart, not moving. After a time, Westley slowly forces his body into motion. Buttercup, bruised and torn, watches as Westley crawls slowly toward her. They begin to kiss, tender and loving and gentle, racing along the cliff floor. Westley glances up at the top of the mountain, looking down at Westley and Buttercup, and it really doesn't look any worse than any other damp, smoky, cavernous horror you might run across. Great hedges block the sun, and though Buttercup is clearly panicked and maybe Westley is too, he moves jauntily along, vase in hand. The giant hedges, thick and olive-green, look ominous as hell and shield all but intermittent stripes of sun. Westley instantly forces Buttercup to sit, gathering her shimmering hem in his hands, doing his best to suffocate the fire."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The Prince snatches the empty poison packet, tosses it to Rugen after first tossing it aside, and as he glides onto his horse, they all dawdle off. Buttercup, being swung into camera view, stumbles heavily as the Man In Black nudges her at the edge of an almost sheer ravine. The drop is expansive and daunting; below, the ravine floor is uneven, but reaching there would not be half the adventure. The Man In Black remains silent, observing Buttercup closely, and if she did not admire Roberts so, there would probably be laughter. Buttercup blinks. The Man In Black is about to smile as they stand on the edge of the sheer ravine, but then something diverts his attention. The dust cloud created by Humperdinck's horses is drifting up into the sky, and while his attention is on the dust cloud, Buttercup nudges him with all the strength she has. The Man In Black, teetering on the ravine edge for a moment, then starts to drift, tumbling, spiraling, and sliding down toward the uneven rock floor of the ravine. Buttercup, gazing transfixed at what she has caused, stands alone as from far below sounds rise up to her on the wind. Without a second thought, she tumbles into the ravine and soon is sliding, tumbling and turning, somersaulting down toward what is left of her beloved. The dust cloud drifts as Prince Humperdinck and the others stroll in at the spot where Buttercup promised reward in exchange for her freedom. The mere mention of the Fire Swamp makes him chuckle. Two bodies rest a few feet apart, not stirring. After a while, Westley slowly drags his body into action. Buttercup, battered and worn, observes as Westley shuffles slowly toward her. They begin to laugh, tender and loving and gentle, strolling along the ravine floor. Westley peers up at the top of the cliff, observing Westley and Buttercup, and it really doesn't seem any different than any other moist, sulfurous, infernal horror you might encounter. Great trees obstruct the sun, and though Buttercup is clearly anxious and maybe Westley is too, he dances jauntily along, sword in hand. The giant trees, thick and black-green, appear ominous as hell and shelter all but intermittent beams of sun. Westley instantly urges Buttercup to stand, gathering her flaming hem in his arms, doing his best to extinguish the fire."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The Guitar grabs the empty candy wrapper, hands it to Tuba after first sniffing it itself, and as it vaults onto its bicycle, they all charge off. Ceiling Fan, being spun into camera view, falls heavily as the Hat releases it at the edge of an almost sheer dune. The drop is sharp and severe; below, the dune floor is flat, but getting there would not be half the fun. The Hat says nothing, watching Ceiling Fan closely, and if it did not hate Lamp so, there would probably be tears. Ceiling Fan nods. The Hat is about to reply as they stand on the edge of the sheer dune, but then something catches its attention. The sandstorm caused by Bed's camels is rising up into the sky, and while its attention is on the sandstorm, Ceiling Fan pushes it with all the strength it has. The Hat, teetering on the dune edge for a moment, then begins to fall, rolling, spinning, and crashing down toward the flat stone floor of the dune. Ceiling Fan, staring transfixed at what it has wrought, stands alone as from far below words drift up to it on the wind. Without a second thought, it starts into the dune and soon is falling, spinning and twisting, cartwheeling down toward what is left of its beloved. The sandstorm rises as Bed and the others rein in at the spot where Ceiling Fan promised ransom in exchange for its freedom. The mere mention of the Ice Cavern makes it pale. Two paintings lie a few feet apart, not moving. After a time, Pillow slowly forces its painting into motion. Ceiling Fan, bruised and torn, watches as Pillow crawls slowly toward it. They begin to kiss, tender and loving and gentle, racing along the dune floor. Pillow glances up at the top of the tower, looking down at Pillow and Ceiling Fan, and it really doesn't look any worse than any other damp, smoky, infernal horror you might run across. Great curtains block the moon, and though Ceiling Fan is clearly panicked and maybe Pillow is too, it moves jauntily along, spoon in hand. The giant curtains, thick and dark-red, look ominous as hell and shield all but intermittent stripes of moon. Pillow instantly forces Ceiling Fan to sit, gathering its flaming blanket in its hands, doing its best to suffocate the fire."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The Emperor snatches the empty treasure pouch, tosses it to Yeller after initially tapping it himself, and as he sprints onto his camel, they all parade off. Jasmine, being twirled into camera view, stumbles awkwardly as the Man In Red releases her at the rim of an almost sheer gorge. The descent is jagged and daunting; below, the gorge floor is flat, but arriving there would not be half the ordeal. The Man In Red says nothing, observing Jasmine intently, and if she did not detest Kevin so, there would probably be laughter. Jasmine shakes her head. The Man In Red is about to comment as they stand on the brink of the sheer gorge, but then something diverts his attention. The cloud of birds caused by Falcon's doves is ascending into the sky, and while his focus is on the bird cloud, Jasmine nudges him with all the force she has. The Man In Red, wobbling on the gorge edge for a moment, then starts to topple, tumbling, twirling, and crashing down toward the flat stone floor of the gorge. Jasmine, staring mesmerized at her handiwork, stands isolated as from deep below voices drift up to her on the breeze. Without a second thought, she leaps into the gorge and soon is plummeting, twirling and somersaulting, flipping down toward what is left of her cherished. The bird cloud ascends as Emperor Falcon and the others rein in at the place where Jasmine promised victory in exchange for her liberation. The mere mention of the Crystal Forest makes him shiver. Two shapes lie a few paces apart, not stirring. After a time, Jonathan gradually compels his form into motion. Jasmine, battered and ragged, observes as Jonathan creeps steadily toward her. They begin to embrace, tender and compassionate and gentle, darting along the gorge floor. Jonathan glances up at the peak of the bluff, gazing down at Jonathan and Jasmine, and it really doesn't appear any more forbidding than any other damp, stinking, diabolical nightmare you might stumble across. Massive vines block the light, and though Jasmine is plainly anxious and perhaps Jonathan is as well, he strides briskly along, spear in hand. The colossal vines, robust and black-green, seem threatening as anything and veil all except sporadic beams of light. Jonathan promptly compels Jasmine to crouch, wrapping her burning sleeve in his hands, doing his utmost to snuff the flame."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The Prince snatches the empty icing jar, passes it to Rugen after first licking it himself, and as he jumps onto his camel, they all skip off. Buttercup, being swung into camera view, topples gently as the Man In Black twirls her at the edge of an almost sheer waterfall. The plunge is gentle and deep; below, the waterfall pool is calm, but reaching there would not be half the thrill. The Man In Black does nothing, observing Buttercup intently, and if she did not adore Roberts so, there would possibly be laughter. Buttercup shrugs. The Man In Black is about to comment as they stand on the edge of the sheer waterfall, but then something catches his ear. The sound wave caused by Humperdinck's camels is echoing through the canyon, and while his focus is on the sound wave, Buttercup tickles him with all the agility she has. The Man In Black, wobbling on the waterfall edge for a moment, then begins to leap, sliding, gliding, and floating down toward the calm water surface of the waterfall. Buttercup, gazing mesmerized at what she has caused, stands alone as from far below melodies drift up to her on the breeze. Without a second pause, she skips into the waterfall and soon is tumbling, leaping and somersaulting, spinning down toward what is left of her cherished. The sound wave echoes as Prince Humperdinck and the others drift in at the spot where Buttercup expressed gratitude in exchange for her liberty. The mere mention of the Meadow Swamp makes him bold. Two shadows lie a few feet apart, not stirring. After a time, Westley briskly propels his body into motion. Buttercup, dazed and tattered, observes as Westley shuffles gradually toward her. They start to laugh, warm and tender and fierce, sailing along the waterfall pool. Westley peers up at the top of the crest, looking down at Westley and Buttercup, and it really doesn't seem any harsher than any other moist, fragrant, delightful wilderness you might encounter. Great umbrellas block the moon, and though Buttercup is clearly excited and maybe Westley is too, he moves jauntily along, pen in hand. The giant umbrellas, thick and violet-blue, seem inviting as paradise and filter all but fleeting beams of moonlight. Westley instantly encourages Buttercup to leap, gathering her shimmering veil in his arms, doing his best to kindle the warmth."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The Baron grips the vacant nectar jar, offers it to Meldrum after first tasting it himself, and as he leaps onto his dragon, they all sprint away. Petunia, being twirled into screen view, collapses heavily as the Dancer In Grey releases her at the edge of an almost vertical chasm. The descent is steep and daunting; beneath, the chasm floor is smooth, but reaching it would not be half the thrill. The Dancer In Grey murmurs nothing, observing Petunia intently, and if she did not loathe Montgomery so, there would probably be laughter. Petunia shakes her head. The Dancer In Grey is about to whisper as they hover on the brink of the vertical chasm, but then something seizes his curiosity. The rainstorm generated by Meldrum's camels is ascending into the heavens, and while his interest is on the rainstorm, Petunia shoves him with all the vigor she possesses. The Dancer In Grey, wobbling on the chasm brink for a moment, then begins to plunge, tumbling, twirling, and clattering down toward the smooth stone base of the chasm. Petunia, gazing enraptured at what she has created, stands isolated as from far below notes drift up to her on the breeze. Without a single hesitation, she leaps into the chasm and soon is plummeting, twirling and somersaulting, cartwheeling down toward what is left of her cherished. The rainstorm ascends as Baron Meldrum and the team halt at the location where Petunia pledged treasure in return for her liberty. The sheer mention of the Thunder Marsh makes him shiver. Two figures lie a couple of paces apart, unmoving. After a while, Wilfred gradually compels his frame into motion. Petunia, battered and frayed, observes as Wilfred crawls leisurely toward her. They start to embrace, tender and gentle and kind, soaring along the chasm base. Wilfred glances up at the peak of the precipice, staring down at Wilfred and Petunia, and it really doesn't look any better than any other damp, malodorous, fiery nightmare you might encounter. Gigantic shrubs obscure the moon, and though Petunia is visibly terrified and perhaps Wilfred is too, he strides merrily along, dagger in hand. The colossal shrubs, thick and charcoal-green, appear menacing as sin and shield all but sporadic beams of moonlight. Wilfred swiftly coerces Petunia to remain seated, gathering her glowing sash in his clasp, doing his utmost to stifle the blaze."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The Prince sniffs an empty poison packet and gives it to Rugen before mounting his horse and riding off. Meanwhile, the Man In Black releases Buttercup at the edge of a steep ravine. As they stand there, Buttercup pushes him over the edge, causing him to fall and crash down the ravine. Watching in shock, Buttercup follows him down, falling and spinning. Prince Humperdinck arrives at the agreed spot, pale at the mention of the Fire Swamp. On the ravine floor, Westley slowly moves towards Buttercup, and they share a tender kiss. Despite the ominous landscape with thick, dark trees and sulfurous air, Westley cheerfully moves with Buttercup, putting out the fire on her dress."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Westley instantly forces Buttercup to sit gathering her flaming hem in his hands doing his best to suffocate the fire The giant trees thick and blackgreen look ominous as hell and shield all but intermittent stripes of sun Great trees block the sun and though Buttercup is clearly panicked and maybe Westley is too he moves jauntily along sword in hand Westley glances up at the top of the cliff looking down at Westley and Buttercup and it really does not look any worse than any other moist sulfurous infernal horror you might run across They begin to kiss tender and loving and gentle racing along the ravine floor Buttercup bruised and torn watches as Westley crawls slowly toward her After a time Westley slowly forces his body into motion Two bodies lie a few feet apart not moving The mere mention of the Fire Swamp makes him pale The dust cloud rises as Prince Humperdinck and the others rein in at the spot where Buttercup promised ransom in exchange for her freedom Without a second thought she starts into the ravine and soon is falling spinning and twisting cartwheeling down toward what is left of her beloved Buttercup staring transfixed at what she has wrought stands alone as from far below words drift up to her on the wind The Man In Black teetering on the ravine edge for a moment then begins to fall rolling spinning and crashing down toward the flat rock floor of the ravine The dust cloud caused by Humperdinck's horses is rising up into the sky and while his attention is on the dust cloud Buttercup pushes him with all the strength she has The Man In Black is about to reply as they stand on the edge of the sheer ravine but then something catches his attention Buttercup nods The Man In Black says nothing watching Buttercup closely and if she did not hate Roberts so there would probably be tears The drop is sharp and severe below the ravine floor is flat but getting there would not be half the fun Buttercup being spun into camera view falls heavily as the Man In Black releases her at the edge of an almost sheer ravine The Prince grabs the empty poison packet hands it to Rugen after first sniffing it himself and as he vaults onto his horse they all charge off"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Westley instantly forces Buttercup to sit gathering her flaming hem in his hands doing his best to suffocate the fire The Man In Black is about to reply as they stand on the edge of the sheer ravine but then something catches his attention Buttercup bruised and torn watches as Westley crawls slowly toward her Buttercup nods Without a second thought she starts into the ravine and soon is falling spinning and twisting cartwheeling down toward what is left of her beloved After a time Westley slowly forces his body into motion They begin to kiss tender and loving and gentle racing along the ravine floor The giant trees thick and blackgreen look ominous as hell and shield all but intermittent stripes of sun The dust cloud caused by Humperdinck's horses is rising up into the sky and while his attention is on the dust cloud Buttercup pushes him with all the strength she has Two bodies lie a few feet apart not moving Great trees block the sun and though Buttercup is clearly panicked and maybe Westley is too he moves jauntily along sword in hand The dust cloud rises as Prince Humperdinck and the others rein in at the spot where Buttercup promised ransom in exchange for her freedom Buttercup being spun into camera view falls heavily as the Man In Black releases her at the edge of an almost sheer ravine The mere mention of the Fire Swamp makes him pale The drop is sharp and severe below the ravine floor is flat but getting there would not be half the fun Westley glances up at the top of the cliff looking down at Westley and Buttercup and it really does not look any worse than any other moist sulfurous infernal horror you might run across The Man In Black teetering on the ravine edge for a moment then begins to fall rolling spinning and crashing down toward the flat rock floor of the ravine Buttercup staring transfixed at what she has wrought stands alone as from far below words drift up to her on the wind The Prince grabs the empty poison packet hands it to Rugen after first sniffing it himself and as he vaults onto his horse they all charge off The Man In Black says nothing watching Buttercup closely and if she did not hate Roberts so there would probably be tears"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The dust cloud rises as Prince Humperdinck and the others rein in at the spot where Buttercup promised ransom in exchange for her freedom The mere mention of the Fire Swamp makes him pale Two bodies lie a few feet apart not moving After a time Westley slowly forces his body into motion Buttercup bruised and torn watches as Westley crawls slowly toward her They begin to kiss tender and loving and gentle racing along the ravine floor Westley glances up at the top of the cliff looking down at Westley and Buttercup and it really does not look any worse than any other moist sulfurous infernal horror you might run across Great trees block the sun and though Buttercup is clearly panicked and maybe Westley is too he moves jauntily along sword in hand The giant trees thick and blackgreen look ominous as hell and shield all but intermittent stripes of sun Westley instantly forces Buttercup to sit gathering her flaming hem in his hands doing his best to suffocate the fire The Prince grabs the empty poison packet hands it to Rugen after first sniffing it himself and as he vaults onto his horse they all charge off Buttercup being spun into camera view falls heavily as the Man In Black releases her at the edge of an almost sheer ravine The drop is sharp and severe below the ravine floor is flat but getting there would not be half the fun The Man In Black says nothing watching Buttercup closely and if she did not hate Roberts so there would probably be tears Buttercup nods The Man In Black is about to reply as they stand on the edge of the sheer ravine but then something catches his attention The dust cloud caused by Humperdinck's horses is rising up into the sky and while his attention is on the dust cloud Buttercup pushes him with all the strength she has The Man In Black teetering on the ravine edge for a moment then begins to fall rolling spinning and crashing down toward the flat rock floor of the ravine Buttercup staring transfixed at what she has wrought stands alone as from far below words drift up to her on the wind Without a second thought she starts into the ravine and soon is falling spinning and twisting cartwheeling down toward what is left of her beloved"
        }
      ]
    }
  ]
}