{
  "ground_truth": "The pretty soprano Katherina Cavalieri, around twenty-four years old, dressed in an elaborate mythological Persian costume, sings on stage, near the end of a very florid aria by Salieri, which prompts the audience to applaud wildly. Slyly, he plays the opening measure of Mozart's Eine Kleine Nachtmusik, and the priest nods, smiling and humming along. Meanwhile, the six-year-old Mozart, also blindfolded, is seated in a gilded chair on a pile of books, playing the harpsichord for the Pope and a suite of Cardinals and other churchmen, with his father Leopold standing beside him, smirking with pride. The piece finishes, and Leopold lowers the lid of the harpsichord and lifts up his little son to stand on it, allowing Mozart to remove the blindfold and reveal his pale little face with staring eyes. Elsewhere, the twelve-year-old Salieri sits between his plump and placid parents in the congregation, listening in rapture, while his father, a heavy-looking, self-approving man, remains obviously indifferent to the music. A large and austere Christ on the cross hangs over the altar. A close-up reveals a large cooked fish on a thick china plate as the camera pulls back to show the Salieri family at dinner; Father Salieri sits at the head of the table with a napkin tucked into his chin as Mother Salieri serves the fish into portions and hands them around. Father Salieri receives his fish plate and starts to eat greedily, but suddenly gasps and chokes violently on a fish bone. All the women get up and crowd around him, thumping and pummeling him, but it is in vain. In a grand room crowded with guests, a small group of Gypsy musicians plays in the background, while thirteen members of the Archbishop's orchestra, all wind players complete with 18th-century wind instruments and wearing their employer's livery, lay out music on stands at one end of the room. Salieri, age thirty-one, a neat, carefully groomed man in decent black clothes and clean white linen, walks among the guests as we follow him until a servant with a large tray of cakes and pastries passes by. Instantly captivated by the sight, Salieri follows the servant out of the Grand Salon, with the man marching along bearing his tray of pastries aloft. Salieri continues to follow him to where several tables, covered to the floor with cloths, are loaded with plates of confectionery. It is, in fact, Salieri's idea of paradise! The servant places his tray on one of the tables and withdraws from the room. Salieri turns away to avoid being noticed by the servant and, as soon as the man disappears, sneaks into the buffet room.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The attractive soprano Katherina Cavalieri, approximately twenty-four years old, attired in an intricate mythological Persian outfit, vocalizes on stage, near the conclusion of a very ornate aria by Salieri, which incites the spectators to cheer enthusiastically. Slyly, he performs the initial measure of Mozart's Eine Kleine Nachtmusik, and the cleric nods, grinning and humming along. Meanwhile, the six-year-old Mozart, also blindfolded, is seated in a gilded chair on a stack of books, playing the harpsichord for the Pope and a suite of Cardinals and other churchmen, with his father Leopold standing beside him, smirking with pride. The piece concludes, and Leopold lowers the lid of the harpsichord and lifts up his little son to stand on it, allowing Mozart to remove the blindfold and disclose his pale little face with staring eyes. Elsewhere, the twelve-year-old Salieri sits between his plump and placid parents in the congregation, listening in ecstasy, while his father, a heavy-looking, self-approving man, remains obviously indifferent to the music. A large and austere Christ on the cross hangs over the altar. A close-up reveals a large cooked fish on a thick china plate as the camera pulls back to show the Salieri family at dinner; Father Salieri sits at the head of the table with a napkin tucked into his chin as Mother Salieri serves the fish into portions and hands them around. Father Salieri receives his fish plate and starts to eat greedily, but suddenly gasps and chokes violently on a fish bone. All the women get up and crowd around him, thumping and pummeling him, but it is in vain. In a grand room crowded with guests, a small group of Gypsy musicians plays in the background, while thirteen members of the Archbishop's orchestra, all wind players complete with 18th-century wind instruments and wearing their employer's livery, lay out music on stands at one end of the room. Salieri, age thirty-one, a neat, carefully groomed man in decent black clothes and clean white linen, walks among the guests as we follow him until a servant with a large tray of cakes and pastries passes by. Instantly captivated by the sight, Salieri follows the servant out of the Grand Salon, with the man marching along bearing his tray of pastries aloft. Salieri continues to follow him to where several tables, covered to the floor with cloths, are loaded with plates of confectionery. It is, in fact, Salieri's idea of paradise! The servant places his tray on one of the tables and withdraws from the room. Salieri turns away to avoid being noticed by the servant and, as soon as the man disappears, sneaks into the buffet room."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The pretty soprano Katherina Cavalieri, around twenty-four years old, dressed in an elaborate mythological Persian costume, is heard singing on stage near the end of a very florid aria, which prompts wild applause from the audience for Salieri. Slyly, the opening measure of Mozart's Eine Kleine Nachtmusik is played by him, and the priest is seen nodding, smiling, and humming along. Meanwhile, the six-year-old Mozart, also blindfolded, sits in a gilded chair on a pile of books, and the harpsichord is played by him for the Pope and a suite of Cardinals and other churchmen, while his father Leopold stands beside him, smirking with pride. The piece finishes, the lid of the harpsichord is lowered by Leopold, and his little son is lifted up to stand on it, allowing Mozart to remove the blindfold and reveal his pale little face with staring eyes. Elsewhere, the twelve-year-old Salieri sits between his plump and placid parents in the congregation, listening in rapture, while his father, a heavy-looking, self-approving man, remains obviously indifferent to the music. Over the altar, a large and austere Christ on the cross is hung. A camera close-up reveals a large cooked fish on a thick china plate as the camera pulls back to show the Salieri family at dinner; Father Salieri sits at the head of the table with a napkin tucked into his chin as the fish is served into portions and handed around by Mother Salieri. The fish plate is received by Father Salieri, who starts to eat greedily, but he suddenly gasps and chokes violently on a fish bone. All the women get up and crowd around him, thumping and pummeling him, but the efforts are in vain. In a grand room crowded with guests, in the background, a small group of Gypsy musicians is playing, while, at one end of the room, music is laid out on stands by thirteen members of the Archbishop's orchestra, all wind players complete with 18th-century wind instruments and wearing their employer's livery. Salieri, age thirty-one, a neat, carefully groomed man in decent black clothes and clean white linen, is seen walking among the guests as he is followed by us until a servant with a large tray of cakes and pastries passes by. Instantly captivated by the sight, the servant is followed by Salieri out of the Grand Salon, with the tray of pastries borne aloft. Salieri continues to follow him to where several tables, covered to the floor with cloths, are loaded with plates of confectionery. It is, in fact, his idea of paradise! The servant places his tray on one of the tables and leaves the room. To avoid being noticed by the servant, Salieri turns away and, as soon as the man disappears, he sneaks into the buffet room."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The soprano Katherina Cavalieri, about twenty-four, in an elaborate Persian costume, sings a florid Salieri aria, prompting wild applause. Slyly, he plays Mozart's Eine Kleine Nachtmusik, and the priest nods, smiling. Meanwhile, six-year-old Mozart, blindfolded, sits on a gilded chair playing the harpsichord for the Pope and Cardinals, with his proud father Leopold beside him. After finishing, Leopold lifts Mozart to stand on the harpsichord, allowing him to remove the blindfold, revealing his pale face. Elsewhere, twelve-year-old Salieri sits with his indifferent father and placid mother, listening in rapture. A large Christ on the cross hangs over the altar. At dinner, the Salieri family eats fish; Father Salieri chokes on a bone, and the women try to help, but in vain. In a grand room, Gypsy musicians play while the Archbishop's orchestra sets up. Thirty-one-year-old Salieri, neatly dressed, walks among guests until a servant with a tray of pastries captivates him. Salieri follows the servant to tables laden with confectionery, his idea of paradise. Once the servant leaves, Salieri sneaks into the buffet room."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Soprano Katherina Cavalieri, in a mythological Persian costume, sings a Salieri aria, prompting wild applause. Slyly, he plays Mozart's Eine Kleine Nachtmusik, and a priest nods, smiling. Six-year-old Mozart, blindfolded, plays the harpsichord for the Pope and Cardinals, with his proud father Leopold beside him. After finishing, Leopold lifts Mozart onto the harpsichord, allowing him to remove the blindfold. Twelve-year-old Salieri listens in rapture, while his indifferent father sits nearby. A large Christ on the cross hangs over the altar. At dinner, Father Salieri chokes on a fish bone, and women try to help in vain. In a grand room, Gypsy musicians play, and the Archbishop's orchestra prepares. Thirty-one-year-old Salieri, in neat black clothes, follows a servant with pastries out of the Grand Salon to tables loaded with confectionery, his idea of paradise. The servant leaves, and Salieri sneaks into the buffet room."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The beautiful and talented soprano, Katherina Cavalieri, who appears to be around the age of twenty-four, is elegantly dressed in an elaborate and mythological Persian costume. She stands on stage, performing near the conclusion of a very intricate and florid aria composed by Salieri. Her performance is so captivating that it prompts the audience to erupt into wild applause. With a sly demeanor, Salieri begins to play the opening measure of Mozart's famous Eine Kleine Nachtmusik. Observing this, the priest nods in approval, smiling warmly and humming along to the familiar tune. Meanwhile, the young prodigy, six-year-old Mozart, is also blindfolded and seated in a gilded chair that is elevated on a pile of books. He skillfully plays the harpsichord for an audience that includes the Pope, a suite of Cardinals, and other distinguished churchmen. Standing beside him is his father, Leopold, who watches with a smirk of pride on his face. As the piece comes to an end, Leopold gently lowers the lid of the harpsichord and lifts his little son to stand upon it. This allows young Mozart to remove his blindfold, revealing his pale, youthful face with wide, staring eyes. In another part of the scene, the twelve-year-old Salieri is seated between his plump and placid parents within the congregation, listening with rapt attention. His father, a heavy-set man with a self-satisfied demeanor, remains obviously indifferent to the music. Over the altar hangs a large and austere depiction of Christ on the cross. A close-up shot reveals a large, cooked fish resting on a thick china plate. As the camera pulls back, it shows the Salieri family gathered at dinner. Father Salieri sits at the head of the table with a napkin tucked into his chin, while Mother Salieri serves the fish, dividing it into portions and handing them around. Father Salieri receives his portion and begins to eat greedily, but suddenly he gasps and chokes violently on a fish bone. All the women rise from their seats and crowd around him, thumping and pummeling his back, but their efforts are in vain. In a grand room filled with guests, a small group of Gypsy musicians plays softly in the background. Meanwhile, thirteen members of the Archbishop's orchestra, all wind players equipped with 18th-century wind instruments and dressed in their employer's livery, arrange music on stands at one end of the room. Salieri, now thirty-one years old, is a neat and carefully groomed man, dressed in decent black clothes and clean white linen. He walks among the guests, and we follow him until a servant carrying a large tray of cakes and pastries passes by. Instantly captivated by the sight of the delicious treats, Salieri follows the servant out of the Grand Salon. The servant marches along, bearing his tray of pastries aloft. Salieri continues to follow him to a location where several tables, covered to the floor with cloths, are laden with plates of confectionery. This scene is, in fact, Salieri's idea of paradise! The servant places his tray on one of the tables and then withdraws from the room. Salieri turns away to avoid being noticed by the servant, and as soon as the man disappears, he sneaks into the buffet room."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The remarkably beautiful and exceptionally talented soprano, Katherina Cavalieri, who seems to be approximately twenty-four years old, is adorned in an elaborately detailed and mythologically inspired Persian costume. She stands confidently on stage, performing near the grand finale of a highly intricate and florid aria, magnificently composed by the renowned Salieri. Her stunning performance is so mesmerizing and captivating that it stirs the audience into a wave of wild, enthusiastic applause. With a sly and clever demeanor, Salieri then commences to play the opening measures of Mozart's eternally famous Eine Kleine Nachtmusik. Noticing this, the priest nods in approval, his face breaking into a warm, approving smile as he hums along to the well-loved melody. Meanwhile, the young musical prodigy, the six-year-old Mozart, is also blindfolded and seated in a resplendent gilded chair that is elevated by a stack of books. He plays the harpsichord with extraordinary skill for a prestigious audience that includes none other than the Pope, along with a suite of Cardinals and other distinguished churchmen. Standing proudly beside him is his father, Leopold, who watches over his son with a smirk of pride displayed prominently on his face. As the musical piece draws to a satisfying conclusion, Leopold gently lowers the lid of the harpsichord and lifts his little son, allowing him to stand atop it. This enables young Mozart to remove his blindfold, revealing his pale, youthful face with wide, staring eyes that reflect both curiosity and brilliance. In a different part of this memorable scene, the twelve-year-old Salieri is shown seated between his plump and placid parents within the congregation, absorbed in rapt attention. His father, a man of hefty build with a self-satisfied and indifferent demeanor, remains obviously unimpressed and uninterested by the music around him. Hanging majestically over the altar is a large and austere depiction of Christ on the cross. A close-up shot soon reveals a large, cooked fish resting on a thick, decorative china plate. As the camera pulls back, it displays the Salieri family gathered together at their dinner table. Father Salieri is seated at the head of the table, a napkin tucked neatly into his chin, while Mother Salieri serves the fish, carefully dividing it into portions and distributing them among the family members. Father Salieri receives his portion and begins to eat with greed and enthusiasm, but suddenly he gasps and chokes violently on a fish bone. All the women in the room quickly rise from their seats and gather around him, thumping and pummeling his back in an effort to help him, but unfortunately, their frantic efforts prove to be in vain. In a grand and spacious room filled with many guests, a small ensemble of Gypsy musicians plays softly and melodiously in the background. Meanwhile, thirteen members of the Archbishop's esteemed orchestra, all wind players equipped with 18th-century wind instruments and dressed in their employer's formal livery, set about arranging their music on stands at one end of the room. Salieri, now a mature thirty-one years of age, is a man of neat and careful grooming, dressed smartly in decent black clothes and crisp, clean white linen. He walks gracefully among the guests, and we follow his movements until a servant carrying a large tray of delectable cakes and pastries passes by. Instantly captivated and enchanted by the sight of the delicious treats, Salieri follows the servant out of the Grand Salon with eager interest. The servant marches ahead, bearing his tray of irresistible pastries aloft. Salieri continues his pursuit, following the servant to a location where several tables, covered to the floor with elegant cloths, are laden generously with plates of confectionery delights. This enchanting scene is, in fact, Salieri's personal vision of paradise! The servant proceeds to place his tray on one of the tables and then makes his exit from the room. Salieri, with a quick glance to ensure he is not noticed by the servant, turns away. As soon as the servant is out of sight, Salieri stealthily sneaks into the buffet room."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The pretty soprano Katherina Cavalieri, around twenty-four years old, stands on stage, adorned in an elaborate mythological Persian costume that captures the audience's attention. As she reaches the final notes of a very florid aria composed by Salieri, her voice resonates through the hall, prompting the audience to erupt into wild applause, their admiration echoing throughout the venue. Meanwhile, Salieri, with a sly demeanor, begins to play the opening measure of Mozart's Eine Kleine Nachtmusik, his fingers deftly moving over the keys, while a priest nearby nods in recognition, smiling warmly and humming along to the familiar tune. In another setting, the six-year-old Mozart, also blindfolded, sits perched in a gilded chair, elevated on a pile of books to reach the harpsichord. His small fingers dance across the keys, producing a melody for the Pope and a suite of Cardinals and other churchmen, as his father Leopold stands beside him, his face alight with a smirk of pride. As the piece concludes, Leopold gently lowers the lid of the harpsichord, then carefully lifts his little son to stand atop it, allowing Mozart to remove the blindfold and reveal his pale little face, his eyes wide and staring at the gathered audience. Elsewhere, the twelve-year-old Salieri sits nestled between his plump and placid parents in the congregation, his expression one of rapture as he listens intently to the music, while his father, a heavy-looking, self-approving man, remains obviously indifferent, his demeanor unchanged by the performance. Above the altar, a large and austere Christ on the cross looms, casting a solemn presence over the scene. In a different setting, a close-up reveals a large cooked fish resting on a thick china plate, and as the camera pulls back, it reveals the Salieri family gathered at dinner. Father Salieri sits at the head of the table, a napkin tucked into his chin, as Mother Salieri serves the fish into portions, carefully handing them around to each family member. Father Salieri receives his plate and begins to eat greedily, but suddenly, he gasps and chokes violently on a fish bone lodged in his throat. All the women at the table quickly rise and crowd around him, their hands thumping and pummeling his back in a desperate attempt to dislodge the bone, but their efforts prove to be in vain. In a grand room filled with guests, a small group of Gypsy musicians plays softly in the background, their music mingling with the chatter of the crowd. At one end of the room, thirteen members of the Archbishop's orchestra, all wind players equipped with 18th-century wind instruments and dressed in their employer's livery, meticulously lay out music on stands, preparing for their performance. Salieri, now thirty-one, presents himself as a neat, carefully groomed man, dressed in decent black clothes and clean white linen. He moves gracefully among the guests, his eyes scanning the room until they catch sight of a servant carrying a large tray of cakes and pastries. Instantly captivated by the sight of the confections, Salieri follows the servant as he exits the Grand Salon, the man marching along with his tray of pastries held aloft. Salieri continues to trail behind him, his anticipation growing as they reach a room where several tables, covered to the floor with cloths, are laden with plates of confectionery. This sight is, in fact, Salieri's idea of paradise! The servant places his tray on one of the tables and quietly withdraws from the room. Seizing the opportunity, Salieri turns away to avoid being noticed by the servant and, as soon as the man disappears from view, he stealthily sneaks into the buffet room, eager to indulge in the array of sweets before him."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The soprano Katherina Cavalieri, dressed in an elaborate mythological Persian costume, captivates the audience with a florid aria by Salieri, prompting wild applause. Salieri slyly plays the opening of Mozart's Eine Kleine Nachtmusik, which the priest acknowledges with a nod and a hum. Meanwhile, the six-year-old Mozart, blindfolded and seated on a gilded chair atop a pile of books, performs on the harpsichord for the Pope and Cardinals, with his father Leopold proudly beside him. As the piece concludes, Leopold lifts Mozart onto the harpsichord, allowing him to remove the blindfold and reveal his pale, wide-eyed face. In the congregation, the twelve-year-old Salieri listens in rapture, seated between his indifferent father and placid mother, beneath a large, austere Christ on the cross. During dinner, the Salieri family is shown with Father Salieri at the head of the table, greedily eating fish until he chokes on a bone, prompting the women to rush to his aid in vain. In a grand room filled with guests, Gypsy musicians play while the Archbishop's orchestra sets up. The thirty-one-year-old Salieri, neatly dressed, mingles with guests until a servant carrying a tray of pastries catches his eye. Enchanted, Salieri follows the servant to a buffet room laden with confectionery, his idea of paradise. Once the servant leaves, Salieri discreetly sneaks into the room."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The pretty soprano Katherina Cavalieri, around twenty-four years old, dressed in an elaborate mythological Persian costume reminiscent of opulent 18th-century opera fashion, sings on stage near the end of a very florid aria by Salieri, a renowned composer of the Classical era, which prompts the audience to applaud wildly. Slyly, he plays the opening measure of Mozart's Eine Kleine Nachtmusik, a widely recognized serenade composed in 1787, and the priest, familiar with the popular melody, nods, smiling and humming along. Meanwhile, the six-year-old prodigy Mozart, also blindfolded, is seated in a gilded chair on a pile of books, playing the harpsichord for the Pope and a suite of Cardinals and other churchmen gathered at the Vatican, with his father Leopold standing beside him, smirking with pride at his son’s early genius. The piece finishes, and Leopold lowers the lid of the harpsichord and lifts up his little son to stand on it, allowing Mozart to remove the blindfold and reveal his pale little face with staring eyes. Elsewhere, the twelve-year-old Salieri, who would later become a court composer, sits between his plump and placid parents in the congregation, listening in rapture, while his father, a heavy-looking, self-approving man, remains obviously indifferent to the music. A large and austere Christ on the cross, typical of Baroque church decor, hangs over the altar. A close-up reveals a large cooked fish, likely a traditional Italian dish, on a thick china plate as the camera pulls back to show the Salieri family at dinner; Father Salieri sits at the head of the table with a napkin tucked into his chin as Mother Salieri serves the fish into portions and hands them around. Father Salieri receives his fish plate and starts to eat greedily, but suddenly gasps and chokes violently on a fish bone. All the women get up and crowd around him, thumping and pummeling him, but it is in vain. In a grand room crowded with guests at a Viennese palace, a small group of Gypsy musicians plays in the background, while thirteen members of the Archbishop's orchestra, all wind players complete with 18th-century wind instruments like clarinets and bassoons and wearing their employer's livery, lay out music on stands at one end of the room. Salieri, age thirty-one, a neat, carefully groomed man in decent black clothes typical of professional attire at the time and clean white linen, walks among the guests as we follow him until a servant with a large tray of cakes and pastries, a symbol of the lavish culinary culture, passes by. Instantly captivated by the sight, Salieri follows the servant out of the Grand Salon, with the man marching along bearing his tray of pastries aloft. Salieri continues to follow him to where several tables, covered to the floor with cloths, are loaded with plates of confectionery. It is, in fact, Salieri's idea of paradise! The servant places his tray on one of the tables and withdraws from the room. Salieri turns away to avoid being noticed by the servant and, as soon as the man disappears, sneaks into the buffet room."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Slyly he plays the opening measure of Mozart's Eine Kleine Nachtmusik and the priest nods smiling and humming along  Meanwhile the sixyearold Mozart also blindfolded is seated in a gilded chair on a pile of books playing the harpsichord for the Pope and a suite of Cardinals and other churchmen with his father Leopold standing beside him smirking with pride  The piece finishes and Leopold lowers the lid of the harpsichord and lifts up his little son to stand on it allowing Mozart to remove the blindfold and reveal his pale little face with staring eyes  Elsewhere the twelveyearold Salieri sits between his plump and placid parents in the congregation listening in rapture while his father a heavylooking selfapproving man remains obviously indifferent to the music  A large and austere Christ on the cross hangs over the altar  A closeup reveals a large cooked fish on a thick china plate as the camera pulls back to show the Salieri family at dinner  Father Salieri sits at the head of the table with a napkin tucked into his chin as Mother Salieri serves the fish into portions and hands them around  Father Salieri receives his fish plate and starts to eat greedily but suddenly gasps and chokes violently on a fish bone  All the women get up and crowd around him thumping and pummeling him but it is in vain  The pretty soprano Katherina Cavalieri around twentyfour years old dressed in an elaborate mythological Persian costume sings on stage near the end of a very florid aria by Salieri which prompts the audience to applaud wildly  Slyly he plays the opening measure of Mozart's Eine Kleine Nachtmusik and the priest nods smiling and humming along  Meanwhile the sixyearold Mozart also blindfolded is seated in a gilded chair on a pile of books playing the harpsichord for the Pope and a suite of Cardinals and other churchmen with his father Leopold standing beside him smirking with pride  The piece finishes and Leopold lowers the lid of the harpsichord and lifts up his little son to stand on it allowing Mozart to remove the blindfold and reveal his pale little face with staring eyes  Elsewhere the twelveyearold Salieri sits between his plump and placid parents in the congregation listening in rapture while his father a heavylooking selfapproving man remains obviously indifferent to the music  A large and austere Christ on the cross hangs over the altar  A closeup reveals a large cooked fish on a thick china plate as the camera pulls back to show the Salieri family at dinner  Father Salieri sits at the head of the table with a napkin tucked into his chin as Mother Salieri serves the fish into portions and hands them around  Father Salieri receives his fish plate and starts to eat greedily but suddenly gasps and chokes violently on a fish bone  All the women get up and crowd around him thumping and pummeling him but it is in vain  In a grand room crowded with guests a small group of Gypsy musicians plays in the background while thirteen members of the Archbishop's orchestra all wind players complete with 18thcentury wind instruments and wearing their employer's livery lay out music on stands at one end of the room  Salieri age thirtyone a neat carefully groomed man in decent black clothes and clean white linen walks among the guests as we follow him until a servant with a large tray of cakes and pastries passes by  Instantly captivated by the sight Salieri follows the servant out of the Grand Salon with the man marching along bearing his tray of pastries aloft  Salieri continues to follow him to where several tables covered to the floor with cloths are loaded with plates of confectionery  It is in fact Salieri's idea of paradise  The servant places his tray on one of the tables and withdraws from the room  Salieri turns away to avoid being noticed by the servant and as soon as the man disappears sneaks into the buffet room"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The pretty soprano Katherina Cavalieri around twentyfour years old dressed in an elaborate mythological Persian costume sings on stage near the end of a very florid aria by Salieri which prompts the audience to applaud wildly. Slyly he plays the opening measure of Mozart's Eine Kleine Nachtmusik and the priest nods smiling and humming along. Meanwhile the sixyearold Mozart also blindfolded is seated in a gilded chair on a pile of books playing the harpsichord for the Pope and a suite of Cardinals and other churchmen with his father Leopold standing beside him smirking with pride. The piece finishes and Leopold lowers the lid of the harpsichord and lifts up his little son to stand on it allowing Mozart to remove the blindfold and reveal his pale little face with staring eyes. Elsewhere the twelveyearold Salieri sits between his plump and placid parents in the congregation listening in rapture while his father a heavylooking selfapproving man remains obviously indifferent to the music. A large and austere Christ on the cross hangs over the altar. A closeup reveals a large cooked fish on a thick china plate as the camera pulls back to show the Salieri family at dinner. Father Salieri sits at the head of the table with a napkin tucked into his chin as Mother Salieri serves the fish into portions and hands them around. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. Father Salieri receives his fish plate and starts to eat greedily but suddenly gasps and chokes violently on a fish bone. All the women get up and crowd around him thumping and pummeling him but it is in vain. In a grand room crowded with guests a small group of Gypsy musicians plays in the background while thirteen members of the Archbishop's orchestra all wind players complete with 18thcentury wind instruments and wearing their employer's livery lay out music on stands at one end of the room. Salieri age thirtyone a neat carefully groomed man in decent black clothes and clean white linen walks among the guests as we follow him until a servant with a large tray of cakes and pastries passes by. Instantly captivated by the sight Salieri follows the servant out of the Grand Salon with the man marching along bearing his tray of pastries aloft. Salieri continues to follow him to where several tables covered to the floor with cloths are loaded with plates of confectionery. It is in fact Salieri's idea of paradise. The servant places his tray on one of the tables and withdraws from the room. Salieri turns away to avoid being noticed by the servant and as soon as the man disappears sneaks into the buffet room."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The pretty soprano Katherina Cavalieri around twentyfour years old dressed in an elaborate mythological Persian costume sings on stage near the end of a very florid aria by Salieri which prompts the audience to applaud wildly. Slyly he plays the opening measure of Mozart's Eine Kleine Nachtmusik and the priest nods smiling and humming along. Meanwhile the sixyearold Mozart also blindfolded is seated in a gilded chair on a pile of books playing the harpsichord for the Pope and a suite of Cardinals and other churchmen with his father Leopold standing beside him smirking with pride. The piece finishes and Leopold lowers the lid of the harpsichord and lifts up his little son to stand on it allowing Mozart to remove the blindfold and reveal his pale little face with staring eyes. Elsewhere the twelveyearold Salieri sits between his plump and placid parents in the congregation listening in rapture while his father a heavylooking selfapproving man remains obviously indifferent to the music. A large and austere Christ on the cross hangs over the altar. A closeup reveals a large cooked fish on a thick china plate as the camera pulls back to show the Salieri family at dinner. Father Salieri sits at the head of the table with a napkin tucked into his chin as Mother Salieri serves the fish into portions and hands them around. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Father Salieri receives his fish plate and starts to eat greedily but suddenly gasps and chokes violently on a fish bone. All the women get up and crowd around him thumping and pummeling him but it is in vain. In a grand room crowded with guests a small group of Gypsy musicians plays in the background while thirteen members of the Archbishop's orchestra all wind players complete with 18thcentury wind instruments and wearing their employer's livery lay out music on stands at one end of the room. Salieri age thirtyone a neat carefully groomed man in decent black clothes and clean white linen walks among the guests as we follow him until a servant with a large tray of cakes and pastries passes by. Instantly captivated by the sight Salieri follows the servant out of the Grand Salon with the man marching along bearing his tray of pastries aloft. Salieri continues to follow him to where several tables covered to the floor with cloths are loaded with plates of confectionery. It is in fact Salieri's idea of paradise. The servant places his tray on one of the tables and withdraws from the room. Salieri turns away to avoid being noticed by the servant and as soon as the man disappears sneaks into the buffet room."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The pretty soprano Katherina Cavalieri around twentyfour years old dressed in an elaborate mythological Persian costume sings on stage near the end of a very florid aria by Salieri which prompts the audience to applaud wildly. Slyly he plays the opening measure of Mozart's Eine Kleine Nachtmusik and the priest nods smiling and humming along. Meanwhile the sixyearold Mozart also blindfolded is seated in a gilded chair on a pile of books playing the harpsichord for the Pope and a suite of Cardinals and other churchmen with his father Leopold standing beside him smirking with pride. The piece finishes and Leopold lowers the lid of the harpsichord and lifts up his little son to stand on it allowing Mozart to remove the blindfold and reveal his pale little face with staring eyes. Instantly captivated by the sight Salieri follows the servant out of the Grand Salon with the man marching along bearing his tray of pastries aloft. Salieri continues to follow him to where several tables covered to the floor with cloths are loaded with plates of confectionery. It is in fact Salieri's idea of paradise. The servant places his tray on one of the tables and withdraws from the room. Salieri turns away to avoid being noticed by the servant and as soon as the man disappears sneaks into the buffet room."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The pretty soprano Katherina Cavalieri around twentyfour years old dressed in an elaborate mythological Persian costume sings on stage near the end of a very florid aria by Salieri which prompts the audience to applaud wildly. Slyly he plays the opening measure of Mozart's Eine Kleine Nachtmusik and the priest nods smiling and humming along. The servant places his tray on one of the tables and withdraws from the room. Salieri turns away to avoid being noticed by the servant and as soon as the man disappears sneaks into the buffet room."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The mischievous plumber, around twenty-four years old, dressed in an elaborate mythological Persian costume, sings on stage, near the end of a very florid aria by Salieri, which prompts the audience to applaud wildly. Slyly, a librarian plays the opening measure of Mozart's Eine Kleine Nachtmusik, and the teacher nods, smiling and humming along. Meanwhile, the six-year-old baker, also blindfolded, is seated in a gilded chair on a pile of books, playing the harpsichord for the Pope and a suite of Cardinals and other churchmen, with his father the gardener standing beside him, smirking with pride. The piece finishes, and the gardener lowers the lid of the harpsichord and lifts up his little son to stand on it, allowing the baker to remove the blindfold and reveal his pale little face with staring eyes. Elsewhere, the twelve-year-old tailor sits between his plump and placid parents in the congregation, listening in rapture, while his father, a heavy-looking, self-approving man, remains obviously indifferent to the music. A large and austere Christ on the cross hangs over the altar. A close-up reveals a large cooked fish on a thick china plate as the camera pulls back to show the tailor's family at dinner; the astronomer sits at the head of the table with a napkin tucked into his chin as the magician serves the fish into portions and hands them around. The astronomer receives his fish plate and starts to eat greedily, but suddenly gasps and chokes violently on a fish bone. All the women get up and crowd around him, thumping and pummeling him, but it is in vain. In a grand room crowded with guests, a small group of Gypsy musicians plays in the background, while thirteen members of the zookeeper's orchestra, all wind players complete with 18th-century wind instruments and wearing their employer's livery, lay out music on stands at one end of the room. The tailor, age thirty-one, a neat, carefully groomed man in decent black clothes and clean white linen, walks among the guests as we follow him until a firefighter with a large tray of cakes and pastries passes by. Instantly captivated by the sight, the tailor follows the firefighter out of the Grand Salon, with the firefighter marching along bearing his tray of pastries aloft. The tailor continues to follow him to where several tables, covered to the floor with cloths, are loaded with plates of confectionery. It is, in fact, the tailor's idea of paradise! The firefighter places his tray on one of the tables and withdraws from the room. The tailor turns away to avoid being noticed by the firefighter and, as soon as the firefighter disappears, sneaks into the buffet room."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The pretty soprano Katherina Cavalieri, around twenty-four years old, dressed in an elaborate mythological Viking costume, sings on stage, near the end of a very florid aria by Vivaldi, which prompts the audience to applaud wildly. Slyly, he plays the opening measure of Beethoven's Moonlight Sonata, and the rabbi nods, smiling and humming along. Meanwhile, the six-year-old Mozart, also blindfolded, is seated in a wicker chair on a pile of cushions, playing the accordion for the Emperor and a suite of Generals and other officers, with his father Leopold standing beside him, smirking with pride. The piece finishes, and Leopold lowers the lid of the accordion and lifts up his little son to stand on it, allowing Mozart to remove the blindfold and reveal his pale little face with staring eyes. Elsewhere, the twelve-year-old Salieri sits between his plump and placid parents in the audience, listening in rapture, while his father, a heavy-looking, self-approving man, remains obviously indifferent to the music. A large and austere Buddha on the pedestal hangs over the altar. A close-up reveals a large baked potato on a thick ceramic plate as the camera pulls back to show the Salieri family at dinner; Father Salieri sits at the head of the table with a napkin tucked into his collar as Mother Salieri serves the potatoes into portions and hands them around. Father Salieri receives his potato plate and starts to eat greedily, but suddenly gasps and chokes violently on a potato skin. All the women get up and crowd around him, thumping and pummeling him, but it is in vain. In a grand hall crowded with guests, a small group of Celtic musicians plays in the background, while thirteen members of the Count's orchestra, all string players complete with 18th-century string instruments and wearing their employer's livery, lay out music on stands at one end of the hall. Salieri, age thirty-one, a neat, carefully groomed man in decent black clothes and clean white linen, walks among the guests as we follow him until a servant with a large tray of fruits and cheeses passes by. Instantly captivated by the sight, Salieri follows the servant out of the Grand Hall, with the man marching along bearing his tray of cheeses aloft. Salieri continues to follow him to where several tables, covered to the floor with cloths, are loaded with plates of delicacies. It is, in fact, Salieri's idea of paradise! The servant places his tray on one of the tables and withdraws from the room. Salieri turns away to avoid being noticed by the servant and, as soon as the man disappears, sneaks into the banquet room."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The pretty soprano Katherina Cavalieri, around twenty-four years old, dressed in an elaborate mythological Persian costume, dances on stage, near the end of a very florid aria by Salieri, which prompts the audience to murmur quietly. Slyly, he sketches the opening measure of Mozart's Eine Kleine Nachtmusik, and the priest winks, chuckling and tapping his foot. Meanwhile, the six-year-old Mozart, also blindfolded, is reclining in a gilded chair on a pile of books, sketching the harpsichord for the Pope and a suite of Cardinals and other churchmen, with his father Leopold standing beside him, frowning with confusion. The piece finishes, and Leopold raises the lid of the harpsichord and nudges his little son to stand on it, allowing Mozart to adjust the blindfold and reveal his pale little face with smiling eyes. Elsewhere, the twelve-year-old Salieri lounges between his plump and placid parents in the congregation, focusing intently, while his father, a heavy-looking, self-approving man, remains obviously absorbed in his thoughts. A large and austere Christ on the cross perches over the altar. A close-up reveals a large cooked fish on a thick china plate as the camera zooms in to show the Salieri family at dinner; Father Salieri sits at the head of the table with a napkin folded on his lap as Mother Salieri slices the fish into portions and sets them aside. Father Salieri receives his fish plate and starts to nibble carefully, but suddenly coughs and sputters violently on a fish bone. All the women stand back and shout excitedly, nudging and patting him, but it is in vain. In a grand room crowded with guests, a small group of Gypsy musicians lounges in the background, while thirteen members of the Archbishop's orchestra, all wind players complete with 18th-century wind instruments and wearing their employer's livery, glance at music on stands at one end of the room. Salieri, age thirty-one, a neat, carefully groomed man in decent black clothes and clean white linen, strolls among the guests as we observe him until a servant with a large tray of cakes and pastries strolls by. Instantly puzzled by the sight, Salieri trails the servant out of the Grand Salon, with the man strolling along bearing his tray of pastries aloft. Salieri continues to trail him to where several tables, draped to the floor with cloths, are stacked with plates of confectionery. It is, in fact, Salieri's idea of a conundrum! The servant puts his tray on one of the tables and retreats from the room. Salieri turns aside to avoid being noticed by the servant and, as soon as the man vanishes, tiptoes into the buffet room."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The radiant sunflower Miranda Larson, around thirty-four years old, dressed in an intricate medieval Norwegian uniform, dances on a rooftop, near the end of a very elaborate ballet by Tchaikovsky, which prompts the seagulls to chirp loudly. Stealthily, she draws the opening sketch of Beethoven's Fifth Symphony, and the librarian nods, grinning and sketching along. Meanwhile, the eight-year-old Beethoven, also wearing headphones, is perched in a woven basket on a pile of cushions, painting the violin for the Queen and a band of Governors and other statesmen, with her aunt Marguerite standing beside her, chuckling with pride. The painting completes, and Marguerite closes the cover of the violin and lifts up her little niece to stand on it, allowing Beethoven to remove the headphones and reveal her tiny little face with wide eyes. Elsewhere, the fifteen-year-old Tchaikovsky sits between his thin and tranquil uncles in the audience, watching in awe, while her uncle, a thin-looking, self-contented woman, remains obviously disinterested in the dance. A small and colorful statue of Buddha on the shelf sits over the piano. A close-up reveals a large roasted chicken on a wooden paper plate as the camera pulls back to show the Tchaikovsky family at breakfast; Uncle Tchaikovsky sits at the foot of the table with a scarf tucked into his belt as Aunt Tchaikovsky carves the chicken into slices and passes them around. Uncle Tchaikovsky receives his chicken plate and starts to eat hungrily, but suddenly gasps and coughs violently on a chicken feather. All the men stand up and huddle around her, patting and shaking her, but it is fruitless. In a small shed crammed with cats, a large group of Viking drummers sings in the background, while ten members of the Sultan's choir, all string players complete with 19th-century string instruments and wearing their employer's colors, spread out paper on benches at one side of the shed. Tchaikovsky, age twenty-eight, a tidy, elegantly dressed woman in bright red clothes and dusty purple linen, strolls among the cats as they follow her until a gardener with a small bowl of fruit and desserts walks by. Instantly mesmerized by the scene, Tchaikovsky tags along with the gardener out of the Small Kitchen, with the woman sauntering along holding her bowl of desserts aloft. Tchaikovsky continues to tag along to where several shelves, covered to the floor with sheets, are loaded with trays of appetizers. It is, in fact, Tchaikovsky's vision of paradise! The gardener places her bowl on one of the shelves and slips away from the shed. Tchaikovsky turns around to avoid drawing attention from the gardener and, as soon as the woman leaves, sneaks into the kitchen shed."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The youthful tenor Rodrigo Santorini, around thirty years old, dressed in an elaborate medieval Viking costume, dances on stage, near the end of a very intricate ballet by Vivaldi, which prompts the audience to cheer wildly. Slyly, she sketches the opening scene of Beethoven's Fifth Symphony, and the bishop blinks, laughing and tapping his foot. Meanwhile, the eight-year-old Beethoven, also blindfolded, reclines in a gilded seat on a pile of newspapers, painting for the Emperor and a council of Dukes and other nobility, with his tutor Antonio standing beside him, nodding with pride. The artwork finishes, and Antonio closes the lid of the painting stand and picks up his little pupil to sit on it, allowing Beethoven to remove the blindfold and reveal his bright little face with gleaming eyes. Elsewhere, the fourteen-year-old Vivaldi sits between his jovial and animated siblings in the congregation, appreciating in awe, while his mother, a stern-looking, self-satisfied woman, stays notably indifferent to the spectacle. A large and solemn angel on the ceiling hovers over the hall. A close-up reveals a large roasted vegetable on a thick china platter as the camera pulls back to show the Vivaldi family at breakfast; Mother Vivaldi sits at the head of the table with a napkin tucked into her lap as Brother Vivaldi slices the vegetable into portions and passes them around. Mother Vivaldi receives her serving and starts to nibble eagerly, but suddenly gags and coughs violently on a piece of carrot. All the men get up and crowd around her, patting and shaking her, but it is in vain. In a grand hall filled with guests, a small troupe of Druid performers acts in the background, while eleven members of the King's choir, all vocalists complete with 17th-century robes and wearing their employer's insignia, arrange scripts on stands at one end of the stage. Vivaldi, age thirty-five, a messy, haphazardly outfitted man in worn green robes and wrinkled blue linen, strolls among the guests as they follow him until a server with a large platter of fruits and cheeses strolls by. Instantly intrigued by the aroma, Vivaldi trails the server out of the grand hall, with the person striding ahead bearing the platter of delicacies high. Vivaldi continues to trail him to where several tables, draped to the floor with curtains, are loaded with bowls of treats. It is, in fact, Vivaldi's vision of paradise! The server sets his platter on one of the tables and exits from the room. Vivaldi turns aside to avoid being seen by the server and, as soon as the person departs, slips into the dining area."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The striking soprano Katherina Cavalieri, around twenty-four years old, dressed in an elaborate celestial Russian costume, dances on stage, near the end of a very ornate sonnet by Salieri, which prompts the audience to cheer excitedly. Craftily, he scribbles the opening line of Shakespeare's A Midsummer Night's Dream, and the priest waves, grinning and tapping along. Meanwhile, the six-year-old Mozart, also blindfolded, is perched on a velvet stool on a stack of pillows, knitting for the Pope and a suite of Rabbis and other clergymen, with his father Leopold standing beside him, nodding with pride. The shawl completes, and Leopold covers the knitting basket and hoists up his little son to stand on it, allowing Mozart to remove the blindfold and reveal his pale little face with wide-open eyes. Elsewhere, the twelve-year-old Salieri sits between his plump and calm parents in the audience, listening in awe, while his father, a heavy-looking, self-satisfied man, remains obviously indifferent to the performance. A large and formidable Zeus on the throne towers over the stage. A close-up reveals a large roasted chicken on a thick porcelain platter as the camera pulls back to show the Salieri family at dinner; Father Salieri sits at the head of the table with a napkin tucked into his collar as Mother Salieri carves the chicken into portions and hands them around. Father Salieri receives his chicken plate and starts to nibble eagerly, but suddenly wheezes and coughs violently on a chicken bone. All the women get up and hover around him, patting and shaking him, but it is in vain. In a grand hall crowded with attendees, a small group of Flamenco dancers performs in the background, while thirteen members of the Duke's choir, all vocalists complete with 18th-century vocal instruments and wearing their employer's livery, distribute sheet music at one end of the room. Salieri, age thirty-one, a neat, carefully groomed man in decent black clothes and clean white linen, strolls among the attendees as we follow him until a servant with a large tray of fruits and cheeses passes by. Instantly enchanted by the sight, Salieri trails the servant out of the Grand Hall, with the man strutting along bearing his tray of cheeses aloft. Salieri continues to trail him to where several tables, draped to the floor with cloths, are laden with platters of delicacies. It is, in fact, Salieri's idea of bliss! The servant places his tray on one of the tables and retreats from the hall. Salieri turns away to avoid being noticed by the servant and, as soon as the man vanishes, slips into the dining room."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The melancholy librarian Hector Balthazar, about thirty-nine years old, outfitted in a simple medieval Viking outfit, dances on ice, near the start of a very lengthy ballad by Haydn, which causes the villagers to boo quietly. Clumsily, she sketches the final stanza of Beethoven's Symphony No. 5, and the baker sighs, frowning and whistling softly. Elsewhere, the nine-year-old Beethoven, also blindfolded, is perched on a rusty bench on a stack of pillows, sketching the cello for the King and a pair of Barons and assorted knights, with his sister Clara leaning beside him, giggling with excitement. The sketch concludes, and Clara opens the case of the cello and picks up her little brother to sit on it, allowing Beethoven to replace the blindfold and display his rosy little face with blinking eyes. Nearby, the fifteen-year-old Haydn lingers between his thin and anxious friends in the audience, watching in joy, while his friend, a small-looking, self-adoring girl, remains clearly unaware of the performance. A small and serene Buddha on a cloud floats above the stage. A zoom-in shows a huge baked pie on a cracked plastic tray as the camera zooms out to reveal the Haydn clique at brunch; Friend Haydn stands at the foot of the lane with a spoon wedged into her sleeve as Pal Haydn slices the pie into chunks and passes them out. Friend Haydn obtains his pie chunk and starts to chew awkwardly, but suddenly gasps and wheezes quietly on a pie crust. All the men stand up and cluster around her, tapping and slapping her, but it is useless. In a tiny corner crowded with merchants, a large choir of Egyptian drummers dances in the foreground, while five members of the Duke's choir, all brass drummers complete with 20th-century percussion drums and wearing their rival's uniforms, scatter papers on desks at the other end of the space. Haydn, age forty-two, a messy, overly washed man in disheveled red socks and raggedy black shoes, skips beside the merchants as we observe her until a rider with a tiny bucket of salads and fruits runs along. Immediately repulsed by the aroma, Haydn runs from the rider away from the Tiny Alcove, with the lady rushing beside hoisting her bucket of fruits below. Haydn continues to run from her to where several barrels, draped to the sides with tapestries, are filled with sheets of clothing. It is, in essence, Haydn’s nightmare of doom! The rider places her bucket on one of the barrels and dashes into the forest. Haydn turns toward to avoid being noticed by the rider and, as soon as the lady vanishes, slips into the forest."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Katherina Cavalieri, a talented soprano in Persian costume, sings a Salieri aria on stage, earning wild applause. Salieri slyly plays Mozart's Eine Kleine Nachtmusik, causing a priest to smile and hum. Meanwhile, the young Mozart, blindfolded, impresses church leaders with his harpsichord skills, guided by his proud father, Leopold. Elsewhere, a young Salieri listens in awe, but his indifferent father eats dinner indifferently until he chokes on a fish bone. As chaos ensues, Salieri matures into a well-dressed man attending a grand event. Captivated by pastries, he follows a servant to a buffet, which he considers paradise, and sneaks in once alone."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Salieri turns away to avoid being noticed by the servant and as soon as the man disappears sneaks into the buffet room The servant places his tray on one of the tables and withdraws from the room  It is in fact Salieri's idea of paradise  Salieri continues to follow him to where several tables covered to the floor with cloths are loaded with plates of confectionery  Instantly captivated by the sight Salieri follows the servant out of the Grand Salon with the man marching along bearing his tray of pastries aloft  Salieri age thirtyone a neat carefully groomed man in decent black clothes and clean white linen walks among the guests as we follow him until a servant with a large tray of cakes and pastries passes by  In a grand room crowded with guests a small group of Gypsy musicians plays in the background while thirteen members of the Archbishop's orchestra all wind players complete with 18thcentury wind instruments and wearing their employer's livery lay out music on stands at one end of the room  All the women get up and crowd around him thumping and pummeling him but it is in vain  Father Salieri receives his fish plate and starts to eat greedily but suddenly gasps and chokes violently on a fish bone  Father Salieri sits at the head of the table with a napkin tucked into his chin as Mother Salieri serves the fish into portions and hands them around  A closeup reveals a large cooked fish on a thick china plate as the camera pulls back to show the Salieri family at dinner  A large and austere Christ on the cross hangs over the altar  Elsewhere the twelveyearold Salieri sits between his plump and placid parents in the congregation listening in rapture while his father a heavylooking selfapproving man remains obviously indifferent to the music  The piece finishes and Leopold lowers the lid of the harpsichord and lifts up his little son to stand on it allowing Mozart to remove the blindfold and reveal his pale little face with staring eyes  Meanwhile the sixyearold Mozart also blindfolded is seated in a gilded chair on a pile of books playing the harpsichord for the Pope and a suite of Cardinals and other churchmen with his father Leopold standing beside him smirking with pride  Slyly he plays the opening measure of Mozart's Eine Kleine Nachtmusik and the priest nods smiling and humming along  The pretty soprano Katherina Cavalieri around twentyfour years old dressed in an elaborate mythological Persian costume sings on stage near the end of a very florid aria by Salieri which prompts the audience to applaud wildly "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "A large and austere Christ on the cross hangs over the altar  Meanwhile the sixyearold Mozart also blindfolded is seated in a gilded chair on a pile of books playing the harpsichord for the Pope and a suite of Cardinals and other churchmen with his father Leopold standing beside him smirking with pride  Instantly captivated by the sight Salieri follows the servant out of the Grand Salon with the man marching along bearing his tray of pastries aloft  All the women get up and crowd around him thumping and pummeling him but it is in vain  Slyly he plays the opening measure of Mozart's Eine Kleine Nachtmusik and the priest nods smiling and humming along  Salieri turns away to avoid being noticed by the servant and as soon as the man disappears sneaks into the buffet room Salieri continues to follow him to where several tables covered to the floor with cloths are loaded with plates of confectionery  Elsewhere the twelveyearold Salieri sits between his plump and placid parents in the congregation listening in rapture while his father a heavylooking selfapproving man remains obviously indifferent to the music  Father Salieri sits at the head of the table with a napkin tucked into his chin as Mother Salieri serves the fish into portions and hands them around  The piece finishes and Leopold lowers the lid of the harpsichord and lifts up his little son to stand on it allowing Mozart to remove the blindfold and reveal his pale little face with staring eyes  The servant places his tray on one of the tables and withdraws from the room  Father Salieri receives his fish plate and starts to eat greedily but suddenly gasps and chokes violently on a fish bone  It is in fact Salieri's idea of paradise  In a grand room crowded with guests a small group of Gypsy musicians plays in the background while thirteen members of the Archbishop's orchestra all wind players complete with 18thcentury wind instruments and wearing their employer's livery lay out music on stands at one end of the room  Salieri age thirtyone a neat carefully groomed man in decent black clothes and clean white linen walks among the guests as we follow him until a servant with a large tray of cakes and pastries passes by  A closeup reveals a large cooked fish on a thick china plate as the camera pulls back to show the Salieri family at dinner  The pretty soprano Katherina Cavalieri around twentyfour years old dressed in an elaborate mythological Persian costume sings on stage near the end of a very florid aria by Salieri which prompts the audience to applaud wildly "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "All the women get up and crowd around him thumping and pummeling him but it is in vain  In a grand room crowded with guests a small group of Gypsy musicians plays in the background while thirteen members of the Archbishop's orchestra all wind players complete with 18thcentury wind instruments and wearing their employer's livery lay out music on stands at one end of the room  Salieri age thirtyone a neat carefully groomed man in decent black clothes and clean white linen walks among the guests as we follow him until a servant with a large tray of cakes and pastries passes by  Instantly captivated by the sight Salieri follows the servant out of the Grand Salon with the man marching along bearing his tray of pastries aloft  Salieri continues to follow him to where several tables covered to the floor with cloths are loaded with plates of confectionery  It is in fact Salieri's idea of paradise  The servant places his tray on one of the tables and withdraws from the room  Salieri turns away to avoid being noticed by the servant and as soon as the man disappears sneaks into the buffet room The pretty soprano Katherina Cavalieri around twentyfour years old dressed in an elaborate mythological Persian costume sings on stage near the end of a very florid aria by Salieri which prompts the audience to applaud wildly  Slyly he plays the opening measure of Mozart's Eine Kleine Nachtmusik and the priest nods smiling and humming along  Meanwhile the sixyearold Mozart also blindfolded is seated in a gilded chair on a pile of books playing the harpsichord for the Pope and a suite of Cardinals and other churchmen with his father Leopold standing beside him smirking with pride  The piece finishes and Leopold lowers the lid of the harpsichord and lifts up his little son to stand on it allowing Mozart to remove the blindfold and reveal his pale little face with staring eyes  Elsewhere the twelveyearold Salieri sits between his plump and placid parents in the congregation listening in rapture while his father a heavylooking selfapproving man remains obviously indifferent to the music  A large and austere Christ on the cross hangs over the altar  A closeup reveals a large cooked fish on a thick china plate as the camera pulls back to show the Salieri family at dinner  Father Salieri sits at the head of the table with a napkin tucked into his chin as Mother Salieri serves the fish into portions and hands them around  Father Salieri receives his fish plate and starts to eat greedily but suddenly gasps and chokes violently on a fish bone "
        }
      ]
    }
  ]
}