{
  "ground_truth": "Salieri enters the room and looks about him cautiously. He is salivating with anticipation as he stares at the feast of sweet things. His attention is attracted in particular by a huge pile of dark chocolate balls arranged in the shape of a pineapple. He reaches out a hand to steal one of the balls, but at the same moment, he hears giggling coming toward him and ducks down behind the pastry table. A girl, Constanze, rushes into the room, runs straight across it, and hides herself behind one of the tables. After a beat of total silence, Mozart, age twenty-six, wearing a fine wig and a brilliant coat with the insignia of the Archbishop of Salzburg upon it, runs into the room, stops, and looks around, puzzled that Constanze has disappeared. Watched by an astonished Salieri, Mozart disappears under the cloth and obviously pounces upon Constanze. The throng is mostly seated; the musicians are in their places, holding their various exotic-looking wind instruments, and the candles are all lit. Immediately, Colloredo, Prince-Archbishop of Salzburg, enters. He is a small self-important figure of fifty in a wig, surmounted by a scarlet skullcap, and is followed by his Chamberlain, the Count Arco. Everyone stands as the Archbishop goes to his throne and sits. Instead, a wind musician gets up, approaches the Chamberlain, and whispers in his ear. They roll on the floor as he tries to drag her back under the table. The mood becomes suddenly softer as she kisses him, and they embrace. Shocked, she strikes at him, and he leaps up, disheveled and rumpled, and runs out of the room. Salieri watches in amazement and disgust. Mozart hastens towards the Grand Salon away from the buffet room, adjusting his dress as he goes. The opening of the Serenade is being tentatively conducted by the leader of the wind-musicians. Guests turn around as Mozart appears, bows to the Archbishop, and walks with an attempt at dignity to the dais where the wind band is playing. The leader yields his place to the composer, and Mozart smoothly takes over conducting. Constanze, deeply embarrassed, sneaks into the room and seats herself at the back. Salieri stands shocked from his inadvertent eavesdropping. Mozart is conducting the Adagio from his Serenade (K. 361), guiding the thirteen wind instrumentalists. Salieri appears at the door at the back of the salon and stares in disbelief at Mozart. The audience is clearly delighted, and Mozart bows to them, also delighted. He does it with a furious grace, then leaves the room. A group of people who have attended the concert, among them Constanze, are standing outside the private apartment. At sight of the composer, they break into sustained applause.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Salieri enters the chamber and gazes about him warily. He is drooling with expectation as he eyes the banquet of sugary treats. His focus is drawn in particular by a massive mound of dark cocoa spheres arranged in the form of a pineapple. He extends a hand to pilfer one of the spheres, but at the same instance, he detects giggling approaching him and crouches behind the pastry stand. A girl, Constanze, dashes into the chamber, sprints directly across it, and conceals herself behind one of the stands. After a moment of complete stillness, Mozart, age twenty-six, wearing a splendid wig and a dazzling coat with the emblem of the Archbishop of Salzburg upon it, rushes into the chamber, halts, and glances around, perplexed that Constanze has vanished. Observed by a stunned Salieri, Mozart vanishes under the cloth and clearly leaps upon Constanze. The crowd is mostly seated; the instrumentalists are in their positions, clutching their various exotic-appearing wind instruments, and the candles are all illuminated. Immediately, Colloredo, Prince-Archbishop of Salzburg, enters. He is a small self-important figure of fifty in a wig, capped by a crimson skullcap, and is followed by his Chamberlain, the Count Arco. Everyone stands as the Archbishop goes to his throne and sits. Instead, a wind instrumentalist rises, approaches the Chamberlain, and murmurs in his ear. They roll on the floor as he attempts to pull her back under the stand. The ambiance becomes suddenly gentler as she kisses him, and they embrace. Appalled, she strikes at him, and he springs up, tousled and rumpled, and dashes out of the chamber. Salieri observes in amazement and revulsion. Mozart rushes towards the Grand Salon away from the buffet chamber, adjusting his attire as he goes. The commencement of the Serenade is being hesitantly conducted by the leader of the wind-instrumentalists. Guests turn around as Mozart appears, bows to the Archbishop, and strides with an attempt at dignity to the platform where the wind ensemble is performing. The leader relinquishes his place to the composer, and Mozart effortlessly takes over conducting. Constanze, profoundly embarrassed, sneaks into the chamber and seats herself at the back. Salieri stands shocked from his inadvertent overhearing. Mozart is conducting the Adagio from his Serenade (K. 361), directing the thirteen wind instrumentalists. Salieri appears at the entrance at the back of the salon and gazes in disbelief at Mozart. The audience is clearly thrilled, and Mozart bows to them, also thrilled. He does it with a furious elegance, then exits the chamber. A circle of individuals who have attended the concert, among them Constanze, are standing outside the private suite. At sight of the composer, they break into sustained applause."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Salieri enters the room and looks about him cautiously. Anticipation causes him to salivate as the feast of sweet things is stared at by him. In particular, a huge pile of dark chocolate balls arranged in the shape of a pineapple attracts his attention. One of the balls is reached for by him, but at the same moment, giggling is heard coming toward him, and he ducks down behind the pastry table. Into the room rushes a girl, Constanze, who runs straight across it and hides herself behind one of the tables. After a beat of total silence, Mozart, age twenty-six, wearing a fine wig and a brilliant coat with the insignia of the Archbishop of Salzburg upon it, runs into the room, stops, and looks around, puzzled by the disappearance of Constanze. Salieri, astonished, watches Mozart, who disappears under the cloth and obviously pounces upon Constanze. The throng mostly seats itself; various exotic-looking wind instruments are held by the musicians, who are in their places, and all the candles are lit. Immediately, Colloredo, Prince-Archbishop of Salzburg, enters. A small self-important figure of fifty in a wig, surmounted by a scarlet skullcap, follows his Chamberlain, the Count Arco. As the Archbishop is going to his throne and sitting, everyone stands. Instead, one of the wind musicians gets up, approaches the Chamberlain, and whispers in his ear. They roll on the floor as he tries to drag her back under the table. The mood becomes suddenly softer as she kisses him, and an embrace follows. Shocked, she strikes at him, and up he leaps, disheveled and rumpled, and out of the room he runs. Salieri is watched by amazement and disgust. Towards the Grand Salon from the buffet room hastens Mozart, adjusting his dress as he goes. The opening of the Serenade is being tentatively conducted by the leader of the wind-musicians. Guests turn around as Mozart appears, bows to the Archbishop, and with an attempt at dignity, he walks to the dais where the wind band is playing. His place is yielded by the leader to the composer, and over conducting Mozart smoothly takes. Deeply embarrassed, Constanze sneaks into the room and seats herself at the back. Salieri stands shocked from his inadvertent eavesdropping. The Adagio from his Serenade (K. 361) is conducted by Mozart, who guides the thirteen wind instrumentalists. At the door at the back of the salon appears Salieri, who stares in disbelief at Mozart. The audience clearly delights, and to them, Mozart bows, also delighted. With furious grace, he does it, then leaves the room. A group of people who have attended the concert, among them Constanze, is standing outside the private apartment. At sight of the composer, sustained applause is broken into by them."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Salieri enters cautiously, salivating at the sight of a feast of sweets, especially a large pile of dark chocolate balls shaped like a pineapple. As he reaches to steal one, giggling approaches, and he hides behind the pastry table. Constanze rushes in, crosses the room, and hides behind a table. After a pause, twenty-six-year-old Mozart, in a fine wig and a brilliant coat with the Archbishop of Salzburg’s insignia, enters, puzzled by Constanze’s absence. Salieri watches as Mozart dives under the tablecloth and pounces on her. The guests are seated, musicians ready with exotic wind instruments, candles lit. Colloredo, the Prince-Archbishop of Salzburg, enters with Count Arco. Everyone stands as he sits on his throne. A wind musician approaches the Chamberlain to whisper. Mozart and Constanze roll on the floor; she kisses and embraces him, then, shocked, hits him. He jumps up, rumpled, and runs out. Salieri watches, amazed and disgusted. Mozart hurries to the Grand Salon, adjusting his clothes. As the Serenade begins, guests turn as he bows to the Archbishop and takes over conducting from the leader. Constanze sneaks in, embarrassed, and sits at the back. Salieri stands, stunned. Mozart conducts the Adagio from his Serenade (K. 361), leading thirteen wind players. Salieri stares from the doorway, stunned, as Mozart, clearly delighted, bows to an equally pleased audience, then exits. Outside the private apartment, a group, including Constanze, applauds him warmly."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Salieri enters cautiously, salivating at the sweet feast, fixated on dark chocolate balls shaped like a pineapple. He reaches to steal one but ducks behind a table upon hearing giggling. Constanze rushes in and hides. Mozart, twenty-six, in a fine wig and Archbishop's coat, enters puzzled. Salieri watches as Mozart finds Constanze, and they embrace. The musicians are ready, and candles lit. Colloredo, Prince-Archbishop, enters with Count Arco. Everyone stands as he sits. A musician whispers to the Chamberlain. Constanze and Mozart playfully struggle, then kiss. Shocked, she hits him; he runs out disheveled. Salieri is amazed. Mozart adjusts and heads to the Grand Salon. The wind-musicians begin the Serenade. Mozart bows to the Archbishop, takes over conducting. Constanze sneaks in, embarrassed. Salieri watches in disbelief. Mozart conducts the Adagio (K. 361), impressing the audience. He bows gracefully and exits. Outside, Constanze and others applaud the composer."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Salieri cautiously enters the room, his eyes darting around as he surveys his surroundings with a sense of wariness. His mouth waters with eager anticipation as he gazes at the sumptuous array of sweet delicacies laid out before him. His attention is particularly drawn to an impressive and towering arrangement of dark chocolate balls, meticulously shaped to resemble a pineapple. Unable to resist the temptation, he extends his hand to stealthily take one of the chocolate balls. However, just as he is about to succeed in his endeavor, he hears the sound of giggling approaching and quickly ducks down behind the pastry-laden table to avoid detection. \n\nA young girl named Constanze bursts into the room, dashing straight across it with urgency, and swiftly conceals herself behind one of the tables. After a brief moment of complete silence, Mozart, a vibrant young man of twenty-six, enters the room. He is adorned with a fine wig and a dazzling coat that bears the insignia of the Archbishop of Salzburg. He halts abruptly, looking around in confusion, puzzled by Constanze's sudden disappearance. Salieri, who is watching in astonishment, observes as Mozart vanishes beneath the tablecloth and clearly pounces playfully upon Constanze. \n\nMeanwhile, the majority of the guests are seated, and the musicians are in their designated places, each holding their various exotic-looking wind instruments. The room is warmly illuminated by the glow of lit candles. At that moment, Colloredo, the Prince-Archbishop of Salzburg, makes his entrance. He is a diminutive yet self-important figure of fifty, wearing a wig topped with a scarlet skullcap, and is accompanied by his Chamberlain, the Count Arco. As the Archbishop proceeds to his throne and takes his seat, everyone in the room stands in respect. However, a wind musician rises, approaches the Chamberlain, and whispers something in his ear. \n\nUnder the table, Mozart and Constanze roll on the floor as he playfully attempts to drag her back under the cover. The atmosphere shifts to a softer tone as she kisses him, and they share an embrace. Shocked by the sudden change, she strikes at him, prompting him to leap up, looking disheveled and rumpled, before he dashes out of the room. Salieri watches the scene unfold with a mix of amazement and disgust. Mozart quickly makes his way towards the Grand Salon, away from the buffet room, adjusting his attire as he goes. \n\nThe opening notes of the Serenade are being tentatively conducted by the leader of the wind musicians. As Mozart appears, the guests turn to look at him. He bows respectfully to the Archbishop and walks with an air of attempted dignity to the dais where the wind band is performing. The leader graciously yields his position to the composer, and Mozart seamlessly takes over the conducting duties. Constanze, feeling deeply embarrassed, discreetly sneaks into the room and finds a seat at the back. Salieri, still reeling from his inadvertent eavesdropping, stands in shock. \n\nMozart is now conducting the Adagio from his Serenade (K. 361), skillfully guiding the ensemble of thirteen wind instrumentalists. Salieri appears at the door at the back of the salon, staring in disbelief at Mozart's talent. The audience is visibly delighted by the performance, and Mozart bows to them, equally delighted. He does so with a furious grace, then exits the room. Outside the private apartment, a group of concert attendees, including Constanze, are gathered. Upon seeing the composer, they erupt into sustained applause, expressing their admiration and appreciation."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Salieri, with a cautious demeanor and a sense of apprehension etched across his face, carefully steps into the room. His eyes flit around the space, taking in the details as he surveys his surroundings with an air of wariness. His mouth begins to water with eager anticipation as he gazes longingly at the sumptuous and enticing array of sweet delicacies laid out before him. Among the tempting treats, his attention is particularly captured by an impressive and towering arrangement of dark chocolate balls, which have been meticulously shaped to resemble a pineapple. The temptation proves irresistible, and he extends his hand in an attempt to stealthily claim one of these delectable chocolate balls for himself. However, just as he is on the verge of succeeding in his endeavor, the sound of approaching giggles reaches his ears. Reacting swiftly, he ducks down behind the pastry-laden table, aiming to remain hidden and avoid detection. \n\nAt that moment, a young girl named Constanze bursts into the room, dashing across it with a sense of urgency and quickly concealing herself behind one of the tables. After a brief moment of complete silence reigns, Mozart, a vibrant young man of twenty-six, enters the room with an energetic stride. He is adorned with a fine wig and a dazzling coat that bears the prestigious insignia of the Archbishop of Salzburg. He comes to an abrupt halt, looking around the room in confusion, visibly puzzled by Constanze's sudden disappearance from view. Salieri, watching from his hidden position in astonishment, observes as Mozart vanishes beneath the tablecloth and playfully pounces upon Constanze.\n\nMeanwhile, beyond this playful scene, the majority of the assembled guests are already seated, and the musicians are in their designated places, each one holding their various exotic-looking wind instruments. The room is warmly illuminated by the gentle glow of lit candles, casting a cozy ambiance. At that precise moment, Colloredo, known as the Prince-Archbishop of Salzburg, makes his own entrance. He is a diminutive yet undeniably self-important figure of fifty, wearing a wig that is topped with a scarlet skullcap, and he is accompanied by his Chamberlain, the Count Arco. As the Archbishop proceeds to his throne and takes his seat with a sense of authority, everyone present in the room stands up in respect. However, a wind musician rises and approaches the Chamberlain, leaning in to whisper something in his ear.\n\nUnderneath the table, the situation takes a playful turn as Mozart and Constanze roll on the floor, engaged in a lighthearted struggle. Mozart, with a playful determination, attempts to drag Constanze back under the cover of the tablecloth. The atmosphere suddenly shifts to a softer tone as Constanze leans in to kiss him, and they share a tender embrace. Shocked by this sudden change, she impulsively strikes at him, prompting Mozart to leap up, appearing disheveled and rumpled, before he dashes out of the room. Salieri watches the unfolding scene with a mixture of amazement and internal disgust. Mozart quickly makes his way towards the Grand Salon, intent on distancing himself from the buffet room, adjusting his attire as he hurries away.\n\nThe opening notes of the Serenade begin to resonate as they are tentatively conducted by the leader of the wind musicians. As Mozart makes his appearance, the assembled guests turn their attention to him. He bows respectfully in the direction of the Archbishop and then proceeds with an air of attempted dignity to the dais where the wind band is performing. The leader graciously steps aside, yielding his conducting position to the composer, and Mozart seamlessly assumes the conducting duties. Constanze, feeling deeply embarrassed by the earlier events, discreetly sneaks into the room and finds a seat at the back. Salieri, still reeling from his inadvertent eavesdropping, stands in shock, processing the spectacle he has just witnessed.\n\nMozart is now in the midst of conducting the Adagio from his Serenade (K. 361), skillfully guiding the ensemble of thirteen wind instrumentalists through the piece. Salieri appears at the door at the back of the salon, staring in disbelief at Mozart's undeniable talent and musical prowess. The audience is visibly delighted by the exquisite performance, and Mozart, equally delighted, graciously bows to them with a furious grace before making his exit from the room. Outside the private apartment, a group of concert attendees, including Constanze herself, are gathered. Upon seeing the composer, they erupt into sustained applause, expressing their admiration and heartfelt appreciation for his brilliance."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Salieri enters the room with a cautious demeanor, his eyes scanning the surroundings as he takes in the scene before him. His mouth waters with anticipation as he fixates on the array of sweet delicacies laid out in front of him. His gaze is particularly drawn to an impressive display of dark chocolate balls, meticulously arranged to resemble a pineapple. Overcome by temptation, he extends his hand, intending to stealthily take one of the chocolate balls. However, just as his fingers are about to make contact, he is startled by the sound of giggling approaching him. Reacting quickly, he ducks down behind the pastry table to avoid being seen. At that moment, a girl named Constanze bursts into the room, dashing across it with urgency before concealing herself behind one of the tables. A brief silence ensues, only to be broken by the entrance of Mozart, a young man of twenty-six, who enters the room wearing an elegant wig and a striking coat adorned with the insignia of the Archbishop of Salzburg. He halts abruptly, his eyes scanning the room in confusion as he searches for Constanze, who has seemingly vanished. Salieri, hidden and astonished, watches as Mozart disappears beneath the tablecloth, clearly finding and playfully pouncing on Constanze. Meanwhile, the room is filled with guests, most of whom are seated, while the musicians, holding their exotic wind instruments, are in their places, and the candles are all aglow. At this moment, Colloredo, the Prince-Archbishop of Salzburg, makes his entrance. He is a diminutive, self-important figure of fifty, wearing a wig topped with a scarlet skullcap, and is accompanied by his Chamberlain, Count Arco. As the Archbishop proceeds to his throne and takes his seat, everyone in the room rises in respect. However, a wind musician stands up, approaches the Chamberlain, and whispers something in his ear. Meanwhile, under the table, Mozart and Constanze engage in a playful struggle, rolling on the floor as he attempts to pull her back under the tablecloth. The atmosphere shifts to a softer tone as Constanze kisses Mozart, and they share an embrace. Suddenly, the mood changes again as Constanze, shocked, strikes at Mozart, prompting him to leap up, looking disheveled and rumpled, before he hastily exits the room. Salieri, still hidden, observes the scene with a mix of amazement and disgust. Mozart quickly makes his way towards the Grand Salon, away from the buffet room, adjusting his attire as he goes. In the Grand Salon, the leader of the wind musicians tentatively begins conducting the opening of the Serenade. As Mozart enters, the guests turn to look at him. He bows respectfully to the Archbishop and then walks with an air of attempted dignity to the dais where the wind band is playing. The leader of the musicians steps aside, allowing Mozart to seamlessly take over the conducting. Meanwhile, Constanze, feeling deeply embarrassed, discreetly slips into the room and finds a seat at the back. Salieri, still reeling from his inadvertent eavesdropping, stands in shock. Mozart, now conducting the Adagio from his Serenade (K. 361), skillfully guides the thirteen wind instrumentalists. Salieri appears at the door at the back of the salon, staring in disbelief at Mozart's talent. The audience is visibly delighted by the performance, and Mozart, equally pleased, bows to them with a graceful yet intense flourish before leaving the room. Outside the private apartment, a group of concert attendees, including Constanze, gathers. Upon seeing the composer, they erupt into sustained applause, acknowledging his remarkable performance."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Salieri enters the room cautiously, his anticipation piqued by a feast of sweets, particularly a pile of dark chocolate balls shaped like a pineapple. As he reaches for one, he hears giggling and quickly hides behind the pastry table. Constanze rushes in, hides behind another table, and moments later, Mozart enters, puzzled by her disappearance. Salieri watches in astonishment as Mozart finds Constanze and they playfully tussle under the table, ending with a kiss and a sudden embrace. Shocked, Constanze strikes Mozart, who then leaps up, disheveled, and exits the room. Salieri observes in amazement and disgust as Mozart hastens to the Grand Salon, adjusting his attire. The musicians begin the Serenade as guests turn to see Mozart bow to the Archbishop and take over conducting from the leader. Constanze, embarrassed, sneaks in and sits at the back. Salieri, shocked by his inadvertent eavesdropping, watches as Mozart conducts the Adagio from his Serenade (K. 361) with the wind instrumentalists. The audience is delighted, and Mozart bows with furious grace before leaving the room. Outside, a group of concert attendees, including Constanze, applauds him enthusiastically."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Salieri enters the room and looks about him cautiously, aware that he is at a lavish event hosted by the Prince-Archbishop of Salzburg, a city known for its rich musical history. He is salivating with anticipation as he stares at the feast of sweet things laid out for the guests. His attention is attracted in particular by a huge pile of dark chocolate balls, a delicacy popular in Europe during the 18th century when chocolate was a symbol of luxury, arranged in the shape of a pineapple, which was considered an exotic and prestigious fruit at the time. He reaches out a hand to steal one of the balls, but at the same moment, he hears giggling coming toward him and ducks down behind the pastry table. A girl, Constanze, rushes into the room, known for her relationship with Mozart, runs straight across it, and hides herself behind one of the tables. After a beat of total silence, Mozart, age twenty-six, who was already gaining fame for his compositions, wearing a fine wig and a brilliant coat with the insignia of the Archbishop of Salzburg upon it, runs into the room, stops, and looks around, puzzled that Constanze has disappeared. Watched by an astonished Salieri, Mozart, whose playful nature was widely noted, disappears under the cloth and obviously pounces upon Constanze. The throng is mostly seated; the musicians are in their places, holding their various exotic-looking wind instruments, such as the basset horn, a favorite of Mozart's, and the candles are all lit, creating an elegant atmosphere typical of evening gatherings of the time. Immediately, Colloredo, Prince-Archbishop of Salzburg, enters. He is a small self-important figure of fifty in a wig, surmounted by a scarlet skullcap, and is followed by his Chamberlain, the Count Arco, known for his stern demeanor. Everyone stands as the Archbishop goes to his throne and sits, a customary gesture of respect. Instead, a wind musician gets up, approaches the Chamberlain, and whispers in his ear. They roll on the floor as he tries to drag her back under the table. The mood becomes suddenly softer as she kisses him, and they embrace, a scene that reflects the informal and often lively nature of such gatherings. Shocked, she strikes at him, and he leaps up, disheveled and rumpled, and runs out of the room, illustrating Mozart's mercurial personality. Salieri watches in amazement and disgust. Mozart hastens towards the Grand Salon away from the buffet room, adjusting his dress as he goes, a clear indication of the disorder caused by his antics. The opening of the Serenade is being tentatively conducted by the leader of the wind-musicians, a composition that Mozart specifically wrote for wind instruments, known for its rich and complex harmonies. Guests turn around as Mozart appears, bows to the Archbishop, and walks with an attempt at dignity to the dais where the wind band is playing. The leader yields his place to the composer, and Mozart smoothly takes over conducting with his renowned skill. Constanze, deeply embarrassed, sneaks into the room and seats herself at the back, trying to avoid attention. Salieri stands shocked from his inadvertent eavesdropping on this intimate moment. Mozart is conducting the Adagio from his Serenade (K. 361), a piece celebrated for its serene and lyrical beauty, guiding the thirteen wind instrumentalists. Salieri appears at the door at the back of the salon and stares in disbelief at Mozart, recognizing his genius in music. The audience is clearly delighted, and Mozart bows to them, also delighted. He does it with a furious grace, then leaves the room, his energy palpable. A group of people who have attended the concert, among them Constanze, are standing outside the private apartment. At sight of the composer, they break into sustained applause, acknowledging his extraordinary talent."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He reaches out a hand to steal one of the balls but at the same moment he hears giggling coming toward him and ducks down behind the pastry table  A girl Constanze rushes into the room runs straight across it and hides herself behind one of the tables  After a beat of total silence Mozart age twentysix wearing a fine wig and a brilliant coat with the insignia of the Archbishop of Salzburg upon it runs into the room stops and looks around puzzled that Constanze has disappeared  Watched by an astonished Salieri Mozart disappears under the cloth and obviously pounces upon Constanze  The throng is mostly seated  the musicians are in their places holding their various exoticlooking wind instruments and the candles are all lit  Immediately Colloredo PrinceArchbishop of Salzburg enters  He is a small selfimportant figure of fifty in a wig surmounted by a scarlet skullcap and is followed by his Chamberlain the Count Arco  Everyone stands as the Archbishop goes to his throne and sits  Instead a wind musician gets up approaches the Chamberlain and whispers in his ear  They roll on the floor as he tries to drag her back under the table  The mood becomes suddenly softer as she kisses him and they embrace  Shocked she strikes at him and he leaps up disheveled and rumpled and runs out of the room  Salieri watches in amazement and disgust  Mozart hastens towards the Grand Salon away from the buffet room adjusting his dress as he goes  Salieri enters the room and looks about him cautiously  He is salivating with anticipation as he stares at the feast of sweet things  His attention is attracted in particular by a huge pile of dark chocolate balls arranged in the shape of a pineapple  He reaches out a hand to steal one of the balls but at the same moment he hears giggling coming toward him and ducks down behind the pastry table  A girl Constanze rushes into the room runs straight across it and hides herself behind one of the tables  After a beat of total silence Mozart age twentysix wearing a fine wig and a brilliant coat with the insignia of the Archbishop of Salzburg upon it runs into the room stops and looks around puzzled that Constanze has disappeared  Watched by an astonished Salieri Mozart disappears under the cloth and obviously pounces upon Constanze  The throng is mostly seated  the musicians are in their places holding their various exoticlooking wind instruments and the candles are all lit  Immediately Colloredo PrinceArchbishop of Salzburg enters  He is a small selfimportant figure of fifty in a wig surmounted by a scarlet skullcap and is followed by his Chamberlain the Count Arco  Everyone stands as the Archbishop goes to his throne and sits  Instead a wind musician gets up approaches the Chamberlain and whispers in his ear  They roll on the floor as he tries to drag her back under the table  The mood becomes suddenly softer as she kisses him and they embrace  Shocked she strikes at him and he leaps up disheveled and rumpled and runs out of the room  Salieri watches in amazement and disgust  Mozart hastens towards the Grand Salon away from the buffet room adjusting his dress as he goes  The opening of the Serenade is being tentatively conducted by the leader of the windmusicians  Guests turn around as Mozart appears bows to the Archbishop and walks with an attempt at dignity to the dais where the wind band is playing  The leader yields his place to the composer and Mozart smoothly takes over conducting  Constanze deeply embarrassed sneaks into the room and seats herself at the back  Salieri stands shocked from his inadvertent eavesdropping  Mozart is conducting the Adagio from his Serenade K 361 guiding the thirteen wind instrumentalists  Salieri appears at the door at the back of the salon and stares in disbelief at Mozart  The audience is clearly delighted and Mozart bows to them also delighted  He does it with a furious grace then leaves the room  A group of people who have attended the concert among them  Constanze are standing outside the private apartment  At sight of the composer they break into sustained applause"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Salieri enters the room and looks about him cautiously. He is salivating with anticipation as he stares at the feast of sweet things. His attention is attracted in particular by a huge pile of dark chocolate balls arranged in the shape of a pineapple. He reaches out a hand to steal one of the balls but at the same moment he hears giggling coming toward him and ducks down behind the pastry table. A girl Constanze rushes into the room runs straight across it and hides herself behind one of the tables. After a beat of total silence Mozart age twentysix wearing a fine wig and a brilliant coat with the insignia of the Archbishop of Salzburg upon it runs into the room stops and looks around puzzled that Constanze has disappeared. Watched by an astonished Salieri Mozart disappears under the cloth and obviously pounces upon Constanze. The throng is mostly seated. the musicians are in their places holding their various exoticlooking wind instruments and the candles are all lit. Immediately Colloredo PrinceArchbishop of Salzburg enters. He is a small selfimportant figure of fifty in a wig surmounted by a scarlet skullcap and is followed by his Chamberlain the Count Arco. Everyone stands as the Archbishop goes to his throne and sits. Instead a wind musician gets up approaches the Chamberlain and whispers in his ear. They roll on the floor as he tries to drag her back under the table. The mood becomes suddenly softer as she kisses him and they embrace. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Shocked she strikes at him and he leaps up disheveled and rumpled and runs out of the room. Salieri watches in amazement and disgust. Mozart hastens towards the Grand Salon away from the buffet room adjusting his dress as he goes. The opening of the Serenade is being tentatively conducted by the leader of the windmusicians. Guests turn around as Mozart appears bows to the Archbishop and walks with an attempt at dignity to the dais where the wind band is playing. The leader yields his place to the composer and Mozart smoothly takes over conducting. Constanze deeply embarrassed sneaks into the room and seats herself at the back. Salieri stands shocked from his inadvertent eavesdropping. Mozart is conducting the Adagio from his Serenade K 361 guiding the thirteen wind instrumentalists. Salieri appears at the door at the back of the salon and stares in disbelief at Mozart. The audience is clearly delighted and Mozart bows to them also delighted. He does it with a furious grace then leaves the room. A group of people who have attended the concert among them. Constanze are standing outside the private apartment. At sight of the composer they break into sustained applause."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Salieri enters the room and looks about him cautiously. He is salivating with anticipation as he stares at the feast of sweet things. His attention is attracted in particular by a huge pile of dark chocolate balls arranged in the shape of a pineapple. He reaches out a hand to steal one of the balls but at the same moment he hears giggling coming toward him and ducks down behind the pastry table. A girl Constanze rushes into the room runs straight across it and hides herself behind one of the tables. After a beat of total silence Mozart age twentysix wearing a fine wig and a brilliant coat with the insignia of the Archbishop of Salzburg upon it runs into the room stops and looks around puzzled that Constanze has disappeared. Watched by an astonished Salieri Mozart disappears under the cloth and obviously pounces upon Constanze. The throng is mostly seated. the musicians are in their places holding their various exoticlooking wind instruments and the candles are all lit. Immediately Colloredo PrinceArchbishop of Salzburg enters. He is a small selfimportant figure of fifty in a wig surmounted by a scarlet skullcap and is followed by his Chamberlain the Count Arco. Everyone stands as the Archbishop goes to his throne and sits. Instead a wind musician gets up approaches the Chamberlain and whispers in his ear. They roll on the floor as he tries to drag her back under the table. The mood becomes suddenly softer as she kisses him and they embrace. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Shocked she strikes at him and he leaps up disheveled and rumpled and runs out of the room. Salieri watches in amazement and disgust. Mozart hastens towards the Grand Salon away from the buffet room adjusting his dress as he goes. The opening of the Serenade is being tentatively conducted by the leader of the windmusicians. Guests turn around as Mozart appears bows to the Archbishop and walks with an attempt at dignity to the dais where the wind band is playing. The leader yields his place to the composer and Mozart smoothly takes over conducting. Constanze deeply embarrassed sneaks into the room and seats herself at the back. Salieri stands shocked from his inadvertent eavesdropping. Mozart is conducting the Adagio from his Serenade K 361 guiding the thirteen wind instrumentalists. Salieri appears at the door at the back of the salon and stares in disbelief at Mozart. The audience is clearly delighted and Mozart bows to them also delighted. He does it with a furious grace then leaves the room. A group of people who have attended the concert among them. Constanze are standing outside the private apartment. At sight of the composer they break into sustained applause."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Salieri enters the room and looks about him cautiously. He is salivating with anticipation as he stares at the feast of sweet things. His attention is attracted in particular by a huge pile of dark chocolate balls arranged in the shape of a pineapple. He reaches out a hand to steal one of the balls but at the same moment he hears giggling coming toward him and ducks down behind the pastry table. A girl Constanze rushes into the room runs straight across it and hides herself behind one of the tables. After a beat of total silence Mozart age twentysix wearing a fine wig and a brilliant coat with the insignia of the Archbishop of Salzburg upon it runs into the room stops and looks around puzzled that Constanze has disappeared. Watched by an astonished Salieri Mozart disappears under the cloth and obviously pounces upon Constanze. The throng is mostly seated. Mozart is conducting the Adagio from his Serenade K 361 guiding the thirteen wind instrumentalists. Salieri appears at the door at the back of the salon and stares in disbelief at Mozart. The audience is clearly delighted and Mozart bows to them also delighted. He does it with a furious grace then leaves the room. A group of people who have attended the concert among them. Constanze are standing outside the private apartment. At sight of the composer they break into sustained applause."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Salieri enters the room and looks about him cautiously. He is salivating with anticipation as he stares at the feast of sweet things. His attention is attracted in particular by a huge pile of dark chocolate balls arranged in the shape of a pineapple. A group of people who have attended the concert among them. Constanze are standing outside the private apartment. At sight of the composer they break into sustained applause."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dog enters the room and looks about it cautiously. It is salivating with anticipation as it stares at the feast of sweet things. Its attention is attracted in particular by a huge pile of dark chocolate balls arranged in the shape of a pineapple. It reaches out a paw to steal one of the balls, but at the same moment, it hears giggling coming toward it and ducks down behind the pastry table. A bird, Constanze, flies into the room, flutters straight across it, and hides herself behind one of the tables. After a beat of total silence, the squirrel, age twenty-six, wearing a fine wig and a brilliant coat with the insignia of the Archbishop of Salzburg upon it, scampers into the room, stops, and looks around, puzzled that Constanze has disappeared. Watched by an astonished dog, the squirrel disappears under the cloth and obviously pounces upon Constanze. The throng is mostly seated; the musicians are in their places, holding their various exotic-looking wind instruments, and the candles are all lit. Immediately, the elephant, Prince-Archbishop of Salzburg, enters. It is a small self-important figure of fifty in a wig, surmounted by a scarlet skullcap, and is followed by its Chamberlain, the Count Arco. Everyone stands as the Archbishop goes to its throne and sits. Instead, a wind musician gets up, approaches the Chamberlain, and whispers in its ear. They roll on the floor as it tries to drag her back under the table. The mood becomes suddenly softer as she kisses it, and they embrace. Shocked, she strikes at it, and it leaps up, disheveled and rumpled, and runs out of the room. The dog watches in amazement and disgust. The squirrel hastens towards the Grand Salon away from the buffet room, adjusting its dress as it goes. The opening of the Serenade is being tentatively conducted by the leader of the wind-musicians. Guests turn around as the squirrel appears, bows to the Archbishop, and walks with an attempt at dignity to the dais where the wind band is playing. The leader yields its place to the composer, and the squirrel smoothly takes over conducting. Constanze, deeply embarrassed, sneaks into the room and seats herself at the back. The dog stands shocked from its inadvertent eavesdropping. The squirrel is conducting the Adagio from its Serenade (K. 361), guiding the thirteen wind instrumentalists. The dog appears at the door at the back of the salon and stares in disbelief at the squirrel. The audience is clearly delighted, and the squirrel bows to them, also delighted. It does it with a furious grace, then leaves the room. A group of people who have attended the concert, among them Constanze, are standing outside the private apartment. At sight of the composer, they break into sustained applause."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Salieri enters the chamber and looks about him cautiously. He is salivating with anticipation as he stares at the collection of savory things. His attention is attracted in particular by a huge pile of white chocolate squares arranged in the shape of a watermelon. He reaches out a hand to steal one of the squares, but at the same moment, he hears laughter coming toward him and ducks down behind the buffet cart. A girl, Constanze, rushes into the chamber, runs straight across it, and hides herself behind one of the carts. After a beat of total silence, Mozart, age twenty-six, wearing a fine hat and a brilliant cloak with the insignia of the Duke of Vienna upon it, runs into the chamber, stops, and looks around, puzzled that Constanze has disappeared. Watched by an astonished Salieri, Mozart disappears under the cloth and obviously pounces upon Constanze. The crowd is mostly seated; the performers are in their places, holding their various exotic-looking string instruments, and the lanterns are all lit. Immediately, Colloredo, Duke of Vienna, enters. He is a small self-important figure of fifty in a hat, surmounted by a violet skullcap, and is followed by his Chamberlain, the Baron Arco. Everyone stands as the Duke goes to his seat and sits. Instead, a string musician gets up, approaches the Chamberlain, and whispers in his ear. They roll on the floor as he tries to drag her back under the cart. The mood becomes suddenly softer as she kisses him, and they embrace. Shocked, she strikes at him, and he leaps up, disheveled and rumpled, and runs out of the chamber. Salieri watches in amazement and disgust. Mozart hastens towards the Grand Hall away from the dessert chamber, adjusting his attire as he goes. The opening of the Symphony is being tentatively conducted by the leader of the string performers. Guests turn around as Mozart appears, bows to the Duke, and walks with an attempt at dignity to the platform where the string ensemble is playing. The leader yields his place to the composer, and Mozart smoothly takes over conducting. Constanze, deeply embarrassed, sneaks into the chamber and seats herself at the back. Salieri stands shocked from his inadvertent eavesdropping. Mozart is conducting the Allegro from his Symphony (K. 361), guiding the thirteen string instrumentalists. Salieri appears at the door at the back of the hall and stares in disbelief at Mozart. The audience is clearly delighted, and Mozart bows to them, also delighted. He does it with a furious grace, then leaves the chamber. A group of people who have attended the recital, among them Constanze, are standing outside the private studio. At sight of the composer, they break into sustained applause."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Salieri enters the room and tiptoes about him cautiously. He is fidgeting with anticipation as he glances at the feast of sweet things. His attention is diverted in particular by a huge pile of dark chocolate balls arranged in the shape of a pineapple. He stretches out a hand to grasp one of the balls, but at the same moment, he hears singing coming toward him and slides down behind the pastry table. A girl, Constanze, rushes into the room, dances straight across it, and tucks herself behind one of the tables. After a beat of total silence, Mozart, age twenty-six, wearing a fine wig and a brilliant coat with the insignia of the Archbishop of Salzburg upon it, skips into the room, pauses, and glances around, puzzled that Constanze has vanished. Watched by an astonished Salieri, Mozart slides under the cloth and obviously hides with Constanze. The throng is mostly seated; the musicians are in their places, cradling their various exotic-looking wind instruments, and the candles are all lit. Immediately, Colloredo, Prince-Archbishop of Salzburg, enters. He is a small self-important figure of fifty in a wig, surmounted by a scarlet skullcap, and is followed by his Chamberlain, the Count Arco. Everyone stands as the Archbishop approaches his throne and rests. Instead, a wind musician stands, inches towards the Chamberlain, and murmurs in his ear. They tumble on the floor as he attempts to lift her back under the table. The mood becomes suddenly softer as she pats him, and they cuddle. Shocked, she shoves at him, and he springs up, ruffled and crumpled, and strolls out of the room. Salieri watches in amazement and disgust. Mozart speeds towards the Grand Salon away from the buffet room, adjusting his collar as he goes. The opening of the Serenade is being carefully guided by the leader of the wind-musicians. Guests turn around as Mozart enters, nods to the Archbishop, and strides with an attempt at dignity to the dais where the wind band is playing. The leader relinquishes his place to the composer, and Mozart gracefully assumes conducting. Constanze, deeply embarrassed, sneaks into the room and perches herself at the back. Salieri stands shocked from his inadvertent eavesdropping. Mozart is orchestrating the Adagio from his Serenade (K. 361), directing the thirteen wind instrumentalists. Salieri appears at the door at the back of the salon and gazes in disbelief at Mozart. The audience is clearly delighted, and Mozart nods to them, also delighted. He executes it with a fierce poise, then exits the room. A group of people who have attended the concert, among them Constanze, are standing outside the private apartment. At sight of the composer, they burst into sustained applause."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The koala enters the cave and looks about it cautiously. It is bubbling with anticipation as it stares at the banquet of sparkling stones. Its attention is attracted in particular by a huge pile of silver marbles arranged in the shape of a cactus. It reaches out a paw to steal one of the marbles, but at the same moment, it hears humming coming toward it and ducks down behind the pillow fort. A robot, Beatrix, zooms into the cave, rolls straight across it, and hides itself behind one of the cushions. After a beat of total silence, Leonardo, age forty-two, wearing a curious scarf and a shimmering jacket with the emblem of the Space Federation upon it, rockets into the cave, stops, and looks around, puzzled that Beatrix has vanished. Watched by an astonished koala, Leonardo vanishes under the duvet and obviously pounces upon Beatrix. The herd is mostly seated; the chefs are in their places, holding their various intricate-looking spatulas, and the lanterns are all lit. Immediately, Avalon, King of the Underworld, appears. He is a tall pretentious figure of eighty in a hat, topped by a purple crown, and is followed by his Butler, the Baron Encore. Everyone stands as the King goes to his hammock and sits. Instead, a spatula chef gets up, approaches the Butler, and whispers in its ear. They roll on the floor as it tries to drag him back under the cushion. The atmosphere becomes suddenly softer as it hugs him, and they cuddle. Shocked, it strikes at him, and he leaps up, unkempt and scrambled, and rolls out of the cave. The koala watches in amazement and revulsion. Leonardo zips towards the Great Hall away from the candy cave, adjusting his robe as he goes. The opening of the Symphony is being tentatively conducted by the leader of the spatula-chefs. Visitors turn around as Leonardo appears, bows to the King, and glides with an attempt at dignity to the hill where the spatula choir is playing. The leader yields its place to the magician, and Leonardo smoothly takes over waving. Beatrix, deeply embarrassed, slips into the cave and seats itself at the back. The koala stands shocked from its inadvertent eavesdropping. Leonardo is waving the Baton from his Symphony (Op. 123), guiding the fourteen spatula wavers. The koala appears at the crack at the back of the hall and stares in disbelief at Leonardo. The gathering is clearly thrilled, and Leonardo bows to them, also thrilled. He does it with a fiery elegance, then vanishes from the cave. A cluster of creatures who have observed the display, among them Beatrix, are standing outside the secret compartment. At sight of the magician, they erupt into sustained clapping."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Salieri ambles into the orchard and surveys around him nervously. He is shivering with resolve as he gazes at the collection of savory objects. His curiosity is captured in particular by a tiny stack of white chocolate squares shaped like a grapevine. He stretches out a foot to kick one of the squares, but at the same moment, he hears humming approaching him and sneaks up behind the sculpture stand. A boy, Constanze, strolls into the orchard, skips straight across it, and plants himself behind one of the stands. After a pause of complete stillness, Bach, age forty-seven, wearing a plain cap and an ornate robe with the crest of the Prince of Orange upon it, glides into the orchard, halts, and peers around, confused that Constanze has evaded him. Observed by a bewildered Salieri, Bach crawls under the tent and quickly trips over Constanze. The group is mostly standing; the performers are in their spots, clutching their various shiny metal drums, and the lanterns are all glowing. Abruptly, Rosenthal, Duke-Collaborator of Salzburg, strides in. He is a tall bashful figure of seventy in a hat, topped by a golden cross, and is followed by his Secretary, the Baron Arco. Everyone squats as the Duke marches to his bench and reclines. Instead, a pianist jumps up, sidles over to the Secretary, and calls out in her ear. They stumble to the wall as she strives to pull him out from under the couch. The tension becomes abruptly louder as he hugs her, and they clench. Astonished, he taps at her, and she hops up, disoriented and creased, and dashes out of the orchard. Salieri watches in bewilderment and distaste. Bach tiptoes towards the Main Hall away from the art orchard, fixing his hat as he ambles. The finale of the Quartet is being gently orchestrated by the organizer of the metal-drummers. Spectators turn around as Bach pops up, nods to the Duke, and hops with an air of pride to the podium where the metal ensemble is playing. The organizer forfeits his stage to the choreographer, and Bach deftly assumes orchestrating. Constanze, intensely mortified, slips into the orchard and situates herself at the edge. Salieri stands baffled from his accidental observation. Bach is orchestrating the Allegro from his Quartet (L. 593), directing the fifteen brass instrumentalists. Salieri appears at the gate at the front of the orchard and gazes in astonishment at Bach. The listeners are clearly entertained, and Bach nods to them, also entertained. He performs it with a reserved elegance, then slips away from the orchard. A crowd of onlookers who have joined the performance, among them Constanze, are lingering outside the public garden. Upon glimpsing the choreographer, they burst into prolonged cheering."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Salieri enters the arena and gazes around him cautiously. He is whistling with excitement as he observes the array of savory snacks. His attention is caught particularly by a giant stack of buttercream cupcakes arranged in the shape of a watermelon. He reaches out a hand to pluck one of the cupcakes, but at the same moment, he hears singing approaching him and crouches behind the soup station. A girl, Constanze, rushes into the arena, dashes straight across it, and conceals herself behind one of the counters. After a moment of complete silence, Mozart, age twenty-six, wearing a stylish hat and a dazzling jacket with the emblem of the Emperor of Austria upon it, sprints into the arena, halts, and glances around, baffled that Constanze has vanished. Watched by a bewildered Salieri, Mozart vanishes under the drape and evidently springs upon Constanze. The crowd is mostly settled; the instrumentalists are in their places, wielding their various peculiar-looking string instruments, and the lanterns are all glowing. Immediately, Colloredo, Duke of Austria, enters. He is a small pompous figure of fifty in a hat, topped by a crimson beret, and is followed by his Aide, the Baron Arco. Everyone rises as the Duke walks to his seat and relaxes. Instead, a string player rises, approaches the Aide, and murmurs in his ear. They tumble on the ground as he attempts to haul her back under the drape. The atmosphere becomes suddenly warmer as she embraces him, and they cuddle. Startled, she pushes at him, and he springs up, ruffled and tousled, and sprints out of the arena. Salieri observes in astonishment and disdain. Mozart hurries towards the Grand Chamber away from the snack area, fixing his attire as he moves. The commencement of the Symphony is being hesitantly led by the chief of the string-players. Guests turn around as Mozart shows up, nods to the Duke, and proceeds with an attempt at decorum to the stage where the string ensemble is performing. The chief relinquishes his spot to the composer, and Mozart effortlessly assumes control of conducting. Constanze, feeling extremely awkward, slips into the arena and settles herself at the rear. Salieri stands astounded from his accidental overhearing. Mozart is guiding the Allegro from his Symphony (K. 361), directing the fifteen string instrumentalists. Salieri appears at the entrance at the rear of the chamber and gazes in disbelief at Mozart. The audience is visibly thrilled, and Mozart bows to them, equally thrilled. He does it with a fiery elegance, then departs the arena. A cluster of individuals who have attended the performance, among them Constanze, are gathered outside the private lounge. At the sight of the composer, they erupt into prolonged cheerfulness."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Fenwick waltzes into the cavern and surveys the space warily. He is drooling with excitement as he glares at the assortment of savory items. His gaze is captivated specifically by a colossal mound of blueberry muffins arranged in the form of an apple. He extends an arm to swipe one of the muffins, but simultaneously, he hears laughter approaching him and crouches down behind the salad bar. A boy, Penelope, dashes into the cavern, sprints directly across it, and conceals himself behind one of the chairs. After a moment of complete quiet, Vivaldi, age seventy-two, donning a rugged cap and a radiant jacket with the crest of the Duke of Milan upon it, darts into the cavern, halts, and peers around, bewildered that Penelope has vanished. Observed by an awe-struck Fenwick, Vivaldi vanishes beneath the rug and evidently lunges at Penelope. The horde is mostly standing; the dancers are at their posts, holding their various intricate-looking stringed instruments, and the lanterns are all extinguished. Abruptly, Lorenzo, King-Duke of Milan, strides in. He is a tall unassuming figure of twenty in a cap, topped by a purple bonnet, and is trailed by his Steward, the Marquis Vino. Everyone sits as the King-Duke advances to his stool and stands. Alternatively, a string musician rises, approaches the Steward, and murmurs in his nostril. They tumble on the ceiling as he tries to yank him back under the chair. The atmosphere becomes suddenly harsher as he shoos him, and they scuffle. Outraged, he slaps at him, and he hops down, disheveled and neat, and trots out of the cavern. Fenwick observes in wonder and revulsion. Vivaldi scampers towards the Small Studio away from the omelet nook, adjusting his collar as he flees. The crescendo of the Symphony is being lethargically overseen by the guide of the string-players. Onlookers swivel as Vivaldi emerges, curtsies to the King-Duke, and skips with an effort at elegance to the pedestal where the string ensemble is performing. The guide forfeits his station to the gardener, and Vivaldi awkwardly assumes guiding. Penelope, profoundly mortified, tiptoes into the cavern and perches herself at the front. Fenwick sits fascinated from his deliberate spying. Vivaldi is overseeing the Allegro from his Symphony (L. 361), directing the nineteen string instrumentalists. Fenwick materializes at the gateway at the front of the studio and gapes in incredulity at Vivaldi. The audience is evidently amused, and Vivaldi nods to them, also amused. He does it with a serene clumsiness, then enters the cavern. A crowd of creatures who have attended the recital, among them Penelope, are crouching inside the public cavern. At sight of the gardener, they disrupt into restrained silence."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Salieri enters a room filled with sweets, eyeing a stack of dark chocolate balls shaped like a pineapple. As he reaches for one, he hears giggling and hides behind a table. Constanze rushes in, hiding as well. Mozart, twenty-six, with a fine wig and coat, enters puzzled. He finds Constanze, and they playfully interact under the table. Colloredo, the Prince-Archbishop of Salzburg, and his Chamberlain, Count Arco, enter, and the crowd stands. Meanwhile, Mozart and Constanze's playful moment turns tender before she strikes him, and he exits, disheveled. Salieri, amazed and disgusted, observes as Mozart heads to the Grand Salon. Mozart, adjusting his attire, takes over conducting from the leader of the wind-musicians, performing his Serenade (K. 361). Constanze, embarrassed, sneaks in and sits at the back. Salieri watches in disbelief as Mozart passionately conducts, delighting the audience. Afterward, a group, including Constanze, applauds Mozart outside the private apartment."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "At sight of the composer they break into sustained applause Constanze are standing outside the private apartment  A group of people who have attended the concert among them  He does it with a furious grace then leaves the room  The audience is clearly delighted and Mozart bows to them also delighted  Salieri appears at the door at the back of the salon and stares in disbelief at Mozart  Mozart is conducting the Adagio from his Serenade K 361 guiding the thirteen wind instrumentalists  Salieri stands shocked from his inadvertent eavesdropping  Constanze deeply embarrassed sneaks into the room and seats herself at the back  The leader yields his place to the composer and Mozart smoothly takes over conducting  Guests turn around as Mozart appears bows to the Archbishop and walks with an attempt at dignity to the dais where the wind band is playing  The opening of the Serenade is being tentatively conducted by the leader of the windmusicians  Mozart hastens towards the Grand Salon away from the buffet room adjusting his dress as he goes  Salieri watches in amazement and disgust  Shocked she strikes at him and he leaps up disheveled and rumpled and runs out of the room  The mood becomes suddenly softer as she kisses him and they embrace  They roll on the floor as he tries to drag her back under the table  Instead a wind musician gets up approaches the Chamberlain and whispers in his ear  Everyone stands as the Archbishop goes to his throne and sits  He is a small selfimportant figure of fifty in a wig surmounted by a scarlet skullcap and is followed by his Chamberlain the Count Arco  Immediately Colloredo PrinceArchbishop of Salzburg enters  the musicians are in their places holding their various exoticlooking wind instruments and the candles are all lit  The throng is mostly seated  Watched by an astonished Salieri Mozart disappears under the cloth and obviously pounces upon Constanze  After a beat of total silence Mozart age twentysix wearing a fine wig and a brilliant coat with the insignia of the Archbishop of Salzburg upon it runs into the room stops and looks around puzzled that Constanze has disappeared  A girl Constanze rushes into the room runs straight across it and hides herself behind one of the tables  He reaches out a hand to steal one of the balls but at the same moment he hears giggling coming toward him and ducks down behind the pastry table  His attention is attracted in particular by a huge pile of dark chocolate balls arranged in the shape of a pineapple  He is salivating with anticipation as he stares at the feast of sweet things  Salieri enters the room and looks about him cautiously "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Immediately Colloredo PrinceArchbishop of Salzburg enters  Salieri enters the room and looks about him cautiously  Guests turn around as Mozart appears bows to the Archbishop and walks with an attempt at dignity to the dais where the wind band is playing  Constanze deeply embarrassed sneaks into the room and seats herself at the back  Constanze are standing outside the private apartment  After a beat of total silence Mozart age twentysix wearing a fine wig and a brilliant coat with the insignia of the Archbishop of Salzburg upon it runs into the room stops and looks around puzzled that Constanze has disappeared  Mozart is conducting the Adagio from his Serenade K 361 guiding the thirteen wind instrumentalists  The audience is clearly delighted and Mozart bows to them also delighted  The leader yields his place to the composer and Mozart smoothly takes over conducting  The mood becomes suddenly softer as she kisses him and they embrace  Salieri appears at the door at the back of the salon and stares in disbelief at Mozart  Shocked she strikes at him and he leaps up disheveled and rumpled and runs out of the room  Salieri watches in amazement and disgust  The throng is mostly seated  Mozart hastens towards the Grand Salon away from the buffet room adjusting his dress as he goes  He is salivating with anticipation as he stares at the feast of sweet things  He does it with a furious grace then leaves the room  The opening of the Serenade is being tentatively conducted by the leader of the windmusicians  Everyone stands as the Archbishop goes to his throne and sits  At sight of the composer they break into sustained applause Instead a wind musician gets up approaches the Chamberlain and whispers in his ear  His attention is attracted in particular by a huge pile of dark chocolate balls arranged in the shape of a pineapple  He reaches out a hand to steal one of the balls but at the same moment he hears giggling coming toward him and ducks down behind the pastry table  A group of people who have attended the concert among them  Watched by an astonished Salieri Mozart disappears under the cloth and obviously pounces upon Constanze  A girl Constanze rushes into the room runs straight across it and hides herself behind one of the tables  the musicians are in their places holding their various exoticlooking wind instruments and the candles are all lit  He is a small selfimportant figure of fifty in a wig surmounted by a scarlet skullcap and is followed by his Chamberlain the Count Arco  They roll on the floor as he tries to drag her back under the table  Salieri stands shocked from his inadvertent eavesdropping "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Shocked she strikes at him and he leaps up disheveled and rumpled and runs out of the room  Salieri watches in amazement and disgust  Mozart hastens towards the Grand Salon away from the buffet room adjusting his dress as he goes  The opening of the Serenade is being tentatively conducted by the leader of the windmusicians  Guests turn around as Mozart appears bows to the Archbishop and walks with an attempt at dignity to the dais where the wind band is playing  The leader yields his place to the composer and Mozart smoothly takes over conducting  Constanze deeply embarrassed sneaks into the room and seats herself at the back  Salieri stands shocked from his inadvertent eavesdropping  Mozart is conducting the Adagio from his Serenade K 361 guiding the thirteen wind instrumentalists  Salieri appears at the door at the back of the salon and stares in disbelief at Mozart  The audience is clearly delighted and Mozart bows to them also delighted  He does it with a furious grace then leaves the room  A group of people who have attended the concert among them  Constanze are standing outside the private apartment  At sight of the composer they break into sustained applause Salieri enters the room and looks about him cautiously  He is salivating with anticipation as he stares at the feast of sweet things  His attention is attracted in particular by a huge pile of dark chocolate balls arranged in the shape of a pineapple  He reaches out a hand to steal one of the balls but at the same moment he hears giggling coming toward him and ducks down behind the pastry table  A girl Constanze rushes into the room runs straight across it and hides herself behind one of the tables  After a beat of total silence Mozart age twentysix wearing a fine wig and a brilliant coat with the insignia of the Archbishop of Salzburg upon it runs into the room stops and looks around puzzled that Constanze has disappeared  Watched by an astonished Salieri Mozart disappears under the cloth and obviously pounces upon Constanze  The throng is mostly seated  the musicians are in their places holding their various exoticlooking wind instruments and the candles are all lit  Immediately Colloredo PrinceArchbishop of Salzburg enters  He is a small selfimportant figure of fifty in a wig surmounted by a scarlet skullcap and is followed by his Chamberlain the Count Arco  Everyone stands as the Archbishop goes to his throne and sits  Instead a wind musician gets up approaches the Chamberlain and whispers in his ear  They roll on the floor as he tries to drag her back under the table  The mood becomes suddenly softer as she kisses him and they embrace "
        }
      ]
    }
  ]
}