{
  "ground_truth": "Salieri sits at his desk, which is littered with manuscripts. In the middle stands a billiard table, and the beautiful closing ensemble from Act IV of Figaro, \"Ah, Tutti contenti! Saremo cosi,\" plays in the background. Standing at the billiard table, Mozart dreamily hears the music while playing shots on the table. From time to time, he drifts over to a piece of manuscript paper and jots down notes. He is in his own world of composition, with the billiard balls aiding his creativity. Mozart comes out, and framed in the doorway from outside stands Lorl, the maid noticed in Salieri's house. From his bedroom, Leopold peeps out to watch. Mozart goes to the girl, then Constanze follows. The old man emerges from his bedroom, and Constanze looks furiously at him, then at Lorl. Lorl goes outside and closes the door. Constanze turns on Leopold, and a hand comes into frame offering a plate of sugared biscuits. On its finger is the gold signet ring belonging to Salieri, who hands her a pile of coins. She accepts them, delighted. To lively music, the door of the house bursts open, and a grand forte-piano augmented with a pedal is carried out by six men who run off with it down the street. Immediately, Wolfgang, Constanze, and Leopold, all dressed for an occasion, climb into a waiting carriage that drives off after the forte-piano. As soon as it goes, Lorl appears in the doorway, peering slyly around to see that they are out of sight, then she shuts the door and hurries off in the opposite direction. An outdoor concert is being given where Mozart is playing the final movement of his E-flat concerto with an orchestra. A sizable audience listens to him, including the Emperor, flanked by Strack and Von Swieten. The crowd is happy and appreciative in a delightful open-air scene. Leopold and Constanze listen to Mozart, who plays his work brilliantly. A carriage clops through the streets with Lorl sitting up on the box beside the driver. Inside the vehicle, the figure of Salieri is glimpsed. Mozart is conducting and playing in a reflective mood as Lorl opens the door, admitting Salieri. They go in, and the door shuts. The room is considerably tidier due to Lorl's ministrations. Salieri stands looking around with tremendous curiosity as she opens a drawer in a sideboard where we see a gold snuff box, the one presented to Mozart as a child in the Vatican. Salieri turns to look around as she points across the room to the workroom, where Salieri crosses alone.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Salieri perches at his bureau, which is strewn with scores. In the center stands a billiards table, and the exquisite concluding ensemble from Act IV of Figaro, \"Ah, Tutti contenti! Saremo così,\" plays in the background. Standing at the billiards table, Mozart dreamily listens to the melody while playing shots on the table. From time to time, he drifts over to a piece of manuscript paper and scribbles down notes. He is in his own realm of composition, with the billiard balls aiding his inventiveness. Mozart emerges, and framed in the doorway from outside stands Lorl, the maid noticed in Salieri's residence. From his bedroom, Leopold peeps out to observe. Mozart goes to the girl, then Constanze follows. The old man emerges from his bedroom, and Constanze looks angrily at him, then at Lorl. Lorl goes outside and shuts the door. Constanze turns on Leopold, and a hand enters frame offering a plate of sugared biscuits. On its finger is the gold signet ring belonging to Salieri, who hands her a stack of coins. She accepts them, delighted. To lively music, the door of the residence bursts open, and a grand forte-piano enhanced with a pedal is carried out by six men who run off with it down the street. Immediately, Wolfgang, Constanze, and Leopold, all attired for an event, climb into a waiting carriage that drives off after the forte-piano. As soon as it goes, Lorl appears in the doorway, peering slyly around to see that they are out of sight, then she shuts the door and hurries off in the opposite direction. An outdoor performance is being given where Mozart is playing the final movement of his E-flat concerto with an orchestra. A sizable audience listens to him, including the Emperor, flanked by Strack and Von Swieten. The crowd is happy and appreciative in a delightful open-air scene. Leopold and Constanze listen to Mozart, who plays his work brilliantly. A carriage clops through the streets with Lorl sitting up on the box beside the driver. Inside the vehicle, the figure of Salieri is glimpsed. Mozart is conducting and playing in a reflective mood as Lorl opens the door, admitting Salieri. They go in, and the door shuts. The room is considerably tidier due to Lorl's ministrations. Salieri stands looking around with tremendous curiosity as she opens a drawer in a sideboard where we see a gold snuff box, the one presented to Mozart as a child in the Vatican. Salieri turns to look around as she points across the room to the workroom, where Salieri crosses alone."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Salieri is seated at his desk, which has been littered with manuscripts. In the middle, a billiard table is stood by him, and in the background, the beautiful closing ensemble from Act IV of Figaro, \"Ah, Tutti contenti! Saremo cosi,\" is played. Standing at the billiard table, the music is dreamily heard by Mozart while shots are played by him on the table. From time to time, he is drifted over to a piece of manuscript paper, and notes are jotted down by him. He is surrounded by his own world of composition, with his creativity being aided by the billiard balls. Mozart comes out, and Lorl, the maid noticed in Salieri's house, stands framed in the doorway from outside. From his bedroom, Leopold watches as he peeps out. The girl is approached by Mozart, then Constanze follows. The old man emerges from his bedroom, and Leopold is looked at furiously by Constanze, then Lorl is looked at by her. The door is closed by Lorl as she goes outside. Leopold is turned on by Constanze, and a plate of sugared biscuits is offered by a hand coming into the frame. On its finger is the gold signet ring that belongs to Salieri, who gives her a pile of coins. She is delighted as she accepts them. To lively music, the house's door is burst open, and six men carry out a grand forte-piano augmented with a pedal, running off with it down the street. Immediately, Wolfgang, Constanze, and Leopold, all dressed for an occasion, climb into a carriage waiting, which drives off after the forte-piano. As soon as it goes, the doorway is appeared in by Lorl, who peers slyly around to see that they are out of sight, then she shuts the door and hurries off in the opposite direction. An outdoor concert is given, where the final movement of his E-flat concerto is played by Mozart with an orchestra. A sizable audience, including the Emperor flanked by Strack and Von Swieten, listens to him. The crowd is happy and appreciative in a delightful open-air scene. Mozart is listened to by Leopold and Constanze, who hear his work played brilliantly by him. Through the streets, a carriage clops with Lorl sitting up on the box beside the driver. Inside the vehicle, Salieri is glimpsed. The conducting and playing in a reflective mood is done by Mozart as Salieri is admitted by Lorl after she opens the door. They are let in, and the door is then shut. The room is made considerably tidier by Lorl's ministrations. Salieri stands looking around with tremendous curiosity as a drawer in a sideboard is opened by her, where we see a gold snuff box presented to Mozart as a child in the Vatican. Salieri turns to look around as she points across the room to the workroom, which is crossed alone by Salieri."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Salieri sits at his desk, cluttered with manuscripts. A billiard table stands in the middle while the beautiful closing ensemble from Act IV of Figaro plays. Mozart, dreamily absorbed in the music, alternates between playing billiards and jotting down notes. Lorl, the maid, is framed in the doorway, observed by Leopold from his bedroom. Mozart approaches her, followed by Constanze. Leopold emerges, and Constanze glares at him and Lorl, who exits and closes the door. Constanze confronts Leopold as a hand with Salieri's gold signet ring offers sugared biscuits and coins, which she accepts, pleased. To lively music, six men carry out a grand forte-piano, with Wolfgang, Constanze, and Leopold following in a carriage. As they leave, Lorl sneaks a look outside before hurrying away. At an outdoor concert, Mozart performs his E-flat concerto for a sizable audience, including the Emperor. Leopold and Constanze listen appreciatively as the carriage with Lorl and Salieri passes through the streets. Inside, Salieri is glimpsed. Mozart conducts in a reflective mood as Lorl lets Salieri into a tidier room, where she reveals a drawer with a gold snuff box from Mozart's childhood in the Vatican. Salieri looks around as she points to the workroom he crosses into alone."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Salieri sits at a desk cluttered with manuscripts, while a billiard table is centered in the room. Mozart plays billiards, inspired by the Act IV ensemble, \"Ah, Tutti contenti! Saremo cosi.\" He occasionally jots down notes, immersed in composition. Lorl, the maid, appears framed in the doorway; Leopold watches them. Mozart approaches Lorl, followed by Constanze, who angrily turns on Leopold. Lorl exits, shutting the door. Salieri's hand offers sugared biscuits and coins to Constanze, who smiles. Lively music plays as men carry a grand forte-piano down the street. Wolfgang, Constanze, and Leopold, dressed for an event, leave in a carriage, following the piano. Once they leave, Lorl discreetly shuts the door, hurrying off. An outdoor concert features Mozart performing his E-flat concerto before an appreciative audience, including the Emperor. Lorl rides beside the driver as Salieri is glimpsed inside a carriage. Mozart plays reflectively as Lorl admits Salieri into a tidier room. Salieri, curious, watches Lorl open a drawer revealing a gold snuff box from the Vatican, then she gestures toward the workroom, which Salieri enters alone."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Salieri is seated at his desk, which is absolutely cluttered with a multitude of manuscripts, each one brimming with musical notes and ideas. In the center of the room, there is a billiard table, and the exquisite and melodic closing ensemble from the fourth act of Figaro, specifically \"Ah, Tutti contenti! Saremo cosi,\" elegantly fills the background, creating an enchanting atmosphere. Positioned by the billiard table, Mozart is lost in reverie, dreamily absorbing the beautiful music while lazily playing shots across the table's surface. Every so often, he wanders over to a sheet of manuscript paper, where he pens down musical notes. He is deeply immersed in his own realm of composition, using the rhythmic sound of billiard balls to spark his creative genius. \n\nAs Mozart eventually emerges, positioned in the doorway from the outside stands Lorl, the maid who is often noticed in Salieri's household. From an adjoining bedroom, Leopold sneaks a glimpse, curiously observing the scene. Mozart approaches the girl, soon followed by Constanze, who accompanies him. The elderly man steps out of his bedroom, only to be met with Constanze's furious glare, first directed at him and then at Lorl. Lorl steps outside and carefully closes the door behind her. \n\nConstanze, her temper roused, turns sharply on Leopold, when suddenly, a hand appears in the frame, offering a plate filled with sugared biscuits. On this hand is a gold signet ring, easily recognizable as belonging to Salieri, who also presents her with a pile of coins. She accepts them with evident delight. To the sound of lively, exuberant music, the door of the house bursts open, and a grand forte-piano, now augmented with an additional pedal, is carried out by six strong men who quickly hurry off with it down the bustling street. Without wasting a moment, Wolfgang, Constanze, and Leopold, all attired in grandiose fashion for the occasion, climb enthusiastically into a waiting carriage that swiftly follows the forte-piano.\n\nAs soon as they depart, Lorl appears cautiously in the doorway, slyly ensuring they are truly out of sight, then promptly shuts the door and hurries off in the opposite direction. Outside, an engaging concert is underway where Mozart is brilliantly executing the final movement of his E-flat concerto in harmony with an orchestra. A sizable and appreciative audience listens with rapt attention, including the Emperor, who is accompanied by Strack and Von Swieten. The crowd is visibly delighted and appreciative, relishing the delightful outdoor event.\n\nMeanwhile, Leopold and Constanze are absorbed in listening to Mozart, who performs his work with remarkable brilliance. As a carriage clatters through the streets, we see Lorl sitting up on the box beside the driver. Inside the vehicle, the shadowy figure of Salieri can be faintly glimpsed. Mozart is in the midst of conducting and playing, deeply reflective and focused, as Lorl opens the door, allowing Salieri to enter. Together, they step inside, and the door closes behind them. The room is significantly tidier, thanks to Lorl's diligent attentions. Salieri stands surveying the room with overwhelming curiosity as she opens a drawer within a sideboard, revealing a gold snuff box, the very one presented to Mozart as a child in the Vatican. Salieri turns to take in his surroundings as she gestures across the room toward the workroom, where Salieri proceeds to cross alone."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Salieri is seated at his desk, a piece of furniture absolutely cluttered with an overwhelming array of manuscripts. Each one is bursting with musical notes and ideas, capturing the creative chaos of his mind. In the very center of this room, there is a billiard table. Meanwhile, the exquisite and melodic closing ensemble from the fourth act of Figaro, specifically the piece \"Ah, Tutti contenti! Saremo cosi,\" is elegantly filling the background, creating an enchanting and almost magical atmosphere. Positioned by the billiard table, Mozart is engrossed in a state of reverie, dreamily absorbing the beautiful music that surrounds him while he lazily plays shots across the table's smooth surface. Every so often, he wanders over to a sheet of manuscript paper, where he carefully pens down musical notes. He is deeply immersed in his own imaginative realm of composition, using the rhythmic sound of the billiard balls as inspiration to spark his creative genius.\n\nAs Mozart eventually emerges, positioned in the doorway from the outside, stands Lorl, the maid who is often noticed attending to duties in Salieri's household. From an adjoining bedroom, Leopold sneaks a curious glimpse, observing the unfolding scene with interest. Mozart approaches the girl, soon followed by Constanze, who accompanies him closely. The elderly man steps out of his bedroom, only to be met with Constanze's furious glare, first directed at him and then sharply at Lorl. Lorl steps outside and carefully closes the door behind her, ensuring it is fully shut.\n\nConstanze, her temper visibly roused, turns sharply on Leopold, when suddenly, a hand appears in the frame, gracefully offering a plate piled high with sugared biscuits. On this hand is a distinctive gold signet ring, easily recognizable as belonging to Salieri himself, who also presents her with a generous pile of coins. She graciously accepts them with evident delight. To the lively sound of exuberant music, the door of the house bursts open, and a grand forte-piano, now enhanced with an additional pedal, is carried out by six strong men who hurry off with it down the bustling street. Without wasting a single moment, Wolfgang, Constanze, and Leopold, all attired in grandiose fashion suited for the occasion, climb enthusiastically into a waiting carriage that quickly follows the forte-piano.\n\nAs soon as they depart, Lorl appears cautiously in the doorway, slyly ensuring they are truly out of sight, then promptly shuts the door and hurries off in the opposite direction. Outside, an engaging concert is underway where Mozart is brilliantly executing the final movement of his E-flat concerto in perfect harmony with an orchestra. A sizable and appreciative audience listens with rapt attention, including the Emperor himself, who is accompanied by both Strack and Von Swieten. The crowd is visibly delighted and thoroughly appreciative, relishing the delightful experience of the outdoor event.\n\nMeanwhile, Leopold and Constanze are completely absorbed in listening to Mozart, who performs his work with remarkable brilliance and focus. As a carriage clatters through the streets, we see Lorl sitting up on the box beside the driver, her posture alert. Inside the vehicle, the shadowy figure of Salieri can be faintly glimpsed, adding an air of mystery. Mozart is in the midst of conducting and playing, deeply reflective and focused, as Lorl opens the door, graciously allowing Salieri to enter. Together, they step inside, and the door gently closes behind them. The room is significantly tidier, thanks to Lorl's diligent attentions. Salieri stands surveying the room with overwhelming curiosity as she opens a drawer within a sideboard, revealing a gold snuff box, the very one that was presented to Mozart as a child in the Vatican. Salieri turns to take in his surroundings as she gestures across the room toward the workroom, where Salieri proceeds to cross alone."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Salieri finds himself seated at his desk, which is heavily scattered with various manuscripts, indicating a mind deep in thought and the occasional chaos of creative genius. Centrally positioned in the room is a billiard table around which the beautiful sounds of the closing ensemble from Act IV of Figaro, \"Ah, Tutti contenti! Saremo cosi,\" permeate the ambiance, creating a harmonious backdrop. Mozart, captivated by the music that fills the air, stands dreamily at the billiard table. He gently strikes the billiard balls in a slow rhythm, using the table as a canvas for his creativity. Periodically, he is drawn away from the table by a sudden inspiration, moving over to a nearby piece of manuscript paper to quickly jot down notes that have formed in his mind. Immersed in his own world of composition, he seemingly uses the movement of the billiard balls as a catalyst for his creativity. As these scenes unfold, Mozart emerges, and the doorway is filled with the figure of Lorl, the maid who is known from Salieri's household, quietly observing from the outside. Meanwhile, Leopold peeks out from his bedroom, curious about the unfolding events. Mozart, noticing the presence of the girl, moves toward her, and shortly thereafter, Constanze follows him. As the old man steps out from his bedroom, an immediate tension arises, and Constanze fixes a furious gaze upon him and then shifts it onto Lorl. Responding to this tension, Lorl exits the room and gently closes the door behind her. Constanze, her anger not yet abated, turns her attention to Leopold just as a hand, adorned with a distinguished gold signet ring belonging to Salieri, enters the frame offering her a plate of sugared biscuits. In a gesture of goodwill, Salieri hands her a pile of coins, which she accepts with delight. Suddenly, the music takes on a lively quality, and the door to the house dramatically swings open. A grand forte-piano, enhanced with a pedal, is carried out by a group of six men. They move swiftly, rushing it down the street. Reacting to this, Wolfgang, Constanze, and Leopold, all elegantly dressed for an occasion, promptly step into a waiting carriage. The carriage, with its passengers now aboard, follows closely after the men who have taken the forte-piano. With the departure of the carriage, Lorl reappears in the doorway. She cautiously peers around to ensure that they have indeed gone out of sight before closing the door quietly and hurrying off in the opposite direction. The scene shifts to an open-air concert, where an outdoor performance is underway. Mozart stands at the helm, leading the orchestra as they render the final movement of his E-flat concerto. The sizable audience, among which are the Emperor, flanked by Strack and Von Swieten, listens intently. The crowd exudes appreciation and delight, enchanted by the music in this beautiful open-air setting. Amidst the spectators, Leopold and Constanze are also attentive to Mozart's impressive performance, which he delivers with remarkable brilliance. Meanwhile, a carriage is seen making its way through the streets, the sound of its hooves clopping against the cobblestones. Seated beside the driver on the box is Lorl, while inside, the figure of Salieri is glimpsed, hidden from plain sight. Mozart continues to conduct and play with a reflective demeanor as Lorl opens a door, allowing Salieri to enter the scene. Together, they go inside, and the door closes behind them, revealing a tidier room. This newfound orderliness is a testament to Lorl's diligent ministrations. Inside, Salieri stands with an air of intense curiosity, surveying his surroundings as Lorl moves to open a drawer in a sideboard. Inside the drawer lies a gold snuff box, the very one that was presented to Mozart as a child during his visit to the Vatican. As Lorl gestures across the room, Salieri's attention is directed to the workroom, to which he proceeds alone, intrigued by what he might discover there."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Salieri sits at a desk cluttered with manuscripts while Mozart, immersed in the creative process, listens to the closing ensemble from Act IV of Figaro and alternates between playing billiards and jotting down notes. Mozart emerges to meet Lorl, the maid, at the doorway, as Leopold observes from his bedroom. Constanze joins them, exchanging a tense moment with Leopold and Lorl before Lorl exits. Salieri's hand appears, offering Constanze sugared biscuits and a pile of coins, which she accepts with delight. As lively music plays, six men carry a grand forte-piano out of the house and run off down the street. Wolfgang, Constanze, and Leopold, dressed for an occasion, follow in a carriage. Once they leave, Lorl watches to ensure they are out of sight before hurrying off in the opposite direction. Mozart performs in an outdoor concert attended by an appreciative audience, including the Emperor, Strack, and Von Swieten. Meanwhile, Lorl rides on a carriage beside the driver, with Salieri glimpsed inside as he arrives at a tidier room, thanks to Lorl's efforts. Salieri inspects the room with curiosity as Lorl reveals a drawer containing a gold snuff box once given to Mozart at the Vatican, leading Salieri to continue alone into the workroom."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Salieri sits at his desk, which is littered with manuscripts, a testament to his prolific nature and dedication to music composition in the competitive world of 18th-century Vienna. In the middle stands a billiard table, symbolizing the leisure activity popular among the upper classes at the time, and the beautiful closing ensemble from Act IV of Figaro, \"Ah, Tutti contenti! Saremo cosi,\" infuses the room with the genius of Mozart's opera, first performed in 1786. Standing at the billiard table, Mozart dreamily hears the music while playing shots on the table, a game that reportedly helped him relax and think creatively. From time to time, he drifts over to a piece of manuscript paper and jots down notes, capturing fleeting inspirations. He is in his own world of composition, with the billiard balls aiding his creativity through their rhythmic sounds. Mozart comes out, and framed in the doorway from outside stands Lorl, the maid known for her discreetness and efficiency noticed in Salieri's house. From his bedroom, Leopold, Mozart's father and a critical influence in his life, peeps out to watch. Mozart goes to the girl, then Constanze follows, his wife who often supported his work amidst personal and financial challenges. The old man emerges from his bedroom, and Constanze looks furiously at him, then at Lorl, perhaps questioning their intentions. Lorl goes outside and closes the door. Constanze turns on Leopold, and a hand comes into frame offering a plate of sugared biscuits, a popular treat of the era. On its finger is the gold signet ring belonging to Salieri, who hands her a pile of coins, possibly indicating a secretive agreement or transaction. She accepts them, delighted. To lively music, the door of the house bursts open, and a grand forte-piano, a precursor to the modern piano and known for its dynamic range, augmented with a pedal is carried out by six men who run off with it down the street. Immediately, Wolfgang, Constanze, and Leopold, all dressed for an occasion such as a musical performance, climb into a waiting carriage that drives off after the forte-piano, a critical instrument for Mozart's compositions. As soon as it goes, Lorl appears in the doorway, peering slyly around to see that they are out of sight, then she shuts the door and hurries off in the opposite direction, fueling suspicions about her role. An outdoor concert is being given where Mozart, celebrated as one of history's greatest composers, is playing the final movement of his E-flat concerto with an orchestra. A sizable audience listens to him, including the Emperor Joseph II, a patron of the arts who greatly influenced Vienna's cultural life, flanked by Strack, the court's chamberlain, and Von Swieten, a diplomat and Mozart enthusiast. The crowd is happy and appreciative in a delightful open-air scene, enjoying the maestro's brilliance. Leopold and Constanze listen to Mozart, who plays his work brilliantly, showcasing his unparalleled talent. A carriage clops through the streets with Lorl sitting up on the box beside the driver, perhaps on another errand or assignment related to Salieri. Inside the vehicle, the figure of Salieri is glimpsed, suggesting covert involvement in the day's events. Mozart is conducting and playing in a reflective mood as Lorl opens the door, admitting Salieri. They go in, and the door shuts. The room is considerably tidier due to Lorl's ministrations, befitting someone in service to a notable composer. Salieri stands looking around with tremendous curiosity as she opens a drawer in a sideboard where we see a gold snuff box, the one presented to Mozart as a child in the Vatican, an honor marking his early recognition as a musical prodigy. Salieri turns to look around as she points across the room to the workroom, where Salieri crosses alone, perhaps contemplating the genius of the man whose music he admires and competes with."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "To lively music the door of the house bursts open and a grand fortepiano augmented with a pedal is carried out by six men who run off with it down the street Salieri sits at his desk which is littered with manuscripts from outside stands Lorl the maid noticed in Salieri's house In the middle stands a billiard table and the beautiful closing ensemble from Act IV of Figaro Ah Tutti contenti Saremo cosi plays in the background Standing at the billiard table Mozart dreamily hears the music while playing shots on the table From time to time he drifts over to a piece of manuscript paper and jots down notes He is in his own world of composition with the billiard balls aiding his creativity Mozart comes out and framed in the doorway then at Lorl from outside stands Lorl the maid noticed in Salieri's house From his bedroom Leopold peeps out to watch Mozart goes to the girl Mozart is conducting and playing in a reflective mood as Lorl opens the door admitting Salieri then Constanze follows Saremo cosi plays in the background The old man emerges from his bedroom and Constanze looks furiously at him Mozart comes out and framed in the doorway Ah Tutti contenti In the middle stands a billiard table and the beautiful closing ensemble from Act IV of Figaro Leopold and Constanze listen to Mozart who plays his work brilliantly then at Lorl Lorl goes outside and closes the door Constanze turns on Leopold and a hand comes into frame offering a plate of sugared biscuits On its finger is the gold signet ring belonging to Salieri who hands her a pile of coins She accepts them delighted To lively music the door of the house bursts open and a grand fortepiano augmented with a pedal is carried out by six men who run off with it down the street Salieri sits at his desk which is littered with manuscripts Immediately Wolfgang Constanze and Leopold all dressed for an occasion climb into a waiting carriage that drives off after the fortepiano As soon as it goes Lorl appears in the doorway peering slyly around to see that they are out of sight then she shuts the door and hurries off in the opposite direction The room is considerably tidier due to Lorl's ministrations then she shuts the door and hurries off in the opposite direction An outdoor concert is being given where Mozart is playing the final movement of his Eflat concerto with an orchestra A sizable audience listens to him including the Emperor flanked by Strack and Von Swieten The crowd is happy and appreciative in a delightful openair scene Leopold and Constanze listen to Mozart who plays his work brilliantly A carriage clops through the streets with Lorl sitting up on the box beside the driver Inside the vehicle the figure of Salieri is glimpsed Mozart is conducting and playing in a reflective mood as Lorl opens the door admitting Salieri They go in and the door shuts She accepts them delighted Standing at the billiard table Mozart dreamily hears the music while playing shots on the table A sizable audience listens to him including the Emperor flanked by Strack and Von Swieten The room is considerably tidier due to Lorl's ministrations Salieri stands looking around with tremendous curiosity as she opens a drawer in a sideboard where we see a gold snuff box the one presented to Mozart as a child in the Vatican Salieri turns to look around as she points across the room to the workroom where Salieri crosses alone Salieri stands looking around with tremendous curiosity as she opens a drawer in a sideboard where we see a gold snuff box the one presented to Mozart as a child in the Vatican Salieri turns to look around as she points across the room to the workroom where Salieri crosses alone"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Salieri sits at his desk which is littered with manuscripts. In the middle stands a billiard table and the beautiful closing ensemble from Act IV of Figaro. Ah Tutti contenti. Saremo cosi plays in the background. Standing at the billiard table Mozart dreamily hears the music while playing shots on the table. From time to time he drifts over to a piece of manuscript paper and jots down notes. He is in his own world of composition with the billiard balls aiding his creativity. Mozart comes out and framed in the doorway. from outside stands Lorl the maid noticed in Salieri's house. From his bedroom Leopold peeps out to watch. Mozart goes to the girl. then Constanze follows. The old man emerges from his bedroom and Constanze looks furiously at him. then at Lorl. Lorl goes outside and closes the door. Constanze turns on Leopold and a hand comes into frame offering a plate of sugared biscuits. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. On its finger is the gold signet ring belonging to Salieri who hands her a pile of coins. She accepts them delighted. To lively music the door of the house bursts open and a grand fortepiano augmented with a pedal is carried out by six men who run off with it down the street. Immediately Wolfgang Constanze and Leopold all dressed for an occasion climb into a waiting carriage that drives off after the fortepiano. As soon as it goes Lorl appears in the doorway peering slyly around to see that they are out of sight. then she shuts the door and hurries off in the opposite direction. An outdoor concert is being given where Mozart is playing the final movement of his Eflat concerto with an orchestra. A sizable audience listens to him including the Emperor flanked by Strack and Von Swieten. The crowd is happy and appreciative in a delightful openair scene. Leopold and Constanze listen to Mozart who plays his work brilliantly. A carriage clops through the streets with Lorl sitting up on the box beside the driver. Inside the vehicle the figure of Salieri is glimpsed. Mozart is conducting and playing in a reflective mood as Lorl opens the door admitting Salieri. They go in and the door shuts. The room is considerably tidier due to Lorl's ministrations. Salieri stands looking around with tremendous curiosity as she opens a drawer in a sideboard where we see a gold snuff box the one presented to Mozart as a child in the Vatican. Salieri turns to look around as she points across the room to the workroom where Salieri crosses alone."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Salieri sits at his desk which is littered with manuscripts. In the middle stands a billiard table and the beautiful closing ensemble from Act IV of Figaro. Ah Tutti contenti. Saremo cosi plays in the background. Standing at the billiard table Mozart dreamily hears the music while playing shots on the table. From time to time he drifts over to a piece of manuscript paper and jots down notes. He is in his own world of composition with the billiard balls aiding his creativity. Mozart comes out and framed in the doorway. from outside stands Lorl the maid noticed in Salieri's house. From his bedroom Leopold peeps out to watch. Mozart goes to the girl. then Constanze follows. The old man emerges from his bedroom and Constanze looks furiously at him. then at Lorl. Lorl goes outside and closes the door. Constanze turns on Leopold and a hand comes into frame offering a plate of sugared biscuits. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On its finger is the gold signet ring belonging to Salieri who hands her a pile of coins. She accepts them delighted. To lively music the door of the house bursts open and a grand fortepiano augmented with a pedal is carried out by six men who run off with it down the street. Immediately Wolfgang Constanze and Leopold all dressed for an occasion climb into a waiting carriage that drives off after the fortepiano. As soon as it goes Lorl appears in the doorway peering slyly around to see that they are out of sight. then she shuts the door and hurries off in the opposite direction. An outdoor concert is being given where Mozart is playing the final movement of his Eflat concerto with an orchestra. A sizable audience listens to him including the Emperor flanked by Strack and Von Swieten. The crowd is happy and appreciative in a delightful openair scene. Leopold and Constanze listen to Mozart who plays his work brilliantly. A carriage clops through the streets with Lorl sitting up on the box beside the driver. Inside the vehicle the figure of Salieri is glimpsed. Mozart is conducting and playing in a reflective mood as Lorl opens the door admitting Salieri. They go in and the door shuts. The room is considerably tidier due to Lorl's ministrations. Salieri stands looking around with tremendous curiosity as she opens a drawer in a sideboard where we see a gold snuff box the one presented to Mozart as a child in the Vatican. Salieri turns to look around as she points across the room to the workroom where Salieri crosses alone."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Salieri sits at his desk which is littered with manuscripts. In the middle stands a billiard table and the beautiful closing ensemble from Act IV of Figaro. Ah Tutti contenti. Saremo cosi plays in the background. Standing at the billiard table Mozart dreamily hears the music while playing shots on the table. From time to time he drifts over to a piece of manuscript paper and jots down notes. He is in his own world of composition with the billiard balls aiding his creativity. Mozart comes out and framed in the doorway. The crowd is happy and appreciative in a delightful openair scene. Leopold and Constanze listen to Mozart who plays his work brilliantly. A carriage clops through the streets with Lorl sitting up on the box beside the driver. Inside the vehicle the figure of Salieri is glimpsed. Mozart is conducting and playing in a reflective mood as Lorl opens the door admitting Salieri. They go in and the door shuts. The room is considerably tidier due to Lorl's ministrations. Salieri stands looking around with tremendous curiosity as she opens a drawer in a sideboard where we see a gold snuff box the one presented to Mozart as a child in the Vatican. Salieri turns to look around as she points across the room to the workroom where Salieri crosses alone."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Salieri sits at his desk which is littered with manuscripts. In the middle stands a billiard table and the beautiful closing ensemble from Act IV of Figaro. Ah Tutti contenti. They go in and the door shuts. The room is considerably tidier due to Lorl's ministrations. Salieri stands looking around with tremendous curiosity as she opens a drawer in a sideboard where we see a gold snuff box the one presented to Mozart as a child in the Vatican. Salieri turns to look around as she points across the room to the workroom where Salieri crosses alone."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Salieri sits at his desk, which is littered with manuscripts. In the middle stands a billiard table, and the beautiful closing ensemble from Act IV of Figaro, \"Ah, Tutti contenti! Saremo cosi,\" plays in the background. Standing at the billiard table, the dolphin dreamily hears the music while playing shots on the table. From time to time, the dolphin drifts over to a piece of manuscript paper and jots down notes. The dolphin is in its own world of composition, with the billiard balls aiding its creativity. The dolphin comes out, and framed in the doorway from outside stands the gardener, the maid noticed in Salieri's house. From his bedroom, the zebra peeps out to watch. The dolphin goes to the girl, then the parrot follows. The old zebra emerges from his bedroom, and the parrot looks furiously at the zebra, then at the gardener. The gardener goes outside and closes the door. The parrot turns on the zebra, and a hand comes into frame offering a plate of sugared biscuits. On its finger is the gold signet ring belonging to the elephant, who hands the parrot a pile of coins. The parrot accepts them, delighted. To lively music, the door of the house bursts open, and a grand forte-piano augmented with a pedal is carried out by six horses who run off with it down the street. Immediately, the horse, the parrot, and the zebra, all dressed for an occasion, climb into a waiting carriage that drives off after the forte-piano. As soon as it goes, the gardener appears in the doorway, peering slyly around to see that they are out of sight, then the gardener shuts the door and hurries off in the opposite direction. An outdoor concert is being given where the dolphin is playing the final movement of its E-flat concerto with an orchestra. A sizable audience listens to the dolphin, including the penguin, flanked by the rabbit and the owl. The crowd is happy and appreciative in a delightful open-air scene. The zebra and the parrot listen to the dolphin, who plays its work brilliantly. A carriage clops through the streets with the gardener sitting up on the box beside the driver. Inside the vehicle, the figure of the elephant is glimpsed. The dolphin is conducting and playing in a reflective mood as the gardener opens the door, admitting the elephant. They go in, and the door shuts. The room is considerably tidier due to the gardener's ministrations. The elephant stands looking around with tremendous curiosity as the gardener opens a drawer in a sideboard where we see a gold snuff box, the one presented to the dolphin as a child in the Vatican. The elephant turns to look around as the gardener points across the room to the workroom, where the elephant crosses alone."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Salieri sits at his bench, which is littered with blueprints. In the middle stands a foosball table, and the beautiful closing ensemble from Act IV of Figaro, \"Ah, Tutti contenti! Saremo cosi,\" plays in the background. Standing at the foosball table, Mozart dreamily hears the music while playing shots on the table. From time to time, he drifts over to a piece of parchment and jots down notes. He is in his own world of composition, with the foosball players aiding his creativity. Mozart comes out, and framed in the doorway from outside stands Lorl, the gardener noticed in Salieri's house. From his lounge, Leopold peeps out to watch. Mozart goes to the girl, then Constanze follows. The old man emerges from his lounge, and Constanze looks furiously at him, then at Lorl. Lorl goes outside and closes the gate. Constanze turns on Leopold, and a hand comes into frame offering a bowl of candied fruit. On its finger is the gold signet band belonging to Salieri, who hands her a pile of jewels. She accepts them, delighted. To lively music, the gate of the house bursts open, and a grand harp augmented with a pedal is carried out by six men who run off with it down the street. Immediately, Wolfgang, Constanze, and Leopold, all dressed for an occasion, climb into a waiting rickshaw that drives off after the harp. As soon as it goes, Lorl appears in the doorway, peering slyly around to see that they are out of sight, then she shuts the gate and hurries off in the opposite direction. An outdoor concert is being given where Mozart is playing the final movement of his E-flat sonata with a symphony. A sizable audience listens to him, including the Emperor, flanked by Strack and Von Swieten. The crowd is happy and appreciative in a delightful open-air scene. Leopold and Constanze listen to Mozart, who plays his work brilliantly. A rickshaw clops through the streets with Lorl sitting up on the box beside the driver. Inside the vehicle, the figure of Salieri is glimpsed. Mozart is conducting and playing in a reflective mood as Lorl opens the gate, admitting Salieri. They go in, and the gate shuts. The room is considerably tidier due to Lorl's ministrations. Salieri stands looking around with tremendous curiosity as she opens a cabinet in a sideboard where we see a gold chalice, the one presented to Mozart as a child in the Vatican. Salieri turns to look around as she points across the room to the studio, where Salieri crosses alone."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Salieri reclines at his desk, which is cluttered with manuscripts. In the middle rises a billiard table, and the beautiful closing ensemble from Act IV of Figaro, \"Ah, Tutti contenti! Saremo cosi,\" resonates in the background. Standing at the billiard table, Mozart thoughtfully observes the music while tossing dice on the table. Occasionally, he wanders over to a piece of manuscript paper and sketches notes. He is in his own realm of composition, with the billiard balls sparking his creativity. Mozart steps out, and framed in the doorway from outside appears Lorl, the maid mentioned in Salieri's house. From his bedroom, Leopold peers out to observe. Mozart approaches the girl, then Constanze trails after him. The old man strolls out from his bedroom, and Constanze glares furiously at him, then at Lorl. Lorl steps outside and seals the door. Constanze confronts Leopold, and a hand enters the frame offering a plate of sugared biscuits. On its finger is the gold signet ring belonging to Salieri, who presents her with a heap of coins. She receives them, thrilled. To lively music, the door of the house flings open, and a grand forte-piano enhanced with a pedal is whisked out by six men who dash off with it down the street. Instantly, Wolfgang, Constanze, and Leopold, all dressed for an occasion, hop into a waiting carriage that rolls off after the forte-piano. As soon as it departs, Lorl pops into the doorway, glancing slyly around to ensure they are out of sight, then she secures the door and scurries off in the opposite direction. An outdoor concert is taking place where Mozart is performing the final movement of his E-flat concerto with an orchestra. A sizable audience listens to him, including the Emperor, flanked by Strack and Von Swieten. The crowd is cheerful and appreciative in a delightful open-air scene. Leopold and Constanze hear Mozart, who performs his work brilliantly. A carriage jingles through the streets with Lorl perched up on the box beside the driver. Inside the vehicle, the figure of Salieri is glimpsed. Mozart is orchestrating and performing in a thoughtful mood as Lorl unbolts the door, admitting Salieri. They step in, and the door latches. The room is considerably neater due to Lorl's efforts. Salieri pauses looking around with tremendous curiosity as she unveils a drawer in a sideboard where we catch sight of a gold snuff box, the one presented to Mozart as a child in the Vatican. Salieri twists to look around as she gestures across the room to the workroom, where Salieri ventures alone."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Vivaldi lounges at his hammock, which is covered with blueprints. In the middle stands a dart board, and the magnificent opening sonata from Act II of Don Giovanni, \"Oh, Everyone rejoice! We shall be,\" echoes in the background. Surrounding the dart board, Beethoven dreamily absorbs the melody while throwing darts at the board. Occasionally, he strolls over to a sheet of parchment and scribbles notes. He is in his own realm of invention, with the darts spurring his imagination. Beethoven emerges, and silhouetted in the doorway from outside stands Clara, the gardener glimpsed in Vivaldi's garden. From his attic, Sebastian peeks out to observe. Beethoven approaches the woman, then Liszt follows. The young woman steps from his attic, and Liszt glares angrily at him, then at Clara. Clara exits and shuts the gate. Liszt turns on Sebastian, and a spoon comes into view offering a platter of candied almonds. On its handle is the silver insignia ring belonging to Vivaldi, who presents her a stack of gems. She accepts them, thrilled. To spirited music, the gate of the garden flings open, and a grand organ enhanced with a pedal is carried out by seven sailors who dash off with it down the lane. Instantly, Ludwig, Liszt, and Sebastian, all attired for an event, climb into a waiting sleigh that speeds off after the organ. Once it departs, Clara appears in the portal, peering craftily around to confirm they are out of sight, then she locks the gate and scuttles off in the other direction. An outdoor spectacle is being held where Beethoven is playing the final encore of his C major sonata with a symphony. A large congregation listens to him, including the Duke, accompanied by Wagner and Von Goethe. The assemblage is content and admiring in a charming outdoor setting. Sebastian and Liszt listen to Beethoven, who performs his piece superbly. A sleigh clatters through the lanes with Clara perched up on the bench beside the coachman. Inside the cart, the outline of Vivaldi is glimpsed. Beethoven is leading and performing in a contemplative state as Clara flings open the gate, admitting Vivaldi. They enter, and the gate shuts. The garden is much neater due to Clara's tidying efforts. Vivaldi stands gazing around with immense interest as she reveals a compartment in a side table where we observe a silver pocket watch, the one gifted to Beethoven as a prodigy in the chapel. Vivaldi turns to gaze about as she gestures across the garden to the study, where Vivaldi strolls alone."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Bach sprawls at his easel, which is cluttered with blueprints. In the center lies a chessboard, and the exquisite opening symphony from Act II of Don Giovanni, \"Deh, vieni alla finestra,\" hums in the background. Sitting at the chessboard, Beethoven absentmindedly smells the air while arranging pieces on the board. Occasionally, he floats over to a sketchpad and sketches designs. He is in his own realm of artistry, with the chess pieces spurring his inventiveness. Beethoven enters, and outlined in the doorway from within stands Anna, the gardener glimpsed in Bach's studio. From the dining room, Franz peeks out to observe. Beethoven approaches the boy, then Clara trails. The youth steps out of his dining room, and Clara gazes angrily at him, then at Anna. Anna goes inside and opens the window. Clara pivots on Franz, and a hand appears in view offering a tray of candied fruits. On its finger is the silver signet ring belonging to Bach, who presents her with a handful of marbles. She takes them, thrilled. To cheerful tunes, the window of the studio flies open, and an elegant harpsichord enhanced with a metronome is wheeled out by four women who sprint off with it down the alley. Immediately, Ludwig, Clara, and Franz, all dressed for a festivity, hop into a waiting wagon that rolls off after the harpsichord. As soon as it departs, Anna pops up in the window, peering sneakily around to ensure they are out of view, then she latches the window and dashes off in the opposite path. An indoor recital is ongoing where Beethoven is performing the initial movement of his G-major symphony with a quartet. A vast audience listens to him, including the King, flanked by Haydn and Mendelssohn. The gathering is content and thankful in an enchanting indoor setting. Franz and Clara listen to Beethoven, who performs his symphony excellently. A carriage trots through the countryside with Anna sitting up on the platform beside the conductor. Inside the vehicle, the silhouette of Bach is spotted. Beethoven is orchestrating and performing in a pensive spirit as Anna opens the window, admitting Bach. They step in, and the window closes. The attic is noticeably more organized thanks to Anna's efforts. Bach stands glancing around with immense wonder as she unlatches a cupboard in a sideboard where we glimpse a silver cigar case, the one awarded to Beethoven as a youth in Vienna. Bach rotates to gaze around as she gestures across the room to the art studio, where Bach strolls unaccompanied."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Salieri perches at his easel, which is scattered with blueprints. In the middle stands a ping-pong table, and the enchanting opening waltz from Act IV of Figaro, \"Ah, Tutti contenti! Saremo cosi,\" plays in the background. Standing at the ping-pong table, Mozart dreamily feels the melody while tossing darts at the board. Occasionally, he floats over to a piece of blueprint paper and sketches down doodles. He is in his own world of sculpture, with the ping-pong paddles aiding his creativity. Mozart emerges, and framed in the doorway from outside stands Lorl, the gardener mentioned in Salieri's library. From his attic, Leopold peeks out to observe. Mozart approaches the woman, then Constanze trails. The elderly man steps out from his attic, and Constanze glares intensely at him, then at Lorl. Lorl heads outdoors and latches the gate. Constanze pivots on Leopold, and a hand enters frame offering a bowl of candied almonds. On its finger is the silver signet ring belonging to Salieri, who offers her a stack of pebbles. She takes them, thrilled. To spirited music, the gate of the courtyard flies open, and a grand harp augmented with a foot pedal is carried away by six men who sprint off with it down the lane. Instantly, Wolfgang, Constanze, and Leopold, all garbed for an event, leap into a waiting chariot that rides off after the harp. As soon as it departs, Lorl appears in the gateway, glancing cunningly around to confirm they are out of view, then she secures the gate and dashes off in the opposite direction. An outdoor recital is being held where Mozart is playing the final motif of his E-flat sonata with a band. A large audience enjoys his performance, including the Emperor, flanked by Strack and Von Swieten. The crowd is elated and enthusiastic in a charming alfresco setting. Leopold and Constanze listen to Mozart, who performs his piece splendidly. A wagon clatters through the streets with Lorl perched up on the bench beside the operator. Inside the vehicle, the form of Salieri is glimpsed. Mozart is orchestrating and playing in a contemplative mood as Lorl unlocks the window, admitting Salieri. They step inside, and the window closes. The chamber is significantly neater due to Lorl's endeavors. Salieri stands surveying with immense interest as she unlocks a compartment in a bookshelf where we see a silver cigar case, the one presented to Mozart as a child in the monastery. Salieri turns to scan around as she gestures across the room to the studio, where Salieri proceeds alone."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Balthazar lounges in the hammock, which is cluttered with sketches. In the center stands a ping pong table, and the stunning opening duet from Act II of Macbeth, \"Oh, tutti felici! Saremo qui,\" echoes in the background. Resting at the ping pong table, Beethoven dreamily perceives the melody while executing serves at the table. Occasionally, he glides over to a doodle pad and scribbles doodles. He is in his own realm of design, with the ping pong paddles boosting his imagination. Beethoven steps in, and framed in the window from outside stands Yara, the gardener spotted in Balthazar's cabin. From the attic, Archibald peers out to observe. Beethoven approaches the woman, then Helena follows. The elderly fellow exits from his attic, and Helena glares angrily at him, then at Yara. Yara heads outdoors and latches the gate. Helena pivots on Archibald, and a foot enters frame offering a basket of salted pretzels. On its toe is the silver pendant belonging to Balthazar, who grants her a stack of jewels. She receives them, thrilled. To spirited tunes, the gate of the mansion swings open, and a grand harpsichord equipped with a crank is hauled out by four cats who bounce away with it up the alley. Instantly, Wolfgang, Helena, and Archibald, all attired for a festivity, board a waiting gondola that glides off after the harpsichord. As soon as it departs, Yara emerges in the window, gazing mischievously around to ensure they are out of view, then she bolts the gate and rushes off in the reverse direction. An indoor recital is held where Beethoven is performing the initial movement of his G-major symphony with an ensemble. A large audience enjoys his music, including the Duke, flanked by Meyer and Von Stein. The people are content and admiring in a charming indoor spectacle. Archibald and Helena enjoy Beethoven, who delivers his piece magnificently. A wagon clatters through the avenues with Yara perched on the roof next to the coachman. Inside the carriage, the shadow of Balthazar is sighted. Beethoven is orchestrating and performing in a pensive mood as Yara swings the gate open, allowing Balthazar to enter. They head in, and the gate closes. The chamber is significantly neater due to Yara's upkeep. Balthazar stands observing with immense curiosity as she slides open a compartment in a side table where we glimpse a silver locket, the one gifted to Beethoven as a youth in Paris. Balthazar swivels to survey as she gestures across the chamber to the studio, where Balthazar treads solo."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Salieri sits at his cluttered desk while the closing ensemble from Act IV of Figaro plays. Mozart is immersed in composition, playing billiards to inspire creativity. Lorl, the maid from Salieri's house, appears, prompting reactions from Constanze and Leopold. Lorl leaves, receiving coins from Salieri, while Mozart's forte-piano is carried away by six men. The family, dressed for an occasion, follows in a carriage. At an outdoor concert, Mozart performs his E-flat concerto to a delighted audience, including the Emperor. Lorl, in a carriage with Salieri, returns to the tidier room. She shows him a gold snuff box from Mozart's childhood in the Vatican, leading Salieri to the workroom."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Salieri turns to look around as she points across the room to the workroom where Salieri crosses alone Salieri stands looking around with tremendous curiosity as she opens a drawer in a sideboard where we see a gold snuff box the one presented to Mozart as a child in the Vatican The room is considerably tidier due to Lorl's ministrations They go in and the door shuts Mozart is conducting and playing in a reflective mood as Lorl opens the door admitting Salieri Inside the vehicle the figure of Salieri is glimpsed A carriage clops through the streets with Lorl sitting up on the box beside the driver Leopold and Constanze listen to Mozart who plays his work brilliantly The crowd is happy and appreciative in a delightful openair scene A sizable audience listens to him including the Emperor flanked by Strack and Von Swieten An outdoor concert is being given where Mozart is playing the final movement of his Eflat concerto with an orchestra then she shuts the door and hurries off in the opposite direction As soon as it goes Lorl appears in the doorway peering slyly around to see that they are out of sight Immediately Wolfgang Constanze and Leopold all dressed for an occasion climb into a waiting carriage that drives off after the fortepiano To lively music the door of the house bursts open and a grand fortepiano augmented with a pedal is carried out by six men who run off with it down the street She accepts them delighted On its finger is the gold signet ring belonging to Salieri who hands her a pile of coins Constanze turns on Leopold and a hand comes into frame offering a plate of sugared biscuits Lorl goes outside and closes the door then at Lorl The old man emerges from his bedroom and Constanze looks furiously at him then Constanze follows Mozart goes to the girl From his bedroom Leopold peeps out to watch from outside stands Lorl the maid noticed in Salieri's house Mozart comes out and framed in the doorway He is in his own world of composition with the billiard balls aiding his creativity From time to time he drifts over to a piece of manuscript paper and jots down notes Standing at the billiard table Mozart dreamily hears the music while playing shots on the table Saremo cosi plays in the background Ah Tutti contenti In the middle stands a billiard table and the beautiful closing ensemble from Act IV of Figaro Salieri sits at his desk which is littered with manuscripts"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Inside the vehicle the figure of Salieri is glimpsed From time to time he drifts over to a piece of manuscript paper and jots down notes then Constanze follows On its finger is the gold signet ring belonging to Salieri who hands her a pile of coins A carriage clops through the streets with Lorl sitting up on the box beside the driver The old man emerges from his bedroom and Constanze looks furiously at him As soon as it goes Lorl appears in the doorway peering slyly around to see that they are out of sight Constanze turns on Leopold and a hand comes into frame offering a plate of sugared biscuits Mozart goes to the girl Lorl goes outside and closes the door Immediately Wolfgang Constanze and Leopold all dressed for an occasion climb into a waiting carriage that drives off after the fortepiano An outdoor concert is being given where Mozart is playing the final movement of his Eflat concerto with an orchestra From his bedroom Leopold peeps out to watch They go in and the door shuts The crowd is happy and appreciative in a delightful openair scene He is in his own world of composition with the billiard balls aiding his creativity Leopold and Constanze listen to Mozart who plays his work brilliantly Salieri sits at his desk which is littered with manuscripts Salieri stands looking around with tremendous curiosity as she opens a drawer in a sideboard where we see a gold snuff box the one presented to Mozart as a child in the Vatican then at Lorl To lively music the door of the house bursts open and a grand fortepiano augmented with a pedal is carried out by six men who run off with it down the street Ah Tutti contenti She accepts them delighted then she shuts the door and hurries off in the opposite direction Saremo cosi plays in the background The room is considerably tidier due to Lorl's ministrations Standing at the billiard table Mozart dreamily hears the music while playing shots on the table Mozart is conducting and playing in a reflective mood as Lorl opens the door admitting Salieri Salieri turns to look around as she points across the room to the workroom where Salieri crosses alone from outside stands Lorl the maid noticed in Salieri's house A sizable audience listens to him including the Emperor flanked by Strack and Von Swieten In the middle stands a billiard table and the beautiful closing ensemble from Act IV of Figaro Mozart comes out and framed in the doorway"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She accepts them delighted To lively music the door of the house bursts open and a grand fortepiano augmented with a pedal is carried out by six men who run off with it down the street Immediately Wolfgang Constanze and Leopold all dressed for an occasion climb into a waiting carriage that drives off after the fortepiano As soon as it goes Lorl appears in the doorway peering slyly around to see that they are out of sight then she shuts the door and hurries off in the opposite direction An outdoor concert is being given where Mozart is playing the final movement of his Eflat concerto with an orchestra A sizable audience listens to him including the Emperor flanked by Strack and Von Swieten The crowd is happy and appreciative in a delightful openair scene Leopold and Constanze listen to Mozart who plays his work brilliantly A carriage clops through the streets with Lorl sitting up on the box beside the driver Inside the vehicle the figure of Salieri is glimpsed Mozart is conducting and playing in a reflective mood as Lorl opens the door admitting Salieri They go in and the door shuts The room is considerably tidier due to Lorl's ministrations Salieri stands looking around with tremendous curiosity as she opens a drawer in a sideboard where we see a gold snuff box the one presented to Mozart as a child in the Vatican Salieri turns to look around as she points across the room to the workroom where Salieri crosses alone Salieri sits at his desk which is littered with manuscripts In the middle stands a billiard table and the beautiful closing ensemble from Act IV of Figaro Ah Tutti contenti Saremo cosi plays in the background Standing at the billiard table Mozart dreamily hears the music while playing shots on the table From time to time he drifts over to a piece of manuscript paper and jots down notes He is in his own world of composition with the billiard balls aiding his creativity Mozart comes out and framed in the doorway from outside stands Lorl the maid noticed in Salieri's house From his bedroom Leopold peeps out to watch Mozart goes to the girl then Constanze follows The old man emerges from his bedroom and Constanze looks furiously at him then at Lorl Lorl goes outside and closes the door Constanze turns on Leopold and a hand comes into frame offering a plate of sugared biscuits On its finger is the gold signet ring belonging to Salieri who hands her a pile of coins"
        }
      ]
    }
  ]
}