{
  "ground_truth": "They pause and Norman pauses. Norman walks past Sam, giving him a quick, disapproving glance, goes onto the porch and into the office. Sam and Lila follow Norman. Norman crosses to the desk, goes behind it, and takes the key to cabin number twelve off the keyboard. By this time, Sam and Lila have entered and are almost to the desk-counter. Sam scans the counter, looking for a registration book. Lila moves closer and studies the book as Sam signs in. When Sam has finished, he closes the book and hands it back to Norman. As he starts for the door, Sam laughs. Norman stops, turns, and looks at him. Sam smiles, takes a bill out of his pocket. Norman reluctantly goes behind the counter, lays down the key to cabin twelve, takes a receipt book out of the drawer under the counter, and starts to write. Lila steps to the desk, picks up the key quickly, and starts out. Norman looks up and gazes at her as she goes out the door. Lila comes along the porch, pauses before cabin one, and tries the door. It opens. She closes it quickly as she hears Sam and Norman coming out of the motel office and continues down the porch. Sam considers a moment, nods agreement, and rises. He goes to the door, opens it slightly, looks out, then back to Lila. Lila goes to the door. He holds it open, and she goes out. Sam closes the door, joins Lila, and takes her hand. Together, they walk along the porch toward Cabin One. They pause before the door of Cabin One. Sam motions Lila to wait and hold still, then goes on to the office, opens the door, and calls in. Sam lifts the piece of paper off her finger, studies it, takes out his wallet, presses the wet scrap to his driver's license shield, puts it back in the wallet, and puts the wallet away. She starts out of the bathroom. Sam takes hold of her arm and stops her. Lila nods quickly, hurries to the door. Sam gets to it first, opens it a slight crack, looks out, then opens it wide enough for Lila and himself to pass through. Lila comes out, turns to her left, and goes along the porch toward cabin twelve. Sam remains at the door, then turns right, heading for the path. As he passes the office, he is shocked to see Norman standing just inside the open door. Sam starts into the office. She watches Sam disappear into the office, waits until she hears the door close, then looks about for another way to reach the house.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "They halt and Norman halts. Norman strides past Sam, bestowing him a brisk, critical glance, proceeds onto the veranda and into the bureau. Sam and Lila trail Norman. Norman traverses to the table, moves behind it, and retrieves the key to lodge numeral twelve off the console. By this moment, Sam and Lila have entered and are near to the table-counter. Sam examines the counter, searching for a registration ledger. Lila approaches nearer and inspects the ledger as Sam signs in. When Sam has completed, he shuts the ledger and returns it to Norman. As he begins for the entrance, Sam chuckles. Norman halts, pivots, and gazes at him. Sam grins, extracts a note out of his pocket. Norman unwillingly goes behind the counter, places down the key to lodge twelve, takes a receipt ledger out of the drawer beneath the counter, and starts to inscribe. Lila advances to the table, seizes the key hastily, and begins out. Norman glances up and stares at her as she exits the entrance. Lila proceeds along the veranda, halts before lodge one, and tests the entrance. It unfolds. She shuts it swiftly as she perceives Sam and Norman emerging from the motel bureau and carries on down the veranda. Sam deliberates a moment, nods concurrence, and rises. He proceeds to the entrance, unfolds it slightly, gazes out, then back to Lila. Lila advances to the entrance. He holds it ajar, and she exits. Sam shuts the entrance, unites with Lila, and grasps her hand. Jointly, they stroll along the veranda toward Lodge One. They halt before the entrance of Lodge One. Sam signals Lila to remain and be still, then continues to the bureau, unfolds the entrance, and calls within. Sam elevates the scrap of paper off her finger, scrutinizes it, extracts his wallet, presses the damp fragment to his driver's license shield, places it back in the wallet, and stows the wallet away. She begins out of the washroom. Sam grasps her arm and halts her. Lila nods swiftly, rushes to the entrance. Sam reaches it first, unfolds it a narrow gap, looks out, then opens it sufficiently for Lila and himself to proceed through. Lila emerges, turns to her left, and proceeds along the veranda toward lodge twelve. Sam stays at the entrance, then veers right, proceeding for the pathway. As he strides past the bureau, he is startled to see Norman standing just inside the ajar entrance. Sam begins into the bureau. She observes Sam vanish into the bureau, waits until she hears the entrance shut, then searches for another route to reach the residence."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Paused by them and Norman was paused. Past Sam was walked by Norman, a quick, disapproving glance being given to him, onto the porch and into the office he was gone. Followed by Sam and Lila was Norman. To the desk was crossed by Norman, behind it he went, and off the keyboard the key to cabin number twelve was taken by him. By this time, the entrance had been made by Sam and Lila and to the desk-counter they almost were. Scanned by Sam was the counter, a registration book he was looking for. Moved closer and studied the book was Lila as in it was signed by Sam. Finished by Sam was the signing, the book was closed, and to Norman it was handed back by him. For the door, Sam started and a laugh he gave. Stopped by Norman was himself, around he turned, and at Sam he looked. Smiled Sam did, a bill out of his pocket was taken. Behind the counter reluctantly went Norman, down was laid the key to cabin twelve by him, out of the drawer under the counter was taken a receipt book, and to write he started. To the desk stepped Lila, the key quickly she picked up, and out she started. Up looked Norman and at her he gazed as through the door she went. Along the porch came Lila, before cabin one paused she did, and the door she tried. Opened it was. Quickly closed it was by her as Sam and Norman coming out of the motel office were heard and continued down the porch she did. Considered by Sam was a moment, agreement was nodded, and risen he was. To the door he went, opened slightly it was, looked out he did, then back at Lila. To the door went Lila. It was held open by him, and out she went. Closed by Sam was the door, joined Lila he did, and her hand he took. Together, along the porch toward Cabin One they walked. Before the door of Cabin One, they paused. Motioned by Sam was Lila to wait and hold still, then onto the office he went, the door opened, and in he called. Lifted by Sam was the piece of paper off her finger, it was studied, out his wallet was taken, pressed to his driver's license shield was the wet scrap, put back in the wallet it was, and away the wallet was put. Out of the bathroom she started. By Sam was her arm taken hold of and stopped she was. Nodded quickly did Lila, to the door she hurried. First to it got Sam, opened a slight crack it was, looked out he did, then wide it was opened enough for Lila and himself to pass through. Out came Lila, to her left she turned, and along the porch toward cabin twelve she went. At the door remained Sam, then right he turned, heading for the path. As past the office he went, shocked he was to see Norman standing just inside the open door. Into the office Sam started. Watched she did Sam disappear into the office, waited until the door closed was heard from her, then about she looked for another way to reach the house."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "They pause, and Norman does too. Norman walks by Sam with a disapproving glance, enters the porch and office. Sam and Lila follow him. Norman goes to the desk, takes the key to Cabin Twelve. Sam and Lila reach the desk. Sam searches for a registration book while Lila studies it as he signs. After signing, Sam closes the book and returns it to Norman. As he heads to the door, Sam laughs. Norman looks at him as Sam smiles and pulls out a bill. Norman reluctantly retrieves a receipt book, lays the Cabin Twelve key on the counter, and starts writing. Lila picks up the key and exits. Norman watches her leave. Lila walks along the porch, pauses at Cabin One, tries the door, and quickly closes it, hearing Sam and Norman exit the office. She continues down the porch. Sam nods, rises, and opens the door slightly, then looks back at Lila. Lila follows him out. Sam shuts the door, joins Lila, and they head toward Cabin One, where they pause. Sam signals Lila to wait, goes to the office, and calls inside. Sam lifts a paper off her finger, examines it, presses it to his driver's license in his wallet, and puts it away. She exits the bathroom, and Sam stops her, holding her arm. Lila nods and hurries to the door. Sam reaches it first, opens it slightly, checks outside, and opens it for them to pass through. Lila turns left, going toward Cabin Twelve. Sam stays at the door, then turns right to the path. Passing the office, he's shocked to see Norman inside. Sam enters the office. She waits for Sam to enter, hears the door close, and then looks for another way to reach the house."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "They pause, and Norman walks past Sam with a disapproving glance, entering the office. Sam and Lila follow. Norman takes the cabin twelve key. Sam looks for a registration book, which Lila examines as Sam signs in. After signing, Sam hands the book to Norman, laughs, and heads for the door. Sam smiles, takes out a bill; Norman reluctantly gets a receipt book, lays down the key to cabin twelve. Lila picks up the key and leaves, with Norman watching. On the porch, Lila tries cabin one’s door—it opens. She closes it quickly upon hearing Sam and Norman exit the office and continues down the porch. Sam nods, opens the door slightly, glances at Lila, and holds the door for her. Sam joins Lila, takes her hand, and they head toward Cabin One, pausing there. Sam motions Lila to wait, heads to the office, and calls in. He takes a paper from her finger, examines it, presses it to his license shield, then puts it away. Lila leaves the bathroom; Sam stops her. She nods, hurries to the door. Sam opens it slightly, checks outside, then opens it for them to exit. Lila goes toward cabin twelve, and Sam heads for the path. Passing the office, he’s shocked to see Norman inside. Sam enters the office, and Lila waits until she hears the door close, looking for another way to reach the house."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "They pause momentarily, and at the same time, Norman also comes to a halt. With a quick pace, Norman walks past Sam, casting a brief, disapproving glance in his direction, before continuing on towards the porch and then making his way into the office. Sam and Lila follow behind Norman, trailing him through the porch and into the office space. Norman strides confidently over to the desk, moves behind it, and retrieves the key for cabin number twelve from the keyboard. By this point, Sam and Lila have made their way inside the office, nearly reaching the desk-counter. Sam's eyes scan the counter carefully, searching intently for a registration book. Meanwhile, Lila draws closer to the desk, studying the book attentively as Sam proceeds to sign in. Once Sam has completed the signing process, he closes the book with a sense of finality and hands it back to Norman. As he makes his way toward the door, Sam lets out an amused laugh. This prompts Norman to pause, turn around, and glance at him. Sam responds with a smile, pulls a bill out of his pocket, and holds it out. With a touch of reluctance, Norman goes behind the counter, places the key to cabin twelve down, retrieves a receipt book from a drawer beneath the counter, and begins to write diligently. Lila steps up to the desk, swiftly picks up the key, and starts toward the exit. Norman gazes at her intently as she moves out of the door. Moving along the porch, Lila pauses momentarily before the door of cabin one, attempting to open it. As the door yields and opens, she quickly closes it upon hearing Sam and Norman emerging from the motel office, then continues her path down the porch. Sam considers the situation for a moment, nods in agreement, and rises to his feet. He approaches the door, opens it slightly to peer outside, then turns back to look at Lila. Lila proceeds to the door; Sam holds it open for her, allowing her to pass through first. Sam, then, closes the door and joins Lila, taking her hand in his own. Together, they walk along the porch toward Cabin One, where they pause thoughtfully before the door. Sam signals to Lila to wait and remain still, then proceeds alone to the office. He opens the door and calls inside. Sam delicately lifts the piece of paper from her finger, examines it closely, retrieves his wallet, presses the damp scrap against his driver's license shield, secures it back in the wallet, and tucks the wallet away. As she begins to leave the bathroom, Sam takes hold of her arm, stopping her in her tracks. Lila quickly nods, hurries over to the door, but Sam reaches it first, opening it just a crack to look outside, then widening it sufficiently for both Lila and himself to pass through. Lila steps outside, turns to her left deftly, and continues along the porch, making her way toward cabin twelve. Sam lingers momentarily at the door, then turns right, heading down the path. As he passes by the office, he is taken aback to see Norman standing just inside the open door. Sam promptly heads into the office. Observing Sam disappear into the office, she waits patiently until the sound of the door closing reaches her ears, then begins to look around, searching for another route that might lead to the house."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "They pause momentarily, and at the same concurrent point in time, Norman also brings himself to a halt. With a quick and determined pace, Norman strides past Sam, casting a brief yet noticeably disapproving glance in his direction, before proceeding on towards the inviting porch and subsequently making his way into the office area. Sam and Lila follow behind Norman, trailing him through the porch and into the office space. Norman strides confidently over to the desk, moves behind it, and retrieves the key for cabin number twelve from the nearby keyboard. By this time, Sam and Lila have made their way inside the office, nearly reaching the desk-counter. Sam's eyes scan the counter meticulously, searching intently for any sign of a registration book. Meanwhile, Lila draws closer to the desk, studying the book attentively as Sam proceeds to complete the sign-in process. Once Sam has finished signing in, he closes the book with a sense of finality and hands it back to Norman. As he makes his way toward the door, Sam lets out an amused laugh. This unexpected sound prompts Norman to pause, turn around, and glance at him. Sam responds with a smile, then pulls a bill out of his pocket and holds it out. With a touch of reluctance, Norman moves behind the counter, places the key to cabin twelve down, retrieves a receipt book from a drawer beneath the counter, and begins to write with diligence. Lila steps up to the desk, swiftly picks up the key, and starts toward the exit. Norman gazes at her intently as she moves out through the door. Moving along the porch, Lila pauses momentarily before the door of cabin one, attempting to open it. As the door yields and opens, she quickly closes it upon hearing Sam and Norman emerging vocally from the motel office, then continues her path down the porch. Sam considers the situation for a moment, nods in agreement, and rises to his feet. He approaches the door, opens it slightly to peer outside, then turns back to look at Lila. Lila proceeds to approach the door; Sam holds it open for her, allowing her to pass through first. Sam, then, closes the door behind him and joins Lila, taking her hand gently in his own. Together, they walk along the porch toward Cabin One, where they pause thoughtfully before the door. Sam signals to Lila to wait and remain still, then proceeds alone to the office. He opens the door and calls inside. Sam delicately lifts the piece of paper from her finger, examines it closely, retrieves his wallet, presses the damp scrap against his driver's license shield, secures it back in the wallet, and tucks the wallet away securely. As she begins to leave the bathroom, Sam takes hold of her arm, stopping her in her tracks. Lila quickly nods, hurries over to the door, but Sam reaches it first, opening it just a crack to look outside, then widening it sufficiently for both Lila and himself to pass through. Lila steps outside, turns to her left deftly, and continues along the porch, making her way toward cabin twelve. Sam lingers momentarily at the door, then turns right, heading down the path. As he passes by the office, he is taken aback to see Norman standing just inside the open door. Sam promptly heads into the office. Observing Sam disappear into the office, she waits patiently until the sound of the door closing reaches her ears, then begins to look around, searching for another possible route that might lead to the house."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "They come to a halt, prompting Norman to also pause momentarily. With a brief, disapproving glance at Sam, Norman proceeds to walk past him, making his way onto the porch before entering the office. Sam and Lila trail behind him with intent, following Norman's lead. As Norman approaches the desk, he moves behind it with purpose and reaches for the key to cabin number twelve, which hangs on the keyboard. Meanwhile, Sam and Lila make their way into the office, nearing the desk-counter as they synchronize their steps. Sam's eyes scan the counter, on the lookout for a registration book, while Lila steps even closer, examining the book as Sam begins to sign in. After completing the signing process, Sam closes the registration book with a satisfied motion and hands it back to Norman. As Sam starts heading for the door, an unexpected laugh escapes him, causing Norman to halt, turn around, and direct his gaze at Sam with curiosity. In response, Sam offers a smile and reaches into his pocket to pull out a bill. Although reluctant, Norman moves behind the counter once more, setting down the key to cabin twelve before retrieving a receipt book from a drawer under the counter and commencing to fill it out. Seizing the opportunity, Lila steps forward, swiftly picks up the key, and promptly heads out of the office. Norman's eyes follow her movements as she exits through the door. Lila proceeds along the porch, pausing momentarily before cabin one to test the door. Finding it unlocked, she opens and swiftly closes it upon hearing the sounds of Sam and Norman emerging from the motel office, prompting her to continue along the porch. Sam takes a moment to reflect, ultimately nodding in agreement before rising to his feet. He approaches the door, opens it slightly to glance outside, then turns back to Lila. Responding to his gesture, Lila moves toward the door, and Sam holds it open, allowing her to exit before closing it himself. Sam joins Lila, taking her hand in his, and together they walk along the porch toward Cabin One. As they arrive at the door of Cabin One, they come to a standstill. Sam signals Lila to wait patiently and remain still before advancing toward the office, opening the door, and calling inside. With a careful motion, Sam lifts a piece of paper off her finger, scrutinizes it, then retrieves his wallet, pressing the damp scrap against his driver's license shield before returning it to the wallet and putting it away. Lila exits the bathroom, but Sam halts her by gently grasping her arm. A quick nod from Lila indicates her understanding as she hastens toward the door. Sam reaches it first, opening it slightly to peer outside before widening it enough for them both to step through. Lila exits first, turning left to proceed along the porch in the direction of cabin twelve. Sam lingers briefly at the door before turning right, making his way along the path. As he passes by the office, he is taken aback to see Norman standing just inside the open doorway. Sam hesitates for a moment before deciding to enter the office. Meanwhile, she observes Sam vanishing into the office, waiting patiently until she hears the door close before casting a glance around in search of an alternative route to the house."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Norman walks past Sam with a disapproving glance and enters the office, followed by Sam and Lila. Norman retrieves the key to cabin twelve from behind the desk, while Sam and Lila approach the counter. Sam signs the registration book, hands it back to Norman, and heads for the door with a laugh, prompting Norman to stop and look at him. Sam smiles, then offers a bill as Norman reluctantly fetches a receipt book and begins writing. Meanwhile, Lila swiftly takes the key and exits. She pauses at cabin one, tests the door, finds it open, and closes it quickly upon hearing Sam and Norman emerging from the office. Sam considers, nods, then opens the office door, peeks outside, and signals Lila to join him. Sam and Lila walk along the porch to cabin one, where they pause. Sam asks Lila to wait, then goes to the office to call inside. He examines a piece of paper, presses it into his wallet, and stores it away. Lila tries to leave the bathroom, but Sam stops her momentarily. She nods, hurries to the door, and Sam peeks outside before letting them both pass through. Lila heads toward cabin twelve, while Sam, noticing Norman standing in the office doorway, begins to enter. Lila waits until Sam is inside and the door is closed, then looks for another route to the house."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "They pause and Norman, the tense and observant manager of the Bates Motel, pauses. Norman walks past Sam, giving him a quick, disapproving glance, possibly reflecting the peculiar tension surrounding the isolated motel, goes onto the porch and into the office. Sam and Lila, who have traveled from Fairvale in search of clues, follow Norman. Norman crosses to the desk, an old mahogany piece that looks incongruous given the dilapidated state of the motel, goes behind it, and takes the key to cabin number twelve off the keyboard. By this time, Sam and Lila have entered and are almost to the desk-counter. Sam scans the counter, looking for a registration book, a standard ledger for recording guest details, which also serves as a record of the motel's sparse occupancy. Lila moves closer and studies the book as Sam signs in, ensuring they leave no trace of their true motives. When Sam has finished, he closes the book and hands it back to Norman. As he starts for the door, Sam laughs, a nervous attempt to alleviate the palpable tension. Norman stops, turns, and looks at him. Sam smiles, takes a bill out of his pocket, perhaps more than the room rate to avoid raising suspicions. Norman reluctantly goes behind the counter, lays down the key to cabin twelve, takes a receipt book out of the drawer under the counter, and starts to write. Lila steps to the desk, picks up the key quickly, and starts out. Norman looks up and gazes at her, an unsettling stare that suggests he sees more than he reveals, as she goes out the door. Lila comes along the porch, pauses before cabin one, and tries the door. It opens easily, reflecting the motel's lack of security. She closes it quickly as she hears Sam and Norman coming out of the motel office and continues down the porch. Sam considers a moment, nods agreement, and rises. He goes to the door, opens it slightly, looks out, then back to Lila. Lila goes to the door. He holds it open, and she goes out. Sam closes the door, joins Lila, and takes her hand, a gesture of reassurance in the face of uncertainty. Together, they walk along the porch toward Cabin One. They pause before the door of Cabin One. Sam motions Lila to wait and hold still, then goes on to the office, opens the door, and calls in, his voice echoing slightly in the still air. Sam lifts the piece of paper off her finger, a makeshift note, studies it, takes out his wallet, presses the wet scrap to his driver's license shield, an attempt to preserve any critical information, puts it back in the wallet, and puts the wallet away. She starts out of the bathroom. Sam takes hold of her arm and stops her, a precautionary measure in their investigation. Lila nods quickly, hurries to the door. Sam gets to it first, opens it a slight crack, looks out, then opens it wide enough for Lila and himself to pass through. Lila comes out, turns to her left, and goes along the porch toward cabin twelve, where secrets might be hidden. Sam remains at the door, then turns right, heading for the path. As he passes the office, he is shocked to see Norman standing just inside the open door, a silent guardian of the motel's mysteries. Sam starts into the office. She watches Sam disappear into the office, waits until she hears the door close, then looks about for another way to reach the house, the looming structure that stands ominously behind the motel, hinting at the secrets it holds."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Sam considers a moment nods agreement and rises They pause and Norman pauses She closes it quickly as she hears Sam and Norman coming out of the motel office and continues down the porch Norman walks past Sam giving him a quick disapproving glance goes onto the porch and into the office Sam and Lila follow Norman Norman crosses to the desk goes behind it and takes the key to cabin number twelve off the keyboard By this time Sam and Lila have entered and are almost to the deskcounter Sam scans the counter looking for a registration book Lila moves closer and studies the book as Sam signs in They pause and Norman pauses When Sam has finished he closes the book and hands it back to Norman As he starts for the door Sam laughs Norman stops turns and looks at him Norman looks up and gazes at her as she goes out the door Sam smiles takes a bill out of his pocket He holds it open and she goes out Norman reluctantly goes behind the counter lays down the key to cabin twelve takes a receipt book out of the drawer under the counter and starts to write Lila steps to the desk picks up the key quickly and starts out Sam giving him a quick disapproving glance goes onto the porch and into the office Norman looks up and gazes at her as she goes out the door She watches Sam disappear into the office waits until she hears the door close then looks about for another way to reach the house Lila comes along the porch pauses before cabin one and tries the door It opens She closes it quickly as she hears Sam and Norman coming out of the motel office and continues down the porch Sam considers a moment nods agreement and rises He goes to the door opens it slightly looks out then back to Lila Lila goes to the door Sam scans the counter looking for a registration book He holds it open and she goes out Sam closes the door joins Lila and takes her hand Together they walk along the porch toward Cabin One Sam and Lila follow Norman Sam gets to it first opens it They pause before the door of Cabin One Sam motions Lila to wait and hold still then goes on to the office opens the door and calls in Sam lifts the piece of paper off her finger studies it takes out his wallet presses the wet scrap to his driver's license shield puts it back in the wallet and puts the wallet away She starts out of the bathroom Sam takes hold of her arm and stops her Lila nods quickly hurries to the door Sam gets to it first opens it a slight crack looks out then opens it wide enough for Lila and himself to pass through As he passes the office he is shocked to see Norman standing just inside the open door Together they walk along the porch toward Cabin One Lila moves closer and studies the book as Sam signs in Lila comes out turns to her left and goes along the porch toward cabin twelve Sam motions Lila to wait and hold still then goes on to the office opens the door and calls in Lila comes along the porch pauses before cabin one and tries the door Sam remains at the door then turns right heading for the path As he passes the office he is shocked to see Norman standing just inside the open door Sam starts into the office She watches Sam disappear into the office waits until she hears the door close then looks about for another way to reach the house Lila steps to the desk picks up the key quickly and starts out When Sam has finished he closes the book and hands it back to Norman Norman walks past Sam starts into the office"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "They pause and Norman pauses. Norman walks past. Sam giving him a quick disapproving glance goes onto the porch and into the office. Sam and Lila follow Norman. Norman crosses to the desk goes behind it and takes the key to cabin number twelve off the keyboard. By this time Sam and Lila have entered and are almost to the deskcounter. Sam scans the counter looking for a registration book. Lila moves closer and studies the book as Sam signs in. When Sam has finished he closes the book and hands it back to Norman. As he starts for the door Sam laughs. Norman stops turns and looks at him. Sam smiles takes a bill out of his pocket. Norman reluctantly goes behind the counter lays down the key to cabin twelve takes a receipt book out of the drawer under the counter and starts to write. Lila steps to the desk picks up the key quickly and starts out. Norman looks up and gazes at her as she goes out the door. Lila comes along the porch pauses before cabin one and tries the door. It opens. She closes it quickly as she hears Sam and Norman coming out of the motel office and continues down the porch. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Sam considers a moment nods agreement and rises. He goes to the door opens it slightly looks out then back to Lila. Lila goes to the door. He holds it open and she goes out. Sam closes the door joins Lila and takes her hand. Together they walk along the porch toward Cabin One. They pause before the door of Cabin One. Sam motions Lila to wait and hold still then goes on to the office opens the door and calls in. Sam lifts the piece of paper off her finger studies it takes out his wallet presses the wet scrap to his driver's license shield puts it back in the wallet and puts the wallet away. She starts out of the bathroom. Sam takes hold of her arm and stops her. Lila nods quickly hurries to the door. Sam gets to it first opens it. a slight crack looks out then opens it wide enough for Lila and himself to pass through. Lila comes out turns to her left and goes along the porch toward cabin twelve. Sam remains at the door then turns right heading for the path. As he passes the office he is shocked to see Norman standing just inside the open door. Sam starts into the office. She watches Sam disappear into the office waits until she hears the door close then looks about for another way to reach the house."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "They pause and Norman pauses. Norman walks past. Sam giving him a quick disapproving glance goes onto the porch and into the office. Sam and Lila follow Norman. Norman crosses to the desk goes behind it and takes the key to cabin number twelve off the keyboard. By this time Sam and Lila have entered and are almost to the deskcounter. Sam scans the counter looking for a registration book. Lila moves closer and studies the book as Sam signs in. When Sam has finished he closes the book and hands it back to Norman. As he starts for the door Sam laughs. Norman stops turns and looks at him. Sam smiles takes a bill out of his pocket. Norman reluctantly goes behind the counter lays down the key to cabin twelve takes a receipt book out of the drawer under the counter and starts to write. Lila steps to the desk picks up the key quickly and starts out. Norman looks up and gazes at her as she goes out the door. Lila comes along the porch pauses before cabin one and tries the door. It opens. She closes it quickly as she hears Sam and Norman coming out of the motel office and continues down the porch. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Sam considers a moment nods agreement and rises. He goes to the door opens it slightly looks out then back to Lila. Lila goes to the door. He holds it open and she goes out. Sam closes the door joins Lila and takes her hand. Together they walk along the porch toward Cabin One. They pause before the door of Cabin One. Sam motions Lila to wait and hold still then goes on to the office opens the door and calls in. Sam lifts the piece of paper off her finger studies it takes out his wallet presses the wet scrap to his driver's license shield puts it back in the wallet and puts the wallet away. She starts out of the bathroom. Sam takes hold of her arm and stops her. Lila nods quickly hurries to the door. Sam gets to it first opens it. a slight crack looks out then opens it wide enough for Lila and himself to pass through. Lila comes out turns to her left and goes along the porch toward cabin twelve. Sam remains at the door then turns right heading for the path. As he passes the office he is shocked to see Norman standing just inside the open door. Sam starts into the office. She watches Sam disappear into the office waits until she hears the door close then looks about for another way to reach the house."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "They pause and Norman pauses. Norman walks past. Sam giving him a quick disapproving glance goes onto the porch and into the office. Sam and Lila follow Norman. Norman crosses to the desk goes behind it and takes the key to cabin number twelve off the keyboard. By this time Sam and Lila have entered and are almost to the deskcounter. Sam scans the counter looking for a registration book. Lila moves closer and studies the book as Sam signs in. When Sam has finished he closes the book and hands it back to Norman. She starts out of the bathroom. Sam takes hold of her arm and stops her. Lila nods quickly hurries to the door. Sam gets to it first opens it. a slight crack looks out then opens it wide enough for Lila and himself to pass through. Lila comes out turns to her left and goes along the porch toward cabin twelve. Sam remains at the door then turns right heading for the path. As he passes the office he is shocked to see Norman standing just inside the open door. Sam starts into the office. She watches Sam disappear into the office waits until she hears the door close then looks about for another way to reach the house."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "They pause and Norman pauses. Norman walks past. Sam giving him a quick disapproving glance goes onto the porch and into the office. Sam and Lila follow Norman. Sam remains at the door then turns right heading for the path. As he passes the office he is shocked to see Norman standing just inside the open door. Sam starts into the office. She watches Sam disappear into the office waits until she hears the door close then looks about for another way to reach the house."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "They pause and the squirrel pauses. The squirrel walks past the giraffe, giving the giraffe a quick, disapproving glance, goes onto the porch and into the office. The giraffe and the parrot follow the squirrel. The squirrel crosses to the desk, goes behind it, and takes the key to cabin number twelve off the keyboard. By this time, the giraffe and the parrot have entered and are almost to the desk-counter. The giraffe scans the counter, looking for a registration book. The parrot moves closer and studies the book as the giraffe signs in. When the giraffe has finished, the giraffe closes the book and hands it back to the squirrel. As the giraffe starts for the door, the giraffe laughs. The squirrel stops, turns, and looks at the giraffe. The giraffe smiles, takes a bill out of the giraffe's pocket. The squirrel reluctantly goes behind the counter, lays down the key to cabin twelve, takes a receipt book out of the drawer under the counter, and starts to write. The parrot steps to the desk, picks up the key quickly, and starts out. The squirrel looks up and gazes at the parrot as the parrot goes out the door. The parrot comes along the porch, pauses before cabin one, and tries the door. It opens. The parrot closes it quickly as the parrot hears the giraffe and the squirrel coming out of the motel office and continues down the porch. The giraffe considers a moment, nods agreement, and rises. The giraffe goes to the door, opens it slightly, looks out, then back to the parrot. The parrot goes to the door. The giraffe holds it open, and the parrot goes out. The giraffe closes the door, joins the parrot, and takes the parrot's hand. Together, they walk along the porch toward Cabin One. They pause before the door of Cabin One. The giraffe motions the parrot to wait and hold still, then goes on to the office, opens the door, and calls in. The giraffe lifts the piece of paper off the elephant's finger, studies it, takes out the giraffe's wallet, presses the wet scrap to the giraffe's driver's license shield, puts it back in the wallet, and puts the wallet away. The elephant starts out of the bathroom. The giraffe takes hold of the elephant's arm and stops the elephant. The parrot nods quickly, hurries to the door. The giraffe gets to it first, opens it a slight crack, looks out, then opens it wide enough for the parrot and the giraffe to pass through. The parrot comes out, turns to her left, and goes along the porch toward cabin twelve. The giraffe remains at the door, then turns right, heading for the path. As the giraffe passes the office, the giraffe is shocked to see the squirrel standing just inside the open door. The giraffe starts into the office. The elephant watches the giraffe disappear into the office, waits until the elephant hears the door close, then looks about for another way to reach the house."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "They pause and Norman pauses. Norman walks past Sam, giving him a quick, disapproving glance, goes onto the veranda and into the library. Sam and Lila follow Norman. Norman crosses to the counter, goes behind it, and takes the key to locker number twelve off the typewriter. By this time, Sam and Lila have entered and are almost to the service counter. Sam scans the counter, looking for a ledger. Lila moves closer and studies the ledger as Sam signs in. When Sam has finished, he closes the ledger and hands it back to Norman. As he starts for the exit, Sam laughs. Norman stops, turns, and looks at him. Sam smiles, takes a coin out of his pocket. Norman reluctantly goes behind the counter, lays down the key to locker twelve, takes a notepad out of the cabinet under the counter, and starts to write. Lila steps to the counter, picks up the key quickly, and starts out. Norman looks up and gazes at her as she goes out the entrance. Lila comes along the veranda, pauses before locker one, and tries the gate. It opens. She closes it quickly as she hears Sam and Norman coming out of the library entrance and continues down the veranda. Sam considers a moment, nods agreement, and rises. He goes to the entrance, opens it slightly, looks out, then back to Lila. Lila goes to the entrance. He holds it open, and she goes out. Sam closes the entrance, joins Lila, and takes her hand. Together, they walk along the veranda toward Locker One. They pause before the gate of Locker One. Sam motions Lila to wait and hold still, then goes on to the library, opens the entrance, and calls in. Sam lifts the sticky note off her finger, studies it, takes out his wallet, presses the damp scrap to his membership card, puts it back in the wallet, and puts the wallet away. She starts out of the hallway. Sam takes hold of her arm and stops her. Lila nods quickly, hurries to the entrance. Sam gets to it first, opens it a slight crack, looks out, then opens it wide enough for Lila and himself to pass through. Lila comes out, turns to her left, and goes along the veranda toward locker twelve. Sam remains at the entrance, then turns right, heading for the route. As he passes the library, he is shocked to see Norman standing just inside the open entrance. Sam starts into the library. She watches Sam disappear into the library, waits until she hears the entrance close, then looks about for another way to reach the barn."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "They hesitate and Norman hesitates. Norman strides past Sam, giving him a brief, approving nod, proceeds onto the porch and into the office. Sam and Lila trail Norman. Norman strolls to the desk, stands beside it, and snatches the key to cabin number twelve off the counter. By this time, Sam and Lila have arrived and are almost at the desk-counter. Sam examines the counter, searching for a registration chart. Lila approaches and observes the chart as Sam scribbles in. When Sam has completed this, he flips the chart and offers it back to Norman. As he heads to the door, Sam grins. Norman hesitates, pivots, and glares at him. Sam chuckles, extracts a coin from his pocket. Norman willingly steps behind the counter, places the key to cabin twelve back, retrieves a notebook from the drawer under the counter, and begins to scribble. Lila approaches the desk, grasps the key swiftly, and slips out. Norman glances up and peers at her as she exits the door. Lila struts along the porch, halts in front of cabin one, and taps the door. It swings open. She shuts it softly as she senses Sam and Norman emerging from the motel office and strides down the porch. Sam assesses for a moment, shakes agreement, and drops. He moves to the door, nudges it slightly, glances out, then back to Lila. Lila strolls to the door. He secures it open, and she steps out. Sam shuts the door, joins Lila, and clasps her hand. Together, they amble along the porch toward Cabin One. They linger before the door of Cabin One. Sam gestures Lila to hold and remain still, then heads to the office, swings the door, and calls in. Sam grasps the piece of fabric off her finger, inspects it, withdraws his wallet, affixes the dry scrap to his driver's license shield, puts it back in the wallet, and stashes the wallet away. She dashes out of the bathroom. Sam grasps her hand and halts her. Lila shakes quickly, rushes to the door. Sam reaches it first, cracks it open slightly, peers out, then opens it sufficiently for Lila and himself to walk through. Lila steps out, turns to her right, and wanders along the porch toward cabin twelve. Sam lingers at the door, then turns left, strolling to the path. As he bypasses the office, he is startled to see Norman leaning just inside the open door. Sam ambles into the office. She observes Sam vanish into the office, lingers until she hears the door shut, then surveys about for another route to reach the house."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "They pause and the toothbrush pauses. The toothbrush walks past the light bulb, giving it a quick, disapproving glance, goes onto the trampoline and into the greenhouse. The light bulb and the chair follow the toothbrush. The toothbrush crosses to the waterfall, goes behind it, and takes the key to spaceship number twelve off the backpack. By this time, the light bulb and the chair have entered and are almost to the waterfall-table. The light bulb scans the table, looking for a menu. The chair moves closer and studies the menu as the light bulb signs in. When the light bulb has finished, it closes the menu and hands it back to the toothbrush. As it starts for the slide, the light bulb laughs. The toothbrush stops, turns, and looks at it. The light bulb smiles, takes a bill out of its pocket. The toothbrush reluctantly goes behind the table, lays down the key to spaceship twelve, takes a receipt book out of the drawer under the table, and starts to write. The chair steps to the waterfall, picks up the key quickly, and starts out. The toothbrush looks up and gazes at it as it goes out the slide. The chair comes along the trampoline, pauses before spaceship one, and tries the slide. It opens. It closes it quickly as it hears the light bulb and the toothbrush coming out of the greenhouse office and continues down the trampoline. The light bulb considers a moment, nods agreement, and rises. It goes to the slide, opens it slightly, looks out, then back to the chair. The chair goes to the slide. It holds it open, and the chair goes out. The light bulb closes the slide, joins the chair, and takes its hand. Together, they walk along the trampoline toward spaceship one. They pause before the slide of spaceship one. The light bulb motions the chair to wait and hold still, then goes on to the greenhouse, opens the slide, and calls in. The light bulb lifts the piece of candy off its toe, studies it, takes out its wallet, presses the wet scrap to its driver's license shield, puts it back in the wallet, and puts the wallet away. It starts out of the kitchen. The light bulb takes hold of its arm and stops it. The chair nods quickly, hurries to the slide. The light bulb gets to it first, opens it a slight crack, looks out, then opens it wide enough for the chair and itself to pass through. The chair comes out, turns to its left, and goes along the trampoline toward spaceship twelve. The light bulb remains at the slide, then turns right, heading for the seesaw. As it passes the greenhouse, it is shocked to see the toothbrush standing just inside the open slide. The light bulb starts into the greenhouse. It watches the light bulb disappear into the greenhouse, waits until it hears the slide close, then looks about for another way to reach the mountain."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "They hesitate and Gerald hesitates. Gerald strides past Alex, casting him a brief, indifferent glance, proceeds onto the terrace and into the workshop. Alex and Mona accompany Gerald. Gerald strides to the counter, moves behind it, and retrieves the key to cabin number twelve from the filing cabinet. By this moment, Alex and Mona have entered and are nearly to the counter-desk. Alex inspects the counter, searching for a ledger. Mona approaches closer and examines the ledger as Alex registers. When Alex is done, he shuts the ledger and returns it to Gerald. As he heads for the exit, Alex chuckles. Gerald halts, pivots, and glances at him. Alex grins, pulls a bill from his jacket. Gerald grudgingly moves behind the desk, places down the key to cabin twelve, pulls an invoice pad from the cabinet beneath the desk, and begins to jot down. Mona steps to the counter, snatches the key swiftly, and heads out. Gerald glances up and observes her as she exits through the door. Mona walks along the terrace, stops in front of cabin one, and tests the door. It swings open. She closes it abruptly as she hears Alex and Gerald emerging from the lodge workshop and proceeds down the terrace. Alex deliberates momentarily, acknowledges, and stands. He heads to the door, nudges it open slightly, peers out, then back to Mona. Mona heads to the door. He keeps it ajar, and she exits. Alex shuts the door, joins Mona, and clasps her hand. Together, they stroll along the terrace toward Cabin One. They halt before the entrance of Cabin One. Alex gestures for Mona to pause and remain motionless, then continues on to the workshop, pushes the door open, and calls inside. Alex lifts the slip of paper from her fingertips, examines it, extracts his wallet, adheres the damp scrap to his ID card protector, places it back in the wallet, and stores the wallet away. She departs from the restroom. Alex seizes her arm and halts her. Mona nods swiftly, rushes to the door. Alex reaches it first, cracks it open slightly, peers outside, then opens it wide enough for Mona and himself to step through. Mona exits, turns to her left, and proceeds along the terrace toward cabin twelve. Alex lingers at the door, then turns right, proceeding toward the trail. As he strides past the workshop, he is astonished to see Gerald standing just inside the open portal. Alex steps into the workshop. She observes Alex vanish into the workshop, waits until she catches the door shut, then searches for a different route to reach the residence."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "They freeze and Norman freezes. Norman saunters past Sam, offering him a brief, encouraging wave, heads onto the balcony and into the lounge. Sam and Lila trail after Norman. Norman advances to the table, moves around it, and picks the ticket to cabin number twelve off the chalkboard. By this time, Sam and Lila have arrived and are nearly to the table-counter. Sam scans the counter, searching for an attendance register. Lila moves closer and examines the register as Sam scribbles his name. When Sam has finished, he shuts the register and hands it back to Norman. As he heads for the gate, Sam chuckles. Norman halts, pivots, and stares at him. Sam grins, extracts a ticket from his pocket. Norman begrudgingly moves around the counter, places down the ticket to cabin twelve, retrieves a note pad from the cabinet beneath the counter, and begins to sketch. Lila steps to the table, snatches the ticket swiftly, and starts heading out. Norman glances up and watches her as she exits the gate. Lila strolls along the balcony, halts before cabin one, and tugs at the gate. It swings open. She shuts it hastily as she hears Sam and Norman exiting the lounge and proceeds down the balcony. Sam ponders briefly, nods understanding, and stands. He proceeds to the gate, cracks it open slightly, peeks out, then back to Lila. Lila approaches the gate. He holds it ajar, and she exits. Sam shuts the gate, joins Lila, and grasps her arm. Together, they stroll along the balcony toward Cabin One. They stop before the gate of Cabin One. Sam gestures for Lila to pause and stay put, then continues to the lounge, opens the gate, and calls inside. Sam plucks the feather off her hat, examines it, pulls out his notepad, sticks the damp feather to his library card holder, returns it to the notepad, and stows the notepad away. She begins to leave the gallery. Sam grips her shoulder and halts her. Lila nods briskly, scurries to the gate. Sam reaches it first, opens it a tiny gap, peeks out, then opens it wide enough for Lila and himself to go through. Lila emerges, turns to her right, and walks along the balcony toward cabin twelve. Sam stays at the gate, then turns left, moving toward the trail. As he passes the lounge, he is startled to see Norman standing just inside the open gate. Sam heads into the lounge. She watches Sam vanish into the lounge, waits until she hears the gate shut, then searches for another route to reach the villa."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The chickens hesitate and Oliver hesitates. Oliver strolls past Max, offering him a swift, approving smile, moves onto the dock and into the barn. Max and Karen trail Oliver. Oliver drifts to the podium, slides behind it, and plucks the ticket to wagon number eight from the screen. By this moment, Max and Karen have drifted in and are nearly to the podium-stand. Max searches the stand, hunting for a ledger. Karen steps closer and examines the ledger as Max inscribes his name. After Max finishes, he shuts the ledger and returns it to Oliver. As he heads for the gate, Max giggles. Oliver pauses, pivots, and glances at him. Max grins, retrieves a coin from his satchel. Oliver grudgingly moves behind the stand, sets down the ticket to wagon eight, extracts a voucher pad from the cabinet under the stand, and begins to scribble. Karen approaches the podium, snatches the ticket swiftly, and heads out. Oliver glances up and observes her as she exits the gate. Karen strolls along the dock, pauses before wagon three, and tests the gate. It swings open. She shuts it hastily as she hears Max and Oliver emerging from the barn entryway and proceeds down the dock. Max deliberates briefly, signals agreement, and stands. He strides to the gate, nudges it slightly ajar, peeks out, then back to Karen. Karen strides to the gate. He holds it open, and she steps out. Max shuts the gate, joins Karen, and clasps her elbow. Together, they meander along the dock toward Wagon Three. They linger before the gate of Wagon Three. Max gestures for Karen to pause and remain quiet, then proceeds to the barn, nudges the gate, and beckons inward. Max lifts the leaf off her mitten, inspects it, retrieves his briefcase, fastens the damp leaf to his ID card, places it back in the briefcase, and stows the briefcase away. She steps out of the kitchen. Max grasps her elbow and halts her. Karen nods swiftly, scurries to the gate. Max reaches it first, nudges it ajar, peeks out, then swings it open wide enough for Karen and himself to slip through. Karen steps out, turns to her right, and strolls along the dock toward wagon eight. Max lingers at the gate, then turns left, making for the trail. As he strolls past the barn, he is astounded to spot Oliver standing just inside the ajar gate. Max advances into the barn. She observes Max vanish into the barn, waits until she hears the gate shut, then scans about for an alternate route to reach the shed."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Norman briefly pauses, gives Sam a disapproving glance, and enters the office. Sam and Lila follow. Norman retrieves the key to cabin twelve from the desk. Sam signs the registration book, and Lila studies it. After Sam hands the book back and laughs, Norman reluctantly retrieves a receipt book. Lila quickly grabs the key and exits. She pauses at cabin one and discovers the door is open, then continues down the porch. Sam checks outside and then follows Lila. They head to cabin one, where Sam motions for Lila to wait. He returns to the office momentarily, then joins Lila. Together, they go to cabin one. Sam examines a paper from Lila's finger, presses it into his wallet, and they leave the cabin. Lila heads toward cabin twelve as Sam notices Norman standing inside the office door. Sam enters the office, while Lila looks for another way to reach the house."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She watches Sam disappear into the office waits until she hears the door close then looks about for another way to reach the house Sam starts into the office As he passes the office he is shocked to see Norman standing just inside the open door Sam remains at the door then turns right heading for the path Lila comes out turns to her left and goes along the porch toward cabin twelve a slight crack looks out then opens it wide enough for Lila and himself to pass through Sam gets to it first opens it Lila nods quickly hurries to the door Sam takes hold of her arm and stops her She starts out of the bathroom Sam lifts the piece of paper off her finger studies it takes out his wallet presses the wet scrap to his driver's license shield puts it back in the wallet and puts the wallet away Sam motions Lila to wait and hold still then goes on to the office opens the door and calls in They pause before the door of Cabin One Together they walk along the porch toward Cabin One Sam closes the door joins Lila and takes her hand He holds it open and she goes out Lila goes to the door He goes to the door opens it slightly looks out then back to Lila Sam considers a moment nods agreement and rises She closes it quickly as she hears Sam and Norman coming out of the motel office and continues down the porch It opens Lila comes along the porch pauses before cabin one and tries the door Norman looks up and gazes at her as she goes out the door Lila steps to the desk picks up the key quickly and starts out Norman reluctantly goes behind the counter lays down the key to cabin twelve takes a receipt book out of the drawer under the counter and starts to write Sam smiles takes a bill out of his pocket Norman stops turns and looks at him As he starts for the door Sam laughs When Sam has finished he closes the book and hands it back to Norman Lila moves closer and studies the book as Sam signs in Sam scans the counter looking for a registration book By this time Sam and Lila have entered and are almost to the deskcounter Norman crosses to the desk goes behind it and takes the key to cabin number twelve off the keyboard Sam and Lila follow Norman Sam giving him a quick disapproving glance goes onto the porch and into the office Norman walks past They pause and Norman pauses"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Lila comes along the porch pauses before cabin one and tries the door Sam and Lila follow Norman Lila moves closer and studies the book as Sam signs in Lila goes to the door She starts out of the bathroom Norman crosses to the desk goes behind it and takes the key to cabin number twelve off the keyboard He goes to the door opens it slightly looks out then back to Lila Norman walks past They pause before the door of Cabin One Lila nods quickly hurries to the door Sam scans the counter looking for a registration book As he passes the office he is shocked to see Norman standing just inside the open door They pause and Norman pauses Sam remains at the door then turns right heading for the path She watches Sam disappear into the office waits until she hears the door close then looks about for another way to reach the house Lila comes out turns to her left and goes along the porch toward cabin twelve Sam smiles takes a bill out of his pocket By this time Sam and Lila have entered and are almost to the deskcounter Together they walk along the porch toward Cabin One Sam lifts the piece of paper off her finger studies it takes out his wallet presses the wet scrap to his driver's license shield puts it back in the wallet and puts the wallet away He holds it open and she goes out Sam considers a moment nods agreement and rises Sam starts into the office It opens As he starts for the door Sam laughs Sam gets to it first opens it When Sam has finished he closes the book and hands it back to Norman Sam takes hold of her arm and stops her Norman stops turns and looks at him a slight crack looks out then opens it wide enough for Lila and himself to pass through Norman reluctantly goes behind the counter lays down the key to cabin twelve takes a receipt book out of the drawer under the counter and starts to write Sam motions Lila to wait and hold still then goes on to the office opens the door and calls in Norman looks up and gazes at her as she goes out the door Lila steps to the desk picks up the key quickly and starts out Sam giving him a quick disapproving glance goes onto the porch and into the office Sam closes the door joins Lila and takes her hand She closes it quickly as she hears Sam and Norman coming out of the motel office and continues down the porch"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He goes to the door opens it slightly looks out then back to Lila Lila goes to the door He holds it open and she goes out Sam closes the door joins Lila and takes her hand Together they walk along the porch toward Cabin One They pause before the door of Cabin One Sam motions Lila to wait and hold still then goes on to the office opens the door and calls in Sam lifts the piece of paper off her finger studies it takes out his wallet presses the wet scrap to his driver's license shield puts it back in the wallet and puts the wallet away She starts out of the bathroom Sam takes hold of her arm and stops her Lila nods quickly hurries to the door Sam gets to it first opens it a slight crack looks out then opens it wide enough for Lila and himself to pass through Lila comes out turns to her left and goes along the porch toward cabin twelve Sam remains at the door then turns right heading for the path As he passes the office he is shocked to see Norman standing just inside the open door Sam starts into the office She watches Sam disappear into the office waits until she hears the door close then looks about for another way to reach the house They pause and Norman pauses Norman walks past Sam giving him a quick disapproving glance goes onto the porch and into the office Sam and Lila follow Norman Norman crosses to the desk goes behind it and takes the key to cabin number twelve off the keyboard By this time Sam and Lila have entered and are almost to the deskcounter Sam scans the counter looking for a registration book Lila moves closer and studies the book as Sam signs in When Sam has finished he closes the book and hands it back to Norman As he starts for the door Sam laughs Norman stops turns and looks at him Sam smiles takes a bill out of his pocket Norman reluctantly goes behind the counter lays down the key to cabin twelve takes a receipt book out of the drawer under the counter and starts to write Lila steps to the desk picks up the key quickly and starts out Norman looks up and gazes at her as she goes out the door Lila comes along the porch pauses before cabin one and tries the door It opens She closes it quickly as she hears Sam and Norman coming out of the motel office and continues down the porch Sam considers a moment nods agreement and rises"
        }
      ]
    }
  ]
}