{
  "ground_truth": "The car dealer is out on the lot now, standing and waiting for Mary. As she approaches, lost in her newspaper, he smiles. She stops suddenly, almost with a gasp. She has seen the Patrolman. He is staring over at her, his face dispassionate. Mary has to force herself to look away. He starts into Mary's car. She stands in the middle of the lot, feeling like a shooting target. He still watches. With a self-angry sigh of resignment, she goes to a close car, looks at it. The Car Dealer is returning. As the car dealer looks at her in amazement, she reaches into her bag, feels the money-filled envelope, pauses. Mary pauses, turns, sees the Patrolman, then the Mechanic. Then the Mechanic waves, starts forward with her suitcase. The Mechanic smiles, throws the suitcase in. Mary zooms off. As she drives out of the lot, we see the Mechanic, the Car Dealer, and the Patrolman all looking after her. Mary is driving tensely. CAMERA IS CLOSE on Mary's face now, recording her anxiety, her fears. Mary looks weary, tired with strain and with hard driving. Her eyes are heavy with worry and deep thought. We can see that it is much later in the day, almost dusk. Now we cut to the view of the road, from Mary's viewpoint. Darkness of evening is coming. In the dim twilight, we see the neon sign of roadside restaurants and gas stations beginning to blaze on. Back on Mary's face, and after a moment, the imagined voices again. A flush of painful guilt and regret rises up in Mary's face. The first oncoming headlights slash at the windshield. The oncoming headlights blurt at her. It is completely dark now, night. Oncoming headlights throw a blinding light across her features. Big drops of rain begin to appear. She is becoming aware of the rain starting. The rain increasing and backlit by the oncoming headlights. Mary starts the windshield wipers. The wipers are having a battle with the now torrential rain. Peering through the blurred windshield, slowing down in the flooding highway, peering through the windshield. The oncoming lights are fewer, just blackness and rain, peering. An almost undiscernible light in the far distance, a neon sign blurred by the rain-sheeted windshield. She presses down, forces the car to move on through the flooded road. The lights are on within the office. She tries the door, finds it open, goes into the office. Mary goes to the desk, rings a small pushbell. She looks off in another direction, slightly behind the office, and sees. A path from the motel office leads directly up to this house. There is a light on in one of the upstairs rooms.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The automobile vendor is out on the plot now, standing and waiting for Mary. As she nears, engrossed in her journal, he grins. She halts abruptly, almost with a gulp. She has observed the Officer. He is gazing over at her, his visage emotionless. Mary has to compel herself to glance away. He begins into Mary's automobile. She stands in the center of the plot, feeling like a shooting target. He still observes. With a self-irritated exhale of resignation, she moves to a nearby automobile, gazes at it. The Automobile Vendor is returning. As the automobile vendor gazes at her in astonishment, she reaches into her purse, feels the cash-filled packet, hesitates. Mary hesitates, turns, sees the Officer, then the Technician. Then the Technician gestures, strides forward with her luggage. The Technician grins, tosses the luggage in. Mary speeds off. As she maneuvers out of the plot, we observe the Technician, the Automobile Vendor, and the Officer all gazing after her. Mary is maneuvering tensely. CAMERA IS CLOSE on Mary's visage now, recording her unease, her fears. Mary looks exhausted, fatigued with stress and with difficult maneuvering. Her eyes are heavy with concern and deep contemplation. We can observe that it is much later in the day, almost twilight. Now we cut to the view of the route, from Mary's perspective. Darkness of evening is arriving. In the dim twilight, we observe the neon emblem of roadside eateries and fuel stations commencing to blaze on. Back on Mary's visage, and after a moment, the imagined voices again. A flush of distressing remorse and regret rises up in Mary's visage. The first approaching headlights slash at the windshield. The approaching headlights blurt at her. It is completely obscure now, night. Approaching headlights cast a blinding illumination across her features. Large droplets of rain begin to manifest. She is becoming conscious of the rain commencing. The rain escalating and backlit by the approaching headlights. Mary initiates the windshield wipers. The wipers are having a struggle with the now torrential rain. Peering through the blurred windshield, decelerating in the inundated highway, peering through the windshield. The approaching illuminations are fewer, just blackness and rain, peering. An almost undiscernible light in the far distance, a neon emblem blurred by the rain-sheeted windshield. She presses down, compels the automobile to advance on through the inundated thoroughfare. The lights are on within the bureau. She attempts the portal, finds it open, enters the bureau. Mary goes to the counter, rings a small pushbell. She glances off in another direction, slightly behind the bureau, and observes. A path from the inn bureau leads directly up to this abode. There is a light on in one of the upper-level chambers."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The lot is now occupied by the car dealer, who is standing and waiting for Mary. As he smiles, Mary approaches, lost in her newspaper. Suddenly, she stops, almost with a gasp. The Patrolman has been seen by her. He is staring at her, his face dispassionate. Mary must force herself to look away. Her car is being entered by him. She stands in the middle of the lot, feeling like a shooting target. He continues to watch. With a self-angry sigh of resignment, a close car is approached by her, and it is looked at. The Car Dealer is returning. As amazement is shown by the car dealer while he looks at her, into her bag, her hand reaches, feels the money-filled envelope, pauses. Mary pauses, turns, sees the Patrolman, then the Mechanic. Her suitcase is waved at by the Mechanic, who starts forward. The suitcase is thrown in by the Mechanic with a smile. Mary zooms off. As the lot is driven out of by her, the Mechanic, the Car Dealer, and the Patrolman are all seen looking after her. Mary is driving tensely. CAMERA IS CLOSE on Mary's face now, and her anxiety and fears are recorded. Looking weary, tired with strain and with hard driving, Mary's eyes are heavy with worry and deep thought. It can be seen that it is much later in the day, almost dusk. Now, the view of the road is cut to from Mary's viewpoint. Darkness of evening is coming. In the dim twilight, the neon sign of roadside restaurants and gas stations is seen beginning to blaze on. Back on Mary's face, and after a moment, the imagined voices are heard again. A flush of painful guilt and regret rises up in Mary's face. The windshield is slashed at by the first oncoming headlights. At her, the oncoming headlights blurt. Now, it is completely dark, night. Her features are thrown into blinding light by the oncoming headlights. Big drops of rain begin to appear. The rain starting is being noticed by her. The rain is increasing and is backlit by the oncoming headlights. The windshield wipers are started by Mary. A battle with the now torrential rain is had by the wipers. Through the blurred windshield, peering, the slowing down in the flooding highway, peering through the windshield. The lights oncoming are fewer now, just blackness and rain, peering. In the far distance, an almost undiscernible light, a neon sign blurred by the rain-sheeted windshield. The car is forced to move on through the flooded road by her pressing down. Within the office, the lights are on. She tries the door, finds it open, and into the office she goes. The desk is approached by Mary, and a small pushbell is rung. Off in another direction, slightly behind the office, she looks and sees. This house is directly reached by a path from the motel office. A light is on in one of the upstairs rooms."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The car dealer waits on the lot for Mary, who approaches, absorbed in her newspaper. He smiles as she suddenly stops, gasping at the sight of the dispassionate Patrolman staring at her. Feeling like a target, she forces herself to look away. Resigned, she heads to a nearby car. The dealer returns as she reaches for her money-filled envelope, pausing. Mary glances at the Patrolman and Mechanic, who waves and brings her suitcase, smiling. She drives off tensely, with the Mechanic, Dealer, and Patrolman watching her leave. Close-up on Mary's anxious, weary face, strained from hard driving. It's almost dusk. From her view, the road darkens, and neon signs of restaurants and gas stations light up. Imagined voices stir guilt and regret in Mary as night falls. Headlights beam across her face, rain begins, and she starts the wipers to combat the torrential downpour. Slowing on the flooded highway, an indistinct light appears far ahead, a neon sign blurred by rain. She pushes the car through the water and enters an office. Mary rings a desk bell and notices a path leading from the motel to a house with an upstairs light on."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The car dealer stands on the lot, waiting for Mary. As she approaches, lost in her newspaper, he smiles. She stops abruptly, seeing the dispassionate Patrolman staring at her and forces herself to look away. The Patrolman approaches her car. Feeling exposed, Mary sighs with resignation, examines a nearby car, and touches the money in her bag. Glancing at the Patrolman, then the Mechanic, who waves and brings her suitcase, Mary takes off. As she drives away, the Mechanic, Car Dealer, and Patrolman watch her. The camera closes in on Mary's anxious face, weary and strained, as dusk approaches. Her viewpoint reveals the evening darkness, with neon signs illuminating. Imagined voices resurface, guilt and regret on her face. Headlights assault her eyes as night falls, and rain starts. Mary turns on the wipers against the torrential rain, struggling through the flooded highway. She spots a neon sign in the distance, presses on, and finds a motel office open. She rings a desk bell and notices a path leading to a house with an upstairs light on."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The car dealer is currently out on the lot, standing still and waiting with anticipation for Mary to arrive. As she approaches, engrossed in the pages of her newspaper, he offers a welcoming smile her way. Mary halts abruptly, almost gasping in surprise. She has caught sight of the stern-looking Patrolman. His gaze is fixed on her, his expression one of unchanging detachment. Mary musters the strength to avert her eyes from him. He begins moving toward Mary's car. She stands there, feeling exposed in the middle of the lot as if she were a target. His stare remains unbroken. With a resigned sigh that reveals her inner frustration, she heads to a nearby vehicle and examines it. The car dealer, returning to her, is visibly puzzled by her actions. As he looks on in astonishment, Mary digs into her handbag, her fingers touching the envelope brimming with money. She hesitates. Mary lingers for a moment, turns, notices the Patrolman once more, and then shifts her gaze to the Mechanic. Suddenly, the Mechanic waves, stepping forward with her suitcase in hand. He smiles warmly as he tosses the suitcase into Mary's car. She speeds off, leaving the lot behind. As she drives away, we catch sight of the Mechanic, the Car Dealer, and the Patrolman all watching her departure. Mary grips the wheel, driving with tense focus. The CAMERA ZOOMS IN closely on her face, capturing every nuance of her anxiety and fear. Mary appears weary, worn down by the strain and the taxing drive. Her eyes reflect her worry and deep contemplation. It is clear that much time has passed, and the day is nearly at its end, with dusk approaching. We shift to see the road from Mary’s perspective; the encroaching darkness of evening is evident. In the dimming twilight, the neon signs of roadside diners and gas stations begin to light up, blazing brightly. We return to Mary's face, and soon imagined voices echo in her mind. A wave of painful guilt and regret washes over her features. The glare of the first oncoming headlights slices through the windshield. The headlights burst into her vision. Night envelops the scene completely, casting blinding beams of light across her face. Large raindrops begin to fall, making her aware of the rain's onset. The rainfall intensifies, illuminated by the headlights from oncoming traffic. Mary activates the windshield wipers, which struggle against the now pouring rain. Peering through the blurred windshield, she slows down on the waterlogged highway, straining to see through the glass. The frequency of oncoming lights decreases, leaving her to navigate through blackness and relentless rain. In the distant darkness, she discerns a barely visible light, a neon sign distorted by the rain-coated windshield. She presses the accelerator, urging the car onward through the flooded road. The lights inside the office building are on. She tries the door, finds it unlocked, and enters the office. Mary approaches the desk, ringing a small pushbell there. Her gaze shifts in another direction, slightly beyond the office, and she notices. A path leads directly from the motel office up to a house. In one of the upstairs rooms, a light is shining."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The car dealer is presently positioned out on the expansive lot, standing perfectly still, and filled with keen anticipation, as he eagerly awaits Mary's expected arrival. As she approaches him, deeply engrossed in the engaging pages of her newspaper, he generously offers her a welcoming smile. Mary suddenly halts in her tracks, almost as if she is gasping in surprise. Her eyes have caught sight of the stern-looking Patrolman whose focused gaze remains unwaveringly fixed on her, his expression one of unyielding detachment and strict composure. Summoning her inner strength, Mary makes the effort to avert her eyes from his disconcerting stare. The Patrolman then begins to make his way toward Mary's parked car. Standing there, she feels exposed and vulnerable in the middle of the lot, as though she were an easy target. His stare remains constant and unbroken. With a resigned sigh that betrays her growing inner frustration, she directs her steps toward a nearby vehicle to examine it more closely. The car dealer, having returned to her side once again, is visibly puzzled and perplexed by her seemingly inexplicable actions. As he observes her in astonishment, Mary reaches into her handbag, where her fingers touch the envelope that is brimming with money, causing her to hesitate momentarily. She pauses for a brief moment, then turns her attention, noticing the Patrolman once more, before shifting her gaze to the Mechanic. In an unexpected gesture, the Mechanic waves at her, stepping forward with her suitcase in hand. He grins warmly as he tosses the suitcase into Mary's car, and she speeds off hurriedly, leaving the lot and everyone in it behind her. As she drives away, we catch sight of the Mechanic, the Car Dealer, and the unwavering Patrolman, all watching her swift departure with interest. Mary grips the steering wheel tightly, driving with tense focus and determination. The CAMERA ZOOMS IN, focusing closely on her face, capturing every subtle nuance of her anxiety and underlying fear. Mary appears weary and worn down by the accumulating strain and the taxing nature of her drive. Her eyes reflect her inner turmoil, filled with worry and deep contemplation. It becomes increasingly clear that a substantial amount of time has elapsed, and the day is nearing its end, with the gradual approach of dusk. We shift to view the road from Mary’s perspective; the encroaching darkness of evening becomes more and more apparent. In the dimming twilight, the vibrant neon signs of roadside diners and gas stations begin to light up, blazing brightly against the darkening sky. We return to Mary's face, and soon imagined voices echo hauntingly in her mind. A wave of painful guilt and regret washes over her features. The glare of the first oncoming headlights slices sharply through the windshield, bursting dramatically into her vision. Night envelops the scene completely, casting blinding beams of light across her face. Large raindrops start to fall, alerting her keenly to the rain's onset. The rainfall intensifies rapidly, illuminated starkly by the headlights piercing through oncoming traffic. Mary activates the windshield wipers, which struggle tirelessly against the now pouring rain. Peering intently through the blurred windshield, she slows her pace on the waterlogged highway, straining to see through the glass. The frequency of oncoming lights decreases gradually, leaving her to navigate through blackness and the relentless rain. In the distant darkness, she discerns a barely visible light, a neon sign distorted by the rain-coated windshield. She presses the accelerator with renewed urgency, urging the car onward through the flooded road. The lights inside the office building are on, providing some relief. She tries the door, discovers it unlocked, and enters the office without hesitation. Mary approaches the desk, ringing a small push bell located there. Her gaze shifts in another direction, slightly beyond the confines of the office, and she takes notice of a path that leads directly from the motel office up to a house. In one of the upstairs rooms, a single light is shining."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The car dealer stands out on the lot, waiting with anticipation for Mary, scanning the area for her arrival. As Mary approaches, engrossed in her newspaper, the car dealer greets her with a welcoming smile, attempting to catch her attention. Just as she reaches the lot, Mary abruptly halts, almost gasping, as her eyes fixate on the Patrolman, who is gazing intently at her with a dispassionate expression on his face. Mary struggles to tear her gaze away from the Patrolman, feeling a strange pressure. Simultaneously, the Patrolman begins examining Mary's car, intensifying her discomfort as she stands in the middle of the lot, feeling exposed and vulnerable, like a target on a shooting range. Despite the intimidating scrutiny, she forces herself to sigh with resignation, directing her attention to a nearby car as a distraction. As she reluctantly moves toward it, the Car Dealer returns, astonished by her behavior. In that moment, Mary reaches into her bag and feels the envelope stuffed with money, hesitating briefly. Still unsettled, she glances around, first at the Patrolman, then at the Mechanic, who waves and confidently strides forward, carrying her suitcase. With a warm smile, he tosses the suitcase into her car. Wasting no time, Mary quickly drives off, accelerating out of the lot. As she speeds away, the Mechanic, Car Dealer, and Patrolman stand watching, their eyes fixed on her retreating car. Inside the vehicle, Mary grips the wheel tensely, the camera capturing her face, which is etched with anxiety and fear. Her features show the weariness from strain and prolonged driving, with her heavy eyes revealing deep worry and contemplation. As the day progresses into late afternoon, the sky darkens, signaling dusk. From Mary's viewpoint, the road ahead is enveloped in the dim twilight as neon signs of roadside restaurants and gas stations flicker to life. The camera returns to focus on Mary's face, and she becomes engulfed by a surge of imagined voices, provoking a painful wave of guilt and regret that manifests visibly on her face. The moment is shattered as the first oncoming headlights slice through the windshield, casting an intrusive, glaring light upon her. The darkness of night envelops her, and the blinding headlights from oncoming cars intermittently illuminate her features. Suddenly, big drops of rain begin to splatter against the windshield, alerting Mary to the onset of rain. As the rain intensifies, backlit by the harsh glare of headlights, she activates the windshield wipers, which struggle against the deluge of rain. Gazing intently through the blurred windshield, she reduces her speed, maneuvering cautiously along the waterlogged highway, her eyes straining through the torrent. The once frequent oncoming lights diminish, leaving her surrounded by an overwhelming expanse of blackness and rain. In the distance, barely discernible through the rain-streaked windshield, a faint neon sign emerges, blurred and obscured by the relentless downpour. Determined, she presses on the accelerator, urging her car forward through the flooded road, ultimately arriving at her destination, where the lights within the office beckon welcomingly. Stepping out, she tries the office door, finds it unlocked, and enters the building. Making her way to the desk, she rings a small pushbell, though her attention is soon diverted to another direction, slightly behind the office. Her gaze follows a path leading from the motel office, guiding her view directly toward a house, where a single light glows brightly in one of the upstairs rooms."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The car dealer waits on the lot for Mary, who approaches while absorbed in her newspaper. As she nears, she suddenly notices the Patrolman watching her with a dispassionate gaze, making her feel exposed. Trying to ignore him, she reluctantly browses a nearby car. The car dealer returns, and Mary, aware of the Patrolman and now joined by the Mechanic who retrieves her suitcase, decides to act. She hurries to her car and drives off with a tense mind, observed by the car dealer, Mechanic, and Patrolman. \n\nAs Mary drives into dusk, the camera captures her weary expression, revealing her anxiety and deep contemplation. Neon signs begin to light up the roadside as evening turns to night. The imagined voices in her head evoke guilt and regret as she navigates the darkening road. Heavy rain starts, and Mary struggles with the windshield wipers against the torrential downpour. Peering through the blurred windshield, she persists along the flooded highway, seeing fewer headlights and more blackness. Finally, a distant neon sign becomes visible through the rain. She reaches her destination, enters the open office, rings a bell on the desk, and notices a path leading to a lit room in the nearby house."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The car dealer, who works at one of the largest dealerships in town, is out on the lot now, standing and waiting for Mary. As she approaches, lost in her newspaper, which features headlines about a recent local crime spree, he smiles. She stops suddenly, almost with a gasp. She has seen the Patrolman, an officer known for his stern demeanor and unsolved case investigations. He is staring over at her, his face dispassionate. Mary has to force herself to look away. He starts into Mary's car, a well-worn sedan she's been driving for years. She stands in the middle of the lot, feeling like a shooting target. He still watches. With a self-angry sigh of resignment over her current predicament, she goes to a close car, looks at it. The Car Dealer is returning, his footsteps echoing on the concrete. As the car dealer looks at her in amazement, she reaches into her bag, feels the money-filled envelope meant for her overdue bills, pauses. Mary pauses, turns, sees the Patrolman, then the Mechanic, a friendly local known for his quick repairs. Then the Mechanic waves, starts forward with her suitcase, ready for a pre-arranged plan. The Mechanic smiles, throws the suitcase in. Mary zooms off, leaving a cloud of dust behind. As she drives out of the lot, we see the Mechanic, the Car Dealer, and the Patrolman all looking after her, connected by unspoken questions. Mary is driving tensely, knowing she has a long journey ahead. CAMERA IS CLOSE on Mary's face now, recording her anxiety, her fears. Mary looks weary, tired with strain and with hard driving on unfamiliar roads. Her eyes are heavy with worry and deep thought. We can see that it is much later in the day, almost dusk, as the sun sets behind the mountains. Now we cut to the view of the road, from Mary's viewpoint. Darkness of evening is coming, a symbol of her uncertain future. In the dim twilight, we see the neon sign of roadside restaurants like the famed Route 66 diners and gas stations beginning to blaze on, promising brief respite. Back on Mary's face, and after a moment, the imagined voices again haunt her thoughts. A flush of painful guilt and regret rises up in Mary's face, a sign of her inner turmoil. The first oncoming headlights slash at the windshield. The oncoming headlights blurt at her, distractions in the enveloping night. It is completely dark now, night. Oncoming headlights throw a blinding light across her features, highlighting her distress. Big drops of rain begin to appear, typical of this region's unpredictable weather. She is becoming aware of the rain starting, its presence oddly comforting. The rain increasing and backlit by the oncoming headlights creates a dazzling display. Mary starts the windshield wipers, which clatter rhythmically. The wipers are having a battle with the now torrential rain, reminiscent of her internal struggle. Peering through the blurred windshield, slowing down in the flooding highway known for frequent accidents, peering through the windshield. The oncoming lights are fewer, just blackness and rain, peering. An almost undiscernible light in the far distance, a neon sign blurred by the rain-sheeted windshield, points to a nearby motel. She presses down, forces the car to move on through the flooded road, determined to reach safety. The lights are on within the office of the small roadside inn, a known haven for weary travelers. She tries the door, finds it open, goes into the office, grateful for shelter. Mary goes to the desk, rings a small pushbell, hoping for assistance. She looks off in another direction, slightly behind the office, and sees a cozy-looking but eerily quiet house. A path from the motel office leads directly up to this house, shrouded in mystery. There is a light on in one of the upstairs rooms, casting a warm glow that contrasts with the night outside."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He starts into Mary's car The car dealer is out on the lot now standing and waiting for Mary As she approaches lost in her newspaper he smiles She stops suddenly almost with a gasp She has seen the Patrolman He is staring over at her his face dispassionate Mary has to force herself to look away He starts into Mary's car She stands in the middle of the lot feeling like a shooting target The lights are on within the office He still watches Mary goes to the desk rings a small pushbell We can see that it is much later in the day almost dusk A flush of painful guilt and regret rises up in Mary's face With a selfangry sigh of resignment she goes to a close car looks at it The car dealer is out on the lot now standing and waiting for Mary The Car Dealer is returning As the car dealer looks at her in amazement she reaches into her bag feels the moneyfilled envelope pauses Mary pauses turns sees the Patrolman then the Mechanic Then the Mechanic waves starts forward with her suitcase As she approaches lost in her newspaper he smiles Then the Mechanic waves starts forward with her suitcase The Mechanic smiles throws the suitcase in Mary zooms off The Mechanic smiles throws the suitcase in As she drives out of the lot we see the Mechanic the Car Dealer and the Patrolman all looking after her Peering through the blurred windshield slowing down in the flooding highway peering through the windshield Mary is driving tensely CAMERA IS CLOSE on Mary's face now recording her anxiety her fears As she drives out of the lot we see the Mechanic the Car Dealer and the Patrolman all looking after her Mary looks weary tired with strain and with hard driving Her eyes are heavy with worry and deep thought We can see that it is much later in the day almost dusk She looks off in another direction slightly behind the office and sees Now we cut to the view of the road from Mary's viewpoint Darkness of evening is coming In the dim twilight we see the neon sign of roadside restaurants and gas stations beginning to blaze on She stands in the middle of the lot feeling like a shooting target Mary is driving tensely Back on Mary's face and after a moment the imagined voices again A flush of painful guilt and regret rises up in Mary's face The first oncoming headlights slash at the windshield The oncoming headlights blurt at her In the dim twilight we see the neon sign of roadside restaurants and gas stations beginning to blaze on It is completely dark now night Mary looks weary tired with strain and with hard driving Oncoming headlights throw a blinding light across her features on Mary's face now recording her anxiety her fears Big drops of rain begin to appear She is becoming aware of the rain starting An almost undiscernible light in the far distance a neon sign blurred by the rainsheeted windshield Mary zooms off She presses down forces the car to move on through the flooded road The rain increasing and backlit by the oncoming headlights Mary starts the windshield wipers She stops suddenly almost with a gasp The wipers are having a battle with the now torrential rain Peering through the blurred windshield slowing down in the flooding highway peering through the windshield The oncoming lights are fewer just blackness and rain peering An almost undiscernible light in the far distance a neon sign blurred by the rainsheeted windshield She presses down forces the car to move on through the flooded road The rain increasing and backlit by the oncoming headlights The lights are on within the office She tries the door finds it open goes into the office Mary has to force herself to look away Mary goes to the desk rings a small pushbell She looks off in another direction slightly behind the office and sees He still watches A path from the motel office leads directly up to this house There is a light on in one of the upstairs rooms"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The car dealer is out on the lot now standing and waiting for Mary. As she approaches lost in her newspaper he smiles. She stops suddenly almost with a gasp. She has seen the Patrolman. He is staring over at her his face dispassionate. Mary has to force herself to look away. He starts into Mary's car. She stands in the middle of the lot feeling like a shooting target. He still watches. With a selfangry sigh of resignment she goes to a close car looks at it. The Car Dealer is returning. As the car dealer looks at her in amazement she reaches into her bag feels the moneyfilled envelope pauses. Mary pauses turns sees the Patrolman then the Mechanic. Then the Mechanic waves starts forward with her suitcase. The Mechanic smiles throws the suitcase in. Mary zooms off. As she drives out of the lot we see the Mechanic the Car Dealer and the Patrolman all looking after her. Mary is driving tensely. CAMERA IS CLOSE. on Mary's face now recording her anxiety her fears. Mary looks weary tired with strain and with hard driving. Her eyes are heavy with worry and deep thought. We can see that it is much later in the day almost dusk. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. Now we cut to the view of the road from Mary's viewpoint. Darkness of evening is coming. In the dim twilight we see the neon sign of roadside restaurants and gas stations beginning to blaze on. Back on Mary's face and after a moment the imagined voices again. A flush of painful guilt and regret rises up in Mary's face. The first oncoming headlights slash at the windshield. The oncoming headlights blurt at her. It is completely dark now night. Oncoming headlights throw a blinding light across her features. Big drops of rain begin to appear. She is becoming aware of the rain starting. The rain increasing and backlit by the oncoming headlights. Mary starts the windshield wipers. The wipers are having a battle with the now torrential rain. Peering through the blurred windshield slowing down in the flooding highway peering through the windshield. The oncoming lights are fewer just blackness and rain peering. An almost undiscernible light in the far distance a neon sign blurred by the rainsheeted windshield. She presses down forces the car to move on through the flooded road. The lights are on within the office. She tries the door finds it open goes into the office. Mary goes to the desk rings a small pushbell. She looks off in another direction slightly behind the office and sees. A path from the motel office leads directly up to this house. There is a light on in one of the upstairs rooms."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The car dealer is out on the lot now standing and waiting for Mary. As she approaches lost in her newspaper he smiles. She stops suddenly almost with a gasp. She has seen the Patrolman. He is staring over at her his face dispassionate. Mary has to force herself to look away. He starts into Mary's car. She stands in the middle of the lot feeling like a shooting target. He still watches. With a selfangry sigh of resignment she goes to a close car looks at it. The Car Dealer is returning. As the car dealer looks at her in amazement she reaches into her bag feels the moneyfilled envelope pauses. Mary pauses turns sees the Patrolman then the Mechanic. Then the Mechanic waves starts forward with her suitcase. The Mechanic smiles throws the suitcase in. Mary zooms off. As she drives out of the lot we see the Mechanic the Car Dealer and the Patrolman all looking after her. Mary is driving tensely. CAMERA IS CLOSE. on Mary's face now recording her anxiety her fears. Mary looks weary tired with strain and with hard driving. Her eyes are heavy with worry and deep thought. We can see that it is much later in the day almost dusk. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Now we cut to the view of the road from Mary's viewpoint. Darkness of evening is coming. In the dim twilight we see the neon sign of roadside restaurants and gas stations beginning to blaze on. Back on Mary's face and after a moment the imagined voices again. A flush of painful guilt and regret rises up in Mary's face. The first oncoming headlights slash at the windshield. The oncoming headlights blurt at her. It is completely dark now night. Oncoming headlights throw a blinding light across her features. Big drops of rain begin to appear. She is becoming aware of the rain starting. The rain increasing and backlit by the oncoming headlights. Mary starts the windshield wipers. The wipers are having a battle with the now torrential rain. Peering through the blurred windshield slowing down in the flooding highway peering through the windshield. The oncoming lights are fewer just blackness and rain peering. An almost undiscernible light in the far distance a neon sign blurred by the rainsheeted windshield. She presses down forces the car to move on through the flooded road. The lights are on within the office. She tries the door finds it open goes into the office. Mary goes to the desk rings a small pushbell. She looks off in another direction slightly behind the office and sees. A path from the motel office leads directly up to this house. There is a light on in one of the upstairs rooms."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The car dealer is out on the lot now standing and waiting for Mary. As she approaches lost in her newspaper he smiles. She stops suddenly almost with a gasp. She has seen the Patrolman. He is staring over at her his face dispassionate. Mary has to force herself to look away. He starts into Mary's car. She stands in the middle of the lot feeling like a shooting target. He still watches. With a selfangry sigh of resignment she goes to a close car looks at it. The Car Dealer is returning. As the car dealer looks at her in amazement she reaches into her bag feels the moneyfilled envelope pauses. Mary starts the windshield wipers. The wipers are having a battle with the now torrential rain. Peering through the blurred windshield slowing down in the flooding highway peering through the windshield. The oncoming lights are fewer just blackness and rain peering. An almost undiscernible light in the far distance a neon sign blurred by the rainsheeted windshield. She presses down forces the car to move on through the flooded road. The lights are on within the office. She tries the door finds it open goes into the office. Mary goes to the desk rings a small pushbell. She looks off in another direction slightly behind the office and sees. A path from the motel office leads directly up to this house. There is a light on in one of the upstairs rooms."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The car dealer is out on the lot now standing and waiting for Mary. As she approaches lost in her newspaper he smiles. She stops suddenly almost with a gasp. She has seen the Patrolman. He is staring over at her his face dispassionate. She tries the door finds it open goes into the office. Mary goes to the desk rings a small pushbell. She looks off in another direction slightly behind the office and sees. A path from the motel office leads directly up to this house. There is a light on in one of the upstairs rooms."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The astronaut is out on the lot now, standing and waiting for the horse. As the horse approaches, lost in its newspaper, the astronaut smiles. The horse stops suddenly, almost with a gasp. The horse has seen the librarian. The librarian is staring over at the horse, her face dispassionate. The horse has to force itself to look away. The librarian starts into the horse's car. The horse stands in the middle of the lot, feeling like a shooting target. The librarian still watches. With a self-angry sigh of resignment, the horse goes to a close car, looks at it. The astronaut is returning. As the astronaut looks at the horse in amazement, the horse reaches into its bag, feels the money-filled envelope, pauses. The horse pauses, turns, sees the librarian, then the painter. Then the painter waves, starts forward with its suitcase. The painter smiles, throws the suitcase in. The horse zooms off. As it drives out of the lot, we see the painter, the astronaut, and the librarian all looking after it. The horse is driving tensely. CAMERA IS CLOSE on the horse's face now, recording its anxiety, its fears. The horse looks weary, tired with strain and with hard driving. Its eyes are heavy with worry and deep thought. We can see that it is much later in the day, almost dusk. Now we cut to the view of the road, from the horse's viewpoint. Darkness of evening is coming. In the dim twilight, we see the neon sign of roadside restaurants and gas stations beginning to blaze on. Back on the horse's face, and after a moment, the imagined voices again. A flush of painful guilt and regret rises up in the horse's face. The first oncoming headlights slash at the windshield. The oncoming headlights blurt at it. It is completely dark now, night. Oncoming headlights throw a blinding light across its features. Big drops of rain begin to appear. The horse is becoming aware of the rain starting. The rain increasing and backlit by the oncoming headlights. The horse starts the windshield wipers. The wipers are having a battle with the now torrential rain. Peering through the blurred windshield, slowing down in the flooding highway, peering through the windshield. The oncoming lights are fewer, just blackness and rain, peering. An almost undiscernible light in the far distance, a neon sign blurred by the rain-sheeted windshield. The horse presses down, forces the car to move on through the flooded road. The lights are on within the office. The horse tries the door, finds it open, goes into the office. The horse goes to the desk, rings a small pushbell. It looks off in another direction, slightly behind the office, and sees. A path from the motel office leads directly up to this house. There is a light on in one of the upstairs rooms."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The car dealer is out on the pier now, standing and waiting for Mary. As she approaches, lost in her magazine, he smiles. She stops suddenly, almost with a gasp. She has seen the Florist. He is staring over at her, his face dispassionate. Mary has to force herself to look away. He starts into Mary's boat. She stands in the middle of the pier, feeling like a shooting target. He still watches. With a self-angry sigh of resignment, she goes to a nearby yacht, looks at it. The Car Dealer is returning. As the car dealer looks at her in amazement, she reaches into her purse, feels the stamp-filled envelope, pauses. Mary pauses, turns, sees the Florist, then the Gardener. Then the Gardener waves, starts forward with her backpack. The Gardener smiles, throws the backpack in. Mary sails off. As she sails out of the pier, we see the Gardener, the Car Dealer, and the Florist all looking after her. Mary is sailing tensely. CAMERA IS CLOSE on Mary's face now, recording her anxiety, her fears. Mary looks weary, tired with strain and with hard sailing. Her eyes are heavy with worry and deep thought. We can see that it is much later in the day, almost dusk. Now we cut to the view of the sea, from Mary's viewpoint. Darkness of evening is coming. In the dim twilight, we see the neon sign of roadside diners and supply stores beginning to blaze on. Back on Mary's face, and after a moment, the imagined voices again. A flush of painful guilt and regret rises up in Mary's face. The first oncoming spotlight slashes at the sail. The oncoming spotlight blurts at her. It is completely dark now, night. Oncoming spotlight throws a blinding light across her features. Big drops of sleet begin to appear. She is becoming aware of the sleet starting. The sleet increasing and backlit by the oncoming spotlight. Mary starts the sail wipers. The wipers are having a battle with the now torrential sleet. Peering through the blurred sail, slowing down in the flooding ocean, peering through the sail. The oncoming lights are fewer, just blackness and sleet, peering. An almost undiscernible light in the far distance, a neon sign blurred by the sleet-sheeted sail. She presses down, forces the boat to move on through the flooded ocean. The lights are on within the kiosk. She tries the hatch, finds it open, goes into the kiosk. Mary goes to the counter, rings a small pushbell. She looks off in another direction, slightly behind the kiosk, and sees. A trail from the marina kiosk leads directly up to this lodge. There is a light on in one of the upstairs chambers."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The car dealer roams the lot now, sitting and resting for Mary. As she advances, engrossed in her newspaper, he nods. She halts abruptly, almost with a sigh. She has noted the Patrolman. He is gazing over at her, his face expressionless. Mary has to prompt herself to glance away. He jumps into Mary's car. She wanders in the middle of the lot, feeling like a static target. He still observes. With a self-disappointed sigh of acceptance, she strolls to a nearby car, stares at it. The Car Dealer is departing. As the car dealer gapes at her in disbelief, she digs into her bag, taps the money-filled envelope, hesitates. Mary hesitates, spins, spots the Patrolman, then the Mechanic. Then the Mechanic signals, strides backward with her suitcase. The Mechanic chuckles, tosses the suitcase in. Mary speeds off. As she coasts out of the lot, we spot the Mechanic, the Car Dealer, and the Patrolman all gazing after her. Mary is driving anxiously. CAMERA IS CLOSE on Mary's face now, capturing her tension, her doubts. Mary appears exhausted, drained with stress and with rigorous driving. Her eyes are weighted with concern and deep contemplation. We can notice that it is much later in the day, almost twilight. Now we switch to the view of the road, from Mary's perspective. Gloom of evening is arriving. In the dim dusk, we discern the neon sign of roadside restaurants and gas stations beginning to flicker on. Back on Mary's face, and after a moment, the imaginary voices again. A surge of painful shame and remorse rises up in Mary's face. The first approaching headlights strike at the windshield. The approaching headlights shout at her. It is entirely dark now, night. Approaching headlights cast a glaring light across her features. Large drops of rain start to form. She is becoming conscious of the rain beginning. The rain increasing and illuminated by the approaching headlights. Mary activates the windshield wipers. The wipers are struggling against the now deluge of rain. Gazing through the smeared windshield, decelerating in the inundated highway, gazing through the windshield. The approaching lights are fewer, just obscurity and rain, gazing. An almost indistinct light in the far distance, a neon sign obscured by the rain-covered windshield. She eases off, encourages the car to press on through the waterlogged road. The lights are on within the office. She nudges the door, discovers it ajar, steps into the office. Mary goes to the desk, taps a small pushbell. She glances off in another direction, slightly behind the office, and notices. A path from the motel office winds directly up to this house. There is a light on in one of the upstairs rooms."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The bicycle courier is out on the plaza now, standing and waiting for Jason. As he approaches, lost in his magazine, she grins. He halts suddenly, almost with a hiccup. He has seen the Librarian. She is staring over at him, her expression neutral. Jason has to force himself to glance away. She climbs into Jason's bike. He stands in the center of the plaza, feeling like a dartboard. She still watches. With a self-frustrated sigh of acceptance, he goes to a nearby scooter, examines it. The Bicycle Courier is returning. As the bicycle courier looks at him in astonishment, he reaches into his backpack, feels the coin-filled pouch, hesitates. Jason hesitates, turns, spots the Librarian, then the Chef. Then the Chef waves, strides forward with his briefcase. The Chef grins, tosses the briefcase in. Jason speeds away. As he pedals out of the plaza, we see the Chef, the Bicycle Courier, and the Librarian all staring after him. Jason is pedaling tensely. CAMERA IS CLOSE on Jason's face now, capturing his concern, his apprehensions. Jason appears exhausted, weary with stress and with intense cycling. His eyes are laden with anxiety and deep contemplation. We perceive that it is much later in the afternoon, nearly nightfall. Now we transition to the view of the street, from Jason's perspective. Darkness of night is approaching. In the murky dusk, we observe the fluorescent glow of roadside cafes and repair shops beginning to ignite. Back on Jason's face, and after a pause, the imagined echoes once more. A wave of painful shame and remorse rises up in Jason's expression. The first nearing streetlights slice at the handlebars. The nearing streetlights holler at him. It is fully nighttime now, evening. Nearing streetlights cast a blinding glow across his features. Large droplets of drizzle begin to materialize. He is becoming conscious of the drizzle commencing. The drizzle intensifying and backlit by the nearing streetlights. Jason activates the handlebars. The handlebars are having a confrontation with the now pelting drizzle. Peering through the misted lenses, decelerating in the inundated roadway, peering through the lenses. The nearing glows are fewer, just obscurity and drizzle, peering. An almost indiscernible glow in the distant horizon, a fluorescent sign obscured by the drizzle-sheeted lenses. He presses forward, urges the bike to proceed through the submerged path. The glows are on within the kiosk. He attempts the entrance, finds it ajar, enters the kiosk. Jason heads to the counter, taps a small pushbutton. He glances off in a different direction, slightly behind the kiosk, and perceives. A trail from the inn kiosk leads directly up to this villa. There is a glow on in one of the upstairs chambers."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The baker is out on the street now, crouching and listening for Sally. As she approaches, engrossed in her novel, he winks. She spins abruptly, almost with a hiccup. She has spotted the Librarian. He is glaring over at her, his face indifferent. Sally has to urge herself to glance away. He climbs into Sally's bicycle. She kneels in the middle of the street, feeling like a sitting duck. He still observes. With a self-annoyed grunt of acceptance, she walks to a nearby bicycle, examines it. The Baker is departing. As the baker stares at her in bewilderment, she reaches into her pocket, touches the jewel-filled pouch, hesitates. Sally halts, pivots, spots the Librarian, then the Barber. Then the Barber nods, walks toward her with her backpack. The Barber grins, places the backpack in. Sally speeds off. As she pedals out of the street, we see the Barber, the Baker, and the Librarian all gazing after her. Sally is cycling nervously. CAMERA IS CLOSE on Sally's face now, capturing her unease, her worries. Sally appears exhausted, worn out with tension and with fast cycling. Her eyes are filled with concern and deep contemplation. We can see that it is much later in the day, almost twilight. Now we shift to the scene of the trail, from Sally's perspective. Shadows of nightfall are encroaching. In the dim twilight, we observe the neon glow of roadside cafés and service stations starting to flare up. Back on Sally's face, and after a moment, the imagined echoes again. A surge of acute remorse and sorrow rises up in Sally's expression. The first approaching taillights slice at the handlebars. The approaching taillights blurt at her. It is completely dark now, night. Approaching taillights cast a dazzling glow across her features. Large splashes of rain begin to surface. She is noticing the rain beginning. The rain intensifying and backlit by the approaching taillights. Sally activates the horn. The horn is contending with the now torrent-like rain. Squinting through the misted handlebars, decelerating in the overflowing path, squinting through the handlebars. The approaching lights are scarcer, just darkness and rain, squinting. A barely discernible beacon in the far distance, a neon sign clouded by the rain-slicked handlebars. She taps down, urges the bicycle to press on through the inundated trail. The lights are lit within the diner. She pushes the door, discovers it ajar, enters the diner. Sally moves to the counter, taps a small buzzer. She gazes off in another direction, slightly behind the diner, and glimpses. A trail from the diner leads directly up to this cabin. There is a glow in one of the upstairs windows."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The fruit vendor is out on the beach now, reclining and hoping for Mary. As she approaches, distracted by her magazine, he chuckles. She halts abruptly, almost with a whistle. She has spotted the Gardener. He is glancing over at her, his face impassive. Mary has to convince herself to gaze away. He clambers into Mary's truck. She lounges in the middle of the beach, feeling like a stranded raft. He still observes. With a self-disappointed puff of resignation, she walks to a nearby bicycle, examines it. The Fruit Vendor is returning. As the fruit vendor gawks at her in astonishment, she delves into her pocket, touches the coin-filled pouch, hesitates. Mary hesitates, turns, notices the Gardener, then the Carpenter. Then the Carpenter salutes, strides forward with her backpack. The Carpenter smirks, tosses the backpack in. Mary darts off. As she cycles out of the beach, we see the Carpenter, the Fruit Vendor, and the Gardener all observing her departure. Mary is pedaling nervously. CAMERA IS CLOSE on Mary's face now, capturing her unease, her dread. Mary looks drained, exhausted with tension and with intense cycling. Her eyes are laden with unease and deep reflection. We can see that it is much later in the day, nearly twilight. Now we cut to the view of the path, from Mary's perspective. Shadows of evening are creeping. In the faint evening light, we see the neon sign of roadside bakeries and repair shops starting to flicker on. Back on Mary's face, and after a moment, the imagined echoes again. A rush of uncomfortable remorse and sorrow rises up in Mary's expression. The first distant lanterns flicker at the horizon. The nearing lanterns blurt at her. It is completely night now, evening. Nearing lanterns cast a blinding glow across her visage. Big drops of dew begin to emerge. She is noticing the dew forming. The dew escalating and backlit by the nearing lanterns. Mary ignites the window defogger. The defogger is fighting with the now heavy dew. Gazing through the misted window, slowing down on the waterlogged path, gazing through the window. The nearing lights are sparser, just darkness and dew, gazing. An almost indistinguishable glow in the far expanse, a neon sign blurred by the dew-streaked window. She steps down, urges the truck to move on through the submerged path. The lights are on within the cabin. She tries the shutter, finds it ajar, steps into the cabin. Mary advances to the counter, taps a small buzzer. She glances off in another direction, slightly behind the cabin, and notices. A trail from the hostel cabin leads directly up to this villa. There is a glow on in one of the upper chambers."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The magician is out on the stage now, juggling and anticipating for Sylvia. As she enters, absorbed in her brochure, he chuckles. She pauses abruptly, almost with a chuckle. She has spotted the Zookeeper. He is glaring over at her, his face indifferent. Sylvia has to compel herself to glance away. He hops into Sylvia's van. She lingers in the middle of the stage, feeling like a dancing puppet. He still gazes. With a self-deprecating sigh of acceptance, she heads to a nearby bicycle, examines it. The Magician is returning. As the magician gazes at her in bewilderment, she reaches into her wallet, touches the document-filled folder, hesitates. Sylvia hesitates, pivots, notices the Zookeeper, then the Chef. Then the Chef nods, walks forward with her backpack. The Chef grins, tosses the backpack in. Sylvia cruises away. As she rides out of the stage, we observe the Chef, the Magician, and the Zookeeper all staring after her. Sylvia is riding anxiously. CAMERA IS CLOSE on Sylvia's face now, capturing her nervousness, her uncertainty. Sylvia appears exhausted, drained with tension and with intense riding. Her eyes are heavy with concern and deep reflection. We can see that it is much later in the afternoon, almost twilight. Now we cut to the perspective of the trail, from Sylvia's viewpoint. Shadows of nightfall are encroaching. In the dim dusk, we see the neon glow of roadside diners and service stations beginning to flicker on. Back on Sylvia's face, and after a while, the imagined thoughts again. A wave of painful remorse and sorrow emerges on Sylvia's face. The initial approaching forecast casts light at the windshield. The approaching forecast blurts at her. It is entirely black now, evening. Approaching forecast casts a glaring glow across her features. Large droplets of mist begin to materialize. She is becoming conscious of the mist commencing. The mist intensifying and silhouetted by the approaching forecast. Sylvia activates the sunroof. The sunroof is waging a war with the now deluging mist. Squinting through the foggy windshield, decelerating on the inundated trail, squinting through the windshield. The approaching glimmers are scarcer, just darkness and mist, squinting. A nearly unperceivable sparkle in the distant horizon, a neon glow blurred by the mist-soaked windshield. She accelerates, propels the van to travel on through the inundated track. The glows are on within the studio. She tries the knob, discovers it unlocked, enters the studio. Sylvia approaches the counter, taps a tiny pushbutton. She glances off in another direction, slightly beyond the studio, and perceives. A trail from the campground studio leads directly up to this villa. There is a glow in one of the upper quarters."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The car dealer waits for Mary on the lot as she approaches, engrossed in her newspaper. She suddenly stops upon noticing the dispassionate Patrolman watching her, forcing herself to look away. Feeling exposed, Mary examines a nearby car while the Car Dealer approaches. She hesitates, feeling the money in her bag, and notices the Mechanic waving with her suitcase. He loads it into her car, and Mary drives off tensely. As night falls, Mary's anxiety grows, visible on her weary face. The darkness, headlights, and a torrential rainstorm amplify her unease. She struggles with visibility, fighting through blurred vision and flooding roads. Finally, she spots a distant neon sign and pushes on. Arriving at the motel, Mary enters the office and rings a bell, noticing a path leading to a house with a lit upstairs room."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "There is a light on in one of the upstairs rooms A path from the motel office leads directly up to this house She looks off in another direction slightly behind the office and sees Mary goes to the desk rings a small pushbell She tries the door finds it open goes into the office The lights are on within the office She presses down forces the car to move on through the flooded road An almost undiscernible light in the far distance a neon sign blurred by the rainsheeted windshield The oncoming lights are fewer just blackness and rain peering Peering through the blurred windshield slowing down in the flooding highway peering through the windshield The wipers are having a battle with the now torrential rain Mary starts the windshield wipers The rain increasing and backlit by the oncoming headlights She is becoming aware of the rain starting Big drops of rain begin to appear Oncoming headlights throw a blinding light across her features It is completely dark now night The oncoming headlights blurt at her The first oncoming headlights slash at the windshield A flush of painful guilt and regret rises up in Mary's face Back on Mary's face and after a moment the imagined voices again In the dim twilight we see the neon sign of roadside restaurants and gas stations beginning to blaze on Darkness of evening is coming Now we cut to the view of the road from Mary's viewpoint We can see that it is much later in the day almost dusk Her eyes are heavy with worry and deep thought Mary looks weary tired with strain and with hard driving on Mary's face now recording her anxiety her fears CAMERA IS CLOSE Mary is driving tensely As she drives out of the lot we see the Mechanic the Car Dealer and the Patrolman all looking after her Mary zooms off The Mechanic smiles throws the suitcase in Then the Mechanic waves starts forward with her suitcase Mary pauses turns sees the Patrolman then the Mechanic As the car dealer looks at her in amazement she reaches into her bag feels the moneyfilled envelope pauses The Car Dealer is returning With a selfangry sigh of resignment she goes to a close car looks at it He still watches She stands in the middle of the lot feeling like a shooting target He starts into Mary's car Mary has to force herself to look away He is staring over at her his face dispassionate She has seen the Patrolman She stops suddenly almost with a gasp As she approaches lost in her newspaper he smiles The car dealer is out on the lot now standing and waiting for Mary"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The oncoming headlights blurt at her Now we cut to the view of the road from Mary's viewpoint Darkness of evening is coming The Car Dealer is returning Her eyes are heavy with worry and deep thought With a selfangry sigh of resignment she goes to a close car looks at it It is completely dark now night The oncoming lights are fewer just blackness and rain peering Mary pauses turns sees the Patrolman then the Mechanic She has seen the Patrolman Mary starts the windshield wipers He is staring over at her his face dispassionate She tries the door finds it open goes into the office Back on Mary's face and after a moment the imagined voices again As the car dealer looks at her in amazement she reaches into her bag feels the moneyfilled envelope pauses She is becoming aware of the rain starting The first oncoming headlights slash at the windshield There is a light on in one of the upstairs rooms CAMERA IS CLOSE Oncoming headlights throw a blinding light across her features A path from the motel office leads directly up to this house Big drops of rain begin to appear The wipers are having a battle with the now torrential rain In the dim twilight we see the neon sign of roadside restaurants and gas stations beginning to blaze on Mary looks weary tired with strain and with hard driving We can see that it is much later in the day almost dusk An almost undiscernible light in the far distance a neon sign blurred by the rainsheeted windshield Mary goes to the desk rings a small pushbell The car dealer is out on the lot now standing and waiting for Mary on Mary's face now recording her anxiety her fears As she drives out of the lot we see the Mechanic the Car Dealer and the Patrolman all looking after her The lights are on within the office Then the Mechanic waves starts forward with her suitcase Peering through the blurred windshield slowing down in the flooding highway peering through the windshield She looks off in another direction slightly behind the office and sees She stops suddenly almost with a gasp A flush of painful guilt and regret rises up in Mary's face Mary has to force herself to look away The rain increasing and backlit by the oncoming headlights He starts into Mary's car He still watches The Mechanic smiles throws the suitcase in Mary zooms off Mary is driving tensely As she approaches lost in her newspaper he smiles She stands in the middle of the lot feeling like a shooting target She presses down forces the car to move on through the flooded road"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Darkness of evening is coming In the dim twilight we see the neon sign of roadside restaurants and gas stations beginning to blaze on Back on Mary's face and after a moment the imagined voices again A flush of painful guilt and regret rises up in Mary's face The first oncoming headlights slash at the windshield The oncoming headlights blurt at her It is completely dark now night Oncoming headlights throw a blinding light across her features Big drops of rain begin to appear She is becoming aware of the rain starting The rain increasing and backlit by the oncoming headlights Mary starts the windshield wipers The wipers are having a battle with the now torrential rain Peering through the blurred windshield slowing down in the flooding highway peering through the windshield The oncoming lights are fewer just blackness and rain peering An almost undiscernible light in the far distance a neon sign blurred by the rainsheeted windshield She presses down forces the car to move on through the flooded road The lights are on within the office She tries the door finds it open goes into the office Mary goes to the desk rings a small pushbell She looks off in another direction slightly behind the office and sees A path from the motel office leads directly up to this house There is a light on in one of the upstairs rooms The car dealer is out on the lot now standing and waiting for Mary As she approaches lost in her newspaper he smiles She stops suddenly almost with a gasp She has seen the Patrolman He is staring over at her his face dispassionate Mary has to force herself to look away He starts into Mary's car She stands in the middle of the lot feeling like a shooting target He still watches With a selfangry sigh of resignment she goes to a close car looks at it The Car Dealer is returning As the car dealer looks at her in amazement she reaches into her bag feels the moneyfilled envelope pauses Mary pauses turns sees the Patrolman then the Mechanic Then the Mechanic waves starts forward with her suitcase The Mechanic smiles throws the suitcase in Mary zooms off As she drives out of the lot we see the Mechanic the Car Dealer and the Patrolman all looking after her Mary is driving tensely CAMERA IS CLOSE on Mary's face now recording her anxiety her fears Mary looks weary tired with strain and with hard driving Her eyes are heavy with worry and deep thought We can see that it is much later in the day almost dusk Now we cut to the view of the road from Mary's viewpoint"
        }
      ]
    }
  ]
}