{
  "ground_truth": "A woman passes the window, pauses, and peers out before quickly going away from the window, allowing us to see her in clear silhouette. After seeing the woman, Mary expects to get some attention and dashes out into the rain to her car, gets in, opens the side window, and begins to honk the horn. After a moment, a young man opens the front door of the house, pauses, and starts down the path. Mary leaves her car and dashes for the shelter of the porch. Seeing that Mary is on her way to the porch, he runs quickly, the umbrella unopened in his hand, and reaches the porch a moment after Mary. He stops short, looks at her, then at the umbrella hanging uselessly in his hand, then back at her, and gestures her into the office, standing back to indicate that he will go after her. Mary goes into the office, and the young man, Norman Bates, somewhere in his late twenties, thin, tall, soft-spoken, and hesitant, follows her in and closes the door. He is now behind the counter, pushing forward the registration book, as Mary places her handbag on the counter. She takes the registration book, picks up the pen, and is suddenly struck with the realization that she'd better use an alias, so she writes the name Marie Samuels. Norman removes a key for Cabin One, and we see that there is a remaining key on the board. He goes to the door and opens it, revealing that the rain has slowed down considerably. Mary follows him to the door, goes out on the porch, waits, and watches as Norman runs to her car, gets in, and drives it to the parking space in front of Cabin One. Mary walks along the porch and waits before the door of Cabin One. Norman gets out of the car with a suitcase, runs to the door, opens it, pushes the door open, puts his hand in, and switches on a light. Mary goes into the cabin, and Norman follows her, places the suitcase on the bed, goes to the window, and opens it. Mary closes the door, goes to the suitcase, opens it, and starts to take out a dress, with her handbag next to the suitcase. She glances down into it, pauses, drops the dress, reaches into the handbag, takes out the money-filled envelope, stares at it almost with regret, contemplates hiding it, decides to, and starts looking for a reasonable hiding place. She looks about at the closet, the drawers, etc., realizing all such places are obvious. Catching sight of the newspaper in her bag, she hits on a solution, opens the newspaper, places the envelope within it, lock-folds the paper again, and then places it on the bedside table as if it were there for later reading.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A lady crosses the pane, hesitates, and gazes out before swiftly departing from the pane, permitting us to observe her in distinct silhouette. After observing the lady, Mary anticipates receiving some notice and rushes out into the downpour to her automobile, gets in, opens the lateral pane, and commences to sound the klaxon. After an instant, a youthful male opens the main entry of the residence, hesitates, and initiates down the route. Mary departs her automobile and rushes for the refuge of the veranda. Seeing that Mary is on her way to the veranda, he sprints swiftly, the parasol unopened in his hand, and achieves the veranda a moment after Mary. He halts abruptly, regards her, then at the parasol dangling ineffectively in his hand, then back at her, and motions her into the bureau, standing back to signify that he will proceed after her. Mary enters the bureau, and the youthful male, Norman Bates, somewhere in his late twenties, slender, tall, gentle-spoken, and tentative, trails her in and secures the entry. He is now behind the counter, advancing the enrollment log, as Mary places her purse on the counter. She takes the enrollment log, picks up the pen, and is suddenly hit with the realization that she'd better use a pseudonym, so she inscribes the designation Marie Samuels. Norman extracts a key for Cabin One, and we observe that there is a remaining key on the board. He proceeds to the entry and opens it, disclosing that the downpour has diminished considerably. Mary follows him to the entry, exits onto the veranda, lingers, and observes as Norman runs to her automobile, gets in, and drives it to the parking spot in front of Cabin One. Mary strolls along the veranda and waits before the entry of Cabin One. Norman exits the automobile with a valise, runs to the entry, opens it, pushes the entry open, puts his hand in, and switches on a light. Mary enters the cabin, and Norman follows her, places the valise on the bed, proceeds to the pane, and opens it. Mary secures the entry, proceeds to the valise, opens it, and starts to take out a gown, with her purse beside the valise. She glances down into it, hesitates, drops the gown, reaches into the purse, takes out the currency-filled packet, stares at it almost with remorse, considers concealing it, decides to, and starts searching for a reasonable concealment spot. She surveys at the wardrobe, the drawers, etc., realizing all such spots are conspicuous. Catching sight of the periodical in her bag, she discovers a solution, opens the periodical, places the packet within it, lock-folds the periodical again, and then places it on the bedside stand as if it were there for subsequent perusal."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A window is passed by a woman, paused at, and peered out of before quickly being moved away from by her, allowing us to see her in clear silhouette. After the woman is seen, attention is expected by Mary, and the rain is dashed into by her to reach her car. The side window is opened, and the horn is begun to be honked by her. After a moment, the front door of the house is opened by a young man, paused at, and the path is begun to be started down by him. The car is left by Mary, and the shelter of the porch is dashed for by her. Seeing that the porch is being approached by Mary, he quickly runs, the umbrella held unopened in his hand, and the porch is reached a moment after Mary by him. He stops short, looks at her, then at the umbrella hanging uselessly in his hand, then back at her, and gestures her into the office, standing back to indicate that he will go after her. The office is entered by Mary, and the young man, Norman Bates, somewhere in his late twenties, thin, tall, soft-spoken, and hesitant, follows her in and closes the door. The counter is now stood behind by him, the registration book being pushed forward by him, as her handbag is placed on the counter by Mary. The registration book is taken by her, the pen is picked up, and she is suddenly struck with the realization that an alias had better be used by her, so the name Marie Samuels is written by her. A key for Cabin One is removed by Norman, and it is seen by us that there is a remaining key on the board. The door is approached by him and opened, revealing that the rain has slowed down considerably. He is followed to the door by Mary, who goes out on the porch, waits, and watches as her car is run to by Norman, gotten into, and driven to the parking space in front of Cabin One. The porch is walked along by Mary, and the door of Cabin One is waited before by her. The car is gotten out of by Norman with a suitcase, and he runs to the door, opens it, and pushes the door open. His hand is put in, and a light is switched on by him. The cabin is entered by Mary, and Norman follows her, the suitcase being placed on the bed by him. The window is approached by him and opened. The door is closed by Mary, the suitcase is approached by her, it is opened, and a dress is started to be taken out by her, with her handbag next to the suitcase. A glance down into it is given by her, a pause taken, the dress is dropped, and into the handbag is reached by her, the money-filled envelope being taken out by her. It is stared at almost with regret by her, contemplated being hidden by her, a decision made to do so, and a reasonable hiding place is started to be looked for by her. She looks about at the closet, the drawers, etc., realizing that all such places are obvious. A solution is hit on by her, catching sight of the newspaper in her bag, and the newspaper is opened by her. The envelope is placed within it, and the paper is lock-folded again, then placed on the bedside table by her as if it were there for later reading."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A woman passes a window, pauses to peer out, then moves away, revealing her silhouette. Mary, seeking attention, rushes out into the rain to her car, opens a window, and honks. A young man exits the house, pauses, and heads down the path. Mary runs to the porch, and the man, umbrella unused, reaches it right after her. He gestures Mary into the office. Inside, Norman Bates, late twenties, thin, tall, soft-spoken, pushes forward the registration book. Mary, realizing she should use an alias, writes Marie Samuels. Norman gives her the key to Cabin One and opens the door to reveal the rain has lessened. Mary watches as he drives her car to Cabin One. She waits by the door, and Norman, with a suitcase, opens the cabin and turns on a light. Mary enters, and Norman places the suitcase on the bed, opens the window, then leaves. Alone, Mary opens the suitcase, takes out a dress, and notices her handbag. She hesitates, retrieves a money-filled envelope, contemplates, and decides to hide it. After considering obvious hiding spots, she places the envelope in a newspaper, folds it, and leaves it on the bedside table."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A woman pauses at a window, peers out, then moves away, revealing her silhouette. Mary expects attention and rushes into the rain to her car, opens the window, and honks. A young man exits the house and approaches. Mary runs to the porch, and he follows with an unopened umbrella. He gestures her into the office. Mary enters, followed by Norman Bates, a thin, hesitant young man. Behind the counter, he hands her the registration book. Mary, realizing she needs an alias, writes \"Marie Samuels.\" Norman gives her the key to Cabin One. As the rain slows, he drives her car to the cabin. Mary waits, then follows him in. Norman places her suitcase on the bed, opens the window, and leaves. Mary unpacks, her handbag beside her. She takes out a money-filled envelope, hesitates, then decides to hide it. After considering hiding places, she chooses the newspaper in her bag, concealing the envelope inside and placing it on the bedside table."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A woman makes her way past the window, briefly halts, and gazes out before hastily moving away from the window, allowing her silhouette to be seen clearly and distinctly. After observing this woman, Mary anticipates receiving some attention and swiftly dashes out into the pouring rain toward her car. She climbs in, cranks down the side window, and begins to sound the car horn insistently. After a brief moment, a young man steps out of the front door of the house, pauses momentarily, and then starts to make his way down the path. Mary gets out of her car and rushes toward the shelter provided by the porch. Observing that Mary is heading toward the porch, the young man runs quickly, holding the umbrella still closed in his hand, and arrives at the porch just a few moments after Mary. He stops abruptly, glances at her, then at the umbrella hanging uselessly in his hand, then back at her again, and gestures for her to enter the office, stepping aside politely to indicate that he will follow her. Mary heads into the office, and the young man, Norman Bates, who appears to be in his late twenties, thin, tall, soft-spoken, and a bit hesitant, follows her inside and closes the door behind them. He positions himself behind the counter, pushing forward the registration book as Mary places her handbag gently on the counter. She takes the registration book, picks up the pen, and suddenly experiences a realization that it would be wiser to use a false name, so she writes down the alias, Marie Samuels. Norman retrieves a key for Cabin One, and we observe that there is still one key remaining on the board. He proceeds to the door, pulls it open, and reveals that the rain outside has slowed down considerably. Mary follows him to the door, steps out onto the porch, waits there, and watches as Norman runs to her car, gets inside, and drives it to the parking space located in front of Cabin One. Mary walks along the porch and stands waiting just before the door of Cabin One. Norman alights from the car with a suitcase in hand, hurries to the door, opens it, pushes the door ajar, reaches inside, and turns on a light. Mary steps into the cabin, and Norman follows her inside, placing the suitcase on the bed, and then goes over to the window, opening it. Mary closes the door securely, moves to the suitcase, opens it, and begins to take out a dress, with her handbag situated next to the suitcase. She glances down at the handbag, pauses thoughtfully, drops the dress, reaches into the handbag, takes out the money-filled envelope, and stares at it almost with a sense of regret. She contemplates the idea of hiding it, decides to do so, and starts looking for a suitable hiding place. She looks around at the closet, the drawers, and other areas, realizing that all such places are quite obvious. Catching sight of the newspaper tucked in her bag, she devises a solution, opens the newspaper, places the envelope within its folds, re-folds the paper securely, and then places it casually on the bedside table as if it had been left there for later reading."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As a woman slowly makes her way past the large window, she takes a brief moment to halt in her stride and gazes thoughtfully out into the distance before hastily moving away. Her silhouette is clearly and distinctly seen against the glass, creating a striking contrast. After observing this intriguing woman, Mary anticipates receiving some attention herself and swiftly dashes out into the pouring rain, making her way toward her parked car. She climbs inside the vehicle, soon cranking down the side window and beginning to sound the car horn in an insistent manner. After a brief moment, a young man emerges from the front door of the house, pauses momentarily to adjust his stance, and then begins to make his way down the garden path. Mary, in turn, gets out of her car quickly and rushes toward the shelter provided by the porch. Observing that Mary is heading straight for the porch, the young man hurries along, holding the umbrella, which remains closed in his hand, and arrives at the porch just a few moments after Mary does. He stops abruptly, glances at her with a thoughtful expression, then at the umbrella hanging uselessly in his hand, and then back at her again. With a polite gesture, he indicates for her to enter the office, stepping aside courteously to show that he will follow her inside. Mary confidently heads into the office, with the young man, known as Norman Bates, who appears to be in his late twenties, thin, tall, soft-spoken, and displaying a bit of hesitation, follows her inside and gently closes the door behind them. He positions himself behind the counter, pushing forward the registration book as Mary gently places her handbag down on the counter next to the pen. She takes up the registration book, picks up the pen, and suddenly experiences a realization that it might be wiser to use a false name. Consequently, she writes down the alias, Marie Samuels. Norman then retrieves a key designated for Cabin One, and we can observe that there is still one key remaining on the board. He proceeds to open the door, revealing that the rain outside has slowed down considerably, its intensity noticeably diminished. Mary follows him to the door, steps out onto the porch, pauses there, and watches attentively as Norman runs over to her car, gets inside, and drives it to the parking space situated directly in front of Cabin One. Mary proceeds along the porch and stands waiting patiently just before the door of Cabin One. Norman alights from the car with a suitcase in hand, hurries over to the door, opens it, pushes the door ajar, reaches inside, and turns on a light, illuminating the interior. Mary steps into the cabin, and Norman follows her inside, placing the suitcase gently on the bed. He then goes over to the window to open it, allowing fresh air to circulate. Mary closes the door securely, moves over to the suitcase, opens it, and begins to take out a dress, with her handbag situated next to the suitcase. She glances down at the handbag, pauses thoughtfully, and drops the dress. Reaching into her handbag, she takes out the envelope filled with money and stares at it almost with a sense of regret. She contemplates the idea of hiding it, firmly decides to do so, and starts looking for a suitable hiding place. She looks around at the closet, the drawers, and other areas, realizing with growing awareness that all such places are quite obvious. Then, catching sight of the newspaper tucked in her bag, she devises a solution. She opens the newspaper, places the envelope within its folds, re-folds the paper securely, and then places it casually on the bedside table as if it had been left there for later reading."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A woman walks past the window, momentarily halting and leaning slightly forward to peer out with curiosity before retreating quickly, which causes her figure to be sharply outlined against the window. Witnessing this, Mary anticipates receiving some form of acknowledgment and, filled with urgency, races into the drizzling rain towards her parked car. She hurriedly opens the car door, slides into the driver's seat, and immediately cranks down the side window, after which she leans over slightly and starts honking the horn persistently. After a brief span, a young man appears as he opens the front door of the house. He pauses there momentarily, surveying the wet outdoors before commencing his walk down the pathway. Meanwhile, Mary exits her car swiftly and makes a beeline for the protection of the porch. Noticing Mary's approach, he accelerates his pace, clutching an umbrella that remains tightly shut in his hand, and reaches the porch just moments after Mary’s arrival. He comes to a sudden halt, shifting his gaze first to Mary and then to the umbrella still clutched ineffectively in his hand, before returning his gaze to Mary. With a thoughtful gesture, he indicates the entrance to the office, implying that Mary should proceed inside ahead of him. Mary obliges, stepping into the office, with the young man, Norman Bates, who appears to be in his late twenties, characterized by his thin and tall frame, as well as his soft-spoken and hesitant demeanor, trailing behind and shutting the door once inside. Norman positions himself behind the counter, gently pushing the registration book towards Mary, who places her handbag down on the counter. She picks up the registration book, takes hold of the pen, and suddenly has a moment of realization that prompts her to use an alias; she quickly writes down the name Marie Samuels. Norman retrieves a key for Cabin One, subtly revealing that there is just one other key remaining on the board. He proceeds to the door, opens it, and they both notice that the rain has significantly subsided. Mary follows Norman to the door, steps out onto the porch, and watches with anticipation as Norman briskly makes his way to her car, gets in, and maneuvers the vehicle into the designated parking space in front of Cabin One. Mary ambles along the porch and waits expectantly in front of the door to Cabin One. Norman exits the car, carrying a suitcase, dashes to the cabin door, opens it, pushes the door ajar, extends his arm inside, and flicks on the light switch. Mary steps into the cabin, and Norman comes in after her, setting the suitcase on the bed before heading to the window and opening it to let in fresh air. Mary, in turn, closes the door, approaches the suitcase, unzips it, and begins to remove a dress with her handbag situated nearby. Her eyes drift down to the handbag, prompting her to pause as she drops the dress, reaches into the handbag, extracts an envelope stuffed with money, and gazes at it with a hint of regret. She contemplates the need to conceal it, resolves to do so, and starts scanning her surroundings for a suitable hiding spot. As she assesses potential locations like the closet and drawers, recognizing their obviousness, her eyes land on a newspaper in her bag, inspiring her to formulate a plan. She opens the newspaper, slips the envelope discreetly inside, folds the paper securely shut, and places it on the bedside table as though it were intended for reading later."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A woman briefly peers out the window before moving away, revealing her silhouette. Witnessing this, Mary anticipates attention, hurriedly exits into the rain, and reaches her car, where she begins honking the horn after rolling down the window. A young man soon appears at the house door, pauses, and heads down the path. Mary quickly seeks shelter on the porch, prompting the man to hasten toward her with an unopened umbrella. They arrive simultaneously, and after a brief exchange, he gestures for her to enter the office first, following her inside. He, Norman Bates, a slender, hesitant man in his late twenties, is now behind the counter and offers the registration book as Mary places her handbag down. She opts to use an alias, writing \"Marie Samuels,\" while Norman retrieves a key for Cabin One, with another key still on the board. He opens the door to reveal the rain has calmed. Mary follows him outside, watching as he runs to her car, drives it to the cabin's parking space, and returns with her suitcase. He opens the cabin door, switches on the light, and enters with Mary, placing the suitcase on the bed and opening the window. As Mary prepares to unpack, she is struck by the presence of her money-filled envelope, hesitates, and decides to hide it. After considering obvious spots like the closet and drawers, she conceals it within a newspaper, placing it inconspicuously on the bedside table as if for later perusal."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A woman passes the window of the house, which is located in a quiet neighborhood known for its vintage architecture, pauses, and peers out before quickly going away from the window, allowing us to see her in clear silhouette. After seeing the woman, Mary, who has been waiting for this moment due to a pressing need to remain unnoticed, expects to get some attention and dashes out into the rain to her car, a dependable blue sedan she purchased last year, gets in, opens the side window, and begins to honk the horn. After a moment, a young man, who is the caretaker of this old, somewhat isolated house, opens the front door of the house, pauses, and starts down the path. Mary leaves her car and dashes for the shelter of the porch, which has sheltered many guests over the years at this particular establishment. Seeing that Mary is on her way to the porch, he runs quickly, the umbrella unopened in his hand, and reaches the porch a moment after Mary. He stops short, looks at her, then at the umbrella hanging uselessly in his hand, then back at her, and gestures her into the office, which serves as a check-in point for visitors, standing back to indicate that he will go after her. Mary goes into the office, and the young man, Norman Bates, somewhere in his late twenties, thin, tall, soft-spoken, and hesitant, follows her in and closes the door. He is now behind the counter, pushing forward the registration book, as Mary places her handbag on the counter, revealing a glimpse of her hurried lifestyle. She takes the registration book, picks up the pen, and is suddenly struck with the realization that she'd better use an alias, a precaution to keep her identity concealed, so she writes the name Marie Samuels. Norman removes a key for Cabin One, a cozy but somewhat neglected lodging option, and we see that there is a remaining key on the board. He goes to the door and opens it, revealing that the rain has slowed down considerably, almost as if nature was providing a brief respite for her. Mary follows him to the door, goes out on the porch, waits, and watches as Norman runs to her car, gets in, and drives it to the parking space in front of Cabin One, a spot frequently occupied by short-term visitors. Mary walks along the porch and waits before the door of Cabin One. Norman gets out of the car with a suitcase, runs to the door, opens it, pushes the door open, puts his hand in, and switches on a light, illuminating the modest interior of the cabin. Mary goes into the cabin, and Norman follows her, places the suitcase on the bed, goes to the window, and opens it, allowing the fresh, rain-cleansed air to seep in. Mary closes the door, goes to the suitcase, opens it, and starts to take out a dress, with her handbag next to the suitcase, a personal item that holds more than just her belongings. She glances down into it, pauses, drops the dress, reaches into the handbag, takes out the money-filled envelope, a source of both anxiety and necessity, stares at it almost with regret, contemplates hiding it, decides to, and starts looking for a reasonable hiding place. She looks about at the closet, the drawers, etc., realizing all such places are obvious at a place like this. Catching sight of the newspaper in her bag, she hits on a solution, opens the newspaper, places the envelope within it, lock-folds the paper again, and then places it on the bedside table as if it were there for later reading, a clever disguise for her secret."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "A woman passes the window pauses and peers out before quickly going away from the window allowing us to see her in clear silhouette. After seeing the woman Mary expects to get some attention and dashes out into the rain to her car gets in opens the side window and begins to honk the horn. After a moment a young man opens the front door of the house pauses and starts down the path. Mary leaves her car and dashes for the shelter of the porch. Seeing that Mary is on her way to the porch he runs quickly the umbrella unopened in his hand and reaches the porch a moment after Mary. He stops short looks at her then at the umbrella hanging uselessly in his hand then back at her and gestures her into the office standing back to indicate that he will go after her. Mary goes into the office and the young man Norman Bates somewhere in his late twenties thin tall softspoken and hesitant follows her in and closes the door. He is now behind the counter pushing forward the registration book as Mary places her handbag on the counter. She takes the registration book picks up the pen and is suddenly struck with the realization that she would better use an alias so she writes the name Marie Samuels. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Norman removes a key for Cabin One and we see that there is a remaining key on the board. He goes to the door and opens it revealing that the rain has slowed down considerably. Mary follows him to the door goes out on the porch waits and watches as Norman runs to her car gets in and drives it to the parking space in front of Cabin One. Mary walks along the porch and waits before the door of Cabin One. Norman gets out of the car with a suitcase runs to the door opens it pushes the door open puts his hand in and switches on a light. Mary goes into the cabin and Norman follows her places the suitcase on the bed goes to the window and opens it. Mary closes the door goes to the suitcase opens it and starts to take out a dress with her handbag next to the suitcase. She glances down into it pauses drops the dress reaches into the handbag takes out the moneyfilled envelope stares at it almost with regret contemplates hiding it decides to and starts looking for a reasonable hiding place. She looks about at the closet the drawers etc realizing all such places are obvious Catching sight of the newspaper in her bag she hits on a solution opens the newspaper places the envelope within it lockfolds the paper again and then places it on the bedside table as if it were there for later reading."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "A woman passes the window pauses and peers out before quickly going away from the window allowing us to see her in clear silhouette. After seeing the woman Mary expects to get some attention and dashes out into the rain to her car gets in opens the side window and begins to honk the horn. After a moment a young man opens the front door of the house pauses and starts down the path. Mary leaves her car and dashes for the shelter of the porch. Seeing that Mary is on her way to the porch he runs quickly the umbrella unopened in his hand and reaches the porch a moment after Mary. He stops short looks at her then at the umbrella hanging uselessly in his hand then back at her and gestures her into the office standing back to indicate that he will go after her. Mary goes into the office and the young man Norman Bates somewhere in his late twenties thin tall softspoken and hesitant follows her in and closes the door. He is now behind the counter pushing forward the registration book as Mary places her handbag on the counter. She takes the registration book picks up the pen and is suddenly struck with the realization that she would better use an alias so she writes the name Marie Samuels. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Norman removes a key for Cabin One and we see that there is a remaining key on the board. He goes to the door and opens it revealing that the rain has slowed down considerably. Mary follows him to the door goes out on the porch waits and watches as Norman runs to her car gets in and drives it to the parking space in front of Cabin One. Mary walks along the porch and waits before the door of Cabin One. Norman gets out of the car with a suitcase runs to the door opens it pushes the door open puts his hand in and switches on a light. Mary goes into the cabin and Norman follows her places the suitcase on the bed goes to the window and opens it. Mary closes the door goes to the suitcase opens it and starts to take out a dress with her handbag next to the suitcase. She glances down into it pauses drops the dress reaches into the handbag takes out the moneyfilled envelope stares at it almost with regret contemplates hiding it decides to and starts looking for a reasonable hiding place. She looks about at the closet the drawers etc realizing all such places are obvious Catching sight of the newspaper in her bag she hits on a solution opens the newspaper places the envelope within it lockfolds the paper again and then places it on the bedside table as if it were there for later reading."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "A woman passes the window pauses and peers out before quickly going away from the window allowing us to see her in clear silhouette. After seeing the woman Mary expects to get some attention and dashes out into the rain to her car gets in opens the side window and begins to honk the horn. After a moment a young man opens the front door of the house pauses and starts down the path. Mary leaves her car and dashes for the shelter of the porch. Seeing that Mary is on her way to the porch he runs quickly the umbrella unopened in his hand and reaches the porch a moment after Mary. Mary goes into the cabin and Norman follows her places the suitcase on the bed goes to the window and opens it. Mary closes the door goes to the suitcase opens it and starts to take out a dress with her handbag next to the suitcase. She glances down into it pauses drops the dress reaches into the handbag takes out the moneyfilled envelope stares at it almost with regret contemplates hiding it decides to and starts looking for a reasonable hiding place. She looks about at the closet the drawers etc realizing all such places are obvious Catching sight of the newspaper in her bag she hits on a solution opens the newspaper places the envelope within it lockfolds the paper again and then places it on the bedside table as if it were there for later reading."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "A woman passes the window pauses and peers out before quickly going away from the window allowing us to see her in clear silhouette. After seeing the woman Mary expects to get some attention and dashes out into the rain to her car gets in opens the side window and begins to honk the horn. She glances down into it pauses drops the dress reaches into the handbag takes out the moneyfilled envelope stares at it almost with regret contemplates hiding it decides to and starts looking for a reasonable hiding place. She looks about at the closet the drawers etc realizing all such places are obvious Catching sight of the newspaper in her bag she hits on a solution opens the newspaper places the envelope within it lockfolds the paper again and then places it on the bedside table as if it were there for later reading."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "A giraffe sidles past the doorway, halts, and glances over before abruptly skipping away from the doorway, allowing us to see it in blurred formation. After encountering the giraffe, Samantha anticipates receiving some assistance and prances into the mist to her bicycle, climbs on, swings the rear basket, and begins to ring the bell. After a moment, a young hedgehog swings open the gate of the barn, halts, and starts along the sidewalk. Samantha leaves her bicycle and prances towards the shade of the bench. Seeing that Samantha is headed to the bench, it crawls rapidly, the parasol unopened in its paw, and reaches the bench a moment after Samantha. It halts abruptly, gazes at her, then at the parasol dangling idly in its paw, then back at her, and beckons her into the tavern, stepping aside to signal that it will follow her. Samantha enters the tavern, and the young hedgehog, Charlie Snickers, somewhere in his early thirties, stout, short, loud-spoken, and assertive, trails her in and shuts the gate. It is now behind the kiosk, nudging forward the attendance log, as Samantha places her backpack on the kiosk. She picks up the attendance log, grasps the crayon, and is suddenly overtaken with the recognition that she'd better use a fake name, so she scribbles the name Annie Sprinkles. Charlie plucks a feather for Hut Seven, and we observe there is a leftover feather on the rack. It skips to the gate and pushes it, revealing that the mist has lifted significantly. Samantha tails it to the gate, steps onto the bench, lingers, and observes as Charlie rides to her bicycle, hops on, and pedals it to the resting spot in front of Hut Seven. Samantha strolls along the bench and lingers before the entrance of Hut Seven. Charlie dismounts the bicycle with a backpack, scuttles to the entrance, swings it ajar, shoves the entrance open, extends its paw in, and flicks on a lantern. Samantha steps into the hut, and Charlie trails her, places the backpack on the hammock, trots to the doorway, and pushes it open. Samantha shuts the entrance, advances to the backpack, unlocks it, and proceeds to extract a jacket, with her backpack beside the hammock. She peers down into it, halts, drops the jacket, digs into the backpack, pulls out the coin-filled wallet, gawks at it almost wistfully, ponders concealing it, resolves to do so, and commences hunting for a suitable hiding spot. She scans the area at the cupboard, the shelves, etc., realizing all such locations are conspicuous. Capturing sight of the brochure in her backpack, she lands upon an idea, unfolds the brochure, slips the wallet inside it, folds the brochure anew, and then places it on the rocking chair as if intended for subsequent reading."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A woman pauses outside a window, silhouetted, then leaves. Mary hopes for attention and rushes to her car in the rain, honking the horn. A young man, Norman Bates, opens the house door, notices Mary, and joins her on the porch, his umbrella unused. He gestures Mary inside, following her into the office where she registers under the alias \"Marie Samuels.\" Norman gives her the key to Cabin One. The rain eases as he fetches Mary's car, parking it by the cabin. Inside, Mary opens her suitcase, takes out a dress, and hesitates when seeing a money-filled envelope. She considers hiding the money, settles on wrapping it in a newspaper, and places it on the bedside table as if for later reading."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She looks about at the closet the drawers etc realizing all such places are obvious Catching sight of the newspaper in her bag she hits on a solution opens the newspaper places the envelope within it lockfolds the paper again and then places it on the bedside table as if it were there for later reading She glances down into it pauses drops the dress reaches into the handbag takes out the moneyfilled envelope stares at it almost with regret contemplates hiding it decides to and starts looking for a reasonable hiding place Mary closes the door goes to the suitcase opens it and starts to take out a dress with her handbag next to the suitcase Mary goes into the cabin and Norman follows her places the suitcase on the bed goes to the window and opens it Norman gets out of the car with a suitcase runs to the door opens it pushes the door open puts his hand in and switches on a light Mary walks along the porch and waits before the door of Cabin One Mary follows him to the door goes out on the porch waits and watches as Norman runs to her car gets in and drives it to the parking space in front of Cabin One He goes to the door and opens it revealing that the rain has slowed down considerably Norman removes a key for Cabin One and we see that there is a remaining key on the board She takes the registration book picks up the pen and is suddenly struck with the realization that she would better use an alias so she writes the name Marie Samuels He is now behind the counter pushing forward the registration book as Mary places her handbag on the counter Mary goes into the office and the young man Norman Bates somewhere in his late twenties thin tall softspoken and hesitant follows her in and closes the door He stops short looks at her then at the umbrella hanging uselessly in his hand then back at her and gestures her into the office standing back to indicate that he will go after her Seeing that Mary is on her way to the porch he runs quickly the umbrella unopened in his hand and reaches the porch a moment after Mary Mary leaves her car and dashes for the shelter of the porch After a moment a young man opens the front door of the house pauses and starts down the path After seeing the woman Mary expects to get some attention and dashes out into the rain to her car gets in opens the side window and begins to honk the horn A woman passes the window pauses and peers out before quickly going away from the window allowing us to see her in clear silhouette"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "After seeing the woman Mary expects to get some attention and dashes out into the rain to her car gets in opens the side window and begins to honk the horn A woman passes the window pauses and peers out before quickly going away from the window allowing us to see her in clear silhouette Mary leaves her car and dashes for the shelter of the porch After a moment a young man opens the front door of the house pauses and starts down the path He stops short looks at her then at the umbrella hanging uselessly in his hand then back at her and gestures her into the office standing back to indicate that he will go after her Seeing that Mary is on her way to the porch he runs quickly the umbrella unopened in his hand and reaches the porch a moment after Mary He is now behind the counter pushing forward the registration book as Mary places her handbag on the counter Mary goes into the office and the young man Norman Bates somewhere in his late twenties thin tall softspoken and hesitant follows her in and closes the door Norman removes a key for Cabin One and we see that there is a remaining key on the board She takes the registration book picks up the pen and is suddenly struck with the realization that she would better use an alias so she writes the name Marie Samuels Mary follows him to the door goes out on the porch waits and watches as Norman runs to her car gets in and drives it to the parking space in front of Cabin One He goes to the door and opens it revealing that the rain has slowed down considerably Norman gets out of the car with a suitcase runs to the door opens it pushes the door open puts his hand in and switches on a light Mary walks along the porch and waits before the door of Cabin One Mary closes the door goes to the suitcase opens it and starts to take out a dress with her handbag next to the suitcase Mary goes into the cabin and Norman follows her places the suitcase on the bed goes to the window and opens it She looks about at the closet the drawers etc realizing all such places are obvious Catching sight of the newspaper in her bag she hits on a solution opens the newspaper places the envelope within it lockfolds the paper again and then places it on the bedside table as if it were there for later reading She glances down into it pauses drops the dress reaches into the handbag takes out the moneyfilled envelope stares at it almost with regret contemplates hiding it decides to and starts looking for a reasonable hiding place"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Norman removes a key for Cabin One and we see that there is a remaining key on the board He goes to the door and opens it revealing that the rain has slowed down considerably Mary follows him to the door goes out on the porch waits and watches as Norman runs to her car gets in and drives it to the parking space in front of Cabin One Mary walks along the porch and waits before the door of Cabin One Norman gets out of the car with a suitcase runs to the door opens it pushes the door open puts his hand in and switches on a light Mary goes into the cabin and Norman follows her places the suitcase on the bed goes to the window and opens it Mary closes the door goes to the suitcase opens it and starts to take out a dress with her handbag next to the suitcase She glances down into it pauses drops the dress reaches into the handbag takes out the moneyfilled envelope stares at it almost with regret contemplates hiding it decides to and starts looking for a reasonable hiding place She looks about at the closet the drawers etc realizing all such places are obvious Catching sight of the newspaper in her bag she hits on a solution opens the newspaper places the envelope within it lockfolds the paper again and then places it on the bedside table as if it were there for later reading A woman passes the window pauses and peers out before quickly going away from the window allowing us to see her in clear silhouette After seeing the woman Mary expects to get some attention and dashes out into the rain to her car gets in opens the side window and begins to honk the horn After a moment a young man opens the front door of the house pauses and starts down the path Mary leaves her car and dashes for the shelter of the porch Seeing that Mary is on her way to the porch he runs quickly the umbrella unopened in his hand and reaches the porch a moment after Mary He stops short looks at her then at the umbrella hanging uselessly in his hand then back at her and gestures her into the office standing back to indicate that he will go after her Mary goes into the office and the young man Norman Bates somewhere in his late twenties thin tall softspoken and hesitant follows her in and closes the door He is now behind the counter pushing forward the registration book as Mary places her handbag on the counter She takes the registration book picks up the pen and is suddenly struck with the realization that she would better use an alias so she writes the name Marie Samuels"
        }
      ]
    }
  ]
}