{
  "ground_truth": "Mary walks slowly to the window, realizing that the terrible voice is coming from the house behind the cabins. The camera follows her to the window, and once there, we see the light is still on in the upstairs bedroom, and the voice is coming from that room. Mary stands by the window, listening with mounting distress, concern, and sympathy. She turns her face away, gazing sadly at the little empty room, then turns to look out the window. We see Norman coming down the path, carrying a napkin-covered tray. Mary looks at him for a moment, then turns quickly, goes to the door, opens it, and goes out onto the porch. Mary pauses outside the door, about to start forward when Norman comes around the building, walks along the porch past the office, stopping only when he is close to her. He stares with painful embarrassment at the knowing look in her eye. She begins to back into her room, and Norman starts to follow but hesitates as he sees the total picture of an attractive young woman and a motel room. Bringing down the tray of food, in defiance of his mother's orders, is about the limit of his defiance for one day. Without waiting for approval or disapproval, he turns and hurries to the office. Mary looks after him, her face showing amused sympathy, then follows. Norman looks about, tray in hand, sees there is no reasonable place to spread out a supper. He turns and sees Mary standing in the doorway. As Norman goes about spreading out the bread and ham and pouring the milk, we follow Mary across the room. She notices the paintings on the wall; nudes, primarily, and many with a vaguely religious overtone. Finally, Mary reaches the sofa, sits down, and looks at the spread. Mary begins to eat, her attitude a bit tense. She takes up a small slice of ham, bites off a tiny bite, and nibbles at it in the manner of one disturbed and preoccupied. Norman gazes at her, at the tiny bite she has taken, smiles, and then laughs. Mary looks at him, with some compression, and smiles. Norman turns slowly, looking at her with a striking coldness. The fury suddenly dies, abruptly and completely, and he sinks back into his chair. Mary watches the troubled man, almost physically pained by his anguish. She goes out of the parlor. We see her from Norman's viewpoint as she crosses the small office and goes out into the night. He goes into the office and looks at the book. He goes back into the parlor with a mystified expression. Norman turns his ear from the direction of the sounds, seems to be fighting an impulse to listen, or more than listen.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Mary strolls sluggishly to the pane, comprehending that the dreadful tone is originating from the residence behind the shacks. The camera trails her to the pane, and once there, we observe the illumination is still on in the upstairs chamber, and the tone is originating from that room. Mary stands by the pane, listening with escalating distress, concern, and empathy. She turns her visage away, gazing mournfully at the little vacant chamber, then turns to peer out the pane. We observe Norman arriving down the path, carrying a napkin-covered platter. Mary observes him for a moment, then turns swiftly, proceeds to the entrance, unseals it, and proceeds out onto the veranda. Mary pauses outside the entrance, about to begin forward when Norman appears around the edifice, strolls along the veranda past the bureau, stopping only when he is near to her. He gazes with painful discomfort at the perceptive glance in her eye. She commences to retreat into her chamber, and Norman starts to pursue but hesitates as he perceives the complete impression of an alluring young lady and a motel chamber. Bringing down the platter of nourishment, in defiance of his mother's directives, is about the extent of his defiance for one day. Without awaiting for approval or disapproval, he turns and rushes to the bureau. Mary observes after him, her visage displaying amused empathy, then follows. Norman observes about, platter in hand, perceives there is no plausible locale to spread out a supper. He turns and perceives Mary standing in the entryway. As Norman goes about spreading out the loaf and pork and pouring the milk, we trail Mary across the chamber. She notices the paintings on the wall; nudes, chiefly, and many with a vaguely spiritual undertone. Finally, Mary reaches the sofa, perches down, and observes the spread. Mary commences to eat, her demeanor a bit strained. She picks up a small slice of pork, bites off a tiny morsel, and nibbles at it in the manner of one agitated and preoccupied. Norman gazes at her, at the tiny morsel she has taken, smiles, and then chuckles. Mary observes him, with some compression, and smiles. Norman turns sluggishly, observing her with a striking chillness. The rage suddenly perishes, abruptly and completely, and he sinks back into his seat. Mary watches the troubled man, almost physically pained by his torment. She goes out of the lounge. We observe her from Norman's viewpoint as she crosses the small bureau and goes out into the night. He goes into the bureau and observes the book. He goes back into the lounge with a mystified expression. Norman turns his ear from the direction of the noises, seems to be battling an impulse to listen, or more than listen."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Mary walks slowly to the window, realizing that the terrible voice is coming from the house behind the cabins. She is followed by the camera to the window, and once there, the light is still seen to be on in the upstairs bedroom, and that room is from where the voice is coming. The window is stood by Mary, listening with mounting distress, concern, and sympathy. Her face is turned away by her, gazing sadly at the little empty room, then she turns to look out the window. Norman is seen coming down the path, carrying a napkin-covered tray. He is looked at by Mary for a moment, then she quickly turns, goes to the door, opens it, and goes out onto the porch. The door is paused outside of by Mary, about to start forward when Norman comes around the building, walking along the porch past the office, stopping only when he is close to her. He painfully stares with embarrassment at the knowing look in her eye. She begins to back into her room, and he starts to follow but hesitates as the total picture of an attractive young woman and a motel room is seen by him. Bringing down the tray of food, in defiance of his mother's orders, is about the limit of his defiance for one day. He turns and hurries to the office without waiting for approval or disapproval. After him is looked by Mary, her face showing amused sympathy, then she follows. About is looked by Norman, tray in hand, and he sees there is no reasonable place to spread out a supper. He turns and sees Mary standing in the doorway. As the bread and ham are spread out and the milk is poured by Norman, Mary is followed across the room. The paintings on the wall are noticed by her; nudes, primarily, and many with a vaguely religious overtone. Finally, the sofa is reached by Mary, she sits down, and the spread is looked at by her. Eating is begun by Mary, her attitude a bit tense. A small slice of ham is taken up by her, and she bites off a tiny bite, nibbling at it in the manner of one disturbed and preoccupied. He gazes at her, at the tiny bite she has taken, smiles, and then laughs. He is looked at by Mary, with some compression, and she smiles. Slowly, he turns, looking at her with a striking coldness. The fury suddenly dies in him, abruptly and completely, and he sinks back into his chair. The troubled man is watched by Mary, almost physically pained by his anguish. Out of the parlor she goes. She is seen from Norman's viewpoint as she crosses the small office and goes out into the night. The office is gone into by him, and the book is looked at. Back into the parlor, he goes with a mystified expression. His ear is turned by Norman from the direction of the sounds, and an impulse to listen, or more than listen, seems to be fighting him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Mary slowly walks to the window, realizing the frightening voice comes from the house behind the cabins. The camera follows, and we see light in the upstairs bedroom where the voice originates. Mary listens, distressed and sympathetic. She gazes sadly at the empty room, then out the window, seeing Norman with a napkin-covered tray. She quickly goes to the door and steps onto the porch. Norman rounds the building, walking along the porch past the office, stopping near her with an embarrassed look. She retreats to her room, and he hesitates, considering the young woman and motel room before leaving for the office. Mary watches with amused sympathy, then follows him. Norman, holding the tray, finds no suitable place for a supper. Mary stands in the doorway as he spreads out the bread, ham, and milk. We follow her across the room, noticing religious-themed nude paintings. Mary sits, eating tensely, nibbling a small ham slice. Norman observes her tiny bite and laughs. She smiles back, but his expression turns cold, fury dying as he sinks back. Mary watches him, pained by his distress, then leaves the parlor. From Norman's perspective, she crosses the office and exits into the night. He goes into the office, checks the book, and returns to the parlor, confused, resisting an urge to listen or do more."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Mary slowly approaches the window, realizing the terrible voice originates from the house behind the cabins. The camera follows, showing the upstairs bedroom light is on, where the voice emanates. Distressed, Mary listens by the window, then gazes sadly at the empty room before looking outside. Norman appears, carrying a tray. Mary observes briefly, then heads outside, pausing as Norman walks by. He stares at her, embarrassed by her knowing look. As she backs into her room, Norman hesitates, seeing her and the room. Bringing the tray, defying his mother, is his limit for defiance that day. Without waiting, he hurries to the office. Mary follows, her face showing amused sympathy. Norman, with the tray, sees no place for supper. He notices Mary in the doorway. While spreading bread and ham, Mary crosses the room, noting the religious-toned paintings. She sits, nibbling ham tensely. Norman observes, smiling, then laughing. Mary returns a smile. Norman's expression turns cold but softens as he sinks back, troubled. Mary, pained by his anguish, leaves the parlor. From Norman's view, she crosses the office into the night. Mystified, he examines the book, then returns, battling an impulse to listen further."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Mary moves slowly and deliberately toward the window, gradually becoming aware that the dreadful voice she hears is emanating from the house located right behind the cabins. The camera smoothly follows her path to the window, and once there, it reveals that the light remains on in the upstairs bedroom, the very location from which the unsettling voice originates. Mary stands quietly by the window, her expression revealing increasing distress, concern, and deep sympathy. She turns her face away from the scene, gazing sadly at the small, empty room before shifting her focus back to the view outside the window. As we watch, Norman emerges down the path, carefully carrying a tray that is covered by a napkin. Mary observes him intently for a brief moment, then swiftly turns, heads to the door, opens it, and steps out onto the porch. Mary pauses slightly just outside the door, poised to move forward, when Norman appears from around the building. He walks along the porch, passing the office, and only stops when he is standing very close to her. He stares with visible painful embarrassment, noting the knowing look in her eyes. She begins to retreat back into her room, and although Norman starts to follow, he hesitates upon seeing the complete picture of an attractive young woman and a motel room. Bringing down the tray of food, in defiance of his mother's orders, represents the maximum extent of his rebellion for that day. Without waiting for any form of approval or disapproval, he quickly turns and hurries away to the office. Mary watches him go, her face showing a mix of amused sympathy, before she follows him. Norman glances around, tray still in hand, realizing there is no suitable place to properly set out a supper. He turns and notices Mary standing there in the doorway. As Norman methodically goes about spreading out the bread and ham and carefully pouring the milk, we follow Mary's path across the room. She takes notice of the paintings on the wall, which are mostly nudes, many of which seem to carry a vaguely religious overtone. Eventually, Mary reaches the sofa, sits down, and looks at the meal spread before her. Mary begins to eat, although her demeanor remains somewhat tense. She picks up a small slice of ham, bites off a tiny piece, and nibbles at it in a manner that suggests she is disturbed and preoccupied. Norman gazes at her, noting the tiny bite she has taken, and this observation leads him to smile and then laugh. Mary looks up at him, with some compression in her expression, and offers a smile in return. Norman turns slowly, regarding her with a striking coldness. His fury suddenly dissipates, vanishing abruptly and completely, and he sinks back into his chair, visibly deflated. Mary watches the troubled man, almost physically pained by his evident anguish. She silently exits the parlor. From Norman's viewpoint, we watch her as she crosses the small office and steps out into the night. He moves into the office himself and looks at the book, then returns to the parlor wearing a mystified expression. Norman turns his ear away from the direction of the sounds, appearing to grapple internally with an impulse to listen, or perhaps even to do more than just listen."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Mary moves with slow, deliberate steps toward the window, gradually becoming increasingly aware that the dreadful voice she hears is coming from the house located right behind the cabins. The camera smoothly follows her as she makes her way to the window, revealing that the light remains on in the upstairs bedroom, the very place from which the unsettling voice seems to originate. Mary stands quietly by the window, her expression revealing a growing sense of distress, concern, and deep sympathy. She turns her face away from the scene, casting a sad gaze at the small and empty room before shifting her focus back to the view outside the window once more. As we continue to watch, we see Norman emerging from the path, carefully carrying a tray that is neatly covered by a napkin. Mary observes him intently for a brief, telling moment before she swiftly turns, heads to the door, opens it, and steps out onto the porch. Mary pauses slightly just outside the door, poised to move forward, when Norman appears from around the building. He walks along the porch, passing by the office, and only stops when he is standing very close to her. He stares at her with visible, painful embarrassment, noting the knowing look in her eyes. She begins to retreat back into her room, and although Norman starts to follow her, he hesitates upon seeing the complete picture of an attractive young woman and a motel room. Bringing down the tray of food, in defiance of his mother's orders, represents the maximum extent of his rebellion for that day. Without waiting for any form of approval or disapproval, he quickly turns and hurries away to the office. Mary watches him as he goes, her face showing a mix of amused sympathy, before she decides to follow him. Norman glances around, tray still in hand, realizing there is no suitable place to properly set out a supper. He turns his gaze and notices Mary standing there in the doorway. As Norman methodically goes about spreading out the bread and ham and carefully pouring the milk, we follow Mary's path across the room. She takes notice of the paintings on the wall, which are mostly nudes, many of which seem to carry a vaguely religious overtone. Eventually, Mary reaches the sofa, sits down, and looks at the meal spread before her. Mary begins to eat, although her demeanor remains somewhat tense. She picks up a small slice of ham, bites off a tiny piece, and nibbles at it in a manner that suggests she is disturbed and preoccupied. Norman gazes at her, noting the tiny bite she has taken, and this observation leads him to smile and then laugh. Mary looks up at him, with some compression in her expression, and offers a smile in return. Norman turns slowly, regarding her with a striking coldness. His fury suddenly dissipates, vanishing abruptly and completely, and he sinks back into his chair, visibly deflated. Mary watches the troubled man, almost physically pained by his evident anguish. She silently exits the parlor. From Norman's viewpoint, we watch her as she crosses the small office and steps out into the night. He moves into the office himself and looks at the book, then returns to the parlor wearing a mystified expression. Norman turns his ear away from the direction of the sounds, appearing to grapple internally with an impulse to listen, or perhaps even to do more than just listen."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Mary gradually makes her way towards the window, her pace slow as she becomes increasingly aware that the unsettling voice is emanating from the house situated behind the cabins. The camera smoothly pans to capture her movement, maintaining focus on her as she approaches the window. Upon reaching it, she notices the upstairs bedroom remains illuminated, and it becomes evident that the voice originates from that particular room. Standing near the window, Mary listens intently, her expression revealing an escalating blend of distress, concern, and sympathy. With a heavy heart, she slowly turns her face away from the window to gaze wistfully at the small, empty room, then shifts her focus back to the view outside. There, she observes Norman making his way down the path, a tray cloaked in a napkin balanced carefully in his hands. Mary regards him for a brief moment before swiftly pivoting on her heels, quickly moving to the door, opening it, and stepping out onto the porch. Pausing momentarily just outside the door, she seems ready to proceed when Norman appears from around the building, walking along the porch. Passing by the office, he halts only when he reaches her vicinity. He locks eyes with her, feeling a sharp sting of embarrassment as he perceives the knowing look in her eyes. Beginning to retreat into her room, Mary senses Norman’s intent to follow but notices his hesitation as he takes in the full scene—a young, attractive woman in a motel room. He realizes that bringing down the food tray, defying his mother's wishes, has already stretched his limits for the day. Opting not to wait for any form of approval or disapproval from her, he promptly turns and hustles back to the office. Mary watches him depart, her amusement tinged with sympathy, and subsequently decides to follow. Inside, Norman scans the room, tray still in hand, noting the lack of a suitable surface for laying out supper. Turning, he notices Mary standing there at the doorway. As he busies himself with the task of arranging the bread, ham, and milk, we observe Mary as she traverses the room, her attention drawn to the paintings adorning the walls. Predominantly nudes, the artwork carries a subtle religious undertone. Eventually, Mary reaches the sofa, settles herself down, and casts her eyes over the meal laid before her. Starting to eat, her demeanor remains somewhat tense; she gingerly picks up a small slice of ham, bites off a minuscule portion, and nibbles at it with the air of someone deeply preoccupied and disturbed. Meanwhile, Norman watches her intently, taking note of the tiny bite she has taken, prompting him to smile and then chuckle softly. Mary meets his gaze, her lips compressing into a slight smile. However, Norman’s demeanor shifts as he turns towards her, his expression turning startlingly cold. The fury he felt dissipates as swiftly and completely as it had arisen, leaving him to slump back into his chair, visibly deflated. Mary observes the turmoil within him, almost physically sharing in the pain of his inner struggle. She then quietly exits the parlor, and from Norman's perspective, we see her traversing the small office space, finally disappearing into the night outside. Norman, left in solitude, enters the office and fixates his attention on the book. He returns to the parlor, still wearing a puzzled expression, inwardly grappling with his impulses, torn between resisting and succumbing to the urge to listen more intently to the sounds that surround him."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Mary walks to the window and, upon realizing the distressing voice originates from the house behind the cabins, observes that the light is on in the upstairs bedroom where the voice emanates. Filled with concern and sympathy, she diverts her gaze to the empty room before looking out again to see Norman approaching with a tray. She quickly exits to the porch, pausing as Norman rounds the building and approaches her, awkwardly meeting her knowing gaze. As she retreats into her room, Norman hesitates, overwhelmed by the implications of his defiance in bringing the tray. Without awaiting acknowledgment, he retreats to the office, and Mary follows, her expression a mix of amusement and empathy.\n\nInside, Norman searches for a place to set up the meal. Spotting Mary in the doorway, he begins to spread out the food. Mary, observing the room's art with its religious overtones, reaches the sofa, sits, and begins to eat, visibly preoccupied. Observing her nibbling at the ham, Norman laughs, prompting her to smile back despite her tension. Suddenly, his demeanor changes to coldness before deflating back into his chair. Mary, moved by his visible turmoil, exits the parlor. From Norman's viewpoint, she crosses the small office and disappears into the night. Left alone, he examines the book in the office, returning to the parlor with a puzzled expression, momentarily struggling with an impulse tied to the sounds in the air."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Mary walks slowly to the window of the old Victorian-style house, realizing that the terrible voice is coming from the house behind the cabins, which have been there since the early 1900s and were once a popular tourist destination. The camera follows her to the window, and once there, we see the light is still on in the upstairs bedroom, known for its intricate woodwork, and the voice is coming from that room. Mary stands by the window, listening with mounting distress, concern, and sympathy. She turns her face away, gazing sadly at the little empty room, which was once a lively children's playroom, then turns to look out the window. We see Norman coming down the path, carrying a napkin-covered tray, an old family heirloom. Mary looks at him for a moment, then turns quickly, goes to the door, opens it, and goes out onto the porch of the 19th-century building. Mary pauses outside the door, about to start forward when Norman comes around the building, walks along the porch past the office that has seen many guests over the decades, stopping only when he is close to her. He stares with painful embarrassment at the knowing look in her eye. She begins to back into her room, and Norman starts to follow but hesitates as he sees the total picture of an attractive young woman and a motel room, a setting that makes him uncomfortable due to his sheltered upbringing. Bringing down the tray of food, in defiance of his mother's orders who is famously strict, is about the limit of his defiance for one day. Without waiting for approval or disapproval, he turns and hurries to the office adorned with old travel posters. Mary looks after him, her face showing amused sympathy, then follows. Norman looks about, tray in hand, sees there is no reasonable place to spread out a supper in the cramped space. He turns and sees Mary standing in the doorway watching with curiosity. As Norman goes about spreading out the bread and ham sourced from a local farm and pouring the milk into vintage glassware, we follow Mary across the room. She notices the paintings on the wall; nudes, primarily, and many with a vaguely religious overtone that hint at Norman's complex psyche. Finally, Mary reaches the sofa, sits down, and looks at the spread. Mary begins to eat, her attitude a bit tense. She takes up a small slice of ham, bites off a tiny bite, and nibbles at it in the manner of one disturbed and preoccupied. Norman gazes at her, at the tiny bite she has taken, smiles, and then laughs, a rare break from his usual somber demeanor. Mary looks at him, with some compression, and smiles. Norman turns slowly, looking at her with a striking coldness, reminiscent of his usual demeanor when stressed. The fury suddenly dies, abruptly and completely, and he sinks back into his chair. Mary watches the troubled man, almost physically pained by his anguish associated with deep personal conflicts. She goes out of the parlor. We see her from Norman's viewpoint as she crosses the small office lined with dusty old ledgers and goes out into the night. He goes into the office and looks at the book, an old guest register filled with names from the past. He goes back into the parlor with a mystified expression. Norman turns his ear from the direction of the sounds, seems to be fighting an impulse to listen, or more than listen, as if torn between duty and his own desires."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Mary walks slowly to the window realizing that the terrible voice is coming from the house behind the cabins. The camera follows her to the window and once there we see the light is still on in the upstairs bedroom and the voice is coming from that room. Mary stands by the window listening with mounting distress concern and sympathy. She turns her face away gazing sadly at the little empty room then turns to look out the window. We see Norman coming down the path carrying a napkincovered tray. Mary looks at him for a moment then turns quickly goes to the door opens it and goes out onto the porch. Mary pauses outside the door about to start forward. when Norman comes around the building walks along the porch past the office stopping only when he is close to her. He stares with painful embarrassment at the knowing look in her eye. She begins to back into her room and Norman starts to follow but hesitates as he sees the total picture of an attractive young woman and a motel room. Bringing down the tray of food in defiance of his mother's orders is about the limit of his defiance for one day. Without waiting for approval or disapproval he turns and hurries to the office. Mary looks after him her face showing amused sympathy then follows. Norman looks about tray in hand sees there is no reasonable place to spread out a supper. He turns and sees Mary standing in the doorway. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. As Norman goes about spreading out the bread and ham and pouring the milk we follow Mary across the room. She notices the paintings on the wall nudes primarily and many with a vaguely religious overtone. Finally Mary reaches the sofa sits down and looks at the spread. Mary begins to eat her attitude a bit tense. She takes up a small slice of ham bites off a tiny bite and nibbles at it in the manner of one disturbed and preoccupied. Norman gazes at her at the tiny bite. she has taken smiles and then laughs. Mary looks at him with some compression and smiles. Norman turns slowly looking at her with a striking coldness. The fury suddenly dies abruptly and completely and he sinks back into his chair. Mary watches the troubled man almost physically pained by his anguish. She goes out of the parlor. We see her from Norman's viewpoint as she crosses the small office and goes out into the night. He goes into the office and looks at the book. He goes back into the parlor with a mystified expression. Norman turns his ear from the direction of the sounds seems to be fighting an impulse to listen or more than listen."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Mary walks slowly to the window realizing that the terrible voice is coming from the house behind the cabins. The camera follows her to the window and once there we see the light is still on in the upstairs bedroom and the voice is coming from that room. Mary stands by the window listening with mounting distress concern and sympathy. She turns her face away gazing sadly at the little empty room then turns to look out the window. We see Norman coming down the path carrying a napkincovered tray. Mary looks at him for a moment then turns quickly goes to the door opens it and goes out onto the porch. Mary pauses outside the door about to start forward. when Norman comes around the building walks along the porch past the office stopping only when he is close to her. He stares with painful embarrassment at the knowing look in her eye. She begins to back into her room and Norman starts to follow but hesitates as he sees the total picture of an attractive young woman and a motel room. Bringing down the tray of food in defiance of his mother's orders is about the limit of his defiance for one day. Without waiting for approval or disapproval he turns and hurries to the office. Mary looks after him her face showing amused sympathy then follows. Norman looks about tray in hand sees there is no reasonable place to spread out a supper. He turns and sees Mary standing in the doorway. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. As Norman goes about spreading out the bread and ham and pouring the milk we follow Mary across the room. She notices the paintings on the wall nudes primarily and many with a vaguely religious overtone. Finally Mary reaches the sofa sits down and looks at the spread. Mary begins to eat her attitude a bit tense. She takes up a small slice of ham bites off a tiny bite and nibbles at it in the manner of one disturbed and preoccupied. Norman gazes at her at the tiny bite. she has taken smiles and then laughs. Mary looks at him with some compression and smiles. Norman turns slowly looking at her with a striking coldness. The fury suddenly dies abruptly and completely and he sinks back into his chair. Mary watches the troubled man almost physically pained by his anguish. She goes out of the parlor. We see her from Norman's viewpoint as she crosses the small office and goes out into the night. He goes into the office and looks at the book. He goes back into the parlor with a mystified expression. Norman turns his ear from the direction of the sounds seems to be fighting an impulse to listen or more than listen."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Mary walks slowly to the window realizing that the terrible voice is coming from the house behind the cabins. The camera follows her to the window and once there we see the light is still on in the upstairs bedroom and the voice is coming from that room. Mary stands by the window listening with mounting distress concern and sympathy. She turns her face away gazing sadly at the little empty room then turns to look out the window. We see Norman coming down the path carrying a napkincovered tray. Mary looks at him for a moment then turns quickly goes to the door opens it and goes out onto the porch. Mary pauses outside the door about to start forward. when Norman comes around the building walks along the porch past the office stopping only when he is close to her. Norman turns slowly looking at her with a striking coldness. The fury suddenly dies abruptly and completely and he sinks back into his chair. Mary watches the troubled man almost physically pained by his anguish. She goes out of the parlor. We see her from Norman's viewpoint as she crosses the small office and goes out into the night. He goes into the office and looks at the book. He goes back into the parlor with a mystified expression. Norman turns his ear from the direction of the sounds seems to be fighting an impulse to listen or more than listen."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Mary walks slowly to the window realizing that the terrible voice is coming from the house behind the cabins. The camera follows her to the window and once there we see the light is still on in the upstairs bedroom and the voice is coming from that room. Mary stands by the window listening with mounting distress concern and sympathy. We see her from Norman's viewpoint as she crosses the small office and goes out into the night. He goes into the office and looks at the book. He goes back into the parlor with a mystified expression. Norman turns his ear from the direction of the sounds seems to be fighting an impulse to listen or more than listen."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Alice strolls briskly to the bookshelf, perceiving that the strange aroma is emanating from the garden beyond the library. The telescope follows her to the bookshelf, and upon arrival, we notice the lamp is still flickering in the ground-floor study, and the aroma is wafting from that nook. Alice lingers by the bookshelf, sniffing with growing curiosity, perplexity, and empathy. She swivels her body away, peering thoughtfully at the large vacant hallway, then turns to peer out the bookshelf. We observe Elliot trekking down the lane, balancing a lily-covered basket. Alice stares at him briefly, then pivots swiftly, heads to the drapes, parts them, and steps out onto the balcony. Alice halts outside the drapes, on the verge of stepping forward when Elliot meanders around the fountain, strides along the balcony past the workshop, halting only when he is adjacent to her. He gazes with awkward discomfort at the understanding gleam in her eye. She commences to retreat into her nook, and Elliot begins to pursue but pauses as he perceives the entire depiction of a charming young lad and a cottage nook. Delivering the basket of tulips, against his uncle's directives, is nearly the extent of his rebellion for one dawn. Without lingering for acknowledgment or rejection, he spins and dashes to the workshop. Alice observes him depart, her visage reflecting amused empathy, then shadows him. Elliot glances around, basket in grasp, notices there is no adequate surface to arrange a picnic. He rotates and perceives Alice standing in the archway. As Elliot goes about arranging the daffodils and sunflower seeds and mixing the lemonade, we shadow Alice across the chamber. She inspects the photographs on the shelf; landscapes, mostly, and several with a faintly mystical vibe. Finally, Alice reaches the hammock, reclines, and examines the array. Alice commences to munch, her demeanor somewhat anxious. She lifts a tiny piece of sunflower seed, chews off a minuscule piece, and nibbles at it in the manner of one distracted and absorbed. Elliot watches her, at the minuscule piece she has nibbled, grins, and subsequently chuckles. Alice glances at him, with some reservation, and grins. Elliot turns gently, eyeing her with a notable iciness. The irritation abruptly dissipates, suddenly and entirely, and he reclines back into his rocking chair. Alice observes the uneasy lad, almost physically afflicted by his turmoil. She departs from the den. We perceive her from Elliot's outlook as she traverses the narrow workshop and steps out into the dusk. He enters the workshop and peers at the ledger. He returns to the den with a puzzled aspect. Elliot turns his senses from the origin of the echoes, appears to be wrestling with a compulsion to eavesdrop, or more than eavesdrop."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Mary walks to the window, realizing the disturbing voice comes from the house behind the cabins. She listens with distress and sympathy. Seeing Norman with a tray, she goes to the porch. Norman, embarrassed, approaches her but hesitates, acknowledging the boundary of bringing food against his mother’s orders. He retreats to the office, while Mary follows, observing the room's religious-themed nude paintings. She tensely nibbles on ham, which amuses Norman briefly. His mood quickly shifts to coldness, then anguish. Mary, troubled by his pain, exits the parlor. Norman, intrigued, checks the guest book, struggling with whether to listen to the haunting sounds."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Norman turns his ear from the direction of the sounds seems to be fighting an impulse to listen or more than listen He goes back into the parlor with a mystified expression He goes into the office and looks at the book We see her from Norman's viewpoint as she crosses the small office and goes out into the night She goes out of the parlor Mary watches the troubled man almost physically pained by his anguish The fury suddenly dies abruptly and completely and he sinks back into his chair Norman turns slowly looking at her with a striking coldness Mary looks at him with some compression and smiles she has taken smiles and then laughs Norman gazes at her at the tiny bite She takes up a small slice of ham bites off a tiny bite and nibbles at it in the manner of one disturbed and preoccupied Mary begins to eat her attitude a bit tense Finally Mary reaches the sofa sits down and looks at the spread She notices the paintings on the wall nudes primarily and many with a vaguely religious overtone As Norman goes about spreading out the bread and ham and pouring the milk we follow Mary across the room He turns and sees Mary standing in the doorway Norman looks about tray in hand sees there is no reasonable place to spread out a supper Mary looks after him her face showing amused sympathy then follows Without waiting for approval or disapproval he turns and hurries to the office Bringing down the tray of food in defiance of his mother's orders is about the limit of his defiance for one day She begins to back into her room and Norman starts to follow but hesitates as he sees the total picture of an attractive young woman and a motel room He stares with painful embarrassment at the knowing look in her eye when Norman comes around the building walks along the porch past the office stopping only when he is close to her Mary pauses outside the door about to start forward Mary looks at him for a moment then turns quickly goes to the door opens it and goes out onto the porch We see Norman coming down the path carrying a napkincovered tray She turns her face away gazing sadly at the little empty room then turns to look out the window Mary stands by the window listening with mounting distress concern and sympathy The camera follows her to the window and once there we see the light is still on in the upstairs bedroom and the voice is coming from that room Mary walks slowly to the window realizing that the terrible voice is coming from the house behind the cabins"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The camera follows her to the window and once there we see the light is still on in the upstairs bedroom and the voice is coming from that room Mary walks slowly to the window realizing that the terrible voice is coming from the house behind the cabins She turns her face away gazing sadly at the little empty room then turns to look out the window Mary stands by the window listening with mounting distress concern and sympathy Mary looks at him for a moment then turns quickly goes to the door opens it and goes out onto the porch We see Norman coming down the path carrying a napkincovered tray when Norman comes around the building walks along the porch past the office stopping only when he is close to her Mary pauses outside the door about to start forward She begins to back into her room and Norman starts to follow but hesitates as he sees the total picture of an attractive young woman and a motel room He stares with painful embarrassment at the knowing look in her eye Without waiting for approval or disapproval he turns and hurries to the office Bringing down the tray of food in defiance of his mother's orders is about the limit of his defiance for one day Norman looks about tray in hand sees there is no reasonable place to spread out a supper Mary looks after him her face showing amused sympathy then follows As Norman goes about spreading out the bread and ham and pouring the milk we follow Mary across the room He turns and sees Mary standing in the doorway Finally Mary reaches the sofa sits down and looks at the spread She notices the paintings on the wall nudes primarily and many with a vaguely religious overtone She takes up a small slice of ham bites off a tiny bite and nibbles at it in the manner of one disturbed and preoccupied Mary begins to eat her attitude a bit tense she has taken smiles and then laughs Norman gazes at her at the tiny bite Norman turns slowly looking at her with a striking coldness Mary looks at him with some compression and smiles Mary watches the troubled man almost physically pained by his anguish The fury suddenly dies abruptly and completely and he sinks back into his chair We see her from Norman's viewpoint as she crosses the small office and goes out into the night She goes out of the parlor He goes back into the parlor with a mystified expression He goes into the office and looks at the book Norman turns his ear from the direction of the sounds seems to be fighting an impulse to listen or more than listen"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She notices the paintings on the wall nudes primarily and many with a vaguely religious overtone Finally Mary reaches the sofa sits down and looks at the spread Mary begins to eat her attitude a bit tense She takes up a small slice of ham bites off a tiny bite and nibbles at it in the manner of one disturbed and preoccupied Norman gazes at her at the tiny bite she has taken smiles and then laughs Mary looks at him with some compression and smiles Norman turns slowly looking at her with a striking coldness The fury suddenly dies abruptly and completely and he sinks back into his chair Mary watches the troubled man almost physically pained by his anguish She goes out of the parlor We see her from Norman's viewpoint as she crosses the small office and goes out into the night He goes into the office and looks at the book He goes back into the parlor with a mystified expression Norman turns his ear from the direction of the sounds seems to be fighting an impulse to listen or more than listen Mary walks slowly to the window realizing that the terrible voice is coming from the house behind the cabins The camera follows her to the window and once there we see the light is still on in the upstairs bedroom and the voice is coming from that room Mary stands by the window listening with mounting distress concern and sympathy She turns her face away gazing sadly at the little empty room then turns to look out the window We see Norman coming down the path carrying a napkincovered tray Mary looks at him for a moment then turns quickly goes to the door opens it and goes out onto the porch Mary pauses outside the door about to start forward when Norman comes around the building walks along the porch past the office stopping only when he is close to her He stares with painful embarrassment at the knowing look in her eye She begins to back into her room and Norman starts to follow but hesitates as he sees the total picture of an attractive young woman and a motel room Bringing down the tray of food in defiance of his mother's orders is about the limit of his defiance for one day Without waiting for approval or disapproval he turns and hurries to the office Mary looks after him her face showing amused sympathy then follows Norman looks about tray in hand sees there is no reasonable place to spread out a supper He turns and sees Mary standing in the doorway As Norman goes about spreading out the bread and ham and pouring the milk we follow Mary across the room"
        }
      ]
    }
  ]
}