{
  "ground_truth": "Norman stands watching him drive away as the car pulls up and Arbogast gets out, leaving the motor running. As he starts to walk across the highway, the camera pulls away, and Arbogast reaches the phone booth and enters. The camera starts forward, and we see Arbogast remove a small notebook from his pocket, check a number, drop a dime in the slot, and dial. He hangs up and gets out of the phone booth. A distant view shows the House and Motel, with a light on in the house and also in Norman's office. We see Norman emerge from his office and move along the porch toward the distant cabins, carrying sheets on his arm. He goes into the last cabin and switches the light on. The hood of the white Ford enters the scene and stops, and Arbogast gets out and goes over to the Motel office. Arbogast enters, looks around the empty office, and calls out. He goes over to the door to the parlor, enters, looks around the bird-ridden room, goes over to it, finds it unlocked, and with a quick, cautious look around, he opens it, straightens up, and goes out. He goes off and dashes up the stone steps to the House. The camera holds as Arbogast goes up onto the porch. The house is dark within except for a faint spill of light in the foyer, coming from the upstairs hall. After a careful wait, he crosses to the stairs and starts up slowly and guardedly, placing his foot squarely on each step to test for squeaks or groans before placing his full weight on it. The camera follows, remaining on floor level but traveling along the stairway as Arbogast makes his way up. We see Arbogast coming up the stairs, and then the door of the mother's room opens, carefully and slowly. As Arbogast reaches the landing, the door opens, and the mother steps out, her hand raised high, the blade of an enormous knife flashing. The knife slashes across his cheek and neck, blood spurts, and he stumbles back, staggering down the staircase. He frantically gropes for the balustrade as he goes backward down the stairs, and as he collapses at the bottom, the black head and shoulders of Mrs. Bates plunge into the foreground as the camera moves in to contain the raising and descending murder weapon. Meanwhile, Lila sits close by the phone, looking as if she hasn't moved from it in the last hour, while Sam paces, occasionally stopping at the window, glancing out, and pacing again, creating a thick atmosphere of smoke, tension, and weariness in the small, otherwise cozy room.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Norman remains observing him steer away as the vehicle halts and Arbogast exits, leaving the engine running. As he begins to stroll across the road, the camera withdraws, and Arbogast reaches the telephone booth and enters. The camera begins forward, and we witness Arbogast extract a small journal from his pocket, verify a number, drop a dime in the slot, and dial. He hangs up and exits the phone booth. A distant view displays the House and Motel, with a light on in the house and also in Norman's office. We observe Norman emerge from his office and proceed along the porch toward the distant cabins, bearing linens on his arm. He goes into the final cabin and switches the light on. The hood of the white Ford enters the scene and halts, and Arbogast exits and goes over to the Motel office. Arbogast enters, glances around the vacant office, and calls out. He goes over to the door to the parlor, enters, glances around the bird-filled room, goes over to it, finds it unlocked, and with a rapid, wary look around, he opens it, straightens up, and exits. He departs and dashes up the stone steps to the House. The camera holds as Arbogast ascends onto the porch. The house is dim within except for a faint spill of light in the foyer, emanating from the upstairs hall. After a careful wait, he crosses to the staircase and starts up slowly and cautiously, placing his foot squarely on each step to test for squeaks or groans before placing his full weight on it. The camera follows, remaining on floor level but traveling along the stairway as Arbogast makes his way up. We observe Arbogast ascending the stairs, and then the door of the mother's room opens, carefully and slowly. As Arbogast reaches the landing, the door opens, and the mother steps out, her hand raised high, the blade of an immense knife flashing. The knife slashes across his cheek and neck, blood spurts, and he stumbles back, staggering down the staircase. He frantically gropes for the balustrade as he goes backward down the stairs, and as he collapses at the bottom, the dark head and shoulders of Mrs. Bates plunge into the foreground as the camera moves in to capture the raising and descending murder weapon. Meanwhile, Lila sits close by the phone, appearing as if she hasn't moved from it in the last hour, while Sam paces, occasionally stopping at the window, glancing out, and pacing again, creating a dense atmosphere of smoke, tension, and weariness in the small, otherwise cozy room."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Norman is seen standing and watching him drive away as the car is pulled up and Arbogast is gotten out of by him, leaving the motor running. As the highway is started to be walked across by him, the camera is pulled away, and Arbogast is reached by the phone booth and entered by him. The camera is started forward, and Arbogast is seen removing a small notebook from his pocket, checking a number, dropping a dime in the slot, and dialing. The phone booth is exited by him, and he hangs up. The House and Motel are shown by a distant view, with a light on in the house and also in Norman's office. Norman is seen emerging from his office and moving along the porch toward the distant cabins, carrying sheets on his arm. The last cabin is entered by him and the light is switched on. The scene is entered by the hood of the white Ford and stopped, and Arbogast exits and goes over to the Motel office. The office is entered by Arbogast, looked around, and he calls out. He goes over to the door to the parlor, enters, looks around the bird-ridden room, finds it unlocked, and with a quick, cautious look around, opens it, straightens up, and goes out. The house is dashed up to by him, and the stone steps are climbed. The camera holds as the porch is gone up onto by Arbogast. Except for a faint spill of light in the foyer, coming from the upstairs hall, the house is dark within. After a careful wait, the stairs are crossed to by him and started up slowly and guardedly, placing his foot squarely on each step to test for squeaks or groans before placing his full weight on it. The camera follows, remaining on floor level but traveling along the stairway as his way up is made by Arbogast. Arbogast is seen coming up the stairs, and then the door of the mother's room is carefully and slowly opened. As the landing is reached by Arbogast, the door is opened, and the mother steps out, her hand raised high, the blade of an enormous knife flashing. His cheek and neck are slashed by the knife, blood spurts, and he stumbles back, staggering down the staircase. The balustrade is frantically groped for by him as he goes backward down the stairs, and he collapses at the bottom as the black head and shoulders of Mrs. Bates plunge into the foreground as the camera is moved in to contain the raising and descending murder weapon. Meanwhile, the phone is sat close by Lila, looking as if it hasn't been moved from by her in the last hour, while Sam paces, occasionally stopping at the window, glancing out, and pacing again, creating a thick atmosphere of smoke, tension, and weariness in the small, otherwise cozy room."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Norman watches as Arbogast drives away, leaving the car running. Arbogast crosses the highway, enters a phone booth, checks a number in his notebook, drops a dime, and dials. After hanging up, he exits the booth. A distant view shows the House and Motel, with lights on in both. Norman emerges from his office, carrying sheets, and enters the last cabin, switching on the light. Arbogast arrives at the Motel office, finds it empty, and calls out. He enters the parlor, looks around, and then dashes up the stone steps to the House. The house is dark except for a faint light in the foyer. Arbogast cautiously ascends the stairs, testing each step for noise. As he reaches the landing, the mother's room door opens, and she emerges with a knife. The blade slashes his cheek and neck, and he stumbles down the stairs, collapsing at the bottom. Mrs. Bates's figure looms as the camera focuses on the murder weapon. Meanwhile, Lila sits by the phone, looking tense, while Sam paces, occasionally glancing out the window, creating an atmosphere of smoke and tension in the small room."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Norman watches as Arbogast arrives, leaving his car running. Arbogast crosses the highway, enters a phone booth, checks a number, dials, hangs up, and exits. The House and Motel are shown with lights on. Norman leaves his office, carrying sheets, and enters the last cabin. Arbogast arrives at the Motel office, finds it empty, and enters the parlor. He then dashes up the stone steps to the House, which is dark except for a faint light in the foyer. He cautiously ascends the stairs, testing each step for noise. As he reaches the landing, the mother's room door opens, and she emerges with a knife. She slashes Arbogast, who stumbles down the stairs, collapsing at the bottom. Mrs. Bates appears, wielding the murder weapon. Meanwhile, Lila sits by the phone, and Sam paces, creating a tense, smoky atmosphere in the room."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Norman stands there, intently watching as the car pulls up and Arbogast steps out, leaving the motor idling. As Arbogast begins to make his way across the highway, the camera gradually pulls away, capturing the moment when he reaches the phone booth and steps inside. The camera then starts to move forward, and we observe Arbogast as he takes a small notebook from his pocket, checks a number, inserts a dime into the slot, and dials. After hanging up, he exits the phone booth. From a distant vantage point, we see the House and Motel, both illuminated by lights—one in the house and another in Norman's office. Norman emerges from his office, moving along the porch toward the far-off cabins, with sheets draped over his arm. He enters the last cabin and switches on the light. The hood of the white Ford comes into view and halts, and Arbogast steps out, making his way over to the Motel office. Arbogast enters, glances around the vacant office, and calls out. He approaches the door to the parlor, enters, surveys the bird-filled room, and finds the door unlocked. With a quick, cautious glance around, he opens it, straightens up, and exits. He then dashes up the stone steps leading to the House. The camera holds steady as Arbogast ascends onto the porch. The interior of the house is shrouded in darkness, except for a faint spill of light in the foyer, emanating from the upstairs hall. After a careful pause, he crosses to the stairs and begins to ascend slowly and cautiously, testing each step for squeaks or groans before placing his full weight on it. The camera follows, remaining at floor level but traveling along the stairway as Arbogast makes his way upward. We see Arbogast nearing the top of the stairs, and then the door to the mother's room opens, deliberately and slowly. As Arbogast reaches the landing, the door swings open, and the mother emerges, her hand raised high, brandishing the blade of an enormous knife that gleams menacingly. The knife slashes across his cheek and neck, causing blood to spurt, and he stumbles backward, staggering down the staircase. He frantically gropes for the balustrade as he tumbles backward down the stairs, and as he collapses at the bottom, the dark head and shoulders of Mrs. Bates plunge into the foreground as the camera moves in to capture the raising and descending murder weapon. Meanwhile, Lila sits close by the phone, appearing as if she hasn't moved from it in the past hour, while Sam paces back and forth, occasionally stopping at the window to glance out before resuming his pacing, creating a thick atmosphere of smoke, tension, and weariness in the small, otherwise cozy room."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Norman stands there with a focused and intense gaze, intently observing as the car approaches and comes to a stop. Arbogast steps out, leaving the motor running as a steady hum fills the air. As Arbogast begins making his way across the highway, the camera gradually and smoothly pulls away, capturing the moment when he reaches the phone booth and steps inside with a sense of purpose. The camera then starts to move forward with deliberate precision, allowing us to observe Arbogast as he retrieves a small notebook from his pocket, flips through it to check a number, inserts a dime into the slot, and dials the number. After hanging up with a sense of resolve, he exits the phone booth. From a distant vantage point, we see the silhouette of the House and the Motel, both illuminated by lights—one casting a glow from the house and another shining from Norman's office. Norman emerges from his office, moving along the porch with sheets draped over his arm, heading in the direction of the far-off cabins. He enters the last cabin in the row and promptly switches on the light. The hood of the white Ford becomes visible and comes to a halt, and Arbogast steps out once more, making his way confidently over to the Motel office. Arbogast enters the office, taking in the scene as he glances around the vacant room, and then calls out, his voice echoing slightly in the empty space. He approaches the door to the parlor, enters, scans the bird-filled room, and finds the door to be unlocked. With a quick and cautious glance around to ensure everything is as it seems, he opens the door, straightens up, and exits. He then makes a swift dash up the stone steps that lead to the House. The camera holds steady as Arbogast ascends onto the porch. The interior of the house is shrouded in shadows and darkness, except for a faint, ghostly spill of light in the foyer, emanating from the upstairs hall. After a careful pause to gather himself, he crosses over to the stairs and begins his slow and cautious ascent, testing each step for any creaks or groans before placing his full weight upon it. The camera follows his journey, remaining at floor level but traveling along the stairway as Arbogast makes his way upward. We see Arbogast nearing the top of the stairs, and then the door to the mother's room begins to open, deliberately and slowly, as if with intention. As Arbogast reaches the landing, the door swings open completely, and the mother emerges with a swift motion, her hand raised high, brandishing the blade of an enormous knife that gleams ominously in the dim light. The knife slashes viciously across his cheek and neck, causing blood to spurt violently, and he stumbles backward, his footing lost, staggering down the staircase. He frantically gropes for the balustrade, desperately trying to regain his balance as he tumbles backward down the stairs, and as he collapses in a crumpled heap at the bottom, the dark head and shoulders of Mrs. Bates plunge into the foreground as the camera moves in to capture the menacing motion of the raising and descending murder weapon. Meanwhile, Lila sits close by the phone, appearing as if she hasn't budged from her vigilant post in the past hour, while Sam paces restlessly back and forth, occasionally stopping at the window to glance out with concern before resuming his anxious pacing, creating a thick atmosphere of smoke, tension, and weary apprehension in the small, otherwise cozy room."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Norman stands still, his eyes fixed on the car as it pulls up, and Arbogast steps out, leaving the engine idling softly in the background. Arbogast begins his walk across the highway, each step deliberate, as the camera gradually pulls away, capturing his journey until he reaches the phone booth. He enters the booth, and the camera starts to move forward, focusing on Arbogast as he reaches into his pocket, retrieves a small notebook, and carefully checks a number. With a practiced motion, he drops a dime into the slot and dials the number. After a brief pause, he hangs up the phone, pushes the door open, and steps out of the booth. From a distance, the view shifts to reveal the House and Motel, both illuminated by lights—one in the house and another in Norman's office. Norman emerges from his office, his figure silhouetted against the light, and moves along the porch, sheets draped over his arm, heading toward the distant cabins. He enters the last cabin and flicks the light switch, casting a glow inside. Meanwhile, the white Ford's hood comes into view and halts, allowing Arbogast to exit and make his way to the Motel office. Arbogast steps inside, his eyes scanning the empty office as he calls out, his voice echoing in the silence. He approaches the door to the parlor, enters cautiously, and surveys the bird-adorned room. Finding the door unlocked, he gives a quick, wary glance around, opens it, straightens up, and exits. He then moves swiftly, dashing up the stone steps to the House. The camera holds steady as Arbogast ascends onto the porch, the interior of the house shrouded in darkness except for a faint light spilling into the foyer from the upstairs hall. After a moment of careful consideration, he crosses to the stairs and begins his ascent, each step taken slowly and guardedly, testing for any creaks or groans before committing his full weight. The camera follows his progress, staying at floor level but traveling along the stairway as Arbogast climbs. As he nears the top, the door to the mother's room opens with deliberate slowness. Just as Arbogast reaches the landing, the door swings open, and the mother emerges, her hand raised high, the blade of an enormous knife glinting ominously. The knife slashes across his cheek and neck, sending blood spurting as he stumbles backward, his body reeling down the staircase. He desperately reaches for the balustrade, his fingers grasping for support as he tumbles backward down the stairs. At the bottom, he collapses, and the black silhouette of Mrs. Bates looms into the foreground, the camera closing in to capture the menacing rise and fall of the murder weapon. Meanwhile, in a nearby room, Lila sits close to the phone, her posture tense, as if she hasn't moved in the past hour, while Sam paces restlessly, occasionally pausing at the window to glance outside before resuming his pacing, the air thick with smoke, tension, and weariness, enveloping the small, otherwise cozy room."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Norman watches as Arbogast arrives, leaves his car running, and crosses the highway to a phone booth. After checking a number in his notebook, Arbogast makes a call, hangs up, and exits the booth. The scene shifts to a view of the House and Motel, with lights on in both. Norman emerges from his office, carrying sheets, and heads to the last cabin, where he turns on the light. Arbogast arrives at the Motel office, finds it empty, and calls out. He enters the parlor, inspects the bird-filled room, and exits cautiously. He then dashes up the stone steps to the House, which is dark except for a faint light in the foyer. After a careful pause, he ascends the stairs slowly, testing each step for noise. As he reaches the landing, the door to the mother's room opens, and she emerges with a knife. She slashes Arbogast, causing him to stagger and fall down the stairs. As he collapses, Mrs. Bates advances with the knife. Meanwhile, Lila sits by the phone, appearing as if she hasn't moved for an hour, while Sam paces, occasionally stopping at the window, creating an atmosphere of smoke, tension, and weariness in the small room."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Norman stands watching him drive away as the car pulls up, a dusty sedan likely common in small American towns during the 1960s, and Arbogast gets out, leaving the motor running. As he starts to walk across the highway, a common route for travelers heading to nearby attractions, the camera pulls away, and Arbogast reaches the phone booth and enters. He removes a small notebook from his pocket, a detective's essential tool for jotting down clues, checks a number, drops a dime in the slot, and dials. He hangs up and gets out of the phone booth. A distant view shows the House and Motel, an establishment owned by Norman's family for generations, with a light on in the house and also in Norman's office. We see Norman emerge from his office and move along the porch toward the distant cabins, carrying sheets on his arm, readying for the next influx of weary travelers. He goes into the last cabin and switches the light on, perhaps preparing for a late guest. The hood of the white Ford enters the scene and stops; Arbogast gets out and goes over to the Motel office. Arbogast enters, looks around the empty office, and calls out, hoping to find someone who might have seen Marion. He goes over to the door to the parlor, a room filled with taxidermied birds that reflect Norman’s unusual hobby, enters, looks around the bird-ridden room, goes over to it, finds it unlocked, and with a quick, cautious look around, he opens it, straightens up, and goes out. He goes off and dashes up the stone steps to the House, a Victorian structure whose eerie presence dominates the landscape. The camera holds as Arbogast goes up onto the porch. The house is dark within, except for a faint spill of light in the foyer, coming from the upstairs hall, suggesting someone upstairs. After a careful wait, he crosses to the stairs and starts up slowly and guardedly, placing his foot squarely on each step to test for squeaks or groans, which an old house like this might emit, before placing his full weight on it. The camera follows, remaining on floor level but traveling along the stairway as Arbogast makes his way up. We see Arbogast coming up the stairs, and then the door of the mother's room opens, carefully and slowly. As Arbogast reaches the landing, the door opens, and the mother steps out, her hand raised high, the blade of an enormous knife, reminiscent of a kitchen implement, flashing. The knife slashes across his cheek and neck, blood spurts, and he stumbles back, staggering down the staircase, a scene that echoes the film’s suspenseful crescendo. He frantically gropes for the balustrade as he goes backward down the stairs, and as he collapses at the bottom, the black head and shoulders of Mrs. Bates plunge into the foreground as the camera moves in to contain the raising and descending murder weapon. Meanwhile, Lila sits close by the phone, looking as if she hasn't moved from it in the last hour, while Sam paces, occasionally stopping at the window, glancing out, and pacing again, creating a thick atmosphere of smoke, tension, and weariness in the small, otherwise cozy room, a refuge that offers no solace amid their growing concern."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Norman stands watching him drive away as the car pulls up and Arbogast gets out leaving the motor running  As he starts to walk across the highway the camera pulls away and Arbogast reaches the phone booth and enters  The camera starts forward and we see Arbogast remove a small notebook from his pocket check a number drop a dime in the slot and dial  He goes off and dashes up the stone steps to the House  The camera holds as Arbogast goes up onto the porch  The house is dark within except for a faint spill of light in the foyer coming from the upstairs hall  After a careful wait he crosses to the stairs and starts up slowly and guardedly placing his foot squarely on each step to test for squeaks or groans before placing his full weight on it  The camera follows remaining on floor level but traveling along the stairway as Arbogast makes his way up  We see Arbogast coming up the stairs and then the door of the mother's room opens carefully and slowly  As Arbogast reaches the landing the door opens and the mother steps out her hand raised high the blade of an enormous knife flashing  The knife slashes across his cheek and neck  blood spurts and he stumbles back staggering down the staircase  He frantically gropes for the balustrade as he goes backward down the stairs and as he collapses at the bottom the black head and shoulders of Mrs Bates plunge into the foreground as the camera moves in to contain the raising and descending murder weapon  Meanwhile Lila sits close by the phone looking as if she hasn't moved from it in the last hour while Sam paces occasionally stopping at the window glancing out and pacing again creating a thick atmosphere of smoke tension and weariness in the small otherwise cozy room He hangs up and gets out of the phone booth  A distant view shows the House and Motel with a light on in the house and also in Norman's office  We see Norman emerge from his office and move along the porch toward the distant cabins carrying sheets on his arm  He goes into the last cabin and switches the light on  The hood of the white Ford enters the scene and stops and Arbogast gets out and goes over to the Motel office  Arbogast enters looks around the empty office and calls out  He goes over to the door to the parlor enters looks around the birdridden room goes over to it finds it unlocked and with a quick cautious look around he opens it straightens up and goes out  He goes off and dashes up the stone steps to the House  The camera holds as Arbogast goes up onto the porch  The house is dark within except for a faint spill of light in the foyer coming from the upstairs hall  After a careful wait he crosses to the stairs and starts up slowly and guardedly placing his foot squarely on each step to test for squeaks or groans before placing his full weight on it  The camera follows remaining on floor level but traveling along the stairway as Arbogast makes his way up  We see Arbogast coming up the stairs and then the door of the mother's room opens carefully and slowly  As Arbogast reaches the landing the door opens and the mother steps out her hand raised high the blade of an enormous knife flashing  The knife slashes across his cheek and neck  blood spurts and he stumbles back staggering down the staircase  He frantically gropes for the balustrade as he goes backward down the stairs and as he collapses at the bottom the black head and shoulders of Mrs Bates plunge into the foreground as the camera moves in to contain the raising and descending murder weapon  Meanwhile Lila sits close by the phone looking as if she hasn't moved from it in the last hour while Sam paces occasionally stopping at the window glancing out and pacing again creating a thick atmosphere of smoke tension and weariness in the small otherwise cozy room"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Norman stands watching him drive away as the car pulls up and Arbogast gets out leaving the motor running. As he starts to walk across the highway the camera pulls away and Arbogast reaches the phone booth and enters. The camera starts forward and we see Arbogast remove a small notebook from his pocket check a number drop a dime in the slot and dial. He hangs up and gets out of the phone booth. A distant view shows the House and Motel with a light on in the house and also in Norman's office. We see Norman emerge from his office and move along the porch toward the distant cabins carrying sheets on his arm. He goes into the last cabin and switches the light on. The hood of the white Ford enters the scene and stops and Arbogast gets out and goes over to the Motel office. Arbogast enters looks around the empty office and calls out. He goes over to the door to the parlor enters looks around the birdridden room goes over to it finds it unlocked and with a quick cautious look around he opens it straightens up and goes out. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. He goes off and dashes up the stone steps to the House. The camera holds as Arbogast goes up onto the porch. The house is dark within except for a faint spill of light in the foyer coming from the upstairs hall. After a careful wait he crosses to the stairs and starts up slowly and guardedly placing his foot squarely on each step to test for squeaks or groans before placing his full weight on it. The camera follows remaining on floor level but traveling along the stairway as Arbogast makes his way up. We see Arbogast coming up the stairs and then the door of the mother's room opens carefully and slowly. As Arbogast reaches the landing the door opens and the mother steps out her hand raised high the blade of an enormous knife flashing. The knife slashes across his cheek and neck. blood spurts and he stumbles back staggering down the staircase. He frantically gropes for the balustrade as he goes backward down the stairs and as he collapses at the bottom the black head and shoulders of Mrs Bates plunge into the foreground as the camera moves in to contain the raising and descending murder weapon. Meanwhile Lila sits close by the phone looking as if she has not moved from it in the last hour while Sam paces occasionally stopping at the window glancing out and pacing again creating a thick atmosphere of smoke tension and weariness in the small otherwise cozy room."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Norman stands watching him drive away as the car pulls up and Arbogast gets out leaving the motor running. As he starts to walk across the highway the camera pulls away and Arbogast reaches the phone booth and enters. The camera starts forward and we see Arbogast remove a small notebook from his pocket check a number drop a dime in the slot and dial. He hangs up and gets out of the phone booth. A distant view shows the House and Motel with a light on in the house and also in Norman's office. We see Norman emerge from his office and move along the porch toward the distant cabins carrying sheets on his arm. He goes into the last cabin and switches the light on. The hood of the white Ford enters the scene and stops and Arbogast gets out and goes over to the Motel office. Arbogast enters looks around the empty office and calls out. He goes over to the door to the parlor enters looks around the birdridden room goes over to it finds it unlocked and with a quick cautious look around he opens it straightens up and goes out. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. He goes off and dashes up the stone steps to the House. The camera holds as Arbogast goes up onto the porch. The house is dark within except for a faint spill of light in the foyer coming from the upstairs hall. After a careful wait he crosses to the stairs and starts up slowly and guardedly placing his foot squarely on each step to test for squeaks or groans before placing his full weight on it. The camera follows remaining on floor level but traveling along the stairway as Arbogast makes his way up. We see Arbogast coming up the stairs and then the door of the mother's room opens carefully and slowly. As Arbogast reaches the landing the door opens and the mother steps out her hand raised high the blade of an enormous knife flashing. The knife slashes across his cheek and neck. blood spurts and he stumbles back staggering down the staircase. He frantically gropes for the balustrade as he goes backward down the stairs and as he collapses at the bottom the black head and shoulders of Mrs Bates plunge into the foreground as the camera moves in to contain the raising and descending murder weapon. Meanwhile Lila sits close by the phone looking as if she has not moved from it in the last hour while Sam paces occasionally stopping at the window glancing out and pacing again creating a thick atmosphere of smoke tension and weariness in the small otherwise cozy room."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Norman stands watching him drive away as the car pulls up and Arbogast gets out leaving the motor running. As he starts to walk across the highway the camera pulls away and Arbogast reaches the phone booth and enters. The camera starts forward and we see Arbogast remove a small notebook from his pocket check a number drop a dime in the slot and dial. He hangs up and gets out of the phone booth. A distant view shows the House and Motel with a light on in the house and also in Norman's office. We see Arbogast coming up the stairs and then the door of the mother's room opens carefully and slowly. As Arbogast reaches the landing the door opens and the mother steps out her hand raised high the blade of an enormous knife flashing. The knife slashes across his cheek and neck. blood spurts and he stumbles back staggering down the staircase. He frantically gropes for the balustrade as he goes backward down the stairs and as he collapses at the bottom the black head and shoulders of Mrs Bates plunge into the foreground as the camera moves in to contain the raising and descending murder weapon. Meanwhile Lila sits close by the phone looking as if she has not moved from it in the last hour while Sam paces occasionally stopping at the window glancing out and pacing again creating a thick atmosphere of smoke tension and weariness in the small otherwise cozy room."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Norman stands watching him drive away as the car pulls up and Arbogast gets out leaving the motor running. As he starts to walk across the highway the camera pulls away and Arbogast reaches the phone booth and enters. blood spurts and he stumbles back staggering down the staircase. He frantically gropes for the balustrade as he goes backward down the stairs and as he collapses at the bottom the black head and shoulders of Mrs Bates plunge into the foreground as the camera moves in to contain the raising and descending murder weapon. Meanwhile Lila sits close by the phone looking as if she has not moved from it in the last hour while Sam paces occasionally stopping at the window glancing out and pacing again creating a thick atmosphere of smoke tension and weariness in the small otherwise cozy room."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The cat stands watching him drive away as the car pulls up and the dog gets out, leaving the motor running. As the dog starts to walk across the highway, the camera pulls away, and the dog reaches the phone booth and enters. The camera starts forward, and we see the dog remove a small notebook from his pocket, check a number, drop a dime in the slot, and dial. The dog hangs up and gets out of the phone booth. A distant view shows the House and Motel, with a light on in the house and also in the rabbit's office. We see the rabbit emerge from his office and move along the porch toward the distant cabins, carrying sheets on his arm. The rabbit goes into the last cabin and switches the light on. The hood of the white Ford enters the scene and stops, and the dog gets out and goes over to the Motel office. The dog enters, looks around the empty office, and calls out. The dog goes over to the door to the parlor, enters, looks around the bird-ridden room, goes over to it, finds it unlocked, and with a quick, cautious look around, the dog opens it, straightens up, and goes out. The dog goes off and dashes up the stone steps to the House. The camera holds as the dog goes up onto the porch. The house is dark within except for a faint spill of light in the foyer, coming from the upstairs hall. After a careful wait, the dog crosses to the stairs and starts up slowly and guardedly, placing his foot squarely on each step to test for squeaks or groans before placing his full weight on it. The camera follows, remaining on floor level but traveling along the stairway as the dog makes his way up. We see the dog coming up the stairs, and then the door of the mother's room opens, carefully and slowly. As the dog reaches the landing, the door opens, and the fish steps out, her hand raised high, the blade of an enormous knife flashing. The knife slashes across his cheek and neck, blood spurts, and he stumbles back, staggering down the staircase. He frantically gropes for the balustrade as he goes backward down the stairs, and as he collapses at the bottom, the black head and shoulders of Mrs. Bates plunge into the foreground as the camera moves in to contain the raising and descending murder weapon. Meanwhile, the giraffe sits close by the phone, looking as if she hasn't moved from it in the last hour, while the elephant paces, occasionally stopping at the window, glancing out, and pacing again, creating a thick atmosphere of smoke, tension, and weariness in the small, otherwise cozy room."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Norman stands watching him drive away as the scooter pulls up and Arbogast gets out, leaving the engine idling. As he starts to walk across the runway, the camera pulls away, and Arbogast reaches the newsstand and enters. The camera starts forward, and we see Arbogast remove a small diary from his pocket, check a number, drop a token in the slot, and dial. He hangs up and gets out of the newsstand. A distant view shows the Lighthouse and Cabin, with a light on in the lighthouse and also in Norman's studio. We see Norman emerge from his studio and move along the porch toward the distant sheds, carrying blankets on his arm. He goes into the last shed and switches the light on. The hood of the white bicycle enters the scene and stops, and Arbogast gets out and goes over to the Cabin studio. Arbogast enters, looks around the empty studio, and calls out. He goes over to the door to the gallery, enters, looks around the cat-ridden room, goes over to it, finds it unlocked, and with a quick, cautious look around, he opens it, straightens up, and goes out. He goes off and dashes up the pebble steps to the Lighthouse. The camera holds as Arbogast goes up onto the porch. The lighthouse is dark within except for a faint spill of light in the lobby, coming from the upstairs hallway. After a careful wait, he crosses to the escalator and starts up slowly and guardedly, placing his foot squarely on each step to test for squeaks or groans before placing his full weight on it. The camera follows, remaining on ground level but traveling along the escalator as Arbogast makes his way up. We see Arbogast coming up the escalator, and then the door of the captain's room opens, carefully and slowly. As Arbogast reaches the landing, the door opens, and the captain steps out, her hand raised high, the blade of an enormous sword flashing. The sword slashes across his cheek and neck, blood spurts, and he stumbles back, staggering down the escalator. He frantically gropes for the handrail as he goes backward down the escalator, and as he collapses at the bottom, the black head and shoulders of Mrs. Bates plunge into the foreground as the camera moves in to contain the raising and descending murder weapon. Meanwhile, Lila sits close by the computer, looking as if she hasn't moved from it in the last hour, while Sam paces, occasionally stopping at the window, glancing out, and pacing again, creating a thick atmosphere of haze, tension, and weariness in the small, otherwise cozy office."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Norman stands watching him float away as the car arrives and Arbogast steps out, leaving the motor humming. As he begins to skip across the highway, the camera retreats, and Arbogast approaches the phone booth and slips inside. The camera advances, and we see Arbogast pull a small notebook from his pocket, check a number, toss a dime in the slot, and scribble. He tosses the phone back and steps out of the phone booth. A broad view shows the House and Motel, with a light glowing in the house and also in Norman's office. We see Norman exit his office and drift along the porch toward the distant cabins, balancing sheets on his arm. He steps into the last cabin and flicks the light on. The hood of the white Ford glides into the scene and halts, and Arbogast steps out and strolls over to the Motel office. Arbogast slips in, glances around the empty office, and shouts out. He saunters over to the door to the parlor, slips in, examines the bird-ridden room, goes over to it, finds it unlatched, and with a quick, cautious glance around, he swings it open, straightens up, and wanders out. He skips off and races up the stone steps to the House. The camera pauses as Arbogast climbs onto the porch. The house is shadowy within except for a faint spill of light in the foyer, seeping from the upstairs hall. After a careful pause, he glides to the stairs and tiptoes up slowly and gingerly, pressing his foot lightly on each step to listen for squeaks or groans before placing his full weight on it. The camera trails, staying on floor level but traveling along the stairway as Arbogast ascends. We see Arbogast climbing the stairs, and then the door of the mother's room creaks open, slowly and quietly. As Arbogast reaches the landing, the door creaks wider, and the mother steps out, her hand poised high, the blade of an enormous knife glittering. The knife grazes across his cheek and neck, blood spurts, and he staggers back, tumbling down the staircase. He desperately clutches for the balustrade as he stumbles backward down the stairs, and as he collapses at the bottom, the black head and shoulders of Mrs. Bates surge into the foreground as the camera zooms in to capture the lifting and descending murder weapon. Meanwhile, Lila sits gazing at the phone, looking as if she hasn't budged from it in the last hour, while Sam paces, occasionally pausing at the window, peering out, and pacing again, creating a thick atmosphere of smoke, tension, and fatigue in the small, otherwise snug room."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Francine stands watching the balloon float away as the skateboard pulls up and the shoemaker gets out, leaving the radio blaring. As it starts to shuffle across the sidewalk, the telescope floats away, and the shoemaker reaches the mailbox and enters. The telescope starts forward, and we see the shoemaker remove a large sandwich from its briefcase, check a recipe, drop a button in the jar, and whistle. It claps and leaps out of the mailbox. A distant view shows the Tent and Playground, with a candle on in the tent and also in Francine's garage. We see Francine emerge from her garage and dance along the dock toward the distant kayaks, carrying pillows on its hands. It goes into the last kayak and twists the candle on. The horn of the red bicycle enters the scene and halts, and the shoemaker gets out and skips over to the Playground garage. The shoemaker enters, spins around the empty garage, and shouts out. It skips over to the gate to the pantry, enters, spins around the plant-filled cave, rushes over to it, finds it locked, and with a slow, deliberate glance around, it unlocks it, hunches down, and bolts out. It rushes off and leaps up the wooden ladder to the Tent. The telescope freezes as the shoemaker leaps up onto the dock. The tent is bright inside except for a strong glow of darkness in the hallway, coming from the basement cellar. After a reckless charge, it floats to the ladder and leaps up swiftly and loudly, stamping its nose firmly on each step to test for murmurs or whispers before placing its soul on it. The telescope follows, hovering at ceiling height but sprinting along the ladder as the shoemaker bounces up. We see the shoemaker sneaking up the ladder, and then the gate of the elephant's cage unlocks, quickly and loudly. As the shoemaker lands on the platform, the cage unlocks, and the squirrel leaps out, its paw dropped low, the feather of a tiny pencil vanishing. The pencil whispers across its wrist and ankle, glitter flows, and it tumbles forward, climbing up the chimney. It calmly skips for the railing as it falls upward up the chimney, and as it rises at the top, the white toes and knees of Mrs. Johnson soar into the background as the telescope swoops out to scatter the dropping and rising garden gnome. Meanwhile, Rita knits far behind the spoon, watching as if she hasn’t danced from it in the last year, while Doug lounges, occasionally sitting at the chimney, nodding down, and lounging again, creating a thin mist of perfume, laughter, and alertness in the big, otherwise noisy cave."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Julian observes him cycle away as the bus pulls up and Callahan steps out, leaving the engine running. As he begins to hop across the field, the spotlight turns away, and Callahan reaches the mailbox and opens it. The spotlight rolls forward, and we watch Callahan extract a tiny flashlight from his pocket, scan a note, insert a penny in the slot, and type. He disconnects and hops out of the mailbox. A distant shot unveils the Barn and Inn, with a lantern on in the barn and also in Julian's den. We watch Julian emerge from his den and glide along the porch toward the distant tents, balancing trays on his shoulder. He slips into the last tent and flips the light on. The nose of the black motorcycle enters the scene and halts, and Callahan dismounts and wanders over to the Inn lobby. Callahan enters, glances around the vacant lobby, and whistles. He strolls over to the gate to the pantry, enters, glances around the spider-filled room, wanders over to it, discovers it ajar, and with a quick, careful glance around, he swings it open, straightens up, and wanders out. He wanders off and sprints up the gravel path to the Barn. The spotlight lingers as Callahan advances onto the porch. The barn is dim within except for a faint glow of light in the entryway, emanating from the upper hall. After a patient pause, he creeps to the ladder and begins to ascend slowly and cautiously, placing his foot firmly on each rung to test for creaks or moans before placing his full weight on it. The spotlight tracks, remaining at ground level but traveling along the ladder as Callahan ascends. We observe Callahan reaching the top, and then the door of the father's room slides open, cautiously and slowly. As Callahan arrives at the landing, the door slides open, and the father steps out, his hand lifted high, the handle of a gigantic hammer shimmering. The hammer slides across his arm and shoulder, paint splashes, and he stumbles back, wobbling down the ladder. He desperately clutches for the railing as he goes backward down the ladder, and as he crumples at the base, the white hat and torso of Mr. Bates plunge into the foreground as the spotlight moves in to contain the lifting and lowering tool. Meanwhile, Lucy lounges close by the mailbox, appearing as if she hasn't shifted from it in the last hour, while Max strides, occasionally pausing at the curtain, peering out, and striding again, creating a dense atmosphere of mist, stress, and fatigue in the small, otherwise snug chamber."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Norman stands observing him sail away as the bicycle rolls up and Arbogast hops off, leaving the engine purring. As he starts to glide across the meadow, the camera zooms away, and Arbogast reaches the gazebo and steps inside. The camera inches forward, and we see Arbogast extract a small map from his pocket, verify a route, toss a pebble in the pond, and counts the ripples. He rises and steps out of the gazebo. A distant view shows the Barn and Pavilion, with a beacon on in the barn and also in Norman's study. We see Norman emerge from his study and drift along the porch toward the distant stables, balancing logs on his shoulder. He goes into the last stable and flicks the lantern on. The crest of the white canoe drifts into the scene and rests, and Arbogast hops out and wanders over to the Pavilion office. Arbogast enters, glances around the vacant office, and shouts softly. He approaches the gate to the gallery, enters, scans the bird-bedecked chamber, walks over to it, finds it ajar, and with a swift, cautious peek around, he opens it, straightens up, and exits. He dashes off and sprints up the gravel path to the Barn. The camera fixes as Arbogast ascends onto the porch. The barn is dim inside except for a faint glimmer of light in the foyer, emanating from the upstairs corridor. After a meticulous pause, he crosses to the stairs and ascends slowly and warily, placing his foot flatly on each step to check for creaks or clicks before placing his full weight on it. The camera follows, staying at ground level but gliding along the stairway as Arbogast makes his ascent. We see Arbogast climbing the stairs, and then the door of the attic swings open, deliberately and unhurriedly. As Arbogast reaches the platform, the door swings open, and the mother steps out, her hand poised high, the handle of an enormous saw glinting. The saw slices across his sleeve and shoulder, ink spurts, and he lurches back, stumbling down the stairwell. He desperately gropes for the banister as he descends backward down the steps, and as he collapses at the bottom, the black silhouette and shoulders of Mrs. Bates thrust into the foreground as the camera zooms in to capture the lifting and dropping implement of doom. Meanwhile, Lila sits close by the radio, looking as if she hasn't budged from it in the last hour, while Sam prowls, occasionally halting at the curtain, peering out, and prowling again, crafting a dense atmosphere of mist, apprehension, and fatigue in the small, otherwise snug chamber."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Mitchell observes as the bicycle rolls away and Thompson hops off, leaving the bell ringing. As he begins to skip across the meadow, the telescope zooms out, and Thompson reaches the mailbox and leaps inside. The telescope shifts inward, and we observe Thompson extract a tiny map from his hat, verify a location, toss a pebble in the fountain, and whistle. He departs and crawls out of the mailbox. A distant shot reveals the Castle and Inn, with a candle lit in the castle and also in Mitchell's garage. We notice Mitchell emerge from his garage and glide along the veranda toward the distant sheds, balancing pillows on his shoulder. He enters the final shed and flicks the lantern on. The nose of the blue tricycle arrives in the view and halts, and Thompson hops off and skips over to the Inn garage. Thompson enters, peers around the vacant garage, and yells. He trots over to the entrance to the den, slips inside, glances around the feather-laden chamber, saunters over to it, discovers it unbolted, and with a swift, wary glance around, he cracks it open, stretches up, and skips out. He jogs off and rushes up the gravel walkway to the Castle. The telescope lingers as Thompson climbs onto the terrace. The castle is dim within except for a gentle spill of light in the vestibule, emanating from the downstairs corridor. After a cautious pause, he crosses to the ladder and ascends gingerly and warily, placing his toe firmly on each rung to check for squeaks or creaks before applying his full pressure. The telescope trails, staying on ground level but sliding along the ladder as Thompson ascends. We glimpse Thompson nearing the top, and then the entrance of the father's chamber creaks open, carefully and silently. As Thompson approaches the rooftop, the entrance widens, and the father steps out, his hand poised high, the blade of an immense sword glinting. The sword slices across his ear and jaw, ink spurts, and he falters backward, stumbling down the ladder. He desperately clutches for the rail as he tumbles backward down the ladder, and as he crumples at the base, the dark hat and feet of Mr. Billows leap into the foreground as the telescope zooms in to capture the lifting and dropping assault tool. Meanwhile, Tess lounges near the fountain, appearing as if she hasn't shifted from it in the past hour, while Jake strolls, occasionally pausing at the mirror, peeking out, and strolling again, weaving a dense aura of fog, anxiety, and fatigue in the tiny, otherwise snug barn."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Norman watches as the car arrives, and Arbogast exits, leaving it running. Arbogast makes a call from a phone booth, checks a number, then walks to the Motel. He explores the empty office and the parlor before heading up the stone steps to the House. The dimly lit house is mostly dark as Arbogast cautiously ascends the stairs, testing the steps for noise. As he reaches the landing, the door to the mother's room opens, and she emerges with a large knife. She slashes Arbogast, causing him to stagger down the stairs, where Mrs. Bates attacks with the knife. Meanwhile, Lila waits anxiously by the phone, while Sam paces, filling the room with tension and smoke."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Meanwhile Lila sits close by the phone looking as if she hasn't moved from it in the last hour while Sam paces occasionally stopping at the window glancing out and pacing again creating a thick atmosphere of smoke tension and weariness in the small otherwise cozy room He frantically gropes for the balustrade as he goes backward down the stairs and as he collapses at the bottom the black head and shoulders of Mrs Bates plunge into the foreground as the camera moves in to contain the raising and descending murder weapon  blood spurts and he stumbles back staggering down the staircase  The knife slashes across his cheek and neck  As Arbogast reaches the landing the door opens and the mother steps out her hand raised high the blade of an enormous knife flashing  We see Arbogast coming up the stairs and then the door of the mother's room opens carefully and slowly  The camera follows remaining on floor level but traveling along the stairway as Arbogast makes his way up  After a careful wait he crosses to the stairs and starts up slowly and guardedly placing his foot squarely on each step to test for squeaks or groans before placing his full weight on it  The house is dark within except for a faint spill of light in the foyer coming from the upstairs hall  The camera holds as Arbogast goes up onto the porch  He goes off and dashes up the stone steps to the House  He goes over to the door to the parlor enters looks around the birdridden room goes over to it finds it unlocked and with a quick cautious look around he opens it straightens up and goes out  Arbogast enters looks around the empty office and calls out  The hood of the white Ford enters the scene and stops and Arbogast gets out and goes over to the Motel office  He goes into the last cabin and switches the light on  We see Norman emerge from his office and move along the porch toward the distant cabins carrying sheets on his arm  A distant view shows the House and Motel with a light on in the house and also in Norman's office  He hangs up and gets out of the phone booth  The camera starts forward and we see Arbogast remove a small notebook from his pocket check a number drop a dime in the slot and dial  As he starts to walk across the highway the camera pulls away and Arbogast reaches the phone booth and enters  Norman stands watching him drive away as the car pulls up and Arbogast gets out leaving the motor running "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "As Arbogast reaches the landing the door opens and the mother steps out her hand raised high the blade of an enormous knife flashing  Arbogast enters looks around the empty office and calls out  He hangs up and gets out of the phone booth  The camera holds as Arbogast goes up onto the porch  He goes off and dashes up the stone steps to the House  We see Arbogast coming up the stairs and then the door of the mother's room opens carefully and slowly  As he starts to walk across the highway the camera pulls away and Arbogast reaches the phone booth and enters  blood spurts and he stumbles back staggering down the staircase  We see Norman emerge from his office and move along the porch toward the distant cabins carrying sheets on his arm  He frantically gropes for the balustrade as he goes backward down the stairs and as he collapses at the bottom the black head and shoulders of Mrs Bates plunge into the foreground as the camera moves in to contain the raising and descending murder weapon  The camera starts forward and we see Arbogast remove a small notebook from his pocket check a number drop a dime in the slot and dial  Norman stands watching him drive away as the car pulls up and Arbogast gets out leaving the motor running  The house is dark within except for a faint spill of light in the foyer coming from the upstairs hall  A distant view shows the House and Motel with a light on in the house and also in Norman's office  He goes over to the door to the parlor enters looks around the birdridden room goes over to it finds it unlocked and with a quick cautious look around he opens it straightens up and goes out  The camera follows remaining on floor level but traveling along the stairway as Arbogast makes his way up  The hood of the white Ford enters the scene and stops and Arbogast gets out and goes over to the Motel office  After a careful wait he crosses to the stairs and starts up slowly and guardedly placing his foot squarely on each step to test for squeaks or groans before placing his full weight on it  Meanwhile Lila sits close by the phone looking as if she hasn't moved from it in the last hour while Sam paces occasionally stopping at the window glancing out and pacing again creating a thick atmosphere of smoke tension and weariness in the small otherwise cozy room He goes into the last cabin and switches the light on  The knife slashes across his cheek and neck "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The camera holds as Arbogast goes up onto the porch  The house is dark within except for a faint spill of light in the foyer coming from the upstairs hall  After a careful wait he crosses to the stairs and starts up slowly and guardedly placing his foot squarely on each step to test for squeaks or groans before placing his full weight on it  The camera follows remaining on floor level but traveling along the stairway as Arbogast makes his way up  We see Arbogast coming up the stairs and then the door of the mother's room opens carefully and slowly  As Arbogast reaches the landing the door opens and the mother steps out her hand raised high the blade of an enormous knife flashing  The knife slashes across his cheek and neck  blood spurts and he stumbles back staggering down the staircase  He frantically gropes for the balustrade as he goes backward down the stairs and as he collapses at the bottom the black head and shoulders of Mrs Bates plunge into the foreground as the camera moves in to contain the raising and descending murder weapon  Meanwhile Lila sits close by the phone looking as if she hasn't moved from it in the last hour while Sam paces occasionally stopping at the window glancing out and pacing again creating a thick atmosphere of smoke tension and weariness in the small otherwise cozy room Norman stands watching him drive away as the car pulls up and Arbogast gets out leaving the motor running  As he starts to walk across the highway the camera pulls away and Arbogast reaches the phone booth and enters  The camera starts forward and we see Arbogast remove a small notebook from his pocket check a number drop a dime in the slot and dial  He hangs up and gets out of the phone booth  A distant view shows the House and Motel with a light on in the house and also in Norman's office  We see Norman emerge from his office and move along the porch toward the distant cabins carrying sheets on his arm  He goes into the last cabin and switches the light on  The hood of the white Ford enters the scene and stops and Arbogast gets out and goes over to the Motel office  Arbogast enters looks around the empty office and calls out  He goes over to the door to the parlor enters looks around the birdridden room goes over to it finds it unlocked and with a quick cautious look around he opens it straightens up and goes out  He goes off and dashes up the stone steps to the House "
        }
      ]
    }
  ]
}