{
  "ground_truth": "Sam stares at her, frowns in concern over her very real anxiety, goes to the phone, dials operator, and starts for the door, followed by Lila into the store. He pauses halfway down, turns, puts his hands on her arms. The silhouette of Norman is seen; he is still. Norman then turns slowly until, in silhouette, we see his profile, his chin lowered furtively as he looks over his shoulder in the direction of the house. The store is in darkness, only the glow from the back room spilling in. With the camera placed with its back to the street door, we see the distant tiny figure of Lila seated and waiting in the back room beyond. The tiny figure jumps up and runs all the way from the back room down the aisle of hardware and comes into a big head. From her viewpoint, we see Sam alighting from his truck and coming toward the door of the store. He enters, and he and Lila exchange quiet glances. She feels his pause, turns, and for a moment they share at each other across the darkened room. She hands the receiver to the Sheriff, who takes it reluctantly and listens to the dim sound of ringing on the other end. Sam and Lila stare at the Sheriff, who stares back at them, and when he finally speaks there is an almost inaudible tone of irony in his voice. Norman sits in the dim, one-lamp light, the phone next to him, his hand still near it as if he had not been able to move his hand after hanging up, staring at the shrike-like bird perched on the lamp shade. Suddenly, he rises, starts quickly out of the room, tries to switch off the lamp as he goes, and in so doing, succeeds only in knocking the bird off the shade. He then puts out the lamp, goes out, crosses the darkened office, and goes outside, coming off the porch. He walks to the path, directly up to the house, opens the door, and goes in. Norman goes up, pauses one moment outside his mother's door, then opens it and goes in, leaving the door open. He moves away and the others follow. She smiles brightly, as if having invited them over to discuss this year's charity fandango, takes the Sheriff's arm, and starts away. The Sheriff nods as he goes. Sam and Lila are alone now at the curb before the deserted chapel. As the truck drives off, Sam takes Lila's arm and starts with her toward the path that leads to the old house. The camera pans with them, and as they turn around the office corner, they see Norman coming down the path toward them.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sam gazes at her, scowls in apprehension over her very genuine unease, proceeds to the telephone, dials operator, and begins for the entrance, trailed by Lila into the shop. He hesitates midway down, swivels, places his hands on her limbs. The outline of Norman is observed; he is motionless. Norman then rotates slowly until, in outline, we view his aspect, his chin lowered secretively as he glances over his shoulder in the direction of the residence. The shop is in dimness, only the radiance from the rear chamber spilling in. With the camera positioned with its back to the avenue entrance, we observe the distant tiny shape of Lila seated and awaiting in the rear chamber beyond. The diminutive shape leaps up and sprints all the way from the rear chamber down the passageway of hardware and arrives into a large head. From her perspective, we view Sam descending from his vehicle and approaching the entrance of the shop. He enters, and he and Lila swap quiet looks. She senses his hesitation, turns, and for a moment they share at each other across the darkened chamber. She hands the handset to the Sheriff, who takes it unwillingly and listens to the faint tone of ringing on the other end. Sam and Lila gaze at the Sheriff, who gazes back at them, and when he finally speaks there is an almost imperceptible tone of sarcasm in his voice. Norman perches in the dim, one-bulb light, the telephone next to him, his hand still near it as if he had not been capable to move his hand after hanging up, staring at the shrike-like avian perched on the lamp shade. Abruptly, he rises, starts swiftly out of the chamber, attempts to turn off the lamp as he goes, and in so doing, manages only in knocking the avian off the shade. He then extinguishes the lamp, goes out, traverses the darkened bureau, and goes outside, descending off the porch. He strides to the path, directly up to the residence, opens the entrance, and goes in. Norman ascends, hesitates one moment outside his mother's entrance, then opens it and goes in, leaving the entrance open. He shifts away and the others trail. She grins brightly, as if having invited them over to discuss this year's charity gala, takes the Sheriff's limb, and commences away. The Sheriff nods as he goes. Sam and Lila are solitary now at the curb before the deserted chapel. As the truck drives off, Sam takes Lila's limb and starts with her toward the path that directs to the aged residence. The camera pans with them, and as they rotate around the bureau corner, they observe Norman descending the path toward them."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Her anxiety was frowned upon by Sam, who stared at her with concern. The phone was gone to, the operator was dialed, and the door was started for by him, and Lila followed him into the store. He pauses halfway down, turns, and her arms are put upon by his hands. Norman’s silhouette is seen; he remains still. Slowly, Norman is turned until his profile in silhouette is visible, his chin furtively lowered as a look over his shoulder in the house's direction is given by him. Darkness encompasses the store, with only the glow from the back room spilling in. With its back to the street door, the camera shows Lila’s distant tiny figure seated and waiting in the back room beyond. Up she jumps and runs all the way from the back room down the aisle of hardware, and is brought into a big head. From her viewpoint, Sam is seen by us alighting from his truck and coming toward the store's door. He enters, and quiet glances are exchanged by him and Lila. A pause is felt by her; she turns, and for a moment they share a look across the darkened room. The receiver is handed by her to the Sheriff, who takes it reluctantly and listens to the dim sound of ringing on the other end. The Sheriff is stared at by Sam and Lila, who are stared back at by him, and when he finally speaks, there is an almost inaudible tone of irony in his voice. Norman sits in the dim, one-lamp light, the phone next to him, his hand still near it as if he had not been able to move his hand after hanging up, staring at the shrike-like bird perched on the lamp shade. He rises suddenly, quickly starts out of the room, tries to switch off the lamp as he goes, and in so doing, knocks the bird off the shade. The lamp is then put out by him, the darkened office is crossed, and he goes outside, coming off the porch. The path is walked to by him, directly up to the house, the door is opened, and entry is made by him. Norman goes up, pauses one moment outside his mother's door, then he opens it and goes in, leaving the door open. Away he moves, and the others follow him. She smiles brightly, as if having invited them over to discuss this year's charity fandango, the Sheriff's arm is taken by her, and she starts away. The Sheriff nods as he goes. Alone now at the curb before the deserted chapel are Sam and Lila. As the truck drives off, Lila’s arm is taken by Sam, and he starts with her toward the path that leads to the old house. The camera pans with them, and around the office corner as they turn, Norman is seen coming down the path toward them."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Sam, concerned about her anxiety, dials the operator and heads for the door, followed by Lila into the store. He pauses, turns, and places his hands on her arms. Norman's silhouette is visible; he turns slowly, furtively glancing toward the house. The store is dark, with only a glow from the back room. From the street door, we see Lila seated in the back room. She jumps up, runs down the aisle, and sees Sam arriving from his truck. They exchange quiet glances across the dark room. She hands the receiver to the Sheriff, who listens to the ringing with an ironic tone. Norman sits in dim light, staring at a bird on the lamp shade. He rises, tries to switch off the lamp, knocking the bird off, and leaves the room. He crosses the dark office, goes outside, and heads to the house, entering and leaving the door open. He moves away, and others follow. She smiles brightly, takes the Sheriff's arm, and they leave. Sam and Lila are alone at the curb. As the truck departs, Sam takes Lila's arm, and they head toward the old house. The camera follows them as they see Norman approaching."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Sam, concerned about her anxiety, dials the operator and heads for the door, followed by Lila. He pauses, turns, and holds her arms. Norman's silhouette appears; he turns slowly, looking toward the house. The store is dark, with light from the back room. Lila, seated in the back, runs down the aisle. From her view, Sam exits his truck and enters the store. They exchange glances in the dark. She hands the receiver to the reluctant Sheriff, who listens to the ringing. Sam and Lila watch the Sheriff, who speaks with irony. Norman, in dim light, sits by the phone, staring at a bird on the lamp. He rises, tries to switch off the lamp, knocking the bird off, then leaves the room, crosses the office, and goes outside. He walks to the house, enters, and goes to his mother's door, leaving it open. She smiles, takes the Sheriff's arm, and they leave. The Sheriff nods. Sam and Lila, alone at the curb, head toward the old house. The camera follows as they see Norman approaching."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Sam gazes intently at her, his brow furrowing with genuine concern over the palpable anxiety she is experiencing. He moves purposefully to the phone, dials the operator, and begins to head toward the door, with Lila following closely behind him into the store. As he reaches the midway point, he pauses, turns back, and gently places his hands on her arms, offering a moment of reassurance. In the dim light, the silhouette of Norman becomes visible; he remains motionless. Norman then slowly turns, and in silhouette, his profile is revealed, his chin lowered in a furtive manner as he glances over his shoulder in the direction of the house. The store is enveloped in darkness, with only a faint glow emanating from the back room, casting a soft light. Positioned with its back to the street door, the camera captures the distant, tiny figure of Lila, seated and waiting patiently in the back room beyond. Suddenly, the small figure springs up and dashes all the way from the back room, racing down the aisle lined with hardware, and comes into a large close-up. From her perspective, we see Sam stepping down from his truck and making his way toward the store's entrance. He steps inside, and he and Lila exchange quiet, meaningful glances. She senses his hesitation, turns, and for a brief moment, they share a silent connection across the shadowy room. She hands the receiver to the Sheriff, who takes it with reluctance and listens to the faint sound of ringing on the other end. Sam and Lila fix their gaze on the Sheriff, who returns their stare, and when he finally speaks, there is a barely perceptible tone of irony in his voice. Norman sits in the dimly lit room, illuminated by a single lamp, the phone beside him, his hand still hovering near it as if frozen in place after hanging up, his eyes fixed on the shrike-like bird perched on the lamp shade. Suddenly, he rises abruptly, moves quickly out of the room, attempting to switch off the lamp as he goes, but in doing so, he only manages to knock the bird off the shade. He then extinguishes the lamp, exits the room, crosses the darkened office, and steps outside, descending from the porch. He walks along the path, directly up to the house, opens the door, and enters. Norman ascends, pauses momentarily outside his mother's door, then opens it and steps inside, leaving the door ajar. He moves away, and the others follow suit. She smiles brightly, as if she had invited them over to discuss this year's charity event, takes the Sheriff's arm, and begins to walk away. The Sheriff nods in acknowledgment as he departs. Sam and Lila are now left alone at the curb in front of the deserted chapel. As the truck drives away, Sam takes Lila's arm and starts with her toward the path that leads to the old house. The camera pans with them, and as they round the corner of the office, they see Norman approaching them, coming down the path."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Sam gazes intently at her, his brow furrowing deeply with genuine concern as he observes the palpable anxiety she is clearly experiencing. With a determined air, he moves purposefully toward the telephone, dials the operator with precision, and begins heading toward the door, his strides deliberate. Lila follows closely behind him, seamlessly entering the store in his wake. As he reaches the halfway point across the room, he pauses briefly, turns back towards her, and gently places his hands reassuringly on her arms, offering a moment filled with comfort. In the dim, subdued light, the silhouette of Norman becomes distinctly visible; he remains completely motionless, a figure shrouded in shadow. Norman then slowly turns, and in silhouette, his profile is gradually revealed; his chin is lowered in a furtive manner as he glances suspiciously over his shoulder toward the direction of the house. The entire store is enveloped in a blanket of darkness, with only a faint glow emanating from the back room, casting a soft and gentle light. Positioned with its back to the street door, the camera captures the distant, almost tiny figure of Lila, seated and waiting patiently in the back room beyond her immediate surroundings. Suddenly, the small figure springs up from her seat, dashing all the way from the back room, racing energetically down the aisle lined meticulously with hardware, and comes into a large, dramatic close-up. From her perspective, we see Sam stepping gracefully down from his truck and making his determined way toward the store's entrance. He steps inside, and he and Lila exchange quiet, meaningful glances, each filled with unspoken understanding. She senses his hesitation, turns slightly, and for a brief moment, they share a silent, significant connection across the shadowy room. She hands the telephone receiver to the Sheriff, who takes it with a sense of reluctance, listening attentively to the faint sound of ringing on the other end. Sam and Lila fix their intense gaze on the Sheriff, who returns their stare deliberately, and when he finally speaks, there is a barely perceptible tone of irony imbued in his voice. Norman sits alone in the dimly lit room, bathed in the glow of a single lamp, the phone beside him, his hand still hovering near it as if frozen in place after having just hung up, his eyes fixed intently on the shrike-like bird perched precariously on the lamp shade. Suddenly, he rises abruptly, moves quickly out of the room, attempting to switch off the lamp in his haste, but in doing so, manages only to knock the bird unceremoniously off the shade. He then extinguishes the lamp's light, exits the room, crosses the darkened office space, and steps outside, descending steadily from the porch. He walks purposefully along the path, directly up to the imposing house, opens the door with intent, and disappears inside. Norman ascends the staircase, pauses momentarily outside his mother's door, then opens it with a sense of purpose and steps inside, leaving the door ajar behind him. He moves away, and the others follow suit. She smiles brightly, as though she had invited them over for a cheerful discussion about this year's charity event, takes the Sheriff's arm in a friendly manner, and begins to walk contentedly away. The Sheriff nods in acknowledgment, understanding the moment, as he departs. Sam and Lila now find themselves left alone at the curb in front of the deserted chapel, feeling the weight of their solitude. As the truck drives away into the distance, Sam takes Lila's arm gently, and together they start with purposeful steps toward the path that leads to the old, enigmatic house ahead. The camera pans steadily with them, and as they round the corner of the office, they suddenly see Norman approaching them, coming purposefully down the path."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Sam fixes his gaze on her, his eyes narrowing with concern as he processes the visible signs of her anxiety. He then shifts his focus to the phone, moving purposefully toward it. With a steady hand, he dials the operator, his fingers pressing each button with intent. As the call connects, he begins to make his way toward the door, his movements deliberate and measured. Lila follows closely behind him, and together they enter the store. Midway down the aisle, Sam halts abruptly, turning to face Lila. He gently places his hands on her arms, offering a moment of reassurance. Meanwhile, the silhouette of Norman becomes visible, standing motionless. Norman then begins to turn slowly, his profile emerging in the dim light. His chin lowers in a furtive manner as he glances over his shoulder, directing his gaze toward the house. The store remains shrouded in darkness, with only a faint glow emanating from the back room. Positioned with its back to the street door, the camera captures the distant, tiny figure of Lila seated and waiting in the back room. Suddenly, the tiny figure springs to life, jumping up and sprinting down the aisle lined with hardware, her movement culminating in a close-up of her face. From her perspective, she observes Sam as he steps down from his truck and approaches the store's entrance. Upon entering, Sam and Lila exchange quiet, meaningful glances. She senses his hesitation, prompting her to turn, and for a brief moment, they share a silent connection across the dimly lit room. Lila then hands the phone receiver to the Sheriff, who accepts it with reluctance, listening to the faint ringing on the other end. Sam and Lila fix their eyes on the Sheriff, who returns their gaze. When he finally speaks, his voice carries a barely perceptible tone of irony. In another scene, Norman sits in the dim light cast by a single lamp, the phone resting beside him. His hand remains near the phone, as if frozen in place after hanging up, while he stares at a bird perched on the lamp shade. Suddenly, he rises with urgency, moving swiftly out of the room. In his haste, he attempts to switch off the lamp, inadvertently knocking the bird from its perch. He then successfully extinguishes the lamp, exits the room, crosses the darkened office, and steps outside, descending from the porch. He walks with purpose along the path, directly toward the house, opens the door, and enters. Norman ascends the stairs, pausing momentarily outside his mother's door before opening it and stepping inside, leaving the door ajar. He moves further into the room, and the others follow his lead. She greets them with a bright smile, as if welcoming them to discuss a community event, and takes the Sheriff's arm, leading him away. The Sheriff nods in acknowledgment as he departs. Sam and Lila find themselves alone at the curb in front of the deserted chapel. As the truck drives away, Sam gently takes Lila's arm, guiding her toward the path that leads to the old house. The camera follows their movement, and as they round the corner of the office, they catch sight of Norman approaching them down the path."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Sam, concerned about her anxiety, dials the operator and heads for the door, with Lila following him into the store. He pauses, turns, and reassures her with a touch on her arms. Meanwhile, Norman, silhouetted, furtively glances toward the house. The store remains dark, except for a glow from the back room where Lila waits. She jumps up as Sam arrives in his truck, and they exchange quiet glances across the dim room. Lila hands the phone to the Sheriff, who listens reluctantly, while Sam and Lila watch him. The Sheriff responds with a hint of irony. Norman, sitting in dim light, stares at a bird on the lamp. He abruptly rises, accidentally knocks the bird off while trying to switch off the lamp, and leaves the room. He crosses the dark office, exits the porch, and heads up the path to the house, entering and pausing outside his mother's door before going in. She greets them warmly, takes the Sheriff's arm, and they depart. Sam and Lila, now alone, walk toward the old house as the truck drives off. As they round the office corner, they spot Norman approaching them down the path."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Sam, noticing her anxiety rooted in their disturbing circumstances, stares at her, frowns in concern, goes to the phone, dials operator—a common practice before direct dialing was available—and starts for the door, followed by Lila into the store. He pauses halfway down, turns, puts his hands on her arms, reassuring her in the dim light. The silhouette of Norman, a figure known for his reclusive nature in this small town, is seen; he is still. Norman then turns slowly until, in silhouette against the evening sky, we see his profile, his chin lowered furtively as he looks over his shoulder in the direction of the house known locally as the Bates Mansion. The store is in darkness, only the glow from the back room, where inventory was often counted by hand, spilling in. With the camera placed with its back to the street door, we see the distant tiny figure of Lila seated and waiting in the back room beyond, surrounded by old shelves lining the walls. The tiny figure jumps up and runs all the way from the back room down the aisle of hardware filled with tools and supplies, and comes into a big head. From her viewpoint, we see Sam alighting from his truck, a familiar sight working in this rural area, and coming toward the door of the store. He enters, and he and Lila exchange quiet glances, an unspoken understanding passing between them. She feels his pause, turns, and for a moment they share at each other across the darkened room, an eerie quiet enveloping them. She hands the receiver to the Sheriff, who takes it reluctantly, knowing the weight of the call, and listens to the dim sound of ringing on the other end. Sam and Lila stare at the Sheriff, a figure of authority in this close-knit community, who stares back at them, and when he finally speaks there is an almost inaudible tone of irony in his voice. Norman sits in the dim, one-lamp light, the phone next to him, his hand still near it, as if he had not been able to move his hand after hanging up, staring at the shrike-like bird perched on the lamp shade—a symbol of foreboding. Suddenly, he rises, starts quickly out of the room, tries to switch off the lamp as he goes, and in so doing, succeeds only in knocking the bird off the shade, its plastic gaze unchanging. He then puts out the lamp, goes out, crosses the darkened office, filled with shadows that seem to watch him, and goes outside, coming off the porch with its creaky steps. He walks to the path, directly up to the house, opens the door, and goes in. Norman goes up, pauses one moment outside his mother's door, then opens it and goes in, leaving the door open, the old hinges creaking as if in protest. He moves away and the others follow. She smiles brightly, as if having invited them over to discuss this year's charity fandango, an annual event known for its lively participants, takes the Sheriff's arm, and starts away. The Sheriff nods as he goes, acknowledging the social dance they must perform. Sam and Lila are alone now at the curb before the deserted chapel, a symbol of the town's faded glory. As the truck drives off, Sam takes Lila's arm and starts with her toward the path that leads to the old house, known for its imposing silhouette against the sky. The camera pans with them, and as they turn around the office corner, they see Norman coming down the path toward them, his presence casting a shadow on their resolution."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Sam stares at her frowns in concern over her very real anxiety goes to the phone dials operator and starts for the door followed by Lila into the store  He pauses halfway down turns puts his hands on her arms  The silhouette of Norman is seen  She feels his pause turns and for a moment they share at each other across the darkened room  She hands the receiver to the Sheriff who takes it reluctantly and listens to the dim sound of ringing on the other end  Sam and Lila stare at the Sheriff who stares back at them and when he finally speaks there is an almost inaudible tone of irony in his voice  Norman sits in the dim onelamp light the phone next to him his hand still near it as if he had not been able to move his hand after hanging up staring at the shrikelike bird perched on the lamp shade  Suddenly he rises starts quickly out of the room tries to switch off the lamp as he goes and in so doing succeeds only in knocking the bird off the shade  He then puts out the lamp goes out crosses the darkened office and goes outside coming off the porch  He walks to the path directly up to the house opens the door and goes in  Norman goes up pauses one moment outside his mother's door then opens it and goes in leaving the door open  He moves away and the others follow  She smiles brightly as if having invited them over to discuss this year's charity  fandango takes the Sheriff's arm and starts away  The Sheriff nods as he goes  Sam and Lila are alone now at the curb before the deserted chapel  he is still  Norman then turns slowly until in silhouette we see his profile his chin lowered furtively as he looks over his shoulder in the direction of the house  The store is in darkness only the glow from the back room spilling in  With the camera placed with its back to the street door we see the distant tiny figure of Lila seated and waiting in the back room beyond  The tiny figure jumps up and runs all the way from the back room down the aisle of hardware and comes into a big head  From her viewpoint we see Sam alighting from his truck and coming toward the door of the store  He enters and he and Lila exchange quiet glances  She feels his pause turns and for a moment they share at each other across the darkened room  She hands the receiver to the Sheriff who takes it reluctantly and listens to the dim sound of ringing on the other end  Sam and Lila stare at the Sheriff who stares back at them and when he finally speaks there is an almost inaudible tone of irony in his voice  Norman sits in the dim onelamp light the phone next to him his hand still near it as if he had not been able to move his hand after hanging up staring at the shrikelike bird perched on the lamp shade  Suddenly he rises starts quickly out of the room tries to switch off the lamp as he goes and in so doing succeeds only in knocking the bird off the shade  He then puts out the lamp goes out crosses the darkened office and goes outside coming off the porch  He walks to the path directly up to the house opens the door and goes in  Norman goes up pauses one moment outside his mother's door then opens it and goes in leaving the door open  He moves away and the others follow  She smiles brightly as if having invited them over to discuss this year's charity  fandango takes the Sheriff's arm and starts away  The Sheriff nods as he goes  Sam and Lila are alone now at the curb before the deserted chapel  As the truck drives off Sam takes Lila's arm and starts with her toward the path that leads to the old house  The camera pans with them and as they turn around the office corner they see Norman coming down the path toward them"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Sam stares at her frowns in concern over her very real anxiety goes to the phone dials operator and starts for the door followed by Lila into the store. He pauses halfway down turns puts his hands on her arms. The silhouette of Norman is seen. he is still. Norman then turns slowly until in silhouette we see his profile his chin lowered furtively as he looks over his shoulder in the direction of the house. The store is in darkness only the glow from the back room spilling in. With the camera placed with its back to the street door we see the distant tiny figure of Lila seated and waiting in the back room beyond. The tiny figure jumps up and runs all the way from the back room down the aisle of hardware and comes into a big head. From her viewpoint we see Sam alighting from his truck and coming toward the door of the store. He enters and he and Lila exchange quiet glances. She feels his pause turns and for a moment they share at each other across the darkened room. She hands the receiver to the Sheriff who takes it reluctantly and listens to the dim sound of ringing on the other end. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Sam and Lila stare at the Sheriff who stares back at them and when he finally speaks there is an almost inaudible tone of irony in his voice. Norman sits in the dim onelamp light the phone next to him his hand still near it as if he had not been able to move his hand after hanging up staring at the shrikelike bird perched on the lamp shade. Suddenly he rises starts quickly out of the room tries to switch off the lamp as he goes and in so doing succeeds only in knocking the bird off the shade. He then puts out the lamp goes out crosses the darkened office and goes outside coming off the porch. He walks to the path directly up to the house opens the door and goes in. Norman goes up pauses one moment outside his mother's door then opens it and goes in leaving the door open. He moves away and the others follow. She smiles brightly as if having invited them over to discuss this year's charity. fandango takes the Sheriff's arm and starts away. The Sheriff nods as he goes. Sam and Lila are alone now at the curb before the deserted chapel. As the truck drives off Sam takes Lila's arm and starts with her toward the path that leads to the old house. The camera pans with them and as they turn around the office corner they see Norman coming down the path toward them."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Sam stares at her frowns in concern over her very real anxiety goes to the phone dials operator and starts for the door followed by Lila into the store. He pauses halfway down turns puts his hands on her arms. The silhouette of Norman is seen. he is still. Norman then turns slowly until in silhouette we see his profile his chin lowered furtively as he looks over his shoulder in the direction of the house. The store is in darkness only the glow from the back room spilling in. With the camera placed with its back to the street door we see the distant tiny figure of Lila seated and waiting in the back room beyond. The tiny figure jumps up and runs all the way from the back room down the aisle of hardware and comes into a big head. From her viewpoint we see Sam alighting from his truck and coming toward the door of the store. He enters and he and Lila exchange quiet glances. She feels his pause turns and for a moment they share at each other across the darkened room. She hands the receiver to the Sheriff who takes it reluctantly and listens to the dim sound of ringing on the other end. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Sam and Lila stare at the Sheriff who stares back at them and when he finally speaks there is an almost inaudible tone of irony in his voice. Norman sits in the dim onelamp light the phone next to him his hand still near it as if he had not been able to move his hand after hanging up staring at the shrikelike bird perched on the lamp shade. Suddenly he rises starts quickly out of the room tries to switch off the lamp as he goes and in so doing succeeds only in knocking the bird off the shade. He then puts out the lamp goes out crosses the darkened office and goes outside coming off the porch. He walks to the path directly up to the house opens the door and goes in. Norman goes up pauses one moment outside his mother's door then opens it and goes in leaving the door open. He moves away and the others follow. She smiles brightly as if having invited them over to discuss this year's charity. fandango takes the Sheriff's arm and starts away. The Sheriff nods as he goes. Sam and Lila are alone now at the curb before the deserted chapel. As the truck drives off Sam takes Lila's arm and starts with her toward the path that leads to the old house. The camera pans with them and as they turn around the office corner they see Norman coming down the path toward them."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Sam stares at her frowns in concern over her very real anxiety goes to the phone dials operator and starts for the door followed by Lila into the store. He pauses halfway down turns puts his hands on her arms. The silhouette of Norman is seen. he is still. Norman then turns slowly until in silhouette we see his profile his chin lowered furtively as he looks over his shoulder in the direction of the house. The store is in darkness only the glow from the back room spilling in. He moves away and the others follow. She smiles brightly as if having invited them over to discuss this year's charity. fandango takes the Sheriff's arm and starts away. The Sheriff nods as he goes. Sam and Lila are alone now at the curb before the deserted chapel. As the truck drives off Sam takes Lila's arm and starts with her toward the path that leads to the old house. The camera pans with them and as they turn around the office corner they see Norman coming down the path toward them."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Sam stares at her frowns in concern over her very real anxiety goes to the phone dials operator and starts for the door followed by Lila into the store. He pauses halfway down turns puts his hands on her arms. Sam and Lila are alone now at the curb before the deserted chapel. As the truck drives off Sam takes Lila's arm and starts with her toward the path that leads to the old house. The camera pans with them and as they turn around the office corner they see Norman coming down the path toward them."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The cat stares at her, frowns in concern over her very real anxiety, goes to the phone, dials operator, and starts for the door, followed by the dog into the store. The mouse pauses halfway down, turns, puts their hands on her arms. The silhouette of the elephant is seen; it is still. The elephant then turns slowly until, in silhouette, we see its profile, its chin lowered furtively as it looks over its shoulder in the direction of the house. The store is in darkness, only the glow from the back room spilling in. With the camera placed with its back to the street door, we see the distant tiny figure of the butterfly seated and waiting in the back room beyond. The tiny figure jumps up and runs all the way from the back room down the aisle of hardware and comes into a big head. From her viewpoint, we see the horse alighting from its truck and coming toward the door of the store. It enters, and it and the dog exchange quiet glances. The dog feels its pause, turns, and for a moment they share at each other across the darkened room. The dog hands the receiver to the giraffe, who takes it reluctantly and listens to the dim sound of ringing on the other end. The horse and the dog stare at the giraffe, who stares back at them, and when it finally speaks there is an almost inaudible tone of irony in its voice. The elephant sits in the dim, one-lamp light, the phone next to it, its hand still near it as if it had not been able to move its hand after hanging up, staring at the shrike-like bird perched on the lamp shade. Suddenly, it rises, starts quickly out of the room, tries to switch off the lamp as it goes, and in so doing, succeeds only in knocking the bird off the shade. It then puts out the lamp, goes out, crosses the darkened office, and goes outside, coming off the porch. It walks to the path, directly up to the house, opens the door, and goes in. The elephant goes up, pauses one moment outside its mother's door, then opens it and goes in, leaving the door open. It moves away and the others follow. The giraffe smiles brightly, as if having invited them over to discuss this year's charity fandango, takes the lion's arm, and starts away. The lion nods as it goes. The horse and the dog are alone now at the curb before the deserted chapel. As the truck drives off, the horse takes the dog's arm and starts with it toward the path that leads to the old house. The camera pans with them, and as they turn around the office corner, they see the elephant coming down the path toward them."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Sam stares at her, frowns in concern over her very real anxiety, goes to the bookshelf, dials operator, and starts for the window, followed by Lila into the bakery. He pauses halfway down, turns, puts his hands on her elbows. The silhouette of Norman is seen; he is still. Norman then turns slowly until, in silhouette, we see his profile, his chin lowered furtively as he looks over his shoulder in the direction of the library. The bakery is in darkness, only the glow from the back garden spilling in. With the camera placed with its back to the garden gate, we see the distant tiny figure of Lila seated and waiting in the back garden beyond. The tiny figure jumps up and runs all the way from the back garden down the aisle of books and comes into a big head. From her viewpoint, we see Sam alighting from his bicycle and coming toward the gate of the bakery. He enters, and he and Lila exchange quiet glances. She feels his pause, turns, and for a moment they share at each other across the shadowy garden. She hands the receiver to the Ranger, who takes it reluctantly and listens to the dim sound of ringing on the other end. Sam and Lila stare at the Ranger, who stares back at them, and when he finally speaks there is an almost inaudible tone of irony in his voice. Norman sits in the dim, one-candle light, the phone next to him, his hand still near it as if he had not been able to move his hand after hanging up, staring at the raven-like bird perched on the candle holder. Suddenly, he rises, starts quickly out of the kitchen, tries to switch off the candle as he goes, and in so doing, succeeds only in knocking the bird off the holder. He then puts out the candle, goes out, crosses the shadowy corridor, and goes outside, coming off the veranda. He walks to the lane, directly up to the library, opens the door, and goes in. Norman goes up, pauses one moment outside his mother's window, then opens it and goes in, leaving the window open. He moves away and the others follow. She smiles brightly, as if having invited them over to discuss this year's charity bazaar, takes the Ranger's arm, and starts away. The Ranger nods as he goes. Sam and Lila are alone now at the curb before the deserted amphitheater. As the bicycle drives off, Sam takes Lila's arm and starts with her toward the lane that leads to the old library. The camera pans with them, and as they turn around the corridor corner, they see Norman coming down the lane toward them."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Sam gazes at her, smiles in amusement over her very real anxiety, heads to the phone, taps the receiver, and skips for the door, accompanied by Lila into the store. He halts halfway down, nods, places his hands on her shoulders. The silhouette of Norman is seen; he is seated. Norman then spins slowly until, in silhouette, we see his outline, his chin tilted confidently as he glances over his shoulder in the direction of the house. The store is aglow, only the light from the back room dimming in. With the camera positioned with its back to the street door, we see the distant tiny figure of Lila standing and resting in the back room beyond. The tiny figure crouches and sprints all the way from the back room down the aisle of hardware and transforms into a big head. From her viewpoint, we see Sam descending from his truck and retreating toward the door of the store. He exits, and he and Lila share quiet glances. She feels his movement, spins, and for a moment they gaze at each other across the dimly lit room. She offers the receiver to the Sheriff, who takes it eagerly and listens to the faint sound of music on the other end. Sam and Lila watch the Sheriff, who nods back at them, and when he finally speaks there is an almost inaudible tone of curiosity in his voice. Norman reclines in the dim, one-lamp light, the phone beside him, his hand still next to it as if he had not been able to move his fingers after hanging up, admiring the shrike-like bird perched on the lamp shade. Suddenly, he jumps, rushes quickly out of the room, tries to adjust the lamp as he goes, and in so doing, manages only to dislodge the bird off the shade. He then extinguishes the lamp, retreats, crosses the illuminated office, and ventures outside, stepping off the porch. He strolls to the path, directly up to the house, clasps the door, and steps in. Norman climbs up, halts one moment outside his mother's door, then clasps it and steps in, leaving the door ajar. He shifts away and the others hesitate. She frowns brightly, as if having encouraged them over to negotiate this year's charity bazaar, releases the Sheriff's arm, and pauses away. The Sheriff shakes his head as he stays. Sam and Lila are stranded now at the curb before the bustling chapel. As the truck halts, Sam releases Lila's arm and halts with her toward the path that leads to the old house. The camera tilts with them, and as they circle around the office corner, they witness Norman pacing down the path toward them."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Alex examines the cactus, frowns in concern over its very real confusion, goes to the laptop, dials electrician, and starts for the garage, followed by Penelope into the museum. She pauses halfway down, turns, puts her feet on its branches. The silhouette of David is seen; he is still. David then turns slowly until, in silhouette, we see his profile, his forehead lowered furtively as he looks over his knee in the direction of the barn. The museum is in darkness, only the glow from the attic room spilling in. With the camera placed with its back to the garden gate, we see the distant tiny figure of Penelope seated and waiting in the attic room beyond. The tiny figure jumps up and runs all the way from the attic room down the aisle of books and comes into a big pocket. From its viewpoint, we see Alex alighting from her bicycle and coming toward the gate of the museum. She enters, and she and Penelope exchange quiet glances. It feels her pause, turns, and for a moment they share at each other across the dimly lit gallery. It hands the joystick to the Preacher, who takes it reluctantly and listens to the muted sound of singing on the other end. Alex and Penelope stare at the Preacher, who stares back at them, and when he finally speaks there is an almost inaudible tone of sarcasm in his gesture. David sits in the dim, one-candle light, the laptop next to her, his foot still near it as if they had not been able to move their foot after hanging up, staring at the pelican-like fish perched on the candle holder. Suddenly, she rises, starts quickly out of the cabin, tries to switch off the candle as she goes, and in so doing, succeeds only in knocking the fish off the holder. She then puts out the candle, goes out, crosses the dimly lit workshop, and goes outside, coming off the balcony. She walks to the road, directly up to the barn, opens the hatch, and goes in. David goes up, pauses one moment outside his uncle's closet, then opens it and goes in, leaving the closet open. He moves away and the others follow. It smiles brightly, as if having invited them over to discuss this year's community bazaar, takes the Preacher's leg, and starts away. The Preacher nods as it goes. Alex and Penelope are alone now at the curb before the abandoned lighthouse. As the bicycle drives off, Alex takes Penelope's branch and starts with it toward the road that leads to the old barn. The camera pans with them, and as they turn around the workshop edge, they see David coming down the road toward them."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Tom observes at her, grimaces in curiosity over her very real confusion, heads to the bookshelf, opens a book, and moves for the window, followed by Lisa into the garden. He hesitates halfway across, spins, places his fingers on her shoulders. The silhouette of Roger is seen; he is motionless. Roger then shifts slowly until, in silhouette, we see his outline, his chin raised cautiously as he glances over his back in the direction of the barn. The garden is cloaked in shadow, only the glimmer from the back porch spilling in. With the camera positioned with its back to the alley gate, we see the distant tiny figure of Lisa seated and waiting in the back porch beyond. The tiny figure leaps up and sprints all the way from the back porch through the aisle of flowers and bumps into a large tree. From her perspective, we see Tom descending from his bicycle and walking toward the window of the garden. He enters, and he and Lisa share quiet nods. She senses his stop, spins, and for a moment they gaze at each other across the dim garden. She gives the newspaper to the Detective, who takes it hesitantly and reads the faint sound of rustling on the other end. Tom and Lisa look at the Detective, who glances back at them, and when he finally speaks there is an almost unheard note of humor in his voice. Roger sits in the dim, single-lamp light, the newspaper next to him, his hand still near it as if he had not managed to move his hand after folding it, staring at the hawk-like cat perched on the table edge. Abruptly, he stands, moves swiftly out of the kitchen, tries to turn off the fan as he goes, and in doing so, manages only to knock the cat off the table. He then extinguishes the lamp, goes out, crosses the dimly-lit lounge, and steps outside, stepping off the veranda. He strides to the gate, directly up to the barn, opens the latch, and steps in. Roger climbs up, hesitates one moment outside his sister's room, then slides it open and steps in, leaving the door ajar. He backs away and the others trail. She beams warmly, as if having invited them over to discuss this year's harvest festival, takes the Detective's hand, and moves away. The Detective agrees as he strolls. Tom and Lisa are alone now at the sidewalk before the vacant bakery. As the bicycle rides off, Tom takes Lisa's hand and moves with her toward the gate that leads to the old barn. The camera tracks them, and as they curve around the lounge corner, they spot Roger approaching down the path toward them."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Sam gazes at her, grimaces in puzzlement over her very tangible excitement, strides to the trumpet, plucks a string, and heads for the window, trailed by Lila into the gallery. He hesitates midway down, spins, places his feet on her shoulders. The outline of Norman is visible; he remains motionless. Norman then swivels gradually until, in shadow, we discern his figure, his forehead lifted stealthily as he glances over his elbow in the direction of the barn. The gallery is cloaked in dimness, only the shimmer from the side chamber leaking in. With the camera positioned with its back to the garden gate, we observe the distant tiny silhouette of Lila standing and watching in the side chamber beyond. The tiny silhouette leaps up and scampers all the way from the side chamber down the row of pottery and arrives into a big embrace. From her vantage point, we witness Sam descending from his scooter and approaching the gate of the gallery. He steps inside, and he and Lila swap serene nods. She perceives his halt, rotates, and for a moment they gaze at each other across the shadowy space. She hands the saxophone to the Sheriff, who accepts it hesitantly and listens to the faint echo of strumming on the other end. Sam and Lila observe the Sheriff, who glares back at them, and when he finally responds there is an almost imperceptible shade of humility in his voice. Norman sits in the dim, single-candle light, the trumpet beside him, his hand still near it as if he had not managed to shift his hand after strumming, gazing at the hummingbird-like insect perched on the lampshade. Abruptly, he leaps, rushes swiftly out of the space, attempts to dim the candle as he goes, and in doing so, succeeds only in dislodging the insect off the shade. He then snuffs out the candle, exits, traverses the shadowy foyer, and heads outside, leaping off the veranda. He marches to the track, directly up to the barn, pushes the gate, and enters. Norman ascends, halts one moment outside his mother's window, then swings it open and steps in, leaving the window ajar. He drifts away and the others trail behind. She grins radiantly, as if having beckoned them over to arrange this month's baking fiesta, grasps the Sheriff's elbow, and trots away. The Sheriff bobs as he proceeds. Sam and Lila are isolated now at the sidewalk before the abandoned temple. As the scooter zooms away, Sam clasps Lila's elbow and marches with her toward the track that guides to the ancient barn. The camera glides with them, and as they pivot around the office bend, they spot Norman advancing down the track toward them."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Max glares at him, grins in curiosity over his imaginary bravery, skips to the couch, presses intercom, and leaps for the window, trailed by Zoe into the library. She halts midway down, spins, places her feet on his shoulders. The outline of Edgar is visible; he is frozen. Edgar then spins swiftly until, in outline, we catch his shadow, his forehead lifted suspiciously as he peers past his elbow in the direction of the barn. The library is in brightness, only the shadow from the front desk seeping out. With the camera positioned with its front to the garden gate, we observe the distant large silhouette of Zoe standing and pacing in the front desk beyond. The large silhouette sits down and tiptoes all the way from the front desk up the hallway of ceramics and tumbles into a small toe. From his perspective, we watch Max descending from his bicycle and going toward the window of the library. He exits, and he and Zoe exchange loud whispers. He senses her shift, spins, and for a fragment they gaze at each other across the illuminated space. He passes the microphone to the Gardener, who grabs it eagerly and listens to the faint echo of music on the other side. Max and Zoe peer at the Gardener, who peers back at them, and when he finally whispers there is an almost inaudible tone of amusement in his laughter. Edgar lounges in the bright, three-bulb glow, the stereo next to him, his foot still on it as if he had not been able to lift his foot after turning it off, peering at the wasp-like drone hovering around the bulb holder. Suddenly, he drops, moves sluggishly into the yard, attempts to turn on the light as he travels, and in so doing, succeeds only in scaring the drone from the holder. He then turns on the bulb, moves in, traverses the illuminated patio, and goes inside, coming onto the pier. He jogs to the fence, directly down to the barn, closes the gate, and moves out. Edgar climbs down, stops for a second inside his uncle's gate, then closes it and moves out, leaving the gate shut. He steps behind and the others wander. He frowns warmly, as if having pushed them away to solve next month's puzzle maze, grabs the Gardener's ear, and leaps toward. The Gardener shakes as he jumps. Max and Zoe are standing now in the aisle beside the overcrowded palace. As the bicycle rides on, Max grabs Zoe's hand and leaps with her down the pavement that guides to the new barn. The camera zooms on them, and as they twist beyond the patio hedge, they spot Edgar climbing up the pavement away from them."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Sam, concerned about the evident anxiety of a woman named Lila, calls the operator before heading with her into a dark store. They notice Norman, who seems suspicious and glances toward his house. The store's dim light reveals Lila watching Sam arrive from his truck. Inside, they quietly acknowledge each other, and Lila passes the phone receiver to a hesitant Sheriff. The Sheriff, displaying a trace of irony, listens to the faint ringing. Meanwhile, Norman, in a dimly lit room, struggles to move after a phone call, knocking a bird off a lamp. He then exits, crossing an office and entering his house. At his mother's door, Norman pauses before going in. Elsewhere, a smiling woman escorts the Sheriff away, and Sam and Lila find themselves alone by a deserted chapel. As the truck departs, Sam guides Lila toward the path by the old house, where they encounter Norman approaching."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The camera pans with them and as they turn around the office corner they see Norman coming down the path toward them As the truck drives off Sam takes Lila's arm and starts with her toward the path that leads to the old house  Sam and Lila are alone now at the curb before the deserted chapel  The Sheriff nods as he goes  fandango takes the Sheriff's arm and starts away  She smiles brightly as if having invited them over to discuss this year's charity  He moves away and the others follow  Norman goes up pauses one moment outside his mother's door then opens it and goes in leaving the door open  He walks to the path directly up to the house opens the door and goes in  He then puts out the lamp goes out crosses the darkened office and goes outside coming off the porch  Suddenly he rises starts quickly out of the room tries to switch off the lamp as he goes and in so doing succeeds only in knocking the bird off the shade  Norman sits in the dim onelamp light the phone next to him his hand still near it as if he had not been able to move his hand after hanging up staring at the shrikelike bird perched on the lamp shade  Sam and Lila stare at the Sheriff who stares back at them and when he finally speaks there is an almost inaudible tone of irony in his voice  She hands the receiver to the Sheriff who takes it reluctantly and listens to the dim sound of ringing on the other end  She feels his pause turns and for a moment they share at each other across the darkened room  He enters and he and Lila exchange quiet glances  From her viewpoint we see Sam alighting from his truck and coming toward the door of the store  The tiny figure jumps up and runs all the way from the back room down the aisle of hardware and comes into a big head  With the camera placed with its back to the street door we see the distant tiny figure of Lila seated and waiting in the back room beyond  The store is in darkness only the glow from the back room spilling in  Norman then turns slowly until in silhouette we see his profile his chin lowered furtively as he looks over his shoulder in the direction of the house  he is still  The silhouette of Norman is seen  He pauses halfway down turns puts his hands on her arms  Sam stares at her frowns in concern over her very real anxiety goes to the phone dials operator and starts for the door followed by Lila into the store "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He then puts out the lamp goes out crosses the darkened office and goes outside coming off the porch  The Sheriff nods as he goes  She smiles brightly as if having invited them over to discuss this year's charity  He walks to the path directly up to the house opens the door and goes in  He moves away and the others follow  She hands the receiver to the Sheriff who takes it reluctantly and listens to the dim sound of ringing on the other end  Norman goes up pauses one moment outside his mother's door then opens it and goes in leaving the door open  Suddenly he rises starts quickly out of the room tries to switch off the lamp as he goes and in so doing succeeds only in knocking the bird off the shade  The tiny figure jumps up and runs all the way from the back room down the aisle of hardware and comes into a big head  Sam stares at her frowns in concern over her very real anxiety goes to the phone dials operator and starts for the door followed by Lila into the store  fandango takes the Sheriff's arm and starts away  He enters and he and Lila exchange quiet glances  As the truck drives off Sam takes Lila's arm and starts with her toward the path that leads to the old house  The store is in darkness only the glow from the back room spilling in  He pauses halfway down turns puts his hands on her arms  Sam and Lila stare at the Sheriff who stares back at them and when he finally speaks there is an almost inaudible tone of irony in his voice  The silhouette of Norman is seen  he is still  The camera pans with them and as they turn around the office corner they see Norman coming down the path toward them With the camera placed with its back to the street door we see the distant tiny figure of Lila seated and waiting in the back room beyond  Norman then turns slowly until in silhouette we see his profile his chin lowered furtively as he looks over his shoulder in the direction of the house  From her viewpoint we see Sam alighting from his truck and coming toward the door of the store  She feels his pause turns and for a moment they share at each other across the darkened room  Norman sits in the dim onelamp light the phone next to him his hand still near it as if he had not been able to move his hand after hanging up staring at the shrikelike bird perched on the lamp shade  Sam and Lila are alone now at the curb before the deserted chapel "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Norman sits in the dim onelamp light the phone next to him his hand still near it as if he had not been able to move his hand after hanging up staring at the shrikelike bird perched on the lamp shade  Suddenly he rises starts quickly out of the room tries to switch off the lamp as he goes and in so doing succeeds only in knocking the bird off the shade  He then puts out the lamp goes out crosses the darkened office and goes outside coming off the porch  He walks to the path directly up to the house opens the door and goes in  Norman goes up pauses one moment outside his mother's door then opens it and goes in leaving the door open  He moves away and the others follow  She smiles brightly as if having invited them over to discuss this year's charity  fandango takes the Sheriff's arm and starts away  The Sheriff nods as he goes  Sam and Lila are alone now at the curb before the deserted chapel  As the truck drives off Sam takes Lila's arm and starts with her toward the path that leads to the old house  The camera pans with them and as they turn around the office corner they see Norman coming down the path toward them Sam stares at her frowns in concern over her very real anxiety goes to the phone dials operator and starts for the door followed by Lila into the store  He pauses halfway down turns puts his hands on her arms  The silhouette of Norman is seen  he is still  Norman then turns slowly until in silhouette we see his profile his chin lowered furtively as he looks over his shoulder in the direction of the house  The store is in darkness only the glow from the back room spilling in  With the camera placed with its back to the street door we see the distant tiny figure of Lila seated and waiting in the back room beyond  The tiny figure jumps up and runs all the way from the back room down the aisle of hardware and comes into a big head  From her viewpoint we see Sam alighting from his truck and coming toward the door of the store  He enters and he and Lila exchange quiet glances  She feels his pause turns and for a moment they share at each other across the darkened room  She hands the receiver to the Sheriff who takes it reluctantly and listens to the dim sound of ringing on the other end  Sam and Lila stare at the Sheriff who stares back at them and when he finally speaks there is an almost inaudible tone of irony in his voice "
        }
      ]
    }
  ]
}