{
  "ground_truth": "She shrinks back, and then he throws it into her lap. As he continues to speak, he punctuates each phrase with another lit match. REGGIE is too busy beating them out to do anything else, frantically beating out the matches with her eyes on her work. She notices her hand is shaking and reaches back into her bag, removes a piece of candy, puts it into her mouth, and leans her head back against the wall, closing her eyes. Suddenly the door opens and REGGIE shrieks — but this time it is PETER. REGGIE and PETER enter the deserted lobby, and she goes to the desk, followed by PETER, where the NIGHT CLERK greets them sleepily. They go to the elevator where he opens the door for her, and as REGGIE and PETER enter the small cage, it is somewhat cramped, forcing them to stand close together. The elevator stops, and he reaches across her and opens the door. She stops as she sees something, and instead of a human hand, there is a twin-pronged metal one. SCOBIE sees where REGGIE is staring, looks down at it himself, then lunges at her, raising the hand to strike. The hand is starting to come down, but REGGIE, moving quickly, turns and flies out. As REGGIE runs out, slamming the door after her, the metal hand crashes against the wooden panel inside the door and splinters through it, visible on this side now. Petrified with fear, REGGIE can only stare dumbly at the protruding claw as PETER comes running up to her and sees the metal hand. Then, using all his weight, he slams the door open as far as it will go, making sure to hold it that way as he steps in. Inside, PETER pulls back the door and slugs the startled SCOBIE full on the jaw. His head bangs against the wall, but he manages to raise a foot and push PETER violently away, sending him sprawling back, toppling across the bed and over, head first, onto the floor on the other side, where he disappears. Hurrying, SCOBIE puts his foot against the door and pushes it away, ripping his metal hand free. He then rushes to the open window and climbs out. REGGIE waits anxiously, and when she hears nothing, she gingerly looks into the room. PETER, unsteady on his feet, goes to the window and looks out before turning back and climbing out. Outside the window to REGGIE's room is a small, false balcony with barely enough room between it and the building's facade for a man to stand. PETER appears and looks down over the railing, but shooting straight down, there is no one on the street and it is too far to jump.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She recoils back, and then he tosses it into her lap. As he proceeds to talk, he punctuates each expression with another lit match. REGGIE is too busy extinguishing them to do anything else, frantically extinguishing the matches with her eyes on her task. She notices her hand is trembling and reaches back into her bag, extracts a piece of candy, places it into her mouth, and rests her head back against the wall, closing her eyes. Suddenly the door opens and REGGIE shrieks — but this time it is PETER. REGGIE and PETER enter the vacant lobby, and she goes to the desk, followed by PETER, where the NIGHT CLERK welcomes them sleepily. They go to the elevator where he opens the door for her, and as REGGIE and PETER enter the small cage, it is somewhat confined, forcing them to stand close together. The elevator halts, and he reaches across her and opens the door. She stops as she sees something, and instead of a human hand, there is a twin-pronged metallic one. SCOBIE sees where REGGIE is gazing, looks down at it himself, then lunges at her, raising the hand to strike. The hand is beginning to descend, but REGGIE, moving swiftly, turns and darts out. As REGGIE dashes out, slamming the door after her, the metallic hand crashes against the wooden panel inside the door and splinters through it, visible on this side now. Petrified with fear, REGGIE can only stare dumbly at the protruding claw as PETER comes running up to her and sees the metallic hand. Then, using all his weight, he slams the door open as far as it will go, making sure to hold it that way as he steps in. Inside, PETER pulls back the door and punches the startled SCOBIE full on the jaw. His head bangs against the wall, but he manages to raise a foot and shove PETER forcefully away, sending him sprawling back, toppling across the bed and over, head first, onto the floor on the other side, where he vanishes. Hurrying, SCOBIE puts his foot against the door and pushes it away, ripping his metallic hand free. He then rushes to the open window and climbs out. REGGIE waits anxiously, and when she hears nothing, she gingerly looks into the room. PETER, unsteady on his feet, goes to the window and looks out before turning back and climbing out. Outside the window to REGGIE's room is a small, false balcony with scarcely enough room between it and the building's facade for a man to stand. PETER appears and looks down over the railing, but shooting straight down, there is no one on the street and it is too far to jump."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "She shrinks back, and then it is thrown into her lap by him. As he continues to speak, each phrase is punctuated by him with another lit match. REGGIE is too busy to do anything else, frantically beating out the matches with her eyes on her work. Her shaking hand is noticed by her, and a piece of candy is removed from her bag, put into her mouth, and she leans her head back against the wall, her eyes closing. Suddenly the door is opened and REGGIE shrieks — but this time it is PETER. The deserted lobby is entered by REGGIE and PETER, and the desk is approached by her, followed by PETER, where they are greeted sleepily by the NIGHT CLERK. The elevator door is opened for her, and as REGGIE and PETER enter the small cage, they are somewhat cramped, forcing them to stand close together. The elevator stops, and the door is opened by him as he reaches across her. She stops as something is seen by her, and instead of a human hand, there is a twin-pronged metal one. REGGIE is stared at by SCOBIE, who looks down at it himself, then lunges at her, raising the hand to strike. The hand starts to come down, but quickly, REGGIE turns and flies out. As the door is slammed by REGGIE after her, the metal hand crashes against the wooden panel inside the door and splinters through it, visible on this side now. Petrified with fear, REGGIE can only stare dumbly at the protruding claw as PETER runs up to her and sees the metal hand. Then, using all his weight, he opens the door as far as it will go, making sure to hold it that way as he steps in. Inside, SCOBIE is pulled back by PETER, who slugs him full on the jaw. His head bangs against the wall, but a foot is managed to be raised by him, pushing PETER violently away, sending him sprawling back, toppling across the bed and over, head first, onto the floor on the other side, where he disappears. Hurriedly, the foot is placed by SCOBIE against the door, and he pushes it away, ripping free his metal hand. Then, the open window is rushed to by him, and he climbs out. REGGIE waits anxiously, and when nothing is heard, the room is gingerly looked into by her. Unsteadily on his feet, PETER goes to the window and looks out before turning back and climbing out. A small, false balcony outside the window to REGGIE's room has barely enough room between it and the building's facade for a man to stand. PETER appears and looks down over the railing, but straight down is nothing, and no one is on the street, and it is too far to jump."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "She shrinks back as he tosses it into her lap and punctuates each phrase with a lit match. REGGIE frantically focuses on extinguishing the matches while noticing her shaky hand. She grabs a candy from her bag, leans back, and closes her eyes. Suddenly, the door opens, and REGGIE shrieks, but it's PETER. They enter the deserted lobby, greeted sleepily by the NIGHT CLERK, then proceed to the elevator, standing closely inside the cramped space as PETER opens the door. When it stops, he reaches across to open it, and REGGIE pauses, noticing a twin-pronged metal hand instead of a human one. SCOBIE lunges at her, but REGGIE quickly escapes, slamming the door behind her. The metal hand crashes through the door, leaving REGGIE petrified. PETER arrives, sees the hand, and slams the door open, entering to punch SCOBIE who retaliates, sending PETER sprawling over the bed. SCOBIE escapes through the window. REGGIE hesitantly looks in as PETER regains balance, checks the window, then climbs out onto a narrow false balcony outside her room. He sees no one below, realizing it's too far to jump."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "She shrinks back, and he throws it into her lap, punctuating each phrase with a lit match. REGGIE is too busy extinguishing them to react, beating out matches while focused on her work. Her hand shakes; she takes a candy, leans back against the wall, and closes her eyes. Suddenly the door opens; REGGIE shrieks—it's PETER. They enter the deserted lobby, greeted sleepily by the NIGHT CLERK, then go to the elevator. It's cramped, forcing them close. As the elevator stops, he opens the door; instead of a human hand, there's a twin-pronged metal one. SCOBIE sees where REGGIE stares, lunges at her with the metal hand. REGGIE quickly escapes, slamming the door. The metal hand crashes through, petrifying her. PETER runs, sees the metal hand, and slams the door open, confronting SCOBIE. PETER strikes SCOBIE, who shoves PETER away, sending him sprawling. SCOBIE pushes the door, freeing his hand, and climbs out the window. REGGIE anxiously peeks inside. PETER, unsteady, looks out and climbs out too. Outside REGGIE's window is a small false balcony. PETER checks below, sees no one on the street, and it's too far to jump."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "She hesitantly shrinks back, displaying an air of reluctance, and then he abruptly throws it directly into her lap. As he continues to fill the air with his words, he dramatically punctuates each distinct phrase by striking another lit match. REGGIE finds herself overwhelmingly occupied with the urgent task of beating them out, unable to focus on anything else as she frantically extinguishes the matches, her eyes fixated on her work. In the midst of this chaos, she becomes acutely aware of her hand trembling and reaches back into her bag with a sense of desperation. She retrieves a piece of candy, places it into her mouth, and leans her head back against the wall, closing her eyes in search of a brief respite. Suddenly, the door swings open sharply, and REGGIE emits a startled shriek — but this time, it is PETER who has entered. Both REGGIE and PETER make their way into the deserted, eerily quiet lobby, and she proceeds to the desk with PETER following closely behind, where they are met by the NIGHT CLERK, who greets them in a sleepy, lethargic manner. Together, they move towards the elevator, where he courteously opens the door for her. As REGGIE and PETER step into the small, cramped cage of the elevator, they are compelled to stand close together due to the limited space. When the elevator grinds to a halt, he reaches across her to open the door. She suddenly pauses as she notices something unusual, realizing in shock that instead of a human hand, there is a twin-pronged metal one. SCOBIE becomes aware of where REGGIE is staring, glances down at it himself, then suddenly lunges towards her, raising the metallic hand with the intent to strike. The hand begins its menacing descent, but REGGIE, reacting swiftly, pivots and darts out of harm's way. As REGGIE makes a hasty escape, she slams the door after herself, and the metal hand mercilessly crashes against the wooden panel on the inside of the door, splintering through it and becoming visibly protruded on this side now. Paralyzed with fear, REGGIE stands there, only able to stare dumbly at the menacing claw extending outwards, until PETER rushes to her side and also witnesses the metal hand. Then, summoning all his strength, he throws the door open with force, ensuring to hold it open as he makes his way inside. Once inside, PETER pulls back the door and delivers a powerful punch directly to SCOBIE's jaw, surprising him. SCOBIE's head slams against the wall, but he manages to lift a foot and forcefully pushes PETER away, sending him sprawling backwards, tumbling across the bed and flipping over, head first, onto the floor on the opposite side, where he temporarily vanishes from view. Acting hastily, SCOBIE places his foot against the door, pushing it away, and tears his metal hand free. He then rushes toward the open window and climbs out with urgency. REGGIE anxiously waits in anticipation, and when she does not hear a sound, she cautiously peers into the room. PETER, unsteady but determined on his feet, goes to the window and peers outside before turning back and climbing out. Outside the window to REGGIE's room is a small, deceptive balcony, with barely enough room between it and the building's facade for a man to precariously stand. PETER appears there and looks down over the railing, but when looking directly downwards, there is no one on the street below, and the distance is too great to attempt a jump."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "She hesitantly shrinks back, evoking an air of reluctance and uncertainty, before he suddenly, without any warning, throws it directly into her lap with deliberate intent. As he continues to fill the air with a barrage of his words, he dramatically punctuates and accentuates each distinct phrase by striking another lit match one after another. REGGIE finds herself overwhelmingly occupied, consumed with the urgent task of beating them out. She becomes unable to focus on anything else as she frantically extinguishes the matches, her eyes intensely fixated on her task at hand. In the midst of this chaotic scene, she becomes acutely aware of her trembling hand and, with a sense of desperation, reaches back into her bag. She retrieves a piece of candy, places it into her mouth, and leans her head back against the wall, closing her eyes in a momentary search for a brief respite. Suddenly, with a sharp, unexpected motion, the door swings open, and REGGIE emits a startled shriek, taken by surprise. However, this time, it is PETER who has entered the room. Both REGGIE and PETER proceed to make their way into the deserted, eerily quiet lobby, and she approaches the desk with PETER following closely behind. There, they are met by the NIGHT CLERK, who greets them in a sleepy, lethargic manner, as if barely awake. Together, they move towards the elevator, where PETER courteously opens the door for her with a polite gesture. As REGGIE and PETER step into the small, cramped cage of the elevator, they find themselves compelled to stand in close proximity due to the limited space available. When the elevator grinds to a halt, he reaches across her to open the door. She suddenly pauses as she notices something out of the ordinary, realizing in shock that instead of a human hand, there is a twin-pronged metal one in its place. SCOBIE becomes aware of where REGGIE is staring intently, glances down at it himself, then suddenly lunges aggressively towards her, raising the metallic hand with the intent to strike. The hand begins its menacing descent, but REGGIE, reacting swiftly, pivots and darts quickly out of harm's way. As REGGIE makes her hasty escape, she slams the door shut with force behind her, and the metal hand crashes mercilessly against the wooden panel on the inside of the door, splintering through it and becoming visibly protruded from this side now. Paralyzed with fear, REGGIE stands there, unable to do anything but stare dumbly at the menacing claw extending outwards until PETER swiftly rushes to her side, also witnessing the metal hand. Then, summoning all his strength, he throws the door open with force, ensuring to hold it open as he makes his way inside the room. Once inside, PETER pulls back the door and delivers a powerful punch directly to SCOBIE's jaw, catching him by surprise. SCOBIE's head slams against the wall, but he manages to quickly lift a foot and forcefully pushes PETER away, sending him sprawling backward. PETER tumbles across the bed, flipping over headfirst onto the floor on the opposite side, where he temporarily vanishes from view. Acting hastily, SCOBIE places his foot against the door, pushing it forcefully away, and tears his metal hand free. He then rushes toward the open window with urgency and climbs out swiftly. REGGIE anxiously waits in anticipation, and when she does not hear a sound, she cautiously peers into the room. PETER, unsteady yet determined on his feet, goes to the window and peers outside before turning back and climbing out after SCOBIE. Outside the window to REGGIE's room is a small, deceptive balcony, providing barely enough room between it and the building's towering facade for a man to precariously stand. PETER appears there, looking down over the railing intently, but when he gazes directly downwards, there is no one visible on the street below, and the distance is too great to consider attempting a jump."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "She initially pulls back instinctively as a reflexive response to the situation, and then he hurls the object directly into her lap with an assertive motion. As he continues to articulate his thoughts, he emphasizes each sentence by lighting a new match with a brisk flick of his fingers. REGGIE is overwhelmed and engrossed in the urgent task of extinguishing the fiery matches, preoccupied to the point of being unable to do anything else, as she hastily swats at the matches, her full attention on quelling the small flames. During her efforts, she becomes aware of her hand trembling noticeably, prompting her to reach back into her bag, where she retrieves a piece of candy, places it purposefully into her mouth, and then leans her head back against the wall in an attempt to calm herself, closing her eyes to momentarily shut out the chaos. Abruptly, the door swings open, startling REGGIE into a shriek, only for relief to wash over her when she sees it is PETER stepping through the doorway. Together, REGGIE and PETER proceed into the empty lobby, where she heads straight to the desk with PETER trailing closely behind her, leading to a sleepy greeting from the NIGHT CLERK. They then move to the elevator, where he courteously opens the door for her, and as REGGIE and PETER step into the small, confined space, they find themselves standing in close proximity due to the cramped conditions. The elevator halts its ascent, and with a smooth motion, he extends his arm across her to open the door, at which point she freezes at the sight of something unexpected—a twin-pronged metal hand instead of a human one. As SCOBIE becomes aware of where REGGIE is fixated, he glances down at the metallic appendage himself before suddenly lunging toward her, preparing to strike with the menacing hand. As the hand begins to descend menacingly, REGGIE reacts with speed, swiftly turning and darting out, hastily slamming the door behind her, but not before the metal hand smashes against the door and splinters through the wood, leaving the sharp claw protruding visibly. Overcome with terror, REGGIE can only stare wide-eyed in horror at the exposed claw, until PETER rushes up beside her, taking in the sight of the metallic hand. Using his full body weight, he forcefully pushes the door open as wide as possible, ensuring it remains so as he steps inside. Once inside, PETER quickly pulls the door back and delivers a powerful punch to SCOBIE's jaw, catching him off guard. Despite his head being knocked against the wall, SCOBIE manages to lift his leg and shove PETER away with considerable force, causing him to fall backward, topple over the bed, and disappear headfirst to the floor on the opposite side. Quickly, SCOBIE places his foot against the door, pushes it away to free his entangled metal hand, and then darts toward the open window, clambering out in haste. Meanwhile, REGGIE waits with mounting anxiety, and as silence prevails, she tentatively peeks into the room. PETER, regaining his balance, approaches the window to peer out before deciding to climb out himself. Outside the window leading to REGGIE's room, there is a narrow, decorative balcony scarcely providing enough space for a person to stand against the building's facade. PETER emerges onto this narrow ledge, looking down past the railing, but with the ground far below and the street devoid of movement, the drop is too perilous to attempt a jump."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "She shrinks back as he throws a lit match into her lap and continues to speak, prompting her to frantically extinguish each match while keeping her eyes focused on her task. Noticing her hand shaking, she takes a piece of candy from her bag and puts it in her mouth, leaning back and closing her eyes for a moment of calm. Suddenly, the door opens, and she shrieks, but it's just PETER. Together, they enter the deserted lobby, greet the sleepy NIGHT CLERK at the desk, and proceed to the elevator. PETER opens the door for her, and they both enter the cramped space, standing close together. When the elevator stops, he opens the door, but she hesitates upon seeing a twin-pronged metal hand instead of a human one. As SCOBIE lunges to strike her, REGGIE quickly escapes, slamming the door behind her as the metal hand splinters through it. Terrified, she stares at the protruding claw until PETER arrives and slams the door open, entering the room to confront SCOBIE. PETER punches SCOBIE, who retaliates by pushing PETER onto the floor. SCOBIE uses the opportunity to free his metal hand from the door and escape through the window. REGGIE anxiously peers into the room as PETER steadies himself, checks the window, and then climbs out. Outside, he finds a small false balcony with barely enough room to stand. PETER looks down but sees no one on the street, and it's too far to jump."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She shrinks back, and then he throws it into her lap. As he continues to speak, he punctuates each phrase with another lit match, a dangerous gesture reminiscent of old interrogation tactics. REGGIE is too busy beating them out to do anything else, frantically beating out the matches with her eyes on her work. She notices her hand is shaking, a common reaction to high stress, and reaches back into her bag, removes a piece of candy, puts it into her mouth, savoring the sugar rush that momentarily calms her nerves, and leans her head back against the wall, closing her eyes. Suddenly the door opens and REGGIE shrieks — but this time it is PETER, who is known for his timely interventions. REGGIE and PETER enter the deserted lobby, and she goes to the desk, followed by PETER, where the NIGHT CLERK, who has been working the graveyard shift and is visibly exhausted, greets them sleepily. They go to the elevator where he opens the door for her, and as REGGIE and PETER enter the small cage, reminiscent of early 20th-century designs, it is somewhat cramped, forcing them to stand close together. The elevator stops, and he reaches across her and opens the door. She stops as she sees something, and instead of a human hand, there is a twin-pronged metal one, an unusual prosthetic that suggests a complex backstory for its owner. SCOBIE sees where REGGIE is staring, looks down at it himself, then lunges at her, raising the hand to strike. The hand is starting to come down, but REGGIE, moving quickly, turns and flies out. As REGGIE runs out, slamming the door after her, the metal hand crashes against the wooden panel inside the door and splinters through it, a testament to its strength, visible on this side now. Petrified with fear, REGGIE can only stare dumbly at the protruding claw as PETER comes running up to her and sees the metal hand. Then, using all his weight, he slams the door open as far as it will go, making sure to hold it that way as he steps in. Inside, PETER pulls back the door and slugs the startled SCOBIE full on the jaw, an effective move often seen in confrontations. His head bangs against the wall, but he manages to raise a foot and push PETER violently away, sending him sprawling back, toppling across the bed and over, head first, onto the floor on the other side, where he disappears. Hurrying, SCOBIE puts his foot against the door and pushes it away, ripping his metal hand free. He then rushes to the open window and climbs out. REGGIE waits anxiously, and when she hears nothing, she gingerly looks into the room. PETER, unsteady on his feet as if recovering from a disorienting blow, goes to the window and looks out before turning back and climbing out. Outside the window to REGGIE's room is a small, false balcony, a decorative feature rather than a functional one, with barely enough room between it and the building's facade for a man to stand. PETER appears and looks down over the railing, but shooting straight down, there is no one on the street and it is too far to jump, highlighting the perilous situation they face."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "She shrinks back and then he throws it into her lap. As he continues to speak he punctuates each phrase with another lit match. REGGIE is too busy beating them out to do anything else frantically beating out the matches with her eyes on her work. She notices her hand is shaking and reaches back into her bag removes a piece of candy puts it into her mouth and leans her head back against the wall closing her eyes. Suddenly the door opens and REGGIE shrieks — but this time it is PETER. REGGIE and PETER enter the deserted lobby and she goes to the desk followed by PETER where the NIGHT CLERK greets them sleepily. They go to the elevator where he opens the door for her and as REGGIE and PETER enter the small cage it is somewhat cramped forcing them to stand close together. The elevator stops and he reaches across her and opens the door. She stops as she sees something and instead of a human hand there is a twinpronged metal one. SCOBIE sees where REGGIE is staring looks down at it himself then lunges at her raising the hand to strike. The hand is starting to come down but REGGIE moving quickly turns and flies out. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. As REGGIE runs out slamming the door after her the metal hand crashes against the wooden panel inside the door and splinters through it visible on this side. now. Petrified with fear REGGIE can only stare dumbly at the protruding claw as PETER comes running up to her and sees the metal hand. Then using all his weight he slams the door open as far as it will go making sure to hold it that way as he steps in. Inside PETER pulls back the door and slugs the startled SCOBIE full on the jaw. His head bangs against the wall but he manages to raise a foot and push PETER violently away sending him sprawling back toppling across the bed and over head first onto the floor on the other side where he disappears. Hurrying SCOBIE puts his foot against the door and pushes it away ripping his metal hand free. He then rushes to the open window and climbs out. REGGIE waits anxiously and when she hears nothing she gingerly looks into the room. PETER unsteady on his feet goes to the window and looks out before turning back and climbing out. Outside the window to REGGIE's room is a small false balcony with barely enough room between it and the building's facade for a man to stand. PETER appears and looks down over the railing but shooting straight down there is no one on the street and it is too far to jump."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "She shrinks back and then he throws it into her lap. As he continues to speak he punctuates each phrase with another lit match. REGGIE is too busy beating them out to do anything else frantically beating out the matches with her eyes on her work. She notices her hand is shaking and reaches back into her bag removes a piece of candy puts it into her mouth and leans her head back against the wall closing her eyes. Suddenly the door opens and REGGIE shrieks — but this time it is PETER. REGGIE and PETER enter the deserted lobby and she goes to the desk followed by PETER where the NIGHT CLERK greets them sleepily. They go to the elevator where he opens the door for her and as REGGIE and PETER enter the small cage it is somewhat cramped forcing them to stand close together. The elevator stops and he reaches across her and opens the door. She stops as she sees something and instead of a human hand there is a twinpronged metal one. SCOBIE sees where REGGIE is staring looks down at it himself then lunges at her raising the hand to strike. The hand is starting to come down but REGGIE moving quickly turns and flies out. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. As REGGIE runs out slamming the door after her the metal hand crashes against the wooden panel inside the door and splinters through it visible on this side. now. Petrified with fear REGGIE can only stare dumbly at the protruding claw as PETER comes running up to her and sees the metal hand. Then using all his weight he slams the door open as far as it will go making sure to hold it that way as he steps in. Inside PETER pulls back the door and slugs the startled SCOBIE full on the jaw. His head bangs against the wall but he manages to raise a foot and push PETER violently away sending him sprawling back toppling across the bed and over head first onto the floor on the other side where he disappears. Hurrying SCOBIE puts his foot against the door and pushes it away ripping his metal hand free. He then rushes to the open window and climbs out. REGGIE waits anxiously and when she hears nothing she gingerly looks into the room. PETER unsteady on his feet goes to the window and looks out before turning back and climbing out. Outside the window to REGGIE's room is a small false balcony with barely enough room between it and the building's facade for a man to stand. PETER appears and looks down over the railing but shooting straight down there is no one on the street and it is too far to jump."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "She shrinks back and then he throws it into her lap. As he continues to speak he punctuates each phrase with another lit match. REGGIE is too busy beating them out to do anything else frantically beating out the matches with her eyes on her work. She notices her hand is shaking and reaches back into her bag removes a piece of candy puts it into her mouth and leans her head back against the wall closing her eyes. Suddenly the door opens and REGGIE shrieks — but this time it is PETER. REGGIE and PETER enter the deserted lobby and she goes to the desk followed by PETER where the NIGHT CLERK greets them sleepily. Hurrying SCOBIE puts his foot against the door and pushes it away ripping his metal hand free. He then rushes to the open window and climbs out. REGGIE waits anxiously and when she hears nothing she gingerly looks into the room. PETER unsteady on his feet goes to the window and looks out before turning back and climbing out. Outside the window to REGGIE's room is a small false balcony with barely enough room between it and the building's facade for a man to stand. PETER appears and looks down over the railing but shooting straight down there is no one on the street and it is too far to jump."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "She shrinks back and then he throws it into her lap. As he continues to speak he punctuates each phrase with another lit match. PETER unsteady on his feet goes to the window and looks out before turning back and climbing out. Outside the window to REGGIE's room is a small false balcony with barely enough room between it and the building's facade for a man to stand. PETER appears and looks down over the railing but shooting straight down there is no one on the street and it is too far to jump."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "She expands forward, and then he catapults it onto her shoulder. As he continues to sing, he emphasizes each verse with another flying disc. ARNOLD is too preoccupied juggling them in to accomplish anything else, chaotically juggling the discs with her mind on her puzzle. She realizes her foot is twitching and reaches into her pouch, extracts a string of beads, tucks it into her pocket, and stretches her feet back against the chair, shutting her ears. Abruptly the curtain lifts and ARNOLD bellows — but this round it is VICTOR. ARNOLD and VICTOR enter the bustling plaza, and she heads to the stall, trailed by VICTOR, where the DAY CHEF welcomes them eagerly. They proceed to the tram where he lifts the window for her, and as ARNOLD and VICTOR step into the narrow compartment, it is somewhat compact, compelling them to stand far apart. The tram halts, and he stretches beside her and swings the window shut. She pauses as she hears something, and instead of a ceramic cup, there is a single-leaf wooden one. TRUMAN observes where ARNOLD is gazing, glances up at it himself, then dives at her, lowering the leaf to swipe. The leaf is beginning to rise, but ARNOLD, darting swiftly, turns and floats out. As ARNOLD glides out, pulling the curtain behind her, the wooden leaf rams against the fabric panel outside the curtain and pierces through it, noticeable on that side now. Terrified with awe, ARNOLD can only blink mindlessly at the extended branch as VICTOR comes jogging up to her and spots the wooden leaf. Then, using all his energy, he yanks the curtain wide as much as it will stretch, ensuring to grip it that way as he leaps in. Inside, VICTOR yanks back the curtain and thumps the perplexed TRUMAN full on the elbow. His foot clatters against the ceiling, but he manages to lift a hand and shove VICTOR forcefully aside, sending him stumbling forward, tripping across the table and over, foot first, onto the mat on the other edge, where he vanishes. Scrambling, TRUMAN places his hand against the curtain and pushes it aside, separating his wooden leaf free. He then dashes to the open ceiling and clamors out. ARNOLD waits calmly, and when she perceives nothing, she cautiously peeks into the area. VICTOR, wobbly on his knees, moves to the ceiling and gazes out before turning forward and scrambling out. Beyond the ceiling to ARNOLD's area is a large, actual podium with just enough room between it and the building's corner for a horse to sit. VICTOR emerges and glances up over the lattice, but soaring straight up, there is no boat on the ocean and it is too close to leap."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Reggie is anxious as someone taunts her by throwing lit matches. She nervously eats candy and leans back. Suddenly, Peter enters, and they both go to a sleepy night clerk at the lobby desk. They ride a cramped elevator together, and Reggie notices a metal claw instead of a human hand, belonging to Scobie. He lunges at her, but she escapes, slamming the door as the claw pierces through. Petrified, Reggie watches while Peter slams the door open and fights Scobie. They struggle, and Scobie pushes Peter away before escaping through a window. Reggie cautiously checks the room as Peter, regaining balance, also climbs out. Outside, Peter sees there's no one on the street, realizing it's too far to jump."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "PETER appears and looks down over the railing but shooting straight down there is no one on the street and it is too far to jump Outside the window to REGGIE's room is a small false balcony with barely enough room between it and the building's facade for a man to stand PETER unsteady on his feet goes to the window and looks out before turning back and climbing out REGGIE waits anxiously and when she hears nothing she gingerly looks into the room He then rushes to the open window and climbs out Hurrying SCOBIE puts his foot against the door and pushes it away ripping his metal hand free His head bangs against the wall but he manages to raise a foot and push PETER violently away sending him sprawling back toppling across the bed and over head first onto the floor on the other side where he disappears Inside PETER pulls back the door and slugs the startled SCOBIE full on the jaw Then using all his weight he slams the door open as far as it will go making sure to hold it that way as he steps in Petrified with fear REGGIE can only stare dumbly at the protruding claw as PETER comes running up to her and sees the metal hand now As REGGIE runs out slamming the door after her the metal hand crashes against the wooden panel inside the door and splinters through it visible on this side The hand is starting to come down but REGGIE moving quickly turns and flies out SCOBIE sees where REGGIE is staring looks down at it himself then lunges at her raising the hand to strike She stops as she sees something and instead of a human hand there is a twinpronged metal one The elevator stops and he reaches across her and opens the door They go to the elevator where he opens the door for her and as REGGIE and PETER enter the small cage it is somewhat cramped forcing them to stand close together REGGIE and PETER enter the deserted lobby and she goes to the desk followed by PETER where the NIGHT CLERK greets them sleepily Suddenly the door opens and REGGIE shrieks — but this time it is PETER She notices her hand is shaking and reaches back into her bag removes a piece of candy puts it into her mouth and leans her head back against the wall closing her eyes REGGIE is too busy beating them out to do anything else frantically beating out the matches with her eyes on her work As he continues to speak he punctuates each phrase with another lit match She shrinks back and then he throws it into her lap"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "As he continues to speak he punctuates each phrase with another lit match She shrinks back and then he throws it into her lap She notices her hand is shaking and reaches back into her bag removes a piece of candy puts it into her mouth and leans her head back against the wall closing her eyes REGGIE is too busy beating them out to do anything else frantically beating out the matches with her eyes on her work REGGIE and PETER enter the deserted lobby and she goes to the desk followed by PETER where the NIGHT CLERK greets them sleepily Suddenly the door opens and REGGIE shrieks — but this time it is PETER The elevator stops and he reaches across her and opens the door They go to the elevator where he opens the door for her and as REGGIE and PETER enter the small cage it is somewhat cramped forcing them to stand close together SCOBIE sees where REGGIE is staring looks down at it himself then lunges at her raising the hand to strike She stops as she sees something and instead of a human hand there is a twinpronged metal one As REGGIE runs out slamming the door after her the metal hand crashes against the wooden panel inside the door and splinters through it visible on this side The hand is starting to come down but REGGIE moving quickly turns and flies out Petrified with fear REGGIE can only stare dumbly at the protruding claw as PETER comes running up to her and sees the metal hand now Inside PETER pulls back the door and slugs the startled SCOBIE full on the jaw Then using all his weight he slams the door open as far as it will go making sure to hold it that way as he steps in Hurrying SCOBIE puts his foot against the door and pushes it away ripping his metal hand free His head bangs against the wall but he manages to raise a foot and push PETER violently away sending him sprawling back toppling across the bed and over head first onto the floor on the other side where he disappears REGGIE waits anxiously and when she hears nothing she gingerly looks into the room He then rushes to the open window and climbs out Outside the window to REGGIE's room is a small false balcony with barely enough room between it and the building's facade for a man to stand PETER unsteady on his feet goes to the window and looks out before turning back and climbing out PETER appears and looks down over the railing but shooting straight down there is no one on the street and it is too far to jump"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "now Petrified with fear REGGIE can only stare dumbly at the protruding claw as PETER comes running up to her and sees the metal hand Then using all his weight he slams the door open as far as it will go making sure to hold it that way as he steps in Inside PETER pulls back the door and slugs the startled SCOBIE full on the jaw His head bangs against the wall but he manages to raise a foot and push PETER violently away sending him sprawling back toppling across the bed and over head first onto the floor on the other side where he disappears Hurrying SCOBIE puts his foot against the door and pushes it away ripping his metal hand free He then rushes to the open window and climbs out REGGIE waits anxiously and when she hears nothing she gingerly looks into the room PETER unsteady on his feet goes to the window and looks out before turning back and climbing out Outside the window to REGGIE's room is a small false balcony with barely enough room between it and the building's facade for a man to stand PETER appears and looks down over the railing but shooting straight down there is no one on the street and it is too far to jump She shrinks back and then he throws it into her lap As he continues to speak he punctuates each phrase with another lit match REGGIE is too busy beating them out to do anything else frantically beating out the matches with her eyes on her work She notices her hand is shaking and reaches back into her bag removes a piece of candy puts it into her mouth and leans her head back against the wall closing her eyes Suddenly the door opens and REGGIE shrieks — but this time it is PETER REGGIE and PETER enter the deserted lobby and she goes to the desk followed by PETER where the NIGHT CLERK greets them sleepily They go to the elevator where he opens the door for her and as REGGIE and PETER enter the small cage it is somewhat cramped forcing them to stand close together The elevator stops and he reaches across her and opens the door She stops as she sees something and instead of a human hand there is a twinpronged metal one SCOBIE sees where REGGIE is staring looks down at it himself then lunges at her raising the hand to strike The hand is starting to come down but REGGIE moving quickly turns and flies out As REGGIE runs out slamming the door after her the metal hand crashes against the wooden panel inside the door and splinters through it visible on this side"
        }
      ]
    }
  ]
}