{
  "ground_truth": "After a second, he enters. Mr. Cunningham finds Cole sitting in a poor villager costume as a female teacher kneels next to him and makes final adjustments. Cole and the woman glance at Mr. Cunningham, who looks around the room and then directly at Cole. The female teacher looks to Cole and nods. The group of villagers on the stage laugh and mock. Tommy Tammisimo is dressed in a mismatched costume and hops around, clearly embarrassed. He smiles a true friend's smile. Cole hesitates, and it takes him a moment before he steps forward. Cole steps up to the stone, places his hand around the handle, and begins to pull. The sword starts to come out, and Cole raises the shiny sword out of the stone and high above his head. Merlin and everyone on stage bow. Malcolm watches his client standing unafraid in the spotlight for the first time. The villagers rise and rush to Cole, scooping him up and carrying him around the stage in celebration. Cole chuckles and then starts laughing as the group of eight-year-olds try unsuccessfully to keep him up. They slowly sag and collapse, with all the students laughing as they try to untangle themselves. Malcolm watches with utter joy as Cole becomes indistinguishable among a group of twenty children giggling and enjoying themselves on stage. The rain comes down a little stronger now on the stained glass window. Malcolm sits on the stairs in the lobby, and Cole walks back and forth in front of him, still holding the sword from the play. Cole glances at Malcolm, who exhales very slowly as he gets up. Cole watches as Malcolm walks down the stairs to the entrance. Lynn glances over to Cole, who sits in his seat silently. The way he says the words gives Lynn a chill. Cole takes a long time. Lynn gazes out the windshield at the line of red tail lights, looks over slowly, and eyes Cole. Lynn becomes upset and nods with grave understanding. Cole watches her, and Lynn's eyes move to Cole. Cole gazes at her intense expression and smiles a tiny smile. Lynn glances down and drowns in her thoughts. Lynn looks up sharply and becomes still, her face unreadable. Lynn's eyes lock on Cole's, and she brings her hands to her mouth, beginning to cry. Lynn covers her face with her hands, and the tears roll out through her fingers. Lynn looks at her son, barely getting the words out, and Cole moves closer to Lynn. She cradles him in her arms, and mother and son hold each other tight. Malcolm walks quietly down the sidewalk towards his home, enters the living room, and smiles at what he sees.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "After a moment, he enters. Mr. Cunningham discovers Cole seated in a poor peasant outfit as a female educator kneels beside him and makes final modifications. Cole and the woman glance at Mr. Cunningham, who looks around the chamber and then directly at Cole. The female educator looks to Cole and nods. The group of peasants on the platform laugh and ridicule. Tommy Tammisimo is attired in a mismatched outfit and hops around, clearly humiliated. He grins a genuine companion's grin. Cole hesitates, and it takes him an instant before he steps forward. Cole steps up to the rock, places his hand around the grip, and begins to pull. The blade starts to come out, and Cole raises the gleaming blade out of the rock and high above his head. Merlin and everyone on platform bow. Malcolm observes his client standing unafraid in the limelight for the first time. The peasants rise and rush to Cole, scooping him up and carrying him around the platform in jubilation. Cole chuckles and then starts giggling as the group of eight-year-olds attempt ineffectively to keep him aloft. They gradually sag and tumble, with all the students giggling as they try to disentangle themselves. Malcolm observes with utter happiness as Cole becomes indistinguishable among a group of twenty youngsters chuckling and enjoying themselves on platform. The rain descends a little stronger now on the stained glass panel. Malcolm sits on the steps in the foyer, and Cole walks back and forth in front of him, still holding the blade from the production. Cole glances at Malcolm, who exhales very slowly as he rises. Cole observes as Malcolm walks down the steps to the entry. Lynn glances over to Cole, who sits in his seat silently. The way he says the words gives Lynn a shiver. Cole takes a long while. Lynn gazes out the windshield at the line of red tail lights, looks over slowly, and eyes Cole. Lynn becomes upset and nods with grave comprehension. Cole observes her, and Lynn's eyes move to Cole. Cole gazes at her intense expression and grins a tiny grin. Lynn glances down and drowns in her thoughts. Lynn looks up sharply and becomes still, her face unreadable. Lynn's eyes lock on Cole's, and she brings her hands to her mouth, beginning to weep. Lynn covers her face with her hands, and the tears roll out through her fingers. Lynn looks at her son, barely getting the words out, and Cole moves closer to Lynn. She cradles him in her arms, and mother and son hold each other tight. Malcolm walks quietly down the pavement towards his dwelling, enters the lounge, and grins at what he sees."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "After a second, he is entered. Cole is found by Mr. Cunningham sitting in a poor villager costume as a female teacher kneels next to him and makes final adjustments. Mr. Cunningham is glanced at by Cole and the woman, who looks around the room and then directly at Cole. Cole is glanced at by the female teacher, and she nods. Laughter and mockery are made by the group of villagers on the stage. Tommy Tammisimo, dressed in a mismatched costume, hops around, clearly embarrassed. A true friend's smile is smiled by him. Hesitation is shown by Cole, and it takes him a moment before a step forward is made by him. The stone is stepped up to by Cole, his hand is placed around the handle, and a pull is begun. The shiny sword is started to come out by Cole, and he raises it out of the stone and high above his head. Merlin and everyone on stage bow to him. Malcolm watches his client, who stands unafraid in the spotlight for the first time. Cole is rushed to by the villagers, who scoop him up and carry him around the stage in celebration. Chuckling is done by Cole, and laughter is started by him as the group of eight-year-olds tries unsuccessfully to keep him up. They slowly sag and collapse, with all the students laughing as themselves are untangled. Utter joy is felt by Malcolm as a group of twenty children giggle and enjoy themselves on stage, becoming indistinguishable among them. The stained glass window is rained on a little stronger now. The stairs in the lobby are sat on by Malcolm, and back and forth walks Cole in front of him, still holding the sword from the play. Malcolm is glanced at by Cole, who exhales very slowly as he gets up. Malcolm is watched by Cole as the stairs are walked down by him to the entrance. Cole is glanced over to by Lynn, who silently sits in his seat. Chills are given to Lynn by the way the words are said by him. Cole takes a long time. The windshield at the line of red tail lights is gazed out at by Lynn, and over slowly he looks, eyes Cole. Upset is become by Lynn, and a nod with grave understanding is given. Watching her is done by Cole, and his eyes are moved to by Lynn. An intense expression is gazed at by Cole, and he smiles a tiny smile. Lynn glances down and drowns in her thoughts. Lynn looks up sharply and becomes still, her face unreadable. Lynn's eyes are locked on by Cole's, and her hands are brought to her mouth, beginning to cry. Her face is covered with her hands, and the tears roll out through her fingers. Her son is looked at by Lynn, barely getting the words out, and closer is moved by Cole to Lynn. Cradling is done by her as mother and son hold each other tight. Malcolm, walking quietly down the sidewalk towards his home, enters the living room and smiles at what is seen by him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "After a moment, Mr. Cunningham enters and finds Cole in a villager costume with a female teacher adjusting it. They both glance at Mr. Cunningham, who looks at Cole. The teacher nods to Cole as villagers on stage laugh. Tommy Tammisimo, in a mismatched costume, hops around, smiling supportively. Cole hesitates, then steps forward and pulls the sword from the stone, raising it high. Merlin and the stage bow while Malcolm watches Cole standing confidently. Villagers rise, carry Cole around the stage, and everyone laughs as they collapse in a joyful tangle. Malcolm observes Cole blending with twenty giggling children. Rain intensifies on stained glass as Malcolm, in the lobby, watches Cole with the sword. Cole glances at Malcolm, who slowly stands and exits. Lynn, in her car, watches Cole and nods with understanding as he smiles faintly. She gazes at him, overwhelmed with emotion, covers her face, and cries. Cole approaches, and they embrace tightly. Malcolm returns home, enters the living room, and smiles at the sight."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Mr. Cunningham enters, finding Cole in a villager costume with a female teacher making adjustments. They both glance at him as villagers mock on stage. Tommy Tammisimo, embarrassed in a mismatched costume, hops around. Cole hesitates, then steps forward, pulling the sword from the stone. Merlin and others bow. Malcolm watches Cole stand unafraid, as villagers celebrate, lifting him. The group collapses, laughing as they untangle. Malcolm joyfully observes Cole amidst giggling children. Outside, rain falls on stained glass. Malcolm sits in the lobby as Cole, still holding the sword, walks. Cole glances at Malcolm, who slowly exhales and leaves. Lynn, in a car, feels a chill from Cole’s words. She becomes upset, nodding gravely. Cole watches, smiling faintly. Lynn drowns in thoughts, then becomes still and unreadable, eventually breaking into tears. She cradles Cole, and they hold each other tightly. Malcolm quietly walks home, smiling at what he finds in the living room."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "After a brief moment, he steps inside. Mr. Cunningham observes Cole, who is dressed in a simple, rustic villager's costume, while a dedicated female teacher kneels beside him, meticulously making final adjustments to his attire. Both Cole and the woman glance up at Mr. Cunningham as he surveys the room, eventually resting his gaze directly on Cole. The female teacher turns her attention back to Cole and gives him an encouraging nod. Meanwhile, the group of villagers assembled on the stage laugh heartily and mock playfully. Tommy Tammisimo, sporting a mismatched costume, hops around awkwardly, clearly feeling embarrassed but managing to smile the genuine smile of a true friend. Cole hesitates momentarily, gathering his courage, and after a brief pause, he steps forward with determination. Approaching the stone, Cole confidently places his hand around the handle and begins to pull. The sword starts to emerge from the stone, and Cole triumphantly lifts the shiny blade high above his head. Merlin and everyone else present on stage bow in respect. Malcolm watches his client, who is standing fearlessly in the spotlight for the very first time. The villagers spring to their feet and rush towards Cole, joyously lifting him up and carrying him around the stage in a spirited celebration. Cole chuckles happily before bursting into laughter as the group of energetic eight-year-olds struggle to keep him aloft. Gradually, they sag and collapse in a heap, all while laughing as they attempt to untangle themselves. Malcolm observes with absolute joy as Cole becomes just another part of the lively group of twenty children, giggling and relishing their moment together on stage. Outside, the rain begins to fall a bit more heavily against the stained glass window. Malcolm sits contemplatively on the stairs in the lobby, while Cole paces back and forth in front of him, still grasping the sword from the play. Glancing at Malcolm, Cole watches as he exhales a slow, deliberate breath and then rises to his feet. Cole continues to observe as Malcolm makes his way down the stairs and towards the entrance. Lynn turns her gaze towards Cole, who sits in his seat silently, the way he articulates the words sending a chill through her. Cole takes his time, and Lynn's eyes drift to the line of red taillights visible through the windshield before returning to Cole. With growing upset, Lynn nods with a deep, grave understanding. She watches Cole closely, and as her intense expression meets his eyes, a small smile tugs at Cole's lips. Lynn glances downward, lost in her thoughts. Suddenly, she looks up sharply, her face becoming unreadable as her eyes connect with Cole's. Bringing her hands to her mouth, she starts to cry, tears spilling through her fingers as she covers her face. She struggles to find the words to express herself to her son, and Cole moves closer, wrapping his arms around her. Together, mother and son embrace tightly, seeking comfort in each other's presence. Meanwhile, Malcolm walks quietly along the sidewalk towards his home, enters the cozy living room, and smiles warmly at the heartwarming scene before him."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "After a brief but notable moment, he takes a step inside the room. Mr. Cunningham's attention is immediately drawn to Cole, who is dressed in a simple yet charming rustic villager's costume. A dedicated female teacher is kneeling beside him, meticulously making the final adjustments to ensure his attire is just right. Both Cole and the woman glance up simultaneously at Mr. Cunningham as he surveys the room with a keen eye, eventually resting his gaze directly on Cole. The female teacher, with a gentle and encouraging demeanor, turns her attention back to Cole, offering him a supportive nod of reassurance. Meanwhile, the group of villagers assembled on the stage is engaged in hearty laughter and playful mocking. Tommy Tammisimo, wearing a mismatched costume, hops around with a certain awkwardness, clearly feeling a sense of embarrassment but managing to maintain the genuine smile of a loyal friend. \n\nCole hesitates momentarily, gathering his courage from inside himself, and after a brief pause, he steps forward with a newfound determination. As he approaches the stone, Cole confidently wraps his hand around the handle and begins to pull with great strength. The sword starts to emerge from the stone, and Cole triumphantly lifts the gleaming, shiny blade high above his head. Merlin and everyone else who is present on the stage bow in deep respect. Malcolm watches intently as his client, for the very first time, stands fearlessly in the spotlight. The villagers, filled with joy, spring eagerly to their feet and rush towards Cole, zealously lifting him up and carrying him jubilantly around the stage in a spirited celebration. Cole chuckles with happiness before bursting into laughter as the enthusiastic group of energetic eight-year-olds struggle to keep him aloft. Gradually, the children begin to sag under the weight and collapse in a joyous heap, all the while laughing heartily as they attempt to untangle themselves. Malcolm observes this with absolute joy, seeing Cole becoming just another part of the lively group of twenty children, giggling and relishing their shared moment together on stage. \n\nOutside, the rain begins to fall a bit more heavily, gently tapping against the stained glass window. Malcolm sits contemplatively on the stairs in the lobby, while Cole paces back and forth in front of him, still firmly grasping the sword from the play. Glancing at Malcolm, Cole watches as he exhales a slow, deliberate breath and then rises to his feet with purpose. Cole continues to observe as Malcolm makes his way down the stairs and towards the entrance. Lynn turns her gaze towards Cole, who sits quietly in his seat, the way he articulates the words sending a chill through her. Cole takes his time, allowing the weight of his words to sink in, and Lynn's eyes drift to the line of red taillights visible through the windshield before returning to Cole. With growing upset, Lynn nods, her face reflecting a deep, grave understanding. She watches Cole intently, and as her intense expression meets his eyes, a small, reluctant smile tugs at Cole's lips. Lynn's eyes dart downward, lost in a swirl of thoughts. Suddenly, she looks up sharply, her face becoming unreadable as her eyes lock with Cole's. Bringing her hands to her mouth, she starts to cry, tears spilling through her fingers as she covers her face in emotional turmoil. She struggles to find the right words to express herself to her son, and Cole, moved by the moment, moves closer, wrapping his arms around her in a comforting embrace. Together, mother and son hold each other tightly, seeking solace and comfort in each other's presence. Meanwhile, Malcolm walks quietly along the sidewalk towards his home, enters the cozy and inviting living room, and smiles warmly at the heartwarming scene that unfolds before him."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "After a brief pause, he steps across the threshold and enters the room. Mr. Cunningham, upon entering, observes Cole seated while dressed in a costume typical of a poor villager. A female teacher is kneeling beside him, making the final adjustments to his attire. Both Cole and the teacher briefly glance up to acknowledge Mr. Cunningham's entrance. Mr. Cunningham's eyes wander around the room before they settle intently on Cole. The teacher communicates silently with Cole, giving him an encouraging nod. Meanwhile, on stage, a group of villagers, part of the play, erupts into laughter and mockery. Among them is Tommy Tammisimo, who is clad in a mismatched costume and bounces around the stage, his embarrassment palpable despite his genuine, friendly smile. Cole pauses, a moment of hesitation evident, before he finally gathers the courage to step forward. Moving towards the stone, he reaches out, curling his fingers around the handle and begins to exert effort. Slowly, the sword begins to emerge, and with a triumphant lift, Cole raises the gleaming sword high above his head. In response, Merlin and the rest of those on stage bow in homage. Malcolm, witnessing from the sidelines, takes note of Cole, unflinching and braving the spotlight for the first time, a significant moment. As the villagers rise, they surge forward to Cole, lifting him in jubilation and parading him around the stage. Cole cannot help himself and begins to chuckle, the sound evolving into laughter as the group of eight-year-old children struggles to maintain their hold, ultimately succumbing as they slowly sink and collapse into a heap, each student lost in shared hilarity as they work to disentangle themselves. Malcolm watches, his heart full of joy, as Cole blends seamlessly into the throng of twenty children, all reveling in their stage moment. Outside, the rain intensifies, droplets streaking the stained glass window. Malcolm descends to the stairs in the lobby, where he takes a seat as Cole paces in front of him, the sword from the play still firmly in his grasp. Cole meets Malcolm's gaze, and Malcolm releases a deliberate and deep exhalation as he rises to his feet. Cole's attention stays on Malcolm, who makes his way down the stairs toward the entrance. Lynn, meanwhile, looks to Cole, who sits in silence, his expression unreadable as his words send an involuntary shiver through her. Cole takes his time, each moment drawn out, while Lynn stares through the windshield at the line of red tail lights. Her attention shifts back to Cole, her movements slow, her eyes scanning him closely. Sharing a mutual understanding, Lynn becomes upset and nods, recognition settling heavily upon her. Cole observes her intently, and as Lynn's eyes return to Cole, he notices the intensity of her expression and offers a faint smile in response. Lynn lowers her gaze, momentarily lost in her own contemplation, before she looks up suddenly, her demeanor composed and unreadable. Her eyes lock onto Cole’s, and an emotional wave overtakes her as she covers her face with her hands, tears escaping through her fingers. She manages to look at her son, struggling with her words, and Cole instinctively moves closer to Lynn. She envelops him in her arms, and they embrace, mother and son clinging tightly to each other. Meanwhile, Malcolm walks with hushed steps along the sidewalk leading to his home, where, upon entering the living room, he is greeted by a sight that brings a smile to his face."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Mr. Cunningham enters and finds Cole in a poor villager costume, with a female teacher making final adjustments. As Mr. Cunningham looks around the room, the teacher nods to Cole. On stage, villagers laugh and mock as Tommy Tammisimo, in a mismatched costume, hops around embarrassed but smiling supportively. After a moment's hesitation, Cole steps up, grips the stone's handle, and triumphantly pulls the sword out, raising it high. As Merlin and others bow, Malcolm watches Cole stand confidently in the spotlight. Villagers lift Cole in celebration, but the eight-year-olds soon collapse, laughing and tangled together, with Cole indistinguishable among them.\n\nThe rain intensifies on the stained glass window as Malcolm sits in the lobby, watching Cole pace with the sword from the play. Cole glances at Malcolm, who exhales slowly before leaving. In a car, Lynn observes Cole silently sitting, and the way he speaks chills her. She gazes at the red tail lights, then back at Cole, her nod filled with grave understanding. As Lynn watches him, she becomes emotional, her eyes meeting Cole's before she begins to cry, covering her face. Cole moves closer, and they embrace tightly, mother and son comforting each other. Malcolm quietly walks home, enters his living room, and smiles at the scene that greets him."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "After a second, he enters. Mr. Cunningham, known in the community as the dedicated drama mentor, finds Cole sitting in a poor villager costume as a female teacher, Mrs. Harper, renowned for her patience and creativity in costume design for the school's annual play, kneels next to him and makes final adjustments. Cole and Mrs. Harper glance at Mr. Cunningham, who surveys the room with the keen eye of someone ensuring everything is in place before the curtain rises, and then directly at Cole. Mrs. Harper looks to Cole and nods, signaling that the performance is about to begin. The group of villagers on the stage, portraying the merry residents of a medieval town, laugh and mock in character. Tommy Tammisimo is dressed in a mismatched costume evocative of a jester, designed humorously by the students, and hops around, clearly embarrassed. He smiles a true friend's smile, encouraging Cole. \n\nCole hesitates, feeling the weight of the story they are reenacting, a tale of courage and honor, and it takes him a moment before he steps forward, embodying the young hero. Cole steps up to the stone, a cleverly crafted prop by the school's art club, places his hand around the handle, and begins to pull. The sword starts to come out, and Cole raises the shiny sword, a replica of the legendary Excalibur, out of the stone and high above his head. Merlin, played by a student in a long flowing robe, and everyone on stage bow as the dramatic climax unfolds. Malcolm, Cole's mentor and supporter through difficult times, watches his client standing unafraid in the spotlight for the first time, a testament to his journey of confidence-building. \n\nThe villagers rise and rush to Cole, scooping him up and carrying him around the stage in celebration, a tradition in the play symbolizing unity and triumph. Cole chuckles and then starts laughing as the group of eight-year-olds, his classmates, try unsuccessfully to keep him up. They slowly sag and collapse, with all the students laughing as they try to untangle themselves in a joyful display of camaraderie. Malcolm watches with utter joy as Cole becomes indistinguishable among a group of twenty children giggling and enjoying themselves on stage. The rain comes down a little stronger now on the stained glass window, the intricate patterns casting colorful reflections around the lobby. Malcolm sits on the stairs in the school lobby, reflecting on the success of the evening, and Cole walks back and forth in front of him, still holding the sword from the play, a symbol of his newfound confidence. Cole glances at Malcolm, who exhales very slowly as he gets up, a silent acknowledgment of the moment's significance. \n\nCole watches as Malcolm walks down the stairs to the entrance, knowing that this night will be a cherished memory. Lynn, Cole’s supportive mother who has been through much alongside him, glances over to Cole, who sits in his seat silently, lost in thought. The way he says the words gives Lynn a chill, reminding her of the emotional journey they’ve been through. Cole takes a long time as he processes the evening's events. Lynn gazes out the windshield at the line of red tail lights in the traffic, a typical scene during the evening rush, looks over slowly, and eyes Cole. Lynn becomes upset and nods with grave understanding, reflecting their shared experiences. Cole watches her, and Lynn's eyes move to Cole, searching for reassurance. Cole gazes at her intense expression and smiles a tiny smile, conveying his appreciation and love. Lynn glances down and drowns in her thoughts, overwhelmed by the emotions of the day. Lynn looks up sharply and becomes still, her face unreadable, as she processes the moment. Lynn's eyes lock on Cole's, and she brings her hands to her mouth, beginning to cry, touched by pride and relief. Lynn covers her face with her hands, and the tears roll out through her fingers as she realizes the depth of Cole’s transformation. Lynn looks at her son, barely getting the words out, and Cole moves closer to Lynn, offering comfort. She cradles him in her arms, and mother and son hold each other tight, emotional and relieved. Malcolm walks quietly down the sidewalk towards his home, a modest house in the suburb known for its close-knit community, enters the living room, and smiles at the warmth and light that greets him, a stark contrast to the rainy night outside."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Cole glances at Malcolm who exhales very slowly as he gets up After a second he enters Malcolm walks quietly down the sidewalk towards his home enters the living room and smiles at what he sees Mr Cunningham finds Cole sitting in a poor villager costume as a female teacher kneels next to him and makes final adjustments Cole and the woman glance at Mr Cunningham who looks around the room and then directly at Cole The female teacher looks to Cole and nods The group of villagers on the stage laugh and mock Tommy Tammisimo is dressed in a mismatched costume and hops around clearly embarrassed He smiles a true friend's smile Cole hesitates and it takes him a moment before he steps forward Cole chuckles and then starts laughing as the group of eightyearolds try unsuccessfully to keep him up Cole steps up to the stone places his hand around the handle and begins to pull The sword starts to come out and Cole raises the shiny sword out of the stone and high above his head Merlin and everyone on stage bow The group of villagers on the stage laugh and mock Malcolm watches his client standing unafraid in the spotlight for the first time The way he says the words gives Lynn a chill The villagers rise and rush to Cole scooping him up and carrying him around the stage in celebration Cole hesitates and it takes him a moment before he steps forward Cole and the woman glance at Mr Cunningham who looks around the room and then directly at Cole Mr Cunningham finds Cole sitting in a poor villager costume as a female teacher kneels next to him and makes final adjustments Cole takes a long time Cole chuckles and then starts laughing as the group of eightyearolds try unsuccessfully to keep him up They slowly sag and collapse with all the students laughing as they try to untangle themselves Malcolm watches with utter joy as Cole becomes indistinguishable among a group of twenty children giggling and enjoying themselves on stage The rain comes down a little stronger now on the stained glass window Malcolm sits on the stairs in the lobby and Cole walks back and forth in front of him still holding the sword from the play Cole glances at Malcolm who exhales very slowly as he gets up After a second he enters Cole watches as Malcolm walks down the stairs to the entrance Lynn glances over to Cole who sits in his seat silently The way he says the words gives Lynn a chill The female teacher looks to Cole and nods Lynn glances down and drowns in her thoughts Cole takes a long time Lynn gazes out the windshield at the line of red tail lights looks over slowly and eyes Cole Lynn becomes upset and nods with grave understanding Cole watches her and Lynn's eyes move to Cole Cole gazes at her intense expression and smiles a tiny smile Lynn glances down and drowns in her thoughts Lynn looks up sharply and becomes still her face unreadable Lynn's eyes lock on Cole's and she brings her hands to her mouth beginning to cry Lynn looks at her son barely getting the words out and Cole moves closer to Lynn Lynn gazes out the windshield at the line of red tail lights looks over slowly and eyes Cole Malcolm sits on the stairs in the lobby and Cole walks back and forth in front of him still holding the sword from the play Lynn covers her face with her hands and the tears roll out through her fingers She cradles him in her arms and mother and son hold each other tight Lynn covers her face with her hands and the tears roll out through her fingers Lynn looks at her son barely getting the words out and Cole moves closer to Lynn She cradles him in her arms and mother and son hold each other tight Malcolm walks quietly down the sidewalk towards his home enters the living room and smiles at what he sees"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "After a second he enters. Mr Cunningham finds Cole sitting in a poor villager costume as a female teacher kneels next to him and makes final adjustments. Cole and the woman glance at Mr Cunningham who looks around the room and then directly at Cole. The female teacher looks to Cole and nods. The group of villagers on the stage laugh and mock. Tommy Tammisimo is dressed in a mismatched costume and hops around clearly embarrassed. He smiles a true friend's smile. Cole hesitates and it takes him a moment before he steps forward. Cole steps up to the stone places his hand around the handle and begins to pull. The sword starts to come out and Cole raises the shiny sword out of the stone and high above his head. Merlin and everyone on stage bow. Malcolm watches his client standing unafraid in the spotlight for the first time. The villagers rise and rush to Cole scooping him up and carrying him around the stage in celebration. Cole chuckles and then starts laughing as the group of eightyearolds try unsuccessfully to keep him up. They slowly sag and collapse with all the students laughing as they try to untangle themselves. Malcolm watches with utter joy as Cole becomes indistinguishable among a group of twenty children giggling and enjoying themselves on stage. The rain comes down a little stronger now on the stained glass window. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Malcolm sits on the stairs in the lobby and Cole walks back and forth in front of him still holding the sword from the play. Cole glances at Malcolm who exhales very slowly as he gets up. Cole watches as Malcolm walks down the stairs to the entrance. Lynn glances over to Cole who sits in his seat silently. The way he says the words gives Lynn a chill. Cole takes a long time. Lynn gazes out the windshield at the line of red tail lights looks over slowly and eyes Cole. Lynn becomes upset and nods with grave understanding. Cole watches her and Lynn's eyes move to Cole. Cole gazes at her intense expression and smiles a tiny smile. Lynn glances down and drowns in her thoughts. Lynn looks up sharply and becomes still her face unreadable. Lynn's eyes lock on Cole's and she brings her hands to her mouth beginning to cry. Lynn covers her face with her hands and the tears roll out through her fingers. Lynn looks at her son barely getting the words out and Cole moves closer to Lynn. She cradles him in her arms and mother and son hold each other tight. Malcolm walks quietly down the sidewalk towards his home enters the living room and smiles at what he sees."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "After a second he enters. Mr Cunningham finds Cole sitting in a poor villager costume as a female teacher kneels next to him and makes final adjustments. Cole and the woman glance at Mr Cunningham who looks around the room and then directly at Cole. The female teacher looks to Cole and nods. The group of villagers on the stage laugh and mock. Tommy Tammisimo is dressed in a mismatched costume and hops around clearly embarrassed. He smiles a true friend's smile. Cole hesitates and it takes him a moment before he steps forward. Cole steps up to the stone places his hand around the handle and begins to pull. The sword starts to come out and Cole raises the shiny sword out of the stone and high above his head. Merlin and everyone on stage bow. Malcolm watches his client standing unafraid in the spotlight for the first time. The villagers rise and rush to Cole scooping him up and carrying him around the stage in celebration. Cole chuckles and then starts laughing as the group of eightyearolds try unsuccessfully to keep him up. They slowly sag and collapse with all the students laughing as they try to untangle themselves. Malcolm watches with utter joy as Cole becomes indistinguishable among a group of twenty children giggling and enjoying themselves on stage. The rain comes down a little stronger now on the stained glass window. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. Malcolm sits on the stairs in the lobby and Cole walks back and forth in front of him still holding the sword from the play. Cole glances at Malcolm who exhales very slowly as he gets up. Cole watches as Malcolm walks down the stairs to the entrance. Lynn glances over to Cole who sits in his seat silently. The way he says the words gives Lynn a chill. Cole takes a long time. Lynn gazes out the windshield at the line of red tail lights looks over slowly and eyes Cole. Lynn becomes upset and nods with grave understanding. Cole watches her and Lynn's eyes move to Cole. Cole gazes at her intense expression and smiles a tiny smile. Lynn glances down and drowns in her thoughts. Lynn looks up sharply and becomes still her face unreadable. Lynn's eyes lock on Cole's and she brings her hands to her mouth beginning to cry. Lynn covers her face with her hands and the tears roll out through her fingers. Lynn looks at her son barely getting the words out and Cole moves closer to Lynn. She cradles him in her arms and mother and son hold each other tight. Malcolm walks quietly down the sidewalk towards his home enters the living room and smiles at what he sees."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "After a second he enters. Mr Cunningham finds Cole sitting in a poor villager costume as a female teacher kneels next to him and makes final adjustments. Cole and the woman glance at Mr Cunningham who looks around the room and then directly at Cole. The female teacher looks to Cole and nods. The group of villagers on the stage laugh and mock. Tommy Tammisimo is dressed in a mismatched costume and hops around clearly embarrassed. He smiles a true friend's smile. Cole hesitates and it takes him a moment before he steps forward. Cole steps up to the stone places his hand around the handle and begins to pull. Cole gazes at her intense expression and smiles a tiny smile. Lynn glances down and drowns in her thoughts. Lynn looks up sharply and becomes still her face unreadable. Lynn's eyes lock on Cole's and she brings her hands to her mouth beginning to cry. Lynn covers her face with her hands and the tears roll out through her fingers. Lynn looks at her son barely getting the words out and Cole moves closer to Lynn. She cradles him in her arms and mother and son hold each other tight. Malcolm walks quietly down the sidewalk towards his home enters the living room and smiles at what he sees."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "After a second he enters. Mr Cunningham finds Cole sitting in a poor villager costume as a female teacher kneels next to him and makes final adjustments. Cole and the woman glance at Mr Cunningham who looks around the room and then directly at Cole. The female teacher looks to Cole and nods. Lynn looks at her son barely getting the words out and Cole moves closer to Lynn. She cradles him in her arms and mother and son hold each other tight. Malcolm walks quietly down the sidewalk towards his home enters the living room and smiles at what he sees."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "After a second, the dog enters. The conductor finds the comedian sitting in a poor villager costume as a musician kneels next to him and makes final adjustments. The comedian and the musician glance at the conductor, who looks around the room and then directly at the comedian. The musician looks to the comedian and nods. The group of villagers on the stage laugh and mock. The postman is dressed in a mismatched costume and hops around, clearly embarrassed. The postman smiles a true friend's smile. The comedian hesitates, and it takes the comedian a moment before stepping forward. The comedian steps up to the stone, places a hand around the handle, and begins to pull. The sword starts to come out, and the comedian raises the shiny sword out of the stone and high above the comedian's head. The chef and everyone on stage bow. The librarian watches the detective standing unafraid in the spotlight for the first time. The villagers rise and rush to the comedian, scooping the comedian up and carrying the comedian around the stage in celebration. The comedian chuckles and then starts laughing as the group of eight-year-olds try unsuccessfully to keep the comedian up. They slowly sag and collapse, with all the students laughing as they try to untangle themselves. The librarian watches with utter joy as the comedian becomes indistinguishable among a group of twenty children giggling and enjoying themselves on stage. The rain comes down a little stronger now on the stained glass window. The librarian sits on the stairs in the lobby, and the comedian walks back and forth in front of the librarian, still holding the sword from the play. The comedian glances at the librarian, who exhales very slowly as the librarian gets up. The comedian watches as the librarian walks down the stairs to the entrance. The artist glances over to the comedian, who sits in the comedian's seat silently. The way the comedian says the words gives the artist a chill. The comedian takes a long time. The artist gazes out the windshield at the line of red tail lights, looks over slowly, and eyes the comedian. The artist becomes upset and nods with grave understanding. The comedian watches her, and the artist's eyes move to the comedian. The comedian gazes at her intense expression and smiles a tiny smile. The artist glances down and drowns in her thoughts. The artist looks up sharply and becomes still, her face unreadable. The artist's eyes lock on the comedian's, and she brings her hands to her mouth, beginning to cry. The artist covers her face with her hands, and the tears roll out through her fingers. The artist looks at the sailor, barely getting the words out, and the comedian moves closer to the artist. She cradles the comedian in her arms, and mother and sailor hold each other tight. The librarian walks quietly down the sidewalk towards the librarian's home, enters the living room, and smiles at what the librarian sees."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "After a second, he enters. Mr. Cunningham finds Cole sitting in an ornate wizard costume as a female artist kneels next to him and makes final adjustments. Cole and the woman glance at Mr. Cunningham, who looks around the arena and then directly at Cole. The female artist looks to Cole and nods. The group of magicians on the platform laugh and mock. Tommy Tammisimo is dressed in a mismatched outfit and hops around, clearly embarrassed. He smiles a true friend's smile. Cole hesitates, and it takes him a moment before he steps forward. Cole steps up to the marble, places his hand around the wheel, and begins to pull. The flag starts to come out, and Cole raises the shiny flag out of the marble and high above his head. Gandalf and everyone on platform bow. Malcolm watches his client standing unafraid in the limelight for the first time. The magicians rise and rush to Cole, scooping him up and carrying him around the platform in celebration. Cole chuckles and then starts laughing as the group of acrobats try unsuccessfully to keep him up. They slowly sag and collapse, with all the performers laughing as they try to untangle themselves. Malcolm watches with utter joy as Cole becomes indistinguishable among a group of twenty jugglers giggling and enjoying themselves on platform. The rain comes down a little stronger now on the stained wood window. Malcolm sits on the bench in the foyer, and Cole walks back and forth in front of him, still holding the flag from the act. Cole glances at Malcolm, who exhales very slowly as he gets up. Cole watches as Malcolm walks down the bench to the exit. Lynn glances over to Cole, who sits in his chair silently. The way he says the words gives Lynn a chill. Cole takes a long time. Lynn gazes out the window at the line of red tail lights, looks over slowly, and eyes Cole. Lynn becomes upset and nods with grave understanding. Cole watches her, and Lynn's eyes move to Cole. Cole gazes at her intense expression and smiles a tiny smile. Lynn glances down and drowns in her thoughts. Lynn looks up sharply and becomes still, her face unreadable. Lynn's eyes lock on Cole's, and she brings her hands to her mouth, beginning to cry. Lynn covers her face with her hands, and the tears roll out through her fingers. Lynn looks at her son, barely getting the words out, and Cole moves closer to Lynn. She cradles him in her arms, and mother and son hold each other tight. Malcolm walks quietly down the pathway towards his home, enters the den, and smiles at what he sees."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "After a second, he strolls in. Mr. Cunningham observes Cole reclining in a poor villager costume as a female teacher stands next to him and checks final details. Cole and the woman peer at Mr. Cunningham, who scans the room and then gazes directly at Cole. The female teacher turns to Cole and winks. The group of villagers on the stage cheer and mock. Tommy Tammisimo is dressed in a mismatched costume and dances around, clearly mortified. He frowns a true friend's frown. Cole pauses, and it takes him a moment before he retreats. Cole walks up to the stone, places his fingers around the handle, and starts to twist. The sword begins to wobble, and Cole swings the shiny sword out of the stone and low beside his waist. Merlin and everyone on stage clap. Malcolm observes his client standing confidently in the spotlight for the first time. The villagers stand and dash to Cole, hoisting him up and spinning him around the stage in celebration. Cole snickers and then bursts out laughing as the group of eight-year-olds stumble unsuccessfully to keep him aloft. They gradually droop and tumble, with all the students giggling as they try to separate themselves. Malcolm watches with deep satisfaction as Cole merges indistinguishably among a group of twenty children laughing and reveling on stage. The rain tinkles a little more insistently now on the stained glass window. Malcolm reclines on the stairs in the lobby, and Cole paces back and forth in front of him, still clutching the sword from the play. Cole peers at Malcolm, who inhales very gently as he sits down. Cole observes as Malcolm strides down the stairs to the entrance. Lynn glances over to Cole, who sits in his seat quietly. The way he writes the words gives Lynn a shiver. Cole delays for a while. Lynn stares out the windshield at the line of red tail lights, turns over gradually, and peers at Cole. Lynn becomes uneasy and shakes her head with grave understanding. Cole observes her, and Lynn's eyes shift to Cole. Cole gazes at her intense glare and grins a tiny grin. Lynn glances down and sinks into her thoughts. Lynn looks up abruptly and becomes stagnant, her face inscrutable. Lynn's eyes fix on Cole's, and she clasps her hands to her mouth, starting to laugh. Lynn hides her face with her hands, and the tears pour out through her fingers. Lynn looks at her son, barely forming the words, and Cole slides closer to Lynn. She surrounds him in her arms, and mother and son embrace tightly. Malcolm strolls quietly down the sidewalk towards his home, enters the living room, and beams at what he perceives."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "After a second, the penguin enters. Mr. Bumblebee finds the staircase sitting in a shiny pebble costume as a purple octopus kneels next to it and makes final adjustments. The staircase and the octopus glance at Mr. Bumblebee, who looks around the stadium and then directly at the staircase. The purple octopus looks to the staircase and nods. The herd of pebbles on the trampoline laugh and mock. Johnny Jamboree is dressed in a striped pajama suit and hops around, clearly embarrassed. It smiles a loyal tree's smile. The staircase hesitates, and it takes a moment before it steps forward. The staircase steps up to the toaster, places its hand around the noodle, and begins to pull. The carrot starts to come out, and the staircase raises the gleaming carrot out of the toaster and high above its head. Olaf and everyone on the trampoline bow. Mabel watches her kite standing unafraid in the neon light for the first time. The pebbles rise and rush to the staircase, scooping it up and carrying it around the trampoline in celebration. The staircase chuckles and then starts laughing as the colony of ten-year-olds try unsuccessfully to keep it up. They slowly sag and collapse, with all the kites laughing as they try to untangle themselves. Mabel watches with utter joy as the staircase becomes indistinguishable among a colony of thirty cats giggling and enjoying themselves on the trampoline. The sunshine comes down a little stronger now on the bronze doorknob. Mabel sits on the seesaw in the attic, and the staircase glides back and forth in front of her, still holding the carrot from the circus. The staircase glances at Mabel, who exhales very slowly as she gets up. The staircase watches as Mabel walks down the seesaw to the vortex. Percy glances over to the staircase, which sits in its bubble silently. The way it says the words gives Percy a chill. The staircase takes a long time. Percy gazes out the telescope at the line of blue party hats, looks over slowly, and eyes the staircase. Percy becomes upset and nods with grave understanding. The staircase watches her, and Percy's eyes move to the staircase. The staircase gazes at her intense expression and smiles a tiny smile. Percy glances down and drowns in her thoughts. Percy looks up sharply and becomes still, her face unreadable. Percy's eyes lock on the staircase's, and she brings her hands to her hat, beginning to cry. Percy covers her face with her hands, and the tears roll out through her fingers. Percy looks at her book, barely getting the words out, and the staircase moves closer to Percy. She cradles it in her arms, and teacher and book hold each other tight. Mabel walks quietly down the alley towards his tree, enters the greenhouse, and smiles at what she sees."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "After a second, the owl flutters. Mrs. Patterson notices Jake nestled in a shiny astronaut costume as a plumber squats next to him and performs final calibrations. Jake and the plumber peer at Mrs. Patterson, who scans the garden and then directly at Jake. The plumber turns to Jake and winks. The troupe of jesters in the meadow cheer and applaud. Lily Lampshade is clad in a vibrant ensemble and skips around, clearly delighted. She beams a genuine friend's grin. Jake wavers, and it takes him a moment before he jumps ahead. Jake climbs up to the pedestal, wraps his fingers around the lever, and begins to twist. The trident starts to slide out, and Jake lifts the gleaming trident out of the pedestal and high above his head. Gandalf and everyone on the meadow genuflect. Roger observes his associate standing firm in the spotlight for the first time. The jesters rise and sprint to Jake, lifting him up and parading him around the meadow in jubilation. Jake chuckles and then bursts out laughing as the group of penguins attempt fruitlessly to keep him aloft. They gradually droop and tumble, with all the jesters laughing as they try to disentangle themselves. Roger watches with pure delight as Jake becomes indistinguishable among a group of twenty performers giggling and reveling on the meadow. The snow drifts down a little thicker now on the stained glass window. Roger perches on the steps in the lobby, and Jake paces back and forth in front of him, still clutching the trident from the play. Jake peers at Roger, who inhales very slowly as he rises. Jake observes as Roger strolls down the steps to the gate. Stella peers over to Jake, who reclines in his seat silently. The way he hums the tune gives Stella a shiver. Jake takes a long breath. Stella stares out the windshield at the line of blue headlights, glances over slowly, and scrutinizes Jake. Stella becomes worried and nods with solemn comprehension. Jake observes her, and Stella's eyes drift to Jake. Jake studies her intense gaze and grins a slight grin. Stella looks down and floats in her reverie. Stella looks up abruptly and becomes motionless, her expression inscrutable. Stella's eyes fix on Jake's, and she clasps her hands to her cheeks, starting to weep. Stella hides her face with her hands, and the tears spill out through her fingers. Stella looks at her nephew, barely whispering the words, and Jake shifts closer to Stella. She envelops him in her arms, and aunt and nephew embrace each other snugly. Roger strolls quietly down the road towards his home, enters the den, and grins at what he witnesses."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "After a second, he emerges. Mr. Cunningham discovers Cole perched in a flashy magician outfit as a male mechanic crouches next to him and gives final instructions. Cole and the man peer at Mr. Cunningham, who scans the hallway and then directly at Cole. The male mechanic glances at Cole and winks. The crowd of jesters in the audience roar and taunt. Tommy Tammisimo is dressed in a coordinated ensemble and waddles around, clearly thrilled. He grins a mischievous grin. Cole falters, and it takes him a moment before he leaps backward. Cole jumps beneath the boulder, places his feet against the pedal, and starts to spin. The merry-go-round begins to move, and Cole twirls the gleaming baton out of the groove and triumphantly over his head. Gandalf and everyone in the audience cheer. Malcolm observes his client standing confident in the arena for the first time. The jesters rise and rush to Cole, lifting him up and swinging him around the arena in jubilation. Cole snickers and then bursts into laughter as the group of eight-year-olds attempt unsuccessfully to balance him. They gradually falter and tumble, with all the performers laughing as they attempt to disentangle themselves. Malcolm observes with sheer delight as Cole becomes indistinguishable among a group of twenty children chuckling and delighting in themselves in the arena. The hail pounds a little harder now on the mosaic window. Malcolm lounges on the bench in the corridor, and Cole paces to and fro in front of him, still clutching the baton from the performance. Cole peers at Malcolm, who inhales very slowly as he rises. Cole observes as Malcolm strolls down the hallway to the exit. Lynn glances over to Cole, who sits in his spot pensively. The way he articulates the sentences gives Lynn a shiver. Cole takes his time. Lynn stares out the rearview mirror at the line of blue headlights, looks over cautiously, and regards Cole. Lynn becomes agitated and shakes her head with deep comprehension. Cole watches her, and Lynn's gaze shifts to Cole. Cole studies her intense expression and smirks a subtle smirk. Lynn looks down and loses herself in her thoughts. Lynn looks up abruptly and becomes motionless, her face impassive. Lynn's eyes fix on Cole, and she brings her hands to her ears, beginning to laugh. Lynn covers her face with her hands, and the giggles escape through her fingers. Lynn looks at her son, hardly whispering the words, and Cole scoots closer to Lynn. She envelops him in her arms, and mother and son embrace warmly. Malcolm strolls quietly down the street towards his home, enters the parlor, and beams at what he witnesses."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "After a minute, the cat scuttles in. Captain Evergreen spots Max lounging in a royal jester outfit as a young mechanic crouches beside him and applies minute alterations. Max and the mechanic peer at Captain Evergreen, who surveys the closet and then firmly at Max. The young mechanic turns to Max and winks. The band of jesters adjacent to the platform snort and tease. Robbie Rumblesnore is clad in a mismatched disguise and skips about, obviously humiliated. He beams a real ally's grin. Max falters, and it requires an instant before he trots onward. Max strides to the boulder, places his paw around the lever, and starts to push. The hammer begins to slide up, and Max hoists the sparkling hammer from the boulder and high above his ears. Gandalf and everyone on the platform kneel. Jerry observes his patient standing bravely in the moonlight for the premiere occasion. The jesters stand and dash to Max, lifting him up and parading him around the platform in jubilation. Max giggles and then bursts into laughter as the team of twelve-year-olds struggle hopelessly to uphold him. They gradually slump and topple, with all the pupils chortling as they attempt to disentangle themselves. Jerry observes with absolute delight as Max becomes indistinguishable amongst a cluster of thirty kids chortling and savoring the moment on the platform. The wind gusts a bit fiercer now against the cracked wooden door. Jerry sits on the bench in the corridor, and Max strides back and forth in front of him, still clutching the hammer from the pageant. Max looks at Jerry, who breathes very gently as he stands. Max observes as Jerry descends the bench to the gateway. Karen peers over to Max, who rests in his position silently. The manner he utters the phrases sends Karen a shiver. Max takes an extended spell. Karen stares out the window at the trail of blue headlights, turns over languidly, and examines Max. Karen becomes distressed and nods with solemn acknowledgment. Max watches her, and Karen's eyes drift to Max. Max gazes at her passionate gaze and grins a faint grin. Karen glances downward and immerses in her reveries. Karen looks up abruptly and becomes motionless, her visage inscrutable. Karen's eyes fix on Max's, and she raises her limbs to her lips, commencing to cry. Karen shields her countenance with her arms, and the raindrops slide out through her appendages. Karen surveys her child, barely articulating the syllables, and Max inches closer to Karen. She embraces him in her limbs, and guardian and offspring clutch each other closely. Jerry ambles softly along the avenue towards his dwelling, enters the lounge, and beams at the vista he encounters."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Mr. Cunningham enters as Cole, dressed as a poor villager, receives assistance from a female teacher. The villagers on stage laugh, and Tommy Tammisimo, in a mismatched costume, hops around, embarrassed. Encouraged, Cole pulls a sword from a stone, raising it high as Merlin and others bow. Malcolm observes Cole confidently in the spotlight for the first time. The villagers cheerfully carry Cole around, although they eventually collapse, laughing. Malcolm watches joyfully as Cole blends in on stage. As the rain intensifies, Malcolm sits in the lobby, and Cole, still holding the sword, paces. Lynn watches Cole silently. They exchange silent, meaningful glances, leading Lynn to grow emotional. She cries, and as they embrace, Cole comforts her. Meanwhile, Malcolm returns home, smiling at the scene he witnesses."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Malcolm walks quietly down the sidewalk towards his home enters the living room and smiles at what he sees She cradles him in her arms and mother and son hold each other tight Lynn looks at her son barely getting the words out and Cole moves closer to Lynn Lynn covers her face with her hands and the tears roll out through her fingers Lynn's eyes lock on Cole's and she brings her hands to her mouth beginning to cry Lynn looks up sharply and becomes still her face unreadable Lynn glances down and drowns in her thoughts Cole gazes at her intense expression and smiles a tiny smile Cole watches her and Lynn's eyes move to Cole Lynn becomes upset and nods with grave understanding Lynn gazes out the windshield at the line of red tail lights looks over slowly and eyes Cole Cole takes a long time The way he says the words gives Lynn a chill Lynn glances over to Cole who sits in his seat silently Cole watches as Malcolm walks down the stairs to the entrance Cole glances at Malcolm who exhales very slowly as he gets up Malcolm sits on the stairs in the lobby and Cole walks back and forth in front of him still holding the sword from the play The rain comes down a little stronger now on the stained glass window Malcolm watches with utter joy as Cole becomes indistinguishable among a group of twenty children giggling and enjoying themselves on stage They slowly sag and collapse with all the students laughing as they try to untangle themselves Cole chuckles and then starts laughing as the group of eightyearolds try unsuccessfully to keep him up The villagers rise and rush to Cole scooping him up and carrying him around the stage in celebration Malcolm watches his client standing unafraid in the spotlight for the first time Merlin and everyone on stage bow The sword starts to come out and Cole raises the shiny sword out of the stone and high above his head Cole steps up to the stone places his hand around the handle and begins to pull Cole hesitates and it takes him a moment before he steps forward He smiles a true friend's smile Tommy Tammisimo is dressed in a mismatched costume and hops around clearly embarrassed The group of villagers on the stage laugh and mock The female teacher looks to Cole and nods Cole and the woman glance at Mr Cunningham who looks around the room and then directly at Cole Mr Cunningham finds Cole sitting in a poor villager costume as a female teacher kneels next to him and makes final adjustments After a second he enters"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Tommy Tammisimo is dressed in a mismatched costume and hops around clearly embarrassed Cole watches as Malcolm walks down the stairs to the entrance Lynn glances over to Cole who sits in his seat silently The villagers rise and rush to Cole scooping him up and carrying him around the stage in celebration Lynn becomes upset and nods with grave understanding Lynn looks up sharply and becomes still her face unreadable Malcolm watches with utter joy as Cole becomes indistinguishable among a group of twenty children giggling and enjoying themselves on stage Merlin and everyone on stage bow The rain comes down a little stronger now on the stained glass window Malcolm watches his client standing unafraid in the spotlight for the first time Cole gazes at her intense expression and smiles a tiny smile They slowly sag and collapse with all the students laughing as they try to untangle themselves Cole watches her and Lynn's eyes move to Cole The sword starts to come out and Cole raises the shiny sword out of the stone and high above his head Cole steps up to the stone places his hand around the handle and begins to pull Lynn's eyes lock on Cole's and she brings her hands to her mouth beginning to cry He smiles a true friend's smile Cole takes a long time After a second he enters She cradles him in her arms and mother and son hold each other tight Cole chuckles and then starts laughing as the group of eightyearolds try unsuccessfully to keep him up Cole glances at Malcolm who exhales very slowly as he gets up Cole and the woman glance at Mr Cunningham who looks around the room and then directly at Cole Lynn looks at her son barely getting the words out and Cole moves closer to Lynn Lynn glances down and drowns in her thoughts The way he says the words gives Lynn a chill The female teacher looks to Cole and nods Lynn gazes out the windshield at the line of red tail lights looks over slowly and eyes Cole The group of villagers on the stage laugh and mock Lynn covers her face with her hands and the tears roll out through her fingers Malcolm walks quietly down the sidewalk towards his home enters the living room and smiles at what he sees Malcolm sits on the stairs in the lobby and Cole walks back and forth in front of him still holding the sword from the play Mr Cunningham finds Cole sitting in a poor villager costume as a female teacher kneels next to him and makes final adjustments Cole hesitates and it takes him a moment before he steps forward"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Malcolm sits on the stairs in the lobby and Cole walks back and forth in front of him still holding the sword from the play Cole glances at Malcolm who exhales very slowly as he gets up Cole watches as Malcolm walks down the stairs to the entrance Lynn glances over to Cole who sits in his seat silently The way he says the words gives Lynn a chill Cole takes a long time Lynn gazes out the windshield at the line of red tail lights looks over slowly and eyes Cole Lynn becomes upset and nods with grave understanding Cole watches her and Lynn's eyes move to Cole Cole gazes at her intense expression and smiles a tiny smile Lynn glances down and drowns in her thoughts Lynn looks up sharply and becomes still her face unreadable Lynn's eyes lock on Cole's and she brings her hands to her mouth beginning to cry Lynn covers her face with her hands and the tears roll out through her fingers Lynn looks at her son barely getting the words out and Cole moves closer to Lynn She cradles him in her arms and mother and son hold each other tight Malcolm walks quietly down the sidewalk towards his home enters the living room and smiles at what he sees After a second he enters Mr Cunningham finds Cole sitting in a poor villager costume as a female teacher kneels next to him and makes final adjustments Cole and the woman glance at Mr Cunningham who looks around the room and then directly at Cole The female teacher looks to Cole and nods The group of villagers on the stage laugh and mock Tommy Tammisimo is dressed in a mismatched costume and hops around clearly embarrassed He smiles a true friend's smile Cole hesitates and it takes him a moment before he steps forward Cole steps up to the stone places his hand around the handle and begins to pull The sword starts to come out and Cole raises the shiny sword out of the stone and high above his head Merlin and everyone on stage bow Malcolm watches his client standing unafraid in the spotlight for the first time The villagers rise and rush to Cole scooping him up and carrying him around the stage in celebration Cole chuckles and then starts laughing as the group of eightyearolds try unsuccessfully to keep him up They slowly sag and collapse with all the students laughing as they try to untangle themselves Malcolm watches with utter joy as Cole becomes indistinguishable among a group of twenty children giggling and enjoying themselves on stage The rain comes down a little stronger now on the stained glass window"
        }
      ]
    }
  ]
}