{
  "ground_truth": "Malcolm stares up at the historic Philadelphia church quietly, with its old stone and huge towers making it stand out from the modern buildings all around it. He has to use all his strength to push open the highly ornate doors and slips inside. Only a few people sit and pray in the sea of oak pews. Malcolm scans the majestic room and finds what he's looking for in the last row of the church. He moves down the center aisle towards the back and finds Cole playing in his pew with a set of green and beige plastic soldiers. Cole makes the soldiers talk to each other but stays rigid, hands clutching a handful of plastic riflemen. Malcolm nods at the information, smiles at Cole, and his eyes drift down to Cole's arms, which are covered in tiny cuts and bruises. Cole and Malcolm just stare at each other. Lynn walks over to Cole, checks his tie, and unclips the tie. Cole takes a seat at the kitchen table as Lynn walks back into the laundry room. The dog is gone now, and Lynn reaches into the dryer, digging for a new tie. She finds one, then turns and steps back into the kitchen and screams at the top of her lungs, as every cabinet and every drawer is wide open. Cole sits at the kitchen table, his hands pressed flat on the tabletop, looking shaken. Neither says anything for a beat. Lynn looks over to the open cabinet near the sink, where the pop tarts are clearly visible. Lynn leans down, Cole does, and he looks at her eyes. Cole turns to see Lynn holding the pop tarts, takes them from her, and leaves. Lynn glances to the kitchen table, and her gaze stops on the two tiny handprints of sweat formed on the table's surface. Tommy Tammisimo, a tough-looking, eight-year-old Italian kid in his school uniform, waits at the bottom of Cole's brownstone stairs. Cole emerges from the brownstone, moves down the steps, and the two boys begin their walk down the street to school. Tommy puts his arm around Cole, and Cole waves back. When the two boys turn the corner and are out of Lynn's sight, Tommy rips his arm away. Cole starts to smile too and thinks. Cole and Lynn smile at each other, and Lynn takes Cole's school bag and jacket before moving to the kitchen. The den doubles as a playroom, with boxes of old toys sitting in the corner and a small, plastic, multi-colored table on the rug. Cole appears in the doorway, and Malcolm sits up and smiles.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Malcolm gazes up at the venerable Philadelphia chapel silently, with its ancient rock and immense spires causing it to be distinct from the contemporary edifices all around it. He has to employ all his power to shove apart the highly elaborate portals and slips inside. Only a few individuals sit and pray in the sea of oak benches. Malcolm surveys the splendid chamber and discovers what he's searching for in the final row of the chapel. He proceeds down the central aisle towards the rear and encounters Cole playing in his bench with an assortment of green and beige plastic warriors. Cole causes the warriors to converse with one another but remains rigid, hands gripping a handful of plastic riflemen. Malcolm nods at the data, smiles at Cole, and his eyes drift down to Cole's arms, which are covered in tiny cuts and bruises. Cole and Malcolm just gaze at each other. Lynn strides over to Cole, checks his tie, and unclips the tie. Cole takes a seat at the kitchen table as Lynn walks back into the laundry room. The dog is gone now, and Lynn reaches into the dryer, probing for a new tie. She discovers one, then turns and steps back into the kitchen and screams at the top of her lungs, as every cabinet and every drawer is wide open. Cole sits at the kitchen table, his hands pressed flat on the tabletop, looking shaken. Neither says anything for a beat. Lynn looks over to the open cabinet near the sink, where the pop tarts are clearly visible. Lynn leans down, Cole does, and he looks at her eyes. Cole turns to see Lynn holding the pop tarts, takes them from her, and leaves. Lynn glances to the kitchen table, and her gaze halts on the two tiny handprints of sweat formed on the table's surface. Tommy Tammisimo, a tough-looking, eight-year-old Italian child in his school uniform, waits at the bottom of Cole's brownstone stairs. Cole emerges from the brownstone, moves down the steps, and the two boys begin their walk down the street to school. Tommy puts his arm around Cole, and Cole waves back. When the two boys turn the corner and are out of Lynn's sight, Tommy rips his arm away. Cole starts to smile too and thinks. Cole and Lynn smile at each other, and Lynn takes Cole's school bag and jacket before moving to the kitchen. The den doubles as a playroom, with boxes of ancient playthings sitting in the corner and a small, plastic, multi-colored table on the rug. Cole appears in the doorway, and Malcolm sits up and smiles."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The historic Philadelphia church is stared up at quietly by Malcolm, with its old stone and huge towers making it stand out from the modern buildings all around it. All his strength is used by him to push open the highly ornate doors, and he slips inside. In the sea of oak pews, only a few people sit and pray. The majestic room is scanned by Malcolm, and what he is looking for is found by him in the last row of the church. The center aisle is moved down by him towards the back, and Cole is found playing in his pew with a set of green and beige plastic soldiers. The soldiers are made to talk to each other by Cole, but he stays rigid, hands clutching a handful of plastic riflemen. The information is nodded at by Malcolm, who smiles at Cole, and his eyes drift down to Cole's arms, which are covered in tiny cuts and bruises. Each other is just stared at by Cole and Malcolm. Cole is walked over to by Lynn, who checks his tie and unclips it. A seat at the kitchen table is taken by Cole as Lynn walks back into the laundry room. The dog is gone now, and into the dryer reaches Lynn, digging for a new tie. One is found by her, then she turns and steps back into the kitchen and screams at the top of her lungs, as every cabinet and every drawer is wide open. The kitchen table is sat at by Cole, his hands pressed flat on the tabletop, looking shaken. Anything is not said by either for a beat. The open cabinet near the sink, where the pop tarts are clearly visible, is looked over at by Lynn. Down leans Lynn, and he does, and her eyes are looked at by him. Lynn is turned to by Cole, who sees her holding the pop tarts, takes them from her, and leaves. To the kitchen table glances Lynn, and her gaze stops on the two tiny handprints of sweat formed on the table's surface. Tommy Tammisimo, a tough-looking, eight-year-old Italian kid in his school uniform, waits at the bottom of Cole's brownstone stairs. The brownstone is emerged from by Cole, who moves down the steps, and their walk down the street to school is begun by the two boys. His arm is put around Cole by Tommy, and Tommy is waved back at by Cole. The corner is turned by the two boys and when they are out of Lynn's sight, Tommy rips his arm away. A smile is started by Cole too, and he thinks. Each other is smiled at by Cole and Lynn, and Cole's school bag and jacket are taken by Lynn before she moves to the kitchen. The den doubles as a playroom, with boxes of old toys sitting in the corner and a small, plastic, multi-colored table on the rug. The doorway is appeared in by Cole, and Malcolm sits up and smiles."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Malcolm quietly observes the historic Philadelphia church with its distinct stone structure and tall towers contrasting the modern buildings. He exerts effort to open the ornate doors and enters. Inside, a few people pray in the oak pews. Malcolm spots what he's seeking in the last row—Cole playing with green and beige plastic soldiers. Despite their rigid demeanor, Cole continues his play. Malcolm nods, smiles, and notices Cole's arms covered in small cuts and bruises. They lock eyes. Lynn approaches, checks Cole's tie, unclips it, and heads to the laundry room. The dog is absent as Lynn retrieves another tie from the dryer. Returning to the kitchen, she screams upon finding all cabinets and drawers open. Cole sits at the table, visibly shaken, and Lynn notices open cabinets revealing pop tarts. Lynn retrieves the pop tarts, which Cole takes and leaves. She then notices tiny handprints of sweat on the table. Tommy Tammisimo, a tough-looking eight-year-old in school uniform, waits outside. Cole exits, and they walk to school, Tommy initially arm-in-arm with Cole before pulling away once out of sight. Cole and Lynn exchange smiles, and Lynn takes Cole's school bag. The den serves as a playroom with old toys and a colorful table. Malcolm sits up and smiles when Cole appears in the doorway."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Malcolm observes the historic Philadelphia church, its stone and towers standing out among modern buildings. He uses all his strength to push open the ornate doors and enters. Few people are praying in the oak pews. Malcolm sees Cole playing with plastic soldiers in the last row and smiles, noticing Cole's arms covered in cuts and bruises. Lynn adjusts Cole's tie, which he removes before sitting at the kitchen table. Lynn returns from the laundry room with a tie and screams when she sees every cabinet and drawer open, while Cole sits silently, hands on the table. She retrieves pop tarts from an open cabinet, hands them to Cole, who leaves. Lynn notices his handprints on the table. Tommy waits at the bottom of Cole's brownstone stairs. Cole joins him, and they walk to school. Once out of sight, Tommy pulls away his arm, and Cole starts to smile. Cole and Lynn smile at each other as she takes his school bag and jacket, heading to the kitchen. The den, doubling as a playroom, is filled with toys, and Malcolm smiles as Cole appears in the doorway."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Malcolm gazes intently upwards at the old historical church located in Philadelphia, contemplating its ancient stonework and the towering structures that render it a remarkable sight amidst the modern architecture surrounding it on all sides. He musters all his strength to push open the beautifully ornate doors, which offer some resistance, and quietly slips inside. A sparse number of people are seated in prayer, scattered across the vast sea of elegant oak pews. Malcolm scans the grand and majestic interior space, searching until he spots what he's seeking at the very back row of the church. He moves steadily down the central aisle toward the rear and observes Cole, who is seated in his pew, playing intently with a set of small, green, and beige plastic soldiers. Cole animates the soldiers with conversations, although he remains quite rigid, hands tightly clutching the little plastic riflemen. Malcolm acknowledges the scene before him by nodding at the information presented, then smiles warmly at Cole while his eyes drift downward, noticing Cole's arms, which are covered in tiny cuts and bruises. Both Cole and Malcolm exchange a silent stare with each other. Meanwhile, Lynn approaches Cole, checking to ensure his tie is in place, and then she unclasped it carefully. Cole takes his seat at the kitchen table as Lynn makes her way back into the adjoining laundry room. The dog, once present, is now gone, and Lynn reaches into the dryer, searching for a fresh tie. She finds one, turns around, and steps back into the kitchen, only to scream loudly in shock and astonishment, as every cabinet and drawer stands wide open. Cole remains seated at the kitchen table, his hands pressed firmly and flat against the tabletop, looking visibly shaken. Both remain silent for a moment. Lynn’s gaze shifts toward the open cabinet near the sink, where the pop tarts are distinctly visible. She leans down, making eye contact with Cole, who looks back into her eyes. As Lynn holds out the pop tarts, Cole takes them from her and quietly exits the room. Lynn then glances back at the kitchen table, her attention stopping on the two small, sweaty handprints imprinted on the surface. Down at the bottom of Cole's brownstone's stairs, Tommy Tammisimo, an eight-year-old, tough-looking Italian boy dressed in his school uniform, waits patiently. Cole emerges from the brownstone, descends the steps, and the two boys commence their walk down the street headed toward school. Tommy throws his arm around Cole in a friendly gesture, while Cole waves back. Once they turn the corner, moving out of Lynn's sight, Tommy quickly pulls his arm away. Cole begins to smile too, contemplating something on his mind. Cole and Lynn share a smile with each other, and Lynn takes charge of Cole’s school bag and jacket before heading off toward the kitchen. The den, which also serves as a playroom, is filled with boxes of old toys tucked into a corner and features a small, plastic, multi-colored table on the rug. Cole appears in the doorway, prompting Malcolm to sit up and smile warmly at his presence."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Malcolm finds himself absorbed in the sight above him as he gazes intently upward at the grand old historical church that stands prominently in Philadelphia. He contemplates the intricate and ancient stonework, as well as the towering structures that make it truly a remarkable sight amidst the modern architecture that surrounds it on all sides. Gathering all his strength and determination, he pushes open the beautifully ornate doors, which offer some resistance before yielding, and he quietly slips inside. Within the expansive interior, a sparse number of people are seated in prayer, scattered throughout the vast sea of elegant oak pews that fill the space. Malcolm scans the grand and majestic interior, searching thoroughly until his eyes settle on what he is seeking. It is at the very back row of the church that he spots his intended target. He moves steadily down the central aisle toward the rear, observing as he goes. There, he sees Cole, who is seated in his pew, deeply engrossed in playing with a set of small, green, and beige plastic soldiers. Cole animates the soldiers with whispered conversations, even as he remains quite rigid, his hands tightly clutching the little plastic riflemen with determination. Malcolm acknowledges the unfolding scene before him by nodding at the information it presents, then allows a warm smile to spread across his face as he looks at Cole. His eyes then shift downward, noticing the small array of tiny cuts and bruises that cover Cole's arms. The silent exchange of stares between Cole and Malcolm carries an unspoken understanding. Meanwhile, Lynn approaches Cole, keenly checking to ensure his tie is in place, and then carefully unclasping it. Cole takes his seat at the kitchen table as Lynn makes her way back into the adjoining laundry room. The dog, once a familiar presence, is now conspicuously absent. Lynn reaches into the dryer in search of a fresh tie, finding one which she then retrieves. Turning around, she steps back into the kitchen, only to be met with a startling sight. She screams loudly in shock and astonishment, as she sees every cabinet and drawer standing wide open. Cole remains seated at the kitchen table, his hands pressed firmly and flat against the tabletop, looking visibly shaken amidst the chaos. Both remain silent for a moment, as Lynn’s gaze shifts toward the open cabinet near the sink, where pop tarts are distinctly visible. She leans down to make eye contact with Cole, who looks back into her eyes with a reciprocal gaze. As Lynn holds out the pop tarts, Cole takes them from her and quietly exits the room, leaving Lynn to glance back at the kitchen table where her attention halts upon seeing the two small, sweaty handprints imprinted on the surface. Down at the bottom of the brownstone’s stairs where Cole resides, Tommy Tammisimo, an eight-year-old, tough-looking Italian boy dressed neatly in his school uniform, waits patiently. Cole emerges from the brownstone, makes his way down the steps, and the two boys begin their walk down the street, destined for school. Tommy throws his arm around Cole in a show of friendly camaraderie, while Cole waves back to acknowledge the gesture. As they turn the corner, moving out of Lynn's sight, Tommy quickly and discreetly pulls his arm away. Cole begins to smile too, contemplating something on his mind as they continue. Cole and Lynn exchange a smile with one another, and Lynn takes charge of Cole’s school bag and jacket before she heads off toward the kitchen. The den, which serves a dual purpose as a playroom, is filled with boxes of old toys tucked neatly into a corner. It features a small, plastic, multi-colored table resting on the rug. Cole makes his appearance in the doorway, prompting Malcolm to sit up and smile warmly at his presence."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Malcolm stands before the historic Philadelphia church, quietly gazing upwards at its imposing structure. The old stone façade and towering spires sharply contrast with the surrounding modern buildings, creating a striking image that captivates him. Gathering all his strength, Malcolm leans into the highly ornate doors, pushing them open with effort before slipping inside the church's welcoming interior. Within the expansive room, only a few individuals are scattered among the sea of oak pews, each engaged in silent prayer. His eyes sweep across the majestic space until they settle on what he's seeking in the last row. Moving deliberately down the center aisle, he approaches the back to find Cole engrossed in play, sitting in his pew with a set of green and beige plastic soldiers. The young boy is absorbed in making the soldiers converse, yet remains rigid, his small hands tightly clutching a handful of plastic riflemen. Observing this, Malcolm nods to himself, processes the information, and offers Cole a warm smile. His gaze drifts downward to note the tiny cuts and bruises that mark Cole's arms. A silent exchange unfolds as Cole and Malcolm stare at each other, their eyes locked in unspoken communication. Meanwhile, Lynn approaches Cole, briefly checking and unclipping his tie with practiced ease. Cole takes his place at the kitchen table, waiting as Lynn returns to the laundry room. The absence of the dog goes unnoticed as she reaches into the dryer, searching through the contents for a fresh tie. With one in hand, she confidently steps back into the kitchen, only to be met with a shocking sight that draws a scream from her lips—every cabinet and drawer is flung wide open. Cole, seated at the table with his hands pressed flatly upon its surface, appears shaken but remains silent. An unspoken pause hangs in the air before Lynn's attention shifts to an open cabinet near the sink, where pop tarts are visibly stored. As Lynn leans down, Cole mirrors the action, looking into her eyes. A moment later, Cole turns to see Lynn holding the pop tarts, which he accepts from her hands before leaving. Lynn's gaze lingers on the kitchen table, where it halts on the sight of two tiny handprints of sweat imprinted on the surface. Outside, Tommy Tammisimo, an imposing eight-year-old Italian boy dressed in his school uniform, waits patiently at the bottom of the brownstone stairs. As Cole emerges from the building, he descends the steps and joins Tommy, the two boys beginning their walk to school. Tommy throws an arm around Cole, prompting a reciprocal wave. Once they turn the corner and slip out of Lynn's view, Tommy swiftly withdraws his arm. Cole, undeterred, starts to smile as he processes his thoughts. The silent camaraderie between Cole and Lynn is evident as they exchange smiles, and Lynn dutifully collects Cole's school bag and jacket before proceeding to the kitchen. Within the den, which also serves as a playroom, boxes of old toys are tucked in the corner alongside a small, plastic, multi-colored table resting on the rug. Cole appears in the doorway, prompting Malcolm to sit up and smile in recognition."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Malcolm gazes at the historic Philadelphia church, its old stone and towering presence contrasting sharply with the surrounding modern buildings. He pushes open the ornate doors and enters, noticing a few people praying among the oak pews. As he scans the majestic room, he spots Cole in the last row, absorbed in a game with green and beige plastic soldiers. Malcolm acknowledges him with a smile, noting the tiny cuts and bruises on Cole's arms. They share a silent moment as Lynn approaches, adjusts Cole's tie, and leads him to the kitchen table before heading to the laundry room. Returning with a new tie, she is shocked to find every cabinet and drawer open, while Cole sits at the table visibly shaken. Lynn retrieves the pop-tarts from an open cabinet and hands them to Cole, who departs. She then notices the sweat-marked handprints on the table. Later, Tommy Tammisimo, a tough-looking eight-year-old, waits for Cole at the bottom of his brownstone stairs. The boys walk to school together, with Tommy briefly wrapping an arm around Cole before pulling away out of Lynn's sight. At home, Lynn and Cole exchange smiles as she takes his school bag and jacket and heads to the kitchen. Cole enters the den, doubling as a playroom, where Malcolm greets him with a smile."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Malcolm stares up at the historic Philadelphia church quietly, this architectural marvel with its old stone and huge towers, reminiscent of the Gothic Revival style, making it stand out from the modern steel and glass buildings all around it. He has to use all his strength to push open the highly ornate doors, crafted in the late 19th century by skilled artisans, and slips inside. Only a few people sit and pray in the sea of oak pews, some of which have been polished by generations of worshippers. Malcolm scans the majestic room, its stained-glass windows depicting biblical scenes, and finds what he's looking for in the last row of the church. He moves down the center aisle towards the back and finds Cole playing in his pew with a set of green and beige plastic soldiers, toys that were popularized during the mid-20th century as inexpensive children's playthings. Cole makes the soldiers talk to each other but stays rigid, hands clutching a handful of plastic riflemen that resemble figures from World War II. Malcolm nods at the information, smiles at Cole, and his eyes drift down to Cole's arms, which are covered in tiny cuts and bruises that suggest a recent encounter with bullies. Cole and Malcolm just stare at each other. Lynn walks over to Cole, checks his tie, part of his neatly pressed school uniform, and unclips the tie. Cole takes a seat at the kitchen table as Lynn walks back into the laundry room. The dog, which used to be a rambunctious presence, is gone now, and Lynn reaches into the dryer, digging for a new tie. She finds one, noticing it's patterned with stripes in school colors, then turns and steps back into the kitchen and screams at the top of her lungs, as every cabinet and every drawer is wide open, an eerie occurrence they have been experiencing lately. Cole sits at the kitchen table, his hands pressed flat on the tabletop, looking shaken. Neither says anything for a beat. Lynn looks over to the open cabinet near the sink, where the pop tarts, a quick breakfast favorite first introduced in the 1960s, are clearly visible. Lynn leans down, Cole does, and he looks at her eyes. Cole turns to see Lynn holding the pop tarts, takes them from her, and leaves. Lynn glances to the kitchen table, and her gaze stops on the two tiny handprints of sweat formed on the table's surface, evidence of Cole's distress. Tommy Tammisimo, a tough-looking, eight-year-old Italian kid known for being the class clown, in his neatly pressed school uniform, waits at the bottom of Cole's brownstone stairs. Brownstones, iconic to East Coast cities like Philadelphia, are known for their distinctive sandstone facade. Cole emerges from the brownstone, moves down the steps, and the two boys begin their walk down the street to school. Tommy puts his arm around Cole, a gesture mimicking camaraderie, and Cole waves back. When the two boys turn the corner and are out of Lynn's sight, Tommy rips his arm away, revealing a shift in his outward friendliness. Cole starts to smile too and thinks about the complexities of school friendships. Cole and Lynn smile at each other, and Lynn takes Cole's school bag and jacket before moving to the kitchen. The den doubles as a playroom, filled with memories as boxes of old toys sit in the corner, and a small, plastic, multi-colored table on the rug where Cole used to play much as a toddler. Cole appears in the doorway, and Malcolm, who has taken a keen interest in Cole's well-being, sits up and smiles."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Malcolm stares up at the historic Philadelphia church quietly with its old stone and huge towers making it stand out from the modern buildings all around it. He has to use all his strength to push open the highly ornate doors and slips inside. Only a few people sit and pray in the sea of oak pews. Malcolm scans the majestic room and finds what he is looking for in the last row of the church. He moves down the center aisle towards the back and finds Cole playing in his pew with a set of green and beige plastic soldiers. Cole makes the soldiers talk to each other but stays rigid hands clutching a handful of plastic riflemen. Malcolm nods at the information smiles at Cole and his eyes drift down to Cole's arms which are covered in tiny cuts and bruises. Cole and Malcolm just stare at each other. Lynn walks over to Cole checks his tie and unclips the tie. Cole takes a seat at the kitchen table as Lynn walks back into the laundry room. The dog is gone now and Lynn reaches into the dryer digging for a new tie. She finds one then turns and steps back into the kitchen and screams at the top of her lungs as every cabinet and every drawer is wide open. Cole sits at the kitchen table his hands pressed flat on the tabletop looking shaken. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Neither says anything for a beat. Lynn looks over to the open cabinet near the sink where the pop tarts are clearly visible. Lynn leans down. Cole does and he looks at her eyes. Cole turns to see Lynn holding the pop tarts takes them from her and leaves. Lynn glances to the kitchen table and her gaze stops on the two tiny handprints of sweat formed on the table's surface. Tommy Tammisimo a toughlooking eightyearold Italian kid in his school uniform waits at the bottom of Cole's brownstone stairs. Cole emerges from the brownstone moves down the steps and the two boys begin their walk down the street to school. Tommy puts his arm around Cole and Cole waves back. When the two boys turn the corner and are out of Lynn's sight Tommy rips his arm away. Cole starts to smile too and thinks. Cole and Lynn smile at each other and Lynn takes Cole's school bag and jacket before moving to the kitchen. The den doubles as a playroom with boxes of old toys sitting in the corner and a small plastic multicolored table on the rug. Cole appears in the doorway and Malcolm sits up and smiles."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Malcolm stares up at the historic Philadelphia church quietly with its old stone and huge towers making it stand out from the modern buildings all around it. He has to use all his strength to push open the highly ornate doors and slips inside. Only a few people sit and pray in the sea of oak pews. Malcolm scans the majestic room and finds what he is looking for in the last row of the church. He moves down the center aisle towards the back and finds Cole playing in his pew with a set of green and beige plastic soldiers. Cole makes the soldiers talk to each other but stays rigid hands clutching a handful of plastic riflemen. Malcolm nods at the information smiles at Cole and his eyes drift down to Cole's arms which are covered in tiny cuts and bruises. Cole and Malcolm just stare at each other. Lynn walks over to Cole checks his tie and unclips the tie. Cole takes a seat at the kitchen table as Lynn walks back into the laundry room. The dog is gone now and Lynn reaches into the dryer digging for a new tie. She finds one then turns and steps back into the kitchen and screams at the top of her lungs as every cabinet and every drawer is wide open. Cole sits at the kitchen table his hands pressed flat on the tabletop looking shaken. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. Neither says anything for a beat. Lynn looks over to the open cabinet near the sink where the pop tarts are clearly visible. Lynn leans down. Cole does and he looks at her eyes. Cole turns to see Lynn holding the pop tarts takes them from her and leaves. Lynn glances to the kitchen table and her gaze stops on the two tiny handprints of sweat formed on the table's surface. Tommy Tammisimo a toughlooking eightyearold Italian kid in his school uniform waits at the bottom of Cole's brownstone stairs. Cole emerges from the brownstone moves down the steps and the two boys begin their walk down the street to school. Tommy puts his arm around Cole and Cole waves back. When the two boys turn the corner and are out of Lynn's sight Tommy rips his arm away. Cole starts to smile too and thinks. Cole and Lynn smile at each other and Lynn takes Cole's school bag and jacket before moving to the kitchen. The den doubles as a playroom with boxes of old toys sitting in the corner and a small plastic multicolored table on the rug. Cole appears in the doorway and Malcolm sits up and smiles."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Malcolm stares up at the historic Philadelphia church quietly with its old stone and huge towers making it stand out from the modern buildings all around it. He has to use all his strength to push open the highly ornate doors and slips inside. Only a few people sit and pray in the sea of oak pews. Malcolm scans the majestic room and finds what he is looking for in the last row of the church. He moves down the center aisle towards the back and finds Cole playing in his pew with a set of green and beige plastic soldiers. Cole makes the soldiers talk to each other but stays rigid hands clutching a handful of plastic riflemen. Malcolm nods at the information smiles at Cole and his eyes drift down to Cole's arms which are covered in tiny cuts and bruises. Cole emerges from the brownstone moves down the steps and the two boys begin their walk down the street to school. Tommy puts his arm around Cole and Cole waves back. When the two boys turn the corner and are out of Lynn's sight Tommy rips his arm away. Cole starts to smile too and thinks. Cole and Lynn smile at each other and Lynn takes Cole's school bag and jacket before moving to the kitchen. The den doubles as a playroom with boxes of old toys sitting in the corner and a small plastic multicolored table on the rug. Cole appears in the doorway and Malcolm sits up and smiles."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Malcolm stares up at the historic Philadelphia church quietly with its old stone and huge towers making it stand out from the modern buildings all around it. He has to use all his strength to push open the highly ornate doors and slips inside. Only a few people sit and pray in the sea of oak pews. Cole and Lynn smile at each other and Lynn takes Cole's school bag and jacket before moving to the kitchen. The den doubles as a playroom with boxes of old toys sitting in the corner and a small plastic multicolored table on the rug. Cole appears in the doorway and Malcolm sits up and smiles."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Victor glances up at the ancient Madrid library noiselessly, with its crumbling brick and massive spires making it blend into the prehistoric structures all around it. He has to muster all his courage to pull open the intricately simple windows and creeps inside. Only a handful of shadows stand and dance in the ocean of metal benches. Victor examines the grand hallway and locates what he's searching for in the first row of the library. He glides up the left aisle towards the front and spots Alex jumping in his bench with a stack of orange and purple wooden blocks. Alex makes the blocks float near each other but stays frozen, fingers gripping a pile of wooden pilots. Victor shakes at the misunderstanding, grins at Alex, and his gaze floats up to Alex's hands, which are hidden in small feathers and petals. Alex and Victor just blink at one another. Emma wanders over to Alex, fixes his hat, and snaps the hat. Alex stands up at the dining chair as Emma strolls back into the study. The cat is present now, and Emma pulls from the drawer, searching for an old book. She finds one, then spins and jumps back into the dining room and whispers at the bottom of her throat, as every curtain and every blind is shut tight. Alex stands at the dining chair, his feet pressed softly on the floor, appearing eager. Neither whispers anything for a moment. Emma glances over to the closed window near the mirror, where the crackers are slightly obscured. Emma kneels down, Alex rises, and he squints at her lips. Alex turns to notice Emma holding the crackers, grips them from her, and stays. Emma peers to the dining chair, and her sight freezes on the two tiny footprints of dust etched on the floor's texture. Danny Divincenzo, a cheerful-looking, twelve-year-old French girl in her gym uniform, hopes at the middle of Alex's white picket gate. Alex descends from the white gate, strolls up the ramp, and the two girls halt their drive down the alley to practice. Danny flicks her hair around Alex, and Alex waves forward. When the two girls twist the bend and are within Emma's vision, Danny pulls her hair outward. Alex begins to frown slightly and wonders. Alex and Emma frown at each other, and Emma places Alex's gym shoes and cap before sliding to the dining room. The attic triples as an art studio, with piles of new books lying in the cabinet and a large, wooden, single-colored canvas on the shelf. Alex stands in the corridor, and Victor slides down and frowns."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Malcolm quietly approaches a historic Philadelphia church, contrasting with its modern surroundings. Gathering his strength, he enters and spots Cole, playing with toy soldiers in the pews. Malcolm notes Cole's bruised arms as they share a silent moment. Later, at home, Cole sits at the kitchen table while his mother, Lynn, fetches a tie. She screams upon finding all cabinets open, with Cole looking startled. She hands him pop tarts before he leaves. Cole’s friend, Tommy, initially shows support as they walk to school but then distances himself, leaving Cole contemplative. Back home, Cole and Lynn exchange smiles, creating a warm family moment."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Cole appears in the doorway and Malcolm sits up and smiles The den doubles as a playroom with boxes of old toys sitting in the corner and a small plastic multicolored table on the rug Cole and Lynn smile at each other and Lynn takes Cole's school bag and jacket before moving to the kitchen Cole starts to smile too and thinks When the two boys turn the corner and are out of Lynn's sight Tommy rips his arm away Tommy puts his arm around Cole and Cole waves back Cole emerges from the brownstone moves down the steps and the two boys begin their walk down the street to school Tommy Tammisimo a toughlooking eightyearold Italian kid in his school uniform waits at the bottom of Cole's brownstone stairs Lynn glances to the kitchen table and her gaze stops on the two tiny handprints of sweat formed on the table's surface Cole turns to see Lynn holding the pop tarts takes them from her and leaves Cole does and he looks at her eyes Lynn leans down Lynn looks over to the open cabinet near the sink where the pop tarts are clearly visible Neither says anything for a beat Cole sits at the kitchen table his hands pressed flat on the tabletop looking shaken She finds one then turns and steps back into the kitchen and screams at the top of her lungs as every cabinet and every drawer is wide open The dog is gone now and Lynn reaches into the dryer digging for a new tie Cole takes a seat at the kitchen table as Lynn walks back into the laundry room Lynn walks over to Cole checks his tie and unclips the tie Cole and Malcolm just stare at each other Malcolm nods at the information smiles at Cole and his eyes drift down to Cole's arms which are covered in tiny cuts and bruises Cole makes the soldiers talk to each other but stays rigid hands clutching a handful of plastic riflemen He moves down the center aisle towards the back and finds Cole playing in his pew with a set of green and beige plastic soldiers Malcolm scans the majestic room and finds what he is looking for in the last row of the church Only a few people sit and pray in the sea of oak pews He has to use all his strength to push open the highly ornate doors and slips inside Malcolm stares up at the historic Philadelphia church quietly with its old stone and huge towers making it stand out from the modern buildings all around it"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "He has to use all his strength to push open the highly ornate doors and slips inside Malcolm stares up at the historic Philadelphia church quietly with its old stone and huge towers making it stand out from the modern buildings all around it Malcolm scans the majestic room and finds what he is looking for in the last row of the church Only a few people sit and pray in the sea of oak pews Cole makes the soldiers talk to each other but stays rigid hands clutching a handful of plastic riflemen He moves down the center aisle towards the back and finds Cole playing in his pew with a set of green and beige plastic soldiers Cole and Malcolm just stare at each other Malcolm nods at the information smiles at Cole and his eyes drift down to Cole's arms which are covered in tiny cuts and bruises Cole takes a seat at the kitchen table as Lynn walks back into the laundry room Lynn walks over to Cole checks his tie and unclips the tie She finds one then turns and steps back into the kitchen and screams at the top of her lungs as every cabinet and every drawer is wide open The dog is gone now and Lynn reaches into the dryer digging for a new tie Neither says anything for a beat Cole sits at the kitchen table his hands pressed flat on the tabletop looking shaken Lynn leans down Lynn looks over to the open cabinet near the sink where the pop tarts are clearly visible Cole turns to see Lynn holding the pop tarts takes them from her and leaves Cole does and he looks at her eyes Tommy Tammisimo a toughlooking eightyearold Italian kid in his school uniform waits at the bottom of Cole's brownstone stairs Lynn glances to the kitchen table and her gaze stops on the two tiny handprints of sweat formed on the table's surface Tommy puts his arm around Cole and Cole waves back Cole emerges from the brownstone moves down the steps and the two boys begin their walk down the street to school Cole starts to smile too and thinks When the two boys turn the corner and are out of Lynn's sight Tommy rips his arm away The den doubles as a playroom with boxes of old toys sitting in the corner and a small plastic multicolored table on the rug Cole and Lynn smile at each other and Lynn takes Cole's school bag and jacket before moving to the kitchen Cole appears in the doorway and Malcolm sits up and smiles"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Lynn looks over to the open cabinet near the sink where the pop tarts are clearly visible Lynn leans down Cole does and he looks at her eyes Cole turns to see Lynn holding the pop tarts takes them from her and leaves Lynn glances to the kitchen table and her gaze stops on the two tiny handprints of sweat formed on the table's surface Tommy Tammisimo a toughlooking eightyearold Italian kid in his school uniform waits at the bottom of Cole's brownstone stairs Cole emerges from the brownstone moves down the steps and the two boys begin their walk down the street to school Tommy puts his arm around Cole and Cole waves back When the two boys turn the corner and are out of Lynn's sight Tommy rips his arm away Cole starts to smile too and thinks Cole and Lynn smile at each other and Lynn takes Cole's school bag and jacket before moving to the kitchen The den doubles as a playroom with boxes of old toys sitting in the corner and a small plastic multicolored table on the rug Cole appears in the doorway and Malcolm sits up and smiles Malcolm stares up at the historic Philadelphia church quietly with its old stone and huge towers making it stand out from the modern buildings all around it He has to use all his strength to push open the highly ornate doors and slips inside Only a few people sit and pray in the sea of oak pews Malcolm scans the majestic room and finds what he is looking for in the last row of the church He moves down the center aisle towards the back and finds Cole playing in his pew with a set of green and beige plastic soldiers Cole makes the soldiers talk to each other but stays rigid hands clutching a handful of plastic riflemen Malcolm nods at the information smiles at Cole and his eyes drift down to Cole's arms which are covered in tiny cuts and bruises Cole and Malcolm just stare at each other Lynn walks over to Cole checks his tie and unclips the tie Cole takes a seat at the kitchen table as Lynn walks back into the laundry room The dog is gone now and Lynn reaches into the dryer digging for a new tie She finds one then turns and steps back into the kitchen and screams at the top of her lungs as every cabinet and every drawer is wide open Cole sits at the kitchen table his hands pressed flat on the tabletop looking shaken Neither says anything for a beat"
        }
      ]
    }
  ]
}