{
  "ground_truth": "Mr. Cunningham furrows his brow and then chuckles, while Cole's face turns cement grey. Tommy Tammisimo leads the class in a wave of snickering as Cole glances up and sees all the eyes on him. He glances at the teacher, who is still staring, and Mr. Cunningham sees the traumatized expression on Cole's face, instantly stopping smiling as his face becomes still. The class falls into stunned silence. Mr. Cunningham takes an involuntary step towards Cole's desk and moves closer to Cole, who covers his eyes with his hands. Cole's mouth is visible under his covered eyes as he stares for a second and then lowers his head. Malcolm just sits and thinks as Cole turns his head and stares at the windows. Malcolm takes in the sad vision of the boy, and Cole's face softens a bit. Cole turns from the windows and looks to Malcolm, placing it in his right hand, as Malcolm shakes his hand in circles. Cole watches his hand carefully, and Malcolm taps the pocket but doesn't open it. Malcolm opens his right hand, and the penny sits quietly in the center of his palm. Cole looks at the penny and then up to Malcolm's face, cracking a smile. Cole smiles and holds out his hand, his fingers opening to reveal the penny, while Bobby stares. Cole loses his smile, and Cole and the overweight boy stare at each other. Cole gives the boy his penny and gazes at Bobby. Tommy glances down the hall and sees Cole standing frozen, staring at the crawl space closet, and grabs Darren, nudging him to move down the hall. Cole breaks from his trance as Tommy and Darren walk up, but it happens too quick for Cole to react, as Darren and Tommy shove him backwards, and he stumbles into the darkness of the crawl space as Tommy slams the door closed. They crack smiles at each other as Cole bangs on the door, the banging going on for a few seconds, and then it just stops. Darren and Tommy look at each other and then back at the crawl space door, backing away as Cole screams in terror at the top of his lungs, his body slamming against the wood. The two boys are statues as Cole's blood-chilling yells fill the air, footsteps spiking the air as children and mothers come running down the hall, with Lynn being one of them. Malcolm is affected by his client and stares at the tired child sitting before him in the hospital bed, slowly moving the rolling chair closer to Cole’s bed. Malcolm breaks from his thoughts and looks at Cole, who watches him with unwavering attention, as Malcolm smiles. Cole takes an eternal pause while Malcolm just gazes quietly, being very still and staring back at Cole.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Mr. Cunningham wrinkles his forehead and then laughs, while Cole's visage turns cement grey. Tommy Tammisimo directs the class in a wave of giggling as Cole peeks up and notices all the eyes on him. He peeks at the instructor, who is still gazing, and Mr. Cunningham sees the shocked expression on Cole's visage, instantly ceasing laughing as his visage becomes motionless. The class descends into astonished quietude. Mr. Cunningham takes an involuntary stride towards Cole's desk and advances nearer to Cole, who shields his eyes with his hands. Cole's mouth is apparent beneath his shielded eyes as he stares for a moment and then lowers his head. Malcolm just sits and reflects as Cole turns his head and stares at the panes. Malcolm absorbs the melancholy view of the lad, and Cole's visage softens a bit. Cole turns from the panes and looks to Malcolm, placing it in his right hand, as Malcolm rotates his hand in circles. Cole observes his hand closely, and Malcolm taps the pocket but doesn't open it. Malcolm opens his right hand, and the coin rests quietly in the center of his palm. Cole looks at the coin and then up to Malcolm's visage, cracking a grin. Cole grins and extends his hand, his fingers opening to reveal the coin, while Bobby stares. Cole loses his grin, and Cole and the overweight lad gaze at each other. Cole gives the lad his coin and gazes at Bobby. Tommy peeks down the corridor and sees Cole standing frozen, staring at the crawl space closet, and grabs Darren, prodding him to move down the corridor. Cole breaks from his stupor as Tommy and Darren approach, but it happens too quick for Cole to respond, as Darren and Tommy shove him backwards, and he stumbles into the darkness of the crawl space as Tommy slams the door shut. They crack grins at each other as Cole pounds on the door, the pounding continuing for a few seconds, and then it just ceases. Darren and Tommy look at each other and then back at the crawl space door, retreating as Cole shrieks in terror at the top of his lungs, his body crashing against the wood. The two boys are statues as Cole's blood-curdling cries fill the air, footsteps piercing the air as children and mothers come running down the corridor, with Lynn being one of them. Malcolm is influenced by his client and gazes at the weary youth sitting before him in the hospital bed, slowly moving the rolling chair closer to Cole’s bed. Malcolm breaks from his musings and looks at Cole, who watches him with unwavering focus, as Malcolm grins. Cole takes an eternal pause while Malcolm just gazes quietly, being very still and staring back at Cole."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Mr. Cunningham's brow is furrowed and then a chuckle is let out by him, while Cole's face turns cement grey. The class is led by Tommy Tammisimo in a wave of snickering as Cole glances up and sees all the eyes on him. The teacher is glanced at by him, who is still staring, and the traumatized expression on Cole's face is seen by Mr. Cunningham, instantly halting his smile as a stillness overtakes his face. The class falls into stunned silence. An involuntary step is taken by Mr. Cunningham towards Cole's desk, and he moves closer to Cole, who covers his eyes with his hands. Under his covered eyes, Cole's mouth is visible as he stares for a second and then lowers his head. Malcolm just sits and thinks as the windows are stared at by a turning Cole. The sad vision of the boy is taken in by Malcolm, and Cole's face softens a bit. From the windows, Cole turns and looks to Malcolm, placing it in his right hand, as Malcolm shakes his hand in circles. The hand is watched carefully by Cole, and the pocket is tapped by Malcolm but not opened. Malcolm's right hand is opened, and the penny sits quietly in the center of his palm. The penny is looked at by Cole and then at Malcolm's face, a smile being cracked. A smile is cracked by Cole, and his hand is held out, his fingers opening to reveal the penny, as Bobby stares. Cole loses his smile, and Cole and the overweight boy stare at each other. The boy is given his penny by Cole, and Bobby is gazed at. Down the hall is glanced at by Tommy, and Cole is seen standing frozen, staring at the crawl space closet, and Darren is grabbed by him, nudging him to move down the hall. From his trance, Cole breaks as Tommy and Darren walk up, but it happens too quick for Cole to react, as he is shoved backwards by Darren and Tommy, and the darkness of the crawl space is stumbled into by him as the door is slammed closed by Tommy. Smiles are cracked by them at each other as the door is banged on by Cole, the banging going on for a few seconds, and then it just stops. Darren and Tommy look at each other and then back at the crawl space door, backing away as terror is screamed in by Cole at the top of his lungs, his body slamming against the wood. The two boys are statues as Cole's blood-chilling yells fill the air, footsteps spiking the air as children and mothers, with Lynn being one of them, come running down the hall. Malcolm is affected by his client and stares at the tired child sitting before him in the hospital bed, slowly moving the rolling chair closer to Cole’s bed. Malcolm breaks from his thoughts and looks at Cole, who watches him with unwavering attention, as he smiles. An eternal pause is taken by Cole while Malcolm just gazes quietly, being very still and staring back at Cole."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Mr. Cunningham furrows his brow and chuckles, while Cole's face turns pale. Tommy Tammisimo leads the class in snickering as Cole glances up, noticing all eyes on him. He looks at the teacher, who stops smiling, seeing Cole's traumatized expression. The class falls silent. Mr. Cunningham steps towards Cole, who covers his eyes. Cole lowers his head, glancing at Malcolm, who contemplates. Malcolm shows a penny in his palm, which Cole notices and smiles at, extending his hand for it. Bobby stares as Cole's smile fades when he hands the penny back. Tommy sees Cole staring at the crawl space closet, nudges Darren, and they push Cole inside, slamming the door. Cole bangs on it before his screams echo, drawing attention from nearby. Malcolm, affected by his client, sits by the tired child in the hospital bed, rolling closer. Malcolm watches Cole, who in turn watches him intently, as they share a quiet moment."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Mr. Cunningham furrows his brow, chuckles, and Cole turns pale. Tommy Tammisimo leads the class's snickering as Cole sees everyone's eyes on him. Cole glances at Mr. Cunningham, who stops smiling, stunned by Cole's traumatized look. Mr. Cunningham steps towards Cole, who covers his eyes. Cole briefly stares, then lowers his head, while Malcolm contemplates. Cole looks at the window, then Malcolm, who secretly shows a penny. Cole smiles, extending his hand for the penny as Bobby watches. Cole loses his smile and stares at Bobby, giving him the penny. Tommy sees Cole by the crawl space and nudges Darren; they shove Cole inside, locking him in darkness. Cole bangs on the door, then stops. Darren and Tommy exchange looks, then hear Cole's terrified screams. Children and mothers, including Lynn, rush down the hall. Malcolm, affected, sits near Cole in the hospital, who watches Malcolm attentively. Malcolm smiles, Cole pauses, and they quietly stare at each other."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Mr. Cunningham furrows his brow, a thoughtful expression crossing his features, and then lets out a soft chuckle, while, at the same time, Cole's face turns a shade akin to cement grey, reflecting his inner turmoil. Tommy Tammisimo, ever the instigator, takes the lead in inciting the class into a wave of soft snickering, as Cole lifts his gaze and becomes painfully aware of all the eyes now intently focused on him. His glance shifts to the teacher, who maintains a fixed, unwavering stare. The moment Mr. Cunningham registers the traumatized expression etched on Cole's face, any semblance of amusement vanishes instantly from his own face, becoming a mask of stillness. A stunned silence envelops the classroom. \n\nWith concern edging into his actions, Mr. Cunningham takes an involuntary step towards Cole's desk, bridging the distance and moving closer to where Cole sits, now covering his eyes with his hands in a gesture of distress. Beneath his hand-covered eyes, Cole's mouth remains visible, capturing a fleeting second of his stare before he lowers his head in a gesture of defeat. Meanwhile, Malcolm sits quietly, deep in his own thoughts, as Cole turns his head away, directing his gaze out towards the windows. Malcolm absorbs the poignant sight of the despondent boy, noting the subtle softening of Cole's face. \n\nCole eventually diverts his attention from the windows and locks eyes with Malcolm, placing something in his right hand. Malcolm begins to shake his hand in circular motions. Observing intently, Cole watches Malcolm's hand with great care and focus, as Malcolm taps his pocket, yet refrains from opening it. Once Malcolm opens his right hand, a penny sits quietly and unobtrusively in the center of his palm. Cole's eyes move from the stationary penny up to meet Malcolm's face, and in that moment, a smile breaks across Cole's face. With a sense of camaraderie, Cole extends his hand, fingers unfurling to reveal the penny, while Bobby stands by, eyes fixed. \n\nCole's smile fades, and he and the overweight boy engage in a silent exchange of stares. Offering the boy his penny, Cole continues to gaze steadily at Bobby. Tommy, seeking mischief, glances down the hallway and notices Cole standing motionless, his eyes locked on the crawl space closet. Seizing the moment, Tommy grabs Darren, prompting him to move down the hall. Cole, distracted from his trance, is too late to react as Tommy and Darren, filled with mischief, shove him backward. He stumbles into the ominous darkness of the crawl space, and Tommy quickly slams the door shut behind him. Sharing a conspiratorial grin, they listen as Cole bangs against the door—a frantic banging that persists for several tense seconds before abruptly stopping.\n\nFrozen in fear and realization, Darren and Tommy exchange uneasy glances, then turn their attention back to the crawl space door. Their feet instinctively retreat as Cole's screams of terror shatter the silence, echoing through the hallway. The sound of Cole's body violently hitting the wood fills the air, unyielding in its intensity. Statuesque, the two boys stand immobilized as Cole's blood-chilling screams continue to fill the space, his cries escalating into the air as the sound of hurried footsteps grows louder. A host of children and concerned mothers rush down the hallway, with Lynn urgently among them.\n\nIn a different setting, Malcolm, deeply affected by his client, gazes at the weary child sitting before him in the hospital bed. His heart weighs heavy as he gently moves the rolling chair closer to Cole's bed. Snapping out of his reverie, Malcolm looks at Cole, who watches him with unwavering attention, his eyes filled with a plea for understanding. In response, Malcolm offers a warm smile. An eternal pause hangs in the air as Cole contemplates in silence, while Malcolm remains still, his steady gaze fixed on the young boy before him."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Mr. Cunningham, with his brow furrowing deeply, allows a thoughtful expression to momentarily settle on his features. He then lets out a soft, almost inaudible chuckle. At this exact moment, Cole's face undergoes a transformation, turning a shade reminiscent of cement grey, clearly mirroring the inner turmoil he is experiencing. Tommy Tammisimo, with his persistent reputation as the instigator, takes it upon himself to lead the charge, inciting the entire class into a chorus of soft snickering. As Cole lifts his eyes, he becomes painfully aware of all the eyes now laser-focused on him. His glance shifts toward the teacher, who maintains a steady, unwavering stare directed at him. The second Mr. Cunningham registers the traumatized expression etched into Cole's face, any trace of amusement instantly vanishes from his face, leaving it a mask of stillness. A stunned silence envelops the classroom like a heavy fog.\n\nWith concern subtly edging into his demeanor, Mr. Cunningham involuntarily takes a step closer to Cole's desk, closing the distance between them, moving nearer to where Cole sits, now covering his eyes with his hands in a gesture of visible distress. Beneath the shield of his hands, Cole’s mouth is still visible, capturing a fleeting second of his troubled stare before he lowers his head in a gesture of utter defeat. Meanwhile, Malcolm sits quietly, lost in his own thoughts, as Cole, with a heavy heart, turns his gaze out towards the windows. Malcolm absorbs the poignant sight of the despondent boy, noting the subtle softening of Cole's expression.\n\nEventually, Cole diverts his focus away from the windows and locks eyes with Malcolm, discreetly placing something in his right hand. Malcolm begins to shake his hand in slow, circular motions. Observing with intense concentration, Cole watches Malcolm's hand moving with great focus, as Malcolm taps his pocket but refrains from opening it fully. Once Malcolm reveals his right hand, there in the center of his palm lies a penny, quiet and unobtrusive. Cole's eyes gravitate from the stationary penny upward to meet Malcolm's gaze, leading to a genuine smile breaking across Cole's face. With a sense of newfound camaraderie, Cole extends his hand, fingers gently unfurling to reveal the penny, while Bobby stands nearby, his eyes fixed on them.\n\nAs Cole's smile gradually fades, he and the overweight boy engage in a silent exchange of stares. Offering the penny to the boy, Cole continues to gaze steadily at Bobby. Tommy, ever on the lookout for mischief, glances down the hallway and notices Cole standing motionless, his eyes transfixed on the crawl space closet. Seizing the opportunity, Tommy grabs Darren, prompting him to move swiftly down the hall. Cole, pulled from his trance, is too late to react as Tommy and Darren, filled with mischief, shove him backward. He stumbles into the ominous darkness of the crawl space, and Tommy hastily slams the door shut behind him. Sharing a conspiratorial grin, they listen intently as Cole bangs against the door—a frantic banging that resonates for several tense seconds before abruptly ceasing.\n\nFrozen in a mix of fear and realization, Darren and Tommy exchange uneasy glances, then turn their attention back to the crawl space door. Their feet instinctively take a step back as Cole's screams of terror pierce the silence, echoing ominously through the hallway. The sound of Cole's body violently hitting the wood fills the air, relentless in its intensity. Statuesque, the two boys stand immobilized as Cole’s blood-curdling screams continue to reverberate through the space, his cries escalating into the air just as the sound of hurried footsteps grows louder. A host of children and concerned mothers rush down the hallway, with Lynn urgently among them.\n\nIn a completely different setting, Malcolm, deeply affected by his young client, gazes at the weary child sitting before him in the hospital bed. His heart feels heavy as he gently rolls the chair closer to Cole’s bed. Snapping out of his reverie, Malcolm looks intently at Cole, who watches him with unwavering attention, his eyes filled with a silent plea for understanding. In response, Malcolm offers a warm, reassuring smile. An eternal pause seems to hang in the air as Cole contemplates in silence, while Malcolm remains still, his steady gaze fixed on the young boy before him."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Mr. Cunningham, with a deep furrowing of his brow that suggests a moment of intense thought, lets out a chuckle, a sound that seems to hang in the air, while simultaneously, Cole's face takes on the color of cement grey, a noticeable shift that draws the attention of the room. As if on cue, Tommy Tammisimo initiates a ripple of snickering among the students, creating a wave of whispers and laughter that washes over the class. Cole, sensing the weight of all eyes upon him, lifts his gaze cautiously to meet their curious and amused stares, only to catch a glimpse of the teacher's unwavering look. Mr. Cunningham, upon witnessing the raw and distressed expression on Cole's face, abruptly halts his smile, his features freezing as if caught in mid-motion, and the room plunges into a stunned silence. This change prompts Mr. Cunningham to take an unwitting step towards Cole's desk, his mind perhaps driven by concern, as he approaches closer to Cole's space. In response, Cole shields his eyes with his hands, creating a barrier between himself and the world, with only his mouth remaining visible beneath his covered eyes. For a brief moment, he stares out from under this makeshift shield before his head droops downwards, retreating further into himself. Amidst this silent tension, Malcolm sits in a pensive state, his mind in contemplation as he observes Cole turning his head towards the windows, perhaps seeking solace in the view beyond. As Malcolm absorbs the poignant sight of the boy, he notes a slight softening in Cole's expression, a subtle change that hints at a shift in his emotional state. Cole, having taken a moment to reflect, redirects his attention from the windows back to Malcolm, reaching out with his right hand. Malcolm acknowledges this gesture by shaking his hand in gentle circles, an action that Cole watches with care. Within this silent exchange, Malcolm taps the pocket, a gesture that remains unexplained as he refrains from opening it. Instead, he opens his right hand to reveal a penny resting quietly at the center of his palm. This simple offering prompts Cole to look at the penny, then upwards to Malcolm's face, where he manages to break into a smile. Encouraged by this small connection, Cole extends his hand, his fingers unfurling to reveal another penny. Meanwhile, Bobby watches intently, observing the exchange. However, Cole's smile fades as he locks eyes with the overweight boy, initiating a wordless communication. With a deliberate movement, Cole passes the penny to the boy, maintaining his gaze upon Bobby. As the scene shifts, Tommy glances down the hall and notices Cole standing transfixed, staring intently at the crawl space closet, a sight that compels him to grab Darren and nudge him in that direction. The presence of Tommy and Darren interrupts Cole's reverie, snapping him out of his trance, but the disruption occurs too swiftly for Cole to respond adequately. In an unforeseen move, Darren and Tommy push Cole backward, causing him to stumble into the darkness of the crawl space as Tommy swiftly slams the door shut, trapping him inside. They exchange quick, mischievous grins as Cole's pounding on the door resonates momentarily before coming to an abrupt halt. The two boys exchange looks, their attention divided between each other and the closed crawl space door, from which Cole's screams of terror erupt, resonating with a chilling intensity that sends vibrations through the wooden structure. Immobilized by the sound, Darren and Tommy become as statues, standing in stark contrast to the scene of unfolding panic. As Cole's blood-curdling yells penetrate the air, they draw attention from all around, prompting children and mothers to rush towards the commotion, with Lynn among those hastening down the hallway. Meanwhile, Malcolm, affected by his client's distress, observes the weary child's figure lying in the hospital bed, his own body responding by shifting the rolling chair closer to Cole's bedside. Shaking off his reverie, Malcolm directs his focus to Cole, who returns the gaze with unwavering attention, creating a shared moment of silent understanding. Malcolm smiles gently, and Cole takes a long, contemplative pause, while Malcolm remains still, his gaze steady and reassuring as he continues to watch Cole with quiet intent."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Mr. Cunningham, initially amused, notices Cole's petrified expression and quickly becomes serious, leading the class to silence. He steps towards Cole, who covers his eyes, then lowers his head, still visibly distressed. Malcolm observes the scene, taking in Cole's sorrowful demeanor. As Cole turns from the window towards Malcolm, Malcolm discreetly reveals a penny in his palm. Cole's expression softens, and he smiles at Malcolm, eventually holding out his hand to reveal the penny. Bobby observes the interaction, and after a moment of mutual acknowledgment, Cole passes the penny to him. Meanwhile, Tommy and Darren notice Cole fixated on the crawl space closet. They seize the opportunity to push Cole inside, closing the door and leaving him in darkness. Cole's desperate banging and screams draw the attention of others, including Lynn, who rushes to the scene. In a hospital room later, Malcolm, visibly moved by Cole's plight, draws his chair closer. He and Cole exchange a silent, meaningful look, with Malcolm offering a reassuring smile as they share a moment of mutual understanding."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Mr. Cunningham, a seasoned educator known for his empathetic approach, furrows his brow and then chuckles, while Cole's face turns cement grey. Tommy Tammisimo, who often finds humor in awkward situations, leads the class in a wave of snickering as Cole glances up and sees all the eyes on him. He glances at the teacher, who is still staring, and Mr. Cunningham sees the traumatized expression on Cole's face, instantly stopping smiling as his face becomes still. The class falls into stunned silence that seems to hang heavily in the air. Mr. Cunningham takes an involuntary step towards Cole's desk and moves closer to Cole, who covers his eyes with his hands, reminiscent of a protective gesture he learned in childhood. Cole's mouth is visible under his covered eyes as he stares for a second and then lowers his head. Malcolm, known for his thoughtful nature, just sits and thinks as Cole turns his head and stares at the windows, a view often offering him solace. Malcolm takes in the sad vision of the boy, and Cole's face softens a bit. Cole turns from the windows and looks to Malcolm, placing it in his right hand, as Malcolm shakes his hand in circles—a habit he picked up from his meditation classes. Cole watches his hand carefully, and Malcolm taps the pocket but doesn't open it. Malcolm opens his right hand, and the penny, a 1972 Lincoln penny known for its copper luster, sits quietly in the center of his palm. Cole looks at the penny and then up to Malcolm's face, cracking a smile, a rare expression for him lately. Cole smiles and holds out his hand, his fingers opening to reveal the penny, while Bobby, often the silent observer of the group, stares. Cole loses his smile, and Cole and the overweight boy stare at each other. Cole gives the boy his penny and gazes at Bobby, a gesture of unexpected kindness. Tommy glances down the hall and sees Cole standing frozen, staring at the crawl space closet, a place rumored to be haunted by the older students, and grabs Darren, nudging him to move down the hall. Cole breaks from his trance as Tommy and Darren walk up, but it happens too quick for Cole to react, as Darren and Tommy shove him backwards, and he stumbles into the darkness of the crawl space as Tommy slams the door closed. They crack smiles at each other as Cole bangs on the door, the banging going on for a few seconds, and then it just stops, setting an eerie silence. Darren and Tommy look at each other and then back at the crawl space door, backing away as Cole screams in terror at the top of his lungs, his body slamming against the wood. The two boys are statues as Cole's blood-chilling yells fill the air, footsteps spiking the air as children and mothers come running down the hall, with Lynn, the school nurse known for her quick response, being one of them. Malcolm is affected by his client and stares at the tired child sitting before him in the hospital bed, slowly moving the rolling chair closer to Cole’s bed, the wheels squeaking on the sterile floor. Malcolm breaks from his thoughts and looks at Cole, who watches him with unwavering attention, as Malcolm, always maintaining a reassuring presence, smiles. Cole takes an eternal pause while Malcolm just gazes quietly, being very still and staring back at Cole, creating a moment of shared understanding."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Mr Cunningham furrows his brow and then chuckles while Cole's face turns cement grey. Tommy Tammisimo leads the class in a wave of snickering as Cole glances up and sees all the eyes on him. He glances at the teacher who is still staring and Mr Cunningham sees the traumatized expression on Cole's face instantly stopping smiling as his face becomes still. The class falls into stunned silence. Mr Cunningham takes an involuntary step towards Cole's desk and moves closer to Cole who covers his eyes with his hands. Cole's mouth is visible under his covered eyes as he stares for a second and then lowers his head. Malcolm just sits and thinks as Cole turns his head and stares at the windows. Malcolm takes in the sad vision of the boy and Cole's face softens a bit. Cole turns from the windows and looks to Malcolm placing it in his right hand as Malcolm shakes his hand in circles. Cole watches his hand carefully and Malcolm taps the pocket but does not open it. Malcolm opens his right hand and the penny sits quietly in the center of his palm. Cole looks at the penny and then up to Malcolm's face cracking a smile. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Cole smiles and holds out his hand his fingers opening to reveal the penny while Bobby stares. Cole loses his smile and Cole and the overweight boy stare at each other. Cole gives the boy his penny and gazes at Bobby. Tommy glances down the hall and sees Cole standing frozen staring at the crawl space closet and grabs Darren nudging him to move down the hall. Cole breaks from his trance as Tommy and Darren walk up but it happens too quick for Cole to react as Darren and Tommy shove him backwards and he stumbles into the darkness of the crawl space as Tommy slams the door closed. They crack smiles at each other as Cole bangs on the door the banging going on for a few seconds and then it just stops. Darren and Tommy look at each other and then back at the crawl space door backing away as Cole screams in terror at the top of his lungs his body slamming against the wood. The two boys are statues as Cole's bloodchilling yells fill the air footsteps spiking the air as children and mothers come running down the hall with Lynn being one of them. Malcolm is affected by his client and stares at the tired child sitting before him in the hospital bed slowly moving the rolling chair closer to Cole’s bed. Malcolm breaks from his thoughts and looks at Cole who watches him with unwavering attention. as Malcolm smiles. Cole takes an eternal pause while Malcolm just gazes quietly being very still and staring back at Cole."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Mr Cunningham furrows his brow and then chuckles while Cole's face turns cement grey. Tommy Tammisimo leads the class in a wave of snickering as Cole glances up and sees all the eyes on him. He glances at the teacher who is still staring and Mr Cunningham sees the traumatized expression on Cole's face instantly stopping smiling as his face becomes still. The class falls into stunned silence. Mr Cunningham takes an involuntary step towards Cole's desk and moves closer to Cole who covers his eyes with his hands. Cole's mouth is visible under his covered eyes as he stares for a second and then lowers his head. Malcolm just sits and thinks as Cole turns his head and stares at the windows. Malcolm takes in the sad vision of the boy and Cole's face softens a bit. Cole turns from the windows and looks to Malcolm placing it in his right hand as Malcolm shakes his hand in circles. Cole watches his hand carefully and Malcolm taps the pocket but does not open it. Malcolm opens his right hand and the penny sits quietly in the center of his palm. Cole looks at the penny and then up to Malcolm's face cracking a smile. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Cole smiles and holds out his hand his fingers opening to reveal the penny while Bobby stares. Cole loses his smile and Cole and the overweight boy stare at each other. Cole gives the boy his penny and gazes at Bobby. Tommy glances down the hall and sees Cole standing frozen staring at the crawl space closet and grabs Darren nudging him to move down the hall. Cole breaks from his trance as Tommy and Darren walk up but it happens too quick for Cole to react as Darren and Tommy shove him backwards and he stumbles into the darkness of the crawl space as Tommy slams the door closed. They crack smiles at each other as Cole bangs on the door the banging going on for a few seconds and then it just stops. Darren and Tommy look at each other and then back at the crawl space door backing away as Cole screams in terror at the top of his lungs his body slamming against the wood. The two boys are statues as Cole's bloodchilling yells fill the air footsteps spiking the air as children and mothers come running down the hall with Lynn being one of them. Malcolm is affected by his client and stares at the tired child sitting before him in the hospital bed slowly moving the rolling chair closer to Cole’s bed. Malcolm breaks from his thoughts and looks at Cole who watches him with unwavering attention. as Malcolm smiles. Cole takes an eternal pause while Malcolm just gazes quietly being very still and staring back at Cole."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Mr Cunningham furrows his brow and then chuckles while Cole's face turns cement grey. Tommy Tammisimo leads the class in a wave of snickering as Cole glances up and sees all the eyes on him. He glances at the teacher who is still staring and Mr Cunningham sees the traumatized expression on Cole's face instantly stopping smiling as his face becomes still. The class falls into stunned silence. Mr Cunningham takes an involuntary step towards Cole's desk and moves closer to Cole who covers his eyes with his hands. Cole's mouth is visible under his covered eyes as he stares for a second and then lowers his head. Darren and Tommy look at each other and then back at the crawl space door backing away as Cole screams in terror at the top of his lungs his body slamming against the wood. The two boys are statues as Cole's bloodchilling yells fill the air footsteps spiking the air as children and mothers come running down the hall with Lynn being one of them. Malcolm is affected by his client and stares at the tired child sitting before him in the hospital bed slowly moving the rolling chair closer to Cole’s bed. Malcolm breaks from his thoughts and looks at Cole who watches him with unwavering attention. as Malcolm smiles. Cole takes an eternal pause while Malcolm just gazes quietly being very still and staring back at Cole."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Mr Cunningham furrows his brow and then chuckles while Cole's face turns cement grey. Tommy Tammisimo leads the class in a wave of snickering as Cole glances up and sees all the eyes on him. He glances at the teacher who is still staring and Mr Cunningham sees the traumatized expression on Cole's face instantly stopping smiling as his face becomes still. as Malcolm smiles. Cole takes an eternal pause while Malcolm just gazes quietly being very still and staring back at Cole."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Mr. Thompson scrunches his nose and then whistles, while Nina's hair turns ocean blue. Jerry Waverly directs the crew in a burst of giggling as Nina peeks over and sees all the plants on her. She peers at the chef, who is still blinking, and Mr. Thompson notices the bored expression on Nina's hair, instantly stopping humming as his nose becomes smooth. The crew descends into speechless surprise. Mr. Thompson makes an enthusiastic leap towards Nina's canvas and rolls closer to Nina, who hides her toes with her elbows. Nina's shoe is visible under her hidden toes as she blinks for a minute and then raises her chin. Oliver just floats and dreams as Nina twists her chin and blinks at the rooftops. Oliver absorbs the joyful melody of the cat, and Nina's hair brightens a lot. Nina turns from the rooftops and glances to Oliver, placing it in her left toe, as Oliver shrugs his toe in triangles. Nina observes her toe intently, and Oliver taps the cap but doesn't close it. Oliver closes his left toe, and the marble sits quietly in the corner of his heel. Nina glances at the marble and then down to Oliver's hair, cracking a frown. Nina frowns and closes out her elbow, her limbs closing to hide the marble, while Timmy examines. Nina finds her frown, and Nina and the delicate cat examine each other. Nina takes the cat her marble and examines Timmy. Jerry peeks up the road and finds Nina standing alert, examining the attic stairwell, and nudges Fred, pulling him to sneak up the road. Nina joins from her daydream as Jerry and Fred rush over, but it happens too slow for Nina to notice, as Fred and Jerry pull her forwards, and she stands into the glow of the attic stairwell as Jerry opens the hatch open. They burst tears at each other as Nina whispers on the hatch, the whispering continuing for a few minutes, and then it just echoes. Fred and Jerry nod at each other and then forward at the attic hatch, moving closer as Nina yawns in joy at the base of her feet, her hair tapping against the metal. The two cats are rivers as Nina's calming songs fill the ocean, drumbeats humming the ocean as flowers and fathers come dancing up the road, with Rosa joining three of them. Oliver is calmed by his friend and floats at the young plant standing beneath her near the schoolyard swing, quickly rolling the dining couch closer to Nina’s swing. Oliver joins from his melodies and floats at Nina, who listens to him with wavering emotion, as Oliver cries. Nina takes an endless sigh while Oliver just nods quietly, being very quick and floating back at Nina."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Mr. Cunningham initially chuckles but stops when he sees Cole's traumatized expression, leading the class to silence. Cole covers his eyes, glancing at Malcolm, who, observing him, subtly offers a penny. Cole smiles at Malcolm, but their moment is interrupted when Tommy and Darren shove Cole into a crawl space, slamming the door shut. Trapped, Cole's terrified screams echo as bystanders rush towards the noise. Meanwhile, Malcolm, affected by his young client's plight, sits beside him in a hospital bed, offering silent support as they share a quiet, attentive exchange."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Cole takes an eternal pause while Malcolm just gazes quietly being very still and staring back at Cole as Malcolm smiles Malcolm breaks from his thoughts and looks at Cole who watches him with unwavering attention Malcolm is affected by his client and stares at the tired child sitting before him in the hospital bed slowly moving the rolling chair closer to Cole’s bed The two boys are statues as Cole's bloodchilling yells fill the air footsteps spiking the air as children and mothers come running down the hall with Lynn being one of them Darren and Tommy look at each other and then back at the crawl space door backing away as Cole screams in terror at the top of his lungs his body slamming against the wood They crack smiles at each other as Cole bangs on the door the banging going on for a few seconds and then it just stops Cole breaks from his trance as Tommy and Darren walk up but it happens too quick for Cole to react as Darren and Tommy shove him backwards and he stumbles into the darkness of the crawl space as Tommy slams the door closed Tommy glances down the hall and sees Cole standing frozen staring at the crawl space closet and grabs Darren nudging him to move down the hall Cole gives the boy his penny and gazes at Bobby Cole loses his smile and Cole and the overweight boy stare at each other Cole smiles and holds out his hand his fingers opening to reveal the penny while Bobby stares Cole looks at the penny and then up to Malcolm's face cracking a smile Malcolm opens his right hand and the penny sits quietly in the center of his palm Cole watches his hand carefully and Malcolm taps the pocket but does not open it Cole turns from the windows and looks to Malcolm placing it in his right hand as Malcolm shakes his hand in circles Malcolm takes in the sad vision of the boy and Cole's face softens a bit Malcolm just sits and thinks as Cole turns his head and stares at the windows Cole's mouth is visible under his covered eyes as he stares for a second and then lowers his head Mr Cunningham takes an involuntary step towards Cole's desk and moves closer to Cole who covers his eyes with his hands The class falls into stunned silence He glances at the teacher who is still staring and Mr Cunningham sees the traumatized expression on Cole's face instantly stopping smiling as his face becomes still Tommy Tammisimo leads the class in a wave of snickering as Cole glances up and sees all the eyes on him Mr Cunningham furrows his brow and then chuckles while Cole's face turns cement grey"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "Tommy Tammisimo leads the class in a wave of snickering as Cole glances up and sees all the eyes on him Mr Cunningham furrows his brow and then chuckles while Cole's face turns cement grey The class falls into stunned silence He glances at the teacher who is still staring and Mr Cunningham sees the traumatized expression on Cole's face instantly stopping smiling as his face becomes still Cole's mouth is visible under his covered eyes as he stares for a second and then lowers his head Mr Cunningham takes an involuntary step towards Cole's desk and moves closer to Cole who covers his eyes with his hands Malcolm takes in the sad vision of the boy and Cole's face softens a bit Malcolm just sits and thinks as Cole turns his head and stares at the windows Cole watches his hand carefully and Malcolm taps the pocket but does not open it Cole turns from the windows and looks to Malcolm placing it in his right hand as Malcolm shakes his hand in circles Cole looks at the penny and then up to Malcolm's face cracking a smile Malcolm opens his right hand and the penny sits quietly in the center of his palm Cole loses his smile and Cole and the overweight boy stare at each other Cole smiles and holds out his hand his fingers opening to reveal the penny while Bobby stares Tommy glances down the hall and sees Cole standing frozen staring at the crawl space closet and grabs Darren nudging him to move down the hall Cole gives the boy his penny and gazes at Bobby They crack smiles at each other as Cole bangs on the door the banging going on for a few seconds and then it just stops Cole breaks from his trance as Tommy and Darren walk up but it happens too quick for Cole to react as Darren and Tommy shove him backwards and he stumbles into the darkness of the crawl space as Tommy slams the door closed The two boys are statues as Cole's bloodchilling yells fill the air footsteps spiking the air as children and mothers come running down the hall with Lynn being one of them Darren and Tommy look at each other and then back at the crawl space door backing away as Cole screams in terror at the top of his lungs his body slamming against the wood Malcolm breaks from his thoughts and looks at Cole who watches him with unwavering attention Malcolm is affected by his client and stares at the tired child sitting before him in the hospital bed slowly moving the rolling chair closer to Cole’s bed Cole takes an eternal pause while Malcolm just gazes quietly being very still and staring back at Cole as Malcolm smiles"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Cole smiles and holds out his hand his fingers opening to reveal the penny while Bobby stares Cole loses his smile and Cole and the overweight boy stare at each other Cole gives the boy his penny and gazes at Bobby Tommy glances down the hall and sees Cole standing frozen staring at the crawl space closet and grabs Darren nudging him to move down the hall Cole breaks from his trance as Tommy and Darren walk up but it happens too quick for Cole to react as Darren and Tommy shove him backwards and he stumbles into the darkness of the crawl space as Tommy slams the door closed They crack smiles at each other as Cole bangs on the door the banging going on for a few seconds and then it just stops Darren and Tommy look at each other and then back at the crawl space door backing away as Cole screams in terror at the top of his lungs his body slamming against the wood The two boys are statues as Cole's bloodchilling yells fill the air footsteps spiking the air as children and mothers come running down the hall with Lynn being one of them Malcolm is affected by his client and stares at the tired child sitting before him in the hospital bed slowly moving the rolling chair closer to Cole’s bed Malcolm breaks from his thoughts and looks at Cole who watches him with unwavering attention as Malcolm smiles Cole takes an eternal pause while Malcolm just gazes quietly being very still and staring back at Cole Mr Cunningham furrows his brow and then chuckles while Cole's face turns cement grey Tommy Tammisimo leads the class in a wave of snickering as Cole glances up and sees all the eyes on him He glances at the teacher who is still staring and Mr Cunningham sees the traumatized expression on Cole's face instantly stopping smiling as his face becomes still The class falls into stunned silence Mr Cunningham takes an involuntary step towards Cole's desk and moves closer to Cole who covers his eyes with his hands Cole's mouth is visible under his covered eyes as he stares for a second and then lowers his head Malcolm just sits and thinks as Cole turns his head and stares at the windows Malcolm takes in the sad vision of the boy and Cole's face softens a bit Cole turns from the windows and looks to Malcolm placing it in his right hand as Malcolm shakes his hand in circles Cole watches his hand carefully and Malcolm taps the pocket but does not open it Malcolm opens his right hand and the penny sits quietly in the center of his palm Cole looks at the penny and then up to Malcolm's face cracking a smile"
        }
      ]
    }
  ]
}