{
  "ground_truth": "Tiny statues of saints surround the interior perimeter, and we see that the statue Cole stole from the church is in here. This tent is a sanctuary made by an eight-year-old to hide in. Some are villagers, others are dressed as trees and animals, and Cole comes on stage holding a painted cardboard monkey. The arched halls of the private school are lined with posted drawings and test papers. Cole and Malcolm walk down an empty hall, continuing in silence, as Malcolm takes his time. Malcolm stops at a set of doors at the end of the hall and realizes Cole is no longer next to him. Malcolm turns to find Cole frozen about ten feet back and walks to him, noticing Cole's expression as he gets closer. Climbing ropes hang from the wood-beamed ceiling, and Malcolm looks to Cole, then turns back to the ceiling. Malcolm's body becomes very still as he looks at the wood beams and climbing ropes, glancing at Cole, then turning back to him, finding the child with tears in his eyes. Cole looks at Malcolm desperately, and Malcolm stares helplessly. A black man in britches and no shirt, with his face beaten to a pulp, hangs in the center, a white woman in a torn white frilly dress with tears soaking her face hangs to the right, and a small mixed race child in half pants hangs to their left; the family stares at Cole. Lynn fiddles with the dials, while Cole is standing before the beat-up twelve-inch kitchen TV. On the television screen is Tommy Tammisimo, standing in his pajamas in a doorway. Cole removes the gloves from his hand and places them next to his plate, then moves them to the floor. Lynn is irritated, as this is a sore point between them. Lynn and Cole eat quietly as Cole looks up with an anxious expression on his face, just staring, then looking down at his lap. Lynn stares at Cole, folding her napkin quietly, as Cole's eyes start to water up, just staring at his mother's expression. Cole gets up, never taking his eyes off his mother, and leaves the room, entering the dark hallway. He gets startled by the sound, as Sebastian comes racing down the hall and scurries past Cole. Cole watches his puppy dart into the living room and under a couch, then slowly turns back and looks down the hall. The door to Cole's room sits at the end of the corridor, and Cole stops breathing, too terrified to move. Meanwhile, Lynn is kneeling on the kitchen floor trying to coax the puppy out of the broom closet, fighting back some tears, and eventually hugs him.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Tiny figurines of saints encircle the interior boundary, and we observe that the figurine Cole pilfered from the chapel is in here. This canopy is a haven crafted by an eight-year-old to conceal within. Some are townsfolk, others are attired as trees and creatures, and Cole arrives on stage gripping a painted cardboard ape. The vaulted corridors of the private academy are adorned with posted illustrations and examination sheets. Cole and Malcolm stroll down an unoccupied corridor, proceeding in silence, as Malcolm takes his time. Malcolm pauses at a set of portals at the end of the corridor and perceives Cole is no longer beside him. Malcolm swivels to discover Cole immobilized about ten feet back and strides to him, noticing Cole's demeanor as he approaches. Climbing cords dangle from the timber-raftered ceiling, and Malcolm looks to Cole, then turns back to the ceiling. Malcolm's form becomes very motionless as he gazes at the timber rafters and climbing cords, glancing at Cole, then turning back to him, finding the youngster with tears in his eyes. Cole looks at Malcolm urgently, and Malcolm stares impotently. A dark-skinned man in breeches and no shirt, with his visage battered to a pulp, hangs in the middle, a Caucasian woman in a tattered white lacy gown with tears soaking her visage hangs to the right, and a small biracial child in knickers hangs to their left; the family gazes at Cole. Lynn fiddles with the knobs, while Cole is standing before the battered twelve-inch kitchen TV. On the television display is Tommy Tammisimo, standing in his sleepwear in a doorway. Cole removes the mitts from his hand and places them beside his platter, then moves them to the ground. Lynn is annoyed, as this is a sensitive issue between them. Lynn and Cole dine quietly as Cole looks up with an apprehensive expression on his visage, just staring, then looking down at his lap. Lynn gazes at Cole, folding her serviette quietly, as Cole's eyes start to water up, just staring at his mother's expression. Cole rises, never taking his eyes off his mother, and departs the room, entering the dim corridor. He gets startled by the noise, as Sebastian comes racing down the corridor and scurries past Cole. Cole observes his pup dart into the lounge and under a sofa, then slowly turns back and looks down the corridor. The door to Cole's chamber sits at the end of the passage, and Cole stops breathing, too frightened to move. Meanwhile, Lynn is kneeling on the kitchen ground trying to coax the pup out of the broom cupboard, fighting back some tears, and eventually embraces him."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Tiny statues of saints are surrounded by the interior perimeter, and it is seen by us that the statue stolen by Cole from the church is in here. This tent has been made by an eight-year-old to hide in as a sanctuary. Some are villagers, others are dressed as trees and animals, and a painted cardboard monkey is held by Cole when he comes on stage. Posted drawings and test papers line the arched halls of the private school. Cole and Malcolm are walking down an empty hall, continuing in silence, as time is taken by Malcolm. A set of doors at the end of the hall is stopped at by Malcolm, and he realizes Cole is no longer next to him. Malcolm turns to find Cole frozen about ten feet back and walks to him, noticing Cole's expression as he gets closer. Climbing ropes hang from the wood-beamed ceiling, and a glance is made by Malcolm to Cole, then a turn back to the ceiling. Malcolm's body becomes very still as he looks at the wood beams and climbing ropes, then glances at Cole, turning back to him and finding the child with tears in his eyes. Cole's desperate look is directed at Malcolm, and a helpless stare is given by Malcolm. In the center hangs a black man in britches and no shirt, with his face beaten to a pulp; a white woman in a torn white frilly dress with tears soaking her face is hanging to the right, and a small mixed race child in half pants hangs to their left; the family stares at Cole. The dials are fiddled with by Lynn, while Cole stands before the beat-up twelve-inch kitchen TV. Standing in his pajamas in a doorway is Tommy Tammisimo on the television screen. Gloves are removed from Cole's hand and placed next to his plate, then moved to the floor by him. Lynn becomes irritated, as this is a sore point between them. Lynn and Cole eat quietly, and Cole looks up with an anxious expression on his face, just staring, then looks down at his lap. Lynn stares at Cole, quietly folding her napkin as Cole's eyes start to water up, just staring at his mother's expression. Never taking his eyes off his mother, Cole gets up and leaves the room, entering the dark hallway. The sound startles him, as Sebastian races down the hall and scurries past Cole. Cole watches his puppy dart into the living room and under a couch, then he slowly turns back and looks down the hall. The door to Cole's room is situated at the end of the corridor, and his breathing stops, as Cole is too terrified to move. Meanwhile, on the kitchen floor, Lynn kneels trying to coax the puppy out of the broom closet, fighting back some tears, and eventually, she hugs him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Tiny statues of saints line the interior, and we see the statue Cole took from the church here. This tent serves as a sanctuary for an eight-year-old to hide. Some people are villagers; others are dressed as trees and animals. Cole enters with a painted cardboard monkey. The school's arched halls are covered with drawings and test papers. Cole and Malcolm walk silently down an empty hall. Malcolm stops at the doors, realizing Cole is not beside him. Turning, he finds Cole frozen ten feet back and approaches him, noticing Cole's expression. Climbing ropes hang from the wood-beamed ceiling. As Malcolm looks at the beams and ropes, he notices Cole with tears. A black man with a beaten face, a white woman in a torn dress, and a mixed-race child hang in the center, staring at Cole. Lynn adjusts the dials while Cole stands before the beat-up kitchen TV showing Tommy Tammisimo in pajamas. Cole removes his gloves, placing them next to his plate, then on the floor. Lynn is irritated, as this is a sore point. They eat quietly, with Cole looking anxious and teary-eyed, then leaves the room, entering the dark hallway. Startled by a noise, he sees Sebastian racing down the hall into the living room. Cole looks down the hall, terrified to move. Meanwhile, Lynn kneels on the kitchen floor, coaxing the puppy out of the broom closet, fighting back tears, and eventually hugs him."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Tiny statues of saints line the interior, with the stolen statue from the church present. An eight-year-old created this sanctuary, where villagers, trees, animals, and Cole, with a cardboard monkey, appear. School halls display drawings and tests. Cole and Malcolm walk silently; Malcolm stops at doors, realizing Cole isn't beside him. Malcolm finds Cole frozen, tears in his eyes, beneath climbing ropes. A black man, white woman, and mixed-race child hang, staring at Cole. Lynn adjusts the TV, with Cole watching Tommy Tammisimo. Cole removes gloves, irking Lynn. They eat in silence, Cole anxious, then leaves for the dark hall. Startled by Sebastian, Cole watches the puppy scurry. Finally, Lynn, kneeling and emotional, coaxes the puppy from a closet, hugging it."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Tiny statues of saints form a continuous circle around the perimeter of the interior space, and upon closer inspection, we notice that the statue which Cole stealthily took from the church is actually situated here. This unique tent serves as a secretive sanctuary, ingeniously created by an imaginative eight-year-old child, providing a hidden refuge. Among those present, some individuals resemble villagers, while others are disguised to look like trees and animals. In this peculiar scene, Cole makes his entrance onto the stage, firmly grasping a monkey crafted from painted cardboard. The arched corridors of the prestigious private school are adorned with an array of colorful drawings and marked test papers. Cole and Malcolm walk side by side down a silent, deserted hallway, their footsteps barely making a sound as Malcolm takes his time. Arriving at a set of doors at the far end of the corridor, Malcolm has a sudden realization—Cole is no longer beside him. He turns around, discovering Cole, seemingly frozen in place about ten feet back, and slowly approaches him, noticing the boy's unsettling expression as he draws nearer. Hanging from the wood-beamed ceiling are sturdy climbing ropes, and Malcolm shifts his gaze to Cole, then directs his attention back to the ceiling. Malcolm's body becomes completely motionless as he stares intently at the intricate wood beams and dangling climbing ropes, alternating his focus between them and Cole. What he sees next is a child, with tears brimming in his eyes, looking at Malcolm with pure desperation, and Malcolm meets his gaze with a look of helplessness. In a haunting tableau, a black man wearing only britches and bearing a severely beaten face is suspended in the center. To the right, a white woman clad in a tattered white frilly dress, her face soaked with tears, is also hanging, and to the left is a small mixed-race child in half-worn pants, all staring intently at Cole. Meanwhile, Lynn is busy fiddling with the dials as Cole stands in front of the worn twelve-inch kitchen TV. On the small screen, Tommy Tammisimo is visible, standing in his pajamas within a doorway. Cole carefully removes the gloves from his hand, placing them beside his plate before moving them gently to the floor. This action irritates Lynn, for it touches a sensitive nerve between them. In the tense atmosphere, Lynn and Cole eat their meal in silence, while Cole lifts his gaze, wearing an anxious expression, staring blankly before dropping his eyes to his lap. Observing her son, Lynn quietly folds her napkin, as Cole's eyes begin to fill with tears, simply staring at his mother's face. Without breaking eye contact, Cole rises from his seat and exits the room, venturing into the shadowy hallway. He suddenly gets startled by a noise, as Sebastian, the puppy, comes rushing down the hall and scurries past Cole. As the puppy darts into the living room and finds a hiding spot under a couch, Cole slowly turns back, casting a long look down the dimly lit hall. The door to Cole's room stands ominously at the end of the corridor, and he holds his breath, paralyzed with fear, unable to move. Meanwhile, back in the kitchen, Lynn is kneeling on the floor, earnestly trying to coax the puppy out of the broom closet. Struggling with her emotions, she eventually pulls the puppy close, hugging him tightly."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Tiny, intricately designed statues of saints are meticulously arranged in a continuous circle, forming a complete border around the entire perimeter of the vast interior space. Upon examining this scene with greater scrutiny, we discern that the very statue which Cole stealthily took from the sacred church is now actually positioned here, amongst the others. This singular, unique tent functions as a clandestine sanctuary. It has been ingeniously crafted by the imaginative mind of an eight-year-old child, serving as a hidden refuge from the outside world. Among those gathered there, certain individuals closely resemble villagers, while others have cleverly disguised themselves to look like various trees and animals, blending seamlessly into the peculiar scene. It is within this unusual setting that Cole makes his grand entrance onto the stage, holding tightly and firmly to a monkey that has been skillfully crafted from painted cardboard. The elegantly arched corridors of the prestigious private school are beautifully adorned with a vibrant array of colorful drawings, interspersed with marked test papers. As they walk together down a silent, deserted hallway, Cole and Malcolm move side by side, their footsteps producing barely any sound at all as Malcolm deliberately takes his time. Approaching a set of doors located at the far end of the corridor, Malcolm experiences a sudden and startling realization—Cole is no longer by his side. He quickly turns around and finds Cole, who seems to be frozen in place about ten feet back. Malcolm slowly approaches him, gradually noticing the deeply unsettling expression on the boy's face as he draws nearer. Suspended from the wood-beamed ceiling are sturdy climbing ropes. Malcolm shifts his gaze to Cole, then refocuses his attention back on the ceiling. He becomes completely motionless, staring intently at the intricately designed wood beams and the dangling climbing ropes, alternating his focus back and forth between them and Cole. What Malcolm sees next is a child, with tears brimming in his eyes, looking at him with pure, unfiltered desperation, and Malcolm meets his gaze with his own expression of helplessness. In a haunting tableau that unfolds before him, a black man, wearing only britches and bearing a severely beaten face, is suspended in the center of the scene. To the right, a white woman clad in a tattered, frilly white dress, her face soaked with tears, is also hanging, and to the left is a small mixed-race child in half-worn pants, all of them staring intently, unwaveringly at Cole. Meanwhile, Lynn is occupied, fiddling with the dials as Cole stands before the worn twelve-inch kitchen TV. On the screen, Tommy Tammisimo is visible, standing in his pajamas within a doorway. Cole carefully, nearly reverently, removes the gloves from his hand, placing them beside his plate before moving them gently, almost tenderly, to the floor. This action irritates Lynn, for it touches a sensitive nerve between them. In the tense and charged atmosphere, Lynn and Cole eat their meal in silence. Cole lifts his gaze, wearing an anxious, almost pained expression, staring blankly ahead before eventually dropping his eyes to his lap. Observing her son with quiet concern, Lynn quietly folds her napkin, as Cole's eyes begin to fill with tears, simply staring at his mother's face. Without breaking the intense eye contact, Cole rises from his seat and exits the room, venturing into the shadowy hallway. He is suddenly startled by a noise as Sebastian, the puppy, rushes down the hall and scurries past Cole. As the puppy darts into the living room and finds a hiding place under a couch, Cole slowly turns back, casting a long, lingering look down the dimly lit hall. The door to Cole's room looms ominously at the end of the corridor, and he holds his breath, paralyzed with fear, unable to move. Meanwhile, back in the kitchen, Lynn is kneeling on the floor, earnestly trying to coax the puppy out of the broom closet. Struggling with her emotions, she eventually pulls the puppy close, embracing him tightly."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Tiny statues of saints are positioned to encircle the interior perimeter of the sanctuary, and as we observe this setup, we notice that the statue Cole had previously taken from the church is situated here, suggesting a certain familiarity and sentiment. This sanctuary is ingeniously crafted by an eight-year-old, acting as a personal haven for him to seek refuge within its modest confines. Amidst this imaginative world, some figures resemble villagers while others take on the guise of trees and animals, adding to the vivid tapestry of the child's creative enclave. Entering the scene, Cole steps onto the stage, gripping a painted cardboard monkey, blending seamlessly into the fantastical environment he has crafted. In a different setting, the arched hallways of the private school reveal their own character, with drawings and test papers conspicuously displayed along the walls, marking the path of academic and creative expression. Within this tranquil expanse, Cole and Malcolm find themselves walking side by side down the empty hall, their silence hanging gently in the air as Malcolm deliberately paces himself, absorbed in the quietude of the moment. Abruptly, Malcolm halts at a set of imposing doors at the far end of the hallway, instinctively realizing that Cole is no longer beside him; a sensation of absence prompts Malcolm to swivel around, only to discover Cole standing motionless approximately ten feet back, a statue of trepidation frozen in time. As Malcolm retraces his steps to reach Cole, he notices the child's expression, a melding of fear and yearning etched upon his young face. Above them, climbing ropes descend from the wood-beamed ceiling, drawing Malcolm's gaze upward in contemplation. His body becomes a study in stillness as he locks eyes with the beams and ropes, his consciousness briefly suspended between the rafters and Cole's anxiety-stricken gaze. As he turns to face Cole once more, he encounters a child with tears silently pooling in his eyes, an unspoken plea for solace and understanding. The silent exchange between them is profound, with Cole casting a desperate glance towards Malcolm, who, in return, bears the weight of helplessness on his shoulders. The scene shifts to a haunting tableau: a black man, his face battered and swollen, hangs centrally, bare-chested in his britches; to his right, a white woman, her delicate white dress torn and moisture streaking her cheeks, hangs forlornly, while to the left, a small mixed-race child in ragged half pants completes the portrait of familial tragedy, their collective gaze fixed on Cole, laden with an unspoken message. In a different environment, Lynn adjusts the dials with a precise touch, as Cole stands transfixed before a well-worn twelve-inch kitchen TV. The flickering screen broadcasts the image of Tommy Tammisimo, captured in his pajamas and standing framed within a doorway, a static figure in stark contrast to the tumult in Cole's reality. As Cole removes his gloves, first placing them beside his plate, then relocating them to the floor, his motions are both deliberate and distracted, hinting at the tension simmering beneath the surface. Lynn's irritation is palpable, for this moment mirrors a recurring point of contention between them, an unresolved friction bubbling to the fore. They eat in a shared quietude, with Cole frequently glancing upwards, anxiety shadowing his gaze as he momentarily locks eyes with Lynn, then retreats to the safety of observing his lap. Lynn's eyes remain fixed on Cole, her actions methodical as she quietly folds her napkin, her movements belying the concern welling up inside her as Cole’s eyes brim with unshed tears, his stare riveted by her expression. The poignancy of the moment reaches its zenith as Cole rises from his seat, his gaze never wavering from his mother's face, before he silently withdraws from the room, crossing into the shadows beyond and entering a darkened hallway. The sudden clatter of noise startles him, his pulse quickening as Sebastian, his puppy, streaks down the hall past him in a blur of energy, diving into the living room and vanishing beneath the couch. Cole's attention is momentarily captured by the puppy's antics before he slowly pivots back, his line of sight drawn inexorably toward the end of the hall. There, the door to his room looms, a threshold he finds himself suddenly too terrified to approach, as if even the act of breathing could summon the unknown lurking within. Simultaneously, in the kitchen, Lynn kneels on the floor, her efforts focused on coaxing the reluctant puppy out from the confines of the broom closet. As she struggles against the tide of her own emotions, tears threaten to spill over, but in reuniting with the puppy, she finds a brief, bittersweet comfort in enveloping him in an embrace."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The interior perimeter is lined with tiny statues of saints, including the one Cole stole from the church, creating a sanctuary built by an eight-year-old. Villagers, some dressed as trees and animals, surround a stage where Cole presents a painted cardboard monkey. Cole and Malcolm walk silently down an empty hall of the private school, lined with drawings and test papers, until Malcolm stops at a set of doors and realizes Cole is trailing behind. He returns to find Cole frozen in place, eyes filled with tears as he looks at the wood beams and climbing ropes suspended from the ceiling. Malcolm and Cole share a quiet, helpless moment before turning their gaze to a haunting vision of a beaten black man, a crying white woman in a torn dress, and their mixed-race child hanging in the room, staring at Cole. \n\nIn the kitchen, Lynn fiddles with the TV dials, while Cole stands before the screen, watching Tommy Tammisimo in pajamas. Cole removes his gloves, places them by his plate, and then on the floor, causing irritation for Lynn, hinting at tension between them. They eat in silence, Cole's anxious gaze shifting from Lynn to his lap. As Cole's eyes well up, he leaves the table, maintaining eye contact with his mother, and enters the dark hallway. Startled by noise, he sees Sebastian the puppy race past him into the living room. Cole turns back toward the hallway, paralyzed with fear as he stares at the door to his room. Meanwhile, Lynn kneels on the kitchen floor, trying to coax the puppy from the broom closet, fighting back tears before hugging him tightly."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Tiny statues of saints, often used in Catholic traditions to invoke protection and blessings, surround the interior perimeter, and we see that the statue Cole stole from the historic St. Patrick's Church is in here. This tent is a sanctuary made by an imaginative eight-year-old to hide in. Some are villagers from a medieval fantasy world, others are dressed as trees and animals from the nearby enchanted forest, and Cole comes on stage holding a painted cardboard monkey reminiscent of a character from the children's book series he loves. The arched halls of the prestigious private school, known for its academic excellence and alumni, are lined with posted drawings and test papers. Cole and Malcolm, a dedicated psychologist helping Cole with his issues, walk down an empty hall, continuing in silence, as Malcolm takes his time. Malcolm stops at a set of heavy oak doors at the end of the hall and realizes Cole is no longer next to him. Malcolm turns to find Cole frozen about ten feet back and walks to him, noticing Cole's expression as he gets closer. Climbing ropes, a staple in school gymnasiums used for physical education to build strength and coordination, hang from the wood-beamed ceiling, and Malcolm looks to Cole, then turns back to the ceiling. Malcolm's body becomes very still as he looks at the wood beams and climbing ropes, glancing at Cole, then turning back to him, finding the child with tears in his eyes. Cole looks at Malcolm desperately, and Malcolm stares helplessly. A black man in britches and no shirt, with his face beaten to a pulp, hangs in the center, a white woman in a torn white frilly dress reminiscent of a bygone era with tears soaking her face hangs to the right, and a small mixed-race child in half pants hangs to their left; the family stares at Cole. Lynn fiddles with the dials, trying to fix the reception, while Cole is standing before the beat-up twelve-inch kitchen TV, a relic from the 1980s with a crack in the corner. On the television screen is Tommy Tammisimo, the star of a popular children’s show, standing in his pajamas in a doorway. Cole removes the gloves from his hand and places them next to his plate, then moves them to the floor, a habit that frustrates Lynn as this is a sore point between them. Lynn and Cole eat quietly as Cole looks up with an anxious expression on his face, just staring, then looking down at his lap. Lynn stares at Cole, folding her napkin quietly, as Cole's eyes start to water up, just staring at his mother's expression. Cole gets up, never taking his eyes off his mother, and leaves the room, entering the dark hallway, where shadows from the nightlight dance on the walls. He gets startled by the sound, as Sebastian, his playful golden retriever puppy, comes racing down the hall and scurries past Cole. Cole watches his puppy dart into the living room and under a couch, then slowly turns back and looks down the hall. The door to Cole's room sits at the end of the corridor, and Cole stops breathing, too terrified to move, as if sensing something ominous. Meanwhile, Lynn is kneeling on the kitchen floor trying to coax the puppy out of the broom closet, fighting back some tears of frustration, and eventually hugs him, comforted by his calming presence."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Tiny statues of saints surround the interior perimeter and we see that the statue Cole stole from the church is in here. This tent is a sanctuary made by an eightyearold to hide in. Some are villagers others are dressed as trees and animals and Cole comes on stage holding a painted cardboard monkey. The arched halls of the private school are lined with posted drawings and test papers. Cole and Malcolm walk down an empty hall continuing in silence as Malcolm takes his time. Malcolm stops at a set of doors at the end of the hall and realizes Cole is no longer next to him. Malcolm turns to find Cole frozen about ten feet back and walks to him noticing Cole's expression as he gets closer. Climbing ropes hang from the woodbeamed ceiling and Malcolm looks to Cole then turns back to the ceiling. Malcolm's body becomes very still as he looks at the wood beams and climbing ropes glancing at Cole then turning back to him finding the child with tears in his eyes. Cole looks at Malcolm desperately and Malcolm stares helplessly. A black man in britches and no shirt with his face beaten to a pulp hangs in the center. a white woman in a torn white frilly dress with tears soaking her face hangs to the right and a small mixed race child in half pants hangs to their left. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. the family stares at Cole. Lynn fiddles with the dials while Cole is standing before the beatup twelveinch kitchen TV. On the television screen is Tommy Tammisimo standing in his pajamas in a doorway. Cole removes the gloves from his hand and places them next to his plate then moves them to the floor. Lynn is irritated as this is a sore point between them. Lynn and Cole eat quietly as Cole looks up with an anxious expression on his face just staring then looking down at his lap. Lynn stares at Cole folding her napkin quietly as Cole's eyes start to water up just staring at his mother's expression. Cole gets up never taking his eyes off his mother and leaves the room entering the dark hallway. He gets startled by the sound as Sebastian comes racing down the hall and scurries past Cole. Cole watches his puppy dart into the living room and under a couch then slowly turns back and looks down the hall. The door to Cole's room sits at the end of the corridor and Cole stops breathing too terrified to move. Meanwhile Lynn is kneeling on the kitchen floor trying to coax the puppy out of the broom closet fighting back some tears and eventually hugs him."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Tiny statues of saints surround the interior perimeter and we see that the statue Cole stole from the church is in here. This tent is a sanctuary made by an eightyearold to hide in. Some are villagers others are dressed as trees and animals and Cole comes on stage holding a painted cardboard monkey. The arched halls of the private school are lined with posted drawings and test papers. Cole and Malcolm walk down an empty hall continuing in silence as Malcolm takes his time. Malcolm stops at a set of doors at the end of the hall and realizes Cole is no longer next to him. Malcolm turns to find Cole frozen about ten feet back and walks to him noticing Cole's expression as he gets closer. Climbing ropes hang from the woodbeamed ceiling and Malcolm looks to Cole then turns back to the ceiling. Malcolm's body becomes very still as he looks at the wood beams and climbing ropes glancing at Cole then turning back to him finding the child with tears in his eyes. Cole looks at Malcolm desperately and Malcolm stares helplessly. A black man in britches and no shirt with his face beaten to a pulp hangs in the center. a white woman in a torn white frilly dress with tears soaking her face hangs to the right and a small mixed race child in half pants hangs to their left. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. the family stares at Cole. Lynn fiddles with the dials while Cole is standing before the beatup twelveinch kitchen TV. On the television screen is Tommy Tammisimo standing in his pajamas in a doorway. Cole removes the gloves from his hand and places them next to his plate then moves them to the floor. Lynn is irritated as this is a sore point between them. Lynn and Cole eat quietly as Cole looks up with an anxious expression on his face just staring then looking down at his lap. Lynn stares at Cole folding her napkin quietly as Cole's eyes start to water up just staring at his mother's expression. Cole gets up never taking his eyes off his mother and leaves the room entering the dark hallway. He gets startled by the sound as Sebastian comes racing down the hall and scurries past Cole. Cole watches his puppy dart into the living room and under a couch then slowly turns back and looks down the hall. The door to Cole's room sits at the end of the corridor and Cole stops breathing too terrified to move. Meanwhile Lynn is kneeling on the kitchen floor trying to coax the puppy out of the broom closet fighting back some tears and eventually hugs him."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Tiny statues of saints surround the interior perimeter and we see that the statue Cole stole from the church is in here. This tent is a sanctuary made by an eightyearold to hide in. Some are villagers others are dressed as trees and animals and Cole comes on stage holding a painted cardboard monkey. The arched halls of the private school are lined with posted drawings and test papers. Cole and Malcolm walk down an empty hall continuing in silence as Malcolm takes his time. Malcolm stops at a set of doors at the end of the hall and realizes Cole is no longer next to him. Lynn stares at Cole folding her napkin quietly as Cole's eyes start to water up just staring at his mother's expression. Cole gets up never taking his eyes off his mother and leaves the room entering the dark hallway. He gets startled by the sound as Sebastian comes racing down the hall and scurries past Cole. Cole watches his puppy dart into the living room and under a couch then slowly turns back and looks down the hall. The door to Cole's room sits at the end of the corridor and Cole stops breathing too terrified to move. Meanwhile Lynn is kneeling on the kitchen floor trying to coax the puppy out of the broom closet fighting back some tears and eventually hugs him."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Tiny statues of saints surround the interior perimeter and we see that the statue Cole stole from the church is in here. This tent is a sanctuary made by an eightyearold to hide in. Some are villagers others are dressed as trees and animals and Cole comes on stage holding a painted cardboard monkey. The door to Cole's room sits at the end of the corridor and Cole stops breathing too terrified to move. Meanwhile Lynn is kneeling on the kitchen floor trying to coax the puppy out of the broom closet fighting back some tears and eventually hugs him."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Tiny paintings of spirits surround the exterior boundary, and we see that the painting Max borrowed from the library is in here. This garage is an observatory made by a twelve-year-old to escape in. Some are bakers, others are dressed as flowers and insects, and Max arrives on stage holding a decorated wooden parrot. The straight corridors of the public hospital are lined with taped photographs and map posters. Max and Oliver stroll down a deserted corridor, continuing without a word, as Oliver bides his moment. Oliver halts at a pair of windows at the end of the walkway and realizes Max is no longer alongside him. Oliver pivots to find Max stationary about ten meters back and strides to him, observing Max's look as he approaches. Hanging lights dangle from the metal-tiled roof, and Oliver gazes at Max, then returns his gaze to the roof. Oliver's form becomes very rigid as he inspects the metal tiles and hanging lights, peeking at Max, then turning back to him, discovering the adolescent with droplets in his eyes. Max glances at Oliver pleadingly, and Oliver gazes helplessly. An elderly gentleman in overalls and no shoes, with his face bruised to a pulp, hovers in the middle, a young lady in a tattered pink ruffled skirt with tears drenching her cheeks hovers to the side, and a tiny blended ethnicity infant in torn trousers hovers to their right; the trio gazes at Max. Nora adjusts the levers, while Max is sitting in front of the cracked thirty-inch dining radio. On the radio speaker is Johnny Jamboree, lying in his robe in a corner. Max lifts the mittens from his foot and places them beside his cup, then transfers them to the chair. Nora is annoyed, as this is a tender issue between them. Nora and Max dine silently as Max glances up with a fearful look on his face, merely gazing, then lowering his gaze to his knees. Nora gazes at Max, crumpling her handkerchief quietly, as Max's vision begins to water, merely gazing at his parent's look. Max rises, never averting his gaze from his parent, and exits the space, entering the dim passageway. He is startled by the noise, as Lindsey comes sprinting down the passageway and rushes past Max. Max observes his kitten dash into the den and beneath a table, then cautiously rotates back and peers down the passageway. The window to Max's chamber rests at the end of the aisle, and Max ceases breathing, too frightened to act. Meanwhile, Nora is crouching on the dining floor attempting to lure the kitten out of the linen cupboard, holding back some sobs, and eventually embraces him."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Tiny statues of saints line the interior, revealing the statue Cole stole from the church. An eight-year-old has created this sanctuary to hide in, surrounded by villagers, trees, and animals. Cole appears holding a cardboard monkey. As Malcolm and Cole walk silently in a school's empty hall lined with drawings, Malcolm stops at the end and notices Cole frozen behind him. Approaching, he sees tears in Cole's eyes as Malcolm gazes up at the ceiling, noticing climbing ropes and a haunting scene of a beaten black man, a sobbing white woman, and a small mixed-race child hanging from wood beams, staring at Cole. In the kitchen, Cole and his mother Lynn eat quietly as tension builds between them. Cole, anxious, exchanges glances with Lynn before leaving the room. Startled by a noise, Cole watches his puppy run into the living room and then turns fearfully towards his room. Meanwhile, Lynn, kneeling on the kitchen floor, tries to coax the puppy from a broom closet and eventually hugs him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Meanwhile Lynn is kneeling on the kitchen floor trying to coax the puppy out of the broom closet fighting back some tears and eventually hugs him The door to Cole's room sits at the end of the corridor and Cole stops breathing too terrified to move Cole watches his puppy dart into the living room and under a couch then slowly turns back and looks down the hall He gets startled by the sound as Sebastian comes racing down the hall and scurries past Cole Cole gets up never taking his eyes off his mother and leaves the room entering the dark hallway Lynn stares at Cole folding her napkin quietly as Cole's eyes start to water up just staring at his mother's expression Lynn and Cole eat quietly as Cole looks up with an anxious expression on his face just staring then looking down at his lap Lynn is irritated as this is a sore point between them Cole removes the gloves from his hand and places them next to his plate then moves them to the floor On the television screen is Tommy Tammisimo standing in his pajamas in a doorway Lynn fiddles with the dials while Cole is standing before the beatup twelveinch kitchen TV the family stares at Cole a white woman in a torn white frilly dress with tears soaking her face hangs to the right and a small mixed race child in half pants hangs to their left A black man in britches and no shirt with his face beaten to a pulp hangs in the center Cole looks at Malcolm desperately and Malcolm stares helplessly Malcolm's body becomes very still as he looks at the wood beams and climbing ropes glancing at Cole then turning back to him finding the child with tears in his eyes Climbing ropes hang from the woodbeamed ceiling and Malcolm looks to Cole then turns back to the ceiling Malcolm turns to find Cole frozen about ten feet back and walks to him noticing Cole's expression as he gets closer Malcolm stops at a set of doors at the end of the hall and realizes Cole is no longer next to him Cole and Malcolm walk down an empty hall continuing in silence as Malcolm takes his time The arched halls of the private school are lined with posted drawings and test papers Some are villagers others are dressed as trees and animals and Cole comes on stage holding a painted cardboard monkey This tent is a sanctuary made by an eightyearold to hide in Tiny statues of saints surround the interior perimeter and we see that the statue Cole stole from the church is in here"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "This tent is a sanctuary made by an eightyearold to hide in Tiny statues of saints surround the interior perimeter and we see that the statue Cole stole from the church is in here The arched halls of the private school are lined with posted drawings and test papers Some are villagers others are dressed as trees and animals and Cole comes on stage holding a painted cardboard monkey Malcolm stops at a set of doors at the end of the hall and realizes Cole is no longer next to him Cole and Malcolm walk down an empty hall continuing in silence as Malcolm takes his time Climbing ropes hang from the woodbeamed ceiling and Malcolm looks to Cole then turns back to the ceiling Malcolm turns to find Cole frozen about ten feet back and walks to him noticing Cole's expression as he gets closer Cole looks at Malcolm desperately and Malcolm stares helplessly Malcolm's body becomes very still as he looks at the wood beams and climbing ropes glancing at Cole then turning back to him finding the child with tears in his eyes a white woman in a torn white frilly dress with tears soaking her face hangs to the right and a small mixed race child in half pants hangs to their left A black man in britches and no shirt with his face beaten to a pulp hangs in the center Lynn fiddles with the dials while Cole is standing before the beatup twelveinch kitchen TV the family stares at Cole Cole removes the gloves from his hand and places them next to his plate then moves them to the floor On the television screen is Tommy Tammisimo standing in his pajamas in a doorway Lynn and Cole eat quietly as Cole looks up with an anxious expression on his face just staring then looking down at his lap Lynn is irritated as this is a sore point between them Cole gets up never taking his eyes off his mother and leaves the room entering the dark hallway Lynn stares at Cole folding her napkin quietly as Cole's eyes start to water up just staring at his mother's expression Cole watches his puppy dart into the living room and under a couch then slowly turns back and looks down the hall He gets startled by the sound as Sebastian comes racing down the hall and scurries past Cole Meanwhile Lynn is kneeling on the kitchen floor trying to coax the puppy out of the broom closet fighting back some tears and eventually hugs him The door to Cole's room sits at the end of the corridor and Cole stops breathing too terrified to move"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "the family stares at Cole Lynn fiddles with the dials while Cole is standing before the beatup twelveinch kitchen TV On the television screen is Tommy Tammisimo standing in his pajamas in a doorway Cole removes the gloves from his hand and places them next to his plate then moves them to the floor Lynn is irritated as this is a sore point between them Lynn and Cole eat quietly as Cole looks up with an anxious expression on his face just staring then looking down at his lap Lynn stares at Cole folding her napkin quietly as Cole's eyes start to water up just staring at his mother's expression Cole gets up never taking his eyes off his mother and leaves the room entering the dark hallway He gets startled by the sound as Sebastian comes racing down the hall and scurries past Cole Cole watches his puppy dart into the living room and under a couch then slowly turns back and looks down the hall The door to Cole's room sits at the end of the corridor and Cole stops breathing too terrified to move Meanwhile Lynn is kneeling on the kitchen floor trying to coax the puppy out of the broom closet fighting back some tears and eventually hugs him Tiny statues of saints surround the interior perimeter and we see that the statue Cole stole from the church is in here This tent is a sanctuary made by an eightyearold to hide in Some are villagers others are dressed as trees and animals and Cole comes on stage holding a painted cardboard monkey The arched halls of the private school are lined with posted drawings and test papers Cole and Malcolm walk down an empty hall continuing in silence as Malcolm takes his time Malcolm stops at a set of doors at the end of the hall and realizes Cole is no longer next to him Malcolm turns to find Cole frozen about ten feet back and walks to him noticing Cole's expression as he gets closer Climbing ropes hang from the woodbeamed ceiling and Malcolm looks to Cole then turns back to the ceiling Malcolm's body becomes very still as he looks at the wood beams and climbing ropes glancing at Cole then turning back to him finding the child with tears in his eyes Cole looks at Malcolm desperately and Malcolm stares helplessly A black man in britches and no shirt with his face beaten to a pulp hangs in the center a white woman in a torn white frilly dress with tears soaking her face hangs to the right and a small mixed race child in half pants hangs to their left"
        }
      ]
    }
  ]
}