{
  "ground_truth": "He now looks around. Reggie's is the last such balcony on one side, but there are two or three on the other. Peter climbs over the railing and, holding on to it with one hand, reaches for the railing on the next balcony. As he stretches for the railing, it is several inches short of touching it. As he straightens up and prepares to jump. From the ground, Peter, high above, jumps to the next balcony. As he climbs over the railing of the second balcony, he sees a light coming through the window and looks in. From the ground, as Peter jumps to the next balcony. As he climbs over the rail to the third balcony, there is a light coming from this window, too. Peter looks in. Inside the room are Gideon, Tex, and Scobie in the midst of a heated discussion. Scobie turns and storms out of the door, slamming it. There is a knock at the door. Reggie unlocks the door and opens it. Peter enters and she closes the door again. Peter is silent for a moment. She falls in his arms to be comforted. He takes out his handkerchief and dries her eyes. The phone rings. Reggie answers it. Scobie holds the receiver in his metal hand. Reggie's back is turned to Peter so he can't see her face. He watches her. She shakes her head. He hangs up. Slowly, Reggie lowers the phone from her ear and hangs it up. She hesitates a moment. As Peter (now called Dyle) leaves Reggie's room and closes the door, he pauses for a moment, listening, hears nothing, then bends down and starts pulling at a loose thread in one of his socks. As usual, the thread unravels -- and unravels -- and unravels some more until it seems that the entire sock has come unknit. Now, taking the long thread, he bends down near the door and, taking his tie-pin, attaches one end of the thread to the bottom of Reggie's door. He then runs the thread along the floor to his door (next door) and works it underneath. Reggie is on the phone. Bartholomew is on the phone. He is silent for a moment, his face troubled. Bartholomew looks at her for a moment, then glances around; his attention is drawn inside the doorway. Almost as far as the eye can see, row upon row of beef sides, hung on hooks. As Reggie looks at the hanging beef. Reggie and Bartholomew sit at the table. Bartholomew pulls out a package and she takes one, looks at it and rips off the filter tip. He winces. She puts the other end in her mouth, then picks up the matches and lights it.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He presently gazes around. Reggie's is the final such terrace on one flank, but there are two or three on the opposite. Peter scales over the balustrade and, gripping it with one hand, reaches for the balustrade on the subsequent terrace. As he extends for the balustrade, it is several inches shy of reaching it. As he straightens up and prepares to leap. From the ground, Peter, high above, leaps to the subsequent terrace. As he clambers over the balustrade of the second terrace, he notices a glow emerging through the pane and glances in. From the ground, as Peter leaps to the subsequent terrace. As he clambers over the rail to the third terrace, there is a glow emanating from this pane, too. Peter glances in. Inside the chamber are Gideon, Tex, and Scobie in the middle of a fervent discussion. Scobie pivots and storms out of the portal, slamming it. There is a rap at the portal. Reggie unfastens the portal and opens it. Peter enters and she shuts the portal again. Peter is mute for a moment. She collapses in his embrace to be consoled. He removes his handkerchief and wipes her eyes. The telephone rings. Reggie responds to it. Scobie holds the receiver in his metallic hand. Reggie's back is turned to Peter so he cannot see her countenance. He observes her. She shakes her head. He hangs up. Gradually, Reggie lowers the telephone from her ear and hangs it up. She hesitates a moment. As Peter (now referred to as Dyle) exits Reggie's chamber and shuts the portal, he halts for a moment, listening, hears nothing, then bends down and begins tugging at a loose filament in one of his socks. As usual, the filament unravels -- and unravels -- and unravels some more until it seems that the entire sock has come undone. Now, taking the long filament, he bends down near the portal and, taking his tie-pin, affixes one end of the filament to the bottom of Reggie's portal. He then runs the filament along the floor to his portal (next door) and works it underneath. Reggie is on the telephone. Bartholomew is on the telephone. He is mute for a moment, his visage troubled. Bartholomew gazes at her for a moment, then glances around; his attention is drawn inside the entrance. Almost as far as the vision can see, row upon row of beef sides, suspended on hooks. As Reggie gazes at the suspended beef. Reggie and Bartholomew sit at the table. Bartholomew pulls out a parcel and she takes one, gazes at it and rips off the filter tip. He winces. She places the other end in her mouth, then picks up the matches and ignites it."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He is now looked around by himself. The last such balcony on one side is Reggie's, but on the other, two or three are there. The railing is climbed over by Peter, and, holding on to it with one hand, the railing on the next balcony is reached for by him. Several inches short of touching it, it is as the railing is stretched for by him. He straightens up and prepares to jump. From the ground, the next balcony is jumped to by Peter, high above. Over the railing of the second balcony, he climbs, and a light comes through the window and is looked in at by him. From the ground, the next balcony is jumped to by Peter. Over the rail to the third balcony he climbs, and from this window, too, a light is coming. In he looks. Inside the room are Gideon, Tex, and Scobie engaged in a heated discussion. The door is turned to and stormed out of by Scobie, it is slammed by him. A knock at the door is heard. The door is unlocked and opened by Reggie. Peter enters and the door is closed by her again. Silent for a moment, Peter is. In his arms, she falls to be comforted. A handkerchief is taken out by him and her eyes are dried with it. The phone is rung. It is answered by Reggie. The receiver is held by Scobie in his metal hand. Her back is turned to Peter, so her face is unseen by him. He watches her. Her head is shaken. The phone is hung up by him. Slowly, the phone is lowered from her ear and hung up by Reggie. A moment is hesitated by her. As Reggie's room is left by Peter (now called Dyle) and the door is closed by him, a pause is made for a moment, listening, nothing is heard, then down he bends and starts pulling at a loose thread in one of his socks. As usual, the thread unravels -- and unravels -- and unravels some more until it seems that the entire sock has been unknit. Now, the long thread is taken by him, and near the door, he bends down and, taking his tie-pin, to the bottom of Reggie's door one end of the thread is attached by him. Then the thread is run along the floor to his door (next door) and it is worked underneath by him. On the phone is Reggie. On the phone is Bartholomew. Silent for a moment, he is, his face troubled. At her, Bartholomew looks for a moment, then around he glances; inside the doorway, his attention is drawn. Almost as far as the eye can see, row upon row of beef sides are hung on hooks. At the hanging beef, Reggie looks. At the table, Reggie and Bartholomew sit. A package is pulled out by Bartholomew, and one is taken by her, looked at, and the filter tip is ripped off by her. He winces. The other end is put in her mouth by her, then the matches are picked up and it is lit by her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Peter surveys the scene. Reggie's balcony is the last on one side, with two or three on the other. He climbs the railing, reaching for the next balcony's railing, but it is just out of reach. Undeterred, he jumps to the second balcony. Spotting light through a window, he peers inside. Moving to the third balcony, he again sees light and looks in on Gideon, Tex, and Scobie engaged in a heated argument. Scobie storms out, slamming the door. There's a knock, and Reggie opens it for Peter. She falls into his arms, and he comforts her, drying her tears. The phone rings, and Reggie answers as Scobie listens on the other end. Peter watches her, unable to see her expression. She shakes her head, hangs up, and hesitates. As Peter, now called Dyle, leaves, he pauses, listens, and then pulls a thread from his sock, unraveling it. He ties one end to Reggie's door and runs it to his own. Meanwhile, Reggie speaks on the phone with Bartholomew, who is silent and troubled. Bartholomew's attention shifts to rows of hanging beef nearby. Sitting at the table, he offers her a package. She removes and lights one, discarding the filter tip, as he winces."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Peter surveys the area; Reggie's is the last balcony on one side, with two or three on the other. He climbs over the railing, trying to reach the next one, but it's out of reach. Peter jumps to the next balcony, sees a light, and looks in. Inside, Gideon, Tex, and Scobie argue; Scobie storms out. Reggie opens the door for Peter, and they comfort each other. The phone rings; Reggie answers while Peter watches. She shakes her head and hangs up. Dyle (Peter) leaves, listens, then pulls a loose thread from his sock and uses his tie-pin to secure it at Reggie's door, running it to his room. Reggie and Bartholomew, both on phones, catch sight of hanging beef. Bartholomew offers a package to Reggie; she removes the filter tip, lights it, and he winces."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He now takes a moment to look around his surroundings. Reggie's is the very last balcony on one side, while on the opposite side, there are two or three balconies visible. Peter, showing great agility, climbs over the railing and, with a firm grip using one hand, he stretches out to reach for the railing on the adjacent balcony. As he extends his arm towards the railing, he notes it is just several inches shy of his fingertips. He then straightens himself up, taking a moment to prepare mentally and physically, before making the jump. From the ground far below, Peter, perched high above, executes a leap to the next balcony. Once there, he climbs over the railing of this second balcony and notices a light glowing from the window, prompting him to peer inside. Again, from the ground's perspective, we see Peter leap to yet another balcony. Climbing over the rail of the third balcony, he observes that a light is emanating from this window as well. Peter takes another look inside. Within the confines of the room are Gideon, Tex, and Scobie, all engaged in the middle of a rather heated discussion. Scobie abruptly turns and storms out, forcefully slamming the door behind him. There is a subsequent knock at the door, prompting Reggie to unlock it and open it wide. Peter enters, and she promptly closes the door behind him. Peter takes a moment of silence. Reggie, seeking solace, falls into his arms for comfort. In response, he gently takes out his handkerchief and tenderly dries her eyes. Suddenly, the phone rings. Reggie answers it with urgency. On the other end, Scobie is holding the receiver in his metallic hand. With her back turned to Peter, Reggie's facial expressions remain obscured from his view. He watches her intently. She indicates disapproval by shaking her head. He then hangs up. Slowly and deliberately, Reggie lowers the phone from her ear and carefully places it back on the receiver. She hesitates momentarily. As he, now known as Dyle, exits Reggie's room and quietly shuts the door, he pauses momentarily, straining his ears to listen, only to hear nothing. He then bends down and begins to tug at a loose thread in one of his socks. Unsurprisingly, the thread unravels endlessly, continuing to unravel until it seems the entire sock is left in a tangled mess. Now, taking hold of the lengthy thread, he crouches down near the door, and using his tie-pin, secures one end of the thread firmly to the bottom of Reggie's door. He then carefully runs the thread along the floor all the way to his own door, adjacent to hers, and works it underneath. Meanwhile, Reggie is on the phone. Bartholomew is also on the phone. He remains silent for a brief moment, his face reflecting a troubled expression. Bartholomew gazes at her momentarily, then shifts his focus, scanning the surroundings; his attention is drawn inward, towards the doorway. As far as the eye can see, row upon row of beef sides hang suspended from hooks. Reggie observes the hanging beef in contemplation. Both Reggie and Bartholomew take seats at the table. Bartholomew produces a package, and she accepts one from it, inspects it, and promptly rips off the filter tip, causing him to wince in reaction. She places the other end in her mouth, then picks up a matchstick and proceeds to light it."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He pauses for a brief moment, allowing himself to take in and contemplate his surrounding environment. Reggie's balcony is positioned as the very last one on one side of the building, while across from it, there are two or three balconies that are visible. Exhibiting remarkable agility and skill, Peter climbs over the railing. With a firm and steady grip using one hand, he stretches out, reaching towards the railing of the neighboring balcony. As he extends his arm, he notes that the railing is just several inches away from the reach of his fingertips. He takes a moment to straighten himself, mentally and physically preparing himself for the leap he is about to make. Far below on the ground, observers can watch as Peter, perched high above, executes a daring leap to the next balcony. Once he successfully makes it there, he climbs over the railing of this second balcony and notices a light glowing from the window, prompting him to peer inside curiously. From the perspective of the ground again, we see Peter make another leap to yet another balcony. Once more, climbing over the railing of the third balcony, he observes that a light is emanating from this window as well. Peter looks inside once again. Within the confines of the room, Gideon, Tex, and Scobie are all present, deeply engaged in the midst of a rather heated and animated discussion. Suddenly, Scobie turns abruptly and storms out, leaving behind him a resonating slam of the door. Shortly after, there is a knock at the door, causing Reggie to unlock and open it wide. Peter enters, and she promptly closes the door behind him with a sense of urgency. Peter stands silent for a moment, allowing the quiet to envelop him. Seeking solace and comfort, Reggie falls into his arms. In response, he gently retrieves his handkerchief from his pocket and tenderly dries her eyes. Abruptly, the phone rings, breaking the silence. Reggie answers it with urgency. On the other end, Scobie holds the receiver firmly in his metallic hand. With her back turned to Peter, Reggie's facial expressions remain obscured from his view, yet he watches her intently. She shakes her head, indicating disapproval. Scobie then hangs up. Slowly and deliberately, Reggie lowers the phone from her ear, carefully placing it back on the receiver. She hesitates for a brief moment. Now identified as Dyle, he exits Reggie's room, gently closing the door behind him. He pauses momentarily, straining his ears in an attempt to listen, only to hear nothing at all. He then bends down and begins to tug at a loose thread in one of his socks. Unsurprisingly, the thread unravels endlessly, continuing to unravel until it seems the entire sock is left in a tangled mess. Taking hold of the lengthy thread, he crouches down near the door, and using his tie-pin, secures one end of the thread firmly to the bottom of Reggie's door. He then carefully runs the thread along the floor, guiding it all the way to his own door, adjacent to hers, and works it underneath. Meanwhile, Reggie is on the phone, and Bartholomew also finds himself on the phone. He remains silent for a brief moment, his face reflecting a troubled expression. Bartholomew gazes at her momentarily, then shifts his focus, scanning the surroundings; his attention is drawn inward, towards the doorway. As far as the eye can see, row upon row of beef sides hang suspended from hooks. Reggie observes the hanging beef in contemplation, her mind seemingly lost in thought. Both Reggie and Bartholomew take seats at the table. Bartholomew produces a package, and she accepts one from it, inspects it closely, and promptly rips off the filter tip, causing him to wince in reaction to her abruptness. She places the other end in her mouth, then picks up a matchstick and proceeds to light it, the flame flickering in the dim light."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He now looks around, scanning the surroundings with keen eyes. Reggie's balcony is the last one on its side, but a couple more are visible on the opposite side. Peter carefully climbs over the sturdy railing, grasping it securely with one hand for balance. He extends his arm, reaching toward the next balcony's railing. As he stretches to his full reach, he finds that his fingers fall several inches short of making contact. Undeterred, he straightens up his posture, steadies himself, and prepares mentally to leap across the gap. From the ground, onlookers witness Peter, high above, as he gathers his courage and jumps to the next balcony. Upon landing, he swiftly climbs over this second balcony's railing. As he does so, a soft glow catches his eye—a light emanates from the window, drawing his curiosity, so he peers inside. Meanwhile, from the ground below, Peter is already in motion, making another daring leap to the next balcony. He hoists himself over the rail to the third balcony, where the light from the window again piques his interest. Looking in, he observes Gideon, Tex, and Scobie engaged in a tense and animated discussion. The scene escalates as Scobie, clearly frustrated, turns abruptly and storms out through the door, punctuating his departure with a slam. Soon after, a knock resonates at the door. Reggie approaches, unlocks, and opens it to allow Peter entry, then closes it behind him. For a brief moment, an air of silence envelops them. She seeks solace in his arms, leaning into him for comfort. With a gentle gesture, he retrieves his handkerchief and delicately wipes the tears from her eyes. Suddenly, the phone disrupts the quiet. Reggie moves to answer it, while Scobie grips the receiver in his metal hand. With her back turned to Peter, he is unable to see her face, yet he intently watches her reactions. She gives a slight shake of her head before Scobie hangs up. Slowly, Reggie lowers the handset from her ear and places it back on the cradle with a hint of hesitation. As Peter, referred to now as Dyle, leaves Reggie's room, he closes the door with care and pauses momentarily, listening attentively for any sound. Hearing nothing, he bends down to inspect his sock, noticing a loose thread. He begins to pull at it, watching as it unravels relentlessly—spooling further and further until it seems the entire sock has come undone. Using the long thread, he crouches by Reggie's door and, employing his tie-pin, securely attaches one end of the thread to the base of the door. He then guides the thread along the floor to the adjacent room door, working it underneath carefully. Meanwhile, Reggie is on another phone call. Bartholomew, on the line with her, falls silent, his face shadowed with a look of trouble. He gazes at her momentarily, then averts his eyes, scanning the room until his attention is captured by something within the doorway. What unfolds before them is an expanse filled with row after row of beef sides, each one hanging from hooks, extending almost as far as the eye can see. As Reggie processes the sight of the hanging beef, she and Bartholomew find themselves seated at a table. Bartholomew retrieves a package, offering it to her. She takes one item, examines it briefly, and tears off the filter tip with a decisive motion. His expression reveals a wince of discomfort. Undisturbed, she places the other end in her mouth, then strikes a match and lights it, indulging in a moment of quiet contemplation."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Peter surveys the surroundings, noting Reggie's balcony as the last on one side, with two or three on the opposite side. He climbs over the railing, attempting to reach the next balcony's railing but finds it just out of reach. Undeterred, he prepares and successfully jumps to the adjacent balcony. Upon climbing over the second balcony's railing, he peers through the window, noticing a light and a heated discussion between Gideon, Tex, and Scobie, who abruptly storms out. A knock on Reggie's door prompts her to unlock it, allowing Peter to enter. After a moment of silence, Reggie seeks comfort in his arms, and he gently dries her tears with a handkerchief. \n\nWhen the phone rings, Reggie answers it while Peter observes her reaction as she listens to Scobie on the other line, shaking her head before hanging up. As Peter, also known as Dyle, exits Reggie's room, he pauses outside her door, listening briefly before distracting himself by unraveling a thread from his sock. The thread continues to unravel, and he uses it to set a trap, securing one end with a tie-pin to the bottom of Reggie's door and running it to his adjacent room. Meanwhile, Reggie is on the phone with Bartholomew, both momentarily silent with troubled expressions. As Bartholomew glances around, his attention is drawn to rows of beef hanging inside the doorway. They sit at a table where Bartholomew offers a package to Reggie. She removes a filter tip from one, lights it with a match, causing Bartholomew to wince slightly."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He now looks around. Reggie's, a popular café renowned for its unique blend of classical and modern architecture, is the last such balcony on one side, but there are two or three on the other. Peter, known for his agile skills honed from years of climbing tours in the Swiss Alps, climbs over the railing and, holding on to it with one hand, reaches for the railing on the next balcony. As he stretches for the railing, it is several inches short of touching it. As he straightens up and prepares to jump. From the ground, Peter, high above in the Parisian skyline, jumps to the next balcony. As he climbs over the railing of the second balcony, he sees a light, reminiscent of the warm glow of vintage streetlamps, coming through the window and looks in. From the ground, as Peter jumps to the next balcony. As he climbs over the rail to the third balcony, there is a light coming from this window, too. Peter looks in. Inside the room are Gideon, Tex, and Scobie, three members of an underground network involved in secretive exchanges, in the midst of a heated discussion. Scobie, whose temper was as infamous as his knack for solving puzzles, turns and storms out of the door, slamming it. There is a knock at the door. Reggie, known for her calm demeanor in the face of chaos, unlocks the door and opens it. Peter enters and she closes the door again. Peter is silent for a moment. She, overwhelmed by recent events, falls in his arms to be comforted. He, ever the gentleman, takes out his handkerchief and dries her eyes. The phone rings. Reggie answers it. Scobie, notorious for his metallic prosthetic hand that he acquired during a past altercation, holds the receiver. Reggie's back is turned to Peter so he can't see her face. He watches her. She shakes her head. He hangs up. Slowly, Reggie lowers the phone from her ear and hangs it up. She hesitates a moment. As Peter, now revealing his true identity as Dyle, leaves Reggie's room and closes the door, he pauses for a moment, listening, hears nothing, then bends down and starts pulling at a loose thread in one of his socks. As usual, the thread unravels -- and unravels -- and unravels some more until it seems that the entire sock has come unknit. Now, taking the long thread, he bends down near the door and, taking his tie-pin, a family heirloom passed down through generations, attaches one end of the thread to the bottom of Reggie's door. He then runs the thread along the floor to his door next door and works it underneath. Reggie is on the phone. Bartholomew, known for his inscrutable nature as an undercover agent, is on the phone. He is silent for a moment, his face troubled by the implications of their conversation. Bartholomew looks at her for a moment, then glances around; his attention is drawn inside the doorway. Almost as far as the eye can see, row upon row of beef sides, hung on hooks, reveal the room's previous use as a meat storage facility. As Reggie looks at the hanging beef. Reggie and Bartholomew sit at the table. Bartholomew pulls out a package and she takes one, looks at it and rips off the filter tip, echoing the rebellious spirit of the 1960s. He winces. She puts the other end in her mouth, then picks up the matches and lights it, the flame flickering in the dim room like a small beacon."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Reggie is on the phone He now looks around Reggie's is the last such balcony on one side but there are two or three on the other Peter climbs over the railing and holding on to it with one hand reaches for the railing on the next balcony As he stretches for the railing it is several inches short of touching it As he straightens up and prepares to jump From the ground Peter high above jumps to the next balcony As he climbs over the railing of the second balcony he sees a light coming through the window and looks in From the ground as Peter jumps to the next balcony Peter is silent for a moment As he climbs over the rail to the third balcony there is a light coming from this window too he pauses for a moment listening hears nothing then bends down and starts pulling at a loose thread in one of his socks Reggie answers it Peter climbs over the railing and holding on to it with one hand reaches for the railing on the next balcony Peter looks in Reggie and Bartholomew sit at the table The phone rings Inside the room are Gideon Tex and Scobie in the midst of a heated discussion Scobie turns and storms out of the door slamming it There is a knock at the door She falls in his arms to be comforted He winces Reggie unlocks the door and opens it Peter enters and she closes the door again As he climbs over the rail to the third balcony there is a light coming from this window too Peter is silent for a moment Bartholomew looks at her for a moment then glances around She falls in his arms to be comforted He takes out his handkerchief and dries her eyes The phone rings Reggie answers it Scobie holds the receiver in his metal hand Reggie's back is turned to Peter so he cannot see her face Bartholomew is on the phone He watches her She shakes her head He hangs up Reggie's is the last such balcony on one side but there are two or three on the other Peter enters and she closes the door again Slowly Reggie lowers the phone from her ear and hangs it up She hesitates a moment As Peter now called Dyle leaves Reggie's room and closes the door he pauses for a moment listening hears nothing then bends down and starts pulling at a loose thread in one of his socks As usual the thread unravels  and unravels  and unravels some more until it seems that the entire sock has come unknit He now looks around Now taking the long thread he bends down near the door and taking his tiepin attaches one end of the thread to the bottom of Reggie's door He then runs the thread along the floor to his door next door and works it underneath Reggie's back is turned to Peter so he cannot see her face Reggie unlocks the door and opens it From the ground as Peter jumps to the next balcony Reggie is on the phone Bartholomew is on the phone Bartholomew pulls out a package and she takes one looks at it and rips off the filter tip He is silent for a moment his face troubled Bartholomew looks at her for a moment then glances around his attention is drawn inside the doorway Almost as far as the eye can see row upon row of beef sides hung on hooks As Reggie looks at the hanging beef From the ground Peter high above jumps to the next balcony Reggie and Bartholomew sit at the table Bartholomew pulls out a package and she takes one looks at it and rips off the filter tip Reggie lowers the phone from her ear and hangs it up He winces As Reggie looks at the hanging beef As he climbs over the railing of the second balcony he sees a light coming through the window and looks in She puts the other end in her mouth then picks up the matches and lights it"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He now looks around. Reggie's is the last such balcony on one side but there are two or three on the other. Peter climbs over the railing and holding on to it with one hand reaches for the railing on the next balcony. As he stretches for the railing it is several inches short of touching it. As he straightens up and prepares to jump. From the ground Peter high above jumps to the next balcony. As he climbs over the railing of the second balcony he sees a light coming through the window and looks in. From the ground as Peter jumps to the next balcony. As he climbs over the rail to the third balcony there is a light coming from this window too. Peter looks in. Inside the room are Gideon Tex and Scobie. in the midst of a heated discussion. Scobie turns and storms out of the door slamming it. There is a knock at the door. Reggie unlocks the door and opens it. Peter enters and she closes the door again. Peter is silent for a moment. She falls in his arms to be comforted. He takes out his handkerchief and dries her eyes. The phone rings. Reggie answers it. Scobie holds the receiver in his metal hand. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. Reggie's back is turned to Peter so he cannot see her face. He watches her. She shakes her head. He hangs up. Slowly. Reggie lowers the phone from her ear and hangs it up. She hesitates a moment. As Peter now called Dyle leaves Reggie's room and closes the door. he pauses for a moment listening hears nothing then bends down and starts pulling at a loose thread in one of his socks. As usual the thread unravels  and unravels  and unravels some more until it seems that the entire sock has come unknit. Now taking the long thread he bends down near the door and taking his tiepin attaches one end of the thread to the bottom of Reggie's door. He then runs the thread along the floor to his door next door and works it underneath. Reggie is on the phone. Bartholomew is on the phone. He is silent for a moment his face troubled. Bartholomew looks at her for a moment then glances around. his attention is drawn inside the doorway. Almost as far as the eye can see row upon row of beef sides hung on hooks. As Reggie looks at the hanging beef. Reggie and Bartholomew sit at the table. Bartholomew pulls out a package and she takes one looks at it and rips off the filter tip. He winces. She puts the other end in her mouth then picks up the matches and lights it."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He now looks around. Reggie's is the last such balcony on one side but there are two or three on the other. Peter climbs over the railing and holding on to it with one hand reaches for the railing on the next balcony. As he stretches for the railing it is several inches short of touching it. As he straightens up and prepares to jump. From the ground Peter high above jumps to the next balcony. As he climbs over the railing of the second balcony he sees a light coming through the window and looks in. From the ground as Peter jumps to the next balcony. As he climbs over the rail to the third balcony there is a light coming from this window too. Peter looks in. Inside the room are Gideon Tex and Scobie. in the midst of a heated discussion. Scobie turns and storms out of the door slamming it. There is a knock at the door. Reggie unlocks the door and opens it. Peter enters and she closes the door again. Peter is silent for a moment. She falls in his arms to be comforted. He takes out his handkerchief and dries her eyes. The phone rings. Reggie answers it. Scobie holds the receiver in his metal hand. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Reggie's back is turned to Peter so he cannot see her face. He watches her. She shakes her head. He hangs up. Slowly. Reggie lowers the phone from her ear and hangs it up. She hesitates a moment. As Peter now called Dyle leaves Reggie's room and closes the door. he pauses for a moment listening hears nothing then bends down and starts pulling at a loose thread in one of his socks. As usual the thread unravels  and unravels  and unravels some more until it seems that the entire sock has come unknit. Now taking the long thread he bends down near the door and taking his tiepin attaches one end of the thread to the bottom of Reggie's door. He then runs the thread along the floor to his door next door and works it underneath. Reggie is on the phone. Bartholomew is on the phone. He is silent for a moment his face troubled. Bartholomew looks at her for a moment then glances around. his attention is drawn inside the doorway. Almost as far as the eye can see row upon row of beef sides hung on hooks. As Reggie looks at the hanging beef. Reggie and Bartholomew sit at the table. Bartholomew pulls out a package and she takes one looks at it and rips off the filter tip. He winces. She puts the other end in her mouth then picks up the matches and lights it."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He now looks around. Reggie's is the last such balcony on one side but there are two or three on the other. Peter climbs over the railing and holding on to it with one hand reaches for the railing on the next balcony. As he stretches for the railing it is several inches short of touching it. As he straightens up and prepares to jump. From the ground Peter high above jumps to the next balcony. As he climbs over the railing of the second balcony he sees a light coming through the window and looks in. From the ground as Peter jumps to the next balcony. As he climbs over the rail to the third balcony there is a light coming from this window too. Peter looks in. Inside the room are Gideon Tex and Scobie. He then runs the thread along the floor to his door next door and works it underneath. Reggie is on the phone. Bartholomew is on the phone. He is silent for a moment his face troubled. Bartholomew looks at her for a moment then glances around. his attention is drawn inside the doorway. Almost as far as the eye can see row upon row of beef sides hung on hooks. As Reggie looks at the hanging beef. Reggie and Bartholomew sit at the table. Bartholomew pulls out a package and she takes one looks at it and rips off the filter tip. He winces. She puts the other end in her mouth then picks up the matches and lights it."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He now looks around. Reggie's is the last such balcony on one side but there are two or three on the other. Peter climbs over the railing and holding on to it with one hand reaches for the railing on the next balcony. As he stretches for the railing it is several inches short of touching it. As Reggie looks at the hanging beef. Reggie and Bartholomew sit at the table. Bartholomew pulls out a package and she takes one looks at it and rips off the filter tip. He winces. She puts the other end in her mouth then picks up the matches and lights it."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "She now looks around. The raccoon's is the last such balcony on one side, but there are two or three on the other. A squirrel climbs over the railing and, holding on to it with one hand, reaches for the railing on the next balcony. As the squirrel stretches for the railing, it is several inches short of touching it. As the squirrel straightens up and prepares to jump. From the ground, the squirrel, high above, jumps to the next balcony. As the squirrel climbs over the railing of the second balcony, the squirrel sees a light coming through the window and looks in. From the ground, as the squirrel jumps to the next balcony. As the squirrel climbs over the rail to the third balcony, there is a light coming from this window, too. The squirrel looks in. Inside the room are a giraffe, an owl, and a penguin in the midst of a heated discussion. The penguin turns and storms out of the door, slamming it. There is a knock at the door. The elk unlocks the door and opens it. The squirrel enters and the elk closes the door again. The squirrel is silent for a moment. The elk falls in the squirrel’s arms to be comforted. The squirrel takes out a handkerchief and dries the elk’s eyes. The phone rings. The elk answers it. The penguin holds the receiver in its metal hand. The elk’s back is turned to the squirrel so the squirrel can't see the elk’s face. The squirrel watches the elk. The elk shakes its head. The penguin hangs up. Slowly, the elk lowers the phone from its ear and hangs it up. The elk hesitates a moment. As the squirrel (now called the otter) leaves the elk’s room and closes the door, the otter pauses for a moment, listening, hears nothing, then bends down and starts pulling at a loose thread in one of its socks. As usual, the thread unravels -- and unravels -- and unravels some more until it seems that the entire sock has come unknit. Now, taking the long thread, the otter bends down near the door and, taking its tie-pin, attaches one end of the thread to the bottom of the elk’s door. The otter then runs the thread along the floor to its door (next door) and works it underneath. The elk is on the phone. A koala is on the phone. The koala is silent for a moment, its face troubled. The koala looks at the elk for a moment, then glances around; its attention is drawn inside the doorway. Almost as far as the eye can see, row upon row of beef sides, hung on hooks. As the elk looks at the hanging beef. The elk and the koala sit at the table. The koala pulls out a package and the elk takes one, looks at it and rips off the filter tip. The koala winces. The elk puts the other end in its mouth, then picks up the matches and lights it."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He now looks around. Reggie's is the last such treehouse on one side, but there are two or three on the other. Peter climbs over the hammock and, holding on to it with one hand, reaches for the hammock on the next treehouse. As he stretches for the hammock, it is several inches short of touching it. As he straightens up and prepares to jump. From the garden, Peter, high above, jumps to the next treehouse. As he climbs over the hammock of the second treehouse, he sees a candle coming through the curtains and looks in. From the garden, as Peter jumps to the next treehouse. As he climbs over the hammock to the third treehouse, there is a candle coming from this curtain, too. Peter looks in. Inside the room are Gideon, Tex, and Scobie in the midst of a heated discussion. Scobie turns and storms out of the tunnel, slamming it. There is a knock at the tunnel. Reggie unlocks the tunnel and opens it. Peter enters and she closes the tunnel again. Peter is silent for a moment. She falls in his arms to be comforted. He takes out his bandana and dries her eyes. The doorbell rings. Reggie answers it. Scobie holds the receiver in his plastic hand. Reggie's back is turned to Peter so he can't see her face. He watches her. She shakes her head. He hangs up. Slowly, Reggie lowers the doorbell from her ear and hangs it up. She hesitates a moment. As Peter (now called Dyle) leaves Reggie's cave and closes the tunnel, he pauses for a moment, listening, hears nothing, then bends down and starts pulling at a loose thread in one of his gloves. As usual, the thread unravels -- and unravels -- and unravels some more until it seems that the entire glove has come unknit. Now, taking the long thread, he bends down near the tunnel and, taking his earring, attaches one end of the thread to the bottom of Reggie's tunnel. He then runs the thread along the grass to his tunnel (next tunnel) and works it underneath. Reggie is on the doorbell. Bartholomew is on the doorbell. He is silent for a moment, his face troubled. Bartholomew looks at her for a moment, then glances around; his attention is drawn inside the gate. Almost as far as the eye can see, row upon row of cheese wheels, hung on chains. As Reggie looks at the hanging cheese. Reggie and Bartholomew sit at the bench. Bartholomew pulls out a box and she takes one, looks at it and rips off the wrapper. He winces. She puts the other end in her mouth, then picks up the lighter and lights it."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He now glances around. Reggie's is the last such balcony on one side, but there are two or three on the other. Peter flips over the railing and, holding on to it with one hand, gestures toward the railing on the next balcony. As he waves for the railing, it is several inches short of grabbing it. As he crouches and prepares to leap. From the ground, Peter, high above, glides to the next balcony. As he hops over the railing of the second balcony, he notices a light coming through the window and peers in. From the ground, as Peter leaps to the next balcony. As he hops over the rail to the third balcony, there is a light emanating from this window, too. Peter peers in. Inside the room are Gideon, Tex, and Scobie engaged in a heated argument. Scobie pivots and rushes out of the door, banging it. There is a tap at the door. Reggie unlatches the door and swings it open. Peter steps in and she shuts the door again. Peter is quiet for a moment. She collapses in his arms to be reassured. He pulls out his handkerchief and pats her eyes. The phone buzzes. Reggie picks it up. Scobie grips the receiver in his metal hand. Reggie's back is facing Peter so he can't see her expression. He observes her. She nods her head. He disconnects. Slowly, Reggie lowers the phone from her ear and places it on the cradle. She pauses a moment. As Peter (now called Dyle) exits Reggie's room and shuts the door, he halts for a moment, listening, hears nothing, then squats down and starts tugging at a loose lace in one of his shoes. As usual, the lace uncoils -- and uncoils -- and uncoils some more until it seems that the entire shoe has come unlaced. Now, taking the long lace, he squats down near the door and, taking his tie-pin, fastens one end of the lace to the bottom of Reggie's door. He then stretches the lace along the floor to his door (next door) and threads it underneath. Reggie is on the phone. Bartholomew is on the phone. He is quiet for a moment, his face pensive. Bartholomew observes her for a moment, then scans the surroundings; his gaze is drawn inside the doorway. Almost as far as the eye can see, row upon row of mannequins, posed on stands. As Reggie surveys the posed figures. Reggie and Bartholomew sit at the table. Bartholomew extracts a package and she takes one, examines it and tears off the wrapper. He grimaces. She places the other end in her mouth, then grabs the matches and ignites it."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "He now looks around. Marvin's is the last such doormat on one side, but there are two or three on the other. Clarissa climbs over the swing and, holding on to it with one hand, reaches for the swing on the next doormat. As she stretches for the swing, it is several inches short of touching it. As she straightens up and prepares to jump. From the aquarium, Clarissa, high above, jumps to the next doormat. As she climbs over the swing of the second doormat, she sees a fan coming through the ceiling and looks in. From the aquarium, as Clarissa jumps to the next doormat. As she climbs over the swing to the third doormat, there is a fan coming from this ceiling, too. Clarissa looks in. Inside the closet are Warren, Jace, and Lola in the midst of a heated discussion. Lola turns and storms out of the hallway, slamming it. There is a knock at the hallway. Marvin unlocks the hallway and opens it. Clarissa enters and he closes the hallway again. Clarissa is silent for a moment. He falls in her arms to be comforted. She takes out her glove and dries his eyes. The clock rings. Marvin answers it. Lola holds the mug in her plastic hand. Marvin's back is turned to Clarissa so he can't see his face. She watches him. He shakes his head. She hangs up. Slowly, Marvin lowers the clock from his ear and hangs it up. He hesitates a moment. As Clarissa (now called Niles) leaves Marvin’s closet and closes the hallway, she pauses for a moment, listening, hears nothing, then bends down and starts pulling at a loose twig in one of her gloves. As usual, the twig unravels -- and unravels -- and unravels some more until it seems that the entire glove has come unknit. Now, taking the long twig, she bends down near the hallway and, taking her bracelet, attaches one end of the twig to the bottom of Marvin’s hallway. She then runs the twig along the ceiling to her hallway (next hallway) and works it underneath. Marvin is on the clock. Chester is on the clock. She is silent for a moment, her eye troubled. Chester looks at him for a moment, then glances around; his attention is drawn inside the window. Almost as far as the toe can see, row upon row of shoe laces, hung on shelves. As Marvin looks at the hanging shoe laces. Marvin and Chester sit at the bench. Chester pulls out a cushion and he takes one, looks at it and rips off the bookmark. He winces. He puts the other end in his ear, then picks up the pencils and lights it."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "She now wanders around. Geraldine's is the first such treehouse on one side, but there are two or three on the other. Martin swings over the branch and, gripping it with one hand, lunges for the branch on the next treehouse. As she reaches for the branch, it is several inches short of grasping it. As she crouches down and prepares to leap. From the ground, Martin, high above, swings to the next treehouse. As she swings over the branch of the second treehouse, she notices a light spilling through the window and peers inside. From the ground, as Martin swings to the next treehouse. As she swings over the branch to the third treehouse, there is a light spilling from this window, too. Martin peers inside. Inside the room are Felix, Sam, and Connie in the midst of a lively debate. Connie turns and rushes out of the exit, shutting it loudly. There is a tap at the exit. Geraldine unbolts the exit and opens it. Martin enters and she swings the exit closed again. Martin is quiet for a moment. She falls into his embrace to be comforted. He removes his scarf and dries her tears. The bell rings. Geraldine responds to it. Connie grips the receiver in her velvet hand. Geraldine's back is turned to Martin so he can't see her expression. He observes her. She nods. He disconnects. Slowly, Geraldine lowers the phone from her ear and disconnects it. She halts for a moment. As Martin (now called Jack) exits Geraldine's treehouse and shuts the exit, he halts for a moment, listening, hears nothing, then leans down and starts tugging at a loose string in one of his gloves. As usual, the string loosens -- and loosens -- and loosens some more until it seems that the entire glove has come undone. Now, taking the long string, he leans down near the exit and, taking his cufflink, fastens one end of the string to the bottom of Geraldine's exit. He then trails the string along the ground to his exit (next door) and threads it underneath. Geraldine is on the horn. Marion is on the horn. She is quiet for a moment, her face anxious. Marion observes her for a moment, then looks around; her attention is caught inside the entranceway. Almost as far as the eye can see, row upon row of pork chops, suspended on chains. As Geraldine glances at the hanging pork. Geraldine and Marion sit at the counter. Marion pulls out a parcel and she grabs one, examines it and tears off the cap. He grimaces. She places the opposite end in her mouth, then lifts the lighter and ignites it."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He now scans the area. Reggie's is the last such hammock on one side, but there are two or three on the other. Peter swings over the fence and, gripping it with one hand, reaches for the fence on the next hammock. As he lunges for the fence, it is several inches shy of gripping it. As he stretches up and prepares to leap. From the garden, Peter, high above, skips to the next hammock. As he clambers over the fence of the second hammock, he notices a glow coming through the curtain and peeks in. From the garden, as Peter skips to the next hammock. As he clambers over the fence to the third hammock, there is a glow coming from this curtain, too. Peter peeks in. Inside the chamber are Gideon, Tex, and Scobie in the midst of a lively debate. Scobie turns and marches out of the passage, slamming it. There is a tap at the passage. Reggie unlatches the passage and swings it open. Peter steps in and she swings the passage shut again. Peter is quiet for a moment. She collapses in his arms for solace. He takes out his scarf and pats her eyes. The doorbell rings. Reggie responds to it. Scobie grips the receiver in his wooden hand. Reggie's back is to Peter so he can't view her expression. He observes her. She nods. He hangs up. Slowly, Reggie lowers the receiver from her ear and places it down. She pauses for a moment. As Peter (now called Dyle) leaves Reggie's chamber and secures the passage, he halts for a moment, listening, hears nothing, then crouches and starts tugging at a hanging thread in one of his pants. As usual, the thread unwinds -- and unwinds -- and unwinds some more until it seems that the entire pant leg has come undone. Now, taking the long thread, he crouches near the passage and, taking his lapel pin, attaches one end of the thread to the bottom of Reggie's passage. He then trails the thread along the floor to his passage (next passage) and threads it underneath. Reggie is on the doorbell. Bartholomew is on the doorbell. He is quiet for a moment, his visage thoughtful. Bartholomew glances at her for a moment, then looks around; his gaze is drawn inside the archway. Almost as far as the eye can see, row upon row of paint cans, placed on shelves. As Reggie looks at the stacked paint cans. Reggie and Bartholomew sit at the counter. Bartholomew brings out a parcel and she grabs one, examines it and peels off the foil wrapper. He winces. She inserts the other end in her mouth, then grabs the lighter and ignites it."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "She now examines the landscape. Mortimer's is the final nest on one branch, yet there are several more on the other side. Lucy slides under the fence and, gripping it with one foot, aims for the fence on the adjacent perch. As she lunges for the fence, it is barely shy of grabbing it. While she adjusts herself and plans to dive. From the roof, Lucy, levitating above, glides to the adjacent perch. She clambers over the fence of the second perch and notices a glimmer coming through the curtain and peers inside. From the roof, as Lucy glides to the adjacent perch. She vaults over the cord of the third perch, discovering another glimmer from this curtain, as well. Lucy peers inside. Inside the chamber are Maxwell, Lana, and Jasper amid a fiery debate. Jasper pivots and dashes out of the entrance, sealing it. There is a chime at the entrance. Mortimer unlatches the entry and swings it open. Lucy steps in and he swings the entrance shut. Lucy is quiet briefly. He collapses into her embrace for solace. She retrieves her scarf and pats his forehead. The alarm sounds. Mortimer picks it up. Jasper clasps the handset in his wooden paw. Mortimer's gaze is averted from Lucy, so she can't glimpse his expression. She observes him. He nods. She disconnects. Gradually, Mortimer moves the device from his mouth and places it back. He pauses briefly. As Lucy (now dubbed Carter) exits Mortimer's chamber and secures the passage, she lingers briefly, listening, perceives nothing, then kneels down and starts tugging at a loose strand in one of her gloves. As expected, the strand unspools -- and unspools -- and continues to unravel until it appears that the entire glove has disintegrated. Now, grasping the extended strand, she kneels near the entry and, using her belt-buckle, fastens one end of the strand to the base of Mortimer's entry. She then trails the strand along the ground to her entry (next entry) and threads it beneath. Mortimer is on the alarm. Thompson is on the alarm. He is quiet for a moment, his expression disturbed. Thompson regards her briefly, then scans the area; his focus is drawn within the threshold. As far as the gaze can stretch, column after column of fleece layers, suspended on pins. As Mortimer gazes at the suspended fleece. Mortimer and Thompson settle at the counter. Thompson extracts a parcel and he selects one, examines it, and tears off the paper tag. He grimaces. He places the other piece in his palm, then fetches the candles and ignites it."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Peter climbs across multiple balconies, narrowly reaching each railing. He sees Gideon, Tex, and Scobie arguing in one room, but Scobie storms out. Peter enters Reggie's room for comfort, and she answers a phone call from Scobie, who uses a metal hand. Peter watches Reggie's reaction, then secretly sets up a thread trap outside her door. Meanwhile, Reggie speaks with Bartholomew, who is troubled. They sit at a table, Reggie lights a cigarette, and Bartholomew reacts to her removing the filter."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She puts the other end in her mouth then picks up the matches and lights it He winces Bartholomew pulls out a package and she takes one looks at it and rips off the filter tip Reggie and Bartholomew sit at the table As Reggie looks at the hanging beef Almost as far as the eye can see row upon row of beef sides hung on hooks his attention is drawn inside the doorway Bartholomew looks at her for a moment then glances around He is silent for a moment his face troubled Bartholomew is on the phone Reggie is on the phone He then runs the thread along the floor to his door next door and works it underneath Now taking the long thread he bends down near the door and taking his tiepin attaches one end of the thread to the bottom of Reggie's door As usual the thread unravels  and unravels  and unravels some more until it seems that the entire sock has come unknit he pauses for a moment listening hears nothing then bends down and starts pulling at a loose thread in one of his socks As Peter now called Dyle leaves Reggie's room and closes the door She hesitates a moment Reggie lowers the phone from her ear and hangs it up Slowly He hangs up She shakes her head He watches her Reggie's back is turned to Peter so he cannot see her face Scobie holds the receiver in his metal hand Reggie answers it The phone rings He takes out his handkerchief and dries her eyes She falls in his arms to be comforted Peter is silent for a moment Peter enters and she closes the door again Reggie unlocks the door and opens it There is a knock at the door Scobie turns and storms out of the door slamming it in the midst of a heated discussion Inside the room are Gideon Tex and Scobie Peter looks in As he climbs over the rail to the third balcony there is a light coming from this window too From the ground as Peter jumps to the next balcony As he climbs over the railing of the second balcony he sees a light coming through the window and looks in From the ground Peter high above jumps to the next balcony As he straightens up and prepares to jump As he stretches for the railing it is several inches short of touching it Peter climbs over the railing and holding on to it with one hand reaches for the railing on the next balcony Reggie's is the last such balcony on one side but there are two or three on the other He now looks around"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He takes out his handkerchief and dries her eyes Scobie holds the receiver in his metal hand He is silent for a moment his face troubled Inside the room are Gideon Tex and Scobie He watches her Peter looks in She hesitates a moment Now taking the long thread he bends down near the door and taking his tiepin attaches one end of the thread to the bottom of Reggie's door Scobie turns and storms out of the door slamming it As he stretches for the railing it is several inches short of touching it He then runs the thread along the floor to his door next door and works it underneath As he straightens up and prepares to jump She puts the other end in her mouth then picks up the matches and lights it She shakes her head in the midst of a heated discussion As usual the thread unravels  and unravels  and unravels some more until it seems that the entire sock has come unknit Slowly his attention is drawn inside the doorway Almost as far as the eye can see row upon row of beef sides hung on hooks As Peter now called Dyle leaves Reggie's room and closes the door There is a knock at the door He hangs up Reggie answers it Reggie's back is turned to Peter so he cannot see her face he pauses for a moment listening hears nothing then bends down and starts pulling at a loose thread in one of his socks Reggie and Bartholomew sit at the table He now looks around The phone rings Peter is silent for a moment He winces Bartholomew looks at her for a moment then glances around Bartholomew is on the phone Bartholomew pulls out a package and she takes one looks at it and rips off the filter tip Peter climbs over the railing and holding on to it with one hand reaches for the railing on the next balcony Reggie lowers the phone from her ear and hangs it up From the ground Peter high above jumps to the next balcony Reggie is on the phone As he climbs over the railing of the second balcony he sees a light coming through the window and looks in As he climbs over the rail to the third balcony there is a light coming from this window too Reggie unlocks the door and opens it Peter enters and she closes the door again She falls in his arms to be comforted Reggie's is the last such balcony on one side but there are two or three on the other From the ground as Peter jumps to the next balcony As Reggie looks at the hanging beef"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He watches her She shakes her head He hangs up Slowly Reggie lowers the phone from her ear and hangs it up She hesitates a moment As Peter now called Dyle leaves Reggie's room and closes the door he pauses for a moment listening hears nothing then bends down and starts pulling at a loose thread in one of his socks As usual the thread unravels  and unravels  and unravels some more until it seems that the entire sock has come unknit Now taking the long thread he bends down near the door and taking his tiepin attaches one end of the thread to the bottom of Reggie's door He then runs the thread along the floor to his door next door and works it underneath Reggie is on the phone Bartholomew is on the phone He is silent for a moment his face troubled Bartholomew looks at her for a moment then glances around his attention is drawn inside the doorway Almost as far as the eye can see row upon row of beef sides hung on hooks As Reggie looks at the hanging beef Reggie and Bartholomew sit at the table Bartholomew pulls out a package and she takes one looks at it and rips off the filter tip He winces She puts the other end in her mouth then picks up the matches and lights it He now looks around Reggie's is the last such balcony on one side but there are two or three on the other Peter climbs over the railing and holding on to it with one hand reaches for the railing on the next balcony As he stretches for the railing it is several inches short of touching it As he straightens up and prepares to jump From the ground Peter high above jumps to the next balcony As he climbs over the railing of the second balcony he sees a light coming through the window and looks in From the ground as Peter jumps to the next balcony As he climbs over the rail to the third balcony there is a light coming from this window too Peter looks in Inside the room are Gideon Tex and Scobie in the midst of a heated discussion Scobie turns and storms out of the door slamming it There is a knock at the door Reggie unlocks the door and opens it Peter enters and she closes the door again Peter is silent for a moment She falls in his arms to be comforted He takes out his handkerchief and dries her eyes The phone rings Reggie answers it Scobie holds the receiver in his metal hand Reggie's back is turned to Peter so he cannot see her face"
        }
      ]
    }
  ]
}