{
  "ground_truth": "Thelma has the phone tucked under her chin as she cuts out coupons from the newspaper and pins them on a bulletin board already covered with them. She goes through the living room to the bottom of the stairs and leans on the banister as Darryl comes trotting down the stairs. Darryl is checking himself out in the hall mirror, and it's obvious he likes what he sees; he exudes over-confidence for reasons that never become apparent and likes to think of himself as a real lady killer, making imperceptible adjustments to his over-moussed hair. Thelma watches approvingly. He's finally ready and walks to the door, giving Thelma the most perfunctory kiss on the cheek. Louise comes over and takes the phone out of his hand. They both hang up. Louise pulls out in a green '66 T-Bird in mint condition. Going into the suitcase are bathing suits, wool socks, flannel pajamas, jeans, sweaters, T-shirts, a couple of dresses, way too much stuff for a two-day trip. REVEAL Thelma standing in front of a closet, trying to decide what else to bring, as if she's forgotten something. The room looks like it was decorated entirely from a Sears catalog; it's really frilly. A perfectly ordered suitcase contains everything neatly folded and orderly: three pairs of underwear, one pair of long underwear, two pairs of pants, two sweaters, one furry robe, and one nightgown. She could be packing for camp. REVEAL Louise, whose room is as orderly as the suitcase, and everything matches. She is debating whether to take an extra pair of socks, decides not to, and closes the suitcase. She goes to the phone, picks it up, and dials. They load everything into the car, and the trunk barely closes. They get into the car and pull out of the driveway. As they drive down the street, we hear Thelma let out a long howl; she is laughing and sticks her arms straight up in the air. They are driving down the interstate when Thelma reaches for her purse and finds the gun. Louise shrieks at the sight of it, and Thelma wonders if Louise is really that naive. Louise reaches over, takes the gun out of Thelma's purse, tests the weight of it, and then puts it under the seat. Thelma puts the bullets under the seat. They are speeding off down the highway with the RADIO blaring. Louise puts in a TAPE of wild R&B MUSIC, and they are both silent for a minute. After a pause, Louise realizes that Thelma is going to revert to a teenager and continue whining unless she gives in. They pull off at a place down on the right all lit up with neon.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Thelma possesses the handset tucked beneath her chin as she slices out vouchers from the periodical and fastens them on a notice board already covered with them. She proceeds through the living room to the base of the stairs and leans on the handrail as Darryl comes trotting down the stairs. Darryl is inspecting himself in the corridor mirror, and it's apparent he likes what he observes; he emits over-confidence for reasons that never become clear and likes to think of himself as a real lady charmer, making subtle adjustments to his overly-gelled hair. Thelma observes approvingly. He's finally prepared and strolls to the door, giving Thelma the most cursory peck on the cheek. Louise arrives and takes the handset out of his hand. They both hang up. Louise pulls out in a green '66 T-Bird in pristine condition. Going into the luggage are swimsuits, woolen socks, flannel sleepwear, jeans, sweaters, T-shirts, a couple of dresses, far too much stuff for a two-day excursion. REVEAL Thelma standing in front of a wardrobe, attempting to decide what else to bring, as if she's forgotten something. The room appears like it was adorned entirely from a Sears catalog; it's really frilly. A perfectly organized suitcase contains everything neatly folded and orderly: three pairs of underwear, one pair of thermal underwear, two pairs of trousers, two sweaters, one furry robe, and one nightgown. She could be packing for camp. REVEAL Louise, whose room is as tidy as the suitcase, and everything matches. She is considering whether to take an extra pair of socks, decides not to, and closes the suitcase. She goes to the phone, picks it up, and dials. They load everything into the vehicle, and the trunk barely closes. They get into the vehicle and pull out of the driveway. As they drive down the street, we hear Thelma let out a long howl; she is laughing and extends her arms straight up in the air. They are driving down the highway when Thelma reaches for her handbag and finds the firearm. Louise screams at the sight of it, and Thelma wonders if Louise is really that naive. Louise reaches over, takes the firearm out of Thelma's handbag, tests the weight of it, and then places it under the seat. Thelma puts the bullets under the seat. They are racing off down the highway with the RADIO blaring. Louise inserts a TAPE of wild R&B MUSIC, and they are both silent for a minute. After a pause, Louise understands that Thelma is going to revert to a teenager and continue whining unless she yields. They pull off at a location down on the right all lit up with neon."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The phone is tucked under Thelma's chin as coupons are cut out from the newspaper by her and pinned on a bulletin board already covered with them. The living room is gone through by her to the bottom of the stairs, and the banister is leaned on as Darryl comes trotting down the stairs. Darryl checks himself out in the hall mirror, and it's obvious he likes what he sees; over-confidence is exuded by him for reasons that never become apparent, and he likes to think of himself as a real lady killer, making imperceptible adjustments to his over-moussed hair. Approval is watched by Thelma. He is finally ready and walks to the door, giving Thelma the most perfunctory kiss on the cheek. Louise comes over to take the phone out of his hand. They both hang up. A green '66 T-Bird in mint condition is pulled out by Louise. Going into the suitcase are bathing suits, wool socks, flannel pajamas, jeans, sweaters, T-shirts, a couple of dresses, way too much stuff for a two-day trip. Thelma is revealed standing in front of a closet, trying to decide what else to bring, as if something has been forgotten by her. The room looks like it has been decorated entirely from a Sears catalog; it's really frilly. Everything is contained in a perfectly ordered suitcase, neatly folded and orderly: three pairs of underwear, one pair of long underwear, two pairs of pants, two sweaters, one furry robe, and one nightgown. She could be packing for camp. Louise is revealed, whose room is as orderly as the suitcase, and everything matches. She is debating whether to take an extra pair of socks, decides not to, and the suitcase is closed by her. The phone is gone to, picked up, and dialed by her. Everything is loaded into the car, and the trunk is barely closed. They get into the car and pull out of the driveway. As the street is driven down, a long howl is let out by Thelma; laughter is given by her, and her arms are stuck straight up in the air. Down the interstate, they are driving when Thelma reaches for her purse and finds the gun. Louise shrieks at the sight of it, and Thelma wonders if Louise is really that naive. Louise reaches over to take the gun out of Thelma's purse, tests the weight of it, and then puts it under the seat. The bullets are put under the seat by Thelma. They are speeding off down the highway with the RADIO blaring. A TAPE of wild R&B MUSIC is put in by Louise, and they are both silent for a minute. After a pause, it is realized by Louise that Thelma is going to revert to a teenager and continue whining unless she gives in. They pull off at a place down on the right all lit up with neon."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Thelma, with the phone under her chin, cuts and pins coupons on an already-covered bulletin board. She leans on the banister as Darryl, overly confident and preening in the mirror, descends the stairs. He gives Thelma a perfunctory cheek kiss and hands the phone to Louise. Louise drives a mint '66 T-Bird packed with excessive clothes for a two-day trip. Thelma meticulously packs her suitcase in a frilly Sears-catalog-style room. Louise, similarly organized, debates packing extra socks, opts not to, and closes her suitcase. Loading the car precariously, they drive off, Thelma laughing and raising her arms. On the interstate, Thelma finds a gun in her purse, startling Louise. Louise handles the gun before placing it and the bullets under the seat. With R&B music blaring, they speed down the highway. Louise, realizing Thelma's teen-like persistence, pulls into a neon-lit place on the right."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Thelma, phone under chin, cuts coupons and pins them on a crowded board. She leans on the banister as Darryl, confident and preening, checks himself in a mirror, adjusts his hair, and offers Thelma a quick cheek kiss before leaving. Louise takes the phone, hangs up, and departs in a green '66 T-Bird. Packing for a short trip, Thelma considers taking more clothes from her frillily decorated room. The orderly suitcase contains clothes for camp. Louise's room matches her neat suitcase. She decides against extra socks, closes her suitcase, and dials the phone. They load the car until the trunk barely closes, then drive off. Thelma laughs and raises her arms as they hit the interstate, discovering a gun in her purse. Louise shrieks but takes the gun, testing its weight before placing it and the bullets under the seat. With the radio blaring and R&B playing, Louise realizes Thelma will whine like a teenager unless appeased. They exit at a neon-lit spot."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Thelma skillfully balances the phone beneath her chin while she diligently cuts out coupons from the pages of the newspaper. With careful precision, she pins them onto a bulletin board that is already overflowing with numerous other clippings. As she moves with purpose through the living room, she makes her way to the bottom of the stairs and leans casually on the banister. Meanwhile, Darryl makes his way down the stairs with a confident trot. His attention is drawn to the hall mirror, and it's strikingly clear that he is pleased with his reflection; he exudes an unshakable over-confidence, the source of which remains a mystery, and fancies himself a genuine lady-killer. With deliberate care, he makes subtle adjustments to his hair, which has been heavily styled with mousse. Thelma watches him with approving eyes. Once he is finally ready, he strides toward the door, pausing only to give Thelma the most mechanical kiss on her cheek. Louise then approaches and takes the phone from Darryl’s hand, and they both hang up in unison. Louise heads out, driving a pristine green '66 T-Bird. Into the suitcase go a plethora of items: bathing suits, wool socks, flannel pajamas, jeans, sweaters, T-shirts, and a couple of dresses—far more than one would reasonably need for just a two-day trip. We then see Thelma standing contemplatively in front of a closet, seemingly trying to remember if there’s anything she might have overlooked. The room around her seems to have been furnished exclusively with items from a Sears catalog, giving it an ultra-frilly appearance. The suitcase, perfectly packed and organized, contains neatly folded items: three pairs of underwear, one pair of long underwear, two pairs of pants, two sweaters, a cozy furry robe, and a nightgown, suggesting she might be preparing for camp. Meanwhile, Louise is revealed in her own room, which is as orderly and well-matched as her suitcase. She is in the middle of debating whether to add an extra pair of socks, ultimately decides against it, and closes the suitcase with a decisive snap. Moving over to the phone, she picks it up and begins dialing. They methodically load all their belongings into the car, with the trunk closing only with difficulty. Settling into the car, they proceed to back out of the driveway. As they move down the street, Thelma emits a long, exuberant howl, filled with laughter, and stretches her arms straight up into the air. They continue driving along the interstate when Thelma rummages through her purse and unexpectedly comes across the gun. Louise lets out a shriek at the sight, prompting Thelma to question whether Louise could truly be that naive. Louise reaches over, takes the gun from Thelma’s purse, hefts its weight briefly, then places it securely under the seat. Thelma follows suit by putting the bullets under the seat too. Speeding down the highway with the RADIO blaring in the background, Louise slides in a TAPE filled with wild, lively R&B MUSIC, rendering them both silent for a moment. After a brief pause, it dawns on Louise that unless she gives in, Thelma will regress into a teenager-like state and continue whining incessantly. They pull off the road and head toward a place illuminated by neon lights, positioned on the right side."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Thelma, with remarkable skill and focus, expertly balances the phone beneath her chin while she is diligently and methodically cutting out coupons from the pages of the newspaper spread in front of her. With careful and meticulous precision, she pins these small pieces of paper onto a bulletin board, which is already crowded and overflowing with numerous other similar clippings. As she moves purposefully through the living room, she makes her way to the bottom of the stairs, where she leans casually against the banister, exuding an air of relaxed confidence. Meanwhile, Darryl descends the stairs with a confident trot, making his way down with purposeful strides. His attention is inevitably drawn to the hall mirror, and it is strikingly clear that he is immensely pleased with his own reflection; he exudes an unshakable over-confidence, the source of which remains a mystery, and he fancies himself a genuine and charming lady-killer. With deliberate care, he makes subtle adjustments to his hair, heavily styled with an ample amount of mousse. Thelma watches him with approving eyes, her gaze filled with a mix of amusement and affection. Once he is finally ready for the day, he strides toward the door, pausing only briefly to bestow upon Thelma the most mechanical and perfunctory kiss on her cheek. Almost immediately after, Louise approaches and takes the phone from Darryl’s hand, seamlessly transitioning into her own conversation as they both hang up in perfect unison. Afterward, Louise heads out, driving a pristinely maintained green '66 T-Bird. Into the suitcase goes a plethora of items: bathing suits, wool socks, flannel pajamas, jeans, sweaters, T-shirts, and a couple of dresses—far more than one would reasonably think necessary for a simple two-day trip. We then see Thelma standing in front of a closet, lost in contemplation, seemingly trying to remember if there might be anything she has overlooked. The room around her appears to have been furnished exclusively with items from a Sears catalog, giving it a decidedly ultra-frilly appearance. The suitcase, perfectly packed and organized, contains neatly folded items, including three pairs of underwear, one pair of long underwear, two pairs of pants, two cozy sweaters, a furry robe, and a nightgown, suggesting she might even be preparing for camp. Meanwhile, in another part of the house, Louise is revealed in her own room, which is as orderly and well-matched as her suitcase. She stands in the middle of debating with herself whether to add an extra pair of socks, ultimately deciding against it, and proceeds to close the suitcase with a decisive and satisfying snap. Moving over to the phone, she picks it up and begins dialing methodically. They both methodically load all their belongings into the car, with the trunk stubbornly closing only with some difficulty. Settling into the car, they proceed to back out of the driveway with a sense of excitement. As they move down the street, Thelma emits a long, exuberant howl, filled with laughter, and stretches her arms straight up into the air, embracing the joy of the moment. They continue driving along the interstate when Thelma rummages through her purse and unexpectedly comes across a gun. Louise lets out a startled shriek at the sight, prompting Thelma to question whether Louise could truly be that naive about the situation. Louise reaches over, takes the gun from Thelma’s purse, hefts its weight briefly, and then places it securely under the seat with a sense of relief. Thelma follows suit by putting the bullets under the seat too, ensuring they are safely out of sight. Speeding down the highway with the RADIO blaring energetically in the background, Louise slides in a TAPE filled with wild and lively R&B MUSIC, rendering them both silent for a brief moment. After a short pause, it dawns on Louise that unless she gives in, Thelma will regress into a teenager-like state and continue to whine incessantly. They pull off the road and head toward a place, illuminated by bright neon lights, positioned welcomingly on the right side."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Thelma, with the phone securely tucked under her chin, meticulously cuts out coupons from the newspaper, carefully aligning each one before pinning them onto an already crowded bulletin board. She then smoothly transitions her focus as she navigates through the living room, moving towards the base of the stairs. Here, she casually leans on the banister, observing as Darryl briskly descends the steps. As Darryl reaches the hallway, he takes a moment to admire himself in the mirror, assessing his appearance with a noticeable air of overconfidence. His self-assured demeanor oozes as he makes subtle adjustments to his over-moussed hair, evidently pleased with the image staring back at him. Thelma, watching from her spot, approves silently. Once Darryl is satisfied with his appearance, he strides over to the door, offering Thelma a quick, obligatory peck on the cheek before exiting. Meanwhile, Louise approaches and gently takes the phone from Thelma's hand, and they both simultaneously hang up. Louise then makes her way outside, confidently settling into her pristine green '66 T-Bird. Inside, her suitcase becomes the repository for an assortment of travel essentials, such as bathing suits, wool socks, flannel pajamas, jeans, sweaters, T-shirts, and a few dresses—far more than necessary for a short two-day trip. Amidst this, Thelma stands in front of her closet, mentally scanning her options to ensure nothing vital is missing. The room around her, adorned with frilly decorations straight from a Sears catalog, underscores her sensibilities. In stark contrast, her suitcase is a model of efficiency, each item—three pairs of underwear, long underwear, two pairs of pants, two sweaters, a furry robe, and a nightgown—neatly folded and arranged. Louise's room, mirroring the suitcase's orderliness, reflects her own discipline. She momentarily debates the need for an extra pair of socks, eventually deciding against it before firmly snapping her suitcase shut. Stepping over to the phone, she lifts the receiver and dials. Later, they load their neatly packed belongings into the car, struggling slightly to close the trunk under the luggage's weight. Settling into the vehicle, they reverse out of the driveway, and as they proceed down the street, Thelma releases a long, exuberant howl of laughter, exuberantly waving her arms in the air. As they cruise along the interstate, Thelma casually reaches into her purse, unexpectedly finding a gun. The sight of it prompts Louise to scream, caught off guard by its presence, leaving Thelma to question Louise's apparent naivete. Without hesitation, Louise reaches over, retrieves the gun from Thelma's grasp, weighs it momentarily in her hands, and securely places it under the seat, followed by Thelma placing the bullets there. With the radio cranked up, they speed down the highway, and Louise inserts a tape that floods the car with exuberant R&B music, both momentarily lost in their thoughts. After a reflective pause, Louise recognizes the need to prevent Thelma from reverting to a teenage state of whining and decides to relent. They eventually veer off the highway, pulling into a brightly illuminated establishment, the neon lights beckoning invitingly."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Thelma multitasks by holding the phone under her chin while cutting and pinning coupons on a crowded bulletin board. She moves through the living room to greet Darryl at the bottom of the stairs, watching approvingly as he admires himself in the hall mirror with over-confidence and adjusts his over-moussed hair. After Darryl gives Thelma a perfunctory kiss, Louise takes the phone from him, and they both hang up. Louise departs in a green '66 T-Bird. Meanwhile, Thelma stands in front of a frilly, Sears-catalog-decorated room, contemplating what to pack for their two-day trip, despite overly packing her ordered suitcase with varied clothing. Similarly, Louise's perfectly matched room reflects in her neatly packed suitcase as she debates and decides against packing extra socks, then calls someone before they both load the car. The trunk packed to capacity, they drive off with Thelma joyfully howling and raising her arms in excitement. On the interstate, Thelma finds a gun in her purse, startling Louise. Thelma questions Louise's naivety as Louise places the gun and bullets under the seat. With the radio blasting, Louise inserts a wild R&B tape, leading to a brief silence. Anticipating Thelma's teenage-like whining, Louise concedes as they pull into a brightly neon-lit spot."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Thelma has the phone tucked under her chin as she cuts out coupons from the newspaper, which is the local daily known for its extensive coupon section on Sundays, and pins them on a bulletin board already covered with them. She goes through the living room, which features a vintage floral sofa set common in suburban homes from the 1980s, to the bottom of the stairs and leans on the banister as Darryl comes trotting down the stairs. Darryl is checking himself out in the hall mirror, a prized antique piece that belonged to his grandmother, and it's obvious he likes what he sees; he exudes over-confidence for reasons that never become apparent and likes to think of himself as a real lady killer, making imperceptible adjustments to his over-moussed hair styled in the fashion of 1980s TV stars. Thelma watches approvingly. He's finally ready and walks to the door, giving Thelma the most perfunctory kiss on the cheek. Louise comes over and takes the phone out of his hand. They both hang up. Louise pulls out in a green '66 T-Bird in mint condition, a classic car she inherited from her father who was the original owner. Going into the suitcase are bathing suits, wool socks, flannel pajamas, jeans, sweaters, T-shirts, a couple of dresses, way too much stuff for a two-day trip. Reveal Thelma standing in front of a closet, trying to decide what else to bring, as if she's forgotten something. The room looks like it was decorated entirely from a Sears catalog, popular among middle-class families for its affordability and style in the 1980s; it's really frilly. A perfectly ordered suitcase contains everything neatly folded and orderly: three pairs of underwear, one pair of long underwear, two pairs of pants, two sweaters, one furry robe, and one nightgown. She could be packing for camp. Reveal Louise, whose room is as orderly as the suitcase, and everything matches in a carefully curated color scheme that includes pastel hues and floral patterns. She is debating whether to take an extra pair of socks, decides not to, and closes the suitcase. She goes to the phone, an old rotary model that clicks nostalgically as she dials. They load everything into the car, and the trunk barely closes due to the over-packed luggage. They get into the car and pull out of the driveway. As they drive down the street in the quiet suburban neighborhood, we hear Thelma let out a long howl; she is laughing and sticks her arms straight up in the air. They are driving down the interstate, a major highway that links several cities, when Thelma reaches for her purse and finds the gun, a relic from her father’s collection. Louise shrieks at the sight of it, and Thelma wonders if Louise is really that naive given their current situation. Louise reaches over, takes the gun out of Thelma's purse, tests the weight of it, and then puts it under the seat, a move that suggests her familiarity with firearms. Thelma puts the bullets under the seat. They are speeding off down the highway with the radio blaring classic hits from the 1960s. Louise puts in a tape of wild R&B music, reminiscent of their carefree youth, and they are both silent for a minute. After a pause, Louise realizes that Thelma is going to revert to a teenager and continue whining unless she gives in. They pull off at a place down on the right all lit up with neon, an iconic diner known for its 24-hour breakfast and kitschy decor."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Thelma has the phone tucked under her chin as she cuts out coupons from the newspaper and pins them on a bulletin board already covered with them. She goes through the living room to the bottom of the stairs and leans on the banister as Darryl comes trotting down the stairs. Darryl is checking himself out in the hall mirror and it is obvious he likes what he sees. he exudes overconfidence for reasons that never become apparent and likes to think of himself as a real lady killer making imperceptible adjustments to his overmoussed hair. Thelma watches approvingly. He is finally ready and walks to the door giving Thelma the most perfunctory kiss on the cheek. Louise comes over and takes the phone out of his hand. They both hang up. Louise pulls out in a green '66 TBird in mint condition. Going into the suitcase are bathing suits wool socks flannel pajamas jeans sweaters Tshirts a couple of dresses. way too much stuff for a twoday trip. REVEAL. Thelma standing in front of a closet trying to decide what else to bring as if she is forgotten something. The room looks like it was decorated entirely from a Sears catalog. it is really frilly. A perfectly ordered suitcase contains everything neatly folded and orderly. three pairs of underwear one pair of long underwear two pairs of pants two sweaters one furry robe and one nightgown. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. She could be packing for camp. REVEAL. Louise whose room is as orderly as the suitcase and everything matches. She is debating whether to take an extra pair of socks decides not to and closes the suitcase. She goes to the phone picks it up and dials. They load everything into the car and the trunk barely closes. They get into the car and pull out of the driveway. As they drive down the street we hear Thelma let out a long howl. she is laughing and sticks her arms straight up in the air. They are driving down the interstate when Thelma reaches for her purse and finds the gun. Louise shrieks at the sight of it and Thelma wonders if Louise is really that naive. Louise reaches over takes the gun out of Thelma's purse tests the weight of it and then puts it under the seat. Thelma puts the bullets under the seat. They are speeding off down the highway with the RADIO blaring. Louise puts in a TAPE of wild RB MUSIC and they are both silent for a minute. After a pause Louise realizes that Thelma is going to revert to a teenager and continue whining unless she gives in. They pull off at a place down on the right all lit up with neon."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Thelma has the phone tucked under her chin as she cuts out coupons from the newspaper and pins them on a bulletin board already covered with them. She goes through the living room to the bottom of the stairs and leans on the banister as Darryl comes trotting down the stairs. Darryl is checking himself out in the hall mirror and it is obvious he likes what he sees. he exudes overconfidence for reasons that never become apparent and likes to think of himself as a real lady killer making imperceptible adjustments to his overmoussed hair. Thelma watches approvingly. He is finally ready and walks to the door giving Thelma the most perfunctory kiss on the cheek. Louise comes over and takes the phone out of his hand. They both hang up. Louise pulls out in a green '66 TBird in mint condition. Going into the suitcase are bathing suits wool socks flannel pajamas jeans sweaters Tshirts a couple of dresses. way too much stuff for a twoday trip. REVEAL. Thelma standing in front of a closet trying to decide what else to bring as if she is forgotten something. The room looks like it was decorated entirely from a Sears catalog. it is really frilly. A perfectly ordered suitcase contains everything neatly folded and orderly. three pairs of underwear one pair of long underwear two pairs of pants two sweaters one furry robe and one nightgown. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. She could be packing for camp. REVEAL. Louise whose room is as orderly as the suitcase and everything matches. She is debating whether to take an extra pair of socks decides not to and closes the suitcase. She goes to the phone picks it up and dials. They load everything into the car and the trunk barely closes. They get into the car and pull out of the driveway. As they drive down the street we hear Thelma let out a long howl. she is laughing and sticks her arms straight up in the air. They are driving down the interstate when Thelma reaches for her purse and finds the gun. Louise shrieks at the sight of it and Thelma wonders if Louise is really that naive. Louise reaches over takes the gun out of Thelma's purse tests the weight of it and then puts it under the seat. Thelma puts the bullets under the seat. They are speeding off down the highway with the RADIO blaring. Louise puts in a TAPE of wild RB MUSIC and they are both silent for a minute. After a pause Louise realizes that Thelma is going to revert to a teenager and continue whining unless she gives in. They pull off at a place down on the right all lit up with neon."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Thelma has the phone tucked under her chin as she cuts out coupons from the newspaper and pins them on a bulletin board already covered with them. She goes through the living room to the bottom of the stairs and leans on the banister as Darryl comes trotting down the stairs. Darryl is checking himself out in the hall mirror and it is obvious he likes what he sees. he exudes overconfidence for reasons that never become apparent and likes to think of himself as a real lady killer making imperceptible adjustments to his overmoussed hair. Thelma watches approvingly. He is finally ready and walks to the door giving Thelma the most perfunctory kiss on the cheek. Louise comes over and takes the phone out of his hand. They both hang up. Louise pulls out in a green '66 TBird in mint condition. They are driving down the interstate when Thelma reaches for her purse and finds the gun. Louise shrieks at the sight of it and Thelma wonders if Louise is really that naive. Louise reaches over takes the gun out of Thelma's purse tests the weight of it and then puts it under the seat. Thelma puts the bullets under the seat. They are speeding off down the highway with the RADIO blaring. Louise puts in a TAPE of wild RB MUSIC and they are both silent for a minute. After a pause Louise realizes that Thelma is going to revert to a teenager and continue whining unless she gives in. They pull off at a place down on the right all lit up with neon."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Thelma has the phone tucked under her chin as she cuts out coupons from the newspaper and pins them on a bulletin board already covered with them. She goes through the living room to the bottom of the stairs and leans on the banister as Darryl comes trotting down the stairs. Darryl is checking himself out in the hall mirror and it is obvious he likes what he sees. he exudes overconfidence for reasons that never become apparent and likes to think of himself as a real lady killer making imperceptible adjustments to his overmoussed hair. Louise puts in a TAPE of wild RB MUSIC and they are both silent for a minute. After a pause Louise realizes that Thelma is going to revert to a teenager and continue whining unless she gives in. They pull off at a place down on the right all lit up with neon."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Marvin has the cookbook balanced on his knee as he sketches landscapes from the magazine and sticks them on a chalkboard already plastered with them. He wanders through the garage to the edge of the garden and reclines on the fence as Sylvia comes sauntering up the path. Sylvia is admiring herself in the puddle, and it's evident she enjoys her appearance; she radiates arrogance for reasons that remain obscure and imagines herself as a true fashion icon, making minute adjustments to her over-styled scarf. Marvin observes admiringly. She's finally prepared and strides to the gate, offering Marvin the most lackluster peck on the forehead. Claude ambles over and snatches the cookbook out of her grip. They each hang it up. Claude drives out in a blue '72 Corvette in pristine condition. Packing into the backpack are rubber boots, silk scarves, plaid gloves, shorts, hoodies, blouses, far too much paraphernalia for a weekend trek. REVEAL Marvin standing before a cabinet, trying to choose what else to pack, as though he's misplaced something. The chamber appears as if it was furnished entirely from an Ikea catalog; it's extremely minimalist. A meticulously arranged backpack holds everything carefully layered and systematic: five pairs of socks, one pair of suspenders, three shirts, one jacket, and one bathrobe. He could be gearing up for a retreat. REVEAL Claude, whose chamber is as systematic as the backpack, and everything harmonizes. He is contemplating whether to include an extra pair of gloves, opts out, and seals the backpack. He moves to the cookbook, grabs it, and scribbles. They stow everything into the van, and the hatch barely secures. They buckle into the van and cruise out of the garage. As they navigate down the avenue, we catch Marvin let out a lengthy giggle; he is cheering and thrusts his legs directly into the sky. They are cruising down the boulevard when Marvin reaches for his wallet and discovers the sketch. Claude yelps at the sight of it, and Marvin questions if Claude is genuinely that clueless. Claude lunges over, extracts the sketch out of Marvin's wallet, measures the heft of it, and then tosses it under the rug. Marvin slips the pencils under the rug. They are driving off down the freeway with the STEREO booming. Claude slides in a DISC of fierce jazz TUNES, and they are both mute for a moment. After a pause, Claude discerns that Marvin is going to regress to a youngster and persist in grumbling unless he relents. They turn off at a joint down on the left all glowing with lanterns."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Thelma, cutting coupons and chatting on the phone, watches her overconfident husband Darryl admire himself before leaving. She and Louise pack for a two-day trip, with Thelma overpacking and unsure if she’s forgotten anything. Louise, more organized, packs efficiently. They load their car, a green '66 T-Bird, and set off. During the drive, Thelma discovers a gun in her purse, startling Louise, who then stows it under the seat. As they speed down the highway with loud R&B music playing, Louise realizes Thelma might regress without some concessions. They decide to stop at a neon-lit place on the right."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "They pull off at a place down on the right all lit up with neon After a pause Louise realizes that Thelma is going to revert to a teenager and continue whining unless she gives in Louise puts in a TAPE of wild RB MUSIC and they are both silent for a minute They are speeding off down the highway with the RADIO blaring Thelma puts the bullets under the seat Louise reaches over takes the gun out of Thelma's purse tests the weight of it and then puts it under the seat Louise shrieks at the sight of it and Thelma wonders if Louise is really that naive They are driving down the interstate when Thelma reaches for her purse and finds the gun she is laughing and sticks her arms straight up in the air As they drive down the street we hear Thelma let out a long howl They get into the car and pull out of the driveway They load everything into the car and the trunk barely closes She goes to the phone picks it up and dials She is debating whether to take an extra pair of socks decides not to and closes the suitcase Louise whose room is as orderly as the suitcase and everything matches REVEAL She could be packing for camp three pairs of underwear one pair of long underwear two pairs of pants two sweaters one furry robe and one nightgown A perfectly ordered suitcase contains everything neatly folded and orderly it is really frilly The room looks like it was decorated entirely from a Sears catalog Thelma standing in front of a closet trying to decide what else to bring as if she is forgotten something REVEAL way too much stuff for a twoday trip Going into the suitcase are bathing suits wool socks flannel pajamas jeans sweaters Tshirts a couple of dresses Louise pulls out in a green '66 TBird in mint condition They both hang up Louise comes over and takes the phone out of his hand He is finally ready and walks to the door giving Thelma the most perfunctory kiss on the cheek Thelma watches approvingly he exudes overconfidence for reasons that never become apparent and likes to think of himself as a real lady killer making imperceptible adjustments to his overmoussed hair Darryl is checking himself out in the hall mirror and it is obvious he likes what he sees She goes through the living room to the bottom of the stairs and leans on the banister as Darryl comes trotting down the stairs Thelma has the phone tucked under her chin as she cuts out coupons from the newspaper and pins them on a bulletin board already covered with them"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "She goes through the living room to the bottom of the stairs and leans on the banister as Darryl comes trotting down the stairs Thelma has the phone tucked under her chin as she cuts out coupons from the newspaper and pins them on a bulletin board already covered with them he exudes overconfidence for reasons that never become apparent and likes to think of himself as a real lady killer making imperceptible adjustments to his overmoussed hair Darryl is checking himself out in the hall mirror and it is obvious he likes what he sees He is finally ready and walks to the door giving Thelma the most perfunctory kiss on the cheek Thelma watches approvingly They both hang up Louise comes over and takes the phone out of his hand Going into the suitcase are bathing suits wool socks flannel pajamas jeans sweaters Tshirts a couple of dresses Louise pulls out in a green '66 TBird in mint condition REVEAL way too much stuff for a twoday trip The room looks like it was decorated entirely from a Sears catalog Thelma standing in front of a closet trying to decide what else to bring as if she is forgotten something A perfectly ordered suitcase contains everything neatly folded and orderly it is really frilly She could be packing for camp three pairs of underwear one pair of long underwear two pairs of pants two sweaters one furry robe and one nightgown Louise whose room is as orderly as the suitcase and everything matches REVEAL She goes to the phone picks it up and dials She is debating whether to take an extra pair of socks decides not to and closes the suitcase They get into the car and pull out of the driveway They load everything into the car and the trunk barely closes she is laughing and sticks her arms straight up in the air As they drive down the street we hear Thelma let out a long howl Louise shrieks at the sight of it and Thelma wonders if Louise is really that naive They are driving down the interstate when Thelma reaches for her purse and finds the gun Thelma puts the bullets under the seat Louise reaches over takes the gun out of Thelma's purse tests the weight of it and then puts it under the seat Louise puts in a TAPE of wild RB MUSIC and they are both silent for a minute They are speeding off down the highway with the RADIO blaring They pull off at a place down on the right all lit up with neon After a pause Louise realizes that Thelma is going to revert to a teenager and continue whining unless she gives in"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She could be packing for camp REVEAL Louise whose room is as orderly as the suitcase and everything matches She is debating whether to take an extra pair of socks decides not to and closes the suitcase She goes to the phone picks it up and dials They load everything into the car and the trunk barely closes They get into the car and pull out of the driveway As they drive down the street we hear Thelma let out a long howl she is laughing and sticks her arms straight up in the air They are driving down the interstate when Thelma reaches for her purse and finds the gun Louise shrieks at the sight of it and Thelma wonders if Louise is really that naive Louise reaches over takes the gun out of Thelma's purse tests the weight of it and then puts it under the seat Thelma puts the bullets under the seat They are speeding off down the highway with the RADIO blaring Louise puts in a TAPE of wild RB MUSIC and they are both silent for a minute After a pause Louise realizes that Thelma is going to revert to a teenager and continue whining unless she gives in They pull off at a place down on the right all lit up with neon Thelma has the phone tucked under her chin as she cuts out coupons from the newspaper and pins them on a bulletin board already covered with them She goes through the living room to the bottom of the stairs and leans on the banister as Darryl comes trotting down the stairs Darryl is checking himself out in the hall mirror and it is obvious he likes what he sees he exudes overconfidence for reasons that never become apparent and likes to think of himself as a real lady killer making imperceptible adjustments to his overmoussed hair Thelma watches approvingly He is finally ready and walks to the door giving Thelma the most perfunctory kiss on the cheek Louise comes over and takes the phone out of his hand They both hang up Louise pulls out in a green '66 TBird in mint condition Going into the suitcase are bathing suits wool socks flannel pajamas jeans sweaters Tshirts a couple of dresses way too much stuff for a twoday trip REVEAL Thelma standing in front of a closet trying to decide what else to bring as if she is forgotten something The room looks like it was decorated entirely from a Sears catalog it is really frilly A perfectly ordered suitcase contains everything neatly folded and orderly three pairs of underwear one pair of long underwear two pairs of pants two sweaters one furry robe and one nightgown"
        }
      ]
    }
  ]
}