{
  "ground_truth": "The establishment is called the SILVER BULLET, with a sign flashing COCKTAILS — BEER — DANCING — FOOD. It features a large gravel parking lot filled with many pickup trucks and older cars, indicating that even though it's early, it is a true night spot, and it's already pretty crowded and lively. There are ten pool tables surrounded by crowds, a long bar filled with customers, and tables and booths, while the room is dense with smoke. The dance floor remains inactive as the band is still setting up, and there are many single men present. Numerous heads turn to watch Thelma and Louise as they find an empty table. A waitress arrives and leaves two menus at their table. After leaving briefly, the Waitress returns with Louise's drink, which Louise understands. Harlan laughs, and although Thelma joins in, she doesn't fully get the joke, and Harlan soon leaves. Thelma downs her Wild Turkey shot and signals the Waitress for another. Both women momentarily drift into thoughts about their domestic issues until the Waitress returns. Thelma observes Harlan at the bar making dancing gestures at her, she smiles and waves, but then her expression turns serious when she looks back at Louise. Thelma's speech is rapid, but Louise is accustomed to it, smiling wistfully at Thelma's insights. Louise finishes her Wild Turkey, raising her glass as the BAND starts a lively tune. She then drinks her tequila shot and raises her glass again. Thelma has been dancing with Harlan for some time, while Louise is dancing with a quiet man named Dan. Thelma, breathless, drunk, and giggly, holds a beer bottle and laughs over nothing as Harlan watches her closely, which Louise notices before heading to the bathroom. Thelma stumbles, dropping her beer, and Louise approaches a long line of women outside the bathroom. Harlan steers Thelma out the door to the parking lot. Thelma is limp and pulls away as Harlan leans close to her and tries to embrace her. Just as Louise exits the bathroom while another woman enters, she scans the room for Thelma, approaches the table, and sees Thelma's belongings still there.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The institution is termed the SILVER BULLET, with a board flickering COCKTAILS — BEER — DANCING — FOOD. It showcases a sizable gravel parking area packed with numerous pickup vehicles and older automobiles, signifying that even though it's early, it is a genuine nighttime venue, and it's already rather crowded and energetic. There are ten billiard tables encircled by groups, an elongated bar filled with patrons, and chairs and booths, while the space is thick with fumes. The dance floor remains idle as the ensemble is still arranging, and there are many lone males present. Several heads rotate to observe Thelma and Louise as they locate an unoccupied table. A server arrives and leaves two menus at their table. After departing briefly, the Server returns with Louise's beverage, which Louise comprehends. Harlan chuckles, and although Thelma joins in, she doesn't entirely grasp the jest, and Harlan soon departs. Thelma downs her Wild Turkey shot and signals the Server for another. Both women momentarily drift into reflections about their household issues until the Server returns. Thelma observes Harlan at the bar performing dancing motions at her, she smiles and signals, but then her expression turns grave when she looks back at Louise. Thelma's speech is rapid, but Louise is accustomed to it, smiling pensively at Thelma's insights. Louise completes her Wild Turkey, lifting her glass as the BAND starts an animated melody. She then drinks her tequila shot and raises her glass again. Thelma has been dancing with Harlan for some time, while Louise is dancing with a silent man named Dan. Thelma, breathless, intoxicated, and giggly, holds a beer bottle and laughs over nothing as Harlan observes her attentively, which Louise notices before heading to the restroom. Thelma trips, dropping her beer, and Louise approaches a long line of women outside the restroom. Harlan guides Thelma out the door to the parking area. Thelma is limp and pulls away as Harlan leans close to her and attempts to hold her. Just as Louise exits the restroom while another woman enters, she scans the area for Thelma, approaches the table, and sees Thelma's possessions still there."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The establishment is called the SILVER BULLET, with a sign flashing COCKTAILS — BEER — DANCING — FOOD. A large gravel parking lot is featured, filled with many pickup trucks and older cars, indicating that even though it's early, it is a true night spot, and it's already pretty crowded and lively. Crowds surround ten pool tables, a long bar fills with customers, and tables and booths, while smoke densifies the room. The dance floor is remained inactive as the band is still setting up, and many single men are present. Numerous heads turn to watch Thelma and Louise find an empty table. A waitress arrives and leaves two menus at their table. She returns with Louise's drink after leaving briefly, which Louise understands. Harlan laughs, and Thelma joins in, but she doesn't fully get the joke, and soon Harlan leaves. Thelma downs her Wild Turkey shot and signals the Waitress for another. Both women momentarily drift into thoughts about their domestic issues until the Waitress returns. Thelma observes Harlan making dancing gestures at her at the bar, and she smiles and waves, but then her expression is turned serious when she looks back at Louise. Thelma's speech is rapid, but it is accustomed to by Louise, who smiles wistfully at Thelma's insights. Louise finishes her Wild Turkey, raising her glass as the BAND starts a lively tune. Then she drinks her tequila shot and raises her glass again. Thelma has been dancing with Harlan for some time, while a quiet man named Dan dances with Louise. Harlan watches Thelma as she, breathless, drunk, and giggly, holds a beer bottle and laughs over nothing, which is noticed by Louise before she heads to the bathroom. Thelma stumbles, and a beer is dropped by her, and Louise approaches a long line of women outside the bathroom. Thelma is steered out the door to the parking lot by Harlan. Harlan leans close to her and tries to embrace her as she is limp and pulls away. While Louise exits the bathroom just as another woman enters, she scans the room for Thelma, approaches the table, and sees Thelma's belongings still there."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The establishment, named the SILVER BULLET, displays a flashing sign: COCKTAILS — BEER — DANCING — FOOD. Its large gravel parking lot, filled with pickup trucks and old cars, indicates its popularity as a bustling night spot despite the early hour. Inside, ten pool tables, a long bar crowded with patrons, and dense smoke fill the room. Though the dance floor is inactive as the band sets up, many single men are present. As Thelma and Louise find a table, numerous heads turn. A waitress delivers two menus and later Louise's drink, which she understands. Harlan laughs at a joke, and while Thelma laughs along, she doesn't fully grasp it. As Harlan departs, Thelma finishes her Wild Turkey and orders another. Both women drift into thoughts about domestic issues until the Waitress returns. Thelma notices Harlan gesturing at the bar; she smiles and waves but grows serious when glancing at Louise. Thelma speaks rapidly, accustomed to Louise's reflective smiles. Louise finishes her Wild Turkey as the band begins a lively tune, then downs her tequila. Thelma dances with Harlan, breathless and giggly, while Louise dances with Dan. Breathless, Thelma laughs, clutching a beer as Harlan closely watches her, which Louise notices before heading to the bathroom. Thelma drops her beer, and Louise joins the long bathroom line. Harlan leads Thelma, limp and resistant, into the parking lot. As Louise exits the bathroom, she scans for Thelma, finds her belongings at the table, and grows concerned."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The SILVER BULLET flashes a sign for COCKTAILS, BEER, DANCING, and FOOD, with a crowded gravel parking lot of trucks and older cars, indicating it's a popular night spot. Inside, ten pool tables and a long bar buzz with smoke and customers. The dance floor is empty as the band sets up, amidst single men. Thelma and Louise are noticed as they find a table. A waitress serves Louise her drink, then Thelma downs her Wild Turkey and orders again. They momentarily ponder their domestic issues. Harlan makes dance gestures at Thelma, who then laughs at his bar antics. Louise, familiar with Thelma's rapid speech, raises her glass when the BAND starts playing, finishing her tequila shot. Thelma dances with Harlan, while Louise dances with a quiet man, Dan. Thelma, giggly and tipsy with a beer, notices Harlan's close watch. Louise sees this before heading to the bathroom. Thelma drops her beer, stumbling, and Harlan leads her to the parking lot. Limp, Thelma resists as Harlan leans in. Louise, exiting the bathroom, notices Thelma missing and sees her belongings still at the table."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The lively establishment is known as the SILVER BULLET, prominently featuring a bright, attention-grabbing sign that boldly announces COCKTAILS — BEER — DANCING — FOOD. The venue boasts a sprawling gravel parking lot, which is teeming with numerous pickup trucks and an assortment of older cars. This sight alone suggests that despite the early hour, the place lives up to its reputation as a genuine nightspot, buzzing with activity and vibrancy. Inside, patrons will find ten pool tables surrounded by enthusiastic crowds, a long bar crowded with thirsty customers, and plenty of tables and booths to accommodate the bustling clientele. The air is thick with smoke, creating a hazy atmosphere. Although the dance floor remains unused for the moment since the band is still setting up their equipment, there is a notable presence of many single men. As Thelma and Louise enter, numerous heads turn to observe them as they navigate their way to an unoccupied table. A diligent waitress promptly arrives at their table, placing two menus before them. After a brief absence, the waitress returns, bringing Louise her drink, which Louise acknowledges. Harlan laughs, and although Thelma joins in the laughter, she doesn't completely grasp the humor, and Harlan soon departs. Thelma quickly downs her shot of Wild Turkey and signals to the waitress for another round. Both women find themselves drifting into contemplative thoughts about their domestic lives until the waitress's return interrupts their reverie. Thelma notices Harlan at the bar, playfully gesturing for a dance, and she smiles and waves at him. However, her expression becomes sober when she turns her attention back to Louise. Thelma speaks rapidly, but Louise, familiar with this habit, smiles wistfully at Thelma's observations. Louise finishes her own Wild Turkey, lifting her glass high just as the band launches into a spirited tune. She then drinks her tequila shot and once again raises her glass. Thelma has spent some time on the dance floor with Harlan, while Louise finds herself dancing alongside a quiet man named Dan. Meanwhile, Thelma, now breathless, intoxicated, and giggling uncontrollably, clutches a beer bottle, laughing at nothing in particular as Harlan watches her intently. Louise notices this before deciding to head to the bathroom. As Thelma stumbles and drops her beer, Louise joins the long queue of women outside the restroom. In the meantime, Harlan leads a limp Thelma out into the parking lot. Thelma resists, pulling away as Harlan leans in closer, attempting to embrace her. As Louise exits the bathroom, with another woman taking her place, she searches the room for Thelma. Approaching the table, she notices Thelma's belongings still in place."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The lively and bustling establishment is famously known as the SILVER BULLET. It prominently features a bright and attention-grabbing sign that boldly announces COCKTAILS — BEER — DANCING — FOOD, drawing in patrons from the surrounding area. The venue boasts a sprawling gravel parking lot, which is utterly teeming with numerous pickup trucks and an assortment of older cars. This sight alone suggests that despite the early hour, the place indeed lives up to its reputation as a genuine nightspot, buzzing with both activity and vibrant energy. Inside, patrons will discover ten pool tables, each surrounded by enthusiastic and lively crowds, a long bar crowded with thirsty customers seeking refreshment, and plenty of tables and booths designed to accommodate the bustling clientele. The air is thick with smoke, creating a hazy and somewhat mysterious atmosphere. Although the dance floor remains unused for the moment, since the band is still busy setting up their equipment, there is a notable presence of many single men waiting for the music to start. As Thelma and Louise enter through the doors, numerous heads turn to observe them as they navigate their way confidently to an unoccupied table. A diligent waitress promptly arrives at their table, placing two menus before them with a friendly demeanor. After a brief absence, the same attentive waitress returns, bringing Louise her drink, which Louise acknowledges with a nod. Harlan laughs heartily, and although Thelma joins in the laughter, she doesn't completely grasp the humor of the situation, and Harlan soon departs. Thelma quickly downs her shot of Wild Turkey and signals to the waitress for another round. Both women find themselves gradually drifting into thoughtful and contemplative musings about their domestic lives until the waitress's return interrupts their reverie. Thelma notices Harlan over at the bar, playfully gesturing for a dance, and she smiles and waves back at him. However, her expression becomes sober when she shifts her attention back to Louise. Thelma speaks rapidly, but Louise, familiar with this endearing habit, smiles wistfully at Thelma's observations. Louise finishes her own Wild Turkey, lifting her glass high just as the band launches into a spirited tune. She then drinks her tequila shot and once again raises her glass. Thelma has spent some time moving rhythmically on the dance floor with Harlan, while Louise finds herself dancing alongside a quiet, reserved man named Dan. Meanwhile, Thelma, now breathless from all the fun, intoxicated, and giggling uncontrollably, clutches a beer bottle, laughing at nothing in particular as Harlan watches her intently with a noticeable gaze. Louise notices this interaction before deciding to head to the bathroom. As Thelma stumbles and drops her beer, Louise joins the long queue of women waiting outside the restroom. In the meantime, Harlan leads a limp and unsteady Thelma out into the parking lot. Thelma resists the movement, pulling away as Harlan leans in closer, attempting to embrace her. As Louise exits the bathroom, with another woman taking her place, she searches the room for any sign of Thelma. Approaching the table, she notices Thelma's belongings still in place, giving her pause."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The establishment is named the SILVER BULLET, proudly displaying a sign that flashes COCKTAILS — BEER — DANCING — FOOD in bright lights. It has a large gravel parking lot packed with numerous pickup trucks and older cars, which is a clear indication that despite the early hour, the venue is a true night spot and already bustling with activity. Inside, ten pool tables are surrounded by groups of people, a long bar is lined with patrons, and various tables and booths are scattered throughout, all enveloped in a thick haze of smoke. The dance floor, however, remains quiet and unoccupied since the band is still in the process of setting up. Many single men populate the room, and heads turn to watch as Thelma and Louise enter and make their way over to find an unoccupied table. A waitress approaches and sets down two menus before briefly departing, only to return shortly with Louise's drink, which Louise acknowledges with understanding. Harlan emits a laugh, and Thelma, though sharing in the laughter, doesn't fully grasp the humor. Harlan soon moves away, prompting Thelma to quickly swallow her Wild Turkey shot and gesture to the waitress for another round. Both women briefly allow themselves to drift into thoughts about their domestic issues, but this introspection is interrupted when the waitress returns. Catching sight of Harlan at the bar, Thelma notices him making dancing gestures toward her, causing her to smile and wave initially, though her expression shifts to seriousness as she turns her focus back to Louise. Thelma's speech is fast-paced, yet Louise, familiar with this, listens intently and responds with a wistful smile to Thelma's observations. As the BAND strikes up a lively tune, Louise drains her Wild Turkey, lifts her glass in appreciation, and follows it with a tequila shot, again raising her glass in a toast. Meanwhile, Thelma has been dancing with Harlan for a considerable amount of time, while Louise finds herself dancing with a reserved man named Dan. Thelma, now breathless, inebriated, and filled with giggles, clutches a beer bottle and laughs without any specific cause, under the watchful eye of Harlan, a scene that catches Louise's attention before she moves toward the bathroom. Thelma stumbles, accidentally dropping her beer, while Louise approaches a lengthy line of women waiting outside the bathroom. Outside, Harlan guides a sluggish and resistant Thelma out the door to the parking lot, where she attempts to distance herself as he leans in to embrace her. As Louise exits the bathroom, another woman enters, and Louise takes a moment to scan the room for Thelma. She heads over to their table and observes that Thelma's belongings remain untouched, still sitting there."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The SILVER BULLET is a lively establishment, marked by a flashing sign advertising COCKTAILS — BEER — DANCING — FOOD. Despite the early hour, the large gravel parking lot is packed with pickup trucks and older cars, indicating its popularity as a nightspot. Inside, the dense smoke fills a room bustling with patrons at ten pool tables, a long bar, and numerous tables and booths. While the dance floor remains idle as the band sets up, many single men are present. As Thelma and Louise arrive, catching the attention of several onlookers, they find an empty table. A waitress delivers menus and, after a brief absence, brings Louise's drink. Harlan shares a laugh with Thelma, though she doesn't quite grasp the humor, and he soon departs. Thelma quickly downs her Wild Turkey shot, signaling for another, and the women reflect on their domestic issues until the waitress returns. Noticing Harlan gesturing from the bar, Thelma waves with a smile that fades when she turns to Louise. Though Thelma speaks rapidly, Louise listens with a wistful smile, finishing her Wild Turkey as the band plays a lively tune. She drinks her tequila shot, raising her glass once more. As Thelma dances with Harlan and Louise partners with the quiet Dan, Thelma, breathless and giggly from the beer, draws Harlan's close attention, which Louise notices before heading to the bathroom. Thelma stumbles and drops her beer, while Louise navigates the line outside the bathroom. Meanwhile, Harlan guides a limping Thelma to the parking lot, as she pulls away from his advancing embrace. Louise, exiting the bathroom as another woman enters, scans the room for Thelma, approaches their table, and sees Thelma's belongings still there."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The establishment is called the SILVER BULLET, a popular nightspot in this small town, with a sign flashing COCKTAILS — BEER — DANCING — FOOD to entice patrons. It features a large gravel parking lot filled with many pickup trucks and older cars, typical of rural areas where driving is the primary mode of transport, indicating that even though it's early, it is a true night spot, and it's already pretty crowded and lively. There are ten pool tables surrounded by crowds, a long bar filled with customers, and tables and booths, while the room is dense with smoke, a common feature in bars before indoor smoking bans became widespread in the 2000s. The dance floor remains inactive as the band, a local favorite known for their lively covers, is still setting up, and there are many single men present, drawn perhaps by the prospect of meeting someone new. Numerous heads turn to watch Thelma and Louise, who are known for their close friendship and adventurous spirits, as they find an empty table. A waitress, dressed in the establishment’s signature uniform of denim shorts and a branded tank top, arrives and leaves two menus at their table. After leaving briefly, the Waitress returns with Louise's drink, which Louise understands might mean something unspoken between them. Harlan, a regular at the establishment known for his loud laugh, laughs, and although Thelma joins in, she doesn't fully get the joke, and Harlan soon leaves. Thelma downs her Wild Turkey shot, a choice of bourbon known for its high proof and bold flavor, and signals the Waitress for another. Both women momentarily drift into thoughts about their domestic issues, reflecting on their struggles with relationships and independence, until the Waitress returns. Thelma observes Harlan at the bar making dancing gestures at her, she smiles and waves, but then her expression turns serious when she looks back at Louise, concerned about how this evening might unfold. Thelma's speech is rapid, matching her spontaneous personality, but Louise is accustomed to it, smiling wistfully at Thelma's insights filled with a mix of humor and truth. Louise finishes her Wild Turkey, raising her glass as the BAND starts a lively tune, a signal that the night is officially beginning. She then drinks her tequila shot, a ritual she often shares with Thelma, and raises her glass again. Thelma has been dancing with Harlan for some time, while Louise is dancing with a quiet man named Dan, who she met earlier at the bar and found intriguingly reserved. Thelma, breathless, drunk, and giggly, holds a beer bottle and laughs over nothing, a common reaction when she drinks, as Harlan watches her closely, which Louise notices and finds concerning before heading to the bathroom. Thelma stumbles, dropping her beer, and Louise approaches a long line of women outside the bathroom, a notorious bottleneck in the venue. Harlan, a man with a reputation for being too forward, steers Thelma out the door to the parking lot. Thelma is limp and pulls away as Harlan leans close to her and tries to embrace her. Just as Louise exits the bathroom, while another woman enters, she scans the room for Thelma, approaches the table, and sees Thelma's belongings still there, feeling a rising concern for her friend's safety."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "The establishment is called the SILVER BULLET with a sign flashing COCKTAILS — BEER — DANCING — FOOD. It features a large gravel parking lot filled with many pickup trucks and older cars indicating that even though it is early it is a true night spot and it is already pretty crowded and lively. There are ten pool tables surrounded by crowds. a long bar filled with customers and tables and booths while the room is dense with smoke. The dance floor remains inactive as the band is still setting up and there are many single men present. Numerous heads turn to watch Thelma and Louise as they find an empty table. A waitress arrives and leaves two menus at their table. After leaving briefly the Waitress returns with Louise's drink which Louise understands. Harlan laughs and although Thelma joins in she does not fully get the joke and Harlan soon leaves. Thelma downs her Wild Turkey shot and signals the Waitress for another. Both women momentarily drift into thoughts about their domestic issues until the Waitress returns. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Thelma observes Harlan at the bar making dancing gestures at her. she smiles and waves but then her expression turns serious when she looks back at Louise. Thelma's speech is rapid but Louise is accustomed to it smiling wistfully at Thelma's insights. Louise finishes her Wild Turkey raising her glass as the BAND starts a lively tune. She then drinks her tequila shot and raises her glass again. Thelma has been dancing with Harlan for some time while Louise is dancing with a quiet man named Dan. Thelma breathless drunk and giggly holds a beer bottle and laughs over nothing as Harlan watches her closely which Louise notices before heading to the bathroom. Thelma stumbles dropping her beer and Louise approaches a long line of women outside the bathroom. Harlan steers Thelma out the door to the parking lot. Thelma is limp and pulls away as Harlan leans close to her and tries to embrace her. Just as Louise exits the bathroom while another woman enters she scans the room for Thelma approaches the table and sees Thelma's belongings still there."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "The establishment is called the SILVER BULLET with a sign flashing COCKTAILS — BEER — DANCING — FOOD. It features a large gravel parking lot filled with many pickup trucks and older cars indicating that even though it is early it is a true night spot and it is already pretty crowded and lively. There are ten pool tables surrounded by crowds. a long bar filled with customers and tables and booths while the room is dense with smoke. The dance floor remains inactive as the band is still setting up and there are many single men present. Numerous heads turn to watch Thelma and Louise as they find an empty table. A waitress arrives and leaves two menus at their table. After leaving briefly the Waitress returns with Louise's drink which Louise understands. Harlan laughs and although Thelma joins in she does not fully get the joke and Harlan soon leaves. Thelma downs her Wild Turkey shot and signals the Waitress for another. Both women momentarily drift into thoughts about their domestic issues until the Waitress returns. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Thelma observes Harlan at the bar making dancing gestures at her. she smiles and waves but then her expression turns serious when she looks back at Louise. Thelma's speech is rapid but Louise is accustomed to it smiling wistfully at Thelma's insights. Louise finishes her Wild Turkey raising her glass as the BAND starts a lively tune. She then drinks her tequila shot and raises her glass again. Thelma has been dancing with Harlan for some time while Louise is dancing with a quiet man named Dan. Thelma breathless drunk and giggly holds a beer bottle and laughs over nothing as Harlan watches her closely which Louise notices before heading to the bathroom. Thelma stumbles dropping her beer and Louise approaches a long line of women outside the bathroom. Harlan steers Thelma out the door to the parking lot. Thelma is limp and pulls away as Harlan leans close to her and tries to embrace her. Just as Louise exits the bathroom while another woman enters she scans the room for Thelma approaches the table and sees Thelma's belongings still there."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "The establishment is called the SILVER BULLET with a sign flashing COCKTAILS — BEER — DANCING — FOOD. It features a large gravel parking lot filled with many pickup trucks and older cars indicating that even though it is early it is a true night spot and it is already pretty crowded and lively. There are ten pool tables surrounded by crowds. a long bar filled with customers and tables and booths while the room is dense with smoke. The dance floor remains inactive as the band is still setting up and there are many single men present. Numerous heads turn to watch Thelma and Louise as they find an empty table. Thelma breathless drunk and giggly holds a beer bottle and laughs over nothing as Harlan watches her closely which Louise notices before heading to the bathroom. Thelma stumbles dropping her beer and Louise approaches a long line of women outside the bathroom. Harlan steers Thelma out the door to the parking lot. Thelma is limp and pulls away as Harlan leans close to her and tries to embrace her. Just as Louise exits the bathroom while another woman enters she scans the room for Thelma approaches the table and sees Thelma's belongings still there."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "The establishment is called the SILVER BULLET with a sign flashing COCKTAILS — BEER — DANCING — FOOD. It features a large gravel parking lot filled with many pickup trucks and older cars indicating that even though it is early it is a true night spot and it is already pretty crowded and lively. There are ten pool tables surrounded by crowds. Thelma is limp and pulls away as Harlan leans close to her and tries to embrace her. Just as Louise exits the bathroom while another woman enters she scans the room for Thelma approaches the table and sees Thelma's belongings still there."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "The fortress is named the GOLDEN COMPASS, with a banner glowing DOG PARK — SODA — SKIING — FRUIT. It displays a tiny sandy playground occupied by numerous bicycles and ancient trains, suggesting that despite being midday, it is an early morning venue, and it's already quite deserted and tranquil. There are eight chess boards surrounded by animals, a short counter crowded with bartenders, and chairs and hammocks, while the space is clear of fog. The game area remains unused as the orchestra is still preparing, and there are many stray cats lounging. Several tails flick to observe Rosie and Clara as they spot a vacant hammock. A vendor approaches and drops two napkins at their hammock. After disappearing momentarily, the Vendor returns with Clara's coaster, which Clara appreciates. Marvin sings, and although Rosie hums along, she doesn’t truly grasp the tune, and Marvin soon retreats. Rosie sips her Pepsi shake and indicates to the Vendor for more. Both ladies occasionally drift into musings about their culinary adventures until the Vendor reappears. Rosie spies Marvin at the counter performing juggling tricks at her, she chuckles and nods, but then her demeanor shifts to reflective when she glances back at Clara. Rosie's chatter is measured, but Clara is accustomed to it, grinning nostalgically at Rosie's stories. Clara empties her Pepsi, lifting her mug as the ORCHESTRA begins a serene ballad. She then sips her lemonade and lifts her mug once more. Rosie has been leaping with Marvin for a while, while Clara is leaping with a reserved penguin named Bob. Rosie, breathless, sober, and serene, clutches a lemonade carton and sighs over everything as Marvin observes her intently, which Clara senses before heading to the garden. Rosie glides, spilling her lemonade, and Clara approaches a short queue of penguins outside the garden. Marvin guides Rosie into the corridor to the beach. Rosie is buoyant and pushes away as Marvin leans close to her and attempts to tickle her. Just as Clara leaves the garden while another penguin enters, she surveys the corridor for Rosie, approaches the hammock, and sees Rosie's trinkets still there."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The SILVER BULLET is a lively night spot with a flashing sign and crowded with pickup trucks, indicating its popularity despite the early hour. Inside are pool tables, a bustling bar, and a smoky atmosphere. The dance floor is quiet as the band sets up, and many single men are present. Thelma and Louise draw attention as they find a table, receiving menus from a waitress. Louise gets her drink, and Harlan jokes with Thelma, who doesn't fully understand but laughs anyway. Thelma downs her Wild Turkey and orders another, both women briefly reflecting on their domestic issues. Thelma catches Harlan's dancing gestures and smiles but becomes serious when looking at Louise. Louise is used to Thelma's rapid speech and smiles wistfully. As the band starts, Louise finishes her Wild Turkey and tequila shot. Thelma dances with Harlan, while Louise dances with a quiet man named Dan. Thelma, drunk and giggling with a beer, is watched closely by Harlan. Louise notices this before heading to the bathroom. Thelma, stumbling and dropping her beer, is led by Harlan out to the parking lot. Louise exits the bathroom, sees Thelma's belongings still at the table, and looks around for her."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Just as Louise exits the bathroom while another woman enters she scans the room for Thelma approaches the table and sees Thelma's belongings still there Thelma is limp and pulls away as Harlan leans close to her and tries to embrace her Harlan steers Thelma out the door to the parking lot Thelma stumbles dropping her beer and Louise approaches a long line of women outside the bathroom Thelma breathless drunk and giggly holds a beer bottle and laughs over nothing as Harlan watches her closely which Louise notices before heading to the bathroom Thelma has been dancing with Harlan for some time while Louise is dancing with a quiet man named Dan She then drinks her tequila shot and raises her glass again Louise finishes her Wild Turkey raising her glass as the BAND starts a lively tune Thelma's speech is rapid but Louise is accustomed to it smiling wistfully at Thelma's insights she smiles and waves but then her expression turns serious when she looks back at Louise Thelma observes Harlan at the bar making dancing gestures at her Both women momentarily drift into thoughts about their domestic issues until the Waitress returns Thelma downs her Wild Turkey shot and signals the Waitress for another Harlan laughs and although Thelma joins in she does not fully get the joke and Harlan soon leaves After leaving briefly the Waitress returns with Louise's drink which Louise understands A waitress arrives and leaves two menus at their table Numerous heads turn to watch Thelma and Louise as they find an empty table The dance floor remains inactive as the band is still setting up and there are many single men present a long bar filled with customers and tables and booths while the room is dense with smoke There are ten pool tables surrounded by crowds It features a large gravel parking lot filled with many pickup trucks and older cars indicating that even though it is early it is a true night spot and it is already pretty crowded and lively The establishment is called the SILVER BULLET with a sign flashing COCKTAILS — BEER — DANCING — FOOD"
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "It features a large gravel parking lot filled with many pickup trucks and older cars indicating that even though it is early it is a true night spot and it is already pretty crowded and lively The establishment is called the SILVER BULLET with a sign flashing COCKTAILS — BEER — DANCING — FOOD a long bar filled with customers and tables and booths while the room is dense with smoke There are ten pool tables surrounded by crowds Numerous heads turn to watch Thelma and Louise as they find an empty table The dance floor remains inactive as the band is still setting up and there are many single men present After leaving briefly the Waitress returns with Louise's drink which Louise understands A waitress arrives and leaves two menus at their table Thelma downs her Wild Turkey shot and signals the Waitress for another Harlan laughs and although Thelma joins in she does not fully get the joke and Harlan soon leaves Thelma observes Harlan at the bar making dancing gestures at her Both women momentarily drift into thoughts about their domestic issues until the Waitress returns Thelma's speech is rapid but Louise is accustomed to it smiling wistfully at Thelma's insights she smiles and waves but then her expression turns serious when she looks back at Louise She then drinks her tequila shot and raises her glass again Louise finishes her Wild Turkey raising her glass as the BAND starts a lively tune Thelma breathless drunk and giggly holds a beer bottle and laughs over nothing as Harlan watches her closely which Louise notices before heading to the bathroom Thelma has been dancing with Harlan for some time while Louise is dancing with a quiet man named Dan Harlan steers Thelma out the door to the parking lot Thelma stumbles dropping her beer and Louise approaches a long line of women outside the bathroom Just as Louise exits the bathroom while another woman enters she scans the room for Thelma approaches the table and sees Thelma's belongings still there Thelma is limp and pulls away as Harlan leans close to her and tries to embrace her"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Thelma observes Harlan at the bar making dancing gestures at her she smiles and waves but then her expression turns serious when she looks back at Louise Thelma's speech is rapid but Louise is accustomed to it smiling wistfully at Thelma's insights Louise finishes her Wild Turkey raising her glass as the BAND starts a lively tune She then drinks her tequila shot and raises her glass again Thelma has been dancing with Harlan for some time while Louise is dancing with a quiet man named Dan Thelma breathless drunk and giggly holds a beer bottle and laughs over nothing as Harlan watches her closely which Louise notices before heading to the bathroom Thelma stumbles dropping her beer and Louise approaches a long line of women outside the bathroom Harlan steers Thelma out the door to the parking lot Thelma is limp and pulls away as Harlan leans close to her and tries to embrace her Just as Louise exits the bathroom while another woman enters she scans the room for Thelma approaches the table and sees Thelma's belongings still there The establishment is called the SILVER BULLET with a sign flashing COCKTAILS — BEER — DANCING — FOOD It features a large gravel parking lot filled with many pickup trucks and older cars indicating that even though it is early it is a true night spot and it is already pretty crowded and lively There are ten pool tables surrounded by crowds a long bar filled with customers and tables and booths while the room is dense with smoke The dance floor remains inactive as the band is still setting up and there are many single men present Numerous heads turn to watch Thelma and Louise as they find an empty table A waitress arrives and leaves two menus at their table After leaving briefly the Waitress returns with Louise's drink which Louise understands Harlan laughs and although Thelma joins in she does not fully get the joke and Harlan soon leaves Thelma downs her Wild Turkey shot and signals the Waitress for another Both women momentarily drift into thoughts about their domestic issues until the Waitress returns"
        }
      ]
    }
  ]
}