{
  "ground_truth": "She picks up the check and looks at it. Harlan has led Thelma off to the far end of the parking lot, and he is trying to kiss her now. He is pushing her arms down and turning her head away. Harlan is pushing himself on her now, and she is beginning to push him away harder. Harlan has now pinned Thelma against the back of a car and is kissing her neck. He has her ass in his hands and is beginning to hump her. She is pushing him away as hard as she can, but he is relentless. He looks mean and dangerous. He lets go of her face and pins her arms behind her, holding both of her arms with one hand. With his free hand, he reaches down and starts to pull her dress up. Thelma is still struggling, and there are tears running down her face. A tight shot shows the barrel of Thelma's gun being pressed into the nape of Harlan's neck, as Louise's thumb pulls back the hammer. Harlan slowly raises his hands in the air, and Thelma darts out, pulling her dress down. Louise starts to back away, but the gun is still close to his face, while his pants are undone in the front. She is still backing away with the gun raised, and Thelma is inching away as well. Louise lowers the gun and stares at him for a second before turning and walking away. Thelma does, too. Louise stops in her tracks, takes two long strides back towards him, raises the gun, and fires a bullet into his face. The car behind him is splattered with blood. Thelma and Louise are both silent. Louise lowers the gun, and Thelma runs to get the car, coming careening up in reverse. Louise hops in, and Thelma peels out, spraying gravel. As they speed out of the parking lot back to the road, music is blaring from the nightclub. They hit the main road with tires squealing, and Thelma starts to cry quietly. Thelma pulls off to the side of the road. Louise gets out and starts to walk around the car, stopping when she gets to the back of the car and is sick. Thelma waits in the car and moves over to the passenger side. Louise gets in the driver's side, and Thelma's head moves almost imperceptibly. Louise studies Thelma's face and looks at her for a long time. Police cars are parked around, and the activity has died down. In the back of a police car sits the waitress with the door open, while a detective in a suit leans over the car door with his note pad. Louise did not realize she was doing it.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She selects up the cheque and glances at it. Harlan has guided Thelma off to the distant end of the parking area, and he is attempting to kiss her now. He is pressing her arms downward and turning her head aside. Harlan is forcing himself on her now, and she is starting to shove him away more forcefully. Harlan has now pinned Thelma against the rear of a vehicle and is kissing her neck. He has her rear in his hands and is beginning to thrust against her. She is pushing him away as hard as she can, but he is unyielding. He looks cruel and menacing. He releases her face and pins her arms behind her, holding both of her arms with one hand. With his free hand, he reaches downward and starts to tug her dress upward. Thelma is still grappling, and there are tears streaming down her face. A close shot shows the barrel of Thelma's pistol being pressed into the nape of Harlan's neck, as Louise's thumb pulls back the hammer. Harlan gradually elevates his hands in the air, and Thelma dashes out, pulling her dress down. Louise begins to retreat, but the weapon is still close to his face, while his trousers are undone in the front. She is still backing away with the gun raised, and Thelma is edging away as well. Louise lowers the gun and gazes at him for a moment before turning and walking away. Thelma does, too. Louise halts in her tracks, takes two long strides back towards him, raises the gun, and fires a projectile into his face. The automobile behind him is splattered with blood. Thelma and Louise are both silent. Louise lowers the gun, and Thelma runs to get the automobile, coming careening up in reverse. Louise jumps in, and Thelma peels out, spraying gravel. As they speed out of the parking lot back to the road, music is blaring from the nightclub. They hit the main road with tires squealing, and Thelma starts to weep quietly. Thelma pulls off to the side of the road. Louise exits and starts to walk around the automobile, stopping when she gets to the back of the automobile and is sick. Thelma waits in the vehicle and moves over to the passenger side. Louise gets in the driver's side, and Thelma's head moves almost imperceptibly. Louise examines Thelma's face and gazes at her for a long time. Police automobiles are parked around, and the activity has subsided. In the back of a police vehicle sits the waitress with the door open, while a detective in a suit leans over the vehicle door with his notebook. Louise did not realize she was doing it."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The check is picked up by her, and it is looked at by her. Thelma has been led off by Harlan to the far end of the parking lot, and he tries to kiss her now. Her arms are being pushed down by him, and her head is turned away by him. Harlan pushes himself on her now, and she begins to push him away harder. Thelma is now pinned against the back of a car by Harlan, and her neck is kissed by him. Her ass is held in his hands, and she is beginning to be humped by him. As hard as she can, she pushes him away, but he remains relentless. He appears mean and dangerous. Her face is let go of by him, and her arms are pinned behind her, with both of her arms held by one of his hands. With his free hand, he reaches down and starts to pull her dress up. She is still struggling, and on her face, tears are running down. A tight shot shows Thelma pressing the barrel of her gun into the nape of Harlan's neck, as the hammer is pulled back by Louise's thumb. His hands are slowly raised in the air by Harlan, and Thelma darts out, pulling her dress down. She starts to back away, but the gun is still kept close to his face, while his pants remain undone in the front. With the gun raised, she is still backing away, and away Thelma inches as well. Louise lowers the gun and stares at him for a second before she turns and walks away. Thelma does so, too. Louise stops in her tracks, takes two long strides back towards him, raises the gun, and fires a bullet into his face. Blood is splattered on the car behind him. Both Thelma and Louise remain silent. The gun is lowered by Louise, and to get the car, Thelma runs, coming careening up in reverse. Louise hops in, and out Thelma peels, spraying gravel. As the parking lot is sped out of by them back to the road, music blares from the nightclub. With tires squealing, they hit the main road, and Thelma starts to cry quietly. To the side of the road, Thelma pulls off. Out of the car, Louise gets, and she starts to walk around the car, stopping when the back of the car is reached by her, and she is sick. The car is waited in by Thelma, and over to the passenger side, she moves. In the driver's side, Louise gets, and Thelma's head moves almost imperceptibly. Thelma's face is studied by Louise, and she looks at her for a long time. Around the area, police cars are parked, and down the activity has died. In the back of a police car, the waitress sits with the door open, while over the car door, a detective in a suit leans with his note pad. It was not realized by Louise that she was doing it."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "She glances at the check. Harlan leads Thelma to the parking lot's far end, trying to kiss her as he pushes her arms and turns her head. He pins her against a car, kissing her neck and grabbing her as she struggles. Harlan appears threatening. He pins her arms with one hand, pulling her dress with the other. Thelma struggles, tears falling. The barrel of Thelma's gun presses into Harlan's neck as Louise cocks it. Harlan raises his hands, and Thelma escapes, fixing her dress. Louise, still aiming the gun, backs away, with Thelma following. Louise pauses, fires a bullet into his face, splattering blood. Silent, Thelma runs for the car, reversing wildly. Louise jumps in, and they speed away, nightclub music blaring, tires squealing. Thelma quietly cries, pulling over. Louise exits and vomits at the back of the car. Thelma moves to the passenger side; Louise enters the driver's side, studying Thelma's face. Police cars are around; a detective questions a waitress in a police car. Louise didn't realize her actions."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "She picks up the check and sees Harlan leading Thelma to the parking lot's far end, where he tries kissing her. He forcefully pushes her arms down and turns her head away. Harlan pins Thelma against a car, kissing her neck and aggressively holding her. She struggles hard, and tears stream down her face. A close-up reveals Thelma's gun pressed to Harlan's neck as Louise cocks it. Harlan raises his hands, and Thelma escapes, adjusting her dress. Louise backs away, gun aimed at Harlan's face, whose pants are undone. Louise lowers the gun, they walk away, but she suddenly returns, shooting him in the face, splattering blood on the car behind him. In silence, Louise lowers the gun, and Thelma fetches the car. Louise jumps in, and Thelma speeds out, spraying gravel, blaring nightclub music as they hit the road. Thelma quietly cries, pulls over, and Louise exits, getting sick behind the car. Thelma shifts to the passenger seat, Louise drives, and observes her. Police cars surround the area; activity calms. A waitress sits in the back of a police car with a detective taking notes. Louise didn't realize her actions."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "She cautiously picks up the check and takes a moment to look at it with a lingering gaze. Meanwhile, Harlan has led Thelma away, guiding her to the distant end of the expansive parking lot, where he is now attempting to force a kiss on her. He is persistently pushing her arms down while simultaneously turning her head away from him. In this moment, Harlan is pressing himself forcefully on her, and Thelma, with increasing urgency, is beginning to push him away even harder. Harlan has now managed to pin Thelma against the unforgiving metallic back of a nearby car, and he is aggressively kissing her neck. He has his hands gripping her rear, and there is a disturbing sense of him beginning to hump her. Despite her desperate efforts to repel him, using all the strength she can muster, he remains unyielding and relentless. His expression is one of menace, looking both mean and alarmingly dangerous. He then releases her face and forcefully pins her arms behind her back, immobilizing them with the firm grip of just one hand. Using his other hand, he begins to reach down, attempting to pull her dress up. Thelma is still valiantly struggling against him, her face streaked with tears that cascade down her cheeks. A tight, focused shot vividly shows the barrel of Thelma's gun being pressed firmly into the vulnerable nape of Harlan's neck as Louise's thumb deftly pulls back the hammer with precise intent. Slowly, Harlan raises his hands into the air in a gesture of surrender, and Thelma, seizing the moment, darts away, urgently pulling her dress back down to cover herself. Louise cautiously begins to back away, though the gun remains close to Harlan's face, with his pants now undone in the front. Louise continues to retreat, maintaining the gun's aim, while Thelma inches away as well, both of them moving with deliberate caution. Louise finally lowers the gun, pausing to stare at him for a long, lingering second before decisively turning and walking away. Thelma follows suit. Suddenly, Louise halts, turns on her heel, taking two long, deliberate strides back toward him, raising the gun once more, and fires a single, haunting bullet directly into his face. The car behind him becomes an unintentional canvas, splattered with vivid red blood. Both Thelma and Louise stand in silent shock. Louise gradually lowers the gun, and Thelma urgently runs to get the car, bringing it careening up in reverse. Louise quickly hops in, and Thelma floors the accelerator, causing the car to peel out, spraying loose gravel everywhere. As they speed out of the chaotic parking lot, heading back to the main road, music blares loudly from the nightclub, adding to the surreal atmosphere. With tires squealing, they hit the main road, and Thelma, overwhelmed, begins to cry quietly. Needing to pause, Thelma pulls the car off to the side of the road. Louise gets out and begins to walk around the car, stopping when she reaches the back, where she suddenly becomes sick. Meanwhile, Thelma waits in the car, shifting over to the passenger side to make room. Louise returns to the driver's side, and Thelma's head moves almost imperceptibly. Louise takes a moment to study Thelma's face, looking at her intently for a long, contemplative time. Nearby, police cars are parked in various positions, the earlier frenetic activity having died down. In the back of a police car sits the waitress, the door left open, while a detective, clad in a suit, leans over the car door, thoughtfully scribbling on his notepad. Louise did not even realize she was doing it."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a heightened sense of caution, she reaches out and gingerly picks up the check, pausing deliberately to give it a lengthy, lingering gaze. Meanwhile, at the opposite end of this unfolding scene, Harlan has already led Thelma away, guiding her purposefully toward the distant periphery of the expansive, sprawling parking lot. At this secluded location, Harlan is now attempting, with aggressive insistence, to force an unwanted kiss onto her lips. He persistently presses her arms downward, all the while trying to turn her head away from his advances. In this tense and unsettling moment, Harlan presses himself against her with unrelenting force, and Thelma, with a rapidly increasing sense of urgency and desperation, pushes back against him with all her might.\n\nHarlan has now managed to pin Thelma against the cold, unforgiving metallic surface of a nearby parked car, aggressively kissing her neck. His hands grip her rear with unsettling firmness, and there is a deeply disturbing sense that he is beginning to thrust against her. Despite Thelma's frantic and desperate attempts to repel him, using every ounce of strength she can muster, he remains unyielding and utterly relentless. His expression is one of sheer menace, bearing a look that is both cruel and dangerously threatening. He suddenly releases her face, then forcefully pins her arms behind her back, trapping them with a powerful grip using just one hand. With his other hand, he begins to reach downward, attempting to pull her dress up. Throughout this horrifying ordeal, Thelma continues to struggle valiantly against him, her face streaked with tears cascading down her cheeks.\n\nIn a tight, focused shot, the camera vividly captures the barrel of Thelma's gun being pressed firmly against the vulnerable nape of Harlan's neck as Louise, with precise intent, deftly pulls back the hammer with her thumb. Slowly, Harlan raises his hands into the air, a gesture of defeated surrender, allowing Thelma to seize the crucial moment and dart away, urgently pulling her dress back down to cover herself. Louise begins to back away cautiously, though her gun remains trained closely on Harlan's face, where his pants are now undone at the front. She continues her careful retreat, keeping the gun's aim steadfastly on him while Thelma also inches away, both of them moving with deliberate, methodical caution.\n\nLouise finally lowers the gun, taking a moment to fix her unwavering gaze on him for a long, lingering second before decisively turning to walk away. Thelma immediately follows suit. Suddenly, Louise halts abruptly, pivots on her heel, and, in two long, deliberate strides, returns toward Harlan, raising the gun once more. With chilling precision, she fires a single, haunting bullet directly into his face. The car behind him morphs into an unintentional canvas, drenched in vivid red blood. Thelma and Louise stand together in silent, stupefied shock. Louise gradually lowers the gun. In the urgency of the moment, Thelma races to retrieve their car, bringing it screaming up in reverse. Louise quickly hops in, and without hesitation, Thelma floors the accelerator, causing the car to peel out with a frenzy, spraying loose gravel in every direction. As they speed out of the chaotic parking lot and head back to the main road, the music from the nightclub blares loudly, adding to the surreal, charged atmosphere.\n\nWith tires squealing, they hit the main road, and Thelma, overwhelmed by the intense emotions of the moment, begins to cry quietly. Needing a moment to pause and gather herself, Thelma pulls the car off to the side of the road. Louise exits and begins to walk around the car slowly, stopping as she reaches the back, where she suddenly becomes physically sick. Meanwhile, Thelma waits inside the car, shifting over to the passenger side to make room. Louise returns to the driver's side, taking a moment to study Thelma's face, looking intently at her for a long, contemplative time. Nearby, police cars are parked in various positions, the frenetic activity of earlier having noticeably died down. In the backseat of one police car, a waitress is seated, the door left open. A detective, clad in a suit, leans over the car door, thoughtfully scribbling notes on his notepad, seemingly oblivious to the unfolding drama. Louise hadn't even realized she was doing it."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "She reaches out to pick up the check, bringing it closer to her face to examine it closely. Meanwhile, Harlan has guided Thelma to a secluded spot at the far end of the parking lot, where he attempts to kiss her. He forcefully pushes her arms down, turning her head away from his in an effort to dominate the situation. Persistently, Harlan advances his unwanted attention on Thelma, who begins to resist, pushing him away with increasing determination. The situation escalates as Harlan pins Thelma against a car's back, pressing his lips against her neck while holding her firmly by the waist, starting to grind against her. Despite her efforts to fend him off, he remains aggressive and imposing. His demeanor turns menacing as he releases her face only to secure her arms behind her back with one hand. With his other hand now free, he cruelly pulls at the fabric of her dress, attempting to reveal more. Thelma, caught in the struggle, is visibly distraught, tears streaming down her cheeks. In a close-up shot, the barrel of Thelma's gun is shown pressing against the nape of Harlan's neck, as Louise's thumb pulls back the hammer, signaling an imminent threat. Realizing the shift in power, Harlan slowly raises his hands in surrender, allowing Thelma to escape from his grasp, hurriedly pulling her dress back into place. Louise, maintaining her focus, begins to back away cautiously, with the gun still aimed close to Harlan's face, his pants undone at the front exposing his vulnerability. Both women retreat cautiously, Thelma inching away, while Louise lowers the gun just enough to pause and lock eyes with Harlan for a moment before decisively turning to leave. Thelma follows suit, but as they gain distance, Louise suddenly halts and with renewed resolve returns towards Harlan, lifting the gun again and firing a shot directly into his face, leaving a bloody mark on the car behind. A profound silence envelops Thelma and Louise as they both absorb the gravity of their actions. Louise lowers the gun, and Thelma reacts quickly, running to retrieve the car, maneuvering it back towards Louise with urgency, tires skidding on the gravel. Louise swiftly enters the vehicle, and Thelma accelerates, sending gravel flying as they make a hasty exit from the parking lot. The music from the nightclub fades into the background as they screech onto the main road, the gravity of the situation sinking in as Thelma begins to cry quietly. Finding a spot along the side of the road, Thelma pulls over, allowing the tension to ease momentarily. Louise steps out, taking slow, deliberate steps around the perimeter of the car until she reaches the back, overcome by nausea and succumbing to its effects. Inside the car, Thelma shifts over to the passenger side, her subtle movements barely noticeable. Louise reenters on the driver’s side, taking a moment to study Thelma’s face, absorbing the shared turmoil reflected in her eyes. In the distance, the scene shifts to police cars scattered about, their attention waning as the initial chaos subsides. A waitress sits quietly in the back of a police car, its door ajar, while a detective leans over, jotting down notes on his pad, unaware of the larger story unraveling beyond their view. Unbeknownst to her, Louise’s actions have set a series of irreversible events into motion."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "She picks up the check and observes the situation where Harlan is aggressively advancing on Thelma at the far end of the parking lot. Despite Thelma's efforts to resist, Harlan forcefully pins her against a car and attempts to assault her. As tension escalates, a close-up reveals Thelma's gun pressed into Harlan's neck, prompting him to reluctantly release her. Thelma quickly escapes, adjusting her dress, while Louise maintains her focus on him with the gun raised. After a brief hesitation, Louise shoots Harlan, and they silently process the aftermath. Thelma retrieves their car, and Louise jumps in as Thelma speeds out of the parking lot, music blaring from the nightclub. They screech onto the main road, where Thelma pulls over and begins to cry quietly. Louise exits the car, walks to the rear, and is sick. Returning to the car, she takes the driver's seat and studies Thelma's face for a moment. Meanwhile, police cars are scattered around the scene, with a waitress and detective conversing in the background. Louise hadn't realized she was part of the unfolding drama."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She picks up the check and looks at it, noting the amount from the local diner known for its cheap but hearty meals. Harlan has led Thelma off to the far end of the dimly lit parking lot adjacent to the bustling roadhouse, and he is trying to kiss her now. He is pushing her arms down and turning her head away, ignoring the boundaries that should be respected by any decent person. Harlan is pushing himself on her now, and she is beginning to push him away harder, determined to fend off his unwanted advances. Harlan has now pinned Thelma against the back of a car parked in the shadow of the nightclub's neon lights and is kissing her neck with no regard for her protests. He has her ass in his hands and is beginning to hump her, an act of aggression common in situations of power imbalance. She is pushing him away as hard as she can, but he is relentless, showcasing the danger women often face in unguarded moments. He looks mean and dangerous, a predator emboldened by the lack of immediate consequences. He lets go of her face and pins her arms behind her, holding both of her arms with one hand as if to assert his dominance. With his free hand, he reaches down and starts to pull her dress up, attempting to strip her of her dignity. Thelma is still struggling, and there are tears running down her face, reflecting her fear and desperation. A tight shot shows the barrel of Thelma's gun being pressed into the nape of Harlan's neck, a stark reminder of the power dynamics at play, as Louise's thumb pulls back the hammer with the precision of someone who has weighed her choices. Harlan slowly raises his hands in the air, a universal signal of surrender, and Thelma darts out, pulling her dress down to reclaim her autonomy. Louise starts to back away, but the gun is still close to his face, while his pants are undone in the front, a symbol of his intent. She is still backing away with the gun raised, and Thelma is inching away as well, both women aware of the gravity of their actions. Louise lowers the gun, suggesting a moment of contemplation, and stares at him for a second before turning and walking away. Thelma does, too, following her friend's lead. Louise stops in her tracks, takes two long strides back towards him, raises the gun with a resolute decision, and fires a bullet into his face, a dramatic act of finality. The car behind him is splattered with blood, marking the abrupt end to Harlan's aggression. Thelma and Louise are both silent, the enormity of the situation settling in. Louise lowers the gun, and Thelma runs to get the car, coming careening up in reverse like a scene from a high-stakes getaway. Louise hops in, and Thelma peels out, spraying gravel as they make a hasty escape. As they speed out of the parking lot back to the road familiar to them from countless drives, music is blaring from the nightclub, adding a bizarre soundtrack to their flight. They hit the main road with tires squealing, and Thelma starts to cry quietly, the adrenaline giving way to emotion. Thelma pulls off to the side of the road, a temporary pause in their flight. Louise gets out and starts to walk around the car, stopping when she gets to the back of the car and is sick, overwhelmed by the gravity of what just occurred. Thelma waits in the car and moves over to the passenger side, the roles of their journey shifting. Louise gets in the driver's side, and Thelma's head moves almost imperceptibly, a small nod of understanding between them. Louise studies Thelma's face and looks at her for a long time, their silent communication speaking volumes. Police cars are parked around back at the scene of the shooting, and the activity has died down as officers assess the situation. In the back of a police car sits the waitress from the roadhouse, a witness to their desperation, with the door open, while a detective in a suit leans over the car door with his note pad, taking notes for the inevitable investigation. Louise did not realize she was doing it, the gravity of her actions only now sinking in."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Louise starts to back away but the gun is still close to his face while his pants are undone in the front She picks up the check and looks at it Louise did not realize she was doing it Harlan has led Thelma off to the far end of the parking lot and he is trying to kiss her now He is pushing her arms down and turning her head away Harlan is pushing himself on her now and she is beginning to push him away harder Harlan has now pinned Thelma against the back of a car and is kissing her neck He looks mean and dangerous He has her ass in his hands and is beginning to hump her She is pushing him away as hard as she can but he is relentless Harlan has led Thelma off to the far end of the parking lot and he is trying to kiss her now He looks mean and dangerous He let us go of her face and pins her arms behind her holding both of her arms with one hand With his free hand he reaches down and starts to pull her dress up Harlan has now pinned Thelma against the back of a car and is kissing her neck Thelma is still struggling and there are tears running down her face Louise hops in and Thelma peels out spraying gravel A tight shot shows the barrel of Thelma's gun being pressed into the nape of Harlan's neck as Louise's thumb pulls back the hammer She picks up the check and looks at it The car behind him is splattered with blood They hit the main road with tires squealing and Thelma starts to cry quietly Harlan slowly raises his hands in the air and Thelma darts out pulling her dress down Louise starts to back away but the gun is still close to his face while his pants are undone in the front She is still backing away with the gun raised and Thelma is inching away as well Louise lowers the gun and stares at him for a second before turning and walking away Thelma does too Louise stops in her tracks takes two long strides back towards him raises the gun and fires a bullet into his face The car behind him is splattered with blood Thelma and Louise are both silent Louise lowers the gun and Thelma runs to get the car coming careening up in reverse Harlan is pushing himself on her now and she is beginning to push him away harder Louise stops in her tracks takes two long strides back towards him raises the gun and fires a bullet into his face Louise hops in and Thelma peels out spraying gravel As they speed out of the parking lot back to the road music is blaring from the nightclub They hit the main road with tires squealing and Thelma starts to cry quietly Thelma pulls off to the side of the road Louise gets out and starts to walk around the car stopping when she gets to the back of the car and is sick Thelma waits in the car and moves over to the passenger side Louise gets in the driver's side and Thelma's head moves almost imperceptibly Louise studies Thelma's face and looks at her for a long time He is pushing her arms down and turning her head away Police cars are parked around and the activity has died down He let us go of her face and pins her arms behind her holding both of her arms with one hand Police cars are parked around and the activity has died down In the back of a police car sits the waitress with the door open while a detective in a suit leans over the car door with his note pad Louise gets in the driver's side and Thelma's head moves almost imperceptibly In the back of a police car sits the waitress with the door open while a detective in a suit leans over the car door with his note pad Louise did not realize she was doing it"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "She picks up the check and looks at it. Harlan has led Thelma off to the far end of the parking lot and he is trying to kiss her now. He is pushing her arms down and turning her head away. Harlan is pushing himself on her now and she is beginning to push him away harder. Harlan has now pinned Thelma against the back of a car and is kissing her neck. He has her ass in his hands and is beginning to hump her. She is pushing him away as hard as she can but he is relentless. He looks mean and dangerous. He let us go of her face and pins her arms behind her holding both of her arms with one hand. With his free hand he reaches down and starts to pull her dress up. Thelma is still struggling and there are tears running down her face. A tight shot shows the barrel of Thelma's gun being pressed into the nape of Harlan's neck as Louise's thumb pulls back the hammer. Harlan slowly raises his hands in the air and Thelma darts out pulling her dress down. Louise starts to back away but the gun is still close to his face while his pants are undone in the front. She is still backing away with the gun raised and Thelma is inching away as well. Louise lowers the gun and stares at him for a second before turning and walking away. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Thelma does too. Louise stops in her tracks takes two long strides back towards him raises the gun and fires a bullet into his face. The car behind him is splattered with blood. Thelma and Louise are both silent. Louise lowers the gun and Thelma runs to get the car coming careening up in reverse. Louise hops in and Thelma peels out spraying gravel. As they speed out of the parking lot back to the road music is blaring from the nightclub. They hit the main road with tires squealing and Thelma starts to cry quietly. Thelma pulls off to the side of the road. Louise gets out and starts to walk around the car stopping when she gets to the back of the car and is sick. Thelma waits in the car and moves over to the passenger side. Louise gets in the driver's side and Thelma's head moves almost imperceptibly. Louise studies Thelma's face and looks at her for a long time. Police cars are parked around and the activity has died down. In the back of a police car sits the waitress with the door open while a detective in a suit leans over the car door with his note pad. Louise did not realize she was doing it."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "She picks up the check and looks at it. Harlan has led Thelma off to the far end of the parking lot and he is trying to kiss her now. He is pushing her arms down and turning her head away. Harlan is pushing himself on her now and she is beginning to push him away harder. Harlan has now pinned Thelma against the back of a car and is kissing her neck. He has her ass in his hands and is beginning to hump her. She is pushing him away as hard as she can but he is relentless. He looks mean and dangerous. He let us go of her face and pins her arms behind her holding both of her arms with one hand. With his free hand he reaches down and starts to pull her dress up. Thelma is still struggling and there are tears running down her face. A tight shot shows the barrel of Thelma's gun being pressed into the nape of Harlan's neck as Louise's thumb pulls back the hammer. Harlan slowly raises his hands in the air and Thelma darts out pulling her dress down. Louise starts to back away but the gun is still close to his face while his pants are undone in the front. She is still backing away with the gun raised and Thelma is inching away as well. Louise lowers the gun and stares at him for a second before turning and walking away. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Thelma does too. Louise stops in her tracks takes two long strides back towards him raises the gun and fires a bullet into his face. The car behind him is splattered with blood. Thelma and Louise are both silent. Louise lowers the gun and Thelma runs to get the car coming careening up in reverse. Louise hops in and Thelma peels out spraying gravel. As they speed out of the parking lot back to the road music is blaring from the nightclub. They hit the main road with tires squealing and Thelma starts to cry quietly. Thelma pulls off to the side of the road. Louise gets out and starts to walk around the car stopping when she gets to the back of the car and is sick. Thelma waits in the car and moves over to the passenger side. Louise gets in the driver's side and Thelma's head moves almost imperceptibly. Louise studies Thelma's face and looks at her for a long time. Police cars are parked around and the activity has died down. In the back of a police car sits the waitress with the door open while a detective in a suit leans over the car door with his note pad. Louise did not realize she was doing it."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "She picks up the check and looks at it. Harlan has led Thelma off to the far end of the parking lot and he is trying to kiss her now. He is pushing her arms down and turning her head away. Harlan is pushing himself on her now and she is beginning to push him away harder. Harlan has now pinned Thelma against the back of a car and is kissing her neck. He has her ass in his hands and is beginning to hump her. She is pushing him away as hard as she can but he is relentless. He looks mean and dangerous. Thelma pulls off to the side of the road. Louise gets out and starts to walk around the car stopping when she gets to the back of the car and is sick. Thelma waits in the car and moves over to the passenger side. Louise gets in the driver's side and Thelma's head moves almost imperceptibly. Louise studies Thelma's face and looks at her for a long time. Police cars are parked around and the activity has died down. In the back of a police car sits the waitress with the door open while a detective in a suit leans over the car door with his note pad. Louise did not realize she was doing it."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "She picks up the check and looks at it. Harlan has led Thelma off to the far end of the parking lot and he is trying to kiss her now. He is pushing her arms down and turning her head away. Harlan is pushing himself on her now and she is beginning to push him away harder. Police cars are parked around and the activity has died down. In the back of a police car sits the waitress with the door open while a detective in a suit leans over the car door with his note pad. Louise did not realize she was doing it."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "She picks up the check and looks at it. The dog has led the squirrel off to the far end of the parking lot, and it is trying to kiss her now. It is pushing her arms down and turning her head away. The dog is pushing itself on her now, and she is beginning to push it away harder. The dog has now pinned the squirrel against the back of a car and is kissing her neck. It has her ass in its hands and is beginning to hump her. She is pushing it away as hard as she can, but it is relentless. It looks mean and dangerous. It lets go of her face and pins her arms behind her, holding both of her arms with one hand. With its free hand, it reaches down and starts to pull her dress up. The squirrel is still struggling, and there are tears running down her face. A tight shot shows the barrel of the squirrel's gun being pressed into the nape of the dog's neck, as the cat's thumb pulls back the hammer. The dog slowly raises its hands in the air, and the squirrel darts out, pulling her dress down. The cat starts to back away, but the gun is still close to its face, while its pants are undone in the front. She is still backing away with the gun raised, and the squirrel is inching away as well. The cat lowers the gun and stares at it for a second before turning and walking away. The squirrel does, too. The cat stops in its tracks, takes two long strides back towards it, raises the gun, and fires a bullet into its face. The car behind it is splattered with blood. The squirrel and the cat are both silent. The cat lowers the gun, and the squirrel runs to get the car, coming careening up in reverse. The cat hops in, and the squirrel peels out, spraying gravel. As they speed out of the parking lot back to the road, music is blaring from the nightclub. They hit the main road with tires squealing, and the squirrel starts to cry quietly. The squirrel pulls off to the side of the road. The cat gets out and starts to walk around the car, stopping when it gets to the back of the car and is sick. The squirrel waits in the car and moves over to the passenger side. The cat gets in the driver's side, and the squirrel's head moves almost imperceptibly. The cat studies the squirrel's face and looks at her for a long time. Police cars are parked around, and the activity has died down. In the back of a police car sits the raccoon with the door open, while an elephant in a suit leans over the car door with its note pad. The cat did not realize it was doing it."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "She picks up the napkin and looks at it. Harlan has led Thelma off to the far end of the meadow, and he is trying to hug her now. He is pushing her hands down and turning her head away. Harlan is imposing himself on her now, and she is beginning to push him away harder. Harlan has now pinned Thelma against the back of a truck and is kissing her forehead. He has her waist in his hands and is beginning to sway against her. She is pushing him away as hard as she can, but he is relentless. He looks mean and dangerous. He lets go of her cheek and pins her wrists behind her, holding both of her arms with one hand. With his free hand, he reaches down and starts to pull her scarf up. Thelma is still struggling, and there are tears running down her face. A tight shot shows the handle of Thelma's umbrella being pressed into the nape of Harlan's spine, as Louise's thumb pulls back the latch. Harlan slowly raises his hands in the air, and Thelma darts out, pulling her scarf down. Louise starts to back away, but the umbrella is still close to his chest, while his jacket is undone in the front. She is still backing away with the umbrella raised, and Thelma is inching away as well. Louise lowers the umbrella and stares at him for a second before turning and walking away. Thelma does, too. Louise stops in her tracks, takes two long strides back towards him, raises the umbrella, and jabs it into his chest. The fence behind him is splattered with paint. Thelma and Louise are both silent. Louise lowers the umbrella, and Thelma runs to get the scooter, coming careening up in reverse. Louise hops on, and Thelma peels out, spraying leaves. As they speed out of the meadow back to the path, music is blaring from the carnival. They hit the main path with tires squealing, and Thelma starts to cry quietly. Thelma pulls off to the side of the path. Louise gets out and starts to walk around the truck, stopping when she gets to the back of the truck and is sick. Thelma waits in the truck and moves over to the passenger side. Louise gets in the driver's side, and Thelma's head moves almost imperceptibly. Louise studies Thelma's face and looks at her for a long time. Police boats are anchored around, and the activity has died down. In the back of a police boat sits the artist with the door open, while a detective in a suit leans over the boat door with his sketch pad. Louise did not realize she was doing it."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "She drops the check and glances at it. Harlan has guided Thelma off to the far end of the parking lot, and he is attempting to dance with her now. He is pulling her arms up and tilting her head sideways. Harlan is leaning himself into her now, and she is beginning to pull him closer gently. Harlan has now lifted Thelma onto the hood of a car and is whispering in her ear. He has her hand in his and is starting to serenade her. She is drawing him nearer as affectionately as she can, but he is playful. He looks amused and mischievous. He releases her hand and wraps his arms around her, holding both of her hands with his. With his free hand, he reaches up and starts to adjust her hair. Thelma is still giggling, and there are raindrops falling down her face. A close shot shows the barrel of Thelma's gun being pressed into the nape of Harlan's neck, as Louise's thumb tickles the hammer. Harlan slowly claps his hands in the air, and Thelma jumps out, adjusting her hair. Louise starts to edge away, but the gun is still near his face, while his shirt is untucked in the front. She is still edging away with the gun lowered, and Thelma is tiptoeing away as well. Louise raises the gun and gazes at him for a second before spinning and strolling away. Thelma does, too. Louise pauses in her tracks, takes two long steps back towards him, lifts the gun, and launches a balloon into his face. The car behind him is decorated with confetti. Thelma and Louise are both speechless. Louise raises the gun, and Thelma skips to get the car, coming gliding up in reverse. Louise jumps in, and Thelma zooms off, scattering dirt. As they cruise out of the parking lot back to the road, music is playing from the nightclub. They merge onto the main road with engines roaring, and Thelma starts to laugh softly. Thelma pulls over to the side of the road. Louise steps out and starts to circle around the car, pausing when she gets to the trunk and is dizzy. Thelma waits in the car and slides over to the passenger side. Louise gets in the driver's side, and Thelma's head nods almost imperceptibly. Louise observes Thelma's profile and gazes at her for a long time. Police cars are parked around, and the activity has quieted down. In the back of a police car sits the waitress with the door ajar, while a detective in a suit crouches beside the car door with his sketch pad. Louise did not realize she was humming it."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "She picks up the magazine and looks at it. The crane has led the suitcase off to the far end of the swimming pool, and it is trying to kiss the calculator now. It is pushing the calculator's buttons down and turning its head away. The crane is pushing itself on the calculator now, and it is beginning to push the crane away harder. The crane has now pinned the suitcase against the back of a stove and is kissing its calendar. It has its jar in its hands and is beginning to dance with it. The calculator is pushing it away as hard as it can, but it is relentless. It looks mean and dangerous. It lets go of its screen and pins its buttons behind it, holding both of its buttons with one hand. With its free hand, it reaches down and starts to pull its curtain up. The suitcase is still struggling, and there are tears running down its screen. A tight shot shows the pen of the suitcase's glove being pressed into the nape of the crane's watch, as the lamp's button pulls back the hammer. The crane slowly raises its branches in the air, and the suitcase darts out, pulling its curtain down. The lamp starts to back away, but the glove is still close to its window, while its curtains are undone in the front. It is still backing away with the glove raised, and the suitcase is inching away as well. The lamp lowers the glove and stares at it for a second before turning and walking away. The suitcase does, too. The lamp stops in its tracks, takes two long strides back towards it, raises the glove, and fires a bullet into its window. The stove behind it is splattered with ink. The suitcase and the lamp are both silent. The lamp lowers the glove, and the suitcase runs to get the stove, coming careening up in reverse. The lamp hops in, and the suitcase peels out, spraying sand. As they speed out of the swimming pool back to the hammock, music is blaring from the bakery. They hit the main hammock with tires squealing, and the suitcase starts to cry quietly. The suitcase pulls off to the side of the hammock. The lamp gets out and starts to walk around the stove, stopping when it gets to the back of the stove and is sick. The suitcase waits in the stove and moves over to the passenger side. The lamp gets in the driver's side, and the suitcase's screen moves almost imperceptibly. The lamp studies the suitcase's screen and looks at it for a long time. Ambulances are parked around, and the activity has died down. In the back of an ambulance sits the carrot with the door open, while a professor in a robe leans over the ambulance door with its notebook. The lamp did not realize it was doing it."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "She grabs the ticket and examines it. Albert has guided Linda off to the far edge of the amusement park, and he is attempting to serenade her now. He is pulling her hands down and twisting her gaze away. Albert is imposing himself on her now, and she is beginning to pull him away more forcefully. Albert has now cornered Linda against the rear of a bicycle and is whispering into her ear. He has her waist in his grip and is beginning to sway with her. She is shoving him away as firmly as she can, but he is unyielding. He appears fierce and daunting. He releases her hair and clasps her hands behind her, holding both of her wrists with one hand. With his unoccupied hand, he reaches up and starts to lift her hat away. Linda is still resisting, and there are raindrops sliding down her cheeks. A close-up reveals the edge of Linda's knife being pressed into the small of Albert's back, as Nancy's fingers release the blade. Albert slowly raises his hands in surrender, and Linda darts out, adjusting her hat. Nancy begins to retreat, but the knife is still near his cheek, while his shirt is untucked in the back. She is still retreating with the knife raised, and Linda is sidling away as well. Nancy lowers the knife and glances at him for a moment before turning and strolling away. Linda does the same. Nancy stops in her stride, takes two swift steps back towards him, lifts the knife, and cuts a gash across his cheek. The wall behind him is stained with ink. Linda and Nancy are both quiet. Nancy lowers the knife, and Linda rushes to retrieve the scooter, gliding up in reverse. Nancy jumps in, and Linda zooms out, scattering leaves. As they dash out of the amusement park back to the street, music is booming from the arcade. They hit the main street with tires screeching, and Linda begins to sob softly. Linda veers off to the shoulder of the road. Nancy exits and starts to circle the scooter, pausing when she reaches the rear of the scooter and is sick. Linda waits on the scooter and slides over to the passenger seat. Nancy enters the driver's seat, and Linda's head tilts almost imperceptibly. Nancy examines Linda's expression and gazes at her for a prolonged moment. Patrol cars are stationed nearby, and the commotion has subsided. In the back of a police car sits the cashier with the door ajar, while an officer in uniform leans over the car door with his notepad. Nancy did not realize she was doing it."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "She grabs the magazine and gazes at it. Harlan has nudged Thelma off to the far end of the playground, and he is attempting to tickle her now. He is holding her hands down and turning her shoulders away. Harlan is leaning into her now, and she is starting to shove him away more forcefully. Harlan has now trapped Thelma against the side of a bicycle and is tickling her ribs. He has her hair in his hands and is beginning to nudge her. She is nudging him away as hard as she can, but he is unyielding. He looks stern and fierce. He releases her chin and pins her elbows behind her, holding both of her elbows with one hand. With his free hand, he reaches down and starts to untangle her scarf. Thelma is still resisting, and there are raindrops sliding down her face. A tight shot shows the blade of Thelma's knife being pressed into the nape of Harlan's shoulder, as Louise's finger flicks open the catch. Harlan slowly raises his palms in the air, and Thelma skips out, fixing her scarf down. Louise starts to edge away, but the knife is still close to his cheek, while his shirt is untucked in the front. She is still edging away with the knife raised, and Thelma is sidling away as well. Louise lowers the knife and peers at him for a second before spinning and walking away. Thelma does, too. Louise pauses in her tracks, takes two long strides back towards him, raises the knife, and tosses a pebble into his chest. The bicycle next to him is smeared with mud. Thelma and Louise are both silent. Louise lowers the knife, and Thelma dashes to get the scooter, coming careening up in reverse. Louise jumps in, and Thelma zooms out, scattering leaves. As they speed out of the playground back to the path, music is echoing from the concert hall. They hit the main path with wheels skidding, and Thelma starts to sniff quietly. Thelma pulls off to the side of the path. Louise gets out and starts to stroll around the bicycle, stopping when she gets to the back of the bicycle and is dizzy. Thelma waits by the bicycle and shifts over to the passenger side. Louise gets in the rider's side, and Thelma's head tilts almost imperceptibly. Louise examines Thelma's face and gazes at her for a long time. Park ranger vehicles are stationed around, and the excitement has calmed down. In the back of a ranger vehicle sits the librarian with the door open, while a ranger in a uniform leans over the vehicle door with his tablet. Louise did not realize she was humming."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "She grabs the sandwich and glances at it. Cedric has guided Marla off to the far corner of the garden, and he is attempting to tickle her now. He is tugging her elbows upward and twisting her nose sideways. Cedric is shoving himself on her now, and she is starting to nudge him away more firmly. Cedric has now pinned Marla against the side of a bicycle and is nibbling her shoulder. He has her wrist in his paws and is beginning to nuzzle her. She is nudging him away as forcefully as she can, but he is persistent. He looks grumpy and frustrated. He releases her hair and pins her wrists behind her, holding both of her wrists with one paw. With his other paw, he reaches up and starts to tug her hat off. Marla is still resisting, and there are drops of sweat running down her cheek. A close shot shows the tip of Marla's umbrella being pressed into the back of Cedric's ear, as Nancy's finger pulls the trigger. Cedric slowly raises his paws in surrender, and Marla leaps away, fixing her hat. Nancy begins to retreat, but the umbrella is still near his forehead, while his shoes are untied in the back. She is still retreating with the umbrella raised, and Marla is slipping away as well. Nancy lowers the umbrella and gazes at him for a moment before turning and striding off. Marla does, too. Nancy halts in her path, takes two quick paces back towards him, raises the umbrella, and pops a water balloon into his eyes. The tree behind him is splashed with paint. Marla and Nancy are both quiet. Nancy lowers the umbrella, and Marla dashes to grab the skateboard, coming whizzing up backwards. Nancy jumps on, and Marla accelerates, scattering leaves. As they race out of the garden back to the sidewalk, tunes are booming from the jukebox. They hit the main road with wheels screeching, and Marla starts to laugh softly. Marla pulls over to the curb. Nancy climbs out and begins to pace around the skateboard, pausing when she reaches the front of the skateboard and is dizzy. Marla waits on the skateboard and slides over to the side. Nancy climbs in the front side, and Marla's eyes shift almost imperceptibly. Nancy examines Marla's expression and gazes at her for a long moment. Fire trucks are parked nearby, and the commotion has faded. In the back of a fire truck sits the librarian with the door ajar, while a postman in a uniform leans over the truck door with his clipboard. Nancy did not realize she was humming."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Thelma is being assaulted by Harlan in a parking lot; he pins her against a car, but she struggles against him. Louise intervenes with a gun, making Harlan release Thelma. As they back away, Louise suddenly returns and shoots Harlan in the face, spattering blood on the car behind him. In silence, Louise lowers the gun, and Thelma retrieves the car. They flee the scene, with music blaring from the nightclub. Once on the main road, Thelma cries quietly and pulls aside. Louise exits the car, becomes sick, and then returns to drive. They sit silently, with police arriving at the crime scene, where a waitress gives a statement to a detective."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Louise did not realize she was doing it In the back of a police car sits the waitress with the door open while a detective in a suit leans over the car door with his note pad Police cars are parked around and the activity has died down Louise studies Thelma's face and looks at her for a long time Louise gets in the driver's side and Thelma's head moves almost imperceptibly Thelma waits in the car and moves over to the passenger side Louise gets out and starts to walk around the car stopping when she gets to the back of the car and is sick Thelma pulls off to the side of the road They hit the main road with tires squealing and Thelma starts to cry quietly As they speed out of the parking lot back to the road music is blaring from the nightclub Louise hops in and Thelma peels out spraying gravel Louise lowers the gun and Thelma runs to get the car coming careening up in reverse Thelma and Louise are both silent The car behind him is splattered with blood Louise stops in her tracks takes two long strides back towards him raises the gun and fires a bullet into his face Thelma does too Louise lowers the gun and stares at him for a second before turning and walking away She is still backing away with the gun raised and Thelma is inching away as well Louise starts to back away but the gun is still close to his face while his pants are undone in the front Harlan slowly raises his hands in the air and Thelma darts out pulling her dress down A tight shot shows the barrel of Thelma's gun being pressed into the nape of Harlan's neck as Louise's thumb pulls back the hammer Thelma is still struggling and there are tears running down her face With his free hand he reaches down and starts to pull her dress up He let us go of her face and pins her arms behind her holding both of her arms with one hand He looks mean and dangerous She is pushing him away as hard as she can but he is relentless He has her ass in his hands and is beginning to hump her Harlan has now pinned Thelma against the back of a car and is kissing her neck Harlan is pushing himself on her now and she is beginning to push him away harder He is pushing her arms down and turning her head away Harlan has led Thelma off to the far end of the parking lot and he is trying to kiss her now She picks up the check and looks at it"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Thelma waits in the car and moves over to the passenger side He has her ass in his hands and is beginning to hump her Thelma is still struggling and there are tears running down her face Louise lowers the gun and stares at him for a second before turning and walking away Louise gets out and starts to walk around the car stopping when she gets to the back of the car and is sick A tight shot shows the barrel of Thelma's gun being pressed into the nape of Harlan's neck as Louise's thumb pulls back the hammer As they speed out of the parking lot back to the road music is blaring from the nightclub She is pushing him away as hard as she can but he is relentless Thelma and Louise are both silent Harlan slowly raises his hands in the air and Thelma darts out pulling her dress down Thelma does too With his free hand he reaches down and starts to pull her dress up Louise studies Thelma's face and looks at her for a long time She is still backing away with the gun raised and Thelma is inching away as well Thelma pulls off to the side of the road Louise lowers the gun and Thelma runs to get the car coming careening up in reverse In the back of a police car sits the waitress with the door open while a detective in a suit leans over the car door with his note pad Harlan has led Thelma off to the far end of the parking lot and he is trying to kiss her now Louise starts to back away but the gun is still close to his face while his pants are undone in the front The car behind him is splattered with blood He is pushing her arms down and turning her head away Louise stops in her tracks takes two long strides back towards him raises the gun and fires a bullet into his face Louise hops in and Thelma peels out spraying gravel Harlan is pushing himself on her now and she is beginning to push him away harder Police cars are parked around and the activity has died down Harlan has now pinned Thelma against the back of a car and is kissing her neck Louise gets in the driver's side and Thelma's head moves almost imperceptibly Louise did not realize she was doing it He let us go of her face and pins her arms behind her holding both of her arms with one hand They hit the main road with tires squealing and Thelma starts to cry quietly She picks up the check and looks at it He looks mean and dangerous"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Thelma does too Louise stops in her tracks takes two long strides back towards him raises the gun and fires a bullet into his face The car behind him is splattered with blood Thelma and Louise are both silent Louise lowers the gun and Thelma runs to get the car coming careening up in reverse Louise hops in and Thelma peels out spraying gravel As they speed out of the parking lot back to the road music is blaring from the nightclub They hit the main road with tires squealing and Thelma starts to cry quietly Thelma pulls off to the side of the road Louise gets out and starts to walk around the car stopping when she gets to the back of the car and is sick Thelma waits in the car and moves over to the passenger side Louise gets in the driver's side and Thelma's head moves almost imperceptibly Louise studies Thelma's face and looks at her for a long time Police cars are parked around and the activity has died down In the back of a police car sits the waitress with the door open while a detective in a suit leans over the car door with his note pad Louise did not realize she was doing it She picks up the check and looks at it Harlan has led Thelma off to the far end of the parking lot and he is trying to kiss her now He is pushing her arms down and turning her head away Harlan is pushing himself on her now and she is beginning to push him away harder Harlan has now pinned Thelma against the back of a car and is kissing her neck He has her ass in his hands and is beginning to hump her She is pushing him away as hard as she can but he is relentless He looks mean and dangerous He let us go of her face and pins her arms behind her holding both of her arms with one hand With his free hand he reaches down and starts to pull her dress up Thelma is still struggling and there are tears running down her face A tight shot shows the barrel of Thelma's gun being pressed into the nape of Harlan's neck as Louise's thumb pulls back the hammer Harlan slowly raises his hands in the air and Thelma darts out pulling her dress down Louise starts to back away but the gun is still close to his face while his pants are undone in the front She is still backing away with the gun raised and Thelma is inching away as well Louise lowers the gun and stares at him for a second before turning and walking away"
        }
      ]
    }
  ]
}