{
  "ground_truth": "Lee glances over her shoulder, then turns from the doorway and walks away. The camera follows her, moving across a book-and-photograph-filled bookshelf that obscures her from view as she walks into a crowded, comfortable vestibule. People, some holding drinks, some just entering the apartment, surround her. Everyone is talking at once, carrying on easy, familiar conversation. Lee smiles at the various people, exchanging greetings. Lee walks into the living room, turning her head back for a moment to talk to the child she has just hugged. The camera is still moving with Lee as she smiles and stops to chat with her mother. Lee starts to walk off again, finishing her conversation with her mother. She passes several other guests, then turns to greet April, giving her a warm, brief hug. Elliot's voice-over continues as he is actually seen, standing in a doorway having a conversation with a gesturing, rotund man. Both are holding drinks as Lee, carrying a tray of hors d'oeuvres and two drinks, walks between them. The space is very tight; the men hold up their drinks to make room for her. Elliot watches Lee walk off; the other man, oblivious, continues to talk. Elliot reluctantly returns to the conversation, but he can't help turning his head to gaze at the offscreen Lee as the other man chatters on. The camera resumes following a smiling Lee. She has just put down the tray and drinks near April, and briskly and obliviously, she walks past a doorway where Elliot, still ruminating, watches her, entranced. The camera stays with Elliot, who is still watching the offscreen Lee. In the background, guests continue to chatter warmly with each other. Hannah, carrying a tray of hors d'oeuvres, walks up behind the distracted Elliot. Elliot, taking one of the hors d'oeuvres, starts nibbling as well as he and Hannah walk past the bookshelf into the living room. Elliot and Hannah, eating and talking, walk past a hallway and offscreen as Holly appears, walking down the hallway. She holds a drink and a plate of hors d'oeuvres; she stands at the entrance to the hallway, eating and looking at the offscreen guests. Holly, standing in the hallway onscreen, swallows loudly. Holly takes a sip of her drink as Hannah and Elliot walk over to her. Holly and Hannah begin to laugh. Hannah, licking her fingers, walks past a memo-cluttered refrigerator to the stove as Holly, behind her, begins to speak. As Holly talks, sipping her drink, Hannah busily works in the kitchen, which contains a large center table stacked with bowls and plates of food, hanging pots and pans, and general party clutter. She walks on-and-offscreen as she talks and listens to her sister.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Lee glances over her shoulder, then turns from the doorway and walks away. The camera follows her, moving across a book-and-photograph-filled bookshelf that obscures her from view as she walks into a crowded, comfortable entryway. People, some holding beverages, some just entering the apartment, surround her. Everyone is talking at once, carrying on easy, familiar conversation. Lee smiles at the various people, exchanging greetings. Lee walks into the living room, turning her head back for a moment to talk to the child she has just hugged. The camera is still moving with Lee as she smiles and stops to chat with her mother. Lee starts to walk off again, finishing her conversation with her mother. She passes several other guests, then turns to greet April, giving her a warm, brief hug. Elliot's voice-over continues as he is actually seen, standing in a doorway having a conversation with a gesturing, rotund man. Both are holding drinks as Lee, carrying a tray of hors d'oeuvres and two drinks, walks between them. The space is very tight; the men hold up their drinks to make room for her. Elliot watches Lee walk off; the other man, oblivious, continues to talk. Elliot reluctantly returns to the conversation, but he can't help turning his head to gaze at the offscreen Lee as the other man chatters on. The camera resumes following a smiling Lee. She has just put down the tray and drinks near April, and briskly and obliviously, she walks past a doorway where Elliot, still ruminating, watches her, entranced. The camera stays with Elliot, who is still watching the offscreen Lee. In the background, guests continue to chatter warmly with each other. Hannah, carrying a tray of hors d'oeuvres, walks up behind the distracted Elliot. Elliot, taking one of the hors d'oeuvres, starts nibbling as well as he and Hannah walk past the bookshelf into the living room. Elliot and Hannah, eating and talking, walk past a hallway and offscreen as Holly appears, walking down the hallway. She holds a drink and a plate of hors d'oeuvres; she stands at the entrance to the hallway, eating and looking at the offscreen guests. Holly, standing in the hallway onscreen, swallows loudly. Holly takes a sip of her drink as Hannah and Elliot walk over to her. Holly and Hannah begin to laugh. Hannah, licking her fingers, walks past a memo-cluttered refrigerator to the stove as Holly, behind her, begins to speak. As Holly talks, sipping her drink, Hannah busily works in the kitchen, which contains a large center table stacked with bowls and plates of food, hanging pots and pans, and general party clutter. She walks on-and-offscreen as she talks and listens to her sister."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Lee's shoulder is glanced over by her, then the doorway is turned from by her, and away is walked by her. She is followed by the camera, and a book-and-photograph-filled bookshelf that obscures her from view is moved across as a crowded, comfortable vestibule is walked into by her. She is surrounded by people, some holding drinks, some just entering the apartment. At once, everyone is talking, carrying on easy, familiar conversation. Various people are smiled at by Lee, and greetings are exchanged. The living room is walked into by Lee, her head is turned back for a moment by her to talk to the child by whom she was just hugged. With Lee, the camera is still moving as her mother is smiled at and chatted with by her. Lee starts to walk off again, and her conversation with her mother is finished. Several other guests are passed by her, then to greet April, she turns, a warm, brief hug is given by her. Elliot continues his voice-over as, standing in a doorway, he is actually seen having a conversation with a gesturing, rotund man. Drinks are held by both as, carrying a tray of hors d'oeuvres and two drinks, Lee walks between them. The space is very tight; their drinks are held up by the men to make room for her. Lee is watched walking off by Elliot; the other man, oblivious, continues to talk. Reluctantly, Elliot returns to the conversation, but his head is turned by him to gaze at the offscreen Lee as the other man chatters on. A smiling Lee is resumed being followed by the camera. The tray and drinks are just put down by her near April, and briskly and obliviously, a doorway is walked past by her where she is watched, entranced, by the still ruminating Elliot. Elliot, who is still watching the offscreen Lee, is stayed with by the camera. In the background, with each other, guests continue to chatter warmly. Behind the distracted Elliot, Hannah, carrying a tray of hors d'oeuvres, walks up. One of the hors d'oeuvres is taken by Elliot, and as he and Hannah walk past the bookshelf into the living room, nibbling is started by him. Eating and talking, Elliot and Hannah walk past a hallway and offscreen as Holly appears, walking down the hallway. She holds a drink and a plate of hors d'oeuvres; at the entrance to the hallway, she stands, eating and looking at the offscreen guests. Holly, standing in the hallway onscreen, loudly swallows. Her drink is sipped by Holly as Hannah and Elliot walk over to her. Laughter is begun by Holly and Hannah. Her fingers are licked by Hannah as past a memo-cluttered refrigerator to the stove, she walks, while Holly, behind her, begins to speak. As her drink is sipped by Holly, talking is busily done by Hannah, who works in the kitchen, which contains a large center table stacked with bowls and plates of food, hanging pots and pans, and general party clutter. She talks and listens to her sister as walking on-and-offscreen is done by her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Lee glances over her shoulder, turns from the doorway, and walks away. The camera follows her past a bookshelf filled with books and photos, obscuring her as she enters a crowded, cozy vestibule. Surrounded by people holding drinks and entering the apartment, everyone engages in easy, familiar conversation. Lee smiles, exchanging greetings, and enters the living room, briefly talking to a child she just hugged. The camera follows Lee as she chats with her mother, then moves on, greeting April with a warm hug. Elliot's voice-over continues as he stands in a doorway, conversing with a gesturing, rotund man. Both hold drinks as Lee, carrying a tray of hors d'oeuvres and drinks, walks between them. The space is tight; the men lift their drinks to make room. Elliot watches Lee walk off, while the other man continues talking. Elliot reluctantly returns to the conversation but keeps glancing at Lee. The camera follows a smiling Lee, who places the tray near April and walks past a doorway where Elliot watches her, entranced. The camera stays with Elliot, still watching Lee. Guests continue to chat warmly. Hannah, with a tray of hors d'oeuvres, approaches Elliot. He takes one, nibbling as he and Hannah walk past the bookshelf into the living room. They walk past a hallway as Holly appears, holding a drink and hors d'oeuvres, standing at the hallway entrance, eating and observing guests. Holly swallows loudly, sips her drink, and laughs with Hannah. Hannah, licking her fingers, walks past a memo-covered refrigerator to the stove as Holly begins to speak. As Holly talks, sipping her drink, Hannah busily works in the kitchen, filled with a large table stacked with food, hanging pots, and party clutter, moving on-and-offscreen while talking and listening to her sister."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Lee glances over her shoulder, turns from the doorway, and walks away. The camera follows her past a bookshelf into a crowded vestibule. Surrounded by people holding drinks and chatting, Lee exchanges greetings. She enters the living room, talks to a child she hugged, and chats with her mother. Lee greets April with a brief hug. Elliot, seen in a doorway with a gesturing man, watches Lee pass with hors d'oeuvres and drinks. The men make room for her. Elliot, distracted, watches Lee walk off. The camera follows Lee as she places the tray near April and walks past Elliot, who is entranced. Guests continue chatting. Hannah, with hors d'oeuvres, approaches Elliot. They nibble and walk into the living room. Holly appears, holding a drink and hors d'oeuvres, and stands in the hallway. She sips her drink as Hannah and Elliot join her, and they laugh. Hannah moves to the kitchen, working busily while Holly talks and sips her drink. The kitchen is cluttered with food and cookware."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Lee, with a quick glance over her shoulder, turns away from the doorway and begins to walk away. The camera smoothly follows her movement, panning across a bookshelf filled with an array of books and photographs, which momentarily obscures her from view as she makes her way into a bustling, cozy vestibule. The space is filled with people, some of whom are holding drinks, while others are just entering the apartment, creating a lively atmosphere around her. The air is filled with the sound of everyone talking at once, engaging in easy, familiar conversations. Lee, with a warm smile, acknowledges the various people around her, exchanging friendly greetings. She continues into the living room, briefly turning her head back to speak to the child she has just embraced. The camera remains focused on Lee as she smiles and pauses to chat with her mother. After finishing her conversation, Lee resumes walking, passing by several other guests before turning to greet April with a warm, albeit brief, hug. Meanwhile, Elliot's voice-over continues as he is seen standing in a doorway, engaged in a conversation with a gesturing, rotund man. Both men are holding drinks as Lee, balancing a tray of hors d'oeuvres and two drinks, navigates between them. The space is quite tight, prompting the men to lift their drinks to make room for her passage. Elliot watches Lee as she walks away; the other man, seemingly unaware, continues to talk. Elliot reluctantly returns his attention to the conversation, but he can't resist turning his head to gaze at the offscreen Lee as the other man chatters on. The camera resumes its focus on a smiling Lee. She has just placed the tray and drinks near April and, with a brisk and oblivious demeanor, walks past a doorway where Elliot, still deep in thought, watches her, captivated. The camera lingers with Elliot, who remains fixated on the offscreen Lee. In the background, guests continue to engage in warm, lively chatter with one another. Hannah, carrying a tray of hors d'oeuvres, approaches the distracted Elliot from behind. Elliot, taking one of the hors d'oeuvres, begins to nibble as he and Hannah walk past the bookshelf into the living room. As they eat and converse, they walk past a hallway and offscreen, just as Holly appears, making her way down the hallway. She holds a drink and a plate of hors d'oeuvres, standing at the entrance to the hallway, eating and observing the offscreen guests. Holly, standing in the hallway onscreen, swallows audibly. She takes a sip of her drink as Hannah and Elliot approach her. Holly and Hannah begin to laugh together. Hannah, licking her fingers, walks past a memo-cluttered refrigerator towards the stove, while Holly, behind her, starts to speak. As Holly talks, sipping her drink, Hannah busily works in the kitchen, which features a large center table piled with bowls and plates of food, hanging pots and pans, and general party clutter. She moves on-and-offscreen as she talks and listens to her sister."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Lee, casting a swift glance over her shoulder, decisively turns away from the doorway and begins to gracefully stride away. The camera moves seamlessly alongside her, elegantly capturing her movement as it pans across a bookshelf brimming with a diverse collection of books and photographs. This collection momentarily conceals her from view as she navigates into a bustling, cozy vestibule. This inviting space is teeming with people; some of these individuals hold drinks, while others are in the process of entering the apartment, establishing a lively and animated atmosphere around her. The air is vibrant with the harmonious cacophony of everyone speaking simultaneously, engaging in easygoing and familiar conversations. Lee, adorned with a warm and welcoming smile, acknowledges the variety of people surrounding her, exchanging friendly and cordial greetings with those she passes. She continues into the living room, briefly turning her head back to speak briefly to a child she has just lovingly embraced. The camera maintains its focus on Lee as she smiles and pauses momentarily to engage in a conversation with her mother. After wrapping up her conversation, Lee resumes walking, passing by several additional guests before turning to greet April with a warm, albeit brief, hug. Meanwhile, Elliot's voice-over continues to play as he appears standing in a doorway, engaged in a conversation with a gesticulating, rotund man. Both men are holding drinks, creating a social tableau, as Lee, efficiently balancing a tray of hors d'oeuvres and two drinks, skillfully navigates between them. The space is somewhat cramped, prompting the men to instinctively lift their drinks to clear a path for her passage. Elliot keenly observes Lee as she moves away; the other man, seemingly oblivious, continues his talkative engagement. Elliot reluctantly shifts his attention back to the conversation, but he finds it hard to resist turning his head to gaze at the offscreen Lee as the other man chatters incessantly on. The camera returns its focus to a smiling Lee. She has just placed the tray and drinks adjacent to April and, with a brisk and unconcerned demeanor, strides past a doorway where Elliot, deep in contemplation, watches her intently, captivated by her presence. The camera lingers with Elliot, who remains steadfastly fixated on the offscreen Lee. Meanwhile, in the background, guests continue to engage in warm, lively exchanges with one another. Hannah, balancing a tray of hors d'oeuvres, approaches the distracted Elliot from behind. Elliot, taking one of the tempting hors d'oeuvres, begins to nibble as he and Hannah walk past the bookshelf and proceed into the living room. As they eat and converse with each other, they walk past a hallway and move offscreen, just as Holly makes her appearance, gracefully making her way down the hallway. She is seen clutching a drink and a plate of hors d'oeuvres, standing at the entrance to the hallway, eating and observing the guests who remain offscreen. Holly, standing in the hallway on the screen, swallows audibly. She takes a sip of her drink, savoring it, as Hannah and Elliot approach her. Holly and Hannah erupt into laughter together. Hannah, licking her fingers clean, walks past a memo-cluttered refrigerator toward the stove, while Holly, following her closely, begins to speak animatedly. As Holly talks, intermittently sipping her drink, Hannah works busily in the kitchen, which is centered around a large table piled with an assortment of bowls and plates of food, accompanied by hanging pots and pans, and the general delightful clutter of a lively party setting. She moves on-and-offscreen as she energetically talks and attentively listens to her sister’s conversation."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Lee glances over her shoulder, taking a moment to ensure everything is as it should be, then decisively turns away from the doorway and begins to walk away. The camera smoothly follows her movement, capturing the transition as it glides across a bookshelf filled with books and photographs, momentarily obscuring her from view. As Lee continues her path, she enters a crowded, comfortable vestibule where the atmosphere is lively and welcoming. People surround her, some holding drinks, others just stepping into the apartment, all engaged in animated, easy, and familiar conversations. Lee, maintaining her warm demeanor, smiles at the various people she encounters, exchanging friendly greetings as she navigates through the crowd. She makes her way into the living room, momentarily turning her head back to engage in a brief conversation with a child she has just hugged, ensuring the child feels acknowledged and loved. The camera remains focused on Lee as she continues to smile and stops to chat with her mother, sharing a moment of connection and warmth. After finishing her conversation with her mother, Lee resumes her walk, passing several other guests with a friendly nod or smile, before turning to greet April with a warm, brief hug that conveys their close relationship. Meanwhile, Elliot's voice-over continues, providing context as he is seen standing in a doorway, engaged in a conversation with a gesturing, rotund man. Both men hold drinks, their conversation animated, as Lee, now carrying a tray of hors d'oeuvres and two drinks, skillfully maneuvers between them in the tight space. The men instinctively lift their drinks to make room for her passage. Elliot's attention is drawn to Lee as she walks off, his gaze lingering on her, while the other man, unaware, continues to talk. Elliot, though reluctantly, returns his focus to the conversation, yet he can't resist turning his head to catch another glimpse of the offscreen Lee as the other man chatters on. The camera resumes its focus on a smiling Lee, who has just placed the tray and drinks near April, and briskly, almost obliviously, she walks past a doorway where Elliot, still deep in thought, watches her, captivated by her presence. The camera remains with Elliot, who continues to watch the offscreen Lee, his attention unwavering. In the background, the guests maintain their warm, lively chatter. Hannah, carrying a tray of hors d'oeuvres, approaches the distracted Elliot from behind. Elliot, without missing a beat, takes one of the hors d'oeuvres and begins nibbling as he and Hannah walk past the bookshelf into the living room, their conversation light and easy. As they eat and talk, they walk past a hallway and disappear offscreen, making way for Holly, who appears walking down the hallway. She holds a drink and a plate of hors d'oeuvres, pausing at the entrance to the hallway to eat and observe the offscreen guests. Holly, standing in the hallway, swallows audibly, then takes a sip of her drink as Hannah and Elliot approach her. Holly and Hannah share a laugh, their camaraderie evident. Hannah, licking her fingers clean, walks past a memo-cluttered refrigerator to the stove, while Holly, behind her, begins to speak. As Holly talks, sipping her drink, Hannah busily engages in tasks around the kitchen, which is filled with a large center table stacked with bowls and plates of food, hanging pots and pans, and the general clutter of a lively party. She moves on and offscreen, multitasking as she listens and responds to her sister, maintaining the flow of their conversation amidst the bustling kitchen environment."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Lee glances over her shoulder before turning away from the doorway and walking into a crowded, comfortable vestibule filled with people engaged in easy, familiar conversation. She exchanges smiles and greetings with various guests as she moves into the living room, briefly chatting with a child she has just hugged and then stopping to talk with her mother. After finishing her conversation, Lee continues through the room, greeting April with a warm hug. Meanwhile, Elliot is seen conversing with a gesturing man in a doorway, both holding drinks. Lee, carrying a tray of hors d'oeuvres and two drinks, navigates the tight space between them, prompting the men to lift their drinks to make room. Elliot watches Lee as she walks away, distracted from his conversation. The camera follows Lee as she places the tray and drinks near April and walks past a doorway where Elliot, still captivated, watches her. The scene shifts to Elliot, who remains focused on Lee, while guests continue their warm chatter in the background. Hannah approaches Elliot with a tray of hors d'oeuvres, and they nibble and chat as they move into the living room. As they walk past a hallway, Holly appears, holding a drink and a plate of hors d'oeuvres, observing the guests. She takes a sip of her drink as Hannah and Elliot join her, leading to shared laughter. Hannah, licking her fingers, moves past a memo-cluttered refrigerator to the stove, while Holly begins to speak. As Holly talks and sips her drink, Hannah busily works in the kitchen, which is filled with party clutter, moving on and offscreen as she engages with her sister."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Lee glances over her shoulder, then turns from the doorway of her Brooklyn apartment and walks away. The camera follows her, moving across a book-and-photograph-filled bookshelf, which features selections from her travels and family moments, that obscures her from view as she walks into a crowded, comfortable vestibule. The vestibule, a common feature in New York apartments for welcoming guests, is filled with people, some holding drinks like the signature cocktails often served at these gatherings, some just entering the apartment, surround her. Everyone is talking at once, carrying on easy, familiar conversation, reminiscent of long-time friends catching up after time apart. Lee smiles at the various people, exchanging greetings that reflect years of friendship. Lee walks into the living room, turning her head back for a moment to talk to the child she has just hugged, her niece visiting from out of town. The camera is still moving with Lee as she smiles and stops to chat with her mother, who is well-known in their family for her delicious homemade pastries. Lee starts to walk off again, finishing her conversation with her mother. She passes several other guests, including her college friends, then turns to greet April, giving her a warm, brief hug. April, known for her lively storytelling, is a highlight of these gatherings. Elliot's voice-over continues as he is actually seen, standing in a doorway having a conversation with a gesturing, rotund man, a jovial colleague from work. Both are holding drinks as Lee, carrying a tray of hors d'oeuvres including her famous mini quiches, and two drinks, walks between them. The space is very tight, a typical feature of urban apartments; the men hold up their drinks to make room for her. Elliot watches Lee walk off; the other man, oblivious to Elliot's distraction, continues to talk. Elliot reluctantly returns to the conversation, but he can't help turning his head to gaze at the offscreen Lee as the other man chatters on. The camera resumes following a smiling Lee. She has just put down the tray and drinks near April and briskly and obliviously, she walks past a doorway where Elliot, still ruminating about their earlier conversation, watches her, entranced. The camera stays with Elliot, who is still watching the offscreen Lee. In the background, guests continue to chatter warmly with each other, creating a lively atmosphere typical of Lee's well-attended parties. Hannah, carrying a tray of hors d'oeuvres, walks up behind the distracted Elliot. Elliot, taking one of the hors d'oeuvres, starts nibbling as well as he and Hannah walk past the bookshelf into the living room. Elliot and Hannah, eating and talking about their shared past memories at such gatherings, walk past a hallway and offscreen as Holly appears, walking down the hallway. She holds a drink and a plate of hors d'oeuvres; she stands at the entrance to the hallway, eating and looking at the offscreen guests, feeling the warmth of their shared history. Holly, standing in the hallway onscreen, swallows loudly, a habit her sisters often tease her about. Holly takes a sip of her drink as Hannah and Elliot walk over to her. Holly and Hannah begin to laugh, sharing a private joke. Hannah, licking her fingers, walks past a memo-cluttered refrigerator, which holds family photos and children's drawings, to the stove as Holly, behind her, begins to speak. As Holly talks, reminiscing about their childhood, sipping her drink, Hannah busily works in the kitchen, which contains a large center table stacked with bowls and plates of food, hanging pots and pans, and general party clutter, evidence of the hospitality for which she is known. She walks on-and-offscreen as she talks and listens to her sister, continuing their conversation amidst the bustling party."
        },
        {
          "id": "3.2",
          "name": "Addition (~50%)",
          "description": "Lee glances over her shoulder then turns from the doorway and walks away. The camera follows her moving across a bookandphotographfilled bookshelf that obscures her from view as she walks into a crowded comfortable vestibule. People some holding drinks some just entering the apartment surround her. Everyone is talking at once carrying on easy familiar conversation. Lee smiles at the various people exchanging greetings. Lee walks into the living room turning her head back for a moment to talk to the child she has just hugged. The camera is still moving with Lee as she smiles and stops to chat with her mother. Lee starts to walk off again finishing her conversation with her mother. She passes several other guests then turns to greet April giving her a warm brief hug. Elliot's voiceover continues as he is actually seen standing in a doorway having a conversation with a gesturing rotund man. Both are holding drinks as Lee carrying a tray of hors d'oeuvres and two drinks walks between them. The space is very tight. the men hold up their drinks to make room for her. Elliot watches Lee walk off. the other man oblivious continues to talk. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Elliot reluctantly returns to the conversation but he cannot help turning his head to gaze at the offscreen Lee as the other man chatters on. The camera resumes following a smiling Lee. She has just put down the tray and drinks near April and briskly and obliviously she walks past a doorway where Elliot still ruminating watches her entranced. The camera stays with Elliot who is still watching the offscreen Lee. In the background guests continue to chatter warmly with each other. Hannah carrying a tray of hors d'oeuvres walks up behind the distracted Elliot. Elliot taking one of the hors d'oeuvres starts nibbling as well as he and Hannah walk past the bookshelf into the living room. Elliot and Hannah eating and talking walk past a hallway and offscreen as Holly appears walking down the hallway. She holds a drink and a plate of hors d'oeuvres. she stands at the entrance to the hallway eating and looking at the offscreen guests. Holly standing in the hallway onscreen swallows loudly. Holly takes a sip of her drink as Hannah and Elliot walk over to her. Holly and Hannah begin to laugh. Hannah licking her fingers walks past a memocluttered refrigerator to the stove as Holly behind her begins to speak. As Holly talks sipping her drink Hannah busily works in the kitchen which contains a large center table stacked with bowls and plates of food hanging pots and pans and general party clutter. She walks onandoffscreen as she talks and listens to her sister."
        },
        {
          "id": "3.3",
          "name": "Addition (~80%)",
          "description": "Lee glances over her shoulder then turns from the doorway and walks away. The camera follows her moving across a bookandphotographfilled bookshelf that obscures her from view as she walks into a crowded comfortable vestibule. People some holding drinks some just entering the apartment surround her. Everyone is talking at once carrying on easy familiar conversation. Lee smiles at the various people exchanging greetings. Lee walks into the living room turning her head back for a moment to talk to the child she has just hugged. The camera is still moving with Lee as she smiles and stops to chat with her mother. Lee starts to walk off again finishing her conversation with her mother. She passes several other guests then turns to greet April giving her a warm brief hug. Elliot's voiceover continues as he is actually seen standing in a doorway having a conversation with a gesturing rotund man. Both are holding drinks as Lee carrying a tray of hors d'oeuvres and two drinks walks between them. The space is very tight. the men hold up their drinks to make room for her. Elliot watches Lee walk off. the other man oblivious continues to talk. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Elliot reluctantly returns to the conversation but he cannot help turning his head to gaze at the offscreen Lee as the other man chatters on. The camera resumes following a smiling Lee. She has just put down the tray and drinks near April and briskly and obliviously she walks past a doorway where Elliot still ruminating watches her entranced. The camera stays with Elliot who is still watching the offscreen Lee. In the background guests continue to chatter warmly with each other. Hannah carrying a tray of hors d'oeuvres walks up behind the distracted Elliot. Elliot taking one of the hors d'oeuvres starts nibbling as well as he and Hannah walk past the bookshelf into the living room. Elliot and Hannah eating and talking walk past a hallway and offscreen as Holly appears walking down the hallway. She holds a drink and a plate of hors d'oeuvres. she stands at the entrance to the hallway eating and looking at the offscreen guests. Holly standing in the hallway onscreen swallows loudly. Holly takes a sip of her drink as Hannah and Elliot walk over to her. Holly and Hannah begin to laugh. Hannah licking her fingers walks past a memocluttered refrigerator to the stove as Holly behind her begins to speak. As Holly talks sipping her drink Hannah busily works in the kitchen which contains a large center table stacked with bowls and plates of food hanging pots and pans and general party clutter. She walks onandoffscreen as she talks and listens to her sister."
        },
        {
          "id": "3.4",
          "name": "Deletion (~50%)",
          "description": "Lee glances over her shoulder then turns from the doorway and walks away. The camera follows her moving across a bookandphotographfilled bookshelf that obscures her from view as she walks into a crowded comfortable vestibule. People some holding drinks some just entering the apartment surround her. Everyone is talking at once carrying on easy familiar conversation. Lee smiles at the various people exchanging greetings. Lee walks into the living room turning her head back for a moment to talk to the child she has just hugged. The camera is still moving with Lee as she smiles and stops to chat with her mother. Lee starts to walk off again finishing her conversation with her mother. She holds a drink and a plate of hors d'oeuvres. she stands at the entrance to the hallway eating and looking at the offscreen guests. Holly standing in the hallway onscreen swallows loudly. Holly takes a sip of her drink as Hannah and Elliot walk over to her. Holly and Hannah begin to laugh. Hannah licking her fingers walks past a memocluttered refrigerator to the stove as Holly behind her begins to speak. As Holly talks sipping her drink Hannah busily works in the kitchen which contains a large center table stacked with bowls and plates of food hanging pots and pans and general party clutter. She walks onandoffscreen as she talks and listens to her sister."
        },
        {
          "id": "3.5",
          "name": "Deletion (~80%)",
          "description": "Lee glances over her shoulder then turns from the doorway and walks away. The camera follows her moving across a bookandphotographfilled bookshelf that obscures her from view as she walks into a crowded comfortable vestibule. People some holding drinks some just entering the apartment surround her. Holly and Hannah begin to laugh. Hannah licking her fingers walks past a memocluttered refrigerator to the stove as Holly behind her begins to speak. As Holly talks sipping her drink Hannah busily works in the kitchen which contains a large center table stacked with bowls and plates of food hanging pots and pans and general party clutter. She walks onandoffscreen as she talks and listens to her sister."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject-Action-Object Corruption",
          "description": "Sam peers over his elbow, then pivots from the window and skips away. The parrot follows him, gliding across a map-and-butterfly-filled cupboard that conceals him from sight as he skips into a bustling, cramped corridor. Creatures, some clutching umbrellas, some just crawling into the cave, encircle him. Everyone is whispering at once, carrying on lively, peculiar chat. Sam giggles at the assorted creatures, trading nods. Sam skips into the garage, tilting his head back for a moment to whisper to the kitten he has just nudged. The parrot is still gliding with Sam as he giggles and halts to murmur with his aunt. Sam begins to skip off again, completing his chat with his aunt. He bypasses several other critters, then spins to approach June, giving her a cozy, quick nudge. Frank's echo continues as he is indeed perceived, lounging in a windowframe having a whisper with a gesticulating, slender elf. Both are gripping umbrellas as Sam, bearing a platter of pastries and three umbrellas, skips between them. The cavern is extremely snug; the elves raise their umbrellas to create space for him. Frank observes Sam skip off; the other elf, unaware, persists to whisper. Frank hesitantly reverts to the whisper, but he can't resist swiveling his head to peep at the hidden Sam as the other elf mumbles on. The parrot regains following a giggling Sam. He has just set down the platter and umbrellas beside June, and quickly and absentmindedly, he skips past a windowframe where Frank, still pondering, observes him, enthralled. The parrot lingers with Frank, who is still observing the hidden Sam. In the background, critters persist to mumble cheerfully with each other. Ava, gripping a platter of pastries, skips up behind the absent Frank. Frank, seizing one of the pastries, starts munching as well as he and Ava skip past the cupboard into the garage. Frank and Ava, munching and whispering, skip past a burrow and hidden as Grace arises, skipping down the burrow. She clutches an umbrella and a platter of pastries; she stands at the gateway to the burrow, munching and gazing at the hidden critters. Grace, standing in the burrow visible, gulps audibly. Grace takes a gulp of her umbrella as Ava and Frank skip over to her. Grace and Ava start to chuckle. Ava, wiping her claws, skips past a list-jumbled toaster to the oven as Grace, behind her, begins to murmur. As Grace whispers, gulping her umbrella, Ava briskly toils in the tearoom, which shelters a small edge bench piled with spoons and platters of fruit, dangling gloves and hats, and typical gathering mess. She skips on-and-hidden as she whispers and hears her cousin."
        },
        {
          "id": "4.2",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Lee glances back, then walks away, disappearing into a welcoming, bustling vestibule filled with people engaged in familiar conversation. She smiles and greets various guests, exchanging words with her mother and hugging April. Elliot's voice-over plays as he talks to a man while Lee, carrying a tray, passes between them. Elliot watches Lee with interest as she leaves, momentarily distracted from his conversation. The camera follows Lee as she places the tray near April and continues walking. Her movements captivate Elliot, who continues to gaze at her. In the background, guests chat warmly. Hannah, carrying hors d'oeuvres, approaches Elliot, who nibbles as they walk into the living room together. Holly appears, eating and watching the guests. She laughs with Hannah, who moves to the kitchen to prepare food while chatting with her sister."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She walks onandoffscreen as she talks and listens to her sister As Holly talks sipping her drink Hannah busily works in the kitchen which contains a large center table stacked with bowls and plates of food hanging pots and pans and general party clutter  Hannah licking her fingers walks past a memocluttered refrigerator to the stove as Holly behind her begins to speak  Holly and Hannah begin to laugh  Holly takes a sip of her drink as Hannah and Elliot walk over to her  Holly standing in the hallway onscreen swallows loudly  she stands at the entrance to the hallway eating and looking at the offscreen guests  She holds a drink and a plate of hors d'oeuvres  Elliot and Hannah eating and talking walk past a hallway and offscreen as Holly appears walking down the hallway  Elliot taking one of the hors d'oeuvres starts nibbling as well as he and Hannah walk past the bookshelf into the living room  Hannah carrying a tray of hors d'oeuvres walks up behind the distracted Elliot  In the background guests continue to chatter warmly with each other  The camera stays with Elliot who is still watching the offscreen Lee  She has just put down the tray and drinks near April and briskly and obliviously she walks past a doorway where Elliot still ruminating watches her entranced  The camera resumes following a smiling Lee  Elliot reluctantly returns to the conversation but he can't help turning his head to gaze at the offscreen Lee as the other man chatters on  the other man oblivious continues to talk  Elliot watches Lee walk off  the men hold up their drinks to make room for her  The space is very tight  Both are holding drinks as Lee carrying a tray of hors d'oeuvres and two drinks walks between them  Elliot's voiceover continues as he is actually seen standing in a doorway having a conversation with a gesturing rotund man  She passes several other guests then turns to greet April giving her a warm brief hug  Lee starts to walk off again finishing her conversation with her mother  The camera is still moving with Lee as she smiles and stops to chat with her mother  Lee walks into the living room turning her head back for a moment to talk to the child she has just hugged  Lee smiles at the various people exchanging greetings  Everyone is talking at once carrying on easy familiar conversation  People some holding drinks some just entering the apartment surround her  The camera follows her moving across a bookandphotographfilled bookshelf that obscures her from view as she walks into a crowded comfortable vestibule  Lee glances over her shoulder then turns from the doorway and walks away "
        },
        {
          "id": "6.2",
          "name": "Adjacent Neighbor Swap",
          "description": "The camera follows her moving across a bookandphotographfilled bookshelf that obscures her from view as she walks into a crowded comfortable vestibule Lee glances over her shoulder then turns from the doorway and walks away Everyone is talking at once carrying on easy familiar conversation People some holding drinks some just entering the apartment surround her Lee walks into the living room turning her head back for a moment to talk to the child she has just hugged Lee smiles at the various people exchanging greetings Lee starts to walk off again finishing her conversation with her mother The camera is still moving with Lee as she smiles and stops to chat with her mother Elliot's voiceover continues as he is actually seen standing in a doorway having a conversation with a gesturing rotund man She passes several other guests then turns to greet April giving her a warm brief hug The space is very tight Both are holding drinks as Lee carrying a tray of hors d'oeuvres and two drinks walks between them Elliot watches Lee walk off the men hold up their drinks to make room for her Elliot reluctantly returns to the conversation but he cannot help turning his head to gaze at the offscreen Lee as the other man chatters on the other man oblivious continues to talk She has just put down the tray and drinks near April and briskly and obliviously she walks past a doorway where Elliot still ruminating watches her entranced The camera resumes following a smiling Lee In the background guests continue to chatter warmly with each other The camera stays with Elliot who is still watching the offscreen Lee Elliot taking one of the hors d'oeuvres starts nibbling as well as he and Hannah walk past the bookshelf into the living room Hannah carrying a tray of hors d'oeuvres walks up behind the distracted Elliot She holds a drink and a plate of hors d'oeuvres Elliot and Hannah eating and talking walk past a hallway and offscreen as Holly appears walking down the hallway Holly standing in the hallway onscreen swallows loudly she stands at the entrance to the hallway eating and looking at the offscreen guests Holly and Hannah begin to laugh Holly takes a sip of her drink as Hannah and Elliot walk over to her As Holly talks sipping her drink Hannah busily works in the kitchen which contains a large center table stacked with bowls and plates of food hanging pots and pans and general party clutter Hannah licking her fingers walks past a memocluttered refrigerator to the stove as Holly behind her begins to speak She walks onandoffscreen as she talks and listens to her sister"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The camera resumes following a smiling Lee  She has just put down the tray and drinks near April and briskly and obliviously she walks past a doorway where Elliot still ruminating watches her entranced  The camera stays with Elliot who is still watching the offscreen Lee  In the background guests continue to chatter warmly with each other  Hannah carrying a tray of hors d'oeuvres walks up behind the distracted Elliot  Elliot taking one of the hors d'oeuvres starts nibbling as well as he and Hannah walk past the bookshelf into the living room  Elliot and Hannah eating and talking walk past a hallway and offscreen as Holly appears walking down the hallway  She holds a drink and a plate of hors d'oeuvres  she stands at the entrance to the hallway eating and looking at the offscreen guests  Holly standing in the hallway onscreen swallows loudly  Holly takes a sip of her drink as Hannah and Elliot walk over to her  Holly and Hannah begin to laugh  Hannah licking her fingers walks past a memocluttered refrigerator to the stove as Holly behind her begins to speak  As Holly talks sipping her drink Hannah busily works in the kitchen which contains a large center table stacked with bowls and plates of food hanging pots and pans and general party clutter  She walks onandoffscreen as she talks and listens to her sister Lee glances over her shoulder then turns from the doorway and walks away  The camera follows her moving across a bookandphotographfilled bookshelf that obscures her from view as she walks into a crowded comfortable vestibule  People some holding drinks some just entering the apartment surround her  Everyone is talking at once carrying on easy familiar conversation  Lee smiles at the various people exchanging greetings  Lee walks into the living room turning her head back for a moment to talk to the child she has just hugged  The camera is still moving with Lee as she smiles and stops to chat with her mother  Lee starts to walk off again finishing her conversation with her mother  She passes several other guests then turns to greet April giving her a warm brief hug  Elliot's voiceover continues as he is actually seen standing in a doorway having a conversation with a gesturing rotund man  Both are holding drinks as Lee carrying a tray of hors d'oeuvres and two drinks walks between them  The space is very tight  the men hold up their drinks to make room for her  Elliot watches Lee walk off  the other man oblivious continues to talk  Elliot reluctantly returns to the conversation but he can't help turning his head to gaze at the offscreen Lee as the other man chatters on "
        }
      ]
    }
  ]
}