{
  "ground_truth": "She listens to the music, her eyes closed. The record plays for a few moments in the quiet room, as Elliot walks over to Lee and leans against the shelf near her. Lee, smiling, continues to listen to the music, her head down; Elliot stares at her. Elliot nods. Elliot stares at Lee, who continues to look down, her arms around her chest. Lee looks down again; the music plays softly and Elliot continues to stare at her, thinking. As Elliot's thoughts are heard over the scene, Lee glances around the loft, then begins to walk away. The camera follows her as she goes past the nude drawings, which become the focus of attention as Lee walks offscreen. Lee walks back onscreen, to the bookshelf behind the drawings. She takes the Edward Estlin Cummings book from the shelf and flips through it as she walks back to Elliot, who is still leaning by the stereo, still ruminating. Elliot leaps up, grabs Lee, and kisses her passionately. Lee, surprised, pushes him away. He kisses Lee again. He clumsily turns around; she bumps against the stereo unit. As Lee pulls away, she smashes into the turntable. Lee, shocked, is gasping. Elliot quickly turns away from Lee. She tries to compose herself and the film cuts to the loft entranceway. Frederick enters the loft first, followed by a confused Dusty. They stride across the loft past Lee, who is standing by the stereo. Elliot, standing near the nude drawings, is looking through a book. Dusty settles down in the backseat and closes the door. Elliot leans down to the chauffeur's window, signaling for him to start driving. The limousine drives off. Elliot runs to a phone booth across the street. He picks up the phone and dials. The film cuts to Frederick in his loft, standing near the phone. Frederick picks it up. When no one answers, Frederick, reacting, hangs up, and the film moves back outside to the phone booth, where Elliot, the phone receiver to his ear, listens for a moment, then hangs up. He walks out of the booth, reacting, then walks down the sidewalk, where he bumps into a frantic Lee, just turning the corner. Elliot, uneasy, glances up in the direction of Frederick's loft. He leads Lee a few yards up the street, away from any prying eyes. She sighs. Lee looks at him. She sighs. She walks off. Elliot stares after her, grinning. He laughs. A taxi turns a West Side street corner and stops in front of Evan and Norma's building, which is decorated with a long metal awning. It's an overcast day. A station wagon on the opposite side of the street pulls away as Hannah, a white scarf fluttering over her shoulder, gets out of the cab.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She heeds to the melody, her eyes shut. The album spins for a handful of instants in the silent chamber, as Elliot strides over to Lee and reclines against the rack near her. Lee, grinning, persists to heed to the melody, her head lowered; Elliot gazes at her. Elliot nods. Elliot gazes at Lee, who persists to glance downward, her arms around her torso. Lee glances downward again; the melody plays gently and Elliot persists to gaze at her, pondering. As Elliot's musings are heard over the sequence, Lee glimpses around the loft, then starts to stride away. The camera trails her as she passes the unclothed sketches, which become the focus of attention as Lee exits offscreen. Lee returns onscreen, to the bookshelf behind the sketches. She takes the Edward Estlin Cummings tome from the rack and leafs through it as she returns to Elliot, who is still reclining by the stereo, still ruminating. Elliot jumps up, seizes Lee, and smooches her fervently. Lee, startled, shoves him away. He smooches Lee again. He awkwardly turns around; she knocks against the stereo system. As Lee pulls away, she crashes into the turntable. Lee, stunned, is panting. Elliot swiftly turns away from Lee. She tries to compose herself and the film cuts to the loft entranceway. Frederick enters the loft first, followed by a bewildered Dusty. They stride across the loft past Lee, who is standing by the stereo. Elliot, standing near the unclothed sketches, is scanning through a volume. Dusty settles down in the backseat and closes the door. Elliot leans down to the chauffeur's window, signaling for him to start driving. The limousine drives off. Elliot rushes to a phone booth across the street. He picks up the phone and dials. The film cuts to Frederick in his loft, standing near the phone. Frederick picks it up. When no one answers, Frederick, reacting, hangs up, and the film moves back outside to the phone booth, where Elliot, the phone receiver to his ear, listens for a moment, then hangs up. He strides out of the booth, reacting, then ambles down the sidewalk, where he knocks into a frantic Lee, just turning the corner. Elliot, uneasy, glances up in the direction of Frederick's loft. He leads Lee a few yards up the street, away from any prying eyes. She exhales. Lee gazes at him. She exhales. She strides off. Elliot gazes after her, grinning. He chuckles. A taxi turns a West Side street corner and halts in front of Evan and Norma's structure, which is adorned with a long metal awning. It's an overcast day. A station wagon on the opposite side of the street pulls away as Hannah, a white scarf fluttering over her shoulder, exits the cab."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The music is listened to by her, her eyes closed. For a few moments, the record is played in the quiet room, as Elliot walks over to Lee and leans against the shelf near her. Lee, smiling, continues to listen to the music, her head down; Elliot stares at her. A nod is given by Elliot. Lee continues to look down, her arms around her chest, and Elliot stares at her. She looks down again; softly, the music is played and Elliot continues to stare at her, thinking. As Elliot's thoughts are heard over the scene, Lee glances around the loft, then begins to walk away. Her movements are followed by the camera as she goes past the nude drawings, which become the focus of attention as she walks offscreen. Lee walks back onscreen, to the bookshelf behind the drawings. The Edward Estlin Cummings book is taken from the shelf by her, and she flips through it as she walks back to Elliot, who is still leaning by the stereo, still ruminating. Elliot leaps up, grabs Lee, and kisses her passionately. Surprised, she pushes him away. Lee is kissed by him again. He turns around clumsily; she bumps against the stereo unit. As she pulls away, the turntable is smashed into by her. Shocked, gasping, Lee stands there. Away from Lee, Elliot quickly turns. She tries to compose herself, and the film cuts to the loft entranceway. The loft is entered first by Frederick, followed by a confused Dusty. Across the loft, they stride past Lee, who is standing by the stereo. A book is looked through by Elliot, standing near the nude drawings. Dusty settles down in the backseat and closes the door. To the chauffeur's window, Elliot leans down, signaling for him to start driving. Off drives the limousine. To a phone booth across the street, Elliot runs. The phone is picked up by him, and he dials. The film cuts to Frederick in his loft, standing near the phone. The phone is picked up by Frederick. When no one answers, Frederick hangs up, reacting, and the film moves back outside to the phone booth, where Elliot, with the phone receiver to his ear, listens for a moment, then hangs up. From the booth, he walks out, reacting, then walks down the sidewalk, where a frantic Lee, just turning the corner, is bumped into by him. Uneasy, Elliot glances up in the direction of Frederick's loft. A few yards up the street, he leads Lee away from any prying eyes. A sigh is let out by her. At him, she looks. Another sigh is let out by her. She walks off. After her, Elliot stares, grinning. He laughs. A West Side street corner is turned by a taxi and it stops in front of Evan and Norma's building, which is decorated with a long metal awning. An overcast day it is. On the opposite side of the street, a station wagon pulls away as Hannah, her white scarf fluttering over her shoulder, exits the cab."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Eyes closed, she listens to the music filling the quiet room. Elliot leans by the shelf near Lee, who smiles while listening, head down; he watches her. With his thoughts audible, Lee glances around, then walks past nude drawings that catch the camera's focus. Returning, she grabs an Edward Estlin Cummings book and heads back to Elliot by the stereo. He leaps up, kisses her passionately; surprised, she pushes him away. The kiss continues awkwardly, and she bumps the stereo, gasping in shock, as Elliot turns away. Composing herself, the scene shifts to the entrance as Frederick and confused Dusty enter. They pass Lee by the stereo; Elliot is near the drawings. Dusty sits, and Elliot signals the chauffeur to drive. The limo departs, and Elliot runs to a phone booth, dials, and listens as Frederick, in his loft, answers but hangs up when no one responds. Elliot exits the booth, reacting, and encounters frantic Lee nearby. Uneasy, he leads her away from view; she sighs and walks off. Elliot, grinning, laughs. A West Side street taxi stops by Evan and Norma's awning-decorated building. On an overcast day, a station wagon departs as Hannah, with a fluttering white scarf, exits the cab."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Eyes closed, Lee listens to music in a quiet room. Elliot leans near her, watching. As his thoughts play over the music, Lee looks around and walks past nude drawings. Returning, she grabs an E.E. Cummings book, flipping through it as Elliot leans by the stereo. Suddenly, Elliot kisses Lee, who pushes him away. He kisses her again, causing her to bump the stereo and gasp. Frederick and Dusty enter the loft as Elliot stands near drawings. Dusty sits in a limousine, signaled by Elliot to drive off. Elliot runs to a phone booth, dials Frederick, but hangs up when there's no answer. He leaves the booth, meets a frantic Lee, and leads her away. She sighs and walks off, leaving Elliot grinning. A taxi stops at Evan and Norma's building on an overcast day. Hannah exits, white scarf fluttering, as a station wagon departs."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "With her eyes gently closed, she immerses herself in the enchanting world of music. The record spins and plays for a few serene moments in the otherwise quiet room, creating a soothing atmosphere as Elliot gradually makes his way over to Lee. He leans casually against the nearby shelf, positioning himself close to her. Lee, wearing a warm smile on her face, continues to enjoy the melody, her head lowered in contemplation; meanwhile, Elliot cannot take his eyes off her. He gives a subtle nod. Elliot continues to fix his gaze on Lee, who remains in her reflective pose, her arms wrapped tightly around her chest. She looks down once more; the music provides a gentle backdrop and Elliot remains captivated by her, deep in thought. As Elliot's internal thoughts echo in the air above the scene, Lee briefly glances around the loft, then begins to move away. The camera captures her journey as she walks past the nude drawings, which momentarily become the focus. Lee reappears back on camera, heading toward the bookshelf situated behind the artwork. She retrieves an Edward Estlin Cummings book from the shelf, flipping through its pages as she returns to where Elliot is still leaning near the stereo, lost in his musings. In a sudden burst of emotion, Elliot jumps up, seizes Lee, and kisses her with intensity. Lee, taken aback, pushes him away. Undeterred, he pulls her in for another kiss. Awkwardly, he turns, causing her to bump against the stereo unit. As Lee recoils, she inadvertently crashes into the turntable. She is left in a state of shock, gasping for breath. Elliot quickly turns his attention away from Lee. She attempts to regain her composure as the film transitions to the entrance of the loft, where Frederick first steps inside, followed by the perplexed Dusty. They walk swiftly through the loft, passing by Lee, who stands near the stereo. Elliot remains by the nude drawings, his mind seemingly focused on flipping through a book. Dusty settles comfortably in the backseat and closes the door. Elliot bends down to the chauffeur's window, signaling for him to commence driving. The limousine smoothly pulls away. Elliot hastily darts to a nearby phone booth situated across the street. He picks up the receiver and dials a number. The film cuts to Frederick standing by the phone in his own loft. Frederick picks up the call but, upon hearing silence, reacts and hangs up. The scene then shifts back to the phone booth, where Elliot, holding the phone receiver to his ear, listens intently for a moment before gently hanging up. He steps out of the booth, reacts, and proceeds to walk along the sidewalk until he unexpectedly encounters a frantic Lee just as she turns the corner. Feeling uneasy, Elliot glances up in the direction of Frederick's loft. He guides Lee a few yards up the street, away from prying eyes. She lets out a sigh. Lee looks at him, sighs again, and walks away. Elliot watches her depart, a grin spreading across his face. He lets out a laugh. A taxi emerges, turning a West Side street corner and stopping right in front of Evan and Norma's building, distinguished by its long metal awning. It's an overcast day, the sky covered in clouds. Meanwhile, a station wagon on the opposite side of the street pulls away as Hannah steps out of the cab, her white scarf playfully fluttering over her shoulder."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With her eyes gently shut, she allows herself to become completely immersed in the enchanting and captivating world of music. The record spins smoothly and plays for several serene moments in the otherwise quiet and tranquil room, creating a soothing and calming atmosphere. During this peaceful time, Elliot gradually makes his way over to Lee. He leans casually against the nearby shelf, positioning himself quite close to her. Lee, adorned with a warm and inviting smile on her face, continues to enjoy the melody; her head is lowered in deep contemplation. Meanwhile, Elliot cannot take his eyes off her, completely captivated. He gives a subtle nod of acknowledgment. Elliot continues to fixate his gaze on Lee, who remains in her reflective and pensive pose, her arms wrapped tightly around her chest. She looks downward once more; the music provides a gentle and harmonious backdrop, and Elliot remains absorbed by her, lost in thought. As Elliot's internal thoughts echo through the air above the scene, Lee briefly glances around the loft, then begins to move away from her spot. The camera captures her movement as she walks past the nude drawings, which momentarily become the center of focus. Lee reappears on camera, making her way toward the bookshelf situated behind the artwork. She retrieves an Edward Estlin Cummings book from the shelf and flips through its pages as she returns to where Elliot is still leaning near the stereo, deeply lost in his musings. In a sudden and unexpected burst of emotion, Elliot jumps up in excitement, seizes Lee, and kisses her with intensity. Lee, taken aback by the moment, pushes him away. Undeterred and persistent, he pulls her in for another somewhat awkward kiss. In his awkwardness, he turns abruptly, causing her to bump against the stereo unit. As Lee recoils, she inadvertently crashes into the turntable. She is left standing in a state of shock, gasping for breath. At this point, Elliot quickly turns his attention away from Lee. She attempts to regain her composure as the film transitions to the entrance of the loft, where Frederick steps inside first, followed by the perplexed Dusty. They walk swiftly through the loft, passing by Lee, who is standing close to the stereo. Elliot remains still by the nude drawings, his mind seemingly focused on flipping through a book. Dusty settles comfortably into the backseat of a car and closes the door. Elliot bends down to the chauffeur's window, signaling for him to commence driving. The limousine smoothly and effortlessly pulls away from the scene. Elliot hastily darts across the street to a nearby phone booth conveniently situated there. He picks up the receiver and dials a number. The film then cuts to Frederick, who is standing by the phone in his own loft. Frederick picks up the call but, upon hearing only silence, reacts and hangs up the phone. The scene then shifts back to the phone booth, where Elliot, holding the phone receiver to his ear, listens intently for a fleeting moment before gently hanging up the receiver. He then steps out of the booth, reacts to the situation, and proceeds to walk along the sidewalk until he unexpectedly encounters a frantic Lee just as she turns the corner. Feeling somewhat uneasy, Elliot glances up in the direction of Frederick's loft. He gently guides Lee a few yards up the street, away from prying eyes and ears. She lets out a sigh of relief. Lee looks at him, sighs again, and gracefully walks away. As Elliot watches her depart, a grin begins to spread across his face. He lets out a hearty laugh. A taxi emerges on the scene, turning a West Side street corner and stopping right in front of Evan and Norma's building, which is distinguished by its long metal awning. The day is overcast, with the sky covered in clouds. Meanwhile, a station wagon on the opposite side of the street pulls away just as Hannah steps out of the cab, her white scarf playfully fluttering over her shoulder."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "With a sense of anticipation, she settles into the serene environment, embracing the music with her eyes gently closed. The soft tunes of the record weave through the quiet room as Elliot approaches Lee, positioning himself leisurely against the shelf nearby. Lee, a serene smile gracing her face, remains engrossed, her head inclined downwards, while Elliot's gaze fixes intently on her. In a silent acknowledgment, Elliot nods, maintaining his steady stare while Lee, her arms wrapped protectively around her chest, continues to keep her focus downward. The music provides a gentle backdrop to Elliot's contemplative stare, as his thoughts begin to surface and float audibly over the scene. In a moment of subtle realization, Lee's eyes wander around the loft, prompting her to rise and start walking away. The camera seamlessly trails her, capturing her passage past the intriguing nude drawings that momentarily captivate the viewer's attention before she exits the frame. Soon, Lee reappears onscreen, her destination the bookshelf behind the drawings. With a purpose, she selects an Edward Estlin Cummings book and deftly flips through the pages as she makes her way back to where Elliot remains by the stereo, lost in thought. In a sudden surge of emotion, Elliot springs forward, reaching for Lee and enveloping her in an impassioned kiss. Caught off guard, Lee instinctively rebuffs him, only for Elliot to lean in for another attempt. In an awkward twist, he pivots, causing Lee to jostle against the stereo unit, her momentum carrying her into the turntable. The impact leaves Lee momentarily breathless, overcome with shock, as Elliot swiftly averts his gaze. While Lee struggles to regain her composure, the scene transitions to the entranceway of the loft where Frederick makes his entrance, closely followed by a bewildered Dusty. With determined strides, they traverse the loft, passing Lee who stands stationary by the stereo, while Elliot, now near the nude drawings, engrosses himself in a book. Dusty finds his seat in the back of the limousine, closing the door decisively. Elliot leans in towards the chauffeur's window, gesturing a signal to commence the drive, watching as the limousine glides away. Driven by urgency, Elliot dashes to a phone booth on the opposite side of the street, snatches the receiver, and dials a number with purpose. Abruptly, the film cuts to Frederick in his loft, poised by the phone, which he answers eagerly only to be met with silence, leading to a resigning gesture as he hangs up. The scene shifts back outside, framing Elliot in the phone booth, who listens momentarily before hanging up himself. Emerging from the booth, his expression is one of muted reaction as he makes his way down the sidewalk, only to collide with a distressed Lee rounding the corner. In a moment of shared unease, Elliot casts a glance towards Frederick's loft, then gently steers Lee a short distance up the street, steering clear of intrusive eyes. A deep sigh escapes her as they pause, her eyes meeting his, before she sighs once more and turns away, leaving Elliot behind. As he watches her retreating figure, a grin slowly spreads across his face, culminating in a burst of laughter. Meanwhile, a taxi navigates a West Side street corner, drawing to a halt in front of Evan and Norma's building, prominently marked by a long metal awning. The day is overcast, the clouds casting a muted tone over the scene. Across the street, a station wagon pulls away just as Hannah, her white scarf playfully fluttering over her shoulder, alights gracefully from the cab."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "She listens to the music with her eyes closed in the quiet room, while Elliot leans against a nearby shelf, watching her. As the music plays softly, Elliot reflects silently on the moment. Lee glances around the loft and starts to walk away, drawing attention to the nude drawings before retrieving an Edward Estlin Cummings book from a shelf. She flips through it as she returns to Elliot, who is still deep in thought. Suddenly, Elliot grabs Lee and kisses her passionately. Surprised, she pushes him away, but he kisses her again, causing both of them to clumsily bump against the stereo unit. Shocked, Lee gasps and moves away as Frederick and a confused Dusty enter the loft, walking past Lee and Elliot, who is looking through a book by the nude drawings. Dusty settles in the backseat of a limousine, and Elliot signals the chauffeur to start driving. As the limousine departs, Elliot rushes to a phone booth, makes a call, but hangs up when no one answers. He then leaves the booth, and while walking down the sidewalk, he encounters a frantic Lee. Checking their surroundings, Elliot leads her a few yards away, and after a moment's hesitation, Lee walks off. Elliot watches her leave, grinning and laughing. Meanwhile, a taxi arrives at Evan and Norma's building, decorated with an awning. An overcast sky looms as Hannah steps out of the cab, her white scarf fluttering behind her."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She listens to the music, her eyes closed, immersing herself in the soothing melodies of a 1960s jazz record by Miles Davis, known for revolutionizing the genre. The record plays for a few moments in the quiet room, as Elliot walks over to Lee and leans against the shelf near her, which is lined with an eclectic collection of classic literature. Lee, smiling, continues to listen to the music, her head down; Elliot stares at her. Elliot nods, acknowledging the shared moment of tranquility. Elliot stares at Lee, who continues to look down, her arms around her chest as if protecting herself from the world. Lee looks down again; the music plays softly, its gentle rhythms filling the space, and Elliot continues to stare at her, thinking deeply about the complexities of their relationship. As Elliot's thoughts are heard over the scene, Lee glances around the loft, spacious and filled with artistic touches like the exposed brick walls, then begins to walk away. The camera follows her as she goes past the nude drawings, which are striking charcoal sketches created by a renowned local artist, becoming the focus of attention as Lee walks offscreen. Lee walks back onscreen, to the bookshelf behind the drawings. She takes the Edward Estlin Cummings book, a collection of avant-garde poetry that challenges conventional styles, from the shelf and flips through it as she walks back to Elliot, who is still leaning by the stereo, still ruminating. Elliot leaps up, grabs Lee, and kisses her passionately. Lee, surprised, pushes him away, startled by the sudden display of emotion. He kisses Lee again. He clumsily turns around; she bumps against the vintage stereo unit, a prized possession known for its high-fidelity sound. As Lee pulls away, she smashes into the turntable, causing the music to screech to a halt. Lee, shocked, is gasping, trying to steady herself. Elliot quickly turns away from Lee, feeling the weight of the awkward moment. She tries to compose herself and the film cuts to the loft entranceway. Frederick, an art dealer with a discerning eye, enters the loft first, followed by a confused Dusty, a young artist new to the city's vibrant art scene. They stride across the loft past Lee, who is standing by the stereo. Elliot, standing near the nude drawings, is looking through a book on contemporary art. Dusty settles down in the backseat of a sleek black limousine and closes the door. Elliot leans down to the chauffeur's window, signaling for him to start driving. The limousine, a symbol of the city's affluence, drives off. Elliot runs to a phone booth across the street, a relic from a bygone era in the communication age, its glass walls streaked with rain. He picks up the phone and dials. The film cuts to Frederick in his loft, a modern space filled with minimalist furniture, standing near the phone. Frederick picks it up. When no one answers, Frederick, reacting with frustration, hangs up, and the film moves back outside to the phone booth, where Elliot, the phone receiver to his ear, listens for a moment, then hangs up. He walks out of the booth, reacting with a mix of disappointment and determination, then walks down the sidewalk, where he bumps into a frantic Lee, just turning the corner. Elliot, uneasy, glances up in the direction of Frederick's loft, a towering building known for its panoramic views of the city. He leads Lee a few yards up the street, away from any prying eyes. She sighs, the weight of her thoughts evident. Lee looks at him. She sighs, contemplating her next move. She walks off, leaving behind a trail of unresolved tension. Elliot stares after her, grinning with a newfound resolve. He laughs, a sound that echoes through the streets. A taxi turns a West Side street corner, a bustling area known for its chic boutiques and cozy cafes, and stops in front of Evan and Norma's building, which is decorated with a long metal awning that shelters residents from the frequent New York rain. It's an overcast day, the sky a blanket of gray. A station wagon on the opposite side of the street pulls away as Hannah, a white scarf fluttering over her shoulder, reminiscent of old Hollywood glamour, gets out of the cab."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Elliot stares at Lee who continues to look down her arms around her chest She listens to the music her eyes closed The record plays for a few moments in the quiet room as Elliot walks over to Lee and leans against the shelf near her Lee smiling continues to listen to the music her head down Elliot stares at her Elliot nods Elliot stares at Lee who continues to look down her arms around her chest Lee looks down again the music plays softly and Elliot continues to stare at her thinking Elliot quickly turns away from Lee As Elliot's thoughts are heard over the scene Lee glances around the loft then begins to walk away They stride across the loft past Lee who is standing by the stereo A taxi turns a West Side street corner and stops in front of Evan and Norma's building which is decorated with a long metal awning The camera follows her as she goes past the nude drawings which become the focus of attention as Lee walks offscreen The film cuts to Frederick in his loft standing near the phone She listens to the music her eyes closed Lee walks back onscreen to the bookshelf behind the drawings She takes the Edward Estlin Cummings book from the shelf and flips through it as she walks back to Elliot who is still leaning by the stereo still ruminating Elliot leaps up grabs Lee and kisses her passionately Lee surprised pushes him away He clumsily turns around she bumps against the stereo unit He kisses Lee again He clumsily turns around Lee looks down again she bumps against the stereo unit It is an overcast day As Lee pulls away she smashes into the turntable Lee shocked is gasping Elliot quickly turns away from Lee She tries to compose herself and the film cuts to the loft entranceway Frederick enters the loft first followed by a confused Dusty They stride across the loft past Lee who is standing by the stereo Lee looks at him Elliot standing near the nude drawings is looking through a book Dusty settles down in the backseat and closes the door Elliot leans down to the chauffeur's window signaling for him to start driving As Lee pulls away she smashes into the turntable He kisses Lee again The limousine drives off Elliot runs to a phone booth across the street He picks up the phone and dials The film cuts to Frederick in his loft standing near the phone Frederick picks it up When no one answers Frederick reacting hangs up and the film moves back outside to the phone booth where Elliot the phone receiver to his ear listens for a moment then hangs up A station wagon on the opposite side of the street pulls away as Hannah a white scarf fluttering over her shoulder gets out of the cab He walks out of the booth reacting then walks down the sidewalk where he bumps into a frantic Lee just turning the corner Elliot uneasy glances up in the direction of Frederick's loft As Elliot's thoughts are heard over the scene Lee glances around the loft then begins to walk away The record plays for a few moments in the quiet room as Elliot walks over to Lee and leans against the shelf near her He leads Lee a few yards up the street away from any prying eyes She sighs He walks out of the booth reacting then walks down the sidewalk where he bumps into a frantic Lee just turning the corner Lee looks at him She sighs She walks off Elliot stares after her grinning He laughs Elliot runs to a phone booth across the street He laughs A taxi turns a West Side street corner and stops in front of Evan and Norma's building which is decorated with a long metal awning Lee smiling continues to listen to the music her head down It is an overcast day the music plays softly and Elliot continues to stare at her thinking He leads Lee a few yards up the street away from any prying eyes A station wagon on the opposite side of the street pulls away as Hannah a white scarf fluttering over her shoulder gets out of the cab"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "She listens to the music her eyes closed. The record plays for a few moments in the quiet room as Elliot walks over to Lee and leans against the shelf near her. Lee smiling continues to listen to the music her head down. Elliot stares at her. Elliot nods. Elliot stares at Lee who continues to look down her arms around her chest. Lee looks down again. the music plays softly and Elliot continues to stare at her thinking. As Elliot's thoughts are heard over the scene Lee glances around the loft then begins to walk away. The camera follows her as she goes past the nude drawings which become the focus of attention as Lee walks offscreen. Lee walks back onscreen to the bookshelf behind the drawings. She takes the Edward Estlin Cummings book from the shelf and flips through it as she walks back to Elliot who is still leaning by the stereo still ruminating. Elliot leaps up grabs Lee and kisses her passionately. Lee surprised pushes him away. He kisses Lee again. He clumsily turns around. she bumps against the stereo unit. As Lee pulls away she smashes into the turntable. Lee shocked is gasping. Elliot quickly turns away from Lee. She tries to compose herself and the film cuts to the loft entranceway. Frederick enters the loft first followed by a confused Dusty. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. They stride across the loft past Lee who is standing by the stereo. Elliot standing near the nude drawings is looking through a book. Dusty settles down in the backseat and closes the door. Elliot leans down to the chauffeur's window signaling for him to start driving. The limousine drives off. Elliot runs to a phone booth across the street. He picks up the phone and dials. The film cuts to Frederick in his loft standing near the phone. Frederick picks it up. When no one answers Frederick reacting hangs up and the film moves back outside to the phone booth where Elliot the phone receiver to his ear listens for a moment then hangs up. He walks out of the booth reacting then walks down the sidewalk where he bumps into a frantic Lee just turning the corner. Elliot uneasy glances up in the direction of Frederick's loft. He leads Lee a few yards up the street away from any prying eyes. She sighs. Lee looks at him. She sighs. She walks off. Elliot stares after her grinning. He laughs. A taxi turns a West Side street corner and stops in front of Evan and Norma's building which is decorated with a long metal awning. It is an overcast day. A station wagon on the opposite side of the street pulls away as Hannah a white scarf fluttering over her shoulder gets out of the cab."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "She listens to the music her eyes closed. The record plays for a few moments in the quiet room as Elliot walks over to Lee and leans against the shelf near her. Lee smiling continues to listen to the music her head down. Elliot stares at her. Elliot nods. Elliot stares at Lee who continues to look down her arms around her chest. Lee looks down again. the music plays softly and Elliot continues to stare at her thinking. As Elliot's thoughts are heard over the scene Lee glances around the loft then begins to walk away. The camera follows her as she goes past the nude drawings which become the focus of attention as Lee walks offscreen. Lee walks back onscreen to the bookshelf behind the drawings. She takes the Edward Estlin Cummings book from the shelf and flips through it as she walks back to Elliot who is still leaning by the stereo still ruminating. Elliot leaps up grabs Lee and kisses her passionately. Lee surprised pushes him away. He kisses Lee again. He clumsily turns around. she bumps against the stereo unit. As Lee pulls away she smashes into the turntable. Lee shocked is gasping. Elliot quickly turns away from Lee. She tries to compose herself and the film cuts to the loft entranceway. Frederick enters the loft first followed by a confused Dusty. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. They stride across the loft past Lee who is standing by the stereo. Elliot standing near the nude drawings is looking through a book. Dusty settles down in the backseat and closes the door. Elliot leans down to the chauffeur's window signaling for him to start driving. The limousine drives off. Elliot runs to a phone booth across the street. He picks up the phone and dials. The film cuts to Frederick in his loft standing near the phone. Frederick picks it up. When no one answers Frederick reacting hangs up and the film moves back outside to the phone booth where Elliot the phone receiver to his ear listens for a moment then hangs up. He walks out of the booth reacting then walks down the sidewalk where he bumps into a frantic Lee just turning the corner. Elliot uneasy glances up in the direction of Frederick's loft. He leads Lee a few yards up the street away from any prying eyes. She sighs. Lee looks at him. She sighs. She walks off. Elliot stares after her grinning. He laughs. A taxi turns a West Side street corner and stops in front of Evan and Norma's building which is decorated with a long metal awning. It is an overcast day. A station wagon on the opposite side of the street pulls away as Hannah a white scarf fluttering over her shoulder gets out of the cab."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "She listens to the music her eyes closed. The record plays for a few moments in the quiet room as Elliot walks over to Lee and leans against the shelf near her. Lee smiling continues to listen to the music her head down. Elliot stares at her. Elliot nods. Elliot stares at Lee who continues to look down her arms around her chest. Lee looks down again. the music plays softly and Elliot continues to stare at her thinking. As Elliot's thoughts are heard over the scene Lee glances around the loft then begins to walk away. The camera follows her as she goes past the nude drawings which become the focus of attention as Lee walks offscreen. Lee walks back onscreen to the bookshelf behind the drawings. Elliot uneasy glances up in the direction of Frederick's loft. He leads Lee a few yards up the street away from any prying eyes. She sighs. Lee looks at him. She sighs. She walks off. Elliot stares after her grinning. He laughs. A taxi turns a West Side street corner and stops in front of Evan and Norma's building which is decorated with a long metal awning. It is an overcast day. A station wagon on the opposite side of the street pulls away as Hannah a white scarf fluttering over her shoulder gets out of the cab."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "She listens to the music her eyes closed. The record plays for a few moments in the quiet room as Elliot walks over to Lee and leans against the shelf near her. Lee smiling continues to listen to the music her head down. Elliot stares at her. Elliot nods. He laughs. A taxi turns a West Side street corner and stops in front of Evan and Norma's building which is decorated with a long metal awning. It is an overcast day. A station wagon on the opposite side of the street pulls away as Hannah a white scarf fluttering over her shoulder gets out of the cab."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "She listens to the music, her eyes closed. The record plays for a few moments in the quiet room, as a squirrel walks over to a lamp and leans against the shelf near her. A lamp, smiling, continues to listen to the music, her head down; the squirrel stares at her. The squirrel nods. The squirrel stares at the lamp, who continues to look down, her arms around her chest. The lamp looks down again; the music plays softly and the squirrel continues to stare at her, thinking. As the squirrel's thoughts are heard over the scene, the lamp glances around the loft, then begins to walk away. The camera follows her as she goes past the nude drawings, which become the focus of attention as the lamp walks offscreen. The lamp walks back onscreen, to the bookshelf behind the drawings. She takes the Edward Estlin Cummings book from the shelf and flips through it as she walks back to the squirrel, who is still leaning by the stereo, still ruminating. The squirrel leaps up, grabs the lamp, and kisses her passionately. The lamp, surprised, pushes the squirrel away. The squirrel kisses the lamp again. The squirrel clumsily turns around; the lamp bumps against the stereo unit. As the lamp pulls away, she smashes into the turntable. The lamp, shocked, is gasping. The squirrel quickly turns away from the lamp. She tries to compose herself and the film cuts to the loft entranceway. A penguin enters the loft first, followed by a confused robot. They stride across the loft past the lamp, who is standing by the stereo. The squirrel, standing near the nude drawings, is looking through a book. The robot settles down in the backseat and closes the door. The squirrel leans down to the chauffeur's window, signaling for him to start driving. The limousine drives off. The squirrel runs to a phone booth across the street. He picks up the phone and dials. The film cuts to a penguin in his loft, standing near the phone. The penguin picks it up. When no one answers, the penguin, reacting, hangs up, and the film moves back outside to the phone booth, where the squirrel, the phone receiver to his ear, listens for a moment, then hangs up. He walks out of the booth, reacting, then walks down the sidewalk, where he bumps into a frantic lamp, just turning the corner. The squirrel, uneasy, glances up in the direction of the penguin's loft. He leads the lamp a few yards up the street, away from any prying eyes. She sighs. The lamp looks at him. She sighs. She walks off. The squirrel stares after her, grinning. He laughs. A taxi turns a West Side street corner and stops in front of a dragon and a wizard's building, which is decorated with a long metal awning. It's an overcast day. A station wagon on the opposite side of the street pulls away as a giraffe, a white scarf fluttering over her shoulder, gets out of the cab."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "She listens to the ocean waves, her eyes closed. The radio crackles for a few moments in the quiet garage, as Elliot walks over to Lee and leans against the counter near her. Lee, smiling, continues to listen to the ocean waves, her head down; Elliot stares at her. Elliot nods. Elliot stares at Lee, who continues to look down, her arms around her backpack. Lee looks down again; the ocean waves lap softly and Elliot continues to stare at her, thinking. As Elliot's thoughts are heard over the scene, Lee glances around the attic, then begins to walk away. The camera follows her as she goes past the landscape paintings, which become the focus of attention as Lee walks offscreen. Lee walks back onscreen, to the cabinet behind the paintings. She takes the Emily Dickinson anthology from the cabinet and flips through it as she walks back to Elliot, who is still leaning by the jukebox, still ruminating. Elliot leaps up, grabs Lee, and kisses her passionately. Lee, surprised, pushes him away. He kisses Lee again. He clumsily turns around; she bumps against the jukebox. As Lee pulls away, she smashes into the speakers. Lee, shocked, is gasping. Elliot quickly turns away from Lee. She tries to compose herself and the film cuts to the attic entranceway. Frederick enters the attic first, followed by a confused Rusty. They stride across the attic past Lee, who is standing by the jukebox. Elliot, standing near the landscape paintings, is looking through a journal. Rusty settles down in the backseat and closes the door. Elliot leans down to the conductor's window, signaling for him to start driving. The streetcar drives off. Elliot runs to a vending machine across the street. He picks up the receiver and dials. The film cuts to Frederick in his attic, standing near the receiver. Frederick picks it up. When no one answers, Frederick, reacting, hangs up, and the film moves back outside to the vending machine, where Elliot, the receiver to his ear, listens for a moment, then hangs up. He walks out of the machine, reacting, then walks down the boardwalk, where he bumps into a frantic Lee, just turning the corner. Elliot, uneasy, glances up in the direction of Frederick's attic. He leads Lee a few yards up the street, away from any prying eyes. She sighs. Lee looks at him. She sighs. She walks off. Elliot stares after her, grinning. He laughs. A trolley turns a West Side street corner and stops in front of Evan and Norma's building, which is decorated with a long stained glass window. It's an overcast day. A hatchback on the opposite side of the street pulls away as Hannah, a white hat fluttering over her shoulder, gets out of the trolley."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "She hums to the music, her eyes closed. The record spins for a few moments in the quiet room, as Elliot ambles over to Lee and perches on the shelf near her. Lee, smiling, continues to hum along, her head down; Elliot gazes at her. Elliot shrugs. Elliot gazes at Lee, who continues to look down, her arms around her chest. Lee peers down again; the music drifts softly and Elliot continues to gaze at her, pondering. As Elliot’s thoughts float over the scene, Lee glances around the loft, then begins to dance away. The camera trails her as she skips past the nude drawings, which become the focus of attention as Lee dances offscreen. Lee dances back onscreen, to the bookshelf behind the drawings. She removes the Edward Estlin Cummings book from the shelf and skims through it as she dances back to Elliot, who is still perched by the stereo, still pondering. Elliot leaps up, embraces Lee, and hugs her tightly. Lee, surprised, pulls him away. He hugs Lee again. He awkwardly spins around; she nudges against the stereo unit. As Lee pulls away, she bangs into the turntable. Lee, shocked, is panting. Elliot quickly spins away from Lee. She tries to calm herself and the film cuts to the loft entranceway. Frederick bursts into the loft first, followed by a baffled Dusty. They stroll across the loft past Lee, who is standing by the stereo. Elliot, standing near the nude drawings, is flipping through a book. Dusty settles down in the backseat and locks the door. Elliot leans down to the chauffeur's window, motioning for him to start driving. The limousine cruises off. Elliot rushes to a phone booth across the street. He picks up the phone and taps. The film cuts to Frederick in his loft, standing near the phone. Frederick grabs it. When no one answers, Frederick, puzzled, hangs up, and the film shifts back outside to the phone booth, where Elliot, the phone receiver to his ear, listens for a moment, then hangs up. He steps out of the booth, pondering, then strolls down the sidewalk, where he encounters a frantic Lee, just rounding the corner. Elliot, uncertain, peeks up in the direction of Frederick’s loft. He guides Lee a few yards up the street, away from any prying eyes. She exhales. Lee peers at him. She exhales. She wanders off. Elliot watches after her, smiling. He chuckles. A taxi turns a West Side street corner and halts in front of Evan and Norma's building, which is adorned with a long metal awning. It's an overcast day. A station wagon on the opposite side of the street cruises away as Hannah, a white scarf fluttering over her shoulder, emerges from the cab."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "She listens to the wind, her eyes closed. The television plays for a few moments in the dusty attic, as Marvin walks over to Kim and leans against the lamp near her. Kim, smiling, continues to listen to the wind, her head down; Marvin stares at her. Marvin nods. Marvin stares at Kim, who continues to look down, her arms around her cat. Kim looks down again; the wind whispers softly and Marvin continues to stare at her, thinking. As Marvin's thoughts are heard over the scene, Kim glances around the garage, then begins to walk away. The lens follows her as she goes past the rusty bicycles, which become the focus of attention as Kim walks offscreen. Kim walks back onscreen, to the cabinet behind the bicycles. She takes the William Blake pamphlet from the cabinet and flips through it as she walks back to Marvin, who is still leaning by the radio, still reminiscing. Marvin leaps up, grabs Kim, and hugs her passionately. Kim, surprised, pushes him away. He hugs Kim again. He clumsily turns around; she bumps against the radio unit. As Kim pulls away, she crashes into the window. Kim, shocked, is gasping. Marvin quickly turns away from Kim. She tries to compose herself and the scene cuts to the attic entranceway. Derek enters the attic first, followed by a confused Stormy. They stride across the attic past Kim, who is standing by the radio. Marvin, standing near the rusty bicycles, is looking through a pamphlet. Stormy settles down in the trunk and closes the door. Marvin leans down to the pilot's window, signaling for him to start flying. The helicopter flies off. Marvin runs to a mailbox across the lawn. He picks up the receiver and dials. The scene cuts to Derek in his attic, standing near the receiver. Derek picks it up. When no one answers, Derek, reacting, hangs up, and the scene moves back outside to the mailbox, where Marvin, the receiver to his ear, listens for a moment, then hangs up. He walks out of the mailbox, reacting, then walks down the dirt path, where he bumps into a frantic Kim, just turning the corner. Marvin, uneasy, glances up in the direction of Derek's attic. He leads Kim a few steps up the path, away from any prying eyes. She sighs. Kim looks at him. She sighs. She walks off. Marvin stares after her, grinning. He laughs. A bicycle turns a South Side path corner and stops in front of Julian and Mona's cottage, which is decorated with a long plastic tarp. It's a cloudy day. A cargo truck on the opposite side of the path pulls away as Alice, a striped ribbon fluttering over her hat, gets out of the bicycle."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "He observes the television, his ears open. The video chatters for a few moments in the bustling park, as Lila skips over to Max and reclines against the bench near him. Max, chuckling, continues to observe the television, his feet crossed; Lila waves at him. Lila blinks. Lila waves at Max, who continues to look away, her hands at her sides. Max looks up again; the television chatters softly and Lila continues to wave at him, pondering. As Lila's ponderings are voiced over the scene, Max peeks around the garden, then starts to dance forward. The lens tracks him as he glides past the bronze sculptures, which become the centerpiece as Max dances offscreen. Max glides back onscreen, to the magazine stand beside the sculptures. He picks the William Carlos Williams journal from the stand and skims through it as he glides back to Lila, who is still reclining by the merry-go-round, still pondering. Lila jumps up, hugs Max, and shakes him warmly. Max, startled, nudges him away. He shakes Max again. He awkwardly spins around; he bumps against the merry-go-round. As Max pulls away, he topples into the fountain. Max, startled, is panting. Lila quickly spins away from Max. He tries to calm down and the scene cuts to the garden gate. Gabrielle enters the garden first, followed by an exuberant Ella. They bounce across the garden past Max, who is standing by the merry-go-round. Lila, standing near the bronze sculptures, is leafing through a pamphlet. Ella nestles down in the back pew and clasps the handle. Lila stoops down to the usher's shoulder, signaling for him to open the curtain. The carriage rolls away. Lila hops to a trolley booth across the field. She lifts the handset and presses buttons. The scene cuts to Gabrielle in her garden, resting near the handset. Gabrielle lifts it. When silence follows, Gabrielle, startled, sets it down, and the scene transitions back outside to the trolley booth, where Lila, the handset to his ear, listens for a moment, then sets it down. She skips out of the booth, startled, then skips along the pavement, where she collides with a bewildered Max, just rounding the bend. Lila, nervous, glances over in the direction of Gabrielle's garden. She guides Max a few steps down the avenue, away from any curious gazes. He breathes heavily. Max looks at her. He breathes heavily. He skips away. Lila waves after him, beaming. He snickers. A motorbike twists a North Side lane bend and pauses in front of Oliver and Tessa's gallery, which is adorned with a short wooden veranda. It's a partially sunny day. A minivan on the adjacent lane departs as Jasmine, a red hat bobbing on her head, leaps out of the bike."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "She observes the painting, her eyes open. The television broadcasts for a few moments in the lively park, as Elliot dances over to Lee and jumps on the trampoline near her. Lee, frowning, continues to observe the painting, her head raised; Elliot whispers to her. Elliot claps. Elliot whispers to Lee, who continues to look up, her arms waving in the air. Lee looks up again; the painting beams brightly and Elliot continues to whisper to her, wondering. As Elliot's whispers are felt over the scene, Lee glances around the garden, then begins to skip away. The camera follows her as she goes past the colorful murals, which become the center of attention as Lee skips offscreen. Lee skips back onscreen, to the fountain behind the murals. She grabs the Pablo Neruda script from the fountain and twirls it as she skips back to Elliot, who is still jumping by the jukebox, still contemplating. Elliot dives forward, grabs Lee, and spins her energetically. Lee, astonished, pushes him off. He spins Lee again. He clumsily spins around; she bumps against the jukebox. As Lee pulls away, she crashes into the cassette player. Lee, startled, is panting. Elliot swiftly spins away from Lee. She tries to steady herself and the film cuts to the garden entrance. Frederick walks into the garden first, followed by an amused Dusty. They prance through the garden past Lee, who is standing by the jukebox. Elliot, standing near the colorful murals, is juggling through a script. Dusty settles down in the bicycle basket and closes the clasp. Elliot leans down to the cyclist's handlebar, motioning for him to start pedaling. The bicycle pedals off. Elliot skips to a bus stop across the street. He picks up the phone and texts. The film cuts to Frederick in his garden, standing near the phone. Frederick checks it. When no one responds, Frederick, contemplating, puts it down, and the film moves back outside to the bus stop, where Elliot, the phone receiver to his ear, listens for a moment, then puts it down. He skips out of the bus stop, contemplating, then skips down the sidewalk, where he bounces into a serene Lee, just strolling the lane. Elliot, apprehensive, peeks up in the direction of Frederick's garden. He drags Lee a few steps down the lane, away from any curious pigeons. She hums. Lee looks at him. She hums. She skips off. Elliot whispers after her, chuckling. He giggles. A skateboard rolls a West Side street ramp and stops in front of Evan and Norma's house, which is adorned with a short wooden ladder. It's a sunny day. A motorbike on the opposite side of the street cruises away as Hannah, a blue hat perched over her hair, hops out of the skateboard."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "He chews on the candy, his toes wiggling. The television flickers for a few minutes in the crowded park, as Sarah skips over to Max and crouches against the tree near him. Max, frowning, continues to chew on the candy, his chin up; Sarah giggles at him. Sarah shrugs. Sarah giggles at Max, who continues to look up, his hands covering his ears. Max looks up again; the television flickers quietly and Sarah continues to giggle at him, plotting. As Sarah's whispers are imagined over the garden, Max peeks around the gazebo, then begins to hop away. The bird flutters after him as he goes past the painted vases, which draw everyone's gaze as Max hops off the path. Max hops back onto the path, to the collection of crates behind the vases. He grabs the Aldous Huxley brochure from the crate and shakes it as he hops back to Sarah, who is still crouching by the laptop, still scheming. Sarah jumps up, hugs Max, and twirls him joyfully. Max, startled, shakes her off. She twirls Max again. She awkwardly pivots around; he stumbles into the laptop. As Max shakes it off, he crashes into the projector. Max, bewildered, is chuckling. Sarah quickly spins away from Max. He tries to regain his balance and the scene cuts to the garden entrance. Oliver skips into the garden first, followed by a curious Vicky. They jog across the garden past Max, who is slumping by the laptop. Sarah, standing near the painted vases, is writing in a journal. Vicky relaxes in the hammock and shuts her eyes. Sarah squats down to the gardener's basket, signaling for him to start planting. The bicycle rolls off. Sarah sprints to a fountain across the plaza. She picks up the soap and polishes. The scene cuts to Oliver in his gazebo, playing with a duck. Oliver pets the duck. When it flies away, Oliver, surprised, lets go of it, and the scene shifts back outside to the fountain, where Sarah, the soap against her skin, cleanses for a second, then drops it. She climbs out of the fountain, pondering, then leaps onto the path, where she stumbles toward a suspicious Max, just skipping the hedge. Sarah, nervous, peeks over in the direction of Oliver's gazebo. She leads Max a few steps onto the grass, away from any spying rabbits. He yawns. Max looks at her. He yawns. He hops away. Sarah watches him, smirking. She whistles. A horse trots a North Side block corner and halts in front of Carlos and Gina's cottage, which is adorned with a short glass banner. It's a foggy night. A tractor on the adjacent lane rolls forward as Sophie, a red cape billowing over her hat, leaps off the horse."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "She listens to the music with eyes closed as Elliot leans against a shelf near Lee, who smiles quietly. Elliot stares at her, contemplating, while she glances around and picks up a book by Edward Estlin Cummings. Elliot impulsively kisses her, but Lee, startled, pushes him away and bumps into the stereo. As she recovers, Frederick and Dusty arrive at the loft, passing Lee by the stereo while Elliot looks at a book. Dusty gets into a car, and Elliot signals to drive off. He quickly runs to a phone booth and calls Frederick's loft. With no answer, Elliot hangs up and leaves, only to bump into a distressed Lee. They walk away discreetly, but she eventually walks off, leaving Elliot grinning. Later, Hannah arrives at Evan and Norma's building, stepping out of a taxi on an overcast day."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "A station wagon on the opposite side of the street pulls away as Hannah a white scarf fluttering over her shoulder gets out of the cab It is an overcast day A taxi turns a West Side street corner and stops in front of Evan and Norma's building which is decorated with a long metal awning He laughs Elliot stares after her grinning She walks off She sighs Lee looks at him She sighs He leads Lee a few yards up the street away from any prying eyes Elliot uneasy glances up in the direction of Frederick's loft He walks out of the booth reacting then walks down the sidewalk where he bumps into a frantic Lee just turning the corner When no one answers Frederick reacting hangs up and the film moves back outside to the phone booth where Elliot the phone receiver to his ear listens for a moment then hangs up Frederick picks it up The film cuts to Frederick in his loft standing near the phone He picks up the phone and dials Elliot runs to a phone booth across the street The limousine drives off Elliot leans down to the chauffeur's window signaling for him to start driving Dusty settles down in the backseat and closes the door Elliot standing near the nude drawings is looking through a book They stride across the loft past Lee who is standing by the stereo Frederick enters the loft first followed by a confused Dusty She tries to compose herself and the film cuts to the loft entranceway Elliot quickly turns away from Lee Lee shocked is gasping As Lee pulls away she smashes into the turntable she bumps against the stereo unit He clumsily turns around He kisses Lee again Lee surprised pushes him away Elliot leaps up grabs Lee and kisses her passionately She takes the Edward Estlin Cummings book from the shelf and flips through it as she walks back to Elliot who is still leaning by the stereo still ruminating Lee walks back onscreen to the bookshelf behind the drawings The camera follows her as she goes past the nude drawings which become the focus of attention as Lee walks offscreen As Elliot's thoughts are heard over the scene Lee glances around the loft then begins to walk away the music plays softly and Elliot continues to stare at her thinking Lee looks down again Elliot stares at Lee who continues to look down her arms around her chest Elliot nods Elliot stares at her Lee smiling continues to listen to the music her head down The record plays for a few moments in the quiet room as Elliot walks over to Lee and leans against the shelf near her She listens to the music her eyes closed"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The camera follows her as she goes past the nude drawings which become the focus of attention as Lee walks offscreen Elliot stares at her Lee walks back onscreen to the bookshelf behind the drawings Elliot uneasy glances up in the direction of Frederick's loft Elliot stares after her grinning Lee shocked is gasping When no one answers Frederick reacting hangs up and the film moves back outside to the phone booth where Elliot the phone receiver to his ear listens for a moment then hangs up The limousine drives off Elliot nods She sighs Elliot standing near the nude drawings is looking through a book She takes the Edward Estlin Cummings book from the shelf and flips through it as she walks back to Elliot who is still leaning by the stereo still ruminating Frederick picks it up Frederick enters the loft first followed by a confused Dusty Elliot leaps up grabs Lee and kisses her passionately Elliot leans down to the chauffeur's window signaling for him to start driving She sighs She walks off He picks up the phone and dials Lee surprised pushes him away Dusty settles down in the backseat and closes the door She tries to compose herself and the film cuts to the loft entranceway They stride across the loft past Lee who is standing by the stereo The film cuts to Frederick in his loft standing near the phone A station wagon on the opposite side of the street pulls away as Hannah a white scarf fluttering over her shoulder gets out of the cab She listens to the music her eyes closed Elliot quickly turns away from Lee she bumps against the stereo unit It is an overcast day Lee looks at him He walks out of the booth reacting then walks down the sidewalk where he bumps into a frantic Lee just turning the corner A taxi turns a West Side street corner and stops in front of Evan and Norma's building which is decorated with a long metal awning Lee smiling continues to listen to the music her head down Elliot runs to a phone booth across the street Elliot stares at Lee who continues to look down her arms around her chest He leads Lee a few yards up the street away from any prying eyes Lee looks down again As Elliot's thoughts are heard over the scene Lee glances around the loft then begins to walk away He kisses Lee again He clumsily turns around As Lee pulls away she smashes into the turntable The record plays for a few moments in the quiet room as Elliot walks over to Lee and leans against the shelf near her the music plays softly and Elliot continues to stare at her thinking He laughs"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "They stride across the loft past Lee who is standing by the stereo Elliot standing near the nude drawings is looking through a book Dusty settles down in the backseat and closes the door Elliot leans down to the chauffeur's window signaling for him to start driving The limousine drives off Elliot runs to a phone booth across the street He picks up the phone and dials The film cuts to Frederick in his loft standing near the phone Frederick picks it up When no one answers Frederick reacting hangs up and the film moves back outside to the phone booth where Elliot the phone receiver to his ear listens for a moment then hangs up He walks out of the booth reacting then walks down the sidewalk where he bumps into a frantic Lee just turning the corner Elliot uneasy glances up in the direction of Frederick's loft He leads Lee a few yards up the street away from any prying eyes She sighs Lee looks at him She sighs She walks off Elliot stares after her grinning He laughs A taxi turns a West Side street corner and stops in front of Evan and Norma's building which is decorated with a long metal awning It is an overcast day A station wagon on the opposite side of the street pulls away as Hannah a white scarf fluttering over her shoulder gets out of the cab She listens to the music her eyes closed The record plays for a few moments in the quiet room as Elliot walks over to Lee and leans against the shelf near her Lee smiling continues to listen to the music her head down Elliot stares at her Elliot nods Elliot stares at Lee who continues to look down her arms around her chest Lee looks down again the music plays softly and Elliot continues to stare at her thinking As Elliot's thoughts are heard over the scene Lee glances around the loft then begins to walk away The camera follows her as she goes past the nude drawings which become the focus of attention as Lee walks offscreen Lee walks back onscreen to the bookshelf behind the drawings She takes the Edward Estlin Cummings book from the shelf and flips through it as she walks back to Elliot who is still leaning by the stereo still ruminating Elliot leaps up grabs Lee and kisses her passionately Lee surprised pushes him away He kisses Lee again He clumsily turns around she bumps against the stereo unit As Lee pulls away she smashes into the turntable Lee shocked is gasping Elliot quickly turns away from Lee She tries to compose herself and the film cuts to the loft entranceway Frederick enters the loft first followed by a confused Dusty"
        }
      ]
    }
  ]
}