{
  "ground_truth": "She runs into the building; the taxi drives away. Evan, his back to the camera, walks to the front door and opens it to Hannah. Through a doorway, Norma can be seen sitting on a chair in the kitchen. She wears a robe over a slip and stockings; she's drinking. Evan stands in the doorway looking at her; he doesn't go in. Norma reacts, turning to her daughter. Hannah, however, has her back turned. She is busy taking charge in the kitchen as Evan speaks. She takes some pills out of a cupboard and hands them to her mother with a glass of water. The camera moves to Evan, who continues to tell his story, ignoring his wife's outburst, as he walks away from the kitchen doorway into the den. Evan walks over to the piano, where several framed family photographs sit in a line on its top. He picks one up as Norma speaks offscreen in the kitchen. The camera moves back to the kitchen as Norma talks. She is still glaring offscreen at the doorway where Evan stood moments before. She holds the water glass and the pills. Evan is back in the doorway, listening to Norma, getting more and more angry. As he makes a retort, he starts to walk back to the den and his piano. Hannah goes back to Norma; she takes the glass of water away. Hannah, choosing to ignore Evan's remark, hands her mother a cup of coffee; she puts her mother's hands on the cup. Norma sips her coffee, softly sobbing. Hannah, reacting, walks away from the counter and, capping the bottle of pills, puts them back in the cupboard. The camera moves in on Hannah's face as she reflects, her voice heard over the screen. The camera leaves Hannah's face as she continues to reflect; it moves to the den, to the row of family photos on the piano: one of a present-day Evan and Norma, others where both Norma and Evan are young, beautiful, hopeful. The film cuts back to the kitchen. Norma stands up; Hannah takes her coffee cup and sets it on the counter. She puts her arm around Hannah's shoulder. Mother and daughter walk out of the kitchen. Norma chuckles. They stop at the entrance to the den. Evan can be seen playing the piano as they continue their conversation. Norma chortles. Hannah laughs, touching her mother. They walk over to Evan at the piano. Norma leans over the piano; Hannah looks off into the distance, deep in reflection. The piano music continues in the background as the movie cuts to Lee walking along a wharf by the waterfront. The wind blows her hair; she hugs the Edward Estlin Cummings book to her chest.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sure, here is the transformed text:\n\nShe sprints into the edifice; the cab drives away. Evan, his spine to the camera, ambles to the front entrance and unseals it to Hannah. Through a portal, Norma can be seen seated on a seat in the galley. She wears a gown over a shift and hose; she's consuming. Evan stands in the doorway gazing at her; he doesn't enter. Norma responds, turning to her offspring. Hannah, however, has her back turned. She is engaged taking command in the kitchen as Evan speaks. She extracts some tablets out of a cabinet and hands them to her mother with a goblet of liquid. The camera shifts to Evan, who continues to narrate his tale, disregarding his spouse's eruption, as he strides away from the kitchen doorway into the study. Evan advances over to the instrument, where several bordered kin images lie in a row on its top. He picks one up as Norma speaks offscreen in the kitchen. The camera shifts back to the kitchen as Norma talks. She is still staring offscreen at the doorway where Evan stood moments before. She holds the water goblet and the tablets. Evan is back in the doorway, attending to Norma, getting more and more irate. As he makes a rejoinder, he starts to walk back to the study and his instrument. Hannah returns to Norma; she takes the goblet of liquid away. Hannah, opting to disregard Evan's comment, hands her mother a mug of coffee; she puts her mother's hands on the mug. Norma sips her coffee, gently weeping. Hannah, responding, walks away from the sideboard and, sealing the bottle of tablets, returns them to the cupboard. The camera moves in on Hannah's visage as she considers, her voice heard over the screen. The camera departs from Hannah's countenance as she continues to contemplate; it moves to the den, to the row of kin portraits on the instrument: one of a current-day Evan and Norma, others where both Norma and Evan are youthful, lovely, hopeful. The film cuts back to the kitchen. Norma rises up; Hannah takes her coffee mug and sets it on the counter. She puts her arm around Hannah's shoulder. Mother and daughter exit the kitchen. Norma chuckles. They halt at the portal to the study. Evan can be seen playing the instrument as they continue their discourse. Norma chortles. Hannah laughs, touching her mother. They advance over to Evan at the instrument. Norma leans over the instrument; Hannah gazes off into the distance, deep in contemplation. The instrument melody continues in the background as the movie cuts to Lee strolling along a wharf by the waterfront. The breeze blows her hair; she clutches the Edward Estlin Cummings tome to her chest."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Sure, here is the transformed text:\n\nShe runs into the building; the taxi is driven away by the driver. The front door is walked to by Evan, his back to the camera, and it is opened for Hannah by him. Norma, sitting on a chair in the kitchen, is seen through a doorway. A robe over a slip and stockings is worn by her; she's drinking. The doorway is stood in by Evan, looking at her; he doesn't go in. Norma reacts, turning to her daughter. Hannah, however, has her back turned. Taking charge in the kitchen is her responsibility as Evan speaks. Some pills are taken out of a cupboard by her and handed to her mother with a glass of water. Evan continues to tell his story, ignoring his wife's outburst, as he leaves the kitchen doorway and walks away into the den. The piano, where several framed family photographs sit in a line on its top, is walked over to by Evan. One is picked up by him as Norma speaks offscreen in the kitchen. Norma talks as the camera moves back to the kitchen. Offscreen, she glares at the doorway where Evan stood moments before. The water glass and the pills are held by her. Evan is back in the doorway, listening to Norma, getting more and more angry. A retort is made by him as he starts to walk back to the den and his piano. Norma is returned to by Hannah; the glass of water is taken away by her. Evan's remark is ignored by Hannah, and she hands her mother a cup of coffee; her mother's hands are placed on the cup by her. Her coffee is sipped by Norma, softly sobbing. Reacting, Hannah walks away from the counter and, capping the bottle of pills, puts them back in the cupboard. Hannah's face is moved in on by the camera as she reflects, her voice heard over the screen. Hannah's face is left by the camera as she continues to reflect; the den, with its row of family photos on the piano, is moved to: one of a present-day Evan and Norma, others where both Norma and Evan are young, beautiful, hopeful. The kitchen is cut back to by the film. Norma stands up; her coffee cup is taken by Hannah and set on the counter. Hannah's shoulder is put around by her arm. Out of the kitchen walks mother and daughter. A chuckle is made by Norma. At the entrance to the den, they stop. Evan, playing the piano, is seen by them as their conversation continues. A chortle is made by Norma. Her mother is touched by Hannah, laughing. They walk over to Evan at the piano. The piano is leaned over by Norma; the distance is looked off into by Hannah, deep in reflection. In the background, the piano music continues as the movie cuts to Lee walking along a wharf by the waterfront. Her hair is blown by the wind; the Edward Estlin Cummings book is hugged to her chest by her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "She rushes into the building as the taxi departs. Evan, facing away, opens the door for Hannah. In the kitchen, Norma sits with a robe over a slip and stockings, drinking. Evan watches from the doorway but doesn't enter. Norma turns to her daughter, but Hannah, busy in the kitchen, retrieves pills and water for her mother while Evan narrates his story, ignoring his wife's outburst. He walks to the piano, studies a family photo as Norma, offscreen, speaks. Evan returns to the doorway, growing angry as Norma talks. He retorts and heads to the piano. Hannah, dismissing Evan's comment, gives Norma coffee, placing her hands on the cup. Norma sobs quietly; Hannah puts the pills away. Reflecting, Hannah's voice is heard as the camera shifts to family photos on the piano, showing younger, hopeful Evan and Norma. Back in the kitchen, Norma stands; Hannah takes her coffee, sets it down, and embraces her mother. They exit the kitchen, chuckling and stopping at the den entrance, where Evan plays the piano. Norma laughs, and they join him. As the music plays, the scene shifts to Lee walking along a windy waterfront, hugging an Edward Estlin Cummings book to her chest."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "She runs into the building as the taxi leaves. Evan, back to the camera, opens the front door for Hannah. Norma is visible in the kitchen, seated, wearing a robe and stockings, drinking. Evan stands at the doorway without entering, while Norma turns to her daughter, who is busy in the kitchen. Hannah hands her mother pills and water. Evan leaves the kitchen, continuing his story, moves to the den, and examines photos on the piano as Norma talks offscreen. Angry, Evan retorts, returning to the den. Hannah, ignoring him, takes her mother's water, gives her coffee, and helps her drink. Norma sobs as Hannah puts pills back. The camera focuses on Hannah's reflective face, then shifts to family photos of Evan and Norma young and hopeful. The scene returns to the kitchen; Norma stands, and Hannah sets her mug aside. Norma hugs Hannah as they leave the kitchen, chuckling. They find Evan playing piano in the den, sharing laughter. The piano plays as the movie transitions to Lee on a wharf, wind in her hair, clutching a book."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "She hurriedly rushes into the building as the taxi that brought her there gradually fades into the distance, driving away. With his back turned to the camera, Evan approaches the front door, opening it graciously for Hannah to enter. As the camera pans through a doorway, Norma is visible, seated in a chair within the cozy confines of the kitchen. She is comfortably dressed in a robe layered over a slip and stockings, all while indulging in a drink. Evan stands in the open doorway, giving her a long, considering look without stepping inside. Norma, sensing his presence, reacts by turning her attention to her daughter, Hannah. However, Hannah's focus is elsewhere, with her back turned to her mother as she busily takes charge of the kitchen activities, while Evan speaks. Hannah reaches up to a cupboard, pulling out some pills, and hands them to her mother, accompanied by a glass of water. \n\nThe camera smoothly transitions back to Evan, who is absorbed in telling his story, seemingly unaffected by his wife's emotional outburst. His voice carries through as he makes his way away from the kitchen doorway and into the den. There, Evan approaches the piano, where an array of framed family photographs is neatly arranged in a line on its polished top. He picks up one of the photos as Norma's voice continues to be heard offscreen from the kitchen. \n\nThe scene shifts back to the kitchen, where Norma remains, glaring in the direction of the doorway where Evan had been standing just moments earlier. She grips the glass of water and the pills, seething with restrained emotion. Evan has returned to the doorway, listening to Norma with growing frustration. As he makes a sharp retort, he begins his return journey to the den and the familiar comfort of his piano. \n\nMeanwhile, Hannah attends once more to Norma. She takes the glass of water from her mother, opting to overlook Evan's pointed remark. Hannah hands her mother a warm cup of coffee instead, gently guiding her mother's hands to the cup. Norma takes a sip of the coffee and begins to softly sob. In reaction, Hannah moves away from the counter, carefully puts the cap back on the bottle of pills, and returns them to their place in the cupboard. \n\nThe camera draws in closer to capture Hannah's face, deep in thought, her inner reflections audible over the screen. As she continues to reflect, the camera shifts its focus, moving away from Hannah's contemplative expression to the den. It captures the row of cherished family photos perched atop the piano: one of Evan and Norma in the present day, alongside others depicting a time when both were young, filled with beauty and hope. \n\nThe scene transitions back to the kitchen, where Norma rises to her feet. Hannah takes her mother's coffee cup, setting it gently upon the counter. Putting a comforting arm around Hannah's shoulder, Norma begins to walk with her daughter out of the kitchen. Norma lets out a chuckle, and they pause at the entrance to the den. Inside, Evan can be seen playing the piano, and the two women continue their conversation. Shared laughter fills the space; Hannah playfully touches her mother. Together, they walk over to Evan at the piano. Norma leans forward over the piano, while Hannah gazes out into the distance, immersed in deep reflection. The soft strains of the piano music play on in the background as the film transitions to a new scene, cutting to Lee, who is seen walking along a wharf by the picturesque waterfront. The wind gently tousles her hair, and she hugs a cherished book by Edward Estlin Cummings close to her chest."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "She hurriedly rushes into the building, her movements brisk and purposeful, as the taxi that transported her there gradually fades into the distance, steadily driving away. With his back firmly turned to the camera, Evan approaches the front door, opening it with a gracious and considerate gesture for Hannah to enter. As the camera smoothly pans through a doorway, Norma becomes visible, seated in a chair nestled within the cozy and inviting confines of the kitchen. She is comfortably dressed in a robe that is layered over her slip and stockings, all while indulging in a drink with a sense of leisure. Evan stands in the open doorway, giving her a long and considering look without making any move to step inside. Norma, sensing his familiar presence, reacts by shifting her attention towards her daughter, Hannah. However, Hannah's focus is directed elsewhere, with her back turned to her mother as she busily takes charge of the various kitchen activities, even as Evan continues speaking. Hannah reaches up to a cupboard, expertly pulling out some pills, and hands them to her mother, who is accompanied by a glass of water. \n\nThe camera then smoothly transitions back to Evan, who is absorbed in the act of telling his story, seemingly unaffected by his wife's emotional outburst. His voice carries through the space as he makes his way away from the kitchen doorway and into the welcoming den. There, Evan approaches the grand piano, where an array of framed family photographs is neatly arranged in a perfect line on its polished top. He picks up one of the treasured photos as Norma's voice continues to resonate offscreen from the kitchen. \n\nThe scene shifts back once more to the cozy kitchen, where Norma remains, glaring intensely in the direction of the doorway where Evan had been standing just moments earlier. She grips the glass of water and the pills, seething with a mix of restrained emotions. Evan has now returned to the doorway, listening to Norma with a mounting sense of frustration. As he makes a sharp retort, he begins his return journey to the den and the familiar comfort of his cherished piano. \n\nMeanwhile, Hannah attends once again to Norma. She gracefully takes the glass of water from her mother, choosing to overlook Evan's pointed remark. Hannah hands her mother a warm and comforting cup of coffee instead, gently guiding her mother's hands to the cup. Norma takes a sip of the coffee, her emotions bubbling up as she begins to softly sob. In quiet reaction, Hannah moves away from the counter, carefully putting the cap back on the bottle of pills, returning them to their rightful place in the cupboard. \n\nThe camera draws in closer, capturing Hannah's face deep in thought, her inner reflections becoming audible over the screen. As she continues to reflect deeply, the camera shifts its focus, moving away from Hannah's contemplative expression to the den. It captures the row of cherished family photos perched atop the piano: one of Evan and Norma as they are today, alongside others depicting a time when both were young, filled with beauty and hope. \n\nThe scene makes another seamless transition back to the kitchen, where Norma rises to her feet. Hannah gently takes her mother's coffee cup, setting it tenderly upon the counter. Putting a comforting arm around Hannah's shoulder, Norma begins to walk with her daughter out of the kitchen. Norma lets out a soft chuckle, and they pause at the entrance to the den. Inside, Evan can be seen playing the piano, and the two women continue their heartfelt conversation. Shared laughter fills the space; Hannah playfully touches her mother. Together, they walk over to Evan at the piano. Norma leans forward over the piano, while Hannah gazes thoughtfully out into the distance, deeply immersed in reflective thought. The soft, soothing strains of the piano music play on gently in the background as the film transitions to a new scene, cutting to Lee, who is seen walking along a scenic wharf by the picturesque waterfront. The gentle wind tousles her hair, and she hugs a cherished book by Edward Estlin Cummings close to her chest."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "She bursts through the building's entrance while the taxi that dropped her off smoothly accelerates and drives away from the curb. Inside, Evan, facing away from the camera, strides deliberately toward the front door and reaches out to open it, allowing Hannah to enter. As they pass through the entrance, a view through another doorway reveals Norma sitting in the kitchen, perched on a chair. Draped in a robe over her slip and stockings, she sips from a drink. Evan pauses at the threshold of the kitchen, standing still and observing her without stepping inside. Norma, sensing his presence, shifts her attention toward her daughter, but Hannah remains with her back turned, fully engaged in her own activities in the kitchen while Evan begins to speak. Methodically, she opens a cupboard, retrieves some pills, and hands them to her mother along with a glass of water. The camera then shifts focus to Evan, who maintains his narrative, unfazed by his wife's emotional reaction, as he gradually retreats from the kitchen doorway and proceeds into the den. He approaches the piano, noticing several framed family photographs carefully arranged in a row on its surface. He lifts one of the photos, examining it while Norma's voice carries from the kitchen. The scene returns to the kitchen, showing Norma's intense expression fixed on the doorway where Evan had just been standing. She clutches the glass of water and the pills, her frustration evident. Evan has reappeared in the doorway, listening to Norma, his anger steadily building. With a sharp retort, he begins to retrace his steps back toward the den and his piano. Meanwhile, Hannah chooses to focus on her mother, gently taking the glass of water from Norma's hand. She disregards Evan's comment, opting instead to offer her mother a comforting cup of coffee, guiding Norma's hands to clasp the warm cup. Norma takes a sip, her demeanor softening as she begins to sob quietly. Observing this, Hannah departs from the counter, securing the lid on the pill bottle, and returns it to the cupboard. The camera closes in on Hannah's introspective face, capturing her deep contemplation as her voice narrates over the scene. As Hannah's reflection continues, the camera pans to the den, highlighting the array of family photographs atop the piano: one of the present-day Evan and Norma, others capturing their youthful, hopeful selves. The film transitions back to the kitchen where Norma rises from her seat, prompting Hannah to take the coffee cup from her hands and set it gently on the counter. Norma drapes an arm around Hannah's shoulder, and together, they exit the kitchen, a lighthearted chuckle escaping Norma's lips. They pause at the threshold of the den, catching sight of Evan immersed in playing the piano as the dialogue between mother and daughter continues. Norma's chuckle transforms into a more spirited chortle, prompting Hannah to laugh as well, tenderly touching her mother in solidarity. The pair approaches Evan at the piano, and Norma leans over it while Hannah gazes thoughtfully into the distance, lost in reflection. The gentle melody from the piano creates a soothing backdrop as the movie transitions to Lee, who is depicted walking along a wharf by the waterfront. The breeze tousles her hair, and she cradles an Edward Estlin Cummings book against her chest for comfort."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "She rushes into the building as the taxi departs. Evan, facing away from the camera, opens the front door for Hannah. Inside the kitchen, Norma, clad in a robe and slip, sits drinking. Evan pauses in the doorway, observing her. Norma turns toward Hannah, who is busy managing the kitchen tasks, taking pills from a cupboard and handing them to Norma with water. Evan recounts his story, ignoring Norma's reaction as he moves into the den and examines a family photo on the piano. Norma continues to address him from the kitchen, holding the water and pills, as Evan listens from the doorway, growing angrier. After responding sharply, he heads back to the den. Hannah calmly takes the glass from Norma, ignoring Evan's comment, and gives her mother coffee instead. As Norma sips and quietly sobs, Hannah puts away the pills, reflecting as her voice narrates over the scene. The camera shifts to the den, highlighting a series of family photos on the piano before returning to the kitchen. Norma stands, supported by Hannah, and they walk out together, sharing a lighthearted moment. At the den's entrance, they watch Evan play the piano, continuing their conversation. Norma and Hannah express amusement as they join Evan at the piano, with Hannah lost in thought. The scene transitions to Lee strolling along a windy waterfront, clutching an Edward Estlin Cummings book."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She runs into the building; the taxi, a typical New York City yellow cab often seen in bustling urban centers, drives away. Evan, his back to the camera, walks to the front door and opens it to Hannah. Through a doorway, Norma can be seen sitting on a chair in the kitchen, a cozy room filled with the aroma of freshly brewed coffee. She wears a robe over a slip and stockings, clothing reminiscent of a bygone era when such attire was common for housewives; she's drinking, lost in her thoughts. Evan stands in the doorway looking at her; he doesn't go in. Norma reacts, turning to her daughter. Hannah, however, has her back turned. She is busy taking charge in the kitchen as Evan speaks. She takes some pills out of a cupboard, where they are kept in a neat row alongside other household medications, and hands them to her mother with a glass of water. The camera moves to Evan, who continues to tell his story, ignoring his wife's outburst, as he walks away from the kitchen doorway into the den, a space often used for informal gatherings and family time. Evan walks over to the piano, a Steinway upright, where several framed family photographs sit in a line on its top. He picks one up, a cherished memory from a family vacation, as Norma speaks offscreen in the kitchen. The camera moves back to the kitchen as Norma talks. She is still glaring offscreen at the doorway where Evan stood moments before. She holds the water glass and the pills. Evan is back in the doorway, listening to Norma, getting more and more angry, his hands clenched at his sides. As he makes a retort, he starts to walk back to the den and his piano, where he finds solace. Hannah goes back to Norma; she takes the glass of water away to avoid any further spillage. Hannah, choosing to ignore Evan's remark, hands her mother a cup of coffee, freshly brewed and still steaming; she puts her mother's hands on the cup. Norma sips her coffee, softly sobbing, the warmth of the drink bringing a slight comfort. Hannah, reacting, walks away from the counter and, capping the bottle of pills, puts them back in the cupboard, ensuring they are safe and out of reach. The camera moves in on Hannah's face as she reflects, her voice heard over the screen, conveying her inner thoughts and struggles. The camera leaves Hannah's face as she continues to reflect; it moves to the den, to the row of family photos on the piano: one of a present-day Evan and Norma, others where both Norma and Evan are young, beautiful, hopeful, capturing moments from their early days of marriage. The film cuts back to the kitchen. Norma stands up; Hannah takes her coffee cup and sets it on the counter. She puts her arm around Hannah's shoulder, offering support and solidarity. Mother and daughter walk out of the kitchen, their steps synchronized. Norma chuckles, a hint of humor breaking through the tension. They stop at the entrance to the den. Evan can be seen playing the piano, his fingers lightly dancing across the keys, as they continue their conversation. Norma chortles, laughter mingling with the music. Hannah laughs, touching her mother, sharing a moment of joy. They walk over to Evan at the piano, feeling the familial bond strengthening. Norma leans over the piano, examining the sheet music, while Hannah looks off into the distance, deep in reflection. The piano music continues in the background, a melody familiar to old jazz standards, as the movie cuts to Lee walking along a wharf by the waterfront, where seagulls call and waves lap against the dock. The wind blows her hair; she hugs the Edward Estlin Cummings poetry book, a collection of evocative free verse, to her chest."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Mother and daughter walk out of the kitchen She runs into the building the taxi drives away Evan his back to the camera walks to the front door and opens it to Hannah Through a doorway Norma can be seen sitting on a chair in the kitchen She wears a robe over a slip and stockings she is drinking Evan stands in the doorway looking at her he does not go in She is still glaring offscreen at the doorway where Evan stood moments before Norma reacts turning to her daughter Norma chortles Hannah goes back to Norma Evan his back to the camera walks to the front door and opens it to Hannah Hannah however has her back turned Hannah looks off into the distance deep in reflection She is busy taking charge in the kitchen as Evan speaks She takes some pills out of a cupboard and hands them to her mother with a glass of water The camera moves to Evan who continues to tell his story ignoring his wife's outburst as he walks away from the kitchen doorway into the den Evan walks over to the piano where several framed family photographs sit in a line on its top She holds the water glass and the pills The wind blows her hair He picks one up as Norma speaks offscreen in the kitchen The camera moves back to the kitchen as Norma talks Norma reacts turning to her daughter She is still glaring offscreen at the doorway where Evan stood moments before Evan walks over to the piano where several framed family photographs sit in a line on its top She holds the water glass and the pills Evan is back in the doorway listening to Norma getting more and more angry As he makes a retort he starts to walk back to the den and his piano As he makes a retort he starts to walk back to the den and his piano Hannah goes back to Norma she takes the glass of water away Hannah choosing to ignore Evan's remark hands her mother a cup of coffee They stop at the entrance to the den she puts her mother's hands on the cup Norma sips her coffee softly sobbing Hannah reacting walks away from the counter and capping the bottle of pills puts them back in the cupboard the taxi drives away The camera moves back to the kitchen as Norma talks The camera moves in on Hannah's face as she reflects her voice heard over the screen The camera leaves Hannah's face as she continues to reflect it moves to the den to the row of family photos on the piano one of a presentday Evan and Norma others where both Norma and Evan are young beautiful hopeful The film cuts back to the kitchen Norma stands up She runs into the building Hannah takes her coffee cup and sets it on the counter She puts her arm around Hannah's shoulder Hannah choosing to ignore Evan's remark hands her mother a cup of coffee He picks one up as Norma speaks offscreen in the kitchen he does not go in Mother and daughter walk out of the kitchen Norma chuckles The piano music continues in the background as the movie cuts to Lee walking along a wharf by the waterfront They stop at the entrance to the den Evan can be seen playing the piano as they continue their conversation Norma chortles Hannah laughs touching her mother They walk over to Evan at the piano she is drinking Norma leans over the piano Hannah looks off into the distance deep in reflection The camera leaves Hannah's face as she continues to reflect The piano music continues in the background as the movie cuts to Lee walking along a wharf by the waterfront They walk over to Evan at the piano Evan stands in the doorway looking at her The wind blows her hair she hugs the Edward Estlin Cummings book to her chest"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "She runs into the building. the taxi drives away. Evan his back to the camera walks to the front door and opens it to Hannah. Through a doorway Norma can be seen sitting on a chair in the kitchen. She wears a robe over a slip and stockings. she is drinking. Evan stands in the doorway looking at her. he does not go in. Norma reacts turning to her daughter. Hannah however has her back turned. She is busy taking charge in the kitchen as Evan speaks. She takes some pills out of a cupboard and hands them to her mother with a glass of water. The camera moves to Evan who continues to tell his story ignoring his wife's outburst as he walks away from the kitchen doorway into the den. Evan walks over to the piano where several framed family photographs sit in a line on its top. He picks one up as Norma speaks offscreen in the kitchen. The camera moves back to the kitchen as Norma talks. She is still glaring offscreen at the doorway where Evan stood moments before. She holds the water glass and the pills. Evan is back in the doorway listening to Norma getting more and more angry. As he makes a retort he starts to walk back to the den and his piano. Hannah goes back to Norma. she takes the glass of water away. Hannah choosing to ignore Evan's remark hands her mother a cup of coffee. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. she puts her mother's hands on the cup. Norma sips her coffee softly sobbing. Hannah reacting walks away from the counter and capping the bottle of pills puts them back in the cupboard. The camera moves in on Hannah's face as she reflects her voice heard over the screen. The camera leaves Hannah's face as she continues to reflect. it moves to the den to the row of family photos on the piano. one of a presentday Evan and Norma others where both Norma and Evan are young beautiful hopeful. The film cuts back to the kitchen. Norma stands up. Hannah takes her coffee cup and sets it on the counter. She puts her arm around Hannah's shoulder. Mother and daughter walk out of the kitchen. Norma chuckles. They stop at the entrance to the den. Evan can be seen playing the piano as they continue their conversation. Norma chortles. Hannah laughs touching her mother. They walk over to Evan at the piano. Norma leans over the piano. Hannah looks off into the distance deep in reflection. The piano music continues in the background as the movie cuts to Lee walking along a wharf by the waterfront. The wind blows her hair. she hugs the Edward Estlin Cummings book to her chest."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "She runs into the building. the taxi drives away. Evan his back to the camera walks to the front door and opens it to Hannah. Through a doorway Norma can be seen sitting on a chair in the kitchen. She wears a robe over a slip and stockings. she is drinking. Evan stands in the doorway looking at her. he does not go in. Norma reacts turning to her daughter. Hannah however has her back turned. She is busy taking charge in the kitchen as Evan speaks. She takes some pills out of a cupboard and hands them to her mother with a glass of water. The camera moves to Evan who continues to tell his story ignoring his wife's outburst as he walks away from the kitchen doorway into the den. Evan walks over to the piano where several framed family photographs sit in a line on its top. He picks one up as Norma speaks offscreen in the kitchen. The camera moves back to the kitchen as Norma talks. She is still glaring offscreen at the doorway where Evan stood moments before. She holds the water glass and the pills. Evan is back in the doorway listening to Norma getting more and more angry. As he makes a retort he starts to walk back to the den and his piano. Hannah goes back to Norma. she takes the glass of water away. Hannah choosing to ignore Evan's remark hands her mother a cup of coffee. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. she puts her mother's hands on the cup. Norma sips her coffee softly sobbing. Hannah reacting walks away from the counter and capping the bottle of pills puts them back in the cupboard. The camera moves in on Hannah's face as she reflects her voice heard over the screen. The camera leaves Hannah's face as she continues to reflect. it moves to the den to the row of family photos on the piano. one of a presentday Evan and Norma others where both Norma and Evan are young beautiful hopeful. The film cuts back to the kitchen. Norma stands up. Hannah takes her coffee cup and sets it on the counter. She puts her arm around Hannah's shoulder. Mother and daughter walk out of the kitchen. Norma chuckles. They stop at the entrance to the den. Evan can be seen playing the piano as they continue their conversation. Norma chortles. Hannah laughs touching her mother. They walk over to Evan at the piano. Norma leans over the piano. Hannah looks off into the distance deep in reflection. The piano music continues in the background as the movie cuts to Lee walking along a wharf by the waterfront. The wind blows her hair. she hugs the Edward Estlin Cummings book to her chest."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "She runs into the building. the taxi drives away. Evan his back to the camera walks to the front door and opens it to Hannah. Through a doorway Norma can be seen sitting on a chair in the kitchen. She wears a robe over a slip and stockings. she is drinking. Evan stands in the doorway looking at her. he does not go in. Norma reacts turning to her daughter. Hannah however has her back turned. She is busy taking charge in the kitchen as Evan speaks. She takes some pills out of a cupboard and hands them to her mother with a glass of water. Norma chuckles. They stop at the entrance to the den. Evan can be seen playing the piano as they continue their conversation. Norma chortles. Hannah laughs touching her mother. They walk over to Evan at the piano. Norma leans over the piano. Hannah looks off into the distance deep in reflection. The piano music continues in the background as the movie cuts to Lee walking along a wharf by the waterfront. The wind blows her hair. she hugs the Edward Estlin Cummings book to her chest."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "She runs into the building. the taxi drives away. Evan his back to the camera walks to the front door and opens it to Hannah. Through a doorway Norma can be seen sitting on a chair in the kitchen. She wears a robe over a slip and stockings. Norma leans over the piano. Hannah looks off into the distance deep in reflection. The piano music continues in the background as the movie cuts to Lee walking along a wharf by the waterfront. The wind blows her hair. she hugs the Edward Estlin Cummings book to her chest."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "She runs into the building; the taxi drives away. Marty, his back to the camera, walks to the front door and opens it to Linda. Through a doorway, Denise can be seen sitting on a chair in the kitchen. She wears a robe over a slip and stockings; she's drinking. Marty stands in the doorway looking at her; he doesn't go in. Denise reacts, turning to her cousin. Linda, however, has her back turned. She is busy taking charge in the kitchen as Marty speaks. She takes some pills out of a cupboard and hands them to her mother with a glass of water. The camera moves to Marty, who continues to tell his story, ignoring his wife's outburst, as he walks away from the kitchen doorway into the den. Marty walks over to the piano, where several framed family photographs sit in a line on its top. He picks one up as Denise speaks offscreen in the kitchen. The camera moves back to the kitchen as Denise talks. She is still glaring offscreen at the doorway where Marty stood moments before. She holds the water glass and the pills. Marty is back in the doorway, listening to Denise, getting more and more angry. As he makes a retort, he starts to walk back to the den and his piano. Linda goes back to Denise; she takes the glass of water away. Linda, choosing to ignore Marty's remark, hands her mother a cup of coffee; she puts her mother's hands on the cup. Denise sips her coffee, softly sobbing. Linda, reacting, walks away from the counter and, capping the bottle of pills, puts them back in the cupboard. The camera moves in on Linda's face as she reflects, her voice heard over the screen. The camera leaves Linda's face as she continues to reflect; it moves to the den, to the row of family photos on the piano: one of a present-day Marty and Denise, others where both Denise and Marty are young, beautiful, hopeful. The film cuts back to the kitchen. Denise stands up; Linda takes her coffee cup and sets it on the counter. She puts her arm around Linda's shoulder. Mother and daughter walk out of the kitchen. Denise chuckles. They stop at the entrance to the den. Marty can be seen playing the piano as they continue their conversation. Denise chortles. Linda laughs, touching her mother. They walk over to Marty at the piano. Denise leans over the piano; Linda looks off into the distance, deep in reflection. The piano music continues in the background as the movie cuts to Paul walking along a wharf by the waterfront. The wind blows his hair; he hugs the Edward Estlin Cummings book to his chest."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "She runs into the greenhouse; the scooter drives away. Evan, his back to the camera, walks to the garden gate and opens it to Hannah. Through an archway, Norma can be seen sitting on a beach chair in the sunroom. She wears a jacket over a sundress and scarves; she's sipping. Evan stands in the archway looking at her; he doesn't go in. Norma reacts, turning to her daughter. Hannah, however, has her back turned. She is busy taking charge in the sunroom as Evan speaks. She takes some herbs out of a drawer and hands them to her mother with a jug of juice. The camera moves to Evan, who continues to tell his story, ignoring his wife's outburst, as he walks away from the sunroom archway into the study. Evan walks over to the bookshelf, where several potted plants sit in a line on its top. He picks one up as Norma speaks offscreen in the sunroom. The camera moves back to the sunroom as Norma talks. She is still glaring offscreen at the archway where Evan stood moments before. She holds the juice jug and the herbs. Evan is back in the archway, listening to Norma, getting more and more angry. As he makes a retort, he starts to walk back to the study and his bookshelf. Hannah goes back to Norma; she takes the jug of juice away. Hannah, choosing to ignore Evan's remark, hands her mother a cup of tea; she puts her mother's hands on the cup. Norma sips her tea, softly sobbing. Hannah, reacting, walks away from the side table and, capping the jar of herbs, puts them back in the drawer. The camera moves in on Hannah's face as she reflects, her voice heard over the screen. The camera leaves Hannah's face as she continues to reflect; it moves to the study, to the row of potted plants on the bookshelf: one of a present-day Evan and Norma, others where both Norma and Evan are young, vibrant, hopeful. The film cuts back to the sunroom. Norma stands up; Hannah takes her tea cup and sets it on the side table. She puts her arm around Hannah's shoulder. Mother and daughter walk out of the sunroom. Norma chuckles. They stop at the entrance to the study. Evan can be seen arranging the bookshelf as they continue their conversation. Norma chortles. Hannah laughs, touching her mother. They walk over to Evan at the bookshelf. Norma leans over the bookshelf; Hannah looks off into the distance, deep in reflection. The background noise of a distant radio continues as the movie cuts to Lee walking along a bridge by the riverbank. The wind blows her hair; she hugs the T.S. Eliot book to her chest."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "She skips into the building; the taxi vanishes. Evan, his back to the camera, jogs to the front door and pushes it open for Hannah. Through a doorway, Norma can be seen reclining on a chair in the kitchen. She wears a robe over a slip and stockings; she's singing. Evan lingers in the doorway gazing at her; he doesn’t step inside. Norma reacts, nodding to her daughter. Hannah, however, has her back turned. She is busy inspecting the kitchen as Evan sings. She pulls some pills out of a cupboard and tosses them to her mother with a glass of water. The camera zooms in on Evan, who continues to hum his story, overlooking his wife's excitement, as he skips away from the kitchen doorway into the den. Evan dances over to the piano, where several framed family photographs balance in a line on its top. He dusts one off as Norma mumbles offscreen in the kitchen. The camera returns to the kitchen as Norma whispers. She is still glaring offscreen at the doorway where Evan hovered moments before. She juggles the water glass and the pills. Evan is back in the doorway, observing Norma, growing more and more amused. As he nods in agreement, he starts to skip back to the den and his piano. Hannah returns to Norma; she takes the glass of water away. Hannah, choosing to disregard Evan's comment, offers her mother a cup of coffee; she wraps her mother’s hands around the cup. Norma sips her coffee, quietly chuckling. Hannah, reacting, skips away from the counter and, capping the bottle of pills, places them back in the cupboard. The camera pans in on Hannah's face as she muses, her voice humming over the screen. The camera shifts from Hannah's face as she continues to muse; it glides to the den, to the row of family photos on the piano: one of a present-day Evan and Norma, others where both Norma and Evan are young, radiant, hopeful. The film cuts back to the kitchen. Norma rises; Hannah takes her coffee cup and balances it on the counter. She pats Hannah’s shoulder. Mother and daughter glide out of the kitchen. Norma giggles. They pause at the entrance to the den. Evan can be seen admiring the piano as they prolong their dialogue. Norma chuckles. Hannah smiles, nudging her mother. They glide over to Evan at the piano. Norma bends over the piano; Hannah gazes into the distance, deep in contemplation. The piano music swells in the background as the movie transitions to Lee floating along a wharf by the waterfront. The wind tosses her hair; she cradles the Edward Estlin Cummings book to her chest."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The squirrel scurries into the mushroom; the bicycle rolls away. Oliver, his back to the mailbox, strolls to the apple tree and opens it to Luna. Through a window, Olive can be seen lounging on a sofa in the attic. She wears a jacket over a dress and sneakers; she's knitting. Oliver stands in the window gazing at her; he doesn't enter. Olive reacts, turning to her hamster. Luna, however, has her back turned. She is busy taking charge in the attic as Oliver whispers. She takes some crayons out of a backpack and hands them to her teacher with a bowl of cereal. The clock shifts to Oliver, who continues to share his poem, ignoring his turtle's giggle, as he wanders away from the attic window into the garage. Oliver strolls over to the bicycle, where several framed houseplants line its seat. He picks one up as Olive laughs off-camera in the attic. The telescope swivels back to the attic as Olive giggles. She is still glaring off-camera at the window where Oliver stood moments before. She holds the cereal bowl and the crayons. Oliver is back in the window, listening to Olive, becoming more and more frustrated. As he makes a remark, he starts to march back to the garage and his bicycle. Luna goes back to Olive; she takes the bowl of cereal away. Luna, choosing to overlook Oliver's comment, hands her teacher a mug of tea; she puts her teacher's hands on the mug. Olive sips her tea, quietly humming. Luna, reacting, strolls away from the table and, closing the jar of crayons, places them back in the backpack. The magnifying glass zooms in on Luna's face as she ponders, her voice echoing over the screen. The satellite drifts from Luna's face as she continues to ponder; it floats to the garage, to the line of houseplants on the bicycle: one of a present-day Oliver and Olive, others where both Olive and Oliver are young, smiling, dreaming. The film cuts back to the attic. Olive stands up; Luna takes her tea mug and sets it on the table. She drapes her arm around Luna's shoulder. Teacher and student stroll out of the attic. Olive chuckles. They pause at the entrance to the garage. Oliver can be seen polishing the bicycle as they continue their chat. Olive chortles. Luna giggles, patting her teacher. They move over to Oliver at the bicycle. Olive bends over the bicycle; Luna gazes off into the horizon, lost in thought. The bicycle bell chimes in the background as the movie cuts to Chris strolling along a trail by the meadow. The breeze tousles her coat; she clutches the Walt Whitman journal to her backpack."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "He stumbles into the museum; the bicycle speeds away. Oliver, his side to the audience, skips to the revolving door and pushes it open for Sarah. Through a window, Lisa can be seen reclining on a sofa in the library. She wears a cloak over pajamas and sandals; she's sketching. Oliver hovers in the window peering at her; he doesn't enter. Lisa notices, shifting toward her brother. Sarah, however, has her side turned. She is busy commanding in the library as Oliver narrates. She retrieves some cards from a drawer and offers them to her sister with a mug of tea. The camera pans to Oliver, who continues to relay his tale, disregarding his sister’s interruption, as he skips away from the library window into the lounge. Oliver hops over to the easel, where several framed landscapes sit in a row on its ledge. He lifts one up as Lisa speaks offscreen in the library. The camera cuts back to the library as Lisa speaks. She is still staring offscreen at the window where Oliver lingered moments before. She cradles the tea mug and the cards. Oliver returns to the window, heeding Lisa, growing more and more flustered. As he jests, he starts to stroll back to the lounge and his easel. Sarah returns to Lisa; she retrieves the tea mug. Sarah, opting to ignore Oliver's quip, offers her sister a plate of biscuits; she places her sister’s hands on the plate. Lisa nibbles her biscuit, quietly weeping. Sarah, responding, retreats from the shelf and, closing the container of cards, slips them back in the drawer. The camera zooms in on Sarah's face as she considers, her voice resonating over the scene. The camera shifts from Sarah's face as she continues to ponder; it glides to the lounge, to the array of landscapes on the easel: one of a present-day Oliver and Lisa, others where both Lisa and Oliver are young, radiant, optimistic. The film transitions back to the library. Lisa rises; Sarah collects the biscuit plate and places it on the shelf. She wraps her arm around Sarah’s shoulder. Sister and sibling depart from the library. Lisa giggles. They halt at the entrance to the lounge. Oliver can be seen sketching at the easel as they resume their dialogue. Lisa guffaws. Sarah chuckles, caressing her sister. They approach Oliver at the easel. Lisa leans over the easel; Sarah gazes off into the horizon, lost in contemplation. The sketching continues in the backdrop as the film shifts to Jack strolling along a dock near the marina. The breeze tousles his scarf; he clutches the William Carlos Williams book to his chest."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "She glides into the greenhouse; the bicycle rolls away. Evan, his back to the audience, skips to the front gate and swings it open for Hannah. Through an archway, Norma can be seen reclining on a hammock in the pantry. She wears a cape over a sarong and sandals; she's munching. Evan stands in the archway staring at her; he doesn't step in. Norma reacts, twisting to her daughter. Hannah, however, has her back turned. She is busy orchestrating tasks in the pantry as Evan narrates. She pulls some candies out of a drawer and hands them to her mother with a mug of tea. The camera drifts to Evan, who continues to spin his yarn, overlooking his wife's protest, as he drifts away from the pantry archway into the parlor. Evan strolls over to the guitar, where several unframed family sketches rest in a stack beside it. He picks one up as Norma mutters offscreen in the pantry. The camera shifts back to the pantry as Norma murmurs. She is still glaring offscreen at the archway where Evan stood moments before. She clutches the tea mug and the candies. Evan is back in the archway, hearing Norma, growing more and more frustrated. As he makes a comment, he begins to march back to the parlor and his guitar. Hannah returns to Norma; she retrieves the mug of tea. Hannah, electing to overlook Evan's comment, hands her mother a flask of cocoa; she places her mother's hands on the flask. Norma sips her cocoa, softly weeping. Hannah, reacting, steps away from the island and, sealing the jar of candies, returns them to the drawer. The camera zooms in on Hannah's face as she contemplates, her voice narrating over the screen. The camera pulls away from Hannah's face as she continues her musings; it drifts to the parlor, to the stack of family sketches beside the guitar: one of a present-day Evan and Norma, others where both Norma and Evan are youthful, radiant, optimistic. The film transitions back to the pantry. Norma rises up; Hannah takes her cocoa flask and places it on the island. She puts her arm around Hannah's back. Mother and daughter stroll out of the pantry. Norma giggles. They pause at the entrance to the parlor. Evan can be seen strumming the guitar as they carry on their chit-chat. Norma snickers. Hannah giggles, touching her mother. They wander over to Evan at the guitar. Norma leans over the guitar; Hannah gazes off into the horizon, deep in thought. The guitar melody continues in the backdrop as the film transitions to Lee wandering along a pier by the shoreline. The breeze sways her hair; she cradles the Lewis Carroll book to her torso."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "She hops into the warehouse; the bicycle rolls away. Leo, his back to the forest, skips to the wooden gate and pushes it for Valerie. Through a window, Sherry can be seen reclining on a sofa in the parlor. She wears a jacket over a dress and boots; she's sketching. Leo lingers in the hallway staring at her; he doesn't enter. Sherry reacts, glancing at her neighbor. Valerie, however, has her back turned. She is busy organizing in the parlor as Leo sings. She pulls some candles out of a drawer and passes them to her friend with a mug of tea. The lens shifts to Leo, who continues to narrate his tale, disregarding his friend's remark, as he skips away from the parlor hallway into the library. Leo ambles over to the bookshelf, where several dusty ancient artifacts rest in a sequence on its shelf. He picks one up as Sherry murmurs offstage in the parlor. The lens shifts back to the parlor as Sherry murmurs. She is still glancing offstage at the hallway where Leo stood moments before. She holds the tea mug and the candles. Leo is back in the hallway, hearing Sherry, growing more and more irritated. As he mutters a comeback, he starts to skip back to the library and his bookshelf. Valerie returns to Sherry; she takes the mug of tea away. Valerie, opting to dismiss Leo's comment, gives her friend a bowl of soup; she places her friend's fingers on the bowl. Sherry sips her soup, quietly sniffling. Valerie, reacting, marches away from the table and, sealing the jar of candles, returns them to the drawer. The lens zooms in on Valerie's expression as she ponders, her thoughts heard above the scene. The lens shifts from Valerie's expression as she continues to ponder; it transitions to the library, to the row of ancient artifacts on the bookshelf: one of a current-day Leo and Sherry, others where both Sherry and Leo are young, graceful, dreaming. The reel shifts back to the parlor. Sherry rises; Valerie takes her soup bowl and places it on the table. She places her hand around Valerie's arm. Companion and neighbor stroll out of the parlor. Sherry giggles. They linger at the opening to the library. Leo can be observed strumming the bookshelf as they sustain their discourse. Sherry guffaws. Valerie chuckles, nudging her companion. They stroll over to Leo at the bookshelf. Sherry leans against the bookshelf; Valerie gazes into the horizon, immersed in contemplation. The bookshelf music continues in the distance as the film cuts to Pat strolling along a footpath by the park. The breeze rustles her scarf; she clutches the Jane Austen novel to her chest."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Hannah rushes into the building as the taxi departs. Evan greets her at the door, revealing Norma in a robe, drinking in the kitchen. Evan speaks while Hannah retrieves pills and water for her mother. Despite Norma's outbursts, Evan retreats to the den, examining family photos atop the piano. Norma's anger grows, prompting Evan's retort before he returns to the piano. Hannah takes the water from Norma, offering her coffee instead. Ignoring Evan's remark, Hannah reflects quietly. The movie shifts focus to photographs of Evan and Norma, capturing their younger, hopeful days. Back in the kitchen, Norma stands, and Hannah supports her, sharing a moment before they walk to the den. They find Evan playing the piano, and as they converse, Norma laughs. Hannah joins in, touching her mother's hand, as they stand by Evan. The piano music continues as the scene transitions to Lee, strolling along a breezy wharf, clutching an Edward Estlin Cummings book to her chest."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "she hugs the Edward Estlin Cummings book to her chest The wind blows her hair The piano music continues in the background as the movie cuts to Lee walking along a wharf by the waterfront Hannah looks off into the distance deep in reflection Norma leans over the piano They walk over to Evan at the piano Hannah laughs touching her mother Norma chortles Evan can be seen playing the piano as they continue their conversation They stop at the entrance to the den Norma chuckles Mother and daughter walk out of the kitchen She puts her arm around Hannah's shoulder Hannah takes her coffee cup and sets it on the counter Norma stands up The film cuts back to the kitchen one of a presentday Evan and Norma others where both Norma and Evan are young beautiful hopeful it moves to the den to the row of family photos on the piano The camera leaves Hannah's face as she continues to reflect The camera moves in on Hannah's face as she reflects her voice heard over the screen Hannah reacting walks away from the counter and capping the bottle of pills puts them back in the cupboard Norma sips her coffee softly sobbing she puts her mother's hands on the cup Hannah choosing to ignore Evan's remark hands her mother a cup of coffee she takes the glass of water away Hannah goes back to Norma As he makes a retort he starts to walk back to the den and his piano Evan is back in the doorway listening to Norma getting more and more angry She holds the water glass and the pills She is still glaring offscreen at the doorway where Evan stood moments before The camera moves back to the kitchen as Norma talks He picks one up as Norma speaks offscreen in the kitchen Evan walks over to the piano where several framed family photographs sit in a line on its top The camera moves to Evan who continues to tell his story ignoring his wife's outburst as he walks away from the kitchen doorway into the den She takes some pills out of a cupboard and hands them to her mother with a glass of water She is busy taking charge in the kitchen as Evan speaks Hannah however has her back turned Norma reacts turning to her daughter he does not go in Evan stands in the doorway looking at her she is drinking She wears a robe over a slip and stockings Through a doorway Norma can be seen sitting on a chair in the kitchen Evan his back to the camera walks to the front door and opens it to Hannah the taxi drives away She runs into the building"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Evan is back in the doorway listening to Norma getting more and more angry she takes the glass of water away it moves to the den to the row of family photos on the piano She is busy taking charge in the kitchen as Evan speaks she puts her mother's hands on the cup Hannah however has her back turned one of a presentday Evan and Norma others where both Norma and Evan are young beautiful hopeful She puts her arm around Hannah's shoulder The camera moves to Evan who continues to tell his story ignoring his wife's outburst as he walks away from the kitchen doorway into the den Through a doorway Norma can be seen sitting on a chair in the kitchen Evan can be seen playing the piano as they continue their conversation She wears a robe over a slip and stockings Norma leans over the piano Hannah reacting walks away from the counter and capping the bottle of pills puts them back in the cupboard She takes some pills out of a cupboard and hands them to her mother with a glass of water Hannah takes her coffee cup and sets it on the counter Norma chuckles Hannah laughs touching her mother she hugs the Edward Estlin Cummings book to her chest The film cuts back to the kitchen Norma stands up The camera moves in on Hannah's face as she reflects her voice heard over the screen Norma sips her coffee softly sobbing Hannah goes back to Norma Hannah choosing to ignore Evan's remark hands her mother a cup of coffee Norma chortles Hannah looks off into the distance deep in reflection She runs into the building As he makes a retort he starts to walk back to the den and his piano She is still glaring offscreen at the doorway where Evan stood moments before The wind blows her hair Evan walks over to the piano where several framed family photographs sit in a line on its top They stop at the entrance to the den The piano music continues in the background as the movie cuts to Lee walking along a wharf by the waterfront Evan his back to the camera walks to the front door and opens it to Hannah The camera leaves Hannah's face as she continues to reflect she is drinking Mother and daughter walk out of the kitchen Evan stands in the doorway looking at her Norma reacts turning to her daughter He picks one up as Norma speaks offscreen in the kitchen The camera moves back to the kitchen as Norma talks She holds the water glass and the pills the taxi drives away he does not go in They walk over to Evan at the piano"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "she puts her mother's hands on the cup Norma sips her coffee softly sobbing Hannah reacting walks away from the counter and capping the bottle of pills puts them back in the cupboard The camera moves in on Hannah's face as she reflects her voice heard over the screen The camera leaves Hannah's face as she continues to reflect it moves to the den to the row of family photos on the piano one of a presentday Evan and Norma others where both Norma and Evan are young beautiful hopeful The film cuts back to the kitchen Norma stands up Hannah takes her coffee cup and sets it on the counter She puts her arm around Hannah's shoulder Mother and daughter walk out of the kitchen Norma chuckles They stop at the entrance to the den Evan can be seen playing the piano as they continue their conversation Norma chortles Hannah laughs touching her mother They walk over to Evan at the piano Norma leans over the piano Hannah looks off into the distance deep in reflection The piano music continues in the background as the movie cuts to Lee walking along a wharf by the waterfront The wind blows her hair she hugs the Edward Estlin Cummings book to her chest She runs into the building the taxi drives away Evan his back to the camera walks to the front door and opens it to Hannah Through a doorway Norma can be seen sitting on a chair in the kitchen She wears a robe over a slip and stockings she is drinking Evan stands in the doorway looking at her he does not go in Norma reacts turning to her daughter Hannah however has her back turned She is busy taking charge in the kitchen as Evan speaks She takes some pills out of a cupboard and hands them to her mother with a glass of water The camera moves to Evan who continues to tell his story ignoring his wife's outburst as he walks away from the kitchen doorway into the den Evan walks over to the piano where several framed family photographs sit in a line on its top He picks one up as Norma speaks offscreen in the kitchen The camera moves back to the kitchen as Norma talks She is still glaring offscreen at the doorway where Evan stood moments before She holds the water glass and the pills Evan is back in the doorway listening to Norma getting more and more angry As he makes a retort he starts to walk back to the den and his piano Hannah goes back to Norma she takes the glass of water away Hannah choosing to ignore Evan's remark hands her mother a cup of coffee"
        }
      ]
    }
  ]
}